[
 {
  "name": "Delaware State Police Museum",
  "address": "1425 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/078c37ae-9330-11ea-9246-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "history",
   "free"
  ],
  "link": "https://maps.google.com/?cid=6897494027399392406",
  "source": "GoogleMaps",
  "reviews": [
   "Our son is very interested in law enforcement and this was a cool place to visit. You don't need a lot of time to go through the exhibits. It's free to get in and the kids had fun exploring the different parts of the museum. It has about 2 large rooms housing various police equipment and paraphernalia from decades past. The bonus was that it's only 15 min from the Air Mobility Command Museum so we did both I'm one day.",
   "An excellent history of Deleware State Troopers.  All sorts of equipment uniforms guns and even vehicles.  Well laid out and includes some interactive displays",
   "What a wonderful tribute to our Delaware State Troopers. The museum is outstanding. Everyone should spend some time there and thank our police for their  dedication.",
   "This museum is free and definitely worth the visit. Some of the interactive items are broken, but it doesn't take away from the allure.",
   "This was great place to visit. Very interesting. We had lots if fun"
  ]
 },
 {
  "name": "Dover International Speedway",
  "address": "1131 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/07d41670-9330-11ea-a01e-14b31f159f22.png",
  "tags": [
   "tour",
   "drink",
   "food",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=451646517805921927",
  "source": "GoogleMaps",
  "reviews": [
   "Went for a private tour on a rainy Monday morning. Wasn't expecting much but boy I was wrong! We had a blast. Our tour guide told us in great detail the story of the speedway, he showed us the different areas and even took us for a lap on the track in his own car, we also walked part of the track and saw the high angle that thing has. We also went to the media room and saw how everything there works on race day. If you love Nascar or car racing in general this is a must.",
   "Drinks and food 2 expensive.  Mainly the band club. Lower the drink prices. The patrons will get out of there gambling chair and watch the entertainment. Food is awesome but the casino ask the restaurants the pay to much in rental fees. My understanding is greed. Spend more as a patron and pay more as a food service along with any business who wants business in there casino. Just because you provide a service in a casino. Dont give the casinos the right to charge more outrageous rental space to the food beverage and other businesses providers. You attract more businesses if you keep prices fair. But casinos are all about gr÷ed. The division sign is to prove is it worth it.",
   "Not every pull of the lever leads to a win. I enjoyed this \"play place \". Very well lit. It didn't feel like they tried to cram as many machines and people as they could in there. AND I took my money back home with me! WINNING!!",
   "Had a fun time there and stayed in a room for the evening.  Nice accommodations.  Big selection of slots. Going again this month for my anniversary.  Wish me luck 👌",
   "This speedway is pretty fantastic and will make for an awesome day of NASCAR. The parking is expansive and yes, you may need to walk a distance, but it’s worth it. For an event, there usually are food trucks and activities for customers. The stadium seating is like any other, so if you suffer from back pain, I would bring a cushion. The bathrooms are well maintained."
  ]
 },
 {
  "name": "Air Mobility Command Museum",
  "address": "1301 Heritage Rd, Dover AFB, DE 19902, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0811bbd0-9330-11ea-aa0b-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "history",
   "history",
   "historic",
   "family",
   "history",
   "learn",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=18347851976390762217",
  "source": "GoogleMaps",
  "reviews": [
   "My boyfriend and I have been wanting to come here for awhile.  For our Valentine's weekend I planned the trip and didn't tell him.  When we got there,  we both were so excited as we both love planes.  We enjoyed the museum greatly!  It was amazing to think that we were in planes that were used so long ago.  The history and knowledge were incredible.  ED R. was our tour guide and he was excellent (and funny).  This was one of the greatest adventures we've done and it was FREE! We can't wait to go back to see more!",
   "I went here for father’s day as my dad loves aviation history. There is an inside and outside part to the museum, both offering large collections of planes to look at. Inside, a guide kindly let us into one of the planes and taught us about the history of the plane as well as it’s role in the war and how it came to the museum. Outside, there are several planes that you can go in and explore. Easy day trip if you’re in the area!",
   "What a small but mighty gem! The volunteers are just as much a part of the museum as the dozens of historic planes. They live and love the work they do and so many of them are veterans with a passion to share stories. The personnel of their own accord kindly showed me and a friend around the place and through different planes, answering questions expertly. \n\nThe curators left finges of sass and humor throughout that really just makes an enjoyable experience. It was very worth the two-hour drive from DC/NOVA and I would love to come back on their monthly Saturday event where all 40+ planes are opened to enter!",
   "LOVED coming here. Kevin really made our visit special and took us round lots of planes, including photos and detailed accounts of the history of some of the planes there. There's an impressive array of sites, as well as simulators! \nDefinitely plan on returning with more time and family. Thank you Kevin!",
   "Great place to go for families to learn about our history. Our four kids loved all of the airplanes and interactive stations. They especially loved the flight simulator where they got to land an airplane themselves and \"earn their wings\" sticker 😁👍"
  ]
 },
 {
  "name": "Delaware Agricultural Museum",
  "address": "866 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0858d70c-9330-11ea-b4cd-14b31f159f22.png",
  "tags": [
   "history",
   "kids",
   "historic",
   "historic",
   "history",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=18313459315246594429",
  "source": "GoogleMaps",
  "reviews": [
   "Nice little museum highlighting Delaware's agricultural history. Run by caring people and volunteers. I was there for A Farmer's Christmas,  an annual event. If you're wanting bright, shiny and upscale, this isn't that type of place. But if you're interested in learning about the agricultural  history of the state, this is a wonderful place to visit. The displays and facilities are carefully and thoughtfully maintained by dedicated staff and volunteers. This museum is small town America at best.",
   "Nice place to go spend a Summer day to keep the kids occupied.  There is not a lot of stuff they can touch and play with inside so depending on how young your kids are, it might not be ideal.  My girls loved feeding the pig who is super social and calm.  You also can actually go into the chickens little fenced in coop area and feed them as well.  My daughter ended up with chicken poop all over her but it made for a nice laugh after her brief meltdown lol.  The woman who was working there was SUPER nice.  The school house bell is fun to ring for the kids too.  They enjoy exploring the historic village outside.",
   "Excellent museum showing early farm life in Delaware.   Includes some historic buildings that have been brought to the property.  Lots of history of local folks who helped Delaware to grow and prosper.",
   "Bought back a lot of fun memories.  Watching my Uncle  Jim and his family working on their farms as a child in up State New York.  Learned about more of the process I didn't know about as well\n  Very friendly help full staff",
   "Wonderful place to visit. A lot of history"
  ]
 },
 {
  "name": "John Dickinson Plantation",
  "address": "340 Kitts Hummock Rd, Dover, DE 19901, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/089cbe36-9330-11ea-b545-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "tour",
   "free",
   "knowledgeable",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2206850865865252162",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I took their tour on 2/19/20.  John Dickinson was a fascinating, impressive and extremely accomplished man.  He is well worth learning about.  The house and grounds are so interesting.  We love learning about peoples' everyday lives from that period.  Our guide, Chris, was knowledgeable and interesting.  He welcomed all our questions (and we had  many).  He answered all of them and we learned so much.  The video beforehand was quite useful.   The ladies at the Welcome Center were also full of information about John Dickinson and his life.",
   "I grew up in Delaware but had never been here for a tour.  It was an awesome tour.  The tour guides were terrific especially young Tyler.",
   "Been there twice. Once with school and the other time with my fiancée. It is free and they do accept donations. It is beautiful. Mostly all the info is correct. They do events.",
   "The guides were very knowledgeable and wonderful.  However i wish they would recomend an age that children should be to enjoy things like this.  The children were very behaved but pretty much board to death.",
   "Immerse in Delaware and American history while visiting this well preserved plantation. The whole visit with the house tour doesn't take more than an hour and a half. Definitely watch the video in the barn."
  ]
 },
 {
  "name": "Johnson Victrola Museum",
  "address": "375 S New St, Dover, DE 19901, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/08dfe1ec-9330-11ea-af8b-14b31f159f22.png",
  "tags": [
   "free",
   "knowledgeable",
   "history"
  ],
  "link": "https://maps.google.com/?cid=4758626086912666024",
  "source": "GoogleMaps",
  "reviews": [
   "Very interesting, free museum in Dover. Full of some incredible old phonographs and some very helpful and insightful staff members. Definitely worth a stop and it doesn't take long to see all it has to offer. Ask for a demonstration of some of the machines, you won't regret it!",
   "Guides were very friendly and knowledgeable and would answer questions with enthusiasm. We very much enjoyed are vist.",
   "This place is amazing. To have all of those old Victrolas, and records, that are over 100 years old, and it all still work, simply amazing. What really blew my mind was how that 100+ yo record sounded as good as anything in this digital age, stunning! You have really got to stop and visit this place.",
   "This was such a fantastic museum, and I'd have to say the best \"museum\" experience I've had in a long time! The guide gave lots of extra information and stories compared to if I had gone through the museum on my own. She played some records on some of the older pieces they had, and it was enchanting. I'd go back in a heart beat!",
   "Awesome victrola history! Outgoing staff. Could not give 5 stars because there is no elevator/ ramp to reach the 2nd floor 🤔😣"
  ]
 },
 {
  "name": "The Old State House",
  "address": "25 The Green, Dover, DE 19901, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0924b352-9330-11ea-858c-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "tour",
   "history",
   "walk",
   "tour",
   "art",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=12914818723517991099",
  "source": "GoogleMaps",
  "reviews": [
   "This is a tremendously interesting historical building. The fantastic tour guides were full of knowledge and resources. We really came away with a fantastic appreciation for the historical value that the old state house is in its current state as a museum. From the realistic displays to the replica setup. It was a fabulous experience for the entire group of people that we were traveling with.",
   "This place is worth visiting. It is maintained very well. A lot of history to be seen.",
   "This is a beautiful building.  The staff were very friendly and gave a great tour.",
   "Great little building full of history and both the guides were excellent, providing details and stories",
   "Stopped in for a tour and was so impressed by the young woman who gave us a tour! The building itself is magnificent, but the enthusiasm and knowledgeability of the tour guide made the experience so incredible. Tours are offered on demand as soon as you walk in, so no need to schedule a time or come in on the hour (however, the walking tour, which is separate from the state house tour, leaves on the hour). Overall I had a great time here and would recommend it to anyone! (No public restrooms in the building, but there is one available nearby at the art museum. Plenty is parking available both in front of the state house itself and on the side streets nearby.)"
  ]
 },
 {
  "name": "Biggs Museum of American Art",
  "address": "406 Federal St, Dover, DE 19901, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0973e4f4-9330-11ea-9ab9-14b31f159f22.png",
  "tags": [
   "free",
   "wander",
   "free",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=16109887887983301662",
  "source": "GoogleMaps",
  "reviews": [
   "It is a pretty small museum and there isn't much to see there.  It has a nice layout.  It will take less than an hour to go through all 3 floors.",
   "I had never heard of this place, but when my colleague suggested, I had to go\n My husband and I took a Saturday to wander around a couple of museums in Dover. By far, the Biggs Museum was our favorite.  There was an Audobon exhibit when we were there along with pagers from children's books. I intend to go back soon. The exhibits change often. I'm not sure of the entrance price as I got us a Groupon, but didn't need it. Pro tip: The first Saturday of every month is free",
   "Nice little local museum. Sometimes they have really interesting rotating exhibits too. The first Saturday of the month is always free too, which is nice.",
   "This is a great place to see historical relics of the area as well as modern artists.",
   "An absolute gem of a museum in the heart of Dover. I became a member shortly after moving to the Dover area and am extremely pleased by the first class presentations at this modestly sized museum. The staff are extremely knowledgeable and I am amazed at the range of exhibits that they put on throughout the year. I particularly enjoy the exhibitions with local artists."
  ]
 },
 {
  "name": "Silver Lake Park",
  "address": "Washington St, Dover, DE 19901, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/09c7be6e-9330-11ea-bbed-14b31f159f22.png",
  "tags": [
   "family",
   "family",
   "walk",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12794748408621415746",
  "source": "GoogleMaps",
  "reviews": [
   "Still my favorite place to visit. As a child we could swim in the lake but there was more sand and lots of swings. Things have changed; absolutely swimming, the swings that made you feel like you were going into the lake are no longer there, and no life guard stands but it was still nice to revisit my childhood playground. The picnic tables are still there!",
   "Great spot to spend a day with family or friends.\nA good source of fish brings predators here and we saw Bald Eagle , seagull .",
   "Great place to picnic, fish and if they ever open up the beach for swimming again that would even be better, the water even was actually pretty clean!! The family had a great time!!",
   "It was nice and quiet to take my dog for a walk. For as hot as it's been, the dog park had quite a few people walking their furry babies too.",
   "Always a wonderful place to unwine,  people watch, bird watch , duck an geese watch an to take your dogs for a walk. Very relaxing an safe. You can even have a picnic,  go fishing or play volleyball ball."
  ]
 },
 {
  "name": "Spence's Bazaar & Auction",
  "address": "550 S New St, Dover, DE 19904, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0a1a4b86-9330-11ea-91a6-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=6311401838853273930",
  "source": "GoogleMaps",
  "reviews": [
   "Great experience! My partner loves going and bidding on on new treasures from others junk! Lol. The bids are reasonable. You don't have to be rich to join in on the fun. He got this little exercise trampoline (minus the dog) along w other stuff for $5 or $6. Auction starts at 12:30 pm on days they're open. Go and have good time! Oh, the food is awesome also. Amish is mainly vendors that sell it and they know what they're doing! There's also shopping in the back. Anything from clothes to personal hygiene products for reasonable prices.",
   "Super crowded and busy, but it is expected when you visit during lunch time. The pretzel booth is definitely a must-try. There's  plenty of homemade goods. Most of the items are sold and made by either Amish people or Mennonites. You will see most with thwir traditional garments as they cook and sell their items.",
   "Same as it was when I came 35 years ago. I call them the original amazon. Great deals you can catch some very good merchandise during the auction. If you need some quick cash minus all the Haggling bring your treasures log them with office  and let Spencers sell all your stuff. 2 hours later come collect your cash. Also the Farmers market has some awesome food. Homemade Ice cream cakes and pies. Hot food made by Amish very good.\nNice outing Tuesday Friday auction days",
   "Spence's Bazaar has been a WONDERFUL place to visit FOR MORE YEARS THAN I CAN COUNT!!!  I sojourn there as often as I possibly can!  \n\nThe Amish foods (donuts, meats, ice creams, desserts, candies, etc., etc.,) are SUPER EXCELLENT ~ as expected!!!  \n\nI've  purchased more foods, fruits, vegetables; tomato/pepper plants; fresh, LARGE strawberries; jewelry, hair jewelry/items; clothing and shoes [new and used]; comforters, ALTOGETHER CAPTIVATING blankets and SO, SO, SO MANY OTHER NOVELTY ITEMS at Spence's Bazaar than I can possibly EVER COUNT! \n\nEveryone should visit Spence's.  Just ONE TRIP to that place and you'll be captivated for life.  My hubby and I went there when we were just married 38 years ago, and we've remained faithful, loyal patrons ever since. We've known some of the vendors for many, many years (and some of them are truly WONDERFUL, AMAZING, AWESOME PEOPLE).  \n\nIt was burned down by some arsonist juveniles a number of years ago and the owners were uncertain of rebuilding; however, the merchants of Dover, DE, (possibly some of the vendors themselves《?》) and/or citizens got together and decided that THIS PLACE was too important ~ REPEAT, TOO CRITICAL TO LOSE, so they got together and it was rebuilt (Who did it exactly?  I do NOT KNOW).  I won't presume and/or pretend that I do!\n\nThere are many different vendors who rely on sales from Spence's. Those of us who are clients rely on it/them as well.  What an AWESOME PLACE TO VISIT!!! I highly recommend it to EVERYONE.  It's truly phenomenal.",
   "Very crowded at lunch time. Breakfast seems to be the favorite. The baked goods are delicious and so are the pretzels. Some places take cash only so hit the ATM to be safe before going."
  ]
 },
 {
  "name": "First State Heritage Park's John Bell House",
  "address": "43 The Green, Dover, DE 19901, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0a5dbd40-9330-11ea-b673-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "history",
   "walking",
   "learn",
   "historic",
   "history",
   "free",
   "walking",
   "tour",
   "knowledgeable",
   "history",
   "historic",
   "knowledgeable",
   "free",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=14623948480656306799",
  "source": "GoogleMaps",
  "reviews": [
   "A great free walking tour about the history of the Green & Dover. The interpreter was wearing colonial clothing. The tour is less than a hour",
   "Need to come to on the 1st Saturday of every month. You learn so much",
   "This is the place you go to for a free guided tour of the Dover historic district. The guides dress in 18th century (?) garb and they take you out on a 45 minute walking tour of the square. \n\nOur guide (I believe her name was Anne?) was amazing! The whole tour was very captivating and it was evident that our guide was very passionate about Delaware history. We went there on a Wednesday afternoon, and my wife and I were there only ones there. The whole tour is wheelchair accessible, although, you have to be careful at certain points due to uneven surfaces.\n\nOn the whole, I would strongly recommend taking the tour. Learnt a lot about Delaware history in those 45 minutes.",
   "What a great piece of Delaware history. The staff was so nice and knowledgeable!",
   "Had a free tour of historic Dover that left from the Bell house. Guide was awesome and very knowledgeable. Highly recommend it"
  ]
 },
 {
  "name": "Brecknock County Park",
  "address": "80 Old Camden Rd, Camden, DE 19934, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0aac2ba2-9330-11ea-9eab-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walking",
   "walk",
   "kids",
   "knowledgeable",
   "walking",
   "walk",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5076349897654511547",
  "source": "GoogleMaps",
  "reviews": [
   "Great amenities such as a huge playground for the kiddies and nicely appointed horseshoe pits. Really nice walking trail (1 mile loop) good for the pups. \nIf you do walk your dog here, please be considerate and clean up behind your furry friend. Trail is frequented by families with kids and nobody wants to be dodging dog mess as you go. Enjoy this nice, clean park.",
   "Possibly the best park in the Dover area. Great place to kick back with the kids, or let them run wild and still have good vision from most areas. The picnic area is adequate and clean. The location has public restrooms that are usually clean. The walk path is amazing.",
   "Very nice walking path through the woods and perimeter of park. Very nice Naturist Center with knowledgeable and personable Staff.",
   "I walk here usually once a week after my yoga and gym workout at the YMCA. I love to experience the different seasons from fall winter and summer and the wildlife that is along the trails. Always friendly people walking. Young people jogging and people walking their dogs. A good place to unwind",
   "Great park to exercise in or take the child to play in.  Only downside is,  the 1 mile path isn't blacktop for those who wanna run.  But otherwise, great exercise and fun place for the kids"
  ]
 },
 {
  "name": "First State Heritage Park",
  "address": "102 S State St, Dover, DE 19901, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0b03c1b0-9330-11ea-9fd6-14b31f159f22.png",
  "tags": [
   "tour"
  ],
  "link": "https://maps.google.com/?cid=9867592794425325697",
  "source": "GoogleMaps",
  "reviews": [
   "Great historical tours.",
   "Very nice tour. Well kept.",
   "",
   "",
   ""
  ]
 },
 {
  "name": "Schutte Park",
  "address": "10 Electric Ave, Dover, DE 19904, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0b4bfa48-9330-11ea-a8d3-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walking",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=13602494927120952366",
  "source": "GoogleMaps",
  "reviews": [
   "Great Park very quiet kids were able to run around and play and enjoy themselves without having to bump into 3 million children it was nice to be able to enjoy the weather and watch the kids have lots of fun we were able to walk through the trails in the back without it being all wet really great small park for when you want to spend quality time with your kids",
   "Large beautiful( good for football an baseball) picnic  tables available,  good walking trails, friendly environment  an bathroom available both inside Recreation center an outdoor",
   "Two large playscapes. One for older kids 5+ and one for younger kids. I didnt explore much outside the playground area. Everything looked clean and well maintained.",
   "Volunteered for the veterans stand down and being a veteran myself I also enjoyed the booths.  Had an opportunity to explore the area and I will go back.  Taking the grandkids next time as the playground is huge and walking areas are beautiful.",
   "A Nice Place 2 Fly!"
  ]
 },
 {
  "name": "Woodburn: Governor's House",
  "address": "151 Kings Hwy SW, Dover, DE 19901, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0ba11f66-9330-11ea-ba9b-14b31f159f22.png",
  "tags": [
   "walk",
   "historic",
   "food",
   "tour",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7464280053914959200",
  "source": "GoogleMaps",
  "reviews": [
   "The most interesting thing about the Governor's Mansion is the fact that it is so accessible! If the governor is not present, you can walk by the house and in the governor's gardens. The perks to living in such a small state. \n\nThe mansion itself is in Georgian style, and it is so inconspicuous that unless there was a sign that said \"Governor's Mansion,\" you would probably just assume that it was a cool old house. The Mansion is on the National Register of Historic Places, so drive by, snap a picture, and see if you can stroll by the gardens.",
   "Food is good, price is great an the place has a relaxing feel of spring time",
   "I e-mailed twice inquiring about a tour. No response. I show up in person during the posted open hours and it's closed up. 3 employees outside completely ignored me. Very disappointing. The gardens are lovely, though.",
   "Beautiful from the outside never been inside though",
   "This place is really beautiful you really have to go walk through and see it"
  ]
 },
 {
  "name": "Bombay Hook National Wildlife Refuge",
  "address": "2591 Whitehall Neck Rd, Smyrna, DE 19977, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0bf72ee2-9330-11ea-8dde-14b31f159f22.png",
  "tags": [
   "nature",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3549814940180475065",
  "source": "GoogleMaps",
  "reviews": [
   "Great area to observe migrating shorebirds ducks and geese.  This is mainly a driving refuge with only limited hiking available.  A nice reception building with small exhibits and clean bathrooms.  Easy to navigate on the roads.  A definitely great place for birdwatchers and anyone who enjoys wildlife.  When I visited years ago in November flocks of thousands of snow geese would impress anyone.",
   "Beautiful! Peaceful! We were too early in the season to watch migratory fowl but we did see some geese and ducks nonetheless.  Ruts on the wildlife drive but we saw that BH is getting ready to mitigate that situation. Should be absolutely gorgeous in a couple of weeks.",
   "A great place to see native and migratory bird species. Herons, egrets, goldfinch, indigo bunting, geese, terns, and even a red fox makes the rounds and poses for pics. Yes, during summer there are lots of biting flies but around August they start to die down. We wear long sleeves and a hat to step out of the car and snap photos. Very friendly people here that are usually happy to discuss birding and sharing photos.",
   "This place is a Delaware treasure. Great education center and beautiful trails for walking and observing nature in every season.",
   "What a diverse and beautiful natural place untouched pretty much invasives.Giant Highland Blueberry bushes , Exspansive Clethra stands etc etc...tons of migratory water birds and beavers , yes beavers"
  ]
 },
 {
  "name": "Tidbury Park",
  "address": "Dover, DE 19901, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0c46ef12-9330-11ea-adb0-14b31f159f22.png",
  "tags": [
   "eat"
  ],
  "link": "https://maps.google.com/?cid=18341385642510395979",
  "source": "GoogleMaps",
  "reviews": [
   "Nice and quiet. My four legged baby enjoys his walks on the little trails. The only downside...is all the mosquitoes . Other than that it's The place to take your four legged babies.",
   "Beautiful park even in a winter!",
   "Lots of bugs. But hey its summer time comes with the territory. Play ground is alright.",
   "Too buggy. The bugs will eat you alive. I won't bring any dogs to this park, We got bugs bite. It good this park is hidden. The trail and water is pretty.",
   "Great place to take your dogs to play and explore. Nice walking/jogging paths."
  ]
 },
 {
  "name": "Delaware Public Archives",
  "address": "121 M.L.K. Jr Blvd N, Dover, DE 19901, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0c9fb38c-9330-11ea-b86f-14b31f159f22.png",
  "tags": [
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15083861667805016230",
  "source": "GoogleMaps",
  "reviews": [
   "Look like they have a big close room that you can research but you have to ask a worker to open it for you. They do have a small exhibit and it was WW2 when I went there",
   "This is a must see!",
   "One of the best repositories to do research. The staff is kind and helpful. It's easily accessible by DART 301, if traveling from Wilmington.",
   "I have been very happy with the help that the Delaware Public Archives has provided on several occasions.",
   "Everyone is very friendly and willing to help when  problems occur.  I wish I  would have investigated my family history sooner.  Thank you."
  ]
 },
 {
  "name": "Dover Park",
  "address": "1210 White Oak Rd, Dover, DE 19901, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0cf5cf74-9330-11ea-91b4-14b31f159f22.png",
  "tags": [
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=13429048648872700170",
  "source": "GoogleMaps",
  "reviews": [
   "Such a shame what a few people who either  have a lack of empathy for others or apathetic in general, did to this place.",
   "Very nice park. \n\nDisc golf course is very short but there are some challenging lanes you must hit. Definitely fun for a quick game of you are passing through",
   "Hidden gem! the basketball and tennis courts are great.",
   "Beautiful and quaint place to walk",
   "Best place to walk my dog peacefully."
  ]
 },
 {
  "name": "3 Palms Zoo & Education Center",
  "address": "1060 Vandyke Greenspring Rd, Townsend, DE 19734, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0d48ab48-9330-11ea-8e59-14b31f159f22.png",
  "tags": [
   "walk",
   "knowledgeable",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9592351982443169772",
  "source": "GoogleMaps",
  "reviews": [
   "More relaxed experience offering a closer look at the animals. Nice place with helpful friendly staff.\nFun day trip for children & adults.",
   "This was our first time visiting the zoo since they relocated.  The layout is incredibly easy to navigate. The workers there were amazing.  They informed us before they fed the pelicans and took a tortoise out of its enclosure so my 5 year-old and I could watch and pet it.  I also learned so much from Dan about the animals.\nWhen my daughter asked to pet one of the snakes, the gentleman stopped what he was doing to go and get a snake for her.  It was a great time and we are already talking about going back.",
   "It may have changed in the past two years, but when we went there it was dumpy. Their parking area had a srterp drop off so when I pulled out of the lot slowly it tore up the front end of my vehicle. I like people rescuing animals, but the place was advertised as being well kept and at the time of our visit it was not. We had driven about an hour and a half and it was not worth it.",
   "Very clean and nice place to walk around and spend a couple hours. They have plenty of animals and reptiles to see. Employees are very helpful, nice, and knowledgeable. I will glady come back to visit again!",
   "Wonderfully inexpensive place to bring your family!  Great alternative to a traditional zoo"
  ]
 },
 {
  "name": "Killens Pond Water Park",
  "address": "5025 Killens Pond Rd, Felton, DE 19943, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0d98ed92-9330-11ea-9cd3-14b31f159f22.png",
  "tags": [
   "parks",
   "walk",
   "kids",
   "family",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=877178490548669136",
  "source": "GoogleMaps",
  "reviews": [
   "Reasonable priced so much cheaper than other water parks. They have umbrellas and lounges  to lay in under tarp- it was hot that day water was nice. What's nice too you can bring in your own cooler. It turned out to be a great day !",
   "My kids and I love this park.  There are great slides, the kids love the lily pad walk, toddler pool with mini slides... It's great.  The entry fee is minimal, as of today, $10 for parents, $8 for kids.  I do wish the bathrooms/showers were a little cleaner, or they had some dry stalls just for changing.  The lifeguards pay attention, and they are great as well.  Excellent, cost efficient way to beat the heat and have a blast with your family!  I will have to add pics later.",
   "Wonderful place for big family gatherings, pinics, BBQ's or just a quick get away",
   "Small but very good  water park ......",
   "Four very different water slides. Green and yellow slides are so steep and fast that they make you feel like you are on a roller coaster. Blue is nice for beginners and orange seems to be the most popular. Great kids area and places to swim or just watch too! Loved it!"
  ]
 },
 {
  "name": "Dover Downs Hotel & Casino",
  "address": "1131 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0de3163a-9330-11ea-acb1-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=5848682176640099828",
  "source": "GoogleMaps",
  "reviews": [
   "Lost some money but still fun.",
   "Great casino to go to",
   "Has a good time mom enjoyed herself",
   "I am really impressed by Dover Downs Casino. The casino is clean and stylish, with a Las Vegas feel. Security is present but not in your face, so I feel safe but not intimidated. There are plenty of slots in good working order, not like some casinos​. I definitely will be returning soon.",
   "Love this place!! Great food! Dancing, bars, night life, gambling!! Poker room is awesome, great tournaments, awesome selection of slot machine as well!!"
  ]
 },
 {
  "name": "DE Turf Sports Complex",
  "address": "4000 Bay Rd, Milford, DE 19963, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0e229b80-9330-11ea-83cb-14b31f159f22.png",
  "tags": [
   "field",
   "field"
  ],
  "link": "https://maps.google.com/?cid=8407910503497379552",
  "source": "GoogleMaps",
  "reviews": [
   "Paid parking?  Us parents pay enough for club fees, uniforms, trainers, hotels, fuel, tolls...now parking too?  There are better ways to bring in revenue other than this.  Besides, the complex is in the middle of nowhere with no real amenities around.  Should have been built much further North.  Yes nice fields, but paid parking?  Come on.",
   "Easy access, convenient parking if you us Parkmobile App, excellent playing field, signage could be better...to locate different playing fields.",
   "This is a really nice, new turf complex with some essential amenities (bathrooms and snack bars), but there's not a whole lot else around it, and when all fields are in use, parking can be limited. On top of that, there's a parking fee ($10 per day plus a $0.50 convenience fee). I've never before had to pay a parking fee for a youth soccer event. It doesn't exactly dispel the notion that youth sports are all about making money.",
   "Top Notch facility. I have been to lots of places for tournaments and this is the best so far. 12 turf fields with plenty of grassy areas nearby each field for team warmups and teams to set up tents. Wide sidewalks connect access to all fields and parking was fairly easy. Multiple concession stands throughout with restrooms and working water fountains at each one. There are also plenty of trees planted around sidewalk and  end fields to provide shade. There is also a picnic sheltering the center area. Any other turf filled facilities should come here to see how it should be done.",
   "This has been the best tournament venue I have ever experienced!"
  ]
 },
 {
  "name": "DuPont Nature Center",
  "address": "2992 Lighthouse Rd, Milford, DE 19963, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0e88bab8-9330-11ea-8c3d-14b31f159f22.png",
  "tags": [
   "free",
   "kids",
   "learn",
   "free"
  ],
  "link": "https://maps.google.com/?cid=6561710995307866997",
  "source": "GoogleMaps",
  "reviews": [
   "What an amazing place! So much wildlife! The guide gave us lots of really helpful information. She said the best time to see horseshoe crabs was in May so we will definitely be going back to find out! Never tire of Delaware! Anyone willing to loan me a house so I can live there?",
   "A nice place to visit.  Well off the beaten path.  If your able to the beach you can see many Horseshoe Crabs.  If they are turned over on their back and still alive turn them over and set them free...",
   "A little out of the way, but a nice place. Small building, but the space is used well and the staff was kind and very knowledgable. Had a great conversation with them. I wish their website had more information regarding events and such. Overall, a nice experience for our kids.",
   "Absolutely stunning, informative, beautiful, and good for all ages and handicapped accessible. And .... FREE! While I was there many bird-watchers with expensive long-lensed cameras invited me to have a look. Inside the science center there was many live creatures to see and learn about. A must see",
   "Great place to go watch osprey, eagles, shore birds, or any other bird that may be local or migrating."
  ]
 },
 {
  "name": "Mispillion River Brewing",
  "address": "255 Mullett Run St, Milford, DE 19963, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0ed09866-9330-11ea-851a-14b31f159f22.png",
  "tags": [
   "creative",
   "kids",
   "brewery"
  ],
  "link": "https://maps.google.com/?cid=3556980550842187220",
  "source": "GoogleMaps",
  "reviews": [
   "Phenomenal local bar and creative brews all the time. Nice interior and love the Trivia nights on Mondays. Always recommending this place to friends",
   "Stopped by on a Sunday afternoon on my way back from a road trip with my kids as I was checking Google Maps for breweries in the area. The atmosphere was welcoming and there's a lot to look at in their small taproom. The kids had fun playing the Wii they have hooked up, while I did a few flights to sample the creativity. They had a handful of IPAs on tap. Pineapple Express was great. Try War Llama if they have it on tap. This was a sweet sour beer with a light green hue.",
   "What a GREAT selection of Fantastic  beers, Great atmosphere.",
   "Was looking for somewhere to stop on the way from Ocean City MD to NJ and decided to stop here after visiting Dogfish. Atmosphere was great, and the employees were very helpful. The beer was awesome, and they even had cold brew coffee, which was also very good. Will definitely stop back any time I'm in the area.",
   "Great brewery with great beer for every pallet . Good to find one that isn't 90% IPA based. Tammy was great and my girlfriend and I could have stood there for another hour chatting. \n\nNever was a fan of sour ales but couldn't help but to get a 4 pack of their War Llama. So good!"
  ]
 },
 {
  "name": "Frightland",
  "address": "309 Port Penn Rd, Middletown, DE 19709, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0f14c9b0-9330-11ea-a5ee-14b31f159f22.png",
  "tags": [
   "creative",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15867822662911245638",
  "source": "GoogleMaps",
  "reviews": [
   "Frightland is truly an incredible experience. I've been to many haunted attractions on the east coast, and I can say that Frightland ranks as one of the highest in terms of quality, quantity, and value. The set designs are amazing. The actors are engaging. The scares are genuinely TERRIFYING and top-notch. They have some of the most creative and unique hayride sets that I have ever encountered... I could go on. It's been a long time since a haunt made me jump so much! In comparison to other haunts in the area, Frightland gives you the most for your money with 8 full attractions as well as a full carnival midway (and rides are included with your ticket purchase). The lines do get long at Frightland (because they try their absolute best the make sure that you don't run into the group in front of you). This makes the experience much more enjoyable and personal (as well as much scarier!). You may have to wait a while, but I guarantee you the experience is well worth it! Frightland will be on my list every Halloween season from now on!",
   "An absolute place that you must visit! 😀 Frightland is easily a traditional and favorite place to visit every year.",
   "Great actors! Good scares! Lacks a little in ambiance.",
   "I’ve been to Frightland 3 years in a row about to be 4 and it never fails to disappoint 😁 all the low reviews about the staff being mean and rude, never happened when I was there all 3 years. The website tells you everything you need to know about going, so don’t say that it doesn’t. It’s always gonna be mainly jump scares, there’s not really any other way to terrify people lol. Plus they change something or add something every single year so one bad year shouldn’t stop you from coming. They made the hayride longer and added new Ghouls. I highly recommend this place. Every time I’ve gone, the food has been good. And people are going to cut in line, you’re just gonna have to suck it up. If you want to make it to all the attractions, start with the hayride and you will be fine. I highly recommend starting with the hayride. The first year I didn’t and didn’t make it to all of them. The two years after that, I started with the hayride and made it to all attractions both times. Most of the money goes to a good cause so you’re not wasting it.  Go. To. Frightland!",
   "Had an awesome time here tonight! The hayride was a little disappointing in the beginning, but every other attraction killed it! You will not regret spending those $40, go for it and definitely do all 8 attractions, best bang for the buck."
  ]
 },
 {
  "name": "Harrington Raceway & Casino",
  "address": "18500 S Dupont Hwy, Harrington, DE 19952, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0f5dc166-9330-11ea-838e-14b31f159f22.png",
  "tags": [
   "free",
   "eat",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1391854607836025896",
  "source": "GoogleMaps",
  "reviews": [
   "First time of going but compared to Dover Downs Casinos I can say that Harrington Casino the payout is higher but they offer very little comp money or really cool free stuff based on the points you have accumulated from playing the slots during that month. They also don't offer much free play. When you play the slots in Dover they offer free slot play once you have accumulated some points and they also offer 25.00 in free slot play when you join to be used the very first day only and then ever few months they may offer anywhere from 15.00 to 50.00 in free slot play. You also get either 2 free night stay for 2 at the casino hotel or percentage off at their spa. So to me even though Harrington pays out more you get more bang for your buck and more incentives at Dover Downs casino and raceway.",
   "Love the casino. Lots of perks if your spending lots of money.  I very rarely win the big bucks. But maybe you will if your willing to spend the big bucks.  Friday's its busy.  There's a band playing in the club if your only interested in great music.  Upstairs is sports being and poker. I play poker and I'm there for hours ago they provide comfortable seats in there as well as in the shorts being area.  The food is great as well all you can eat in certain area's of the casino.",
   "Good place to go have fun a lot more open than other casinos nice outdoor space",
   "The casino was great and the food at Onion Jacks was also great but the service was horrible.  After the Waitress / Bartender brought us our food that was the last we saw of her, never had our drinks refilled and after waiting a while we had to go ask her for our check.  It seems like she was more interested in chatting it up with the bar customers!  We were there tonight 02/19/2020 a she was the blonde waitress.  If she waits on us the next time we are in there we will get up and leave!",
   "Small but just enough of everything you are looking for to enjoy your day. The fair right outside was an Awesome add on"
  ]
 },
 {
  "name": "Harvest Ridge Winery",
  "address": "447 Westville Rd, Marydel, DE 19964, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0fa14c78-9330-11ea-a86e-14b31f159f22.png",
  "tags": [
   "drink",
   "tasting",
   "winery",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7067059753674240387",
  "source": "GoogleMaps",
  "reviews": [
   "All the staff were super friendly.  They have something for everyone's palate.  You can have a seriously dry wine, a syrupy sweet wine, a dessert wine, fruity wine, Sangria,etc.  They have also offer a nice selection of hard ciders.  You can order a pitcher or fill your growler.  You can do a flight or a tasting or just sit and drink a bottle of wine.  It is a fun place.",
   "I love visiting this winery. Their wine is so good!  My favorite is Blue Hen.  They have great events, pairings/tastings and atmosphere for a fun girl’s night 😝",
   "HRW is a gem! The staff is friendly, the space is beautiful, the drinks are great and the events are amazing! There is always something going on. Don't miss out on the Food Truck Fest, doormat workshops and food pairings (just some of the few events offered)!",
   "I came here for the first time a few weeks ago to attend a birthday party. I was very impressed with the property and the whole process of how they welcome guests and present their wine. Wine is also very good and I bought myself some bottles that I continue to enjoy.",
   "Very nice and relaxed place. Friendly and comfortable. Highly enjoyable wines and ciders."
  ]
 },
 {
  "name": "Cape Henlopen State Park",
  "address": "15099 Cape Henlopen Dr, Lewes, DE 19958, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0fe0eda8-9330-11ea-b1fd-14b31f159f22.png",
  "tags": [
   "pets",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=17223432691435665985",
  "source": "GoogleMaps",
  "reviews": [
   "I have been to this park every year since I moved to Delaware.  This years experience was the worst mainly due to the bathrooms and shower house.  They were completely disgusting!  Not only were they nasty...they were just plain unsanitary.  There are 100 plus people using these everyday and they weren't even cleaned once that I could tell.  There was a wait for my wife and daughter to use the bathhouse every time.  They really need to build new larger and more sanitary facilities.  I found it ironic that a sign out side the bathhouse said to pick up after your pets because it's unsanitary.  How about cleaning the bathrooms!  Geez, for $35 a night I think the hosts could do a better job and making sure they were at least hosed out.  \n\nAnother reason I disliked this trip was because the WWII tower was closed/locked with no explanation all weekend???  That is one of the reasons I like to go there.  Bike trails are nice.  Beach is very crowed and the only place to go with a dog is to the truck beaches and we almost got run over by trucks on the way out!  C'mon Delaware authorities.  98% of the people on the truck beaches are not fishing!  They are partying!  I think it should be a little more enforced as to the regulations for preservation of the beaches.  JMHO.\n",
   "My favorite beach in this area!",
   "Beautiful park, tucked on top of Rehoboth Beach. Always lovely. Worth an hour, or a day, or more!",
   "Clean bathhouse at the campgrounds.",
   "Fantastic the day couldn't get better.  Weather, people, the ocean the walking trails even with a cane was great.  Was even able to see New Jersey from the beach.  A Blessed day"
  ]
 },
 {
  "name": "Lums Pond State Park",
  "address": "1068 Howell School Rd, Bear, DE 19701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/102745b8-9330-11ea-9ea3-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "nature",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=10724439214200884285",
  "source": "GoogleMaps",
  "reviews": [
   "I adore this park. It has great trails and there is much to do here. If you love the great outdoors, this is the place to be. However, I am a bit concerned about the length of hunting season. I wish it was a total safe haven for animals and I feel like some of the deer stands are too close to the camping area.",
   "Spent the weekend, beautiful little campgrounds. The sites are well planned,  a firepit and picnic tables,  full hook up. The playground is awesome,  with mommy and me swings, jungle gym and a really cool nature interactive board with a scope to spot animals. There is a huge field to play in in the middle which is great, keeps kids safe and away from traffic. Bathrooms are clean well lit and the handicapped bathroom is excellently designed! Showers are separate from bathrooms, Yea! There is a laundry with a sink. Several trails surround and spin off the campground. The lake is peaceful with a pier. Very laid back place,  great for couples or families with youngsters!",
   "We love Lums Pond! We stay here every winter. The park has been upgraded over the past couple of years so that all sites are full hookup. This year they have added a small laundry facility that is located right next to the large playground. We will be back!",
   "It’s amazing that such a small state like Delaware has such great state parks. So jump on your gravel bikes and explore the trails of this park. You won’t be disappointed.",
   "We came here to swing through the trees and we did just that. We were here a year or two ago and did the basic ropes course through the trees. Then we came again recently to visit this time we did the advanced course. It was totally worth it and a lot of fun."
  ]
 },
 {
  "name": "Constitution Park",
  "address": "301 S State St, Dover, DE 19901, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/107ea312-9330-11ea-a6c8-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=16267716660101576782",
  "source": "GoogleMaps",
  "reviews": [
   "Location: North and State Street, Dover, DE 19901\nThere is a sculpture in the park. The sculpture and park honors the ratification of the Constitution of the United States.  \nThe sculpture consists of a 13 foot bronze quill feather laid across a stainless steel cube.",
   "yyyyyyyyeeeeeeeeeeeeeeeeetttttttt"
  ]
 },
 {
  "name": "Abbott's Mill Nature Center of Delaware Nature Society",
  "address": "15411 Abbotts Pond Rd, Milford, DE 19963, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/10cc9574-9330-11ea-962e-14b31f159f22.png",
  "tags": [
   "nature",
   "tour",
   "kids",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=1807555203668140551",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice trails and nature area.  Great for children and school trips!",
   "I enjoyed the tour in the mill.",
   "No one on the trails at sunrise, Beautiful ❤️",
   "In love with creeks glad the trail goes along it",
   "A great nature center to take kids on a quick day trip."
  ]
 },
 {
  "name": "Prime Hook National Wildlife Refuge Admin Building And Visitor Contact Station",
  "address": "11978 Turkle Pond Rd, Milton, DE 19968, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1127d4fa-9330-11ea-a6bb-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "nature",
   "knowledgeable",
   "kids",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=15398458311177208823",
  "source": "GoogleMaps",
  "reviews": [
   "I was told 4,000 snow geese flock there. I did not see any. In fact, I saw almost no birds. The area is too vast to explore by foot or car. Boat is probably the better option in warmer weather. Very peaceful though.",
   "I will return to hike the trails and to visit Fowler Beach. Mom and I visited the well equipped Ranger Station and got maps and info.\nThis NWR was unknown to me and obviously a well-kept secret gem! We spent a lot of time driving the winding roads and on Route 1 that is the only way to reach the winding beach access roads. Protecting the acres of protected bay dunes and marshlands is obviously an important priority. So expect to park and walk to area close to waterways! The dunes are unharmed and I saw a snowy egret and some turtles and visitors crabbing off a bridge over a stream.\nI watch, study and maybe photograph Nature and wildlife! Though, this refuge is a resource for permitted hunters of waterfowl in season. I saw info and tags near the eastern entrance. \nI also noticed a trail head for The National Trail System Florida to Canada. Pack lunch this refuge is purely natural. No pizza or fries!",
   "The visitor center was really nice and the man at the counter was amazingly kind and very knowledgeable. Can't wait to come back!!!",
   "great place for birds, bugs, and vistas. I loved learning about all the species of animals and plants by doing the junior refuge manager program. Similar to the junior ranger program with the national park service but different style badge.",
   "We walked the boardwalk path and the other lookout path (which is a little longer and joins with the boardwalk) with a toddler in an umbrella stroller. These paths were very well maintained, but it probably wouldn't be the best idea in muddy weather. The lady at the visitor center was extremely kind and pulled out all sorts of things for our little guy to look at. That said, even with the (very lovely) walks, we were only there a little more than an hour, and older kids would probably be bored, as they don't have very new or unusual displays. If you're looking for nature walks, it is a great choice though."
  ]
 },
 {
  "name": "Go Ape Zipline & Adventure Park",
  "address": "1042 Howell School Rd, Bear, DE 19701, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/117272ac-9330-11ea-a010-14b31f159f22.png",
  "tags": [
   "cheap",
   "family",
   "parks",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5221702240565698417",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful place! Just recently started coming back here since I was much younger. Used to always come here with my family as a child so I guess we're starting the tradition back up lol. $8 parking for out of state isn't bad. Boat rentals are fairly cheap compared to other state parks I've been to. Can't wait to stay at their camp site!",
   "Excellent!!!!!! Although some sections scared the POO OUT OF ME!!!!!!😂😂😂😂😂 I chose this for my 12 year old daughter's birthday present and I WAS THE ONE SCARED TO DEATH!!! My gf, my ex-wife, and my 2 daughters had more kahunas than I did!!!!!!! I finished the course though. You will definitely need upper body and core strength to complete the Tree Top Adventure. They also offer another one that's a little less harrowing. Great time had by all and an excellent choice for a fun outing!!!!! This place is inside of a state park. There are grills, picnic areas, and cabanas. The state park is huge, so if you get there early enough (the Tree Top Adventure takes 2-3 hours) there's plenty to do in the state park. Trust me, my pictures do not do this experience any justice!!!",
   "Must visit place for kids . Tree top is short duration but it's worth",
   "I loved the experience even though I had a very hard time going through the course. I must gain strength and lose weight if I ever think about doing this adventure again. Lol Thanks for the push staff.",
   "My husband and I bought five tickets a piece and decided to use it weekly to get ourselves doing some physical activity that wasn't too hard. So we bought the five tickets for the junior course! Today was our first day using it and we had a great time! We are looking forward to the next four weeks and the fun that we will have doing this junior course. We felt very safe. They are very safety conscious and check everything every day!"
  ]
 },
 {
  "name": "Fort Delaware State Park",
  "address": "45 Clinton St, Delaware City, DE 19706, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/11b8a198-9330-11ea-9d74-14b31f159f22.png",
  "tags": [
   "drink",
   "knowledgeable",
   "tour",
   "food",
   "walk",
   "walk",
   "kids",
   "history",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=6150175743887136433",
  "source": "GoogleMaps",
  "reviews": [
   "Overall, great experience!  It's started out a little rough when the ferry left early; however, the staff handled the situation perfectly.  The ferry ride was great and definitely added to the experience.  On the island, we paid $5 extra per person for the inside tour, which lasted about 2 and 1/2 hours.  The guide was excellent and very knowledgeable.  Also, we got to see parts of the fort that aren't included in the regular admission.  One important thing to note is that this is a \"leave it as is\" site; therefore, any trash must taken with you when you leave the island and food and drink options on the island are very limited.\n\nHighly recommended!",
   "I went to the POW event weekend & they have a lot of civil war reenactors. One part of the fort is for only bat tours. The rest of the fort you can walk around & you can use the stairs to get on the top. You can see the bay from the top. The fort do have cannons. There is picnic tables but you will have to take the trash with you. We paid $24 for the ferry for 2 people to go to the island. The ferry ride is around 10min from & to the island.",
   "Great day out, and in beautiful weather.  We had a minor issue with the ferry breaking down, but the delay was minimal, and all staff were great.  The fort and surrounding park area was a beautiful and interesting place.",
   "We've lived here for 35 years.  This was our first trip to this park.  There are boats that take you to the prison.  You need to buy tickets.  There was a great ice cream place across the street.",
   "Great place to take the kids for a day! Had fun looking for ghost, like on Ghost Hunters. Hiked the nature trail biting flies,but a good walk! Kids learned a lot about the history! Been coming here since the1970's before they had electricity in a lot of the areas! Had several scouting events here, everyone seemed to have a good time! And more of the fort was opened to public than now, but still a very good place to come back to! Hard to believe that if you live in, Delaware mainly in New Castle region, and you have not been there to the island you really need to go! And not to forget the boat ride experience! Can't wait to get back there!"
  ]
 },
 {
  "name": "Bowers Beach Maritime Museum",
  "address": "3357 Main St, Frederica, DE 19946, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/11fbc93e-9330-11ea-9131-14b31f159f22.png",
  "tags": [
   "history",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8667574227769019911",
  "source": "GoogleMaps",
  "reviews": [
   "Great Museum to visit.  The town is lovely and they have a great benefit event called the 'Bowers Beach Buccaneer Bash' every Memorial Day weekend which is worth checking out to support the Museum. Its a lot of fun and the Museum itself with or without the festival is a grand place to visit.",
   "Very interesting history of the fishing community of Bowers Beach Delaware.",
   "Great place to learn local history!",
   "Wonderful beach community",
   "Neat little place"
  ]
 },
 {
  "name": "Lewes Beach",
  "address": "206 Bay Ave, Lewes, DE 19958, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/12405942-9330-11ea-931d-14b31f159f22.png",
  "tags": [
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=4148092386986263447",
  "source": "GoogleMaps",
  "reviews": [
   "Its a good beach, but it can be crowded, especially because of it's location and that it's free to go to. But, other than that, it's a good place to sit by the beach. I recommend this beach to families with their little kids, because the waves won't knock them down if they want to swim in the water.",
   "Enjoyed Dairy Queen while watching the Cape May Ferry come and go, perfect.  Also enjoyed watching the birds. Early March has a lot less people and no paying for parking.",
   "Clean and quiet during the off season\nBut wait a couple months. Love this quaint little town.",
   "Amazing beach. Lots of parking. Clean. Public restrooms. Went in the off season. Can't say how it is in peak season though.",
   "Great in the off season to stroll with your dog. It's one of my favorite spots to just exhale over a coffee and enjoy the down time out of the high season."
  ]
 },
 {
  "name": "New Castle Battery Park",
  "address": "1 Delaware St, New Castle, DE 19720, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/12825192-9330-11ea-91dd-14b31f159f22.png",
  "tags": [
   "historic",
   "history",
   "walking",
   "walk",
   "family",
   "walking",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=14299383560362203144",
  "source": "GoogleMaps",
  "reviews": [
   "Battery Park is interesting. It really shouldn't be called 'Battery Park' - It should be called the 'Historical Relics Park'! You can Google it's historical significance. However, more interestingly, it still retains remnants of an old pier that used to go into the water. This place still has it's lampposts standing. Walking around here makes for an eerie experience and you can totally take amazing post-apocalyptic photos! It's just a hop away from the nearby historic district. So make sure to go here while you're in New Castle to view some history. \n\nRecommended!",
   "It was very nice. Park itself was very clean with no trash lying around. However, few area's where there were mounds of geese droppings. So just pay attn where you walk, but all and all very nice!!",
   "Good place for an evening stroll in a culture rich part of Delaware. There are good photo spots and walking trails and even some sandy areas for a beach feel. Recommend this place for casual evening walks, small family picnics and so on.",
   "I grew up 40 years ago in this park. It has been  upgraded and discovered by thousands in part because of the pokemon go. Now during the summer hundreds enjoy the park every day. It has a waterfront walking path kids climbing entertainment area with slides. It has a dwarf, but you cannot fish. It has a sailing club. Great small town park.",
   "Nice place for pics. Interesting, historical looking town. We went at night so I hope to enjoy it in the day when it's bright and warmer."
  ]
 },
 {
  "name": "Pizzadili Vineyard & Winery",
  "address": "1683 Peach Basket Rd, Felton, DE 19943, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/13183588-9330-11ea-bfbc-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tasting",
   "art",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=11992427377767326027",
  "source": "GoogleMaps",
  "reviews": [
   "I liked Pizzadili. The woman there was very knowledgeable about the wines, and the wines were a fascinating old-fashioned exploration both of terrior and older, traditional Italian-style winemaking techniques. I was really facinated by the white wines that spent contact on the skins; loved both the Deleware and the Niagara.  My favorite of the reds was the Two Brothers Chambourcin and Cab blend. Recorded a podcast for my blog about the Delaware a few nights ago, actually, as that was the bottle that came back with me.",
   "We love to stop in here a couple of times a year to try out their new wines. With the Pizzadili's, wine-making is an art they brought with them from Italy. They love what they do, and they make some very good wines. They have a great little gift shop there as well, so if you know a wine lover, this is the place to buy them a birthday present. Do a tasting and they will be happy to tell you about each wine. I love it that they all are so down to earth and willing to share what they know about their craft.\n\nIgnore most of the negative reviews. Some of the neighbors are upset because Pizzadili was opposed to allowing a dirt track raceway to be built next to their business.",
   "Great wine selections, nice friendly people and beautiful grounds.",
   "Good staff and tasting. Had limited time, but Bought a case. ",
   "Excellent wines. knowlodgeable staff."
  ]
 },
 {
  "name": "First State Heritage Park Welcome Center and Galleries",
  "address": "121 M.L.K. Jr Blvd N, Dover, DE 19901, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/135d3448-9330-11ea-8c14-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=14025414325248649715",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great constellation of living history museums the state archives and legislature. Tours are easy to set up for your class group; and if you want to visit there is no fee for parking or admittance. Lots of great portraiture of Delaware notables throughout our history. ",
   "Nice building, good selection of brochures available. I think the front desk attendants were surprised to have visitors. The restrooms were clean and convenient.",
   "Nice place for information.",
   "Me encanta! Todo de esta bella ciudad me encanta,  visiten Dover y sus alrededores, vale la pena conocer",
   ""
  ]
 },
 {
  "name": "Fort Miles Historical Area",
  "address": "15099 Cape Henlopen Dr, Lewes, DE 19958, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/13aac2ca-9330-11ea-ae01-14b31f159f22.png",
  "tags": [
   "tour",
   "kids",
   "historic",
   "learn",
   "kids",
   "family",
   "history",
   "walk",
   "history"
  ],
  "link": "https://maps.google.com/?cid=5481952334089739042",
  "source": "GoogleMaps",
  "reviews": [
   "Be sure to take the tour of the bunker! The tour was amazing",
   "My kids and I love this place.  It’s a nice “add-on” experience to a day at the beach at Cape Henlopen State Park.  We do a monthly day-trip throughout the summer and early Fall.  They have one observation tower that you can climb, several historic WWII canons and anti-aircraft guns, barracks and a bunker that they have restored.  The bunker is a nice option when it’s really hot out because it’s underground and cool.  Amazing photos and artifacts inside the bunker.",
   "The view is beautiful and Fantastic, beside you can ride a bicycle to see all the guns with your children on outdoor with the parking lot at low fee.",
   "This place is an amazing piece of history. They have some really interesting artillery and it is a great place for kids to learn to learn. My son got to stand in the barracks where his great grandfather slept before shipping off to Italy as an MP. I'm incredibly grateful that it has been preserved and that I was able to share the experience with my family!",
   "Very interesting history and quite a few guns. Makes a nice walk on a nice day."
  ]
 },
 {
  "name": "Midway Speedway Park",
  "address": "18645 Coastal Hwy, Rehoboth Beach, DE 19971, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/13ec6008-9330-11ea-a1fe-14b31f159f22.png",
  "tags": [
   "family",
   "free"
  ],
  "link": "https://maps.google.com/?cid=17222827010408634356",
  "source": "GoogleMaps",
  "reviews": [
   "My grandchildren had a great time on the bumper boats and then on Fire Mountain Mini Golf. It made for an AWESOME  afternoon of fun with Mom-mom.  We always enjoy Midway and we come back every year at least a few times. Next time its GO KARTS...  YEAH....",
   "Awesome my two little ones and my husband have MUCH Fun and I watching them 😍.The staff  makes us feel so pleasant while we were there !",
   "Always a fun place to take the family and good prices",
   "The guys had a awesome back to childhood fun! The girls shared laughs! Awesome staff!",
   "Awesome park! We had so much fun here. At the end if you win the last hole, you win a free game."
  ]
 },
 {
  "name": "Longwood Gardens",
  "address": "1001 Longwood Rd, Kennett Square, PA 19348, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/142e4b00-9330-11ea-b43b-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "unique",
   "history",
   "unique",
   "walk",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=17474055472580616400",
  "source": "GoogleMaps",
  "reviews": [
   "GORGEOUS. Flowers are SPECTACULAR. A must see. Best to visit often, at least once for every season. I love the STUNNING ORCHIDS IN BLOOM as much as their CHRISTMAS DISPLAY. Can't wait to return in the summer to see the fountains & outdoor gardens in Bloom. Will be wearing COMFORTABLE SHOES! Food was LOVELY, a little overpriced, but DELICIOUS. Its a BEAUTIFUL place to visit.",
   "This place is an experience.  Full of rich history and breathtaking scenery.  The grounds are kept pristine and beautiful.  Do yourself a favor and give yourself at least two days here because there is that much to see.  I've been twice so far, once in the summer and once at Christmas time and both times were unique.  If you can, see the fountain shows and see the Christmas displays for sure.  You won't be disappointed.",
   "One of my favorite places to be. Always something new to see on each trip. Great to go to some of my favorite spots in the gardens & see how it looks different with each season.\n\nWonderful place to get away and just relax. Some days it’s hiking in the meadow on the trails. Other days it might be sitting on a bench & watching the fountains or waterfalls.\n\nDefinitely worth a membership & the hour drive.",
   "Simply the best! Go at Christmas, it's a magical escape and it will put you into the holiday spirit. We went on a drizzly night with lots of mist in the air which created an ethereal setting, the outdoor lights diffused and eerie. Loved it! The gigantic greenhouse goes on and on and on; there was a huge pipe organ and an organist and at least 75 people participating in A Christmas carol sing along which was delightful. Everybody was singing! It was really nice that all those strangers were coming together in that moment. Make sure you look for the unique and somewhat odd bathroom area with little pods that run along a curved hallway. The hall walls have plants growing up them. Our friends showed us this and it was a lot of fun to visit the round restrooms! Hit up the on-sight restaurant; one of the best meals we've had this past year. Just outside the restaurant there was a bar area with good micro brews. Lots of fun on a Friday evening with minimal crowds. I think the rain helped us out.",
   "We went here during the orchid extravaganza in March. Had a wonderful time. The diversity of scenery (even in the winter months) is extraordinary. Meadows, forests, topiary, fountains, treehouses and greenhouses that are filled to capacity with flowers. Beautiful places to walk. Some areas paved, others are not. Definitely bring good walking shoes.\n\nTheir main exhibit at the time were the orchids in the conservatory. Beautiful arrangements of orchids on walls and hanging baskets, along with bonsai trees, succulents, and hybrid orchid varieties. They definitely put a lot of care into their exhibit to make sure it is well maintained.\n\nPrice-wise, the entrance tickets are a little expensive at $25 dollars a person. The prices at the cafe inside are also steep. Because of this though, the gardens, buildings, and fountains are very well maintained. And the food is decent quality. They definitely put the money to good use creating and maintaining the beautiful landscape.\n\nIf your in the Philadelphia area and looking for a fun day trip, definitely check out Longwood Gardens."
  ]
 },
 {
  "name": "First State National Historical Park",
  "address": "211 Delaware St, New Castle, DE 19720, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/147b7092-9330-11ea-a6cd-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "walking",
   "historic",
   "history"
  ],
  "link": "https://maps.google.com/?cid=18166648016140566190",
  "source": "GoogleMaps",
  "reviews": [
   "If you are looking for national park Cancellation Stamps you will find one at the first State visitor center. Or if like history this little square will work you away to colonial times.. parking on the weekend in Sept was easy and close. They have a little 8 min movie and some local artifacts including a little walking tour of the area.\n#AdventureKrewe tip: take a photo of the walking tour sign and use it to navigate the streets, then use Google to look up each location. Your own mini history tour.\nGive us things up if you like American history. Two thumbs up if you don't.",
   "Beautiful place in the First State. A great place to visit any time but especially when they have events.  Check their website for events.  Also a good place for children, plenty of space to run around and a nice playground.",
   "Great place. Awesome accesible waterfront close to historic New Castle. Cafés and Restaurants nearby. Minimal trash along the shore and runner and dog friendly trails.",
   "Neat little place. Not exactly what I had expected but very history filled area",
   "This is the only national park site in Delaware.  The building and streets are beautiful! The people are nice and friendly. They give you so much ibformation!!"
  ]
 },
 {
  "name": "Jungle Jim's",
  "address": "36944 Country Club Rd, Rehoboth Beach, DE 19971, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/14cf2574-9330-11ea-90ad-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "kids",
   "food",
   "family",
   "free",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6901599596264576867",
  "source": "GoogleMaps",
  "reviews": [
   "A pretty good water park near the beach. Wasn't too crowded but it was Thursday. Had 2 fun slides. 4 slower quick slides. But no lines. Lazy river was fun to just chill. No alcohol. Food at cafe wasn't too bad as far as price. Flavor wasn't bad either. Price overall was a bit high but to be expected.",
   "Great place for the family. Very clean as well",
   "Nice place to come and relax, slides are an extra fun for adult and kids. Plenty to do for toddler's as well.  The anaconda slide is especially fun due to the slide resembling that of a snake.  Food here is at a pretty reasonable price. Plenty of life guards changing up almost ever 30 mins to an hour.",
   "at first you kind of taken back by the price +$100 for a family of 3. Parking is free, and once inside your greeted with a clean crowd free activity environment.\n\nThere are water attractions for all ages and interest.\n\nThis is definitely a place we will visit again.",
   "I had a blast here, and so did the kids. Perfect size for a water park. Not too crowded,  easy to get around, areas for young kids to play (splash pads).\n\nThe food area was good as well, your typical staples, pizza, chicken tenders, fries, hot dogs. \n\nThe bumper boats were a blast. You get to pilot a small boat, and as the name would suggest bump into other floating contraptions with sentient beings inside (read: boats with people).\n\nThe lazy river was awesome. We probably went around 10 times by the end. \n\nHighly recommend a trip here. Much more fun than sesame place in all honesty."
  ]
 },
 {
  "name": "White Clay Creek State Park",
  "address": "Park Office, 750 Thompson Station Rd, Newark, DE 19711, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/151ea548-9330-11ea-9319-14b31f159f22.png",
  "tags": [
   "free",
   "hike",
   "walk",
   "hike",
   "family"
  ],
  "link": "https://maps.google.com/?cid=17516642154323962018",
  "source": "GoogleMaps",
  "reviews": [
   "Nice park though the mapping is inconsistent with actual trail conditions.. many trails shown on maps are now simply closed or no longer on the trails as indicated.. trail markers encountered are not all updated w/new trail info or accurate.. I had 3 maps and honestly none were correct.... the DE access lots are only  free  from December 1st  to March 1st.. there is very little here worth an $8 per vehicle out of state parking charge so be warned..  use the adjunct Pa lots to avoid these ridiculously high user fees.. no state park w/o lifeguarded swimming available should be more than $3 for anyone to day use ..",
   "Such a beautiful place. We ran a cross country meet here. Awesome course.",
   "We enjoyed the short hike by the rangers station. The GPS got me there with no problem. I'm going to purchase a yearly pass so I can explore as much as I can of the park.\nMy. Man",
   "Nice big park. Took a 6 mile walk and didn't cover all the trails. Their are some good hills to get your heart rate up. Clean restrooms and very nice picnic shelters. Great place for a hike or family outing.",
   "Perfect place for hikes and bike rides, either alone or in groups. Wonderful scenery and trails."
  ]
 },
 {
  "name": "Zwaanendael Museum",
  "address": "102 Kings Hwy, Lewes, DE 19958, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/15721cc2-9330-11ea-a06a-14b31f159f22.png",
  "tags": [
   "history",
   "free",
   "art",
   "walking",
   "knowledgeable",
   "free",
   "art",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=10193222892800684325",
  "source": "GoogleMaps",
  "reviews": [
   "The Zwaanendael Museum is a great little Museum filled with amazing history and artifacts from the Town and surrounding areas. The stall and Volunteers were very friendly and very informed about the area and its history. They relayed their love for the area and their bountiful knowledge to us in a easy and fun way.",
   "This place is neat. First,  it's easy to find and Lewes is a pretty town.  The museum is free and contains items from a shipwreck along with interesting information. There is an art display upstairs. If you have any Dutch heritage this would be good to visit. Nice restaurants within walking distance.",
   "We visited to see the merman. The museum itself is lovely as well as the outside grounds. Staff were curious and knowledgeable.",
   "Interesting museum. It's tiny, two floors, so you won't be there all day. Info video on the main level is worth watching since it tells you all the stuff you should know about Lewes. Some nice art work. Staff there is are very friendly and informative. It's free.",
   "This museum/park is truly unique. I didn't go in the museum because I have my 2 little dogs with me. I learned a lot from the signs outside. The park is small and clean, and well equipped with a fully functional restroom, trash cans, doggy poop stations."
  ]
 },
 {
  "name": "Delaware Children's Museum",
  "address": "550 Justison St, Wilmington, DE 19801, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/15d0e26c-9330-11ea-a013-14b31f159f22.png",
  "tags": [
   "kids",
   "art",
   "organized",
   "kids",
   "kids",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=17044095239027892945",
  "source": "GoogleMaps",
  "reviews": [
   "We had a 2nd birthday there. It was AMAZING. Olivia, our party leader was wonderful with the kids and with helping me get everything ready. All the guests had a blast and we even got vouchers for the kids we paid for that couldn't make it. \n\nThe museum itself was great. Really clean. And the exhibits had something for all kids ages. Even the parents had fun playing. I seriously can't recommend this place enough.",
   "Cannot say enough about how wonderful this place is!! We are members and visit often and our three year old never runs out of things to try! Programs and art activities are well run and simple enough to do even during a quick visit. Staff are super friendly and even when it is crowded they do a fantastic job keeping the place tidy and organized.",
   "Many different rooms, each with it's own theme. Perfect for 4 year olds, with some areas or activities less accessible to younger kids. They have a large water table that my two year old could interact with, although taller, stronger, and older in general makes it a lot more fun. Other kids helped her so it actually worked out beautifully. There are areas meant for younger kids so it depends on what interests your child has and we mainly noticed because we were there with a 3 year old so the accessibility  and interest by age was apparent. My husband and I also enjoyed it since it is set up for learning.",
   "The Delaware Children's Museum was simply delightful! I was worried about what an almost walking 13 month old would be able to do, and the answer is: a lot!\n\nWe loved the little kids'area with the trains and the magnetic gears. The mock farmers market was also great, though certainly meant for slightly older toddlers. We didn't venture into any of the areas where the bigger kids were playing.\n\nThey have very large family restrooms, for which we were extremely grateful. Diaper changes for a worked up toddler can be a two adult job! \n\nWe were very pleased to see that we could host a birthday party there, and for a very reasonable price. There are a variety of themes designed specifically with the interested and abilities of certain age groups in mind.",
   "Wonderful! My two and a half grandson had a blast. Didn't know where and what to do first. The different areas had appropriate age levels listed and appropriate items for those age groups. It was fun. We'll be back !"
  ]
 },
 {
  "name": "Carousel Park",
  "address": "3700 Limestone Rd, Wilmington, DE 19808, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/161a6ec2-9330-11ea-809b-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "field",
   "hike",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=9388336165993037792",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to take the kids. They have a large playground and horse stables which you can walk through and pet the horses. It's also a perfect place to take your energetic dog. It's such a large park that most dogs (and owners) would be exhausted if you walked the whole thing.  In the summer we frequent their farmers market where they invite local farmers to bring their vegetables, meats, dairy products, and plants.",
   "Amazing dog park. Huge open field, giant pond for the swimmers. It isn’t completely fenced in but pretty surrounded with woods. People are always extremely friendly and welcoming.",
   "Great dog park! Lots of room for them to run around unleashed. Plus, there's a place for them to take swim to cool off. Highly recommend.",
   "Perfect for picnic. It has a beautiful play area for children. A view of horses, a nice waterbody with goose and a route to ride bike or just hike.",
   "beautiful local park, great walking path through the wooded areas and around the lake. Dog park is great for your dog- leashed or  not. it is a carry in carry out so bring a bag for any trash, there are cans on the way in/out of the park. Friday's there is a Farmers market, the County/State house their horses here and are beautiful to see! Equestrian events, and local track meets."
  ]
 },
 {
  "name": "Delaware Outdoor Trail SC875",
  "address": "2658 Cedar St, Lewes, DE 19958, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/166a4f4c-9330-11ea-bf22-14b31f159f22.png",
  "tags": [
   "nature",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9296806957732196435",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful spot to enjoy the tranquility of nature. You can simply sit in your car and take in the view. Listen to the sounds of boats & birds. Or, you can slip off your shoes, take a peaceful stroll along the beach. Feel the sand squishing between your toes, feel the water as it breaks on the beach. The fresh yet calming scent in the air.  **Perfect spot to enjoy with friends, a loved one or even just to be alone.",
   "Great place to do some fishing and relax.",
   "It was a day I needed  to remember. Two dear Young friends I say young because they gave the ultimate sacrifice in Vietnam. Walter was my Church going buddy and Billy was my neighborhood buddy, especially fishing. Thank you American Legion Family of Post 17 of Lewes for having the Moving Memorial Vietnam Veterans Wall this weekend. I thank Billy, Walter& all Veterans for the freedom & liberty they defend so we can enjoy life. Godspeed U.S.A.",
   "Great place for sunset photos and fishing.",
   "Great shoreline location for scenic dawn or dusk photographs.  Popular for fishing in the inlet and beach access to Lewes Beach."
  ]
 },
 {
  "name": "Friends-Concord Point Lighthouse",
  "address": "700 Concord St, Havre De Grace, MD 21078, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/16b75e14-9330-11ea-87ab-14b31f159f22.png",
  "tags": [
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=15533846642070003923",
  "source": "GoogleMaps",
  "reviews": [
   "The town of Havre de Grace is full of rich history with its period home, military science museum home made candy and ice cream shop and most definitely the lighthouse. Whenever I’m returning south from a road trip Havre de Grace is one of my favorite spots. I enjoy photography the bridge from the dock as well as sitting on a bench at the pier and simply enjoy the view of the Potomac. The sunsets are some of the best I’ve experienced in my lifetime. A stop at the welcoming center will give you all the information and history you need to know. Ask about future events. There is always something exciting and fun happening.",
   "Nice quiet place to take a stroll or watch the sunrise. It’s difficult to see the sunset from here, but it’s still nice to go on a full moon night. Very quiet safe area.",
   "Have de grace is a really cozy must stop if you're in the area. Beautiful surroundings and a really nice boardwalk park. Excellent coffee shop, plenty of good quality restaurants, quite a few genuine antique shops and a really great memorabilia and film/music/bookstore that also carries some 1st and 2nd edition  rare and classic books (sometimes also signed by the author).\nReally relaxed ambiance and an amazing fourth of July fireworks show every year. Right by the water so a truly great stop anytime of year.",
   "Well maintained, good view. You can get some interesting historical tidbits from the keeper if you press him. The visitors center also has a good little museum and friendly staff.",
   "I enjoyed every moment of it and the light house is so amazing. If you never been here before like myself you have to come see for yourself, something for the whole family. Love, love."
  ]
 },
 {
  "name": "Martinak State Park",
  "address": "137 Deep Shore Rd, Denton, MD 21629, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/172126f4-9330-11ea-8151-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=1998790595284479104",
  "source": "GoogleMaps",
  "reviews": [
   "Weekend stay with wife and baby, to start new year off. Stayed in full service cabin. It's really nice and peaceful. The cabin is great. Has 2 pull out sofas in the living room 1 queen and 1 single. The has 2 twin beds in the bedroom. Full kitchen, with full size refrigerator and freezer and stove with oven. The views are great, the river kinda wraps around the front of the cabin and then there is a small pond in the back that you overlook while sitting on the screened in porch. Very nice , we will return. Good Verizon cell service.",
   "It was nice to take the puppy there for a walk...now if we could just train him to walk nicely.",
   "This place is always so clean and absolutely beautiful. Great place for boating, beautiful amphitheater, Sweet Little trails, several really great playground equipment areas, it's a great place to camp and a beautiful place to spend the day.",
   "RV sites are black top and level, very nice park for camping among the trees. Being a state park, you only get power, no water n sewer hookup on site but fresh water supply n dump station is available inside park. Grocery n essentials are right down the street so very convenient if you forgot to bring or need anything. Even though you are so close to main highway, the park is very quiet n you wud not suspect you are so close to town. Love the theater seating pavilion that sits right on the water. Wud be a great place to hold a group event.",
   "Small park but fun for a camping weekend. Only a few short hiking trails but they do have a paved activity trail which seems stroller/wheelchair accessible. Looked like good places for kayaking and they have a nice boat launch. Good fishing spots."
  ]
 },
 {
  "name": "Hagley Museum",
  "address": "200 Hagley Creek Rd, Wilmington, DE 19807, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/176d48a8-9330-11ea-b126-14b31f159f22.png",
  "tags": [
   "walk",
   "historic",
   "kids",
   "knowledgeable",
   "family",
   "tour",
   "knowledgeable",
   "family"
  ],
  "link": "https://maps.google.com/?cid=8359028356908675959",
  "source": "GoogleMaps",
  "reviews": [
   "Hagley in and of itself has a nice historic presentation on industry on the Brandywine River.  The docents do a great job with the visitors, especially school-age children. It's a pretty place for a walk along the river, too.  However, the STEM event we lucked into was awesome.  My granddaughters loved the hands on learning, and came away with a lot of enthusiasm to continue doing similar things at home. Fun, but not a Disney princess.  It was great!",
   "We are members but decided to go on one of the coldest days of this winter so far... The place is beautiful, even when there is no green in the trees... The staff are delightful and made the best of it when the welcome center suddenly lost power... On the shuttle up to the house, we saw a bald eagle swooping over the Brandywine River looking for fish and on the way back we saw him perched in a tree. Hagley is well worth a visit in any weather...",
   "Wow! What a gem! We had a blast during our first visit and can't wait to return! So many fun activities for kids plus plenty of historical and technical info for my husband! 😊",
   "This was a great experience. We enjoyed a tour of the family home with a very knowledgeable guide. After which we went down for a demo in the machine shop and then the gun powder demo both of which were educational and entertaining. We ran out of time to see the workers area. It nice that the ticket allows you entrance in 2 days.",
   "A beautiful museum village that brings to life the story of the origins of the DuPont family, Delaware and the Brandywine Valley.  Knowledgeable staff, first rate preservation in a bucolic setting."
  ]
 },
 {
  "name": "New Castle Court House Museum",
  "address": "211 Delaware St, New Castle, DE 19720, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/17c21fa8-9330-11ea-add3-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "historic",
   "tour",
   "free",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=6965682951405067200",
  "source": "GoogleMaps",
  "reviews": [
   "Great museum but it's only lead by tour and is not free to roam.",
   "Beautiful and well-preserved building, part of the  First State National Historic Park and promoted as one of its seven main attractions. We walked in and were greeted by a friendly bearded gentleman, who gave us a wonderful 40-minute tour for free. It was through his stories that the place came to life and made us appreciate its historic significance. The tour ended at the second floor, where there is a small exhibition on the history of European settlement in Delaware.\n\nWe visited in the summer and the air-conditioned interior was definitely a welcome break from the intense heat. They also have clean restrooms at the basement.",
   "The lady here is very informative, helpful and personable.  It really made the exp experience most enjoyable.",
   "When a 7 year old boy stole a loaf of bread or didn't pay attention to his parents he was taken out to the whipping post and made an those were the good old days literally....",
   "Very knowledgable and personable staff. Cool history."
  ]
 },
 {
  "name": "East Point Lighthouse",
  "address": "10 Lighthouse Rd, Heislerville, NJ 08324, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/180c212e-9330-11ea-a3c8-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "history",
   "walk",
   "tour",
   "nature",
   "knowledgeable",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=7261640732802873358",
  "source": "GoogleMaps",
  "reviews": [
   "Great Little lighthouse and bay that I've been visiting all of my life. I grew up about 40 minutes away and my dad and I would take evening trips to visit the lighthouse and go to the diner nearby for a slice of pie. This lighthouse will always hold a special place in my heart and I always tell people visiting the area to take the drive and check it out. The Horseshoe crabs that frequent the shore are awesome too!",
   "Despite being off the beaten path, the East Point Lighthouse is well worth the trip! Very picturesque, there were people taking photos for their Christmas card when we were there. It's not very tall so if you're afraid of heights it's not a problem, but it's tall enough to get a great view of the Delaware Bay and Maurice River. The staff is so friendly and informative. There are many items displayed that are from the early to mid 1900s. But the coolest feature is you can actually turn on the light yourself! Ask them how, they'll be happy to tell you. This may/is the only lighthouse you can do this!",
   "Place is scenic, good for stargazing or photography. Staff is friendly and knowledgeable about the history of the site. Place needs help with more donations so be sure to contribute if you can. Fair warning, it's infested with biting flies during certain warm months of the year and they DO NOT give an F about bug spray. Wearing long sleeve and pants and long socks can go a long way to protecting yourself ( cover that neck too). Scarves could be used to cover face as well if they are particularly aggressive. If you are doing photography here this is a must. Heed this warning.",
   "The lighthouse wasn't open when we went but still so much to enjoy. We were able to walk along the water, find shells and rocks. Just had a beautiful day. It wasn't crowded, cars came and left fast. It's just a great place to enjoy nature not so much lay out or swim like on a beach. We just wanted to relax and enjoy the sounds of the water so it was perfect for us. We got to see around the lighthouse just not inside it. We'll go another time to do a lighthouse tour though. We will come back that's for sure.",
   "Nice place to visit.  Historic with knowledgeable and friendly staff"
  ]
 },
 {
  "name": "Rehoboth Art League",
  "address": "12 Dodds Ln, Rehoboth Beach, DE 19971, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/18668b40-9330-11ea-912f-14b31f159f22.png",
  "tags": [
   "wander",
   "art",
   "creative",
   "art",
   "comforting",
   "art",
   "learn",
   "unique",
   "art"
  ],
  "link": "https://maps.google.com/?cid=12445279944969070700",
  "source": "GoogleMaps",
  "reviews": [
   "Love to wander in the gardens there. Yearly art festival is a must do .!",
   "Friendly professional atmosphere in the main Gallery, situated on an inspiring peaceful campus!\nDropped off two of my framed  photos ... One for the Members Fine Art Exhibit (Reception this Friday) & one for the great Members Gallery at the Rehoboth Art League. Visit during their posted hours and enjoy an incredible variety of creative expressions in just about all media throughout the year!! Purchase a work of art that will continue to thrill you in your home! Check out their classes for enlightenment and growth, too! Reminder: the Outdoor Show weekends are coming up! Some members are in the SEDAST in Nov. as well (Google it!).",
   "The environment is so peaceful. The idea that local artists can exhibit their work here is comforting. And the art is really outstanding. There are paintings, photographs, clay work, wood, glass, textile... You name it, you can find it there.",
   "The “White Line Woodcut” printmaking class offered by Fred Dylla is a wonderful addition to the RAL’s class offerings.  Fred’s experience in academia, and skill with white line woodcuts shine through in this carefully constructed curriculum. Fred’s thoughtful instruction in technique, and historical information about the origins of the “Provincetown Print”, allow students to immediately immerse themselves in this art form.\n\nFred makes this course easily accessible to artists and non artists alike, with many hands on demonstrations and one on one instruction.  He also has the unique ability to bring a diverse group of strangers together and build them into a supportive group of friends, with activities that enable everyone to get to know their classmates.  Fred proved to the non illustrators in the group that you don’t need special art skills to be able to make lovely prints.  Anyone can learn this!\n\nFred’s enthusiasm for the subject is so contagious that six months after taking his first workshop, our original group is still meeting weekly to make prints!  Join this workshop the next time around, you will love it.",
   "Great open house event. Lots of local artisans and their crafts."
  ]
 },
 {
  "name": "Nassau Valley Vineyards-Winery",
  "address": "32165 Winery Way, Lewes, DE 19958, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/18be6f66-9330-11ea-a5c9-14b31f159f22.png",
  "tags": [
   "music",
   "winery",
   "tasting",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=8676233510852663662",
  "source": "GoogleMaps",
  "reviews": [
   "Great people. Really good wine.  Sunday marketplace with the music is really nice.",
   "Being close to Rehoboth Beach, I thought this place would be top of the world quality with wines but the tasting room staff just left us wanting. Simple questions about the wines were met with seeming confusion. The person actually just said they know white wine because it's yellowish colored. That says enough right there. There's room for some good competition to come in as this area is a great place for a winery that cares.",
   "Called twice about information on having a wedding there. Both times my name was taken and told I’d be sent information.... never heard back or emailed.",
   "Good wine,  tastings.  Sunday afternoon farmers/craft market  Nice place to visit if in the Rehobeth DE area.",
   "Great wine, though it gets very busy and they are ill prepared for a huge crowd. They definitely make the best of it with their interesting set-up though, but don't expect to step in for a tasting last minute. Get there at least an hour and a half before close to guarantee a spot."
  ]
 },
 {
  "name": "Delaware Museum of Natural History",
  "address": "4840 Kennett Pike, Wilmington, DE 19807, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/192b8894-9330-11ea-a3bd-14b31f159f22.png",
  "tags": [
   "kids",
   "field",
   "kids",
   "field",
   "unique",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5748221295523209642",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great museum. They have some really cool collections and events for both adults and kids. They also have no problem with this being a out stop when I run along 52. Always a good buzz at this place - love it!",
   "This museum, strictly in terms of the interior, is not ideal. The dinosaur exhibit room contains mostly screens and video game like consoles even during other events it designed for an older more screen based child. The children’s room has a number of hands on activities but after 1-2 visits it loses all appeal and charm because they are the unchanged. The depiction of animals throughout the museum are cold and not engaging for children and adults alike. I know this isn’t the Smithsonian but it could be so much more, especially considering the beauty and location of this building.",
   "So much to see and do.\nMy grand daughter wants to go every other week.  Very kid friendly and a great staff.",
   "It's small and simple. It's self guided so you can go at your own pace. Lots of things to touch for the kids. Inside and a few things outside. Seems geared towards kids and field trips.",
   "Awesome place! Great for field trips, great for kids and adults both!! Unique exhibits and cool artifact stuff."
  ]
 },
 {
  "name": "DuPont Environmental Education Center of Delaware Nature Society",
  "address": "1400 Delmarva Ln, Wilmington, DE 19801, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/197062c8-9330-11ea-bf46-14b31f159f22.png",
  "tags": [
   "free",
   "nature",
   "walking",
   "walk",
   "nature",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=15684460812912610847",
  "source": "GoogleMaps",
  "reviews": [
   "Discovered this free urban wildlife and nature refuge after walking about 1 mile from the Delaware RiverWalk shopping area. The center exhibits were closed Monday when we visited but the boardwalks and trails were open.  It's reclaimed from an industrial area of the Christina River.",
   "A surprising Oasis at the end of a very pleasant 30 minute stroll by the River. Highly recommendable, in particular the visitor center",
   "Great place to bike and walk. Nature museum is great, bring some binoculars to get a good view of the Beaver Dams.",
   "Very nice walking trail!",
   "I am a frequent visitor to this wonderful boardwalk in the marshes.  There is something new to see everytime"
  ]
 },
 {
  "name": "Parvin State Park",
  "address": "701 Almond Rd, Pittsgrove Township, NJ 08318, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/19bb279e-9330-11ea-9507-14b31f159f22.png",
  "tags": [
   "hike",
   "walk",
   "free",
   "family",
   "family",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=14559131860320693011",
  "source": "GoogleMaps",
  "reviews": [
   "It's still well kept park. Cabins and lean-too are in excellent shape. As a child my parents and grandparents would rent a cabin at Thanksgiving. We took our dogs AND cats with us to enjoy it. I'll post a Pic after I find my photo album of the bunks. Our cats and dogs are in that Pic. I have fond memories of there. I still rent a cabin now n then. Need to take my daughter to show her and take a nice hike. The trails are phenomenal as, well. I highly recommend this place 💞💞💞",
   "Very clean Park and a great place to be romantic and watch the sunset with your special someone.. Great place to ride bikes and get some quite time",
   "Great trails, fairly easy to walk round. Free parking.  Some great lake views and very clean.",
   "Parvin State Park has been a wonderful place for me for the past 25 years. Fishing, canoeing, swimming. It's kinda dated, but as you can see it's absolutely gorgeous. Check out Ant's kayaks and canoes for rentals; prices were a bit steep but the service was good, and the lake was crystal clear. They had a little a refreshment shack there that covered the basics. Overall, a great family day. Have not done any camping there since it's only 30 minutes from where I grew up.",
   "Went camping here with family in mid-September, and it was a great time to go. Took canoes and paddle boats on the water and there was a lot to explore, tons of wildlife to see and everyone on the water was very nice. There was someone employed by Jersey parks who held a micro-invertabrae exploration session that was very cool for all ages. (Most of) The campsites are large and well spaced out, some lead directly to the boating areas, others lead to picnic areas. IDEAL time, will definitely return. Be on the lookout for the state police, as he verified our non-alcoholic beer bottles one morning."
  ]
 },
 {
  "name": "Vincenzo's Pizzeria & Gelato",
  "address": "1035 Forrest Ave, Dover, DE 19904, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1a076c46-9330-11ea-88ab-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "free",
   "cheap",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2018040984932916271",
  "source": "GoogleMaps",
  "reviews": [
   "My wife and I had a delicious lunch few weeks ago in the restaurant. We were greeted and seated in the beautiful renovated dining room  by a very friendly woman. \nWe were so happy to see Vinny who is always so lovely and makes you feel at home. Lunch was delicious,the waitress was excellent.\nWe can’t wait to come back n try the dinner menu.",
   "We started to come here for special occasions and it exceeds our expectations every time! The food, the drinks and the staff are all amazing. They make it worth every dollar, every time. Plus we never leave without leftovers! I recommend this place to everyone",
   "Pizza was pretty good and only slightly pricey. I was disappointed that when we picked up 4 large pizzas they didn't offer any free soda or even plates and napkins for our takeout order. And while it tasted good, it was weird to have a margarita pizza with arugula and stead of basil. The pizzas also could have had slightly more sauce. I didn't want to ask for extra sauce not knowing initially how much sauce normally comes on it. We will try out other pizza places in Dover, but are likely to come back to this one again.",
   "Recommend to everyone. Food was great. \n\nI have been there a few times and each time it is really good.  The place is very clean and has a comfy seats. The place has a nice are inside and out with nice pictures tables and looks. Then once I got inside it became better. The staff was friendly and helped us to a table then took the order very fast which was nice. The pizza was the best it was the perfect slice and was cheap for what you get. Would recommend to anyone.  The place is very different from before. But I can’t wait to come back many more times.",
   "Ducked in with the sis, Cousin Mike and Karen, and their brats for some outstanding Italian food! \n* Massive Chicken Parm portion\n* Best Fettuccine Alfredo I've ever had! Abundant chicken! \n* Excellent Balsamic Vinegar dressing, nom! \n* Bread and Olive Oil with every meal. \n\nFairly priced, family vibe and energy, gorgeous looking pizzas! AHHHH!\n\nCabeza Out!"
  ]
 },
 {
  "name": "33 West Ale House & Grill",
  "address": "33 W Loockerman St, Dover, DE 19904, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1a601b06-9330-11ea-ad98-14b31f159f22.png",
  "tags": [
   "delicious",
   "walk",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10676509975699362788",
  "source": "GoogleMaps",
  "reviews": [
   "We were down in Dover to take my mother in law out to dinner for her birthday. My niece, who is local recommended 33 West for something different to try. It doesn't look like much when you first walk in. Very simple. But not in a bad way. They have a good beer menu and the blood orange martini was on point. They have different and interesting menu items. The brussel sprout appetizer is a must! Delicious! Our table had a variety of items from burgers and tacos to my pork belly and fried green tomatoes. Fabulous! If I had a negative it would be slow service. Very friendly though.",
   "Phenomenal time at 33 West. If you're a fan of Dive bars/restaurants and enjoy a great selection of food or beer? This is your place. Not to mention the service is fantastic.",
   "Awesome food! We went last week to Taco Tuesday and the taco's were soooooo good.  Every Tuesday they have a different two taco's. Look forward to seeing what next week has to offer :)",
   "Hit The Mark! Stumbled upon 33 while in Dover overnight on business. Service, atmosphere, quality, & flavor were all just right. Eclectic vibe and diverse crowd on a Tuesday night gave all the right cues we had chosen well. 2 things that drive up the review: 1-With the somewhat open kitchen I noticed the cook changing gloves often, thanks for that. 2-One of the cooks came out to work with another guest on her special order. The Eggplant Stack was full of flavor and cooked just right. Buffalo wings brought just the right heat and a touch of sweet. Other options caught my eye, so I'll have to get back:)",
   "The entrance is uninviting but once your round the corner to the bar area it is a cozy dinner spot. The Shrimp & Spinach was great with the miso ginger dressing. The Pan Seared Tuna Steak was cooked nicely but could have used some seasoning. Overall a good experience."
  ]
 },
 {
  "name": "Yukon Korean BBQ & Sushi Bar",
  "address": "865 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1aad9ede-9330-11ea-b8d8-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6622746856051673290",
  "source": "GoogleMaps",
  "reviews": [
   "I ate spicy ramen and my son ate shrimp udon. They were both great! Definitely we will repeat this place.\n\nI’ve read some other reviews, and noticed some complaint about their service. Oh well, they do not offer 5 star customer service. But they provide enough service, and definitely not rude at all!!!\nThey are just very shy and quiet voice. \n\nWell, food taste awesome! We saw lot of customer came in alone. Comfortable and relaxing atmosphere with tasty food.That’s what you can get here!!",
   "The food was wonderful and very fast. The quality was excellent, the service friendly, and the probs very large. I would definitely eat here again!",
   "I love the food here but over the last few years this place has changed. You do not get soup and salad when ordering two rolls anymore. Fish cakes used to come with certain meals but now we must always pay for them. Everything is still the same price (or higher) but you are now getting less. The staff is also noticeably less friendly and welcoming. It’s starting to seem more and more like it’s all about the bottom line and less about customer satisfaction.",
   "Very nice  restaurant. There is a lot of tasty asian food.",
   "Another great evening. Came in a little more than an hour before close with a big party. They accommodated us and we had no issues."
  ]
 },
 {
  "name": "Roma Italian Restaurant",
  "address": "3 President Dr, Dover, DE 19901, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1aff8fa8-9330-11ea-aa63-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "eat",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11025786243976187905",
  "source": "GoogleMaps",
  "reviews": [
   "We had a fantastic experience.  The food was authentic Italian and everything was delicious from the appetizers through dessert.  We had a large party and the service was impeccable, we never had to wait and the orders came out perfectly.  The only critical feedback, and it's not a show stopper, is the room we were in was loud.  We had a fantastic time and will return.",
   "I was very disappointed.   Unfortunately we had to be in the Dover area during the Valentine's weekend.  Decided to make the best of it and went out to what was described as good and somewhat romantic spot.  \nMade a reservation for early evening.  We arrived and our table was waiting.   Table wobbled.   First problem.  Second problem was the interior was ice cold.  My wife had to wear her coat to be warm and comfortable. Third problem was our salmon was served with a mixed vegetable that did not go well with the fish.  My wife requested angle hair pasta in place of mashed potatoes.  When the pasta was served it clearly was not angle hair.\nThen we were told that angle hair was not on the menu and that what was taking so long to serve it.  The night was not good and we eventually went somewhere else to eat.\nStaff was good, polite and professional.",
   "We went out for a birthday dinner, and everything from the moment we walked in was amazing. Our server Hannah was so kind and attentive, The young gentleman Ty who seated us was so pleasant. The food was absolutely delicious. From the appetizer to the dessert.  We will definitely be coming back.",
   "Amazing food! Nice cozy feeling.  Would recommend for a date night destination.  Only issue we had was the waiter was on top of us asking how every other bite of food was. All in all, very nice place!",
   "Roma Restaurant leaves Vincenzo in the dust. The difference is like night & day!!! All waiters and waitresses were very friendly and helpful. The warm bread and dipping oil was so good.  Dinner was super and I would definitely return not only for dinner but lunch as well!!! Very well run Restaurant, the ambiance is very welcoming and relaxing!"
  ]
 },
 {
  "name": "Grey Fox Grille and Public House",
  "address": "140 S State St, Dover, DE 19901, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1b4376b4-9330-11ea-a092-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "music",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=8196135642234569238",
  "source": "GoogleMaps",
  "reviews": [
   "Great food! Pleasant atmosphere. The Sous Chef visited our table to see how our meal went. This was a very pleasant surprise. In the several places we've eaten, that has never happened. We will come back for another meal.",
   "Lunch prices are fair but hubby's meatball hoagie was a tad spare. \nI got the Turkey Reuben and it was made perfectly, but again,  a little spare. \n\nBoth tasted good but disappeared too quickly. \n\nI got the tots and I thought it was something homemade. Seemed like something out of a freezer bag, and came out lukewarm. I mentioned this and was able to get new HOT fries.\n\nThe fries are almost too little for finger food and since they come in a stack they present as such.  Dumping them on the plate showed how teeny they were.  I think to be served in a stack or even eaten with a fork, they need more size. Also for more \"tooth\" satisfaction. \n\nI am a potato person so the perfect potato side could have made this a 5 star meal, even with the moderate portions. Maybe next time and I believe there will be a next time.",
   "A spectacular spot in downtown Dover for dinner and/or drinks. The only, and I Emphasize only reason I didn't give it 5 stars is that it closes too early! It would be a great place to hang out until midnight or later. The food is great the selection at the bar is great, but it closes too early.",
   "I loved the atmosphere... The music and the quaint little lights on the table... The food was very good. And very nice proportions... Only problem I had was that I couldn't find the food that was on this site. I'm assuming they changed the menu?",
   "This is such a unique amazing place to go they have these really cool interactive murder mysteries  they do to support the local charity Choose Joy and it is so much fun you have got to try it and it is for a good cause ."
  ]
 },
 {
  "name": "La Hacienda Dover",
  "address": "1171 S Bay Rd, Dover, DE 19901, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1b868634-9330-11ea-b0d3-14b31f159f22.png",
  "tags": [
   "food",
   "active",
   "eat",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12729632306657303506",
  "source": "GoogleMaps",
  "reviews": [
   "This place has a good atmosphere and quite good Mexican style cuisine. The burritos are my favorite, especially with beans and a side of their amazing corn cake. The dessert selection is great too with my favorite being the flash fried cheese cake. The only thing I'd say is not astounding compared to other Mexican restaurants would be their salsas as they just don't quite do it for me as they seem kinda bland compared to other places. But Overall this is a great place to go if you are in the mood for Mexican food.",
   "Waitress was very nice but service was very slow.  Waited over 40 min to get our entrees... place was not busy at all. Good overall was good.",
   "It’s a tough rating for me.  I went 4 stars but was leaning 3.  Pros:   The place was PACKED.  We almost didn’t go in figuring it would be forever.  Not the case.  Quickly seated.  Quick service.  Food came quick.  Servers were attentive and active.  So why leaning 3?   The food.  It was mediocre.  Our group all ordered fajitas.  I mean were they bad?  No.  Were they really good?  No too.  In the end the service bumped it up for me but it’s not a place I would go out of my way to come eat at even with the service.",
   "I'm still surprised by how much the quality of the food and the service fluctuates. I've been here a good number of times and I've had a great experience. But also about half of those visits have been just terrible experiences. If you stick with non-traditional Mexican food, you'll be pretty safe on getting good food. But others are a hit or miss. Like fajitas with nothing but onions as the veggies. Overall this isn't a bad place to visit, but when they charge you 2 dollars extra for hot salsa and don't tell you, it throws you off. It's not the best for the price.",
   "They have parking all around the building. They were busy when I came in, but I still found a spot.\nThis is a stand alone restaurant that looks like it could've been a fast food joint at one point. The place had quite a few tables and a large bar area. They had a slight wait for tables, but I chose to sit at the bar. The bar had a solid tequila selection of around 50 or so with a good top shelf. The service was top notch, everything I needed I got quickly. The decor was aesthetically pleasing. My only issue was that the floor was a little slippery in my sneakers.\n\nI ordered a Modelo bottle. It was cold and delicious. I also did a couple shots of 1800 which was about $9 a pop. Not terrible, not great.\n\nChips & Salsa!!!\nChips...solid chip, tasted like it should, and could hold a topping well.\nSalsa...the red was chunky and more of a pico, but a bit mushy. The green was a solid tomatillo based salsa, just a little on the tangy side for me.\n\nI ordered Stuffed Jalapenos:Four large jalapeno peppers, hollowed out and filled with our cream cheese mixture, then wrapped in back and broiled. Spicy, creamy, and savory in every bite! $8.99\nThey weren't wrong in their description. These were delicious, fresh jalapenos, wrapped in bacon. They misspelled bacon on the online menu lol. I was like what is back exactly? They also had a bit of showtime in there, coming out on a sizzling plate. Exciting!!!\n\nI ordered Street Corn: Steamed and grilled corn with mayo, cotija mexican cheese, and chile powder (optional) $3.\nThe corn was solid, I like it a bit sloppier, but this fulfilled my craving. I go nuts every time I see some sort of elote. I gotta have it!!!\n\nI ordered a tamale, although I don't see it on the online menu. It was chicken with verde sauce and cheese that melted on top. The masa was tasty, almost dry, but not. The chicken inside was good and flavorful. I should've used more sauce on this. I feel like the pork might be an even better choice.\n\nI ordered Tacos Al Pastor: Three tacos filled with our original al pastor seasoned pork, served Mexican taco -stand style. $11.99.\nI didn't see an option to get tacos like I normally do, so I went with the Pastor trio.\nThe pork was seasoned well and delicious. The flour tortilla tried to dry it out, so I used more of the green salsa to combat it. I wasn't asked my preference, I thought \"taco stand style\" would be corn tortillas. Nopeski! With that being said, they were good on the flavor meter, and loaded with meat.\nBeans...chunky texture, nothing special, serviceable.\nRice...soft, fluffy, a little crisp, nothing special to me."
  ]
 },
 {
  "name": "Chaiyo Sushi & Thai",
  "address": "1030 Forrest Ave #116, Dover, DE 19904, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1bcbdc0c-9330-11ea-83c7-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3403964425045476314",
  "source": "GoogleMaps",
  "reviews": [
   "I love going to here. The customer service is great. Their service is fast and I've never had a complaint eating here",
   "Took my tiny human here tonight and we are in love. They have a variety of options for various types of eaters. (We are vegetarians and were not disappointed)",
   "I've been meaning to go here for a while and I was certainly not disappointed! The sushi was amazing, and it wasn't overly expensive. They have a wide variety of options, between both the sushi and the Thai food, I'm looking forward to coming back here soon!",
   "Excellent selection of sushi and dishes on the menu, friendly customer service,  and dining experience. I recommend the Pad Thai and anything from the sushi menu! This is one of my go to places for dining out as well as takeout.",
   "Good food and service, reasonable prices."
  ]
 },
 {
  "name": "Flavor of India",
  "address": "348 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1c1011a8-9330-11ea-84fe-14b31f159f22.png",
  "tags": [
   "food",
   "affordable",
   "delicious",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2226370125506794997",
  "source": "GoogleMaps",
  "reviews": [
   "We were looking for a vegetarian restaurant and found this restaurant in Dover.   We found the food surprisingly good, perfectly seasoned and prices are affordable.   The only downs the service.   We were the only occupied table for a late lunch and the lone server not only forgot my order but the demeanor is not very welcoming.   He refilled our empty water glasses just when were about finished and getting ready to pay the bill.  The food is good but service  just left a lot to be desired .  I am giving it a three for the food",
   "Fantastic...as usual. Please keep Dover's Indian restaurant- Flavor of India, alive & well as we all strive for the same!\nExcellent large menu, rich, delicious flavors, generous portions and fast professional check out!\nAnd if you've never tried it...its the perfect time!",
   "This Indian restaurant serves the greatest Indian cruising in the area. I was very pleased with the service as well as the quality and presentation of the food. Thank you and will revisit again!",
   "I usually reserve my ratings until I've frequented a place at least several times, but this Restaurant deserves a 6 Star rating. It was my only my second visit and the food is absolutely spectacular. The server is immensely attentive to all his customers, and the owner consistently interacts with her customers. BRAVO👏👏👏👏👏👏",
   "I don’t agree with comments that the food is bland.  I enjoy getting take out here.  I stay away from buffets so I can’t rate theirs.  My only complaint would be when I ask for extra spicy, I’d like to feel some burn.  It’s tingly at best.  I plan to continue to eat here even if the food isn’t as hot as I would like."
  ]
 },
 {
  "name": "Franco's Pizza & Pasta",
  "address": "1708 E Lebanon Rd, Dover, DE 19901, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1c58d940-9330-11ea-9ffd-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1040412918231606203",
  "source": "GoogleMaps",
  "reviews": [
   "The bread was delicious. The pasta was delicious. Everything was delicious. Service was a touch of slow, but the place was busy. Definitely would come back.",
   "This was a great pizzeria! This was my first time here and I am very picky with my Italian food places. The star of our dinner show was a huge Stromboli that was rightfully called \"The Works!\" This Stromboli was filled with much pizza goodness! It's crispy tasty crust was wrapped around loads of meat, mozzarella cheese and tasty sauce!! Oh yess! So we'll be back to taste more of Franco's menu!",
   "AWESOME FOOD! Served hot from the kitchen. No sitting under heat lamps here, nice, the Italian bread is freshly made on the premises. Couldn't ask for a better meal. I saw some pizzas people ordered that looked delicious! Great service! Generous portions! I ordered linguine in oil and garlic with shrimp, wow I couldn't believe how many shrimp was in this dish. Big portion. Definitely a go to place for Italian food. Hardest working, attentive manager, Marco, I've ever seen. It was busy, he jumped right in, took orders, served. Owners did an excellent job choosing him. We go to Dover every year and last trip found this little gem. I will def stop for dinner again, probably more than once. We LOVED THIS PLACE!!!",
   "I haven't been here in years until recently. Had a look in the kitchen and guys are kicking butt during the lunch rush. The wings and pizza are pretty good.",
   "This place was like a hidden gem. The food is good, the service was friendly, and well priced. You wont be disappointed."
  ]
 },
 {
  "name": "Rice Restaurant",
  "address": "45 Greentree Dr, Dover, DE 19904, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1caf3b46-9330-11ea-8175-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9501989298805110920",
  "source": "GoogleMaps",
  "reviews": [
   "Such a great recommendation from my brother!\n\nThis is some of the best Chinese food I've ever had. The service was prompt and so incredibly respectful and friendly. The food came out promptly and servings were enough to make two meals out of a single order.\n\nI'm a fan of spicy food and the spice here is hot but not in a way that overwhelms the underlying flavors. The sushi was also excellent and tasted fresh and you can even watch the chefs make it in the dining room.\n\nWill definitely return to continue eating my way through the menu.",
   "The owners were very smart for being open on Christmas.  They were the only sit down place open.  The place was packed and I know why..... Food and service were great!!! \nDining area was cramped, the tables too close so getting in and out of seats were interesting.  Overall very good food, lots of veggies, everyone was happy and not too expensive at all.",
   "Always very fresh and delicious! Their spicy tiger roll and hot lover roll are 2 of our favorites!!",
   "The best sushi I have ever had. My favorite sushi place. Cannot complain about anything. Great food and great service too!!",
   "Rice food was delicious! Presentation was amazing. I didn't think to take other picture but the sushi was amazing."
  ]
 },
 {
  "name": "The Countrie Eatery",
  "address": "950 N State St, Dover, DE 19904, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1cf34946-9330-11ea-b902-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "eat",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=17793423315432117372",
  "source": "GoogleMaps",
  "reviews": [
   "This was a little place we happened upon on our way home from the beach. We stopped for breakfast and it was absolutely delicious. Our waitress was outstanding. She was so friendly and attentive. Always right there to fill the coffee and that place was hopping. My only complaint was the bathroom situation. For a busy place, they only have 1 single bathroom for men and 1 for women, so there was a line. Must be a local favorite since it is a little out of the way, but so busy. I would definitely go back again.",
   "This place was not good. The only good thing about it was the size of the portions but the flavor was off. The problem with the eggs is that they were overcooked and under seasoned. The potatoes had no seasoning. One of our family members got a chip beef waffle and it literally came with 2 tablespoons of chipped beef. There were so many flies in the dining area that I felt like I kept swatting at them. The inside was very dated and dirty. I don't understand why people are giving this place such good reviews. One thing that was nice is outside there is a little overlooked that allows you to feed the fish below. That was fun. But I review based on food and restaurant and this place has a lot of opportunities for growth.",
   "Service was exceptionally good and the liver and onions are to die for! The red snapper was perfect. The crab cakes have a little too much filler for me, but I usually make my own and dont use any filler. I'd go back again.",
   "Please do not eat anything other than breakfast here! The seafood is frozen and was served semi-raw. The scallops were chewy with NO flavor. The crab cake and stuffed shrimp were also completely filled with bread. Both the manager and server were not very apologetic about our experience and was told “dont worry about it”, when requesting a partial refund.",
   "If you are in Dover, this is the place to start your mornings, take a break for lunch, or settle back and enjoy a peaceful evening dinner. On our five day trip to visit family, we enjoyed two meals here. Breakfast and lunch helped to make our trip to Dover a most memorable trip. The breakfast for me consisted of scrambled eggs, french toast, and bacon. Simple items but they were darn near perfect! Both visits we were blessed to have excellent service! This place is not to be missed if you are in Dover! Enjoy the wildlife on the mini deck overlooking Silver Lake too! The kids will love it..."
  ]
 },
 {
  "name": "MISSION BBQ",
  "address": "365 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1d3b00c6-9330-11ea-aacb-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11033629124153755726",
  "source": "GoogleMaps",
  "reviews": [
   "Great flavors, great menu, great selections and GREAT customer service! The Slow cooked Beef Brisket is to die for, it melts in your mouth. The sweet potatoes, mac n cheese and Sweet Tea set it off 😋",
   "This location catered food at my place of employment the end of last year and it tasted amazing. I went on 2/15/20 and had the pulled pork, pulled chicken, Cole slaw and green beans and was totally disappointed. I'm about to toss the rest of the food because I'm not going to eat it. So disappointed. I guess it depends on the person. My friend had the ribs and he thoroughly enjoyed them. Try it for yourself. Great cause so I'll continue to support them occasionally.",
   "OMG!! What is not good about this place?! I don't know! Everything was delicious, the ribs were just like they are supposed to, falling off the bone. The brisk was tender and delicious. The sausage was good... The mac and cheese 🤯🤯🤯🤯!!! The string beans were really good also. The Turkey sandwich delish, even thought it looked dry, but it wasn't! The corn cake was one of the best! The pull pork was so flavorful. Also, I loved almost all of the BBQ sauces they had. I cannot forget about the staff!!! The best customer service I have had in such a long time. They were all so wonderful. I somehow wished I lived here to have it again. Love this place.",
   "Excellent all around!  The Cashier was friendly and helpful, the prep guy was great and they brought out desserts for us since it was our first time there.  Great food, great service, will absolutely come back.",
   "I’d give it 100 stars! Perfectly cooked and prepared. Minimal wait after order at register. Seating in clean rustic canteen style with ample seasonings and paper towels at each table. Much genuine military and responders memorabilia displayed throughout."
  ]
 },
 {
  "name": "McGlynn's Pub & Restaurant",
  "address": "800 N State St, Dover, DE 19901, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1d83c9fe-9330-11ea-a857-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7070013303687433056",
  "source": "GoogleMaps",
  "reviews": [
   "Would definitely come back here. Food was very good and our waitress was friendly and attentive. The hostess, not so much, but that was a one minute contact until we got seated. Nice view onto lake. \nStuffed meatballs and roasted corn appetizer. Jambalaya and Kitchen Sink burger for entrées. All were very good. Restrooms clean and attended. When we went the bar area was \"buzzing\" so it might be a little difficult for anyone with hearing sensitivities. Many menu options including entrées, burgers, sandwiches, and salads.",
   "We love McGlynn's! Great food and specials. Attentive staff. You will enjoy the view.",
   "Food is great, Service is even better, location is amazing during the day and if you can see Silver Lake, decor and atmosphere are amazing.  My only gripe...As someone of Irish blood, is one would think that a place that has an Irish name, Irish decor and themes; that they would serve more typical Irish food. Guinness Lamb stew, corned beef,  Shepard's pot pie, potato and leek soup.  But no, I see nachos, fish tacos, burgers, and bourbon on the salmon. Don't get me wrong, what they make is really good, and worth going back for more. It just doesnt fit. I think a menu revamp would serve this place well.",
   "The Kitchen Sink burger is big and very tasty with lots of toppings. The colossal crab sandwich was good but I wouldn't call it colossal. Could have definitely eaten another one to be satisfied. Good selection of drinks and free popcorn. Great location right on the water!",
   "Had the kitchen sink burger, some Yuengling and plenty of local entertainment in the form of fights and singing. DJ was pretty good too. We got in late and needed some food, everyone's was pretty decent and didn't take very long considering it was a Friday night and the bar was packed. There was however a nice fight that broke out, barf in the bathroom, and some pretty rowdy patrons but hey, it's a bar. We had fun. Food was good. Would go back"
  ]
 },
 {
  "name": "Kabab Korner",
  "address": "706 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1dc52238-9330-11ea-bd4c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "affordable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4600141825699430464",
  "source": "GoogleMaps",
  "reviews": [
   "Surprisingly surprising! I call it no2 my happy place. It is small but Service is amazing, Dennis is the man!! Very skilled chef and he would try to please you as much as possible if you want to mix match from the menu. I LOVE THE CHICKEN CURRY, ALWAYS THE SAME!! People drive by because of the location on main road but definitely worth the stop. Food leaves your stomach warm and full. Completely listen to the server's suggestions on what to order. Quickly became a favorite place for my husband and I to have a lovely quiet meal. What I would call a diamond in the rough.",
   "This place is surely go to without a shadow of doubt. The best served Chicken Manchuria in the US so far. I have lost count how many times I have had it in last 3-4 years.",
   "I really loved this place. The food was great and the staff friendly. I'll be going back soon!",
   "Really good food!  I always get the chicken kabob wraps or ginger chicken w/ rice.  The chutney sauce sets it OFF.  The prices are very affordable, if you dine in, service can be slow but take out is prompt.",
   "This last experience was disappointing. The Chicken Tikka Kabab were NOT fresh. It was little cold in the middle and had no taste and flavor. The worst thing, it was cold from center and was definitely made from frozen premade. \nI'll be honest and upfront. I visited this place almost 3 yrs ago and it was not like this. The kebabs I ordered were freshly made and had very good flavor. \nThey are adding an Indian grocery store to this restaurant.\nI hope they will improve on their food preparation and maintain a better quality fresh product."
  ]
 },
 {
  "name": "Bangkok Thai Cuisine",
  "address": "266 S Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1e0f78ba-9330-11ea-b651-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7179166677488739108",
  "source": "GoogleMaps",
  "reviews": [
   "Every single food item we ordered was amazing! Tofu was perfect, real crab meat in the fried rice, and tempura veggies! Yuuuuummmmm😍😍😍😍😍 service was out of this world! Thank you Nicole ❤️ you are the best!",
   "My father found this little hole in the wall and I couldn't have been happier! Food came with good sized portions and the beer was actually pretty good! Definitely recommend!",
   "Food was good yet service was not. I had ordered some mussels and yet they did not come out until after a regular came in ordered and he had his soup before I even had my mussels and his food came out before I even got my soup. He had really good fast service while I had slow. He was give a condiments try full of sauces. I had to ask for one.",
   "Some of the best Thai food around. Thai food is one of my favorite cuisines and I have favorite restaurants in San Diego and DC. This compares with any major city in quality. Small town vibes and very friendly service. I love this place. \nThe duck is amazing\nPineapple fried rice with lamb\nGinger with beef",
   "Family really enjoyed their meals, and my wife loves the bubble (boba) tea."
  ]
 },
 {
  "name": "Speedway Cafe",
  "address": "737 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1e5ad9cc-9330-11ea-9857-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7033477924341134787",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped in tonight to try their new vegan options. The Italian sausage on flat bread with the peppers and onions was very tasty. Super glad to see a local establishment now offering vegan options. They've added even more to their new vegan menu, and the Gyro was amazing!",
   "Food and service were fantastic! First time here glad we didn't wait any longer we will surely be back. Prices are certainly reasonable especially with the amount of food served. Only thing I would tweek is the creamed chipped beef gravy.... not a whole lot of flavor lil more seasoning and it'd be on point 😉",
   "The food is typically good but it's not always the cleanest place. They offer inexpensive breakfast specials most of the week and the staff is always friendly.",
   "My new favorite place to eat in Dover. Colleen has become our favorite server, just a very pleasant person! Food tastes home made and huge portions! You know it has to be good because I rarely give out 5 stars so you know they deserve it. I am moving to Dover soon and I'm looking forward to being able to stop by there and becoming a regular diner here.",
   "That 5 egg omelet is spectacular! Can't say enough about it.  The wait staff is exemplary."
  ]
 },
 {
  "name": "Grotto Pizza",
  "address": "1159 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1e9fe148-9330-11ea-9f18-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "walk",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10918916011396454362",
  "source": "GoogleMaps",
  "reviews": [
   "Great pizza with an adjacent sports bar. They could do better with keep the place clean (lots of trash on the floor). Overall they have excellent service. Plus their bartender had a heavy pour which was great.",
   "I was at the bar in this review but the bar staff were very friendly and attentive. Wasn't a second that my cup was empty without someone making sure I was okay. Ordered some tenders afterwards and they were fresh and hot.\n\n Definitely coming back and should to James for helping out the bar staff and making my experience even better!",
   "Wow!  The Mama Grotto Pizza is so good.  I never knew there was such a pizza.  It's just delicious.  Thank you for fast, efficient, and friendly service.  The store was very clean and Tonya was quite helpful giving me plenty of napkins, plates, and packets of parmesan cheese.  The restroom was spotless.  Thank you Grottos for my beach experience in March.",
   "I just had to laugh at our experience. Stopped in on the way to the beach as it was late evening and we wanted our favorite pizza. 4 tables total occupied in restaurant, we were seated, 2 employees passed by us probably 20 times neither one saying a word or looking at us. Waited 20 minutes for a girl to say she would be right with us (same one that kept waiting table right behind us). She knew we were ready to walk out. Big mistake coming here, pizza was delicious so that's why I gave it a star but wish I could give negatives. What we hoped to be a semi short stop, ended up an hour. No sense in complaining to staff because they all stood around on phones or talking, obviously didn't care to check on us. I have NEVER  seen a popcorn machine this dirty, looks like it caught fire..nope..girl closed up machine for the night and left it as is. Never EVER will go back to this one, this location gives Grotto's a bad look!! Visited 7/17/19. 8pm",
   "While on our way to a wedding in DE, we decided, on a whim, to give Grotto Pizza a try for lunch. The atmosphere of the restaurant was very family friendly! An open, spacious dining room, arcade/game room for kids, and a bar for the adults. \nPizza was the obvious choice for lunch, as I was anxious to give it a try for the first time. Unfortunately, it didn't pass the test for a decent pizza pie. The crust was too soft and undercooked. A bit more crispy would have been ideal. The sauce wasn't bad, but it definitely wasn't anything that stood out. The biggest \"killer\" for me was the over abundance of cheese. Way too much, to where the pizza was loaded with grease, and it almost made it difficult to swallow without the cheese getting stuck in my throat. \nI'm sure it's a great pizza for the locals and that is absolutely fine. But I've had excellent pizza in my travels, and unfortunately  Grotto Pizza is not one of them."
  ]
 },
 {
  "name": "Hibachi Japanese Steak House",
  "address": "691 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1ee62f6c-9330-11ea-ac89-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "eat",
   "food",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=11894083667072697194",
  "source": "GoogleMaps",
  "reviews": [
   "We always have a great time at the Hibachi Japanese Steak House.  They have great specials for lunch on the weekend.  The service and food we're both fantastic.",
   "Overall a fun and delicious experience. We were seated relatively quickly, and we got our drinks and salads within just a couple minutes. The salads were fantastic, but the sodas were just seltzer water, without syrup.the waitress was friendly and understanding, and brought out fresh drinks. I ordered the crunchy spicy California roll which was delicious. The Hibachi chef was friendly, and good at what he does. The chicken and shrimp combo was delicious. I am only giving 4 stars because I (and it seemed like other patrons) was uncomfortably hot. Hibachi places tend to be warmer, but this place more so. I also give 4/5 as the price tag was a bit higher than what I have seen at other hibachi places for a nearly identical meal.",
   "Well you know I say it as it is. This is a good restaurant with good tasty food! A little pricey but good things come at a price I love the Tat roll and I got shrimp  and scallops habachi which was also tasty. Portions was reasonable I am not sure if it's the same for take out as I eat in. Overall  you should visit. You wont regret it!",
   "Great service. Excellent meal.",
   "I love their salad and house dressing.  I would go there just to eat that. Their steak and shrimp is delicious. We were served with an abundance of good and it was so good. The rice was very good too."
  ]
 },
 {
  "name": "Diamond State Grill",
  "address": "913 S Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1f2904f6-9330-11ea-88ed-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "delicious",
   "food",
   "eat",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1396358458320720874",
  "source": "GoogleMaps",
  "reviews": [
   "This is a locals place. But they welcome visitors all the time. It’s owned by a hard working local couple who welcome everyone. I eat here often, they know their clientele and the food is homemade. They do get busy at times since many enjoy eating there. Don’t give the negative reviews any thought. No matter where you go someone will always complain or inappropriate allegation. If you want good home cooked food in a casual atmosphere you can’t go wrong.",
   "Food is topnotch. Very friendly staff. I like going there",
   "I really like this place for breakfast! Their french toast are DELICIOUS! And their pancakes are huge!! Their food is not greasy at all and the waitresses are very friendly!",
   "We were in the Dover area and we're looking for somewhere to eat breakfast. And found this place.  Food was good and prices were great. Service was quick and friendly.",
   "Amount of food compared to price is on point! Waitress was awesome, very attentive. Owner/cook noticed hubby and I were under the weather and before we left, sent us home with a huge container of their homemade chicken and pasta soup...NO CHARGE!! The soup was delicious. Sounds crazy but when you don't feel good, it was like having your mom take care of you when you were little. Made us feel like we were family. 😊"
  ]
 },
 {
  "name": "Governors Cafe",
  "address": "144 Kings Hwy SW, Dover, DE 19901, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1f6f0ed0-9330-11ea-b990-14b31f159f22.png",
  "tags": [
   "historic",
   "active",
   "delicious",
   "unique",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8004302287002635489",
  "source": "GoogleMaps",
  "reviews": [
   "Sitting on the front porch on a clear spring day with fully blooming trees and the scent of fresh flowers:PERFECT!  What an historic and significant setting for a restaurant. We had salads that were tasty and served quickly for our executive lunch on a weekday. Asparagus and chicken that was tender and covered with pesto. This is a new favorite place for me in Dover. The room with the Governor pictures is awesome!",
   "I went there for a prime rib sandwich and a side of potato salad.  It was delicious.  The people there are supportive of active and retired military as well.  Very nice staff.",
   "Great spot for lunch. Cozy atmosphere, good menu with good prices. Staff always pleasant and attentive. Outside seating during warmer months. Parking can be an issue, but that's anywhere in downtown Dover. Highly recommend.",
   "Very unique atmosphere with a lot of beautiful wood decor and large fireplace. Can't say everyday that you dined in an old governor's mansion either. There's a restaurant, bar area and a little coffee shop/cafe. The food is pretty tasty and reasonably priced. Vegetable portions are oddly skimpy. Service is friendly and quick.",
   "Atmosphere is nice, there is an inside and outside seating area. Food is ok. Nothing amazing there yet which is why I gave 4 stars. They have good options though and a full bar."
  ]
 },
 {
  "name": "El Nopal",
  "address": "627 W Division St, Dover, DE 19904, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1fb36aca-9330-11ea-9c8a-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food",
   "food",
   "delicious",
   "cheap",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6892249279243909702",
  "source": "GoogleMaps",
  "reviews": [
   "This amazing place to eat.. the food is delicious but don't plan on fine dining or a dining experience....it's a very small home converted into a restaurant and they serve food on paper products..  But don't let that discourage you from trying this place...",
   "Food was decent. All of the food is freshly made. Guacamole is the best!",
   "The food here is so great! I've never been disappointed, the Steak tacos are my fav",
   "Delicious authentic Mexican food from Sinaloa region. Very cheap tacos, fajitas, beans, quesadillas, etc. Variety of nice hot sauces to add to your food as well. Filling plates and lots of good options. They also have a case filled with good Mexican sort drinks and a counter with lots of Mexican deserts and candies. Definitely a good experience!\n\nVery friendly service and usually seems busy with multiple take out orders.",
   "I went here and had a pretty big order. I recieved all my food hot and quickly cooked. I will definitely be going back. Thanks!"
  ]
 },
 {
  "name": "El Azteca Authentic Mexican Restaurant",
  "address": "859 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/20092d28-9330-11ea-8685-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=152069260378703721",
  "source": "GoogleMaps",
  "reviews": [
   "Good service, good food and clean tables. Prices are good overall and the portions have always been impressive. The owner is usually there and it shows in the quality of the staff. They're friendly and always helpful the several times I've been.",
   "Great Mexican food. Generous portions at an amazing price. I had the Grande Special dinner plate. It is somewhat of a sampler of sorts. Best bang for your buck in my opinion. Two plates worth of food for 12 bucks. Can't beat it.",
   "Food is always delicious and cooked fresh, also very good and polite customer service",
   "Great food! Good prices! Friendly staff! Delicious margaritas!",
   "I took the whole family here this weekend. I was very impressed. We were seated quickly, received our meals in a timely manner and enjoyed the experience. The food was very tasty. We will be back!"
  ]
 },
 {
  "name": "Pizza Delight By Giacomo",
  "address": "67 Greentree Dr, Dover, DE 19904, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/204bdab0-9330-11ea-9877-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "delicious",
   "eat",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10114753726712729444",
  "source": "GoogleMaps",
  "reviews": [
   "It was tasty.  It was a pretty standard pizza shop cheesesteak.  Big, 16 in, it probably would have fit nicely on a 14-inch roll.  I am very happy with my $14.75 total price for a 16-inch cheese steak and a draft of beer.  I don't know, I do know, I'm nitpicking but I would rather a full 14 in than an emtpy’ish 16 inch roll.  The pizzas look really good.  Good overall experience.",
   "The jumbo shrimp is only the size of a quarter, and was overcooked. The chicken fingers were overcooked. The containers were caved in because they were cheap aluminum. The calzone was put on a thin paper plate and shoved in the bag with the sauce. Tasted okay. The pizza was just okay, not great. I don't know why anyone would want to wait so long for this. Pretty pricey for the quality.",
   "Food, Service,and prices are excellent. The owner still visits each table to chat and make sure everything is good.",
   "This place has a nice variety of comfort foods on the menu.  I had a fried shrimp basket and was delighted to see that I could get onion rings instead of fries at no additional charge......... under $10. My companion had a chicken fingers basket and that chicken had big fingers... More like large chicken tenders. He said the fries were delicious. Our friend had pasta and cheese baked dish... I think it was stuffed shells. It was quite a nice serving and cake with salad and bread. She took half of it pasta home because it was just too much. I believe her dish was about $13. As we we're leaving we saw people eating pizza. Boy, that looks delicious too. And since we used to eat at their other location which is now closed, we know how good it is. We'll be back.",
   "This has got to be the best pizza place in Dover! We are a family from Connecticut and New York so we know our pizza and this was spot on!!  I don't know what one reviewer was talking about with her racist comments because when we went there the place was packed for dining and the take out line was out the door; all walks of life were in there AND NOBODY WAS TREATED DIFFERENTLY.  The staff was extremely busy yet friendly and the kitchen was clean.  This is now our go to pizza place!!!"
  ]
 },
 {
  "name": "La Tonalteca Mexican Restaurant",
  "address": "245 S Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/209abe48-9330-11ea-9fb2-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "unique",
   "food",
   "eat",
   "food",
   "walking",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=745993051542833375",
  "source": "GoogleMaps",
  "reviews": [
   "My wife and I walked in a half an hour before their buffet ended. When we told the man at the reception what we wanted he gave us a quizzical look and said he would have to talk to the manager. \n Mind you there are less than 10 other customers in the restaurant at this time. We waited 5 minutes for her to come out and say she didn't want to make any more buffet food so they wouldn't give it to us. \n So then we tell them we want to do normal dine in. They say ok and then we wait a few more minutes as they show each other some stuff on their phones before the man sighs, grabs 2 menus, walks us over to a booth in the corner and quickly drops the menus on the end of the table, spins on his heel and walks away without a word. We waited close to 10 minutes at the booth without anyone bringing us water or asking for our order before we got up and walked out.",
   "Wow, delicious food!  And large portions.  Stopped for Iunch while Christmas shopping and had a great meal.  The atmosphere is really unique, inside and out.  The waiter was very attentive, and the food was served fast.  Everything was warm and fresh, and of course warm tortilla chips & salsa.  We will definitely be back.",
   "This place closed down for a little bit or an unfortunate incident but the place looks amazing now you can tell they have up their game and straightened everything out love the food here love the atmosphere of the staff is very friendly they always give us exactly what we order we like to customize our orders a little bit and they always seem to get it right amazing Place recommend everyone to eat here...",
   "I was walking by this restaurant where the sign caught my eyes about tacos Monday. I was like great it’s Mexican and also I never had a taco! I went inside the restaurant and told the guy I would like to try the tacos also I never had a taco! Hoping that they will make a good first impression however I was seated then got a bowl of chips and sauce which was lovely. My tacos came out and I was like what?? I could have done this myself it was horrible! Not what I expected.",
   "I had canitas and it was delicious. The margarita was so good I had to get another one 😂. Hubby is driving me home 🤗. Hubby had entree# 234.I had a taste of his chicken and shrimp. It was nicely seasoned and tender"
  ]
 },
 {
  "name": "Great Wall Kitchen",
  "address": "425 S New St, Dover, DE 19904, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/20eec3d0-9330-11ea-a90a-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5625252137150938997",
  "source": "GoogleMaps",
  "reviews": [
   "Wow! We just moved from new york and were skeptical about the quality of their food, boy were we surprised! This place is amazing! The food was so fresh and flavorful! The best egg drop soup, fried rice, general Taos chicken, chicken mai fun, and boneless spare ribs. Oh and the spring rolls were delicious!! This is now our go to Chinese food place *NOTE they only take cash and it's not in the best area BUT everyone was friendly.",
   "One Of The Best Chinese Food Dover has to offer. Always fresh. Best chicken hands down. No Chinese store in Dover can compare on certain dishes. Been coming here since I was a kid. CONSISTENCY at its finest!! Go back to five wings.",
   "Fast, good food ,good price ,nice staff,clean place",
   "Tried the general tso's chicken, hot and sour soup, and the chicken wings. All were average.",
   "First off, out the gate... the location man o man. They don't accept card, cash only. I read all the reviews and it took me 5 yrs after being a resident in the city to finally get some. \n\nI went with the sesame chicken and the wings, FIRE! The portions go crazy! Overall the taste was decent whole time but the prices are a bit steep. Be safe when going, a bit sketchy but good food."
  ]
 },
 {
  "name": "Carter's Restaurant",
  "address": "2 S Governors Ave, Dover, DE 19904, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/213e1846-9330-11ea-b274-14b31f159f22.png",
  "tags": [
   "food",
   "historic",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1925359683702660432",
  "source": "GoogleMaps",
  "reviews": [
   "Carters Restaurant has and always be the best place for down home good food ever since I was in elementary school.",
   "This place is historic. Yes the decor is not the greatest. But most whole in the walls have no decor. Go, be nice to Ms. Carter, you'll enjoy your meal and keep it moving. I ordered fish platter with candied sweets and collards. It was great.",
   "The fried fish sandwich is delicious,  the greens and mac n cheese is good too",
   "IM SORRY I HAVENT TRIED THIS RESTAURANT SOONER. IVE LEAVED HERE 20+ YRS AND IM JUST NOW FINDING OUT HOW GREAT THIS FOOD IS!!!! MS CARTER YOU PUT YOUR WHOLE FOOT IN THESE GREENS AND FISH",
   "I always get the fish platter when I order from here. They give me a nice size platter! Good food and seasoned well!"
  ]
 },
 {
  "name": "Chick-fil-A",
  "address": "1440 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2181b29e-9330-11ea-9fc2-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "active"
  ],
  "link": "https://maps.google.com/?cid=17270514295524688779",
  "source": "GoogleMaps",
  "reviews": [
   "Had a bad day at work on a Friday and decided to pick up dinner.  The staff was so friendly and upbeat. Really elevated my mood. I hope that I can one day provide this level of service to lift someone up",
   "Staff is friendly, genuine and warm. The food is not fast food but it's fast. I was surprised at the efficiency. I don't eat fast food at all and it was delish! And I really like that they are closed on Sundays, the Sabbath. That is awesome.",
   "Great service, very active managers, and extremely fast and friendly associates.",
   "The drive-thru line went all the way through their parking lot and I was still in and out in less than 10 minutes! The employees were very pleasant and extremely efficient. Everything in my order was perfect. I would strongly recommend.",
   "Dover Air force Base is not the only military installation in this town. Chick-fil-A operates with military precision to deliver, On Time and On Target, the Lord's Chicken."
  ]
 },
 {
  "name": "LongHorn Steakhouse - Curbside To Go Available",
  "address": "505 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/21c225ae-9330-11ea-88dd-14b31f159f22.png",
  "tags": [
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=515299851192778573",
  "source": "GoogleMaps",
  "reviews": [
   "We always enjoy going to Longhorn but tonight was especially wonderful. It is our sons birthday. I didn't even tell the waitress, she must have heard. When desert was brought, my son's plate had a birthday candle and it made his whole night. Even another server who was not assigned to our table stopped to recommend good dishes and chat. It was an all around great experience! I recommend.",
   "Okay, no judgement please! I come to Longhorn once a week and seriously they are amazing. The Manager Steve really has the place flowing. Stop by and make sure you ask for Steve. Don’t forget to order some bites.",
   "Ted Kelly\nWe just ordered and ate! The cook is phenomenal,best tasting steak, Mac & cheese, bread good even cold. U like it done right this cook at 4pm is on the money. The chicken tenders are luscious. The salad is a real one weight & content, not the yellow ends of lettuce, cheese. I’ve never been disappointed the 3rd visit I’ve made.",
   "My husband and I ate here tonight around dinner hour. \n\nThe good- we were seated within 5 minutes(now we know why they weren't busy), and our waitress was friendly. The appetizer was good as well.\n\nThe bad- we waited a long time for our dinners to come out. I ordered chicken with asparagus and tomato, and literally had two tomatoes and two pieces of asparagus on top my chicken. It came out cold. Additionally,  my broccoli was raw......\nMy husband ordered a steak and fries, and salad. The salad was good. The steak and fries were barely warm. The steak was thin, about half as thick as one from the texas roadhouse, and then once home he has had bad heartburn tonight.\n\nAll in all, do not recommend,  and we won't be back. Two stars ONLY because our waitress tried! Even she felt bad when she saw we barely touched our food.....and are out $68........",
   "Great food with excellent service!"
  ]
 },
 {
  "name": "US 13 Grill & Catering",
  "address": "1115 S Governors Ave, Dover, DE 19904, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/220e1bbe-9330-11ea-b459-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=13930891462293685688",
  "source": "GoogleMaps",
  "reviews": [
   "We have been here several times and have never been disappointed.  The food is excellent  and the service was very good. The price is also very reasonable. I highly recommend this restaurant and I will be back in the future.",
   "The place is not too big bit it is well kept.  Nick was a phenomenal waiter. The food is good, presented well and not greasy. Price was just fair. Definitely will come back.",
   "My husband took me here today and I was thrilled. It was like a diner that reminded me of my home back in Pittsburgh. You can tell the crowd was somewhat full of regulars. I had a delicious omelet that wasn't over cooked and the potatoes are homemade(not shredded)  the coffee is never ending and our waitress very pleasant. The prices are fair also!!!! I am glad we went!!! I am looking forward to going back!!!!!",
   "Nice menu, variety of specials, clean and comfortable dining room, great service, very reasonable prices. The breakfast foods offered from open to close are always hot and delicious. (There's a 10% senior discount, but not on breakfast.)",
   "The breakfast was outstanding.   The staff was friendly and did an awesome job.   Loved it.   Very nice inside.   Very reasonable priced."
  ]
 },
 {
  "name": "Touchdown Restaurant",
  "address": "1666 S Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/225fb8a6-9330-11ea-bdff-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "food",
   "walk",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5131893138979292619",
  "source": "GoogleMaps",
  "reviews": [
   "I Ordered the ham dinner for myself and my daughter, our Easter dinner.  It was abdolutely delicious!  Rich, creamy mac and cheese, green beans seasoned perfectly and yummy sweet potatoes,   oh yes, ham...not too.salty, just perfect.  And dessert for later, cheesecake. Plenty of leftovers!!  Thanks guys for helping us make today special!   Paula, \"Another Modelo please!\"",
   "Great food. Plenty of room on the holiday weekend. DJ was good. Drink specials we're a big hit.",
   "Karaoke fun 😁 and wings",
   "The Waitresses are very friendly and they greet you as soon as you walk in, they bring you your food and drink before you even know it. The food is great and not overly priced. You can watch your favorite team play or you can watch all the games. If your team is not doing so well they got a pool table so you can play pool. The atmosphere is so great I've been going there for two years now. It's a wonderful place where everybody knows everybody,  it's like the TV show Cheers.",
   "Solid bar if you're out of town on a football Sunday and need somewhere to watch the game. There is a decent contingent of Buffalo Bills supporters as it's the local Bills backer bar. There are also a lot of Ravens, Eagles, and Washington fans, which makes sense considering the proximity. \n\nFood was pretty standard fare for a bar that knows what it is. Above average wings, respectable appetizer selection that comes across as competent. \n\nThey have the room to accommodate the crowd on a Sunday afternoon. Which means it comes off as roomy and comfortable on days when they aren't as busy."
  ]
 },
 {
  "name": "Betsy Ross Pizza",
  "address": "1294 Forrest Ave, Dover, DE 19904, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/22a5c29c-9330-11ea-979f-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7554695959434907541",
  "source": "GoogleMaps",
  "reviews": [
   "I told my friends about this place with my highest recommendations. I  go to this restaurant often. This recommendation is always successful. The dishes they serve are fantastic and the crew is attentive and cooperative. always when we go to this place we enjoy a gorgeous time.  I warmly recommend this restaurant.",
   "Excellent burgers and a yummy meatball sub. And the complimentary chicken soup is a hit every time. Thanks Mrs. T for the excellent service.",
   "Best deals ever.  Nowhere else across the US have I found a deal as amazing as their 24 wing and lg pizza deal.   For $25 you get 24 actual wings, not the winglets some major companies pass off, as well as a delicious original recipe pizza.   My favorite place since I was a child.",
   "My department just had some food catered for our nightshift. It was hot and delicious! We had so much food we were able to feed our whole team and some. It was delicious and no doubt we will be ordering again! And a huge shootout to the owner and workers who were just the best!!",
   "My wife and I enjoy eating here all the time! Their food is always good!"
  ]
 },
 {
  "name": "QDOBA Mexican Eats",
  "address": "1211 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/22ec4190-9330-11ea-a916-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=8900114753377080165",
  "source": "GoogleMaps",
  "reviews": [
   "Always a great experience at Qdoba. Very pleasant staff and excellent food for a reasonable price. Get the app to save.",
   "I live this food. The atmosphere is great. You can chill and relax while you eat.",
   "I go to Qdoba about once a month. My family loves the tacos and nacho bowls. The customer service was amazing!! Dan, Renee and Hannah made every customer feel special.  All the workers there had great teamwork.",
   "This place is worth trying. They have big portions for convenient rates. Constantly well kept and with excellent mood. Will visit here again.",
   "Try their impossible bowl and it’s really good with that tortilla soup and it’s a must try one in Qdoba and it’s a very nice option for vegans and especially for Indians."
  ]
 },
 {
  "name": "Pho Viet",
  "address": "155 N Dupont Hwy Ste. 4, Dover, DE 19901, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/23357fda-9330-11ea-a061-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "music",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=16232360668252721909",
  "source": "GoogleMaps",
  "reviews": [
   "This is a nice quaint Vietnamese restaurant located on Dupont hwy in Dover, DE. As a newbie to Vietnamese cuisine, I truly did enjoy my meal. First dish out was my appetizer, a nice fresh Shrimp Spring roll that was partnered with a delicious peanut sauce. I choose to order Pho combo # 2. This was a full bowl of rice noodles, mildly flavored Vietnamese beef broth that was boasting with tenderloin steak, brisket, tendon and meatball. My taste buds have now been officially elevated and I certainly will return!",
   "Visited here last week and the Pho is delicious! The broth has good flavor and there are sauces available if you want to spice it up. They bring out a plate of bean sprouts and basil to add as well. This bowl is a medium on their menu. The portions are very generous. Staff are friendly.",
   "The portions are really large, even medium sizes. I ordered a Beef broth soup. I started eating at 11:50am. It’s 12:22pm now and the bowl is practically full.\n\nThe spring rolls are awesome too. I wish the music was more traditional Vietnamese.\n\nI’d come again.",
   "Now this is a noodle place but that's not what I had. Pineapple fried rice w/ chicken caught my eye and I had to try it and egg roles. Loved it! The restaurant was very clean, service was busy but on top of things. Everything came out on time and very well presented. Servings are very large I'm looking forward to my left over. My wife did have the noodle bowl and loved it to. Definitely recommend giving this place a try. Cheers! 🍻",
   "We recently stopped in at Pho Viet on our way home from visiting Wilmington, Delaware. It's conveniently located just a few minutes off the highway and there's plenty of parking in the back. We grabbed a seat inside, ordered the vegetarian (tofu) spring roll as an appetizer and then got two entrees. Caroline got lemongrass chicken and I got chicken pho. Both were delicious. The pho broth was perfectly seasoned and salty and the portion of noodles and chicken was generous. It was also piping hot and came with fresh basil and sprouts. The lemongrass chicken was a high quality cut of chicken and also super flavorful. The staff is super friendly and eager to help. We'd definitely make a return visit. It was awesome. Next time we go I think we'd try one of the Louisiana/New Orleans specialty items on the menu."
  ]
 },
 {
  "name": "The Boulevard Live Entertainment Restaurant",
  "address": "1036 Lafferty Ln, Dover, DE 19901, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2398878a-9330-11ea-a6b9-14b31f159f22.png",
  "tags": [
   "music",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8338849237793340762",
  "source": "GoogleMaps",
  "reviews": [
   "It was my first time being at this place. I had fun. The drinks were fantastic. I enjoyed the music. Nice crowd.",
   "Very elegant and convenient place. They offer big meals and for fair prices. I loved the meals very much and the staff were super affable and chatty. Will definitely recommend this place.",
   "This was my first visit to see Mike Philly Jazz concert on Valentines day. Tickets were $55. The Jazz show was remarkable, one of the greatest shows I've seen!! The food was tasty. However, I waited 2 hours and 30 minutes to get my food and my husband order was incorrect and he waited and additional 30 minutes. Then when he recieved his food...they ran out of the vegetable he ordered. No exaggeration it was unbelievable and disaster experience!",
   "Attentive Bartenders, great food and the vibe is everything.  Meant the owner and he is man of good character.  We will be back and bringing friends",
   "The best 30 and over club and great bar and grill around. Want grown and sexy  the boulevard is where to be."
  ]
 },
 {
  "name": "Chaiyo Sushi & Thai",
  "address": "1151 E Lebanon Rd, Dover, DE 19901, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/23ee970a-9330-11ea-9d81-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=359654046156455296",
  "source": "GoogleMaps",
  "reviews": [
   "Commercialized atmosphere. Food was good but average. If I could give the customer service and waitress a rating a 5 I would. They were wonderful. They made up most of the stars on this rating.",
   "Ordered online for delivery and food came over 20 minutes past the ETA. While that may or may not have been the restaurants fault, once we finally got out order, we were missing food. I called the restaurant 20 times.. (not exaggerating) and didn’t get an answer. I guess we’re just out the money? I honestly feel robbed.",
   "Food was awesome. Service was awesome.",
   "Had 2 bad points.  First, the ordering “online” system had an Issue and my order was not ready when I got there.  Also, when I got home, realized that the curries did not have the proteins in the curry.  Didn’t get any comp for food being late either.  The curry itself, spring rolls, and the  crab rangoons were good.  But won’t recommend doing the online service.",
   "Absolutely great food. Me and my wife we in town for 5 days and we came here 3 times.  And it got better each time.\n\nDrunken noodles were amazing, and the red curry was great.  Spicy tuna tempura roll was the first spicy tuna I've had that actually had some kick to it and it was fantastic."
  ]
 },
 {
  "name": "El Pipil Restaurant",
  "address": "720 Townsend Blvd, Dover, DE 19901, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/243cb312-9330-11ea-9d00-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4627358413197848349",
  "source": "GoogleMaps",
  "reviews": [
   "Nice little place, food was excellent, decor was nice. Would definitely recommend. Food was fresh and authentic. Not very busy but should have been prices were reasonable. Staff were nice and fun",
   "Excellent food and love the environment. My family lives right up the street and I don't know how I've driven past for so many years without stopping. It's a weekly visit for my girlfriend and I now.",
   "Ok, El Pipil Restaurant (pronounced Pee-Peel)(I know, funny, right!? I bet you will always remember it that way...lol) anyways, it is not visible from the main road but if you are near Lowe's Dover search \"latino food\" and it should pop out on the first 5 searches. The food was very good as it looks in the pictures, lots of flavors and spicy if you wanted it spicy. Since we went late at night there was almost no wait time. The tables are lovely decorated with beautiful carvings resembling typical scenarios of latin culture and don Freddy is wonderful host (as long as he is not busy :) but he'll always try to please you)",
   "They serve large portions and for convenient prices. super nice staff members. Will visit again.",
   "The food here is always amazing. Definitely a diamond in the rough. The most authentic you can get"
  ]
 },
 {
  "name": "Outback Steakhouse",
  "address": "1574 N Dupont Hwy Ste. 800, Dover, DE 19901, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/24838f12-9330-11ea-b639-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1516010080134468689",
  "source": "GoogleMaps",
  "reviews": [
   "Very good right from the door. I don't think I've ever ordered food served looking exactly like the photo on the menu until now. Delicious and served fast... Loved the atmosphere and the wait staff was very friendly...",
   "Food was great. Service was excellent even though they were busy. They gave us enough time to eat our salads before bringing out the main course, which is a very underrated skill. Thanks",
   "Great bar staff food was tasty and came out quickly! Complementary desert for my birthday",
   "Outback is a great chain restaurant. One thing I can say from a couple experiences at this location. If you have an issue with your food manager will come to your table. They will work until it's to your satisfaction and take care of you. Very courteous and professional.  Not something that is practiced well today. Thanks Outback and your wonderful staff!",
   "I went for my 42 birthday. Waited 2 1/2 hours to be sat. What does call ahead seating do for for parties of 8 or more if they aren't gonna have a table prepared for that many people you call for? Seriously!!!!!"
  ]
 },
 {
  "name": "Pats Select Pizza l Grill",
  "address": "1224 Forrest Ave, Dover, DE 19904, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/24cbe0fe-9330-11ea-89d1-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8446938726273471524",
  "source": "GoogleMaps",
  "reviews": [
   "Had the best service and super customer oriented experience! I placed a large order and the guy helping me was beyond helpful at checking the accuracy of my order. I forgot one part of my order and staff member came out and reminded me! Very appreciative of their patience and helpfulness.",
   "I normally like places that aren't chains when it comes to pizza, but this place is pretty good. I haven't had anything here that I didn't like. It's all good. I really like their appetizer egg roll cheesesteak! The pizza is good too.",
   "okay so I've been here two times. I can't even begin to express how much I love this place. The food is so good. It's always fresh. The salads are phenomenal. There are plenty of salads to choose from and I'm not talking about your average garden salad. Pretty much something. The dressings match the sounds perfectly. When you get the food it actually looks like the pics from the menu. The establishment is always clean the staff are always very friendly and they never botch my order regardless if I'm ordering for 2 or 6. It's fairly new so it's common for new restaurants to provide outstanding service. let's just hope in time that everything remains the same and I will remain a customer because I recommend this place to lot of friends I've even been here with my family two out of the three times and they love it and the elderly people in my family are really picky so gold 🌟 😉 KEEP UP THE GOOD WORK! PS-the prices are slightly higher than the average pizza place but this isn't your average Pizza joint so I think its right on the money!",
   "I hadn't been to this Pat's in 4 years. We took 3 of our grandchildren there last night. I was pleasantly surprised by the improvements in decor, menu, quality of food and service. Our server was Kristen. She was personable and attentive and did a great job.  The food was very good. I will definitely go back.  I reserve 5 stars for high end dining experiences so a 4 star rating is a top rating for Pat's from me.",
   "Super friendly staff, resturant was spotless, food was excellent and reasonably priced. Highly recommend the shrimp and crab bisque."
  ]
 },
 {
  "name": "Simaron Pizza & Steak Shop",
  "address": "415 W Loockerman St, Dover, DE 19904, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2514a734-9330-11ea-b582-14b31f159f22.png",
  "tags": [
   "food",
   "tasting",
   "free",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=5311993160239936333",
  "source": "GoogleMaps",
  "reviews": [
   "Really good food. Amazing service. I highly recommend.",
   "Discovered this place a few months ago and have been going back a few times a week . Great menu and staff. Looking forward to tasting more of their menu. 🙂",
   "They cook and serve free Thanksgiving dinners.  They also make a very good cheesesteak.  Pretty cool grandmother eclectic mix of stuff hanging on the walls.  The three people behind the counter seemed to be getting along very well as they cranked out a lot of food at 10:30 a.m. on a Saturday morning in January in Dover.  The other half of this Cheesesteak was hard to give away but the person I gave it to was very excited to have it so that eased my pain, a little.  Great overall experience.  Yes, they got some well deserved ‘Great People’ points.",
   "OMG the portions. The quality. The selection. The cops eat here so you know it's good. Don't order if you're not hungry. You'll have leftovers. The cheese steaks are the best in Dover. Period.",
   "Just finished a cheese steak from here. I ordered on line for pick up thru Grubhub. \nIt’s been a while but seemed better than I remembered. One of the best I’ve had from anywhere in a long time.\nProbably the best in Dover. Service was fast and very friendly."
  ]
 },
 {
  "name": "King Buffet",
  "address": "293 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/255ab110-9330-11ea-b9b4-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "cheap",
   "eat",
   "delicious",
   "eat",
   "food",
   "affordable",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7362045968800405567",
  "source": "GoogleMaps",
  "reviews": [
   "Great restaurant!\nVery cheap!\nGreat service.\nDelicious food!\nAmazing atmosphere. \nI travel a lot, and it’s one of the best places to eat ever! \nEverything time my family comes here we have a great experience!",
   "This is surely one of the finest restaurants in the neighborhood. Always when I visit this place I am so pleased. They keep their very high  level service and the highest level of cooking  they serve. You are always happy with this restaurant. Warmly  recommended.",
   "My experience at King buffet was GREAT.  I love the atmosphere and the employees are so nice and caring.  Maggie ALWAYS seems to come check on her customers to make sure everything is ok.  I have seen her go out of her way to make sure things are right.  Thank you for the great service that you give.",
   "DO NOT EAT HERE!!!. I expected a restaurant with an average of 4.3 stars to be at least acceptable. King buffet left a bland taste in my mouth with their old and dry assortments of Western dishes. If the owners focused more on affordable Chinese dishes instead of seafood and American dishes then the quality of food will skyrocket as well as keeping food costs down. People are going to take advantage of buffet crab legs as much as possible (even the employees seem to hoard the crab) so save your some money and focus on stocking up fresh, easy, cheaper, and delicious foods that people actually expect from a Chinese buffet. If the food wasn't dry and the assortment more focused then I would visit here again. Please save yourself some time and do not eat here, there's many more options for Chinese here in Dover.",
   "I've been coming to this place since I was a child. Maggie is such a great host she makes you feel welcomed and part of her family. She always greets everyone with a smile and assist with any issues if abay.\nGreat food and just a great atmosphere"
  ]
 },
 {
  "name": "Tropical Delight Cafe",
  "address": "1156 S Bay Rd, Dover, DE 19901, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/259f8282-9330-11ea-8675-14b31f159f22.png",
  "tags": [
   "drink",
   "free",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12878513433343151414",
  "source": "GoogleMaps",
  "reviews": [
   "How do I begin? -☆\n\n I research restaurants before I go in hopes that I'm able to find something good especially since there are not a lot of places in our area. Based on the reviews we willingly  drove 30 minutes away from our home.   I called ahead to ask if they had oxtails. We were told they were in the process of cooking the food  that was at 3:14.  We arrived at 4:08. Walked in very excited as we saw people waiting in line for their food. When we spoke the the lady taking orders we explained that we called ahead for the food and arrived within the time she said it would be done. 1 hour and 22 minutes later  ( I watched two episodes of love it or list it watched countless people come and go In the pouring rain) and after 3 times to check and see if the food was ready. At last the food was done cooking. No apology, no offer of a free beef patty, not even a drink. I get home and expected to be \"Delighted\" in my tropical dish and the first thing we noticed was dry plantains. How  do you mess that up??    The oxtails need to be cooked longer as I was unable to bite, pull or chew on the undercooked meat  (that took me 2 hours to get) \n\nI like to support small business especially since we are in a time that many  businesses are losing money. We even took a menu in hopes to reorder food in the future and share it with friends. \n\nWhen we called to talk to the manager to explain our frustration about the long wait and the fact that the food wasnt even cooked properly they laughed and said sorry we can offer you a free plate. Why would I want more of the same? Or even risk get your extra special sauce included with my next meal? \n\nPlease save your money, go on pinterest,  call a friend make your own food as it would come out faster and taste better then the food that is cooked here. \n\nGlad I own a pressure cooker, I'll see if I'm able to save my $40 meal.",
   "I waited 30 mins for my order and it wasn’t even a busy time. The people are not even friendly at all. They don’t greet you, they don’t smile, they look miserable and they don’t care period! At least let your customers know if there’s going to be a delay on your order right? But of course they won’t. They just take your money and make you wait. Didn’t I say they don’t care? \n\nSo when my food came, they did not apologize for the wait and it was not even hot. I expect that it would be pipping hot because it might be freshly cooked. That might explain my wait but it’s not. My food came drenched in sauce but it was mostly bones with very little meat. This for $16.99 are you kidding me? Look at the photo attached. What a horrible experience and a complete waste of money! DO NOT GO! The one in Loockerman street is way better!",
   "The food is Caribbean style soul food they have lots of great things on the menu. We have used them for catering events. Stop by and pay then a visit it will be well worth your trip",
   "I love the fried chicken and the fried whiting fish. The mac& cheese is very moist with cheese & flavor. The greens are not watered down. Yams and potato pies are very good. There are a storyteller of prices portions are ok only cause you could do much more. The beef patties and tropical food is delicious also. Papa & Mama be breaking it down they be burning “ Mr. Dave is keeping it moving and smooth. It’s well worth driving to the other side of town for, go and spend  $ 6 to 12 filling $.",
   "I ordered the ox tails, rice & peas, cabbage with a side of mac & cheese.  This was my 1st purchase. Disappointed that the cabbage was over cooked, very soft. The serving of mac & cheese was an extremely small portion which I paid $3.75 for but only worth 50 cents. It  was dry/hard and and seemed to be leftover scraped from day old pan. The rice was mushy. The rice was mushy. I have been to Jamaica many times and ordered from a number of restaurants in this country.  Worst ever. I know what I should be getting."
  ]
 },
 {
  "name": "The Brick-Wood Fired Eats",
  "address": "150 Gateway S Blvd, Dover, DE 19901, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/25e0f888-9330-11ea-a71a-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "drink",
   "food",
   "music",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6617794375394248316",
  "source": "GoogleMaps",
  "reviews": [
   "Was good. A few people got burnt pizza, but what I got when it finally came out was pretty tasty. I got the cicliano pizza, and the bacon wrapped jalapeno poppers. They didn't have many people there, but food came out randomly and slowly so sharing appetizers was kinda awkward. The pizza menu could have a few more options, but it was good nevertheless.",
   "First time there it was great, food was delicious. Service was great.",
   "My wife and I love this place, they make a good drink and the food is awesome. They make the best deviled eggs we have ever tasted. The staff is professional, the food is great and the atmosphere is comfortable.",
   "The Brick was a true gastronomic treat! Normally not a huge fan of meatballs, I ordered the meatball appetizer and they were a true treat for the taste buds! I was in a party of five, and everyone's meal was excellent. As an added bonus, we were treated to live music in the form of Tim Jaudon for our Saturday evening meal. Please sign me up for more!",
   "Food was delicious and a LOT of it!! You definitely won't leave hungry. 😊"
  ]
 },
 {
  "name": "Angelo's Pizza",
  "address": "20 W Loockerman St, Dover, DE 19904, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2625a1c6-9330-11ea-be3a-14b31f159f22.png",
  "tags": [
   "food",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5611784783544995662",
  "source": "GoogleMaps",
  "reviews": [
   "I really enjoyed their food. I always get awesome customer service there. The place is neat and the employees are always helpful. Keep up the good work.",
   "When your feeling down on a Monday cause its Monday ,Angelo's is always there to have a nice joke and a great tasting pizza and the wings are awesome as well ,I love lemon pepper",
   "Satisfyingly thin pizza with the proper ratio of cheese to sauce. Crisp yet chewy crust. Fantastic.",
   "Customer service is really good... the food is good the delivery time is also expectacular",
   "Wow this is the most amazing place. Best calzone ever created."
  ]
 },
 {
  "name": "Pie Five Pizza",
  "address": "1211 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/266ae354-9330-11ea-ae7e-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=1119114895484926101",
  "source": "GoogleMaps",
  "reviews": [
   "My first visit. I was impressed. I ordered a pie with pepperoni and meatballs. Came out fast and was good. I am not sure I love it yet. Will enjoy discovering more.",
   "You can make an awesome pizza by selecting all the ingredients you would like to have put on it. The price is very reasonable. The staff is friendly and helpful.",
   "Great fresh made pizza! Lots of options to choose from.  Pizza is made right in front of you! It's like a Subway but they make pizza!",
   "My first visit and not too bad. Puts you in mind of a Subway. Best thing, it's quick and inexpensive.",
   "Thin crust wasnt as crispy as expected and the person creating our pizza had ear buds in and could barely hear us. Toppings were very good too"
  ]
 },
 {
  "name": "The Lobby House",
  "address": "9 E Loockerman St, Dover, DE 19901, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/26b05f9a-9330-11ea-b149-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10411779236074828774",
  "source": "GoogleMaps",
  "reviews": [
   "Good food clean area.",
   "Great bartender",
   "Good Food and Atmosphere",
   "Love the wings and Thursday night Mexican specials.",
   "Good wings!"
  ]
 },
 {
  "name": "Roma Pizza",
  "address": "1047 Walker Rd, Dover, DE 19904, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/26f66962-9330-11ea-8771-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12135523321893910373",
  "source": "GoogleMaps",
  "reviews": [
   "Always great!  We order several times a week at work and it is always good.  Great salads, pizza and the wings are so good.  You won't be disappointed.  Also, everyone there is super pleasant and nice.  They really treat their customers good.",
   "Just do it. One of the few places that deliver on base and man it was good!!! Food was nice and hot. We got the philly cheese steaks and they were BOMB, you also get a TON of fries! We will be a repeat customer!",
   "Great food , everything there delicious. My favorite is the grilled chicken sandwich lunch special with a Cesar salad instead of fries. But there fries are good too. Also, buffalo chicken pizza is the best I ever had",
   "I never knew this little hidden gem existed! Its tucked away in a corner and I happened to stumble upon it one day.  The pizza and cheesesteak was good!  You can tell the pizza is made fresh.  The staff are also very friendly.",
   "Staff was very helpful and friendly. Everything was good... Prompt service... Good people and good food👍👍"
  ]
 },
 {
  "name": "La Baguette Bakery and Catering",
  "address": "323 S Governors Ave, Dover, DE 19904, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2741053a-9330-11ea-a60d-14b31f159f22.png",
  "tags": [
   "organized",
   "food",
   "family",
   "food",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4069014302398924436",
  "source": "GoogleMaps",
  "reviews": [
   "Such a rare delight here in Dover. We lucked upon Customer Appreciation Day, and enjoyed samples of their chocolate salted caramel cake. I had the sausage, egg and cheese sandwich on the frontage roll. So good! Cheeses. Baked goods. Great coffee. Sandwiches. We will be back.",
   "Amazing food. Always fresh, and consistently prepared. I frequently rely on their bakery for cakes, and enjoy the opportunity to meet friends there for lunch. Have also experienced events catered by La Baguette, which have been fantastic. Can always count on them to be organized with your orders as well.",
   "Wonderful slice of France in downtown Dover. Truly our family happy place. We love to enjoy the pleasant atmosphere and quality food and warm smiles coupled with great service. From catering to cupcakes they can accommodate virtually anything. Just call them and see what they are able to do for you.",
   "Incredible staff that are warm and friendly! Fresh delicious baked goods! You can’t go wrong with this bakery it’s high quality and good pricing! They will exceed your expectations and give you a new spot to hang out for a bit!",
   "Lovely ❤️ Such a friendly staff, warm atmosphere and delicious food! I highly recommend the parisien chicken croissant sandwich, and literally anything from the bakery case. Though, I am partial to the chocolate chip cookies 😉  Gets a little busy at lunch, but very worth the wait for the freshly made on site food with no preservatives."
  ]
 },
 {
  "name": "Chipotle Mexican Grill",
  "address": "1141 N Dupont Hwy #101, Dover, DE 19901, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/278e3fe4-9330-11ea-a26c-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "eat",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17280816431180124709",
  "source": "GoogleMaps",
  "reviews": [
   "I go to this marvelous  place from time to time since I like the good mood that is unique to this restaurant. The staff is very attentive and professional. The service is absolutely fast. Most important, the food they prepare is highly distinguished. I frequent more than once and I was always pleased. The payment is fair. I suggest this place to to everybody.",
   "DONT order from them! My food was packaged carelessly, everything out and open, two separate bags of chips (open) my food was smashed and almost 30 min late getting here (all 3 bags wrinkled like they’ve been opened multiple times) . A total waste of money as I can’t eat it! With all that’s going on with this pandemic you would think their costumers health would be top priority, how can you not secure people’s food for transport!?  I’m totally disgusted, not to mention the 4 phone calls and no answer 🤬 and she Handed me my sauce 😳🤢",
   "So my husband I were traveling and put in a mobile order for what we thought was this Chipotle. Turns out I’m quite directionally challenged, and had chosen the wrong Chipotle. We were almost an hour from the one I had chosen, so I explained that to the staff who kindly got us our order. I was super embarrassed, but the staff was so sweet and understanding. Also, the food was exceptional, by far the best Chipotle experience yet.",
   "I’m glad Chipotle has lasted in Dover, DE for all these years. Delicious food and hard workers here. One of my favorite fast/casual food places!",
   "This rating is for the single time we've ever ordered from this Chipotle via delivery. We ordered it at around 6:30PM, was assigned to be delivered at 7:11PM. It didn't arrive, and I attempted calling the business over 10 times, with 3 of those times going to voicemail. Assuming the business was closed, attempted to cancel the order and get a refund. Still nothing. At 8:45PM, after cooking a meal at home and eating, we recieved a knock at the door with cold Chipotle. It had a tag that had been written saying the order was ordered at 6:30PM and delivered at 7:00PM. \n\nWe didn't receive our order at any reasonable time, was not notified of any delay, and there was still no communication from them. If I could, I would rate this as zero stars, as this is ridiculous! \n\nThe only thing we want is a refund for an order that was over an hour and a half late and was colder than room temperature on arrival that we didn't need or want anymore. Tried calling to speak with a manager after we received the order, and yet again it went unanswered.\n\nUpdate: was contacted by the corporation and was refunded the amount spent. Raised the Stars in the review to reflect this corporate service."
  ]
 },
 {
  "name": "Friendly's - Delivery & Takeout Only",
  "address": "318 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/27d9c806-9330-11ea-954e-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7460433815345376398",
  "source": "GoogleMaps",
  "reviews": [
   "This is my most favorite dessert ever.  Just wish there were more locations.\nI do hit the one up in Orlando whenever we go.  Loved the one in Dover, De where I went at least once a month for this treat.",
   "Food was great. Server was decent. We were overcharged for our soup and once it was corrected, we didn't realize we were then overcharged on the entree. I still like Friendly's and will be back. Will just check the receipt a lot closer. By the way, you can still get a military discount too.",
   "Food was great and service was fast. I will visit again when in in Dover.  Loved our waitress .",
   "Beware of the friendly's in Dover, DE ???? They have no clue on how to do a split check payment with two cards. Not only did they mess up the first time she wanted to swipe my card again without even deleting the first transaction and take more money. What in the world is going on????",
   "The clam chowder was good, not overwhelming. The tunamelt was cold and the toasted bread was dry. A disappointment. I drove to Dover with the sole intention of experiencing local culture. I was not impressed. I have had far better \"New England\" clam chowder in California!"
  ]
 },
 {
  "name": "Boston Market",
  "address": "1151 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2819870a-9330-11ea-8196-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "free",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8419381552625671174",
  "source": "GoogleMaps",
  "reviews": [
   "Fresh, nicely prepared food which is a great alternative to \"fast food\" restaurants. I always have a good experience when I come here. Restaurant is always clean and the staff is fast, friendly and accurate.\n\nThey have been expanding their menu and  now offer even more tasty food choices. The creamed.spinach is my all time favorite here. I also use Boston Market catering on occasion. Food is always ready on time, hot and the order is accurate and complete. The attention to detail exhibited by the staff here is what sets them apart.",
   "You really can't beat the buy one get one free deal. The roast turkey is my go-to. It's always delicious, especially with some mashed potatoes and mac n cheese. The meat loaf is also decent. I like that you can order online and pick it up in 10 - 15 mins. They're always really fast.",
   "It was an enjoyable experience and the food was very good. I was disappointed with the time and a accuracy of them taking my orders. The treatment of some patrons vic others was very noticeable.",
   "The food was hot and fresh. The wait staff was courteous and the restaurant was clean and well maintained",
   "First time going to this Boston Market location and the staff is very friendly and helpful. The food was fresh and everything they have for sides was there to pick from. Good cooking not fast food stop by and enjoy."
  ]
 },
 {
  "name": "Big Daddy's Soul Food",
  "address": "1030 S Little Creek Rd, Dover, DE 19901, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/285e5850-9330-11ea-824d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5968369547601494953",
  "source": "GoogleMaps",
  "reviews": [
   "This is the Medium Jamaican Curry Chicken with rice n peas with cabbage. Very good",
   "The food here has flavor and cooked to perfection. I was not disappointed. We ordered the Ribs(highly recommend), White fish, hushpuppies, macaroni and cheese, along with sweet potato fries. Friendly customer service.",
   "Love the food. If you're in a rush this isn't the place for you. The food can and will take some time getting out to you. I always get the spicy peach chicken wings with mac and cheese and yams(candied sweet potatoes).",
   "WANTED TO ORDER FOR THE FIRST TIME AND HE DIDNT EVEN HAD WANT I WANTED AND HE CANCELLED MY FIRST ORDER BEFORE HE GOT IN CONTACT WITH ME!!!!",
   "Good service and great food. The ribs taste sweet!"
  ]
 },
 {
  "name": "La Delicia Mexican Restaurant",
  "address": "585 Forest St Ste 1, Dover, DE 19904, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/28a1a312-9330-11ea-9b3a-14b31f159f22.png",
  "tags": [
   "drink",
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17160334311733772907",
  "source": "GoogleMaps",
  "reviews": [
   "Parking was easy, the restaurant had plenty of spaces surrounding the building.\nThis is a small stand alone restaurant just off Rt 13, about 5 miles from the Air Force Base. The place was clean inside with many booths, and a few tables. The floor was slippery, like it was greased down. Be careful folks! Service was excellent, anything we needed, we had in a reasonable amount of time.\n\nI ordered a bottled water to drink, cold, refeshing.\n\nChips & Salsa!!!\nChips...good flavor, a little on the stale side, but decent.\nSalsa...the red had good fresh flavors, not as much cilantro as I like, and had a punch of fire for a few seconds. The green was fresh, refreshing, with a small touch of heat. I preferred the green and used it on everything.\n\nI ordered chicken flautas: served with refried beans, rice, and salad.\nThe flautas were fried perfectly, chicken was seasoned well, moist, and tender. I prefer when they toss the salad on top of everything, and this salad was pretty lacking in size for 5 taquitos.\nBeans...almost a soupy consistency, tasted good, solid refried bean game.\nRice...sticky, a bit dry, but serviceable. Mix them both to make it all right.\n\nI ordered tacos choosing chorizo, lengua, and steak. They were out of pastor, so I was a bit sad.\nChorizo...wow!!! excellent char, melt in your mouth, flavor explosion. This was my fav chorizo taco on the journey so far. Outstanding!!!\nLengua...cut into small cubes, seasoned well, just wasn't doing it for me today. The green salsa helped me get though the couple bites I took. I'm hit or miss on the tongue, not today.\nSteak...seasoned flawlessly, not too salty, you can taste the steak, and wasn't dry at all. The tortillas were good and had a little crunch to them.\n\nI ordered a pork tamale.\nIt was wrapped in a banana leaf and had some of the fire red sauce in with the pork and masa. It was ok...quite dry, and the red sauce made it less enjoyable. Not my kind of tamale.\n\nI ordered a carnitas sope.\nI enjoyed it. The meat had excellent flavor, and a solid mix of meat to fat ratio. It could've used more refried beans spread on the tortilla. I used my beans, and it was much better. The tortilla was a little tougher than I prefer, but was still pretty dang good.",
   "So yeah, La Delicia makes me think \"delicious\". Except not in reality.\n\nThe counter person was not personable at all, shading towards unfriendly. \nAs for the food:  for starters, too much salt in their cooking. Salt should enhance and no more.  They went a bit heavy.\n\nWe had chicken, steak, carnitas, and lengua tacos The lengua was a bit tough and gamey.  The carnitas was fine, wife disliked the chicken and steak was okay.\n\nThere was also a burrito that should have been pork, but was chicken. \n\nThe chicken tamale was not good at all, and went unfinished.\n\nWe asked for both the red and green salsa, 2 small containers were provided.  (picture enclosed) The red had decent spice, green was flavorful.\n\nLastly was the grease....ye gods, was this greasy. (pic enclosed showing some)\n\nSome people liked this place, so maybe our experience was an aberration.  I won't chance it.",
   "I love their enchiladas the only thing I wish is that they be more helpful to people not familiar to authentic mexican. I know I look like I could be spanish, but I'm not. Feel like your expected to know the menu already.",
   "This place is on point. The food was incredibly good.  It had great flavor, good portions for the money as well.  I had the tacos; al pastor, chorizo, & lingua as well as the chicken tamale and the fried plantains.",
   "Delicious food! The staff is friendly and welcoming.  I was introduced to their pineapple juice that they make fresh with a few other fruits   I'd come back just for a large cup of that!"
  ]
 },
 {
  "name": "Cobblestone Cafe",
  "address": "408 S State St, Dover, DE 19901, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/28efa206-9330-11ea-87b6-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "history",
   "eat",
   "food",
   "cheap",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=17067388229400135412",
  "source": "GoogleMaps",
  "reviews": [
   "I think the best gyros in Dover can be found here. The coffee is also very good. This place definitely deserves 5 stars. The food is great and the staff is amazing.",
   "Very hole in the wall feeling! Seating for around 10 but from reading other reviews is seems many people take it to-go.\n\nI had an omlet, which was very tasty! Reminded me of home cooking.\n\nWould suggest stopping by if you are looking for something unique. Not expensive at all.",
   "Cobblestone Cafe is a very quaint restaurant. It is located at The Green in Dover DE which is full of rich history. It is run by its owner and there is a steady stream of business from the local offices. Most customers take their food to go but there is a tiny place to sit and eat which is recommended if you can. If only to watch the people come in and out. The food is tasty. A fun place to visit.",
   "Tiny hidden gem. Excellent  service, fresh, tasty food, and super cheap too! Charming decor with dolls, tea sets, and nick nacks.\n\nDetails: it is tiny as it can only seat about 8-10 people.) Small menu that includes breakfast (omelettes and bagels) and lunch (hot dog (beef frank), grilled cheese, a few sandwhiches.) Good coffee. Great service.",
   "Had the falafel sandwich and it was delicious."
  ]
 },
 {
  "name": "Giacomo's Party Room",
  "address": "63 Greentree Dr, Dover, DE 19904, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/294091d2-9330-11ea-8693-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1430499570878242934",
  "source": "GoogleMaps",
  "reviews": [
   "Been friends with the owners and other staff for years. Decent food and prices. Filling.",
   "Great place to gather for pizza!",
   "Great cheesesteaks.",
   "The food is always well made, tasty, and authentic",
   "This is very good"
  ]
 },
 {
  "name": "Pizzadili",
  "address": "2089 S Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/29864d86-9330-11ea-b7a5-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7560447403403974703",
  "source": "GoogleMaps",
  "reviews": [
   "The best subs in the country and everything they have is good. Cant beat it. And I'm talking for the \nlast 30 plus years!  The best.",
   "Place has been here since I remember. Awesome food and great people!",
   "The food is constantly well prepared and tasty, cashiers provides excellent service. I love how neat it is and ambience. Will visit here again.",
   "I've always loved Pizzadili as the quality of their food has been second to none. However, last night we ordered a pizza for the first time. It was pretty bad. I'm  certain it is prepackaged with a biscuit-like crust and mediocre sauce. It was so bad that I think they should take pizza off their menu. Now their subs and sandwiches have always been really delicious. But maybe last night was truly an off night. I ordered a cheeseburger sub. It was all roll and very little meat and no cheese!! Add-ons were meager: a little bit of lettuce, a few thin slices of tomato, hardly any onion and a light spread of mayo on the roll. It was the driest, dullest sub I've ever had. I had to doctor the second half of it. So disappointing.",
   "This place has the best rice pudding in existence.  My mother couldn't make hers as good ad theirs. Also their pizzadeli special (Italian) sub is the best I have ever eaten. I highly recommend this sub shop."
  ]
 },
 {
  "name": "The Brunch n Lunch",
  "address": "212 S Governors Ave, Dover, DE 19904, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/29c7cdec-9330-11ea-a513-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "food",
   "art",
   "art",
   "food",
   "music",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3814250509398975072",
  "source": "GoogleMaps",
  "reviews": [
   "We saw this online and saw the awesome menu and pictures of the food and environment. Well apparently they moved 8 months ago from that location and changed the menu. It took an hour for me to get a breakfast sandwich. They had live music which was cool but was way to loud for the tiny restaurant. It actually hurt my ears. Though the band was extremely talented. The food was good however they forget the cheese which is a dollar more. The menu is completely different that what’s online. There’s half as many items and the price is literally double. My meal online was $5.50 and in there was $9. It also appeared to be under construction as it was pretty junky. What you see online is completely opposite from what’s actually there. I’d give it another chance if the goal it to restore to what they use to have that was giving them so many positive reviews. I give 2 stars as the food was great. Also it wasn’t busy when we went. We were the only ones who didn’t have food and it still took an hour which doesn’t make sense.",
   "We all know Dover isnt that great, but if you are craving a bite to eat..please take the time to fill up here. This is the place. The food, the atmosphere, and the people. ",
   "Very clean restaurant and staff is very friendly. This was my first time trying grits and my server went out of his way to explain what grits were like. Additionally, the restaurant was very clean and aesthetically pleasing with art made by local artists. Highly recommend others check it out!",
   "Great food, and cool events. \n\nOut of most of the places downtown, The BnL seems to be one of the few trying to cultivate a homegrown art scene. They have a open mic reading series, occasional music acts and art work for sale on all the walls. I wish them luck because it's a great endeavor!",
   "Incredible food! From the perfectly seasoned home fries to the equally impressive and delicious Brunch and Lunch burger, this is a must go restaurant when in Dover."
  ]
 },
 {
  "name": "Glasgow Deli",
  "address": "3920 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2a0eb008-9330-11ea-95eb-14b31f159f22.png",
  "tags": [
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12816355784854002152",
  "source": "GoogleMaps",
  "reviews": [
   "This should be a 4.5.\n\nThe place makes good cheesesteaks. The big issue was having enough cheese.  I had mine with Swiss instead of American, as AMERICAN IS NOT CHEESE!!! That being said, it was hard to tell that there was cheese on the sandwich. But it was very tasty.\n\nThe bacon/broccoli bites (picture attached) weer also very nice. \n\nThe place itself is very no-frills and the crowd skewed very old-white people. \n\nDefinitely will return!",
   "The owner of this establishment needs customer service skills. My order was messed up twice and they rufused to return my money for there mistake! Yelled and embarrassed me in front of other customers. 🤦🏽‍♂️ No professionalism!!",
   "They serve large dishes and for reasonable prices. nice staff. 5 stars from me.",
   "Love the goodies and especially the service at Glasgow Deli, our \"go to\" when we are out and about. All the servers make us feel like family. I can even special order my favorite! Cheeseburger topped with bacon and egg on whole wheat toast with a little mayo. \nThe only neg is that they're not open Sundays, but I know they need family time too!",
   "Good food. I had the cordon blue but without any dressing. The roll was fresh and soft."
  ]
 },
 {
  "name": "MOD Pizza",
  "address": "1037 N Dupont Hwy, Dover, DE 19901, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2a55a38c-9330-11ea-89a8-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "kids",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=4781686237221925216",
  "source": "GoogleMaps",
  "reviews": [
   "Five stars for a five-star experience! I want to give a huge shout out of appreciation to the Dover MOD Pizza team.\n \nThis evening my family utilized their online ordering services. The system was incredibly user-friendly, and the in-house service was equally as excellent. The experience exceeded all expectations for a casual pizza dinner - the pizzas were delicious and prepared without error (something that seems to be a difficult task for most).\n \nIt's important to note that the restaurant was bustling when I came to pick up my order. However, despite the rush, the team made it a point to welcome me as I entered the restaurant warmly, and their customer service never gave way to the crowd. It's the little things that create a great experience.\n \nKudos to the team and their management, who cultivate an environment where excellent customer service is a priority for their team. Keep up the GREAT work!",
   "First time at Mod pizza and it was great.  Nice decor and very clean.  Staff were friendly and engaging, and patient with the kids ordering.  Pizza was really good, cooked in a real oven not on a conveyor.  We'll definitely be back.",
   "Place was amazing.  I was so happy with the service and the price.  We had the cauliflower crust and it was mind blowing.  It is our favorite pizza place to eat in Dover.   We have been going to Mod pizza since June and we have never been disappointed.",
   "I stop here a lot between my shift at work but good pizza and it doesnt take too long to cook",
   "Great pizza, fast service and the employees are always nice and friendly."
  ]
 },
 {
  "name": "Wayback Burgers",
  "address": "645 S Bay Rd RT 113, Dover, DE 19901, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2a9a3cd8-9330-11ea-8ab7-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "family",
   "tasting",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1179809165587076348",
  "source": "GoogleMaps",
  "reviews": [
   "If your in to burgers this is the spot. I loved the cheesssy. With flipped buns. The milkshake was overwhelming. I feel as though the cookies overpowered it. The cashier needs improvement her attitude was a bit overworked. Seeming that she didn't want to be there. I could be wrong. The cook always greets and presentation was on point. He was a black ma'am with pretty eyes. Maybe some music would help the dead vibe in the restaurant. But the food is amazing.",
   "Great tasting burgers. Fries and tater tots taste great. My family loved it. I would eat here again. The place is nice and clean.",
   "Love this place great food and staff definitely recommend to anyone",
   "Food quality is always good.It's really 3.5 stars. It loses stars because when I order online for a specific time, I always have to wait past the time requested. Plus, the interior is dingy. \n\n1. Get the online ordering out on time consistently and it'll be 4.5 stars.\n2. Renovate the interior and it'll be 5 star.",
   "Giving it a 3 star because my fries were great and the actual burger was good...if you can get past the burnt bread taste. Literally tasted the burnt taste through the entire sandwich, couldn’t finish it-"
  ]
 },
 {
  "name": "Romano's Pizza & Restaurant",
  "address": "768 Walker Rd, Dover, DE 19904, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2ade72ba-9330-11ea-b3b0-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13120490999173945928",
  "source": "GoogleMaps",
  "reviews": [
   "This is a perfect blend of Italian and Mexican dishes.  I don't know if I've ever been to a place with such diverse menu options.  However this restaurant isn't the best choice if you looking for a sit down restaurant as their clientele is more for take out",
   "Really good pizza, one of the best in Dover.  They sell by the slice and have several different unconventional to choose from.  Give it a try!\n\n2015-9-21. Ordered a taco pizza, which isn't on menu, with refried beans, ground beef, cheese, lettuce tomato, hot taco sauce.  YUM!\n\n2018-08-23. Got the Taco Pizza again with the green and red hot sauce...AWESOME!!!",
   "All of the food we ordered was amazing! Great Italian and Mexican. Definitely our new favorite spot.",
   "I absolutely love this place.  The Italian food is excellent and the Mexican food is awesome. Service is friendly.. the food is always prepared quickly and fresh and hot.",
   "Best authentic tacos I've had."
  ]
 }
]