[
 {
  "name": "Kentucky Vietnam Veterans Memorial",
  "address": "365 Vernon Cooper Ln, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2b2b59a2-9330-11ea-9d76-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=14897264891021212606",
  "source": "GoogleMaps",
  "reviews": [
   "The memorial is nice, but the time is off about 2 hours. Would be a great place to visit for veterans and their families. Not much else to see here.",
   "As a vet, I love coming upon places like this while travelling. Very nicely done.",
   "Beautiful and scenic memorial. Definitely worth the side trip off the interstate. I'd love to see it at night, but the sunny day view was also great!",
   "Went there for the Run For The Wall, it was an great experience to see the clock as well as so many people come together...",
   "I rode across country from Los Angeles to DC to support veterans, we stopped here along our way.\nReally beautiful memorial. \nThe staff here were very friendly and welcoming.\nI really enjoyed this Memorial even though I served many many years after Vietnam\nThis was a real treat to come here and visit"
  ]
 },
 {
  "name": "Salato Wildlife Center",
  "address": "1 Sportsman's Ln, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2b6b98dc-9330-11ea-8784-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "kids",
   "affordable",
   "learn",
   "nature",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6299536452931239399",
  "source": "GoogleMaps",
  "reviews": [
   "My kids and I love it here! There is all kinds of animals to see. They have educational activities and events for adults and children both. They have multiple stocked fishing ponds. They have nice hiking trails with a map. The price of admission is affordable and fair. The staff is very friendly and knowledgeable. I highly recommend checking out the Salato Center if you have never been.",
   "This was way better than i was expecting! Lots of information, lots of animals, and plenty of outside time. Definitely worth a visit!",
   "I’ve gone here since I was a kid and loved bringing my nephews here. Some things have been added which is nice but as nature may go, I was sad to see the dragonfly marsh pretty much dried up. That was one of my favorite spots as a child. Great place to go to see some interesting animals and learn a lot.",
   "Loved this experience. It's not overwhelming and very beautiful and educational. The entrance fee isn't much and they have plenty opportunity for walking trails.  All the animals were outside and playing and the streams were gorgeous!",
   "The price is reasonable and it is an educational for kids of all ages. It isn't a zoo so don't expect a large variety of exotic animals it is filled with local wildlife. It makes a nice day especially if you pack a meal and a fishing pole for trip."
  ]
 },
 {
  "name": "Kentucky History Center & Museums",
  "address": "100 W Broadway St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2bbf76e4-9330-11ea-8032-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "history",
   "history",
   "learn",
   "kids",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=3576771753832073801",
  "source": "GoogleMaps",
  "reviews": [
   "Our visit started off just right with free parking across the street. Admission covered this building and the state military history museum up the hill a few block away. Get there in time for a tour of the Old State Capitol building for the history of Frankfort and KY. The 200 yr history of the state will take at least 1 1/2 hrs to get it all in.",
   "Learned a lot about history it was such a blessing and got to look up my grandfathers serving in the army",
   "For anyone interested in a juvenile education of Kentucky or to take your children to learn about the state ... great!!!",
   "Friendly and helpful staff. Museum was bigger than I expected. I would definitely recommend this place. There's a little area for little kids to play and they also have a gift shop.",
   "We went there to get our tickets for the old capitol tour, amazing. Meanwhile we used the time to ejoy that museum,great"
  ]
 },
 {
  "name": "Buffalo Trace Distillery",
  "address": "113 Great Buffalo Trace, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2c09ead0-9330-11ea-8906-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "free",
   "tasting",
   "walking",
   "tour",
   "history",
   "tour",
   "delicious",
   "learn",
   "history",
   "free",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=3899512084262526924",
  "source": "GoogleMaps",
  "reviews": [
   "What an amazing distillery. It just has so much character. Did the hard hat tour and loved it. Even my teenage son thought it was cool! I have always loved their bourbons and it was neat to see the process up close.",
   "My wife and I toured Buffalo Trace Distillery this morning.   We arrived about an hour early and were the first two in line.   I was upset at first because there was no EH Taylor in the gift shop.   \n\nThen it was time for our tour.   What a great experience!   And we were blessed to have Freddie as our tour guide.  (Even though he advised me to buy a new hat. (I was wearing my Maker’s hat).   Freddie is very humble and shared some amazing stories with us.  I quickly forgot about the gift shop not being stocked with EH.   We finished the tour with a tasting, I must mention both the tour and tastings are free!   \n\nAs I was walking downstairs, back to the gift shop I saw people carrying those beautiful E.H. Taylor cardboard tubes.   I quickly ran to the back and Score...I grabbed one of the last 3 left!  \n\nPerfect day!   \n\nJason Wachenschwanz\nColumbus, Ohio",
   "Buffalo Trace Distillery was by far my favorite place to visit of the three I got a tour of this weekend. The place was amazing and full of sight, what made it more amazing was my tour guide David. He knew American Sign Language and signed the whole time. I understood more about the process from David than from the other places without the accessibility provided. The facts about how large this place is, how big the still and processing tanks are just blows my mind. The other distilleries I visit had tanks in the 7000-7,500ish gal tank, these had up to 9,400 or in that range. I like the fact that they recycled their leftovers and used the “tar” to produce energy for the whole system. **I highly recommend that if you are Deaf, or knows someone that wants to visit Buffalo Trace, to call or email them and request David. He is not an interpreter but does an really good job making sure you understood the history and science of making Bourbon. **",
   "This is an amazing distillery.  I did not do the tour, as time did not allow it.  Their gift shop still took about an hour to peruse through.  Their prices are extremely reasonable for this type of place.  I will definitely stop back and attempt to do the tour.",
   "Such a cool place. Learn a bit of history, take a free tour around the grounds see where the make all the delicious bourbons. It was a dream come true to be able to come visit this place."
  ]
 },
 {
  "name": "Floral Clock",
  "address": "700 Capital Ave, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2c5f3458-9330-11ea-a6c7-14b31f159f22.png",
  "tags": [
   "family",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=6035553745436089321",
  "source": "GoogleMaps",
  "reviews": [
   "It was a really cool place and it really works, every 5 minutes it moves, I talk to someone that takes care of it and there are few clots like this around the world but this is the only one in the US. It was beautiful.",
   "From the time I was a little boy, I have enjoyed the Floral Clock and tossing coins, making a wish as the coin went into the water. \nMy dad would take us riding around town and one of our favorite places would be the Capitol area, I do recall as a youngster, just how the mansion was an eye sore, now it is a beautiful home, a pride of Frankfort.\nI have seven children and they all have been to the clock numerous times, all throwing a coin into the water, some of them wishing and those to young just enjoying following suit with their siblings.\nTo this day, I still find myself riding around with my family and we continue the tradition of heading to our State Capitol Grounds.\nWonderful memories...",
   "If you need a respite from traveling across the state what, take the exit off of I-64 to the Kentucky state capitol in Frankfort magnificent building and complex with this extra special surprise. Beautifully maintained",
   "I enjoyed seeing this beautiful floral clock on Wednesday, June 27, 2018 and on Tuesday, April 3, 2018.\n\nIt impressed me to see a large outdoor clock with plants inside it, as it did when I first saw it in 1972 on my eighth grade class trip. During my June visit this year the clock looked magnificent with colorful blooms and greenery. However, the plants did not look that beautiful on the April visit, probably due to it being early in the growing season in Kentucky.\n\nA plaque near the clock provides details about it. And a nice fountain is located below its base that added to the beauty during my June visit. The fountain did not have water in it when I visited in April.\n\nI urge persons in the area to take a few minutes to visit Kentucky's Floral Clock, read the plaque, and take a photo of it. There no charge to view or photograph the clock. Since it is outside in a public area, I guess it can be viewed 24 hours a day. \n\nThe clock is located beside the Kentucky State Capitol Building. I walked from downtown to the capitol building and the clock, but the Frankfort city bus service has a stop near the clock. The bus service runs from early morning to late afternoon Monday-Friday except for holidays, with a more limited schedule on Saturday. It runs once an hour and only costs 25 cents.",
   "This was a neat place. The clock is huge and the flowers look amazing. Very unique place to visit."
  ]
 },
 {
  "name": "Old State Capitol Building",
  "address": "300 W Broadway St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2cb0dc86-9330-11ea-b170-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=2910440296120913457",
  "source": "GoogleMaps",
  "reviews": [
   "Pretty guided tour we enjoyed lot of history, our guide told us a lot of background stories about almost everything. \nMake sure you get the ticket in time at the visitor center",
   "Was not inside the building.  This is a terrific venue for Friday night concerts over the summer!  Thanks so much for last night and Superfecta even though it was a wash out after their break.  Hope to be back soon!",
   "Very historic building. Too bad those elected to serve there don’t actually represent the people. \nAlso, watch out for no hidden no parking signs! I do want to give credit to the 4 of 5 city council members who replied to my email about the parking signs. They were very receptive to the issues I pointed out with the no parking signs covered up by the huge flowering baskets.",
   "Great summer concert.  Must go on the weekends",
   "Great Kentucky landmark. The rotunda staircase is worth the trip alone."
  ]
 },
 {
  "name": "State Capitol Building",
  "address": "700 Capital Ave, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2cf28c80-9330-11ea-9fdc-14b31f159f22.png",
  "tags": [
   "tour",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=9601022575612301234",
  "source": "GoogleMaps",
  "reviews": [
   "I love working at the Capitol of Kentucky. I've worked in all areas of state government and LRC had definitely been my favorite position largely because it is located at one of the most beautiful locations in Frankfort as well as the whole Commonwealth. Please come visit and take a tour or stroll around the grounds. Good times to visit are Christmas to see the beautifully decorated building and springtime to see the tulips and blossoming trees. Make sure to breathe in the perfume of the sweet magnolia blooms. If you go to the floral clock, go around to check out the tropical garden at the back dedicated to Governor Bert Combs.",
   "Beautiful landscape, and building look really nice.  Also there is nice garden with the floral clock that are really nice to take picture with.",
   "Stopped for a quick look while on a trip to Frankfort. My wife and I were up early looking for coffee shops and drove over to see it. Huge, beautiful building. Didn't have time for an inside look. Maybe some other time.",
   "See what has changed in making Kentucky A Great State",
   "This place is magical. Walking in ... Just makes you grateful to be in Kentucky! Proud, beautiful building!"
  ]
 },
 {
  "name": "Cove Spring Park",
  "address": "100 Cove Spring Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2d3970e2-9330-11ea-aee8-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=10676821567258868911",
  "source": "GoogleMaps",
  "reviews": [
   "Had a great time. The hiking was really enjoyable, the trail we took was nice and flat. My knees were very happy.",
   "Beautiful park.  Well kept grounds.  Great walking/hiking.  Crystal clear creeks and waterfalls.",
   "I went with my husband and kids (boys 7 and 9) and we spent an ample amount of time here (couple hours)! We've only been the 1 time, I definitely plan on returning. It was amazing!!! There's plenty more trails to walk, and other places to explore, we plan on spending more time here our next trip.",
   "Beutiful place. Great for kids. Can't Wait to go back when the weather is warmer.",
   "Best park in Frankfort ky... I love it here... walking trails and sitting areas... water fall... so peaceful"
  ]
 },
 {
  "name": "Leslie Morris Park at Fort Hill",
  "address": "400 Clifton Ave, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2d803968-9330-11ea-9c52-14b31f159f22.png",
  "tags": [
   "history",
   "hike",
   "wander",
   "tour",
   "kids",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=1546543714998605398",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place very peaceful and relaxing and it has a lot of historical parts so if you are interested in history you for sure will love this place",
   "Hours shown are for visitor center only. Park is open everyday, from sun up to sun down. Gorgeous place to hike and wander about. Much of Frankfort is visible from the top of this park.",
   "Kind of an \"out of the way\" park but there are a few spots with some really great views.",
   "We only walked one of the trails. I believe there are more. There's a house from the 1800's you can go in some times and the guide tells you about life in the past and the civil war in Frankfort.  When another group of people came in our guide simply turned away from us and started guiding them. We guess our tour was over. Odd guy. There's a fantastic view of the city on the trail. Well maintained trails. Kids didn't like it.",
   "Its a really tranquil place to hike up to, and it most certainly takes some exercise  to get up there. \n\n It is a fort from the civil war."
  ]
 },
 {
  "name": "Liberty Hall",
  "address": "218 Wilkinson St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2dd13fba-9330-11ea-8234-14b31f159f22.png",
  "tags": [
   "historic",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13862101632589832043",
  "source": "GoogleMaps",
  "reviews": [
   "The gardens were absolutely beautiful, worth checking out",
   "Historic and supposedly haunted",
   "So pretty!",
   "Checking out some history",
   "Wedding venue"
  ]
 },
 {
  "name": "Governor's Mansion",
  "address": "704 Capital Ave, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2e1db24c-9330-11ea-9a9e-14b31f159f22.png",
  "tags": [
   "learn",
   "unique",
   "tour",
   "history",
   "tour",
   "historic",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12415902522715762227",
  "source": "GoogleMaps",
  "reviews": [
   "The Governor's Mansion was a very beautiful and unique place. It is full of interesting history. It was very nice of Governor Matt Bevin to invite us to see and learn about it. The behind the scenes tour was a great and unexpected surprise. The Infinity mirrors we're were a great touch. I would recommend going to see and learning about the Governor's Mansion.",
   "A very nice house (from the outside). I didn't get to see much of it, as it was Saturday and there was no possibility of getting a tour.",
   "Was invited there on behalf of the Red Cross.  The staff were friendly and Governor spoke very well and was warmly welcoming.  Very historic.",
   "After visiting the Capitol building on the weekend, we came back on a Tuesday to tour he mansion. Unfortunately we thought the last tour left at 11, but it actually left at 10:30! The world's nicest lady took us around anyways and we had our own private tour, which was simply amazing. This building has lots of rich history. It was a great time and we were lucky their staff is so nice.",
   "Very beautiful ✨my daughter loves the clock🕣 and all the pretty flowers 🌷🌼🌺🌹"
  ]
 },
 {
  "name": "Capitol View Park",
  "address": "Corner of St Hwy 676 & Glenn's Creek Road, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2e6ae834-9330-11ea-8831-14b31f159f22.png",
  "tags": [
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=8111916342986161851",
  "source": "GoogleMaps",
  "reviews": [
   "Definitely love this park different areas for ball games and also has a park itself and a trail to where you can walk down to the river love going to this park",
   "This is a great mountain bike trail system maintained  by awesome volunteers. You can go ride for 5 minutes at the pump track or 5 hours all over park. There is something for pretty much every skill level. Highly recommend.",
   "Great park. Needs a playground or something for the kids that aren't in a sporting event that's going on.",
   "Compact 9 miles of variable trails suitable for any skill level. Expert riders may be bored but overall satisfying mix.",
   "This place is beautiful but it needs more tail markers. No real direction for visitors."
  ]
 },
 {
  "name": "Capital City Museum",
  "address": "325 Ann St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2eb60136-9330-11ea-845a-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "history",
   "walking",
   "tour",
   "history",
   "history",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2998544876858528299",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome collection of historical items and information.",
   "Don't miss your chance to visit the Capital City Museum's newest exhibit \"The History of the Bourbon Industry In Frankfort\", which opened on April 20, 2018. The exhibit features artifacts from some of the bourbon industry's founding fathers, innovators of the new commonwealth of Kentucky. Also inquire about the NEW Bourbon History Walking Tour as well as the NEW Bourbon History Trolley Tour! All of these activities are FREE of charge.",
   "The tour was great learned a lot about frankforts history",
   "One of the best museums you will ever visit. It is pure Frankfort through and through and you get a great feel for the history of the community. They have the friendliest and nicest staff I've ever met in any museum. They don't mind to chat with you as long as you have a mind to do so. It's clean and uncluttered and everything is thoroughly explained.",
   "I really enjoyed it....the kids have fun too..."
  ]
 },
 {
  "name": "Kentucky Military History Museum",
  "address": "125 E Main St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2efbf0ae-9330-11ea-92c3-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "history",
   "family",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7184183330724927585",
  "source": "GoogleMaps",
  "reviews": [
   "This museum is included with price of visiting the main KY state museum down the hill. Two stories of military history of KY in the building; oldest displays on the first floor and WW1 and later on 2d floor. The state as well as KY citizens are featured (such as only KY solider awarded Medal of Honor in WW1).  Limited amount of free parking next to building. We took about an hour to tour the exhibits. We are from TX and was impressed with the effort KY put into honoring its state and citizens.",
   "Really cool to visit especially if you a 2and amendment enthusiast.",
   "It was a great place to visit. I have been here previously but my family had not. Interesting for every age in our family and the guys greeting us was extremely nice!",
   "Great place to learn about military history",
   "Little museums like this always turn out to be the best. For the amount of space they have to use I thought the displays and information presented was very good. You probably won't spend a lot of time here but it is worth the stop if you are in town."
  ]
 },
 {
  "name": "Daniel Boone's Grave",
  "address": "215 E Main St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2f42799a-9330-11ea-8cef-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=17335656108419582481",
  "source": "GoogleMaps",
  "reviews": [
   "Best views of the city! They placed him well!",
   "Thanks to Google maps, it is a pretty easy gravesite to find. The maps did get a little confused, so when in doubt go uphill and near the bluff. Daniel has a nice view of the river and state capitol.",
   "Beautiful place, only problem is i was told not to play pokemon go in the cemetery out of respect.. Respect for who i didnt bother anyone and there are over 6 gyms and 25 pokestops in the cemetery lol.. Ask niantic to take them down if you got a problem with people visiting the grave who also enjoy pokemon..",
   "My aunt has indicators for Daniel Boone as relative",
   "Great for tours, and while you visit the kids can play Pokémon Go. More than 30 Pokéstops within the gates. Roads are narrow, so please be careful. "
  ]
 },
 {
  "name": "Josephine Sculpture Park",
  "address": "3355 Lawrenceburg Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2f9db948-9330-11ea-b0ba-14b31f159f22.png",
  "tags": [
   "walk",
   "art",
   "field",
   "free",
   "art",
   "creative",
   "free",
   "walk",
   "free",
   "art"
  ],
  "link": "https://maps.google.com/?cid=8762236230895112498",
  "source": "GoogleMaps",
  "reviews": [
   "This is truly a hidden gem. An amazing public attraction. Very pleasantly surprised with my visit here. Such an awesome concept and use of the land.",
   "An amazing park with over 70 stunning artworks on 30 acres.  5 trails to walk.  Various events and festivals held here as well through out the year.  Patrons are encouraged to interact with the art. Great for photos.  You can also see native plants and local wildlife.",
   "I was looking for a reason to go for a day trip while at work on a Friday afternoon, and the park was hosting a philharmonic concert the next day on Saturday. The park was inspiring and worth every moment we spent there. It was a hot day and ice cream and snacks were provided for free. \nI've told several people about the park. Everyone should go.\nIt's a bit of an adventure just trying to find it, but trust your directions and the field opens up to you.\n\nMake sure you bring water bottles in the summer. There are water fountains, but it's more convenient.\n\nI still find myself day dreaming and my mind drifts to the works I visited in the park. Pictures don't do justice to something 20 feet tall that you can touch and spin and stand under. \nLike all good art, you leave with the feeling that your sense of the world has been challenged in some way.",
   "Kentucky has some beautiful and creative places to visit. This park is so nice. I'll be going often. It's free and fun to explore. They have over 70 sculptures there.",
   "I had a great time at this place. I stopped here while on a road trip from Missouri to Virginia. It was the perfect place to stretch my legs and walk around. There were no paved sidewalks, simply open fields, with mowed paths. There were sculptures that encouraged climbing as well as those that requested be left untouched . The paths themselves were wide enough to fit a group of people and enclosed enough to keep the next sculpture more of a reveal; which was nice. \n\nMy son was able to run and burn his energy and I was able to enjoy the art, hopefully instilling an appreciation of it in him as well. \n\nThere’s a donation box near the entrance/exit . I know not many people carry cash but the place is free so leaving what you can helps, I’m sure."
  ]
 },
 {
  "name": "Liberty Hall Historic Site",
  "address": "202-218 Wilkinson St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2ff302a2-9330-11ea-aa42-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "historic",
   "history",
   "music",
   "knowledgeable",
   "family",
   "tour",
   "historic",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7746565466140637841",
  "source": "GoogleMaps",
  "reviews": [
   "One of the premier events of Derby Season, Bourbon & Browns at Liberty Hall Historic Site celebrates the historical contributions of the family of Senator John Brown, Kentucky's first US Senator after becoming a state, and the significance of bourbon and it's history in Kentucky. The annual fundraiser benefits the historic Liberty Hall site which includes the Orlando Brown House, Senator John Brown's son, and 4 acres of sprawling gardens. Bourbon tastings, bluegrass music, a live & silent auctions, as well as appetizers and food, cap off the evening and help transport the attendees back to a simpler time in Kentucky's history.",
   "Absolutely a wonderful tour to add to your trip. Our tour guide, Megan was very knowledgeable and very patient with our questions we had! Orlando Brown House is very worth seeing, it's part of the tour. Thank you for having our family!",
   "Bery nice place.",
   "Cool historic site. Supposedly haunted. Former residents have deep political roots in Kentucky history and government.",
   "A Frankfort gem! The gardens aren't as pretty as they used to be? I think they need more volunteers to help!"
  ]
 },
 {
  "name": "Old Governors Mansion",
  "address": "420 High St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/304043a8-9330-11ea-9fb2-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=13015843598487057043",
  "source": "GoogleMaps",
  "reviews": [
   "Nephew got married here! Hector",
   "We enjoyed ourselves at a beautiful wedding!!",
   "Very cool place had a great time",
   "Amazing home. Older than the white house by one year. ",
   "Stunning"
  ]
 },
 {
  "name": "Lakeview Park",
  "address": "112 Park Ave, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/308c19e6-9330-11ea-950e-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "free",
   "walking",
   "family",
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=607444427785970716",
  "source": "GoogleMaps",
  "reviews": [
   "My family and I love going to this park. It's very close to home. It has great walking trails and a dog park. The grounds are well kept up and during the summer they have a free kids water park and different kinds of events. I highly recommend this park!! Its great for families and their furry friends!!",
   "Great family sports h fun place",
   "Great event for the kids and adults",
   "I've always loved Lakeview Park and the weekend of 9/21, was very hot and sunny but the pavilion where we were was amazing. There was a fabulous breeze and being slightly disabled and unable to walk great distances, the bathrooms were close by. It made our weekend reunion fabulous and hope we get the same place next year.",
   "Nice to see the skate park being remodeled."
  ]
 },
 {
  "name": "KY State Capitol",
  "address": "100 Capital Ave, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/30e0a2d4-9330-11ea-82a7-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "tour",
   "free"
  ],
  "link": "https://maps.google.com/?cid=6911010191299219084",
  "source": "GoogleMaps",
  "reviews": [
   "This is an excellent place to learn about our state history. You can visit the House and Senate Chambers, when they are not in session. You can watch quietly from the overlook when they are in session.\nCheck out the collection of first lady dolls!",
   "Beautiful grounds are well manicured and taken care of. Such great photo opportunities for prom or engagement pictures. Tours are available during business hours.",
   "Amazing to see where the state is kept in order and driven forward!!! Can't wait for my sons fifth grade trip next year.",
   "Beautiful capital building, the architecture on the inside is incredible definitely worth a visit and most of the time the public is allowed to tour for free",
   "Beautiful place! I would definitely go back."
  ]
 },
 {
  "name": "Frankfort Cemetery",
  "address": "215 E Main St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 3.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/312d3d64-9330-11ea-9040-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=12786722214460009238",
  "source": "GoogleMaps",
  "reviews": [
   "Daniel and Rebecca Boones grave are easily found just follow the yellow line also there is a beautiful war memorial you must visit when here",
   "Not maintained as should be. Office personeal very unprofessional .if you have legitimate issues not addressed correctly.",
   "Beyond breathtaking. Amazing history and gorgeous views over river valley",
   "Was followed and ran off. Thought this was a public place?",
   "Daniel and Rebecca Boones' gravesites are well marked and easy to gain access to. The views are spectacular. Definitely worth the time to visit."
  ]
 },
 {
  "name": "River View Park",
  "address": "404 Wilkinson Blvd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/318d4010-9330-11ea-95db-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "walk",
   "learn",
   "history",
   "music"
  ],
  "link": "https://maps.google.com/?cid=12003680516783048566",
  "source": "GoogleMaps",
  "reviews": [
   "It's Frankfort, what can I say?  You get a good view of the Kentucky River.   When the season starts, a farmers market pops up for a few months.  I have bought some real good radishes there.  A pedestrian bridge can take you to the other side of the river where there is another park with trees and another bridge (more for sitting down on a bench and having a smoke; I think that one side of it is fenced-in, i.e., cannot go across).",
   "Nice big dock to fish on or go down there and chill and watch the river.  They have kayaks to rent.  Plenty of parking.  They have walking and biking trails.  I’d highly recommend you to check this place out if you come to Frankfort.  They have to benches on the dock.  A few trees that over hang the dock for some natural shade.",
   "Nice small park.  Workers were modifying to make it even nicer",
   "Very nice discovery while vacationing. My wife and I were up early in the morning and decided to go for a walk and came upon it. We had it all to ourselves.",
   "Nice place to take a scenic walk. They have plaques which you can read and learn a little history and information about the Kentucky river. Farmers market sets up near by. They also have a music festival here very once in a while."
  ]
 },
 {
  "name": "Prodigy Vineyards & Winery",
  "address": "4686 Versailles Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/31df30cc-9330-11ea-ad59-14b31f159f22.png",
  "tags": [
   "unique",
   "tasting",
   "winery",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=4289772895825895703",
  "source": "GoogleMaps",
  "reviews": [
   "The staff is very friendly.  There are plenty of events for a fun afternoon.  The grounds are pretty. The tasting room is a little cluttered and not too cozy. The wine is overall pretty good. They lean towards a milder, smoother taste. Most interesting though is their port, a very good and unique find in Kentucky.",
   "Such a beautiful place to visit in Kentucky! Right when we pulled into the parking lot, we look to our right and see two beautiful horses, standing in front of the house, that you are allowed to pet (see attached photo). Everyone working there were so kind and helpful. Right when we walked through the door, one of the servers welcomed us and gave us a big hug! They had a huge variety of wines to try so anyone can come relax. \n\nI had a lovely time thanks to the Prodigy team! Thank you for the memory!",
   "Nice Winery with a wide variety of spirits. Pleasant environment that hosts weddings and special occasions.",
   "Most excellent!! Great wines. Very relaxing!!🍷🍾",
   "Had a great time with our family at Prodigy Vineyards. Enjoyed our wine flights and my chicken salad croissant sandwich was delicious! Best of all was our waitperson, Lorenzo! He was fun and informative."
  ]
 },
 {
  "name": "Juniper Hill Park",
  "address": "Juniper Hills Park, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3226c176-9330-11ea-997e-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4559378885801855698",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great park! Good amount of seating around playground and nicely shaded... a play area for smaller kids and 2 sets of swings. There's nice pathways for walking and also tennis courts and an area for working out... Plenty of tables for a party too!  Only downfall is no real bathrooms around besides a portable",
   "The park is very nice, but if you have small children beware, they've torn down the playground and left it in a huge pile of rubble.  There is nothing blocking you off from your children going into it and getting hurt. People's negligence baffles me.",
   "My grandson didn't have a place to play because the playground was all roped off.\nRepairs were needed in the playground area and it looked as if it's been laying in decay for quite some time.",
   "This is a great place to take your kids to play, there's lots of play equipment, shady places for adults to sit, and picnic tables.",
   "Great playground for the kids and a workout park for the parents. No eggs yet."
  ]
 },
 {
  "name": "Buckley Wildlife Sanctuary",
  "address": "1305 Germany Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3274a6ca-9330-11ea-aab3-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=565737245564727364",
  "source": "GoogleMaps",
  "reviews": [
   "We took the red trail It's well maintained and very manageable for the beginner. This is a quiet woods walk, you hear the many birds and catch glimpses. There are a few openings to expansive fields and some panoramic views. The red trail makers are not clear at some turns because of the unmarked maintenance trails. So bring the trail map. Also my step app clocked this walk closer to 3 miles than one and half. You should not get lost.",
   "This is a nice, quiet place. It has, however, seen better days. When I was there it was in need of maintenance and mowing.",
   "Wonderful, a refuge not only for the wildlife, but also for you. No endless housing sprawl, traffic, noise, and asphalt. Don't get me wrong, I like living in Lexington; but access to this place is priceless. I couldn't stop watching the precious little creatures flitting about sipping water and looking for seeds. Good that it's a bit out of the way; I rather prefer it. Well done, Audubon!",
   "Clean, however I must have gone at the wrong time of year, saw more wildlife on the road getting there than in sanctuary",
   "This is a nice place to come for a walk. There are very few visitors most days. Today there were only three cars when I arrived. I only saw two people on the trails. I hiked the Red Trail today, which is a nice 2 mile walk when combined with the yellow Trail. For a Wildlife Preserve though you see very little wildlife. I saw evidence of owls and heard a woodpecker and heard a few wild birds, but that was it. There is no entrance fee though they suggest a donation of $4. Also the Buckley Wildlife Sanctuary is now run by Life Adventure Center of Woodford County. Basically this is a good place to come if you want to get away from it all for a little while and just have some solitude in nature.\nEDIT: Definitely more wildlife now, as Whitetail Deer have come back. I see a few every time I'm out there!"
  ]
 },
 {
  "name": "Switzer Covered Bridge",
  "address": "3392 Jones Ln, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/32ccd900-9330-11ea-bd43-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=10455777752402410423",
  "source": "GoogleMaps",
  "reviews": [
   "This area is so peaceful. I love to have picnics there. No one bothers you. It is off the beaten path but so worth the drive. They have a beautiful plaque up with the story of the bridge. You are allowed to walk across the bridge which spans the Elkhorn Creek. Popular fishing spot. Always check weather because that area does flood.",
   "Great piece of history. Sad to see how so many have vandalized this beautiful bridge.",
   "Love this place. It's quiet and very pretty",
   "We love going here. It's beautiful. The only downfall was scaring away some people in a car who were obviously doing something they shouldn't have been doing.",
   "Part of Kentucky’s history. Great place to kayak."
  ]
 },
 {
  "name": "Kentucky History Museum",
  "address": "100 W Broadway St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3316681c-9330-11ea-96dc-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "tour",
   "walking",
   "music"
  ],
  "link": "https://maps.google.com/?cid=16430240157900308360",
  "source": "GoogleMaps",
  "reviews": [
   "This was our first time to Kentucky so going to the museum was eye opening. Your admission into the place including three other museums and a free tour. Great little gift shop inside and they have an Ale8 machine. This was our first time trying it... I did not know it has caffeine before I let my child try it. \nGreat place to spend an afternoon.",
   "It was na lot of interesting stuff. A tour of the old Capital building and an old munitions building filled with military items from many wars.",
   "My daughter was planning to take my young granddaughter here and had to change plans last minute. So it ended up being me and my granddaughter going. I'm really glad I went and got to experience this place. We learned so much and really enjoyed all of the exhibits. Staff were very friendly, helpful, and welcoming. I hope to bring her back when she is a little bit older when she can absorb a little more.",
   "It has been awhile since I went through this museum but from what I remember I know I didn't spend a lot of time here. I do remember thinking it was worth stopping by and I did enjoy walking through seeing the information presented.",
   "Awesome displays. They were doing a lecture series and then had music in the foyer area. Impressed!"
  ]
 },
 {
  "name": "Woodford Reserve Distillery",
  "address": "7785 McCracken Pike, Versailles, KY 40383, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3359170a-9330-11ea-8113-14b31f159f22.png",
  "tags": [
   "walk",
   "knowledgeable",
   "tasting",
   "history",
   "free",
   "tour",
   "knowledgeable",
   "tour",
   "tasting",
   "tasting",
   "tour",
   "tasting",
   "history",
   "tour",
   "tasting",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=8642838336793643378",
  "source": "GoogleMaps",
  "reviews": [
   "The tour was fantastic and free for military! Our tour guide Leah was super knowledgeable and witty. The history of the grounds and buildings is well preserved. The process is all taking place while you walk through the buildings. They were even bottling while we were taking the tour. The tasting room was really well laid out and the process of “proper” tasting was really interesting. They even give you a piece of chocolate to pair with the three selections. I would highly recommend visiting this local staple!",
   "Sydney provided an amazing tour.  She was informative, entertaining, and very knowledgeable.  Her enthusiasm for her work bubbled through the entire presentation.  The process was fun from start to finish.  The tasting was well presented and have a great sample of the product.  Highly recommend.",
   "This is a Disneyland for adults and modern day of Distillery. Clean, elegant, friendly welcome, excellent whiskey tasting and they know how to make us spend money. If you a old fashion drinker don't forget grabs some of Woodford bitters. Order old fashion you get to keep copper cup.",
   "Nice campus with beautiful scenery surrounding it. Loved the history which was well communicated by the tour guide. Overall a very quaint and bespoke feel. It was a nice tour. The tasting featured 3 whiskey’s (distiller’s select bourbon, double oak bourbon, and rye) and a chocolate. The tasting was a little bit quick for my taste. It would have been nice to slow it down and enjoy a bit more. Staff was super friendly and welcoming. Clean facilities.",
   "Interesting tour that goes into a lot of the smaller things that goes into Woodford reserve to make it stand out from other bourbons. Tour guide was informative. Shuttle bus saves people from walking up and down a lot of steps. Tasting at the end tops off a great tour."
  ]
 },
 {
  "name": "Rising Sons Home Farm Winery",
  "address": "975 Frankfort Rd, Lawrenceburg, KY 40342, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/33b5b63a-9330-11ea-b029-14b31f159f22.png",
  "tags": [
   "delicious",
   "tasting",
   "winery",
   "family",
   "tasting",
   "history",
   "family",
   "tasting",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=4341377348607777014",
  "source": "GoogleMaps",
  "reviews": [
   "We stopped in this jewel on our way home from a weekend trip to Lexington and we are so happy we did! We were warmly greeted by Francine (co-owner and Joey's wife). We purchased the premier tasting. Francine suggested a couple of wines that were out of our \"normal\" wine preference and we were pleasantly surprised. She also made a few simple sangrias, which were very simple and delightful. We also had 2 cheeses (with the tasting), which made the tasting complete. The cheeses were delicious! We also had the privilege of tasting several wine jellies, which were just heavenly. We ran into a few, very nice locals, which made for great conversation. Near the end of our tasting, Joey came in and did a toast from his grandfather (and founder), which made our experience even more special. If you are passing through or in the area, please stop in here. You will not be disappointed!",
   "Been wanting to try some Kentucky wine, and my husband and I were lucky enough to stumble upon this winery. The tasting room is located in the house. We were a little hesitant when we stepped out of the vehicle, but were warmly greeted by one of the winery owners, Joey Sloan. The tasting room, like it's owners, was inviting. \nFrancine, Joey's wife and co-owner, was helping us with our tastings. We are mostly semi-sweet to sweet wine drinkers, but she convinced us to get out of our comfort zone and try some dry wines too. Mixed a few of the wines with fruit juices to make our own sangria. \nShe gave us a nice history of her family and their winery. Francine also makes wine jelly, so we received nice samples of that too. Cheese and cracker platters were also available for purchase. One of the nicest winery experiences I've had in a long time.",
   "Francine and her son were amazing! Best presentation I have ever came across.  From pairing each wine, telling us how to mix different sangria's  and the wine jellies such an awesome experience.  We will be back!",
   "Went here with 8 people and there was plenty of room in the tasting room. Great variety of wines and delcious jams to try and buy. The wines were wonderful and there is something for everyone. The staff is knowledgable and friendly. We also got to meet Bebe who has a wine named after her. Our family had a great time! I highly recommend Rising Sons. We will definately be back.",
   "Had a great time here. The staff is knowledgeable and extremely friendly!!! I will most definitely be returning."
  ]
 },
 {
  "name": "Berry Hill Mansion",
  "address": "700 Louisville Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/341bfbfe-9330-11ea-b2ca-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=9389627050622869981",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful facility. Echoes and hard to hear when used for meetings though.",
   "Truly one of the state’s hidden gems",
   "Beautiful place to have a wedding",
   "Beautiful venue! Staff is excellent!",
   "Very nice beautiful place"
  ]
 },
 {
  "name": "Sun Valley Farm Tour",
  "address": "556 New Cut Rd, Versailles, KY 40383, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3471bd70-9330-11ea-855c-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "history",
   "tour",
   "tour",
   "tour",
   "family",
   "tour",
   "family"
  ],
  "link": "https://maps.google.com/?cid=5764791066854798210",
  "source": "GoogleMaps",
  "reviews": [
   "My husband & I visited Sun Valley with a group of friends from out-of-town on Sunday afternoon. Brett greeted us immediately as we pulled in & made us feel welcome. We realized he was one of the owners even before he told us because he was so passionate about his work & the horses. Even though he is a young man, he is quite experienced & knowledgeable about the breeding process & the horse industry as a whole. He was always ready to answer our questions & provide additional information when requested. Being able to see & touch the mares & their foals was a wonderful experience for us. As Brett's parents led some horses by, they also greeted us & shared their expertise with us. The farm itself is breathtaking--some of Kentucky's finest, most beautiful rural acreage with a rich history of its own. Everyone in our group thoroughly enjoyed this visit. We highly recommend it to anyone traveling through the area who is interested in horses, history, or just the beauty of our great Commonwealth.",
   "Best tour!! Brett gives a great tour , great information...absolutely book this tour!!",
   "Beautiful horses....beautiful scenery....knowledgeable people.  This farm tour provides tons of information about the thoroughbred industry.  The tour is presented in a very understandable manner.  You leave this place feeling like you have really learned something and your mind is permanently highlighted with some of the most pleasant natural experiences you'll ever have.",
   "What a wonderful tour to see foals, colts and mares and to be educated on the whole process of blood lines for thoroughbreds!!  Brett gave a great tour of a family owned and run operation!",
   "The farm is absolutely breathtaking! The tour was very informative and the family is very kind and welcoming. We also got to see many horses and pet the foals. Overall, incredible experience."
  ]
 },
 {
  "name": "Kentucky Horse Park",
  "address": "4089 Iron Works Pkwy, Lexington, KY 40511, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/34b57d40-9330-11ea-8cf3-14b31f159f22.png",
  "tags": [
   "free",
   "walking",
   "learn",
   "kids",
   "history",
   "creative",
   "family",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15022245593534626598",
  "source": "GoogleMaps",
  "reviews": [
   "We absolutely loved visiting,  huge area, lots of walking.  We absolutely loved the horse rides. Friendly staff. Super Knowledge and willing to share their Knowledge.  There is plenty of free parking. A wonderful gift shop, plenty of horse memorabilia for purchase.  Beautiful grounds.",
   "First off you will need at least two days to fully take advantage of everything this park has to offer even in off season. I was amazed of how much this place has to offer for a reasonable price. If you have kids this is a excellent place to bring them to not only learn about horses, history,  genealogy, interaction with real horses, but shows too. I would highly recommend this place if you are in town or the area. I live 4 hours away and well worth the drive and money to visit.",
   "Spectacular! So much better than we expected! Just phenomenal! The horse museum is so fantastic! Could spend hours there. So interesting. \n\nIt's a great space, it's really a fun for all ages!",
   "Southern Light Christmas show was fun and creative. Lots of food, animal petting zoo, local merchants booths and a 3 mile course of top notch lights. Very classy and fairly priced. Good family fun. Its an annual program that everyone should attend. The Ky. Horse park provides great community service with this program.",
   "Went during Southern Lights, always enjoy the atmosphere. Cheaper through the week and less waiting in lines for the vendors that offer their  merchandise,  food vendors and the exotic zoo. The zoo is free but you can buy carrots and seed to feed the animals for a reasonable charge of $3.00 and $2.00. Camel rides are also available for a fee. The gift shop offers all types of horse related gifts for the horse lovers on your list. Also, they offer train rides for all to enjoy, no fee for this. And for the train enthusiast, they have several indoor scaled train displays. Some are interactive, some are not. But an enjoyment for all.\n We go every year, have made it a tradition."
  ]
 },
 {
  "name": "Keeneland Association Inc",
  "address": "4201 Versailles Rd, Lexington, KY 40510, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/35032838-9330-11ea-9520-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4292427169882168080",
  "source": "GoogleMaps",
  "reviews": [
   "Heaven on earth! One of my favorite places. So much fun even if you don't bet.  You see all types of folks; so fun to watch people and of course the horses. Such a beautiful place! Great for families too.",
   "Keeneland is a great track. It's very laid back compared to Churchill Downs. The setting is also beautiful tucked into the rolling hills of Lexington. Only problem you'll potentially face is a little traffic, but if you time it right you won't have a problem. Relaxing and beautiful.",
   "I have yet to go to Keenland as a general admission spectator. My first time in April 2019 was through a clubhouse name-on-a-list type deal per Malone's whose GM was supposed to have a box. We weren't given the number so never did end up sitting in a box just clubhouse grandstand. Never ate in the dining room but got dressed up almost for nothing. Really enjoyed Blue Barbecue brisket plate. Now the same venue is only serving the sandwich but it is still really good. During this Fall Meet, we had a reservation in the Paddock dining area. The service took a while but they made up for it in the end. The lunch selections had some traditional foods and great salad options. Non-alcoholic drinks were complimentary. Horse racing and access to the horses was easy. Took in a few races down at the dirt, a couple in the mezzanine, and some from the paddock walk abouts. Also did valet parking and that ran like clockwork, cost $10.",
   "Nice place to walk on a misty morning.  After enjoying breakfast at the Track Kitchen, walk the grounds and watch horses running for practice.  Good food, courteous service, beautiful campus.",
   "I love Keeneland!  If you ever visit Lexington, Kentucky, this is a must do.  You can get so close to the horses and jockeys either up by rails or in the paddock area.  Plus, there are so many ways to bet on the horses and watch the races.  Their food and beverages are great as well.  If you want some more up close and personal behind the scenes experiences, they offer a wide variety of tours for a small fee.  It really is for everyone.  You can spend as much or as little as you want and still have a great time.  Not to be missed!"
  ]
 },
 {
  "name": "Wild Turkey Distillery",
  "address": "1417 Versailles Rd, Lawrenceburg, KY 40342, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/35508540-9330-11ea-9da9-14b31f159f22.png",
  "tags": [
   "learn",
   "tour",
   "tasting",
   "history",
   "tour",
   "unique",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=6014458617020656433",
  "source": "GoogleMaps",
  "reviews": [
   "Wild Turkey is very conservative Distillery. One of the oldest Distillery in Kentucky and a lots of history you can learn from. Nice facility, modern gift shop, good tour and good tasting.\nWhat the cool thing is you can pick and buy private barrel for under nine grand. \nDon't forget say hello to Jimmy Russell and ask him to sign your bottle.",
   "Did the tour while on vacation. It was nice but the highlight was meeting Jimmy Russell in the gift shop and having him sign a bottle of Single Barrel Rye and getting our pic taken. He talks with you like he's known you for years. Very awesome experience if you are a lover of bourbon.",
   "Nice selection of bourbon products in the gift shop each time I've visited.  Always something available that's not readily available in the local package stores.  Unlike another, very large and popular distillery in the area (cough, cough Sazerac's Buffalo Trace) this gift shop is worth the visit for something unique being available to come home with.  Thank you!",
   "Nice selection of bourbon products in the gift shop each time I've visited.  Always something available that's not readily available in the local package stores.  Unlike another, very large and popular distillery in the area (cough, cough Sazerac's Buffalo Trace) this gift shop is worth the visit for something unique being available to come home with.  Thank you!",
   "Enjoyed seeing the Wild Turkey distillery and loved the gift shop too. Even got an autograph on a W. T. cutting board from the retired owner visiting with “his guests”.  It was great fun. Will go again."
  ]
 },
 {
  "name": "Thoroughbred Heritage Horse Farm Tours",
  "address": "1900 Clays Mill Rd, Lexington, KY 40503, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/35a61f92-9330-11ea-bacd-14b31f159f22.png",
  "tags": [
   "tour",
   "knowledgeable",
   "tour",
   "learn",
   "knowledgeable",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=6908388282250988757",
  "source": "GoogleMaps",
  "reviews": [
   "Interesting tour, able to get up close and see the action on the training track Visited another farm and saw this year's Mares and Foals.  Altogether a very worthwhile experience",
   "My husband, a dear friend from Maine, and I took the Thoroughbred Heritage Horse Farm tour on Saturday, November 2.  Our guide was Daniel, and he was amazing!  He was very knowledgeable  about every place we toured, plus he added humor to the tour!  We had a delightful time ending the tour 3.5 hours after starting, and we came away with much more knowledge about horses, the farms, and previous famous horses than when we started!  We highly recommend this tour company.  You won’t regret it!",
   "Very interesting tour to learn more about the industry. Saw some notable races horses and some intriguing facilities. Mike our tour guide was very knowledgeable.",
   "Our Guide was fantastic! We were met promptly, our mini bus was full. He was local so new all the history of Keeneland  Racey, the farms we visited and was a Betologist! Who knew one can be a connoisseur! Our involved visiting the racetrack, stopping by the visiting Budweiser Klidedales, visiting the resting place of Seattle Slew and big money winner Curlin's stud farm. We stopped at Kenny MCpeek's farm and met Curlin's Colt. We made our way past other Kentucky farms.  Remember to tip your Guide!",
   "My husband,  adult daughter,and myself had an amazing time with Vicky a few days ago!  Vicky was so informative and extremely passionate about educating us all about the farms, horses, etc.  It was breathtaking to see Keeneland, the gorgeous farms and the beautiful horses!! I loved being able to get up close and personal with the yearlings and the retirees.  It was a fabulous day that we'll never forget!  Thank you!"
  ]
 },
 {
  "name": "Bluegrass Distillers",
  "address": "501 W 6th St #165, Lexington, KY 40508, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/35f61480-9330-11ea-ad6a-14b31f159f22.png",
  "tags": [
   "tour",
   "brewery",
   "tour",
   "tour",
   "walking",
   "tour",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3038006296234909639",
  "source": "GoogleMaps",
  "reviews": [
   "Great experience. It is a little hard to find, since there aren’t really any signs. It is behind the brewery. You get to fill and label your own bottle.  The tour is short and informative but I would skip it. Just try some bourbons and get your own bottle.",
   "Went last year! Small outfit, but definitely worth a visit! Tour guide was super nice!",
   "Quaint little distillery.  Informative tour and fun to attend.  Learned a lot and met some great folks.  Highly recommend!!!\n\nIt is a little hidden though.  Must enter from the back side by the walking trail (Legacy Trail).  Definitely worth seeking it out.",
   "This is as close to a home distilling family run place as you will find. The tour was great for the information and conversations with the female guide. I give the tour experience a 5 star even though the place is small and a bit bootleg.\n\nI give the bourbon a 3 star because I was not too fond of it. I am more of a regular beer drinker but have bourbon or whiskey about once per week. Take it for what it's worth.",
   "Small Craft Distillery. Energetic Justin showed us the operation. We had fun. Let's keep a watch on this one."
  ]
 },
 {
  "name": "The Singing Bridge",
  "address": "117 Bridge St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/365a54d8-9330-11ea-b60d-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=1665431607339421484",
  "source": "GoogleMaps",
  "reviews": [
   "Words can't describe this bridge and the virws it offets of the river valley. A must see for anybody.",
   "Wonderful place to sing.",
   "",
   "",
   ""
  ]
 },
 {
  "name": "Four Roses Distillery",
  "address": "1224 Bonds Mill Rd, Lawrenceburg, KY 40342, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/36ae1a68-9330-11ea-b358-14b31f159f22.png",
  "tags": [
   "walk",
   "tasting",
   "history",
   "free",
   "tour",
   "tour",
   "tasting",
   "history",
   "tour",
   "unique",
   "family",
   "tour",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=15708964217714860433",
  "source": "GoogleMaps",
  "reviews": [
   "Loved this tour! First off, be sure to make a reservation before as they have limited hours. Also, the ticket price ($10 per adult) includes a free tour at their bottling and warehouse facility in Cox's Creek. The tour lasted about an hour, included a short video about the history of the distillery and walk around the property. After, we went inside and saw the column stills and doubler pot still. My favorite part was seeing all of the old cypress fermentation tanks, with the opportunity to dip your finger in and try them all! The tour concluded with a tasting of their four products, Four Roses, Four Roses Small Batch, Four Roses Single Barrel, and Four Roses Small Batch Select. I enjoyed the Single Barrel and Small Batch Select the most, plus you get to take your tasting glass home! Big shout out to Eileen, she was our guide and did a fantastic job!",
   "Didn't have time to do a tour, so my brother and I decided to do a tasting since we were only familiar with the Single Barrel product that Four Roses puts out.\n\nEileen led our tasting of all four products and was great. Very informative with the history of Four Roses and also had a lot of knowledge on how each product is made and the different recipes that go in them. Great explanation on how and why each product differed on the nose, palate, and finish. Will ask for her when we come back to do the tour!",
   "After visiting an different distillery, I felt like this was an step down. The most frustrating thing was finding out that the tour was using headphones and microphones, which was fine because I was Deaf and can read lips but a lot of the tour were when the back of his head were facing us. Please add closed captioning/subtitle to the short video at the beginning of the tour and maybe an cheat sheet with numbers of the places we are stopping at and the fun facts that the guide talks about. Ideally I would love to work on creating an Deaf Awareness day where all the distilleries on the trail are interpreted.",
   "Four Roses is fabulous. They are unique and thoughtful. Any event you attend at Four Roses is worth your while. In fact I told my husband last night it’s like a family at Four Roses. Everyone is friendly, helpful and always smiling. If you get the opportunity to meet Brent Elliott or Al Young they are both nice guys that gladly share their time and knowledge with you.",
   "We missed the walking tour, which is on the hour, so we opted for the taste of history (takes about 30 minutes). It was seven dollars to try four bourbons. As a nice added bonus, you get to keep the glass you use to taste.\n\nFred was very friendly and informative. He even went out of his way to find out what products were available in Australia for the couple that was visiting from there.\n\nDefinitely worth checking out this distillery."
  ]
 },
 {
  "name": "Equus Run Vineyards",
  "address": "1280 Moores Mill Rd, Midway, KY 40347, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/371c48ee-9330-11ea-bd28-14b31f159f22.png",
  "tags": [
   "winery",
   "tasting",
   "winery",
   "walk",
   "winery"
  ],
  "link": "https://maps.google.com/?cid=4161875262790621729",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing little vineyard and winery in a beautiful location. I really enjoyed all of the wines, after doing a small tasting of 6 for $7. Bought a bottle of the Farmstead Series Strawberry Wine, as well as Passionate Kiss. Looking forward to the opening of their distillery for Bourbon and Tequila! Very excited to return.",
   "Great local winery. Tastes for all palates from sweet to dry. Beautiful space with areas to sit and enjoy a bottle or go for a walk",
   "Cute little winery on winding country road. It was love at first sip (and I wish I could have been their with mine) with passionate kiss wine. They have an event barn.  The outhouse was something I haven't experienced before at a winery. Very quaint landscape.",
   "The most amazing place.",
   "A favorite place. Good wine, beautiful venue."
  ]
 },
 {
  "name": "Evans Orchard and Cider Mill",
  "address": "198 Stone Rd, Georgetown, KY 40324, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/377342d8-9330-11ea-ab8c-14b31f159f22.png",
  "tags": [
   "delicious",
   "kids",
   "free",
   "family",
   "kids",
   "family",
   "kids",
   "food",
   "delicious",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1674838165184425869",
  "source": "GoogleMaps",
  "reviews": [
   "Lots of play area for kids. The lines were long which is to be expected, but it was hard to deal with only because it was almost impossible to find out where the line was in the store. There were two different lines. Maybe 3. We had to ask a few customers where the line was before we found the end. Could use a bit more organization on super busy days like today. I love that they had baskets of sunscreen to use for those who forgot it and bubbles for smaller kids who couldn't quite play on all the different areas. My toddler loves the corn box and spent most of his time there. It was nice that it was shaded and had seats for parents to watch. We used the fall fun pass ($12 kids, $5 parents, under2 are free) which gave us access to the playground, hay ride, and corn maze. The hay ride (which doesn't feature any hay, which is nice) takes you out to the pumpkin patch and corn maze. Once you are there you are free to pick a pumpkin and when you get picked up there is a tent to weigh and pay for your pumpkins. 48¢ a pound which is a pretty decent price I feel like. We spent about 5 hours there and we're worn out by the end of it. Worth the money and had a good time! Oh, and the apple cider and donuts were delicious!",
   "Wonderful place for family fun in the fall.  Great selection of apples.  Wonderful cinnamon sugar donuts.  Can't wait to return in 2020.",
   "Got to visit Evans Orchard over the Fall Festival weekend. What a great place for fun.  Plenty of activities for kids and family to enjoy the outdoors.  Wonderful atmosphere.  The lines were long on Saturday as expected, but just glad to be there and experience the warm Fried Apple pies and Peanut Butter Fudge.  Worth the visit everytime !!",
   "THIS A BEST PLACE FOR KIDS TO HAVE A GREATNESS OF FUN, A LITTLE BIT A WAY FROM  DOWNTOWN LEXINGTON. THE ROAD TO THERE, IS EXTRAORDINARILY CLEAN AND NOT CROWDED,  A QUIET PLACE FOR KIDS TO PLAY WITH MANY  GAMES AND FUN RIDES .\nTHE RESTAURANT IS VERY CROWDED, SO BRING YOUR OWN FOOD IF YOU ARE IN HURRY, OR JUST GET ON LINE EARLIER OR JUST BE PATIENT AND STAY ON THE LINE BECAUSE IT GOES FAST.\nBE THERE, ON TIME, AND PAY FOR YOUR  ADMISSION FEE, IS CHARGED FAIRLY BUT YOUR ARE NOT CAN GET IN  WITHOUT IT.\nTHE KIDS ARE VERY HAPPY AND DON'T WANT TO LIVE SO BE PREPARED FOR IT.",
   "I was visiting family in the Lexington area and they took me here.  What a lovely way to spend a fall day.  Pumpkins everywhere!  Delicious fudge! Great place to take the kids as there is a playground, a trampoline-like device and various other activities.   Plenty of parking."
  ]
 },
 {
  "name": "Masterson Station Park",
  "address": "3051 Leestown Rd, Lexington, KY 40511, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/37c9a59c-9330-11ea-9adf-14b31f159f22.png",
  "tags": [
   "walking",
   "hike",
   "family"
  ],
  "link": "https://maps.google.com/?cid=13307136177004647392",
  "source": "GoogleMaps",
  "reviews": [
   "Still a work in progress, the children's park is great. However, lots of empty space that hasn't reached it's full \"park\" potential. We enjoy walking it, but super dangerous crossing to trail that goes across Leestown Rd. This really could be \"the best\" Lexington Park but we just aren't there yet. Nearby residents can only hope.",
   "Such a wonderful place to bring the horses! All the other riders are so friendly and helpful, and it’s such a great atmosphere with tons of space to hack and see the sights!",
   "Dog Park.  Water fountains for the dogs was nice to see and 2 large areas for them to play.  Good to see clean up bags provided and the park looked clean.  Nice job on the upkeep by providers and users. 👍🐕🐩",
   "We enjoy our visits to the soccer fields at Masterson Station and the girls finished their season strong with a W! ⚽️ The park is well kept and clean. We have plans to visit the dog park soon.",
   "Great place for family and friends to come together and have fun! Lots of places to hike and love the Soccer fields."
  ]
 },
 {
  "name": "Rebecca Ruth Candy Tours & Museum",
  "address": "116 E 2nd St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/381b0158-9330-11ea-9323-14b31f159f22.png",
  "tags": [
   "eat",
   "history",
   "tour",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2792701502661298281",
  "source": "GoogleMaps",
  "reviews": [
   "Best Chocolate Covered Bourbon Balls anywhere. The other treats are pretty good, too. Friendly staff working the shop are ready and willing to help you find exactly what you need. Plenty of parking available. Be sure to ask about a bag of “Boo Boos.”",
   "Great customer service, and the candy is soooooo good. I am from Utah and I will be ordering candy from here now. Nothing like this place.",
   "We are on vacation when we drove by and saw the sign for Bourbon Candy. I insisted we stop and I’m so glad we did. The woman working inside was such a delight and told us the history of the candy store. I’m so glad we stopped and Can’t wait to eat all the sweets!",
   "Cute lil store and shop! My parents named me after this store 58 yrs ago. Such variety of candies. The tour is very interesting as well. They also provide mailing of their candies around the world!",
   "Had a nice tour of the Rebecca Ruth candy store and Museum. Such wonderful history. Our 6 year old granddaughter even enjoyed. Course the chocolate sample she got at the end didnt hurt."
  ]
 },
 {
  "name": "McConnell Springs",
  "address": "416 Rebmann Ln, Lexington, KY 40504, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/387333a8-9330-11ea-bb30-14b31f159f22.png",
  "tags": [
   "history",
   "kids",
   "eat",
   "nature",
   "hike",
   "history",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15409039092887456106",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of my favorite trails when taking little kids. \nI absolutely love that they have a full trail that is pavement. \nThough everything looks prettier in the spring after it's bloomed, it still is nice to get out and enjoy nature. \nI love that there are so many signs that explain the history. I love the exhibits on the inside building as well. There is a nice picnic area to eat and trash cans. \nI love the sign-in sheet so they can find us if something was to happen. \nThere are so many wonderful things about this trail.",
   "A nice Walking Park would not call it a hike. It is very similar to the arboretum in regards to plant life and paved walking path. NOT A HIKE. The park is to close to industrial complexes causing tons of noise pollution. Otherwise a nice place tons of history and gorgeous water in creeks.",
   "The springs are beautiful. A lot of work has been done on the park recently. The viewing platform at Final Sink is very nice.",
   "This was a really cool stop I just wish I went there in the Spring or Summer when it was warmer. One thing you will notice right away is that the people working there are so ridiculously nice it's amazing. Also they have a really great indoor learning facility with live animals, fossils, bones, skins and more. The trails are really well pathed so even people with wheelchairs, crutches and walkers can enjoy it no problem. This is a wonderful way to get out of the car and stretch your legs and give the kids a way burn off some energy that's both entertaining and educational.",
   "Beautiful, well maintained trails.  Although in the fall/winter you can easily see signs of factories through the trees"
  ]
 },
 {
  "name": "Kentucky River Tours",
  "address": "100 Great Buffalo Trace, Frankfort, KY 40601, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/38c4fd6e-9330-11ea-82f9-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "tour",
   "tour",
   "kids",
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=11352012134710093476",
  "source": "GoogleMaps",
  "reviews": [
   "My wife and I booked an outing on the river and had the pleasure of meeting both Captains Allison and Nathan. From start to finish the experience was fantastic! From an easy pick up and drop off at the buffalo trace distillery to a very welcoming and knowledgeable boat tour on the Kentucky river. If you’re looking for something a little different in bourbon country yet still relaxing then this is a must do excursion! Can’t wait to come back and do it again!",
   "Captains Allison and Nathan are both great! They took us on a beautiful tour of Frankfort's Kentucky River. They showed us lots of points of interest and catered to our 3 year-old's love of turtles by slowing down the boat so she could see them sunbathing. The boat was pristine and had all of the necessary safety equipment. I would highly recommend this adventure!",
   "A fantastic new experience in Frankfort, KY that is great for both adults and kids.   We thoroughly enjoyed the view and the stories. Visit Frankfort and take this fun, informative tour of the Kentucky River!",
   "Great tour!! Capt Nathan is awesome!! Friendly and accommodating.",
   "We loved this tour on the river. It was an amazing day with lots of information. We enjoyed the ride to the boat and the boat trip equally, everyone was so fun to be around. We will definatly recommend it to anyone passing through or hanging out in Frankfort again."
  ]
 },
 {
  "name": "Bluegrass Scenic Railroad and Museum",
  "address": "175 Beasley Rd, Versailles, KY 40383, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/390784da-9330-11ea-9eb8-14b31f159f22.png",
  "tags": [
   "free",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=17489657082026375960",
  "source": "GoogleMaps",
  "reviews": [
   "The right side of the train has all the views. This is why I only give it three stars. The right side of the train is where we took most of our photos. Sit on the RIGHT  side of the train!!!\n\nOther than that we loved the ride. Free water and bookmarker at the end of the train ride before returning was a plus thanks to the Volunteers. Very nice people. Very nice. \n\nExcept\n\nThe only other thing I disliked. Is that even though we were in line. People tried cutting in front of us to get better seats. Even though we had arrived on time and had time to look around and waited. People started running to the conductor to get inside. Even though the Conductor was \"Yelling Open AIR only\" people who started to arrive in first class tried to board the train. I paid for First class and I arrived 45 minutes before like it stated online. Before it started and had a few people try to move us out of the way. They should board people by time of arrival, let the people who have been waiting longer in the HEAT, get on first. It was 90 degrees today. Not to add, people need to switch sides/seats so other people can get a better view since the right side has all the views.",
   "We loved the ride (in the first class air conditioned car.  The only limitation of the entire experience is the fact that it seemed too short (and we understand the track is safe only so far).  However, the value for the price per person is exceptional.",
   "A nice Museum and about an hour or so train ride up to a closed bridge and back. Good place to spend some time and see some railroad memorabilia.",
   "Very enjoyable experience & fun for the whole family. Great bunch of volunteers working there, very friendly & informative about the trip as well. We will be back!",
   "It was fun with my family and my son absolutely loved the experience... Definitely recommend is good for autistic children or was with mine... The only reason I give it 4 stars instead of 5 is the day we went we booked 1st class  but due to technical difficulties with the generator that runs the A.C we had to step down to second class. In no way was it their falt nor do I blame them the staff was real nice but it... The ride was enjoyable and you get to see some of the stables and stuff for the pure breed horses as well..."
  ]
 },
 {
  "name": "Mary Todd Lincoln House",
  "address": "578 W Main St, Lexington, KY 40507, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/394d8eba-9330-11ea-9922-14b31f159f22.png",
  "tags": [
   "learn",
   "kids",
   "history",
   "knowledgeable",
   "family",
   "tour",
   "history",
   "knowledgeable",
   "family",
   "tour",
   "knowledgeable",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=1759031516033143144",
  "source": "GoogleMaps",
  "reviews": [
   "A gem right in the heart of downtown Lexington.  Enthusiastic and knowledgable staff. The house is well kept and beautifully decorated.  Attended for their President's Day event and there was so much to do.  Great activities for the kids in each room with good interaction and a fun way to learn about history.",
   "Went there to see one of the authentic places that Mary Todd Lincoln grew up in. It did not disappoint. We were taken on a tour through the house and shown their amazing collection. The tour guide was knowledgeable and shared many details about the family history. Would recommend for any history buff looking for an interesting excursion in Lexington!",
   "This tour was so education and informational. The home is has furniture from the Todd family, passed down through the generations that eventually returned back to the family home, and other pieces from the time period. \n\nThe tour guides are very knowledgeable and happy to answer questions, even from the youngest guests on the tour.",
   "While in Lexington touring the University of Kentucky, My son and I, toured the Mary Todd Lincoln Home!  It was very interesting! Our tour guide was very informative and knowledgeable. The home, which contained beautiful relics  (many original) gave a sense of how life may have been back in those days! My favorite part was using the homes original staircase, and touching the stair railing which was  touched by Mary Todd Lincoln, and quite possibly Abraham Lincoln!",
   "Very interesting.  Lovely home. nice visit"
  ]
 },
 {
  "name": "Ashland - The Henry Clay Estate",
  "address": "120 Sycamore Rd, Lexington, KY 40502, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3999da10-9330-11ea-ba6a-14b31f159f22.png",
  "tags": [
   "tour",
   "historic",
   "art",
   "walking",
   "tour",
   "historic",
   "history",
   "tour",
   "kids",
   "nature",
   "history"
  ],
  "link": "https://maps.google.com/?cid=6697291940781765699",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful inside and out.  The garden is stunning when in full bloom, and the home tour is something every Lexingtonian should experience at least once.  A lot has been done to make the grounds more appealing in recent years, including all the giant steel sculptures, mulched walking paths, and other interesting art and exhibits.  They've also tried to attract different markets and age groups by offering events such as yoga on the lawn.  The employees are not the nicest you've ever encountered, which has dissuaded me from taking others on the tour, but there's so much to see that one aspect shouldn't deter you.  The grounds have lots of historic aspects, too.",
   "Great tour, but didn’t realize not Henry Clay’s house. It was torn down by son and rebuilt on same foundation. So, the same room, but not really. That said, still a very nice historic house.",
   "For history lovers, this is a very interesting place to see. I really enjoyed viewing the original coach Henry Clay used traveling back and forth to Washington. Seeing. Furniture from the 1800s and the beauty of the Mansion itself ensures a worthwhile trip! Make a point to check out the formal Garden!",
   "The grounds are a great place for my 3 year old to run around and discover nature. Unfortunately the tour is not suitable for kids her age. Too many boundaries and not interesting enough for her. Good for adults, though.",
   "Unfortunately it was closed when we got there. Looks very interesting for any history buff."
  ]
 },
 {
  "name": "Aviation Museum of Kentucky",
  "address": "4029 Airport Rd, Lexington, KY 40510, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/39f58f28-9330-11ea-8f74-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "knowledgeable",
   "knowledgeable",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=6564240490426937529",
  "source": "GoogleMaps",
  "reviews": [
   "Really nice sized aviation museum.  They have more planes than you would think.  Took my 5 year old daughter and her friend.  They loved seeing the planes, sitting in a helicopter, playing a flight sim game.  Perfect for an hour or two.  For the big kids, aka Dad, they have about 5 or 6 fighter jets and tons of planes from many different decades.  Most notably for me is a F-14 Tomcat.  It has been there since 2005, but it never gets old seeing one of the largest fighter planes ever made.  Truly amazing engineering.  Take a couple hours on a Saturday or Sunday afternoon and check out the much overlooked Aviation Museum of KY, it's right by Bluegrass airport.  $10 adults, $7 6-17, under 6 free.  If you like aviation at any level, you won't regret it.",
   "A wonderful museum! My brother and I went and the staff was very knowledgeable and interested in talking to us about the planes. Had a wonderful time and loved the little plane earrings they sell!!",
   "Staff was extremely friendly and informative. Most of them are volunteers. It doesn't seem like they change the exhibits regularly. It was cool sitting inside of a Cessna 150 and a Bell helicopter. Many different types of aircraft and articles. Took about 1 hour to see everything if you take your time. Two separate rooms house all of the exhibits. Check it out!",
   "Interesting displays and great, knowledgeable staff. We'll be coming back!",
   "Happily surprised and really enjoyed this museum inside their is a helicopter and small airplane you can get inside and with working pressable buttons and you have to try the flight simulator. I also need to mention the very kind friendly knowledgeable employees working there."
  ]
 },
 {
  "name": "Waveland State Historic Site",
  "address": "225 Waveland Museum Ln, Lexington, KY 40514, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3a4d250a-9330-11ea-8f26-14b31f159f22.png",
  "tags": [
   "tour",
   "kids",
   "tour",
   "history",
   "art",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8815507479397935015",
  "source": "GoogleMaps",
  "reviews": [
   "We didn't actually tour the house (yet) but visited Santa in the barn. He was just perfect! The barn was magically decorated and the kids had such a sweet experience. Thank you for offering this special gift to the public! The grounds even in winter are lovely. We will definitely be back in the spring to do a true tour.",
   "Was part of the ghost hunt on 10/25/2019. Fabulous experience.  Wonderful and beautiful place. I had an experience with a spirit and an EVP I will never forget. Thank you to all the staff members who helped me along the way.  Where's the footage? 😉",
   "We did the ghost tour.  Way too many people on the tour.  Was more touristy then expected.  We would have preferred using our own equipment and being by ourselves with a tour guide.",
   "We visited on a day of what had been billed as a large arts and craft fair with food trucks and tours.  There was a coffee truck, a pizza truck and a barbecue truck.  Not a big selection. Tours of the house were shortened but informative and guides were well versed in the history of this old hemp plantation. I was also expecting a larger turnout of art vendors --so this was a little disappointing.  \nThe old house is beautiful and full of Kentucky history making it worth the entry fee and visit.",
   "Went for Christmas Tea in a group of 4. It was truly magical. The volunteers did such an amazing job"
  ]
 },
 {
  "name": "Castle & Key Distillery",
  "address": "4445 McCracken Pike, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3aa30d66-9330-11ea-896d-14b31f159f22.png",
  "tags": [
   "family",
   "knowledgeable",
   "history",
   "drink",
   "tour",
   "family",
   "delicious",
   "tasting",
   "history",
   "creative",
   "tour",
   "knowledgeable",
   "tour",
   "learn",
   "tour",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=6504213894713785043",
  "source": "GoogleMaps",
  "reviews": [
   "My family was visiting from out of town and were looking to tour one of Kentucky's many distilleries. The other distilleries that we looked at were either booked or closed on Sundays. Luckily, we stumbled on Castle and Key. We arrived early and got drinks at the bar. The bartender (Jordan) was super friendly and obviously very knowledgeable. The drinks were excellent (coming from someone who doesn't normally drink gin.) The tour was a ton of fun. The distillery has such an interesting history behind it and our tour guide, Russell, was an excellent host. I would highly recommend Castle and Key and can't wait to try their bourbon once its ready.",
   "Fabulous place, authentic & true to their mission to preserve a beautiful storied site and produce high quality spirits to match.  Well worth the trip, a standout in an area with many tour options.  \n\nWe brought our family here today and did the 1.5 hour tour.  The tour was led by Richard and Russell and provided great insight into their spirit production and extensive access to the full site with history and insight into the preservation efforts.  The buildings were beautiful and almost stuck in time in the best way possible.  Their bar, event space, and welcome areas are gorgeous and were thoughtfully furnished.  They also have well designed outdoor spaces perfect for nicer weather.  We also were lucky enough to meet Rick Key, their resident rescue cat who is sweet and adorable - he is worth the ticket alone.   \n\nTheir team was passionate about the site’s history and focus on quality spirits.  Everyone was very welcoming throughout our visit.  The tour finished with a very intimate and creative tasting of their vodka and gin - both were delicious and we typically do not enjoy clear spirits.  They have their first bourbon (fingers crossed) releasing in 2022.  Unlike other distilleries they are not releasing branded bourbon from other producers and are focusing solely on their own production with bottled in bond products - very promising things to come!",
   "I booked this experience for my girlfriend and I. We had a great time, our tour guide Tony was great and very knowledgeable. We met two other couples on the tour and we all had a great experience. We can’t wait to come back in the spring when the weather is a little warmer. We heard there are talks of turning the old administration building into a hotel/bed and breakfast, and maybe even a rooftop bar! We hope to see progress on that the next time we come back. I would highly recommend this to anyone looking for a personalized distillery experience!",
   "A fantastic place to see... From the guided tour to the cocktails afterward, I would highly recommend it.  Suggest taking the 1 and 1/2 hour tour.  There is so much history steeped within the walls and on the grounds. This is definitely a place to go if you’ve never been and/or to take visitors from out of town/State that are interested in bourbon, gin and vodka distilling.  There is also a lovely sunken Garden and much more to see and learn while being there!   Two thumbs up!!",
   "Tour host is the best I’ve ever had.  Tour showed the  full circle that bourbon 🥃 industry has taken.  To see the restoration of this property is amazing.   Future looks bright for this company. Best tour I’ve ever done.  I’ve almost finished entire bourbon trail and definitely suggest this  visit."
  ]
 },
 {
  "name": "Ark Encounter",
  "address": "1 Ark Encounter Dr, Williamstown, KY 41097, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3aedab52-9330-11ea-9de0-14b31f159f22.png",
  "tags": [
   "walk",
   "cheap",
   "kids",
   "family",
   "family",
   "family",
   "eat",
   "food",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=17487151303003525189",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely amazing. Adults will appreciate it more than the kids but if they know the story they will love it as well. So much to see and so many people there trying to see it. You need to give yourself a couple of days to see everything without over tiring yourself and to assure you get to see it all.  The crowds can get large so reading the exhibits can be tricky that's a good reason to try to see it over a couple days instead of one long day.  Lines moved very quick to get in and on a shuttle to the Ark. Landscaping is awesome outside of the Ark providing several picture perfect photo shots. Handicap friendly.  The kids will get tired as it is allot to see. The small petting mini zoo like areas outside are very hot though with limited shade, small cramped areas for the animals to walk around in and little to no seating to rest your tired legs. The snack shops outside of the Ark were not open so cannot review those.  The Ark's gift shop is wonderful with so many options of things to purchase. Prices aren't cheap but neither is the quality of the items. A great place to visit but wear comfortable shoes, and pace yourself.",
   "Everything I thought it would be and more. This is a one-of-a-kind exhibit, a must-see. The park grounds are well-maintained, the staff is professional, friendly and helpful, and the guests are very friendly as well; everyone works together to keep the place clean and family friendly. I loved the buffet and really enjoyed the zoo. I would recommend this place for religious and non-religious people alike. Great place to take your family in Kentucky! 😁👍",
   "The most amazing experience. Well worth the money. I do highly recommend getting there first thing so you can truly enjoy everything they have to experience. Puts such an awesome realization of what Noah and his family were able to accomplish. Makes the Bible that much more real! \n\nI am planning on saving up to bring my children there. It is a once in a lifetime experience that should be experienced more than once!!!!",
   "This is definitely worth seeing in person. It’s incredible that such a large ship could be built before modern day technologies and machines. I’ll admit too, I didn’t realize Noah had Dinosaurs on the ship. So many animals and so many different species. Its amazing Noah and his family could take care of all of them. It must have been exhausting for them. Not to mention, the smell they must have dealt with. \n\nWe visited during the off season so there were parts not open but the ship is the main attraction, so it didn’t bother us that we only saw the ship. \n\nThe only thing that did disappoint us was the lack of food choices. Only the restaurant was open, which is a buffet and very expensive for someone who doesn’t want a lot to eat. I would have rather spent money on food from the other spots where you can buy smaller portions cheaper. However, with that said, the buffet food was good. Not worth the money good though. \n\nAs a side note, we stayed at the Hampton Inn a couple exits away from the Ark. If you want somewhere to stay within minutes of this place, I highly recommend that hotel.",
   "It is a great place to take the family.  Walking into the Ark you get a wow factor just seeing how enormous it is.  They explain evolution vs. creation and give so much data explaining the two arguments.  It is very well done."
  ]
 },
 {
  "name": "Thoroughbred Park",
  "address": "100 Midland Ave, Lexington, KY 40507, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3b3f4e00-9330-11ea-84d1-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "art"
  ],
  "link": "https://maps.google.com/?cid=12325341763934031318",
  "source": "GoogleMaps",
  "reviews": [
   "Fun for the kids to run around and see the bronze statues.  Details on the statues were so fine, actual clothing and tack might have have been dipped in bronze  Maybe the jockeys too....",
   "I like to go here for a quick walk.",
   "Really pretty, the horse statues are incredible, great place to stop & take a few selfies lol",
   "This is a lovely park.  I see a few people speak of climbing on the horses.  These are pieces of artwork.... not playground equipment! Enjoy them as the pieces of art that they are.",
   "Nice little park. \nCool horse statues, I think that's what you'd call them.\nAnd a water fountain that you're not supposed to swim in but people do."
  ]
 },
 {
  "name": "Yuko-En on the Elkhorn",
  "address": "700 US-25, Georgetown, KY 40324, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3b89013e-9330-11ea-956d-14b31f159f22.png",
  "tags": [
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=6650325403298685781",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great place to ho and just walk around with your family, a significant other, or alone. Depending on what mood you are in. It is beautiful and peaceful. Been here many times. One of my favorite places to go when i just need calm",
   "This park is beautiful, especially in the Spring with red buds, dog wood and other flowers in full bloom.  With all the water and rocks, it is a very relaxing place.  The only negative is the parking area with pot holes.  The city should repair it.",
   "Beautiful tranquil place to visit.",
   "This is nice but the bathrooms were closed and the property needs up keep.",
   "Beautiful place to watch the sunrise and calm your mind"
  ]
 },
 {
  "name": "Jacobson Park",
  "address": "4001 Athens Boonesboro Rd, Lexington, KY 40509, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3bda07b4-9330-11ea-958c-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "pets",
   "eat",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13889256915731878693",
  "source": "GoogleMaps",
  "reviews": [
   "I love this park. It's absolutely beautiful and full of wildlife. During the summer there are lots of families, but the park is so large it never really feels crowded. If you play pokemon go, there are plenty of stops and gyms. The park is also dog-friendly, which I really appreciated. You can rent out a paddle boat, go fishing, or host a picnic. It's a really nice place.",
   "Our favorite park in town. During the summer time, we go to the splash pad, where the kids love to get wet and have fun. They also have an enormous playground area, with separate areas for young and older children. We've been going to this park since our kids were infants. I don't see us stopping any time soon. Pro tip: Don't chase the ducks!",
   "I work in that area. I was not actually at the park. Its quaint from the road as you pass by. It looks like a safe place to take kids and pets. The neighboring businesses and homes are all well kept. Also there are sone good quality places to eat.",
   "Our dog loves the dog park here. Always friends to play with. Parking is very easy too.",
   "Love going to Jacobson Park Big Lake you can fish kids can play. Just an all-around good time."
  ]
 },
 {
  "name": "Scott County Park",
  "address": "1260 Scott County Park Rd, Georgetown, KY 40324, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3c317e86-9330-11ea-9c4d-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=12516179666551705353",
  "source": "GoogleMaps",
  "reviews": [
   "Love this park. Took my kids when they were little. Now my grandkids. So much for them to do. Public bathrooms to. The park is also free to the public.",
   "I wasn’t overly impressed with the park generally.  I was impressed the the powerful force the river had become because of the rains we had been experiencing.  The water was 2 feet higher than normal, making an exciting visit.  I want to go back under normal conditions to better rate the park.",
   "Great place to take your kids to play. Lots of area to run around,  nice play ground  and a good walking trail around it. Also has to small ponds to fish in. Baseball fields, tennis courts,  basketball court...plenty to do",
   "Very beautiful and clean, quite and not alot of traffic the further back you go. Great place to take your dogs.",
   "Great place to get some fresh air. Plenty of open space and jogging paths The two ponds are stocked with several fish species. Great for catfish, bluegills and trout."
  ]
 },
 {
  "name": "Shillito Park",
  "address": "300 W Reynolds Rd, Lexington, KY 40503, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3c7cdfee-9330-11ea-b140-14b31f159f22.png",
  "tags": [
   "pets",
   "walking",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=11559842315047412280",
  "source": "GoogleMaps",
  "reviews": [
   "Have been going to this park since I was a little kid. Back when everything was old. I love this park with all my heart, definitely a great place to go for picnics, summer events, sports with friends, or even walks with pets. Beautiful park and full of life. Highly recommend",
   "Excellent design, quality, environment, and clean. Bathrooms on site.",
   "Very nice park. Layout is easy to navigate. Running / Walking trail around the park. Lots of open fields to play soccer, football, baseball, or any other outdoor activities. Big restrooms and lots of parking!",
   "I enjoy the walking path which winds among trees for much of its length. Also it is a family park with people of all ages.",
   "Today I had an appointment to see this apartment complex for the 3rd time. I show up and there is no one there. The office was locked and a note saying they would be back at 5pm and we had an appointment at 4:30. The first time they called before the appointment to cancel because they double booked and had someone moving in at the same time then rescheduled for the next Saturday and they called again saying they had someone moving in. Now for the 3rd time they never called or anything and no one was there. The communication has been horrible and it has been so frustrating to try to see this apartment complex. Don't recommend."
  ]
 },
 {
  "name": "The Living Arts & Science Center",
  "address": "362 N Martin Luther King Blvd, Lexington, KY 40508, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3cca63de-9330-11ea-b3f8-14b31f159f22.png",
  "tags": [
   "field",
   "learn",
   "kids",
   "art",
   "kids",
   "knowledgeable",
   "free",
   "wander",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=7147369023903253889",
  "source": "GoogleMaps",
  "reviews": [
   "My son had a field trip here today and it was great , they have so many hands on activities and so many things for kids to learn! All of the kids had fun and recommend that other kids come check it out, I asked the kids what part was their favorite over half said the habitat exhibit , and the rest liked the area where they made paper bats. (The animal lol) I would definitely encourage you to bring your children here!",
   "Awesome art classes. Gallery space. Science exhibits! And a planetarium!!",
   "I do yoga here with Cindy Reed, she owns the Massage and Yoga studio in Dudley square. I love her, I love the yoga. And I love the yoga here on Sunday mornings at 10am. $5 a class. \nThe Living Arts venue is super supportive, and they offer So Many Neat things to do! For kids and adults. Check them out for sure!",
   "The planetarium was amazing! Everyone was so knowledgeable and kind! Free to wander around and totally worth checking out.",
   "A great local science museum with various monthly exhibits. Very hands on and interactive with the artwork and the science, great for kids of all ages. One of the best things about the LASC is the planetarium. It houses the only planetarium in Lexington within a 25 mile radius. I volunteer here and have a blast working with the kids and seeing the exhibits myself. A must visit place in Lexington, and oh, did I mention it is free Monday through Friday 8:30 am to 5 pm?"
  ]
 },
 {
  "name": "American Saddlebred Museum",
  "address": "4083 Iron Works Pkwy, Lexington, KY 40511, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3d2f40be-9330-11ea-81b8-14b31f159f22.png",
  "tags": [
   "learn",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8586415602010821620",
  "source": "GoogleMaps",
  "reviews": [
   "We visited yesterday, I mentioned that I was a teacher and had a student, who was a struggling reader and loved horses, so I pick up free reading material about horses for my classroom. She asked us if we could wait a minute, she returned with a host of various horse reading material and activities as a gift for my classroom! I can’t wait to see the student’s face. Thank you so very much.The museum is a wonderful place to visit and learn about this specific breed of horse. They currently are remodeling to bring even more wonderful educational exhibits and it is included in admission to the Kentucky Horse Park.",
   "I worked on the remodel so there wasn't much to see.",
   "Great place to spend a day or two.  Get close to some beautiful horses and explore the history behind our equestrian heritage.",
   "Cant wait for the remodel to be done! Great place nice staff and lots to do! A very nice place to stop especially if you love horses. Must see place even if your traveling through!",
   "Very nice!"
  ]
 },
 {
  "name": "Triangle Park",
  "address": "400 W Main St, Lexington, KY 40507, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3d8158cc-9330-11ea-8bae-14b31f159f22.png",
  "tags": [
   "walk",
   "art",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17836340264032773201",
  "source": "GoogleMaps",
  "reviews": [
   "We went here twice so far this winter to take my daughter and her friend ice skating.  You can skate for hour and a half for $15 and they furnish the skates. You have to park at the parking garage on Main Street and walk about 2 blocks to the park. They have a stand that sales hot chocolate and coffee and other snacks. Its downtown so it's well lighted and so is the parking garage.",
   "The atmosphere is great during the holiday season with the ice skating rink. The ice is a little rough since it is outside and not in a controlled space. If you are going to skate for the first time I would recommend doing the indoor version first.",
   "This park is awesome and well designed fot the community here. It reminded me of home in Chattanooga but they don't have a professional football stadium or baseball team. The Red's do come during off season to play there. So, much to do here, architecture, history, art etc. \nWhat's not to like",
   "Beautiful place! Love the fountains! ❤️ We went too the tree lighting. They have an ice skating rink, hot cocoa, funnal cakes! Great time!",
   "It use to be a great place to visit. Too many riff raff now"
  ]
 },
 {
  "name": "Ward Hall",
  "address": "1782 Frankfort Pike, Georgetown, KY 40324, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3dc84d0a-9330-11ea-9409-14b31f159f22.png",
  "tags": [
   "tour",
   "kids",
   "history",
   "cheap",
   "history",
   "historic",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2903356207491866671",
  "source": "GoogleMaps",
  "reviews": [
   "Such a fun place and great to view when all done up for Christmas.",
   "I am not a big history buff nor an I into architecture, but after driving past this place numerous times, decided to take a tour.  What a fantastic attraction.  Our docent, Ron, was amazing. Full of fun stories and interesting facts.  I was surprised at how many kids were on our tour and they were fascinated by the stories Ron had to tell.  A beautiful property that is just going to get better over time and the renovations continue.  This mansion is massive and stunning.  Words nor pictures cannot do it justice.  I'm looking forward to going back to see the gardens in full bloom and then again at Christmas for the candlelight tour.",
   "Impressive and well worth a road trip. Kentuckys Ward Hall is amazing and they are trying to restore it to what it once was. Tours are by pre determined dates and extremely cheap at only $7 per adult. Highly recommend checking out and listening to the tours guides in depth knowledge of the history of the home and the people that called it home.",
   "Had a great time at the Seed to Feed dinner series. This one was at historic Ward Hall. Had a wonderful evening with great food and atmosphere. The people at our table were a blast!",
   "Great old place.  Good for taking portraits - lovely scenery"
  ]
 },
 {
  "name": "Bourbon On Main",
  "address": "103 W Main St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3e17ccdc-9330-11ea-8547-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=11446164173544582509",
  "source": "GoogleMaps",
  "reviews": [
   "Great food! First time trying it after reading some other reviews and was wanting something new in Frankfort. We got the burgers and fresh cut fries. So so good! Our server was Ashley, very friendly and gave us great recommendations for the signature cocktails. Had the bourbon side car and it was very very good! Will definitely come back!",
   "Fantastic \"hole in the wall\" type restaurant. Found this after hitting a few stops on the bourbon trail. Excellent selection of bourbon and beer to go along with American-style food. We had the Spicy Burger, and it was great. Nice atmosphere with very friendly staff. Definitely check it out if you're in the Frankfort area.",
   "This place may seem inconspicuous from the street but make plans to eat here.  Absolutely nailed the burger from bun to beef. Cooked to exact request. \n\nIf you're looking to taste all the local burbons, they have a fantastic selection.",
   "Great food, excellent bourbon selection. Thank you to Kelly for making us feel welcome. An extra shout out for Annie (sp?) for great food and beverage suggestions along with n awesome  smile and being just a genuine person!",
   "It was a great time as well as delicious dinner and spectacular drinks, the service is unmatched anywhere else here in our capital city of Frankfort!!!! The bartender is very friendly and and welcoming......  They would love to have you stop by and check out their take on Capitol cuisine"
  ]
 },
 {
  "name": "Serafini",
  "address": "243 W Broadway St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3e6d6728-9330-11ea-b83c-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13252551660344221814",
  "source": "GoogleMaps",
  "reviews": [
   "Valentine's dinner. The food is dope. But I didn't take a picture of the food....I forgot. Basil pesto gnocchi was fantastic. We both had the pear and walnut salad super awesome. Chicken parmesan, Shane said it was fantastic too. Our waiter was really nice.",
   "Serafini is one of my old favorites! I used to work in Frankfort over a decade ago and this used to be on the regular lunch rotation. It is one of the beat Italian restaurants in town in my opinion. Food is always fresh and delicious and this time around it didn't disappoint either. We were short on time and decided to head to Serafini for lunch. Service was great and the ambiance was perfect. The restaurant seemed immaculate too. I had the BBQ burger and my colleagues had the pork chop and the chicken salad sandwich. All the meals were delicious. We will definitely return when we are in town for work! Try it! You won't be disappointed!",
   "Great Italian restaurant with a friendly atmosphere. Carlos is wonderful host and manager. Great people person and has never known a stranger. Very personable and definently will make you feel welcomed.",
   "I stopped for a cocktail at around 2:00 p.m. on a rainy day and wow! The bartender had time and I was treated to a lesson on some really good bourbons and ryes. I didn't eat but if the rest of the staff is any thing like the bartender it's a winner.",
   "Incredible menu with tasty selections! Reasonable prices and excellent service make this a must stop in Frankfort. Food was delicious!"
  ]
 },
 {
  "name": "Cattleman's Roadhouse",
  "address": "151 Jett Dr, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3ec17afa-9330-11ea-8cd6-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4833108144226319489",
  "source": "GoogleMaps",
  "reviews": [
   "Incredible steak here hand down. Probably best prime rib I have ever tried. Crust on prime rib so incredible of pepper flavors. So much better than Texas roadhouse.",
   "Our first time at a Cattleman's Roadhouse and had a pleasant trip.  Angela was our server and she demonstrated her skills.  Pleasant to chat with, kept up with the drinks and kept us up to date with the progress of our lunch order.  The salad bar had a nice selection of fresh fruit and veggies.  Restaurant was clean and well maintained.",
   "Excellent steakhouse. All of our meals were prepared perfectly. Our son had the fillet and said it was the best steak he has ever eaten. The salad bar was also very nice and fresh. Definitely recommend.",
   "Stopped in for an early lunch during a cold weekday. Being early, plenty of seating was available. I had a booth in the bar. Service was attentive and food (ordered from the lunch menu) was available fast. Rolls with cinnamon butter were great! The food (country fried steak with mashed potatoes) was exactly what I expected from a roadhouse. Only complaint is several people entered the bar directly from an exterior door, so my seating location was often met with a rush of cold air.",
   "We were immediately seated.. Our server was very friendly. We waited maybe about 15 min on our food which was great in service time and the product was awesome. I honestly have nothing bad to say about our visit."
  ]
 },
 {
  "name": "Ginza",
  "address": "111 Westridge Drive, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3f090b6e-9330-11ea-8d26-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12976021285553014771",
  "source": "GoogleMaps",
  "reviews": [
   "Stayed in the hotel next door while on vacation last summer. Our son ordered take out just about every night for dinner from here. The food was fantastic. My wife and I just didn't want it EVERY night. He did, and LOVED it.",
   "So tasty. The chefs make the Hibachi Grill a super fun experience for the family! Private rooms are perfect for large groups and the waitresses know the menu like the back of their hand. Great service!",
   "It's not bad. Clean, food was prompt. In honesty, the service could have used a little polish. We were rushed through the meal and out the door.",
   "Place is 5 star for Frankfort!!!  Been here twice now and the boat both times, quality is very consistent, nice servers and just can't beat the price... Highly recommend",
   "Amazing food. Fast service and friendly faces. What more could you ask for?"
  ]
 },
 {
  "name": "Thai Smile",
  "address": "1193 US-127, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3f5a38d4-9330-11ea-98a0-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3884601373344817829",
  "source": "GoogleMaps",
  "reviews": [
   "Had the take out. Sweet and sour chicken with fried rice.\nAbsolutely delicious!!!! Generous potion. Service was fast.\nWill be back soon. Great place to eat.",
   "Service was outstanding. Food was delicious, well presented, and reminded me of Thai food home cooking. Inside of the restaurant was clean, but a little dated. Menu was good, beer selection was very limited.",
   "Tried to call in an order and get an uber to pickup.  Pat was rude from the get go.  He was extremely impatient as I was asking for pad thai and wanted something else.  I apologized that I was not entirely prepared but had attempted to look at the menu online several times (in fact, even closed and reopened it and it's still just spinning an orange bulb).  I took the uber there to order in person (look at a menu).  He confronted me immediately asking if I was the person who called saying the website with the menu was down, I said yes.  He proceeded to tell me I was wrong and it was up and then pulled out his laptop to prove it to me.  I asked him not to argue with me at this point (I had checked multiple times and it wasn't).  I said I would just like to order.  Of which I then did.  I was given a ticket name \"BOSS LADY\" see the photo.  No spoon for my soup, no soy sauce had to ask for both.  Got back to my hotel and the soup was so clear, it really needed the soy sauce.  The pad thai, no sauce at all, no shaved carrots, not bean sprouts, not green onion.  Rice noodles, chicken and chopped peanuts.  Won't be going back there again.  Enjoy the attitude and fine cuisine.  Gross",
   "Red chicken curry was great.  Wife had paid thai- very good and a generous portion with lots of chicken.  Service was fast even though it was a busy Saturday night.  Constant stream of takeout customers too.  Can't wait to go back",
   "Please stop being so rude and yelling at your customers. It's not how you run a successful business. It's not their fault that they have not been there before and do not know your menu enough to make a decision within a minute of being there. Give them time to look it over. I have been here twice and had a bad experience both times. I heard the owner several times yelling at customers and making a scene in the restaurant. Yelling for things that is clearly not the customers fault, but in the mind of management, thinks he's always right. I do not want to give my business or money to someone who does that. It is embarrassing for the customer and looks terrible on him. I will not be returning."
  ]
 },
 {
  "name": "Buddy's Pizza",
  "address": "212 W Broadway St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3f9e6de8-9330-11ea-8b75-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "unique",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=10094152305601894029",
  "source": "GoogleMaps",
  "reviews": [
   "Great service. We split a 12 inch with sausage peppers and black olives. Plus a Greek Salad and a iced glass with draft beer only 3 bucks for that. We sat in the stepped up window seat for street viewing of the main street. Rustic and steep back in time. Lots of walk ins for the 22 inch take home.",
   "The Frankfort Flop! All in all a great little pizza place to grab a quick slice while downtown or just in the area. The pizza takes a unique spin on NY Style while adding their own originality to it. The crust is flavorful, the cheese is fantastic (although a little greasy which you can expect when using FRESH mozzarella), and the sauce has a great balance to it as well. Check Buddy’s out, your tastebuds will thank you for it!",
   "This is a great pizza shop! It's indie decor and simple layout remind me of a coffee house feel from my college days. Hand written chalkboard menu offers a great variety of food choices. \n\nA touch of oregano, combined with a unique style of sausage offered a great surprise for your taste buds. The sausage was not your run of the mill store bought meat. This was very tasty without any extra spice.\n\nBe sure to stop in when you can.",
   "This is a hidden gem of Frankfort. There really aren’t enough folks in Frankfort that frequent this place! Their pizza is simply the best! I wish there were free refills and better (any) table service but I willingly sacrifice this for the pizza. Go here and go often and get the big bear. You can thank me later.",
   "Fresh ingredients make for a fantastic dining experience! The pizza was perfection right out of the oven. I also enjoyed the Greek salad. Nice portions. Very laid back atmosphere. Friendly staff. I definitely plan to return."
  ]
 },
 {
  "name": "Casa Fiesta",
  "address": "801 Louisville Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3fe9f606-9330-11ea-ac7e-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food",
   "knowledgeable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3499067147216970509",
  "source": "GoogleMaps",
  "reviews": [
   "So I tried this place a few months ago and was not impressed.  But yesterday I gave it another chance.  Glad I did.  We split a grand fajitas.  Way more than just two can eat.  Very delicious. Had a great Mexican food taste.  Surprisingly the food was still very hot when we got drive thru take out.   Will visit again.  Looking forward to when you can reopen the dinning room.",
   "The food here was good and I had a very tasty burrito. The staff were also very friendly. my 5-year-old does not really like Mexican food, so he tried the chicken tenders and french fries. 2 hour surprise, they were some of the best I have ever had. The restaurant also has some very nice decor.",
   "Excellent! Ready quickly. Friendly service. Wonderfully yummy❤️!",
   "Absolutely the best Mexican food in Frankfort hands down. Apparently this building used to be a McDonald's so the booths are very small and not good for taller people! They have a good atmosphere and very friendly and knowledgeable staff!",
   "Outstanding traditional Midwest Mexican food. Everything they serve is fresh and prepared well."
  ]
 },
 {
  "name": "LongHorn Steakhouse - Curbside To Go Available",
  "address": "101 Westridge Drive, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/403bbfc0-9330-11ea-bc4e-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "free",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12322404602711003081",
  "source": "GoogleMaps",
  "reviews": [
   "Come hungry. We were full before the entries even hit the table. Between the appetizers, the bread, and the salad, there is so much food I couldn't believe it. Everything was very tasty also, especially the ribs. The prices were a bit high, but at least we are getting multiple meals out of it. This is definitely a good place for special occasions.",
   "Very good food! Me and my mom have never ate here before, but it was pretty delicious. We had to wait 10 minutes before getting served but then someone served us and they were so nice! The food was fresh and was served fairly quick. Would consider going back one day. 10/10",
   "Really great service, very good food, staged everything perfectly!",
   "My food came out undercooked but they cooked me another plate and have it to me for free. They said it's their policy. I've sent food back before but that's never happened to me. It was a great experience and great service. Thanks guys",
   "Put to go order in at 5:30 for 6:30 pick-up time. It's currently 7:04. Called and their response was, \"well we are busy\". If this weren't a birthday dinner for a family member I would've already left. After calling several times and waiting (because food was ice cold and one steak was burnt to charcoal) finally talked to Gary Lacy who refunded in full. Very polite gentleman. Turned a terrible experience into a second chance for this location"
  ]
 },
 {
  "name": "Garcia's Mexican Restaurant",
  "address": "105 Brighton Park Blvd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/409048b4-9330-11ea-982d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16295806484099030726",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious, fresh food. Love that they serve veggies with most meals instead of the usual refried beans. Ordered for curbside and added two of their strawberry margaritas to go and they were the bomb! Will definitely be back again.",
   "The food is good, a little pricey. I've been here several times and love the shrimp burrito. But I got a chicken and beef enchilada and the meat had absolutely zero flavor.\n\nI'll keep coming back because I know there are good options on the menu, but if I had got the enchiladas on my first visit I might have dropp d this place.\n\nPresentation is nice, friendly atmosphere, nice bathrooms, nice servers!",
   "I was pleasantly surprised how great everything was. I got the chicken and shrimp fajitas it was awesome.",
   "I have been dining at Garcia's occasionally for almost fifteen years and have never had a bad meal. The servers are attentive without being overly helpful. They have a good variety of options on their menu at reasonable prices. The fish and shrimp tacos remain a personal favorite. The salsa is very tasty without being too spicy. I would recommend a visit if you plan to be in the Frankfort area.",
   "Great non-chain Mexican food. I know people that say they have the best salsa in town; Taco Loco is a favorite entree."
  ]
 },
 {
  "name": "Gibby's",
  "address": "204 W Broadway St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/40e0649c-9330-11ea-87e3-14b31f159f22.png",
  "tags": [
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6576553033919894489",
  "source": "GoogleMaps",
  "reviews": [
   "Downtown staple for a long time. Great burger, great atmosphere. Reputation for great service but our experience was just a little off. Not bad, I think they were just a little understaffed. Prices good. Count on a good meal here!",
   "Gibby's is always good! It is my favorite local restaurant. The service is always friendly and attentive. The food is simple and delicious. The prices are reasonable. The atmosphere is Kentucky proud which is appropriate for a restaurant just feet away from the old state capital.",
   "Stopped in for lunch while on a trip to Frankfort. Our meals were great and the prices were decent. Nice choice for a quick meal.",
   "Great place for a sandwich or salads. Huge selection of choices. Friendly staff.  With counter service. A daily special. After four changes to a set down menu restaurant with a happy hour.",
   "We were greeted at the door by a smiling and cheerful waiter who explained that you order at the counter. We tried the steak sandwich, fries, potato skins, steamed vegetables, Cheeseburger, Fettuccine Alfredo, The Reuben sandwich special. Restaurant was clean, bathrooms included friendly staff. If you want one of the fresh salad options late afternoon will leave you wanting so come early."
  ]
 },
 {
  "name": "DaVinci's Pizza",
  "address": "805 Louisville Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/412499c0-9330-11ea-ba79-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7775636849376423160",
  "source": "GoogleMaps",
  "reviews": [
   "I love a good pizza and DaVinci's Pizza gives exactly that.  It's a small restaurant but I wouldn't call it a hole in the wall because it's actually really nice inside.  It's not that dirty dumpy style pizzeria you would think of out of small places.  It's clean and smells good.  They have a good draft beer selection and the food speaks for itself.  Seriously.  Read that again.  The food speaks for itself.  We tried the Garlic knots and made our own pepper pizza with all the different types of peppers available.  The crust is from a fresh dough, the sauce is perfect and not too acidic.  The cheese is one of few times you'll get a good cheese pull and the flavor of everything together is nothing short of a flavor explosion in your mouth.  I hope they expand soon!",
   "The best pizza I have had in forever.  We tried the Masterpiece.   Perfect description of this pizza.  Everything thing was so fresh.  You have won me over. I have now found my favorite pizza restaurant.  Can't wait until you can open your doors and we can eat in.   I put my email address on the bottom of my receipt, hope to hear from you.",
   "I'll preface this by saying that I visited when we were about a month into the quarantine time, so normal life business might be different. My fiance ordered from here through a delivery service, and he said it was delicious but slow. Thinking it might have been the fault of the delivery service, we decided to try doing a pick up order. We called, ordered, and were told it would be 30 minutes. That was fine by us. We arrived at the store after 30 minutes had passed. The sign on the door said to call and get in line, so we got in line and called to tell them that we had arrived to pick up the pizza we had ordered. The girl on the phone seemed really confused, and after a few minutes said that someone would come out to give us the pizza. We took that to mean get out of the line and wait in front of the door. After another 10 minutes of sitting in front of the store, I went to the door and waved. A server brought a pizza to the door, but when he opened the door, all he had to say was that he was looking for Nancy and that he would have to help me later. I returned to my car, and we waited another 20 minutes while watching the server bring pizza to other cars sitting in front of the store. At this point, we had waited an hour for pizza that was supposed to be ready in 30 minutes, and we had no idea if we were waiting in the right spot or not. We ended up leaving. An hour and a half after we placed the order, I received a text from a number that wasn't the store number saying that our pizza was ready.  Maybe it's just that they haven't figured out their curbside system or that they were unusually busy, but I wouldn't have minded waiting if the store had simply communicated with us about the wait time or where to wait.",
   "DaVinci's is a bit of a splurge for us, but definitely worth it!  It has has quickly became my favorite pizza place by far.  We've gone multiple times and have not been disappointed yet.  Good crust, good sauce, good toppings - just really, really good pizza.",
   "Pleasant local business, decent pizza, comfortable and usually great service.  Specials are up on a chalk board in the corner, so those of us with glasses have trouble seeing.  Owner seems nice and responsive to the community."
  ]
 },
 {
  "name": "Miguel's Restaurante - U.S. & Mexico's Best",
  "address": "1530 Versailles Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/416377b8-9330-11ea-99cf-14b31f159f22.png",
  "tags": [
   "tasting",
   "family",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7480002693082521270",
  "source": "GoogleMaps",
  "reviews": [
   "The margarita here is probably the worst tasting margarita I've ever had. The bartender never even gave me a menu so I looked it up online. She seemed more interested in talking to guy at the bar while ignoring everyone. The tacos were pretty good with plenty of steak on them, 2 stars because of the tacos.",
   "The first salsa they brought out with the chips had no heat whatsoever, and had sugar in it?  Who does that? I asked for a hotter salsa and it was very good. The guacamole isn't really guacamole... it's just mashed avocado. The steak was very tender and had a great flavor, but the dish itself had too much salt in it. Nice atmosphere, friendly and good service.",
   "called in an order for pickup. Waited over 30 minutes in the parking lot before asking someone about my order. He said if we haven't brought it out, it's not ready. Rude little guy. I left and went elsewhere. Trying support local businesses during the pandemic, but I won't support this place ever again.",
   "Food was good...but service was terrible.  We got a la carte chimichanga ... 2 ea...she charged us a fortune...our bill for 2 was $40.  Instead she could have charged the meals for half the price.  She was rude as well and didn't refill or check on us at all.  We always eat here with our huge family and get treated much better.  I will not eat here again unless with big family.",
   "My first time at this restaurant and I was quite disappointed. The salsa had a bean after taste with little flavor which I don't like. The beans were bland and can tell from a can. The rice had no flavor and was mushy. Food here very bland and over priced. The service was ok but they could be more helpful and friendly. Over all it was ok but I won't be back that's for sure."
  ]
 },
 {
  "name": "TT's Tacos & Tortas",
  "address": "172 Versailles Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/41a49f8a-9330-11ea-87bc-14b31f159f22.png",
  "tags": [
   "food",
   "organized",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1856317774162212667",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent food! I came here for the first time the other day and I’m back almost immediately! Get the fries in addition to the tacos. You won’t be disappointed!",
   "We didn't know how this experience would end, because we expected something else when we walked in. However, the food was good and well prepared with fresh ingredients.\nThe atmosphere might not be for everyone, but everything is clean and organized.\nStaff was friendly and helped with the choices.",
   "The food here is fantastic. If you’re looking for good food to pickup on the way home from work, look no further than TT’s.",
   "Finally found a decent Mexican style cuisine restaurant since I moved here. Torta's are really good. Their salsas are not playing either really got a kick but are delicious as well. Definitely going back again",
   "I only had a couple of tacos here, but they were pretty darn great. Cheese covered fries are good, too. Some of the other food that I saw I was eating with my eyes. I would love to go back very soon. Very tasty food, indeed."
  ]
 },
 {
  "name": "La Fiesta Grande Restaurant",
  "address": "314 Versailles Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/41ebbae2-9330-11ea-b794-14b31f159f22.png",
  "tags": [
   "tasting",
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4782586543580869527",
  "source": "GoogleMaps",
  "reviews": [
   "Had the best tasting Mexican food I've ever tasted here! Look forward to eating here again!",
   "Best food I've had in a long time. It was served hot and fast. Great service.",
   "Great food, friendly people... you can get the small cups of cheese for a dollar I always  get 2 and pour it over everything  steak fajitas,  and chicken chimichangas are my 2 favorite. They give bigger portions than any place in town. It got warm in the place a few times but I'm sure he will have it fixed buy next summer",
   "Excellent food and great service.",
   "Amazing place! Food is awesome and the staff are, too :) The atmosphere is also great! ❤️"
  ]
 },
 {
  "name": "China Wok",
  "address": "111 Eastwood Shopping Center, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4238065e-9330-11ea-93d0-14b31f159f22.png",
  "tags": [
   "drink",
   "tasting",
   "eat",
   "food",
   "food",
   "delicious",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1891197209113978774",
  "source": "GoogleMaps",
  "reviews": [
   "China Wok has the absolute freshest and best tasting Cantonese cuisine. We’ve eaten there for years and have never gotten a bad meal. The staff is wonderful and remembers what we like to eat and drink. Best food in town!",
   "The food is good but the price is high. This also does not look like egg drop soup.",
   "Traveled all over & China Wok has the best Chinese food and best service anywhere. We always get great delicious fresh cooked food fast and hot. Whenever I'm n town visiting I cannot leave until I've had my tummy filled with China wok",
   "One star only because I had to pick at least one to post. My husband and I eat here frequently. Last night we ordered China Wok rice and egg rolls and it was so salty and greasy...not the way it usually tastes. Tonight we ordered chicken cashew din and sesame chicken. No sesame seeds and completely wrong sauce. It tasted more like Gen Tso. No cashews in the cashew din. Called and talked to owner who offered to remake it if we brought it back to them tonight which we did even though we don't live close. She then said we did have the correct order but that they forgot the sesame seeds and cashews. Did not hold up her offer to remake it nor offer our money back. My husband had to ask for some cashews on the side. We get back home and are not satisfied. Called and talked to her again. She pretty much said my husband was lying about not having sesame seeds and the wrong dish. He just had sesame chicken a few days ago and this was NOT the same dish.  She apologized but still no offer to refund our money or comp a future dinner. This is not how to treat customers esp when they patronize your establishment often. Completely unacceptable and particularly offensive when we give you our business during the current pandemic.  Dinner was trashed, and we will not be going back.",
   "Food arrives hot on an overflowing plate. The taste is mouth watering good, and the staff are very pleasant natured. Also, the establishment was clean and appeared well maintained while I was present."
  ]
 },
 {
  "name": "Mai Saigon LLC",
  "address": "1100 US 127 South, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/42805a1e-9330-11ea-a488-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8025123438212224634",
  "source": "GoogleMaps",
  "reviews": [
   "Best Pho in Frankfort. The owner is very nice and the prices are reasonable. It's great that they sell Asian beer as well. Overall, it's definitely a great place and I'll be back.",
   "Very good food so many flavors. The service might not be the best but the quality of food is outstanding.  We ordered 3 more meals to go which we never do that. The special pork with egg rolls was great and added that whole container of fish sauce made it even better.  The chicken curry was so tasty nice stong curry flavor the way it should be. My only negative is that this place is not closer to our house. We would be here every day. Love it",
   "Food is fresh and full of flavor!  Highly recommended 😍",
   "Mai Saigon Vietnamese Restaurant. First thing we noticed was a faint smell of cigarettes or something cooking that smelled like cigarettes. No one in the restaurant was smoking. Over priced for what you receive in my opinion. Bowls or fried rice from 9.50 and 11.50. The fish sauce for the bowls was delicious, with just the right amount of spice. Bowls have noodles, meat, nuts, and lettuce with thin egg rolls. So the bad. In 10 minutes of leaving restaurant I became very sick with with an upset stomach, you can use your imagination, but it was bad. One other that had a bowl became sick. Others were ok, that had fried rice. So I will give a three and assume the food just did not agree with my stomach.",
   "This is a cozy spot for lunch or dinner (or takeout)! I love all their phos - the beef is now my favorite, but whenever I'm not feeling great I love to get their spicy Korean chicken soup. The owners are very friendly and accommodating. One of my two favorite restaurants in Frankfort."
  ]
 },
 {
  "name": "Cracker Barrel Old Country Store",
  "address": "161 Bizzack Blvd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/42e9a390-9330-11ea-b869-14b31f159f22.png",
  "tags": [
   "delicious",
   "kids",
   "food",
   "eat",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=13881937307700600958",
  "source": "GoogleMaps",
  "reviews": [
   "Breakfast, Lunch, or Dinner is always a good meal at Cracker Barrel. Love the comfortable atmosphere, the spacious tables, and the cute items they have for sale in the retail shop.  The staff is friendly and efficient and always keeps your coffee cup filled. Thanks for another great experience!",
   "All the food was fresh, hot and delicious. My 3 kids (ages 10, 8, and 3) were being indecisive and unruly. The staff was very understanding and patient with us. This was by far one of my best experiences at ANY restaurant. Thanks Cracker Barrel!!!",
   "I've been here on several occasions but decided to dine here on Sunday after church. Big mistake. It was super busy and the service was meh.  Didn't get my biscuits or cornbread which was supposed to come with my roast beef meal.  Server just brought the check without asking if we wanted anything else.  Now I understand when it's busy you try to move your diners out so you can seat the next ones but the customers next to us had already finished their meal when we were seated and didn't order anything else, they were just sitting and talking which is fine. Ordered dessert.  Came with the smallest scoop of ice cream on the planet.  Is rather eat at Denny's or Waffle House.",
   "The wife & I both had the Grandma's Breakfast. It was great! Also had the Berry flavored tea. Limited time only.  Loved it.",
   "Cracker Barrel is an oldies but goody. No matter which one you go to, your meal is going to be good. I especially love the roast beef dinner, chicken and dumplings, lima beans, all the breakfast plates, oh in the fall they have those dinners where they wrap beef or chicken in aluminum foil whichever meat you want and add potatoes, carrots and celery and cook on a grill. They are delicious."
  ]
 },
 {
  "name": "Pizza Inn Buffet",
  "address": "100 Brighton Park Blvd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4331d050-9330-11ea-afca-14b31f159f22.png",
  "tags": [
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13503482951153755567",
  "source": "GoogleMaps",
  "reviews": [
   "Pizza Inn was a cozy place with a large buffet of salad fixings , pastas , pizzas and dessert pizzas . The staff was very friendly. They had TV' s to watch and a small game room with more vending machines than games . Overall , it was a good place to eat and enjoy the TV's .",
   "The food was really good, especially the dessert pizza. They have one with brown sugar and cinnamon. It is my favorite.",
   "The pizza all tastes really good, full salad bar, always has 6 or 7 different types of pizzas instead of the 2 or 3 you typically get at some buffets. They are ways pumping out hot pizza so you are never waiting on the pizza you want.  They also have several dessert pizza options....I stop by this place everytime I'm driving through frankfort!",
   "Get atmosphere. Super friendly staff. Good WiFi. Excellent selection.",
   "Very expansive salad bar; beets, broccoli, cucumbers, you name it.   I get veggie pizzas and they taste good."
  ]
 },
 {
  "name": "Kentucky Coffeetree Cafe",
  "address": "235 W Broadway St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4377b334-9330-11ea-ad64-14b31f159f22.png",
  "tags": [
   "delicious",
   "historic",
   "drink",
   "music"
  ],
  "link": "https://maps.google.com/?cid=14639875212735498309",
  "source": "GoogleMaps",
  "reviews": [
   "Great atmosphere lovely staff , delicious pastries and coffee. One of the very few places that's open Sunday evening. When we get there the lady was working alone,  she had to take orders, make foods and drinks serve and clean up. It was a big line but she handled it great. Highly recommended",
   "Quaint , skinny , historic building.  Friendly people and a laid back atmosphere. Had live musicians there playing guitars and singing oldies but goodies.  A comfortable place to unwind .",
   "I loved the welcoming atmosphere. The sandwich I ordered was well prepared and reasonable. I loved the closeness of the performers which made us all feel we were being entertained in our own living room. Mary and the staff were so friendly and accommodating. I will definitely return.",
   "One of my favorite places to hang out in Downtown Frankfort. Great coffee and great пива. Weather one one sitting out on the street with friend or huddled with a hot coffee and book, this is the place to be in Frankfort. Today I enjoyed great live music while I had a wonderful dinner and cold drink. Hats off.",
   "It's an amazing place, but the reason I gave a 4 stars rating is because the tables are wabbled. It was hard to study with my friend because of it. Other than that the place is pretty great. Yes service, atmosphere, and snacks are all to be enjoyed"
  ]
 },
 {
  "name": "Staxx BBQ",
  "address": "11 Carson Place, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/43bf1d18-9330-11ea-be31-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "music",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15964723289446752366",
  "source": "GoogleMaps",
  "reviews": [
   "The food was delicious. My order was ready fast and the staff were friendly. Great atmosphere and awesome customer service. I ordered potato salad, green beans, chicken and corn bread I was pleased with everything. The food was hot and the sauce with my chicken was great. I'll definitely be back when I visit Frankfort again.",
   "Named after stax music in\n Memphis Tennessee\nTried the dinner for two pulled pork and brisket which was okay there's better also had pint sized potato salad and pint-size beans  19.",
   "Chicken and brisket were both dry. Mac & cheese tasted more like buttered macaroni with a lot of pepper. Best thing about our meal is that we got 2 cups for drinks when my husband and I were splitting the meal. Save yourself the time and just go to a McDonald’s",
   "Family of 5 adults and one kid ordered the Staxx big meal. You get a lot of food for less than $40. We stopped by on our way east and really enjoyed the food and it was a great value.",
   "Pulled pork and \nPulled chicken were great the slaw was also good.\nThe mac n cheese and the green beans needed help. But over all. A great meal. The service was great too. We will be back."
  ]
 },
 {
  "name": "Riverboat Grill",
  "address": "101 Riverboat Landing, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/44096cd2-9330-11ea-846d-14b31f159f22.png",
  "tags": [
   "food",
   "cheap",
   "library",
   "food",
   "walk",
   "music",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18047019467689495495",
  "source": "GoogleMaps",
  "reviews": [
   "Food done right at very reasonable prices. And the location is excellent! The owners and staff are very friendly and helpful. After we found this place for lunch one day, we went back the very next day for lunch again. It's that good. I would highly recommend it.",
   "Really good food, cheap, nice atmosphere too. I parked behind the library. The ramp down to the dock is really steep and the rails are wobbly. Banana peppers and fried mushrooms are both good pics. They don’t have fountain drinks, the come in cans/bottles.",
   "Good music on the river.. bottle drinks. Was a bit hot .nice scenery of bridge and unusual school building. Walk 20 or so steps",
   "Great food, great atmosphere, friendly and polite staff who checked in constantly. Watching boats on the river was enjoyable and had plenty of seating. First time stopping here during a long road trip and highly recommend.",
   "We had a good evening listening to Phat Mattress and enjoying the food.  The service was good.  The fish and chips and onion rings were good.  We sat along the side of the restaurant and every time someone stepped onto our platform from another platform it rocked us pretty good.  Overall a very good time."
  ]
 },
 {
  "name": "Cliffside Diner",
  "address": "175 Old Lawrenceburg Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4464ac5a-9330-11ea-aa5a-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=13252819040049548786",
  "source": "GoogleMaps",
  "reviews": [
   "Great service! Burger was great. Parking is a little dangerous so be careful. Change the fries to skinny ones and this place would be a 5 star.",
   "I would highly recommend this place for breakfast or lunch! It's hard to find places like this anymore . I will definitely be back 💯",
   "Comfortable, home town feel with some of the sweetest and swiftest staff I've ever seen! Their business has me rethinking the standard of quality I expect- they absolutely knocked it out of the park in terms of the food and the delivery. I left a $10 tip on a $9 meal because they were THAT good!",
   "The food was great, the service fast and friendly, and I love the quaintness of the restaurant. This place is definitely a hidden gem.\nIf you like a good diner, you needn't look any further.",
   "The staff made my wife and I feel like family! We enjoyed a fantastic meal that was on the table in minutes. At the end of the meal they offered to fill up travel cups.\nDo your family a favor and Go Try this place!!!"
  ]
 },
 {
  "name": "Cook Out",
  "address": "1234 US-127, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/44ab0474-9330-11ea-b383-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "kids",
   "food",
   "music",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7288456516959816375",
  "source": "GoogleMaps",
  "reviews": [
   "Food is definitely worth the money spent and great service. Highly recommend going inside to eat.",
   "Their burgers are the best! They actually taste like they came off a backyard grill! Cant beat the price either; you can get 2 big doubles with cheese and everything and an order of fries for ",
   "Food tastes like a backyard grill, so that is a plus. Very reasonable prices. I like the ambiance as well. Decor is rustic and nostalgic of Eastern Kentucky. The only thing I will say as a fair warning. They play constant loud religious music throughout. I am not complaining as it does not bother me, but if you are bothered by that, just be aware.\n\nMy only complaint is there is rarely a clean place to sit. Even so, the kids and the fam really love eating here. We will be back.",
   "Love love love this place!!! Great food and great prices and the peach cobbler milkshake is amazing",
   "I was so stoked to see this in my way to get other fast food. It wasn't suggested on Google maps when I searched for fast food for some reason. I love cookout, please come to Louisville!"
  ]
 },
 {
  "name": "Arandas Mexican Restaurant",
  "address": "193 Versailles Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/44f1f8b6-9330-11ea-b7cf-14b31f159f22.png",
  "tags": [
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=4354723828880285998",
  "source": "GoogleMaps",
  "reviews": [
   "I have been a long time customer for years. The last three times I ordered, my order has been wrong. You know how you get a taste for something and then it’s not what you ordered? That feeling that’s how I felt. I gave them a third try because it’s the quarantine and why not help small businesses and I know they are busy. I called and the owner himself answered. I told him what I ordered ($25 worth). I asked for a replacement because the last three times it has been wrong. He told me all I could get was a small cheese dip and that they weren’t perfect. In a matter of 3 weeks I’ve probably spent $75 there. And all I want is my order replaced and he couldn’t even do that? I will NOT go back. Why be loyal to a restaurant that can’t respect the loyal customers?",
   "Best Mexican restaurant in town. Food is always good, and service is Excellent.",
   "It's a regular place for my uncle and to eat at. Their steak burrito is very good. Highly recommend it.",
   "A great use of space.  It's really beautiful inside..  thank you to who ever did the work .",
   "I had heard so much about this Mexican Restaurant that I had to try it. Was not impressed. I will give it one more try, as I always give a place 2 chances."
  ]
 },
 {
  "name": "Mi Fiesta",
  "address": "334 St Clair St #1875, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4547e118-9330-11ea-8abd-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5672209288248166916",
  "source": "GoogleMaps",
  "reviews": [
   "Can I leave more than five stars? On our passing through this town this was one of the only places open on a holiday but we are glad we stopped in. We all had tacos and they were super on point. What makes this place stand out more than anything else is the customer service. Everyone was so kind and appreciative that we were there. I actually even left my sunglasses there and when I returned they had kept them and I think even cleaned them. They were so friendly there, keep up the good work!",
   "We love going there every time we want Mexican food.  Juan and Robin are our favorite.  They are truly like family.  Ishmael is great.  They always come up to us and say hi and make us feel welcome.  I’m glad to see that they stay busy.  Food is great!  I love the Jamaican Pollo or the fish tacos.",
   "By far the best Mexican food in Frankfort. Delicious food and outstanding service!",
   "Waiter attentive, chicken soup good, chips & salsa average.  Good location and from it, able to see the Christmas Parade floats go by.  Very close to The Grand Theater, which was my next stop.",
   "Great food!! Love this place! Friendly staff"
  ]
 },
 {
  "name": "Mami Monchitas",
  "address": "610 Ridgeview Dr, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/458f98a4-9330-11ea-8bd5-14b31f159f22.png",
  "tags": [
   "family",
   "eat",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7113269042884523705",
  "source": "GoogleMaps",
  "reviews": [
   "Love the Chicken Baleadas, even though I can only eat part of one and take the rest home. \nMy husband had the Mami Monchitas Family Sampler and loved it. Had to Yale part of his home as well. \nThe Mango Margarita’s are amazing!",
   "The menu is outstanding (authentic, as best I can tell).  The food is outstanding. The service is outstanding.  That's all  that needs to be said. Highly recommend this restaurant.",
   "The food was delicious! It was my first visit and our host was very welcoming and shared lots of information about the food. Definitely going back. Margarita was delicious too!!!",
   "Let me start by saying that if you have not been here and you are debating this place among any other, you absolutely have to go here. \n\nThe food is absolutely phenomenal. The service was impeccable. The margaritas were delicious. This place is easy to find, but off the beaten path. I'm willing to bet everything on the menu is delectable.\n\n12/10 must try.",
   "This place is awesome really good food and service. Will be eating there again."
  ]
 },
 {
  "name": "Chicken Koup 599 E. Main st Frankfort, Ky 40601",
  "address": "599 E Main St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/45dc322e-9330-11ea-af98-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1416872722080616408",
  "source": "GoogleMaps",
  "reviews": [
   "Some damn good chicken, yes that good. Perfectly cooked, good size wings (both traditional and boneless) plenty of flavor from the sauces. Will for sure return for more delicious chicken wings",
   "I had their traditional Buffalo wings and I thought they were going to be breaded but mine weren't and the perfect amount of heat. My husband got the sweet chili and they were way better than Asian zing at Bdubs. Got a sample of the corn nuggets and they were amazing. Excited that Frankfort has a great place for our wings.",
   "Wing only joint; I was hoping they'd have some chicken tenders but they do offer boneless wings!  You can get them tossed in sauce or on the side. We ordered Garlic Parmesan and BBQ.  We got our wings tossed in sauce.  The chicken was juicy, the wings weren't hard, and they had the perfect coating of sauce. Ranch sauce tasted homemade - we'll definitely be back!\n\nAnd for the germaphobes, inside was clean. The cashier handled money but not the food. The cook wore gloves and she didn't touch cash/her face.",
   "Really good chicken with a nice variety of flavors and styles. Cooked to order, but certainly worth the wait!",
   "I had my first experience with the Chicken Koup today and left very satisfied. Currently, the Chicken Koup is best suited for online, mobile, and drive-thru orders, however I ate inside. There were only two seats at a bar, but that was perfect for my friend and I. We ordered onion rings, corn nuggets, a small order of boneless wings (8 count) and a small order of traditional wings (5 count). The boneless wings were great--no gristle or fatty parts. They were well-sized. The traditional wings are marinated or brined in seasonings for 24 hours, and you could tell. We tried the Koup Sauce (a Mayo based, tomato-like, special sauce), the Teriyaki sauce, the Sweetyaki sauce (a combo of Sweet Chili & Teriyaki), and the hot sauce (which I found most compatible to Louisiana brand hot sauce). All were great. Next time, I think I'll try the lemon pepper rub.\n\nService was excellent. The two ladies working inside were very helpful with the menu. All of our food was cooked fresh. I noticed their Health Inspection Score posted on the wall was 100. I work in Downtown Frankfort and had no trouble getting in and out on a one hour lunch break. If I were with more than just one other person, I would recommend ordering online and picking up inside or drive thru just to save yourself time. This is a new establishment, and I hope the East Frankfort/KSU community continue to show them some love."
  ]
 },
 {
  "name": "Trifecta BBQ",
  "address": "328 St Clair St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/461dcf58-9330-11ea-b991-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11265915622973568084",
  "source": "GoogleMaps",
  "reviews": [
   "delicious sauce! very good smoked sausage and pulled chicken! got food very quickly, hot and delicious! thanks!",
   "Good food. Good atmosphere. The folks that run it are super friendly.",
   "Food was good. Very friendly service. \"Turkey Ribs\" are worth a try. Loved the greens!",
   "Absolutely phenomenal BBQ!  Moist, tender brisket.  Fall off the bone ribs, great sides!  Try the Mac and cheese!  Can't recommend highly enough!",
   "Food was full of flavor, juicy, and well done."
  ]
 },
 {
  "name": "Rick's White Light Cajun Diner",
  "address": "114 Bridge St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/46742cee-9330-11ea-b3f8-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "delicious",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16123222407805350310",
  "source": "GoogleMaps",
  "reviews": [
   "It's been 6 years and I still think of this place often. The best food and attitude. One day I was having so much fun I went for lunch, and hung out until it was time to eat dinner. Great home made bread and the hot sauce will blow you up! Worth a visit!",
   "Super tiny, quaint, authentic diner. The whole place smells fantastic. Food was too top, ate it before I thought to get a picture. Fair warning, the food can be spicy. If you're brave or confident you can handle the heat, you won't be disappointed.",
   "Eclectic decor and vibe and great food! Rick uses food sourced from the USA only and of best quality. Also cooks several delicious Cajun dishes. If you want really tasty food and great atmosphere you should go! Open Tue -Sat 7 to 3",
   "Wow!  Truly an amazing menu.  Don't let the outside appearance fool you, once inside you'll fall in love!  This is a GREAT place to eat.  Highly recommended.",
   "Surprisingly great food in a surprisingly great city... and they sell Little Kings!  White Light Burger & Beignets pictured"
  ]
 },
 {
  "name": "Sage Garden Cafe",
  "address": "3690 East-West Connector, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/46c3fad2-9330-11ea-be3d-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14074039831726373666",
  "source": "GoogleMaps",
  "reviews": [
   "Adore this little place.  Great lunch place.  Specials are wonderful, friendly staff and it's cute ambiance!  Highly recommend.  Wonderful garden store next door.  I went here all the time with my friend who lived in the area.",
   "This is a very unique place to grab lunch. Really enjoy eating outside & being surrounded by nice plants. However, the past 3 times I’ve come here the service has been very slow & the food is overpriced for what you get. Not gross food but just kinda plain...",
   "Really the only place in Frankfort with healthy, green food options. I wish the Vegan and Vegetarian options were more diverse , but either way the food is awesome!! Please add more Vegan recipes to the menu. Love this place. And bring back breakfast.....",
   "The food was great....service lacked....waiter was great...not enough help....coffee cold",
   "Delicious and fresh food. Nice atmosphere. Parking is not ideal. Somewhat on the pricey side. Overall,  highly recommended."
  ]
 },
 {
  "name": "Chili's Grill & Bar",
  "address": "345 Leonardwood Dr, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4713055a-9330-11ea-86cd-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8116245879371641790",
  "source": "GoogleMaps",
  "reviews": [
   "My daughter and I stopped in for lunch. The restaurant is easy to see and access and there was plenty of parking. Our service was quick and our server was very attentive to our table. Many options on the menu to choose from. My daughter had the cajun pasta with shrimp and I had shrimp tacos. Both dishes were very good. This is a nice place for a quick and casual lunch or dinner.",
   "Shared an appetizer of Chicken & Bacon Quesadillas, Chips & Salsa and Mom had a cup of Loaded Potato Soup. Service was exceptional and food was absolutely delicious.",
   "I’m on the road a lot and use chili’s as my go-to restaurant so I’ve been to many different locations in different states and this one just didn’t meet the bar. When I walked in they didn’t have anyone seating people which happens but someone is always eventually on it, so I stood at the podium and waited for someone to come over but no one ever did. After several minutes of standing there not sure what the deal was and making eye contact with multiple servers who didn’t say anything, I continued to wait and look around while being completely ignored (there was no rush, the building was less than half full, and one waitress was actually sitting at a table hanging out with friends it appeared she was serving). Eventually I walked to the back and caught a server and asked if it was seat yourself even though there was no sign and none of the other chili’s I’ve been to are like that and a waitress answered “yea” without looking at me. Luckily the server I got was a very nice man who earned these two stars on his own but when the food came it just wasn’t good - and it’s a dish I’ve had before and really liked. It was disappointing for a chili’s experience.",
   "Very  poor  service.  If you  was  known  by them than  you  were  great.  We wasn't  and the waitress wouldn't  even  look  are way. Was sitting  with  people  she  new. The bartender  was  so busy  I appreciate  him checking  on  us. We really  should  have  left.  Won't  go back. Food was also  cold.",
   "Chili's offers a menu for most tastes including limited vegetarian. The prices are reasonable and it has daily specials. The wait staff is courteous and attentive. I have found a turnover in staff but perhaps that's indicative of the industry. This restaurant is clean despite being understaffed at times."
  ]
 },
 {
  "name": "Two Sisters Cafe",
  "address": "1410 Versailles Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/47571730-9330-11ea-8228-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7064316807049850348",
  "source": "GoogleMaps",
  "reviews": [
   "Capital diner was a nice experience. We will be back. Food was good.",
   "Consistently good food and good service.  Had the chicken salad sandwich.   Chips were still warm from being freshly made.",
   "Name changed to capitol dinner new owners great food and great  friendly service",
   "Really good food at a fair price. Staff is very friendly and helpful if anything on your order isn't correct.  I just wish they were open past 2:00.",
   "Great homemade food and a quick and easy lunch spot! Good deals on the lunch specials for $7.95 comes main dish with 2 sides and cornbread or a roll."
  ]
 },
 {
  "name": "Linney's Pizza",
  "address": "717 E Main St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/47a20328-9330-11ea-b738-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=12261322265543937599",
  "source": "GoogleMaps",
  "reviews": [
   "Do not get the Alfredo! It was disgusting. The sauce had a bitter aftertaste. Most likely it was processed restaurant sauce in a bag. The chicken was cold cubed cuts like what you find on a salad bar. I was disappointed and dissatisfied. Why is it so hard to find good authentic Alfredo around here?",
   "Got the hot browns  magnificent! ",
   "Amazing food and very friendly staff. My fiance had \"the best meatball sub\" he's ever had. We sometimes have troubles getting our three year old to eat all her food but she ate four slices of pizza here. A toddlers review is the most honest review you can get. Good job, guys.",
   "Great family owned pizza, pasta, awesome ham n cheese. Same people serving and preparing. I live 40 minutes away. Meet my best friend once a month for lunch an to catch up. I have never been disappointed. Pizza, amazing ham n cheese on an a garlic bread hoagie, baked spaghetti..... Always my go to in frankfort, I live 30 miles south",
   "I got their pizza and it was fine. Nothing special. Just basic."
  ]
 },
 {
  "name": "Chick-fil-A",
  "address": "1300 US Highway 127 S, Ste F, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/47ec080c-9330-11ea-8630-14b31f159f22.png",
  "tags": [
   "eat",
   "kids",
   "tasting",
   "food",
   "structure",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=220620546064831499",
  "source": "GoogleMaps",
  "reviews": [
   "I work at another location in Texas, but stopped by for something to eat while traveling. Staff was beyond friendly, and good came out quick and hot! Definitely one of the better locations I've been to. The only thing I could improve is to put napkins in the bags, but other than that it was very nice.",
   "We love the friendly staff here and the food is always good. we like that the food is always fresh tasting, and the French fries are never too salty.  arson likes to play structure, but doesn't really like the toys that come with the kids meals. I think that last point is the only thing about this place that isn't perfect.",
   "I wen thru drive thru 3 times to get a Cobb salad made the right way. Omg they never mess up in Louisville.",
   "Always enjoy taking my great grand kids to this place. However, on todays visit I saw adults take food into the children's play area. Not a good time.  None of the staff said anything so I am now re thinking that play area... The food is always good. The staff are usually exceptionally nice.",
   "This is the slowest chic fil a I have ever been too. Parking is crazy too. The order helpers in the drive through were very unprofessional and didnt tell anyone which car to follow. Then they both just disappeared. Total about 20 minutes in line."
  ]
 },
 {
  "name": "My Guadalajara",
  "address": "1232 US-127, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/482ef094-9330-11ea-85d7-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10493704919256533320",
  "source": "GoogleMaps",
  "reviews": [
   "This is our go-to place for Mexican food in Frankfort, mainly due to its proximity to my house. Great top-shelf margaritas!",
   "Outstanding food, waiter Alex was exceptionally polite, very customer friendly.",
   "One of the best places in Frankfort. Great people great food. Best margaritas in Ky.",
   "It doesnt taste like authentic mexican food. Its bland!",
   "Service was VERY slow. My \"med rare\" steak was  beyond well done. I would have complained IF the waitress had came back to check on us or refill our drinks. Do yourself a favor and keep driving."
  ]
 },
 {
  "name": "Fazoli's",
  "address": "365 Leonardwood Dr, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/487d8664-9330-11ea-9042-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1225892582004532564",
  "source": "GoogleMaps",
  "reviews": [
   "Fazoli's in Frankfort was GREAT. The manager, Stephanie was super nice and took good care of my grandson, friend and myself.   Crew member, Raine was very friendly. It has been 10 years since I ate at Fazoli's. I saw the one while in Frankfort and was super excited to go eat there. Job well done you guys!",
   "Stopped by Fazoli's Saturday evening and it was my first time at a Fazoli's (I'm from Maryland and we don't have them). I was pleasantly surprised with the quality of food. Our waitress was super nice and prompt with everything. A+",
   "My wife and I really enjoy Fazolis but we have one basic issue, regardless of which store or location... 99% of every order has little or NO spaghetti sauce (at all - just plain white spaghetti) from the center all the way to the bottom of each dish, regardless of whether it's Baked Spaghetti Parmesan, reg. Spaghetti  etc.\n\nWho expects to eat plain, white, tasteless spaghetti? Otherwise, love the breadsticks!",
   "Visited from out of town and was very impressed. The food was great and the service couldn’t have been better. Eli took my order and was amazing. He greeted me with a smile, was very polite and eager to help. I was impressed with how hard he worked and continued to ensure I didn’t need anything. Awesome job!!",
   "Great food with fast service"
  ]
 },
 {
  "name": "Office Pub & Deli",
  "address": "614 Comanche Trail, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/48cda56c-9330-11ea-9fe1-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11908683056246255050",
  "source": "GoogleMaps",
  "reviews": [
   "Wow are the people here extremely friendly. This is 100% a locals establishment where everybody knows everybody. There's af fully stocked bar with counter service. The food is pretty basic but everyone seemed to be there for the all-you-can-eat catfish Wednesday special. I had the beer cheese to go and the Coney Dog with mac and cheese which was nothing special. I definitely return for the friendly staff and customers.",
   "Meatloaf, sandwiches, burgers and plate meals at a good price.  Nice low key and relaxing place to eat.",
   "A great hidden gem in Frankfort. Funny how many people don't know about this awesome lunch spot!",
   "Great service friendly staff!! Great food not over priced!!",
   "Excellent Food, Service, and Atmosphere\n\nI got the fried banana peppers and \"2 point\" cheeseburger with fries. The food was great, and the waitress (Amy) actually sat down and told me some history about the place. Overall, I had a wonderful experience. Will come again."
  ]
 },
 {
  "name": "QDOBA Mexican Eats",
  "address": "1303, 401 US-127 S Suite, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/49129d34-9330-11ea-9e59-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4620078851370892722",
  "source": "GoogleMaps",
  "reviews": [
   "WOW whoever is the day manager at this location should be retrained in how to speak to his employees and how to actually do the Manager's job. I simply called to get help with a mistake on my order and he wouldn't come to the phone and I could hear his comments to his employee on what needs to be done and believe me it wasn't nicely said. Customer service skills is as important as cleanliness when it comes to having repeat business to a restaurant in my opinion! I do feel bad for his employee's, thank you for reading.....",
   "It took 25 minutes waiting in line before I could even order!  That is not acceptable at all.  Check out the pictures of the empty seating area and long line waiting to order. People are able to eat and leave faster than people can order.  The managers response was \"it is a complicated situation\" whatever that means. My day is now more complicated because of their painfully slow staff.  The food tasted good but not worth the wait.  I will never \"run out quick\" to get lunch from this location.",
   "If you're looking for something quick and good this is the right place. Great food, big portions, quick service.",
   "Food is good and staff is friendly but they forgot the soup part of my loaded tortilla soup.",
   "I stood in line over 20 minutes before I could place my order. Two staff members were very non-efficient with no manager supervision. The only excuse given by the guy running the cash register was, \"its complicated and something happened earlier that was beyond his control\". Hardly anyone sitting in the dining  area eating. Very unacceptable and lame excuse. No apologies given. I will not visit this location again."
  ]
 },
 {
  "name": "Captain D's",
  "address": "615 Versailles Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4968866c-9330-11ea-8f73-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1845237924887177006",
  "source": "GoogleMaps",
  "reviews": [
   "The country style fish was delicious. Huge piece of whitefish. Hot and fried perfect. Clean new restaurant.",
   "This was my first time at this location. we had just moved to Frankfort a few months after this restaurant burnt down, and they finally got it rebuilt. I came in for my first time today, and ordered the fish and chicken platter. The staff was friendly, the food was prepared quickly and correctly, the restaurant was clean and neat, although a little bit crowded. It was a great experience and I'll be back.\nThey also offer discount for military.",
   "They got the order wrong at the drive through. My wife only likes their Chicken and when I got home with the food, both meals were fish dinners. Very disappointing.",
   "Would like it better if the chicken we're dipped in the same batter that is used on their Great fish. Also love the Big Fish Sandwich.",
   "Nice reno to the place. Its actually up to date now and looks more like an upscale hotel!"
  ]
 },
 {
  "name": "Zaxby's Chicken Fingers & Buffalo Wings",
  "address": "1375 Versailles Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/49adf350-9330-11ea-8b32-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2768423747089921903",
  "source": "GoogleMaps",
  "reviews": [
   "Best salads. Place so good you wont believe its fast",
   "Can't believe I just spent $7.99+ tax of my hard earned dollars for a 10pc. boneless wings. So small I can fit the hole order, celery, sauce, and wings in the palm of my hand. Always young careless people there on their phones and joking around with each other as half your order sits there a couple of minutes waiting on the other half. Also you ask for a 2nd sauce to go with the 10pc. and they want to demand an extra 0.25 cents. Sad really what the world has come to. Hail the almighty dollar. I feel like they are behind closed doors saying \"well we got your money anyesy didn't we\". Never again.",
   "Love their salad with cut up chicken, workers are always nice.  Prices are a little high but the food is good and fresh.",
   "Good fresh food, great salads, poor carry-out... called for a small order (8 people)... was told they needed 24 hour noticed... lol... went to Buffalo Wings and they said no problem",
   "Great food with reasonable prices! It's an upper crust fast food joint for sure but you can eat here literally cheaper than Taco Bell.\nFriendly staff, clean place, great atmosphere and fast service. Also they have the best salads for price!! Huge and delicious"
  ]
 },
 {
  "name": "Main Street Diner",
  "address": "227A W Main St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/49fb2952-9330-11ea-a4b1-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4417066619738462046",
  "source": "GoogleMaps",
  "reviews": [
   "Breakfast here is a must try in town. Currently, they are only serving breakfast until 10 am on weekdays, but I have hopes they will extend those hours. Everything we tried was amazing. It is wonderful to see the time and dedication the owners have put into their business. They truly care about having quality ingredients, which translates into quality food.\n\nIt also helps that Megan is as attentive as she is. She brought out extra gravy for our biscuits. If you don't want any of their breakfast entrees, you can order your breakfast just about any way you'd like it, as they have a sizable a la carte menu. \n\nIf you read this far, what are you waiting for? Go check them out.",
   "First time diner:  Ordered the veggie omelette.  Very good and cooked perfectly. The accompanying hash browns were also very good. Food was served quickly and was piping hot. Pleasant staff. A solid choice for breakfast and I presume lunch and dinner as well. I’ll be back.",
   "Road tripping through Frankfort and found this little gem! Nice location in downtown Frankfort. Cute diner with good diner-type fare. To hear Megan talk about her passion for making food is a real treat! I'd definitely go back if I was in Frankfort again.",
   "My wife and I had dinner on their opening night. Both of us ordered the meat loaf special. We both found it outstanding, as were the onion rings and mini salmon patties we ordered as appetizers. This is the same ownership as the Riverboat Grill a couple blocks away. They are open from 7 am to 9 pm seven days a week.",
   "Excellent service. Great food. Megan did a wonderful job. We will be back the shrimp poboy sounds terrific"
  ]
 },
 {
  "name": "Arby's",
  "address": "8 Hudson Hollow Road, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4a39b96c-9330-11ea-ab49-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7556303086684955970",
  "source": "GoogleMaps",
  "reviews": [
   "Love Arby's. They always. Have good coupons and the food is good. I usually get the Roast Beef sandwich with red ranch dressing or the French dip which is my favorite. I also like turnovers.",
   "So... Tiffany took my order. She was super awesome. Loved her attitude!!! \nSandwiches are so goooood. Omgoodness",
   "Very fast service at drive thru! The service worker at the window was attentive and VERY amiable. Got the sauces we asked for.... Not to little, not too many. Just right!\nWould've given 5 but, ordered cherry turnover and got Apple 😝. \nI called and made a complaint. Was told the would make it \"right'. We shall see......",
   "My absolute favorite fast food restaurant!!! Always the best even if sometimes it takes a cpl minutes to get my order. It's worth it though!",
   "The service at this Arby's location is great. I live close and have never had any problems."
  ]
 },
 {
  "name": "Bojangles' Famous Chicken 'n Biscuits",
  "address": "1239 US-127, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4a7cdc5c-9330-11ea-bf7f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9485275627218534953",
  "source": "GoogleMaps",
  "reviews": [
   "Polite cashier. Food standard. Beverage center very dirty.",
   "The fast food fried chicken experience I didn't know I was missing. I just wish I hadn't waited until the end of my recent trip to try it! \n\nLoved their breakfast items as well as their assortment of sauces, sides and the Cajun style option. The staff was very friendly and insisted on making my BoBerry Biscuits in a fresh batch when I told them it was my first time trying them.",
   "Food and beverage was fantastic. Staff very nice and professional. Would recommend this to everyone who is in the area. We were just passing through on the way to a reunion",
   "Friendly service, one of the best biscuits I've ever had. Tenders and potatoes were solid, nothing special. Tea is good. Would go again.",
   "This was my first time eating at Bojangles. I had the bacon, egg, and cheese biscuit combo. Everything was hot, fresh, and tasty. The cashier didn't seem to mind me asking questions about the menu items, and was polite and pleasant. I enjoyed my meal very much, and plan to return for lunch at some point."
  ]
 },
 {
  "name": "Arby's",
  "address": "321 Versailles Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4ac1399e-9330-11ea-8650-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11371727923518547376",
  "source": "GoogleMaps",
  "reviews": [
   "Good food at this location, place was clean. Seats broken down in a few places. Automatic open and close doors in the restrooms was nice.",
   "This Arby's has yet to disappoint me. I've been here several times, and they've always gotten my order right. The lady at the register even suggested an alternate order that would give me everything I wanted and save me some money.",
   "I tried the fish and cheddar  \"2 for $6\" and they were pretty good 😋",
   "This Arby's location has become my go-to for a fast lunch.  The staff is professional and the overall work ethic fostered by management is something I didnt expect to ever find in a fast food place anymore.  Often my food is prepared fresh and ready before my credit card  transaction completes!  Only negative is the road hazard bush in front of the store that makes egress a dicey proposition for low-sling car drivers.",
   "Use to be good. Not now. Stael bread. Fries were hard as a rock. What happened. O Frankfort happen\nI'll never go back."
  ]
 },
 {
  "name": "Beef 'O' Brady's",
  "address": "111 Westridge Drive Suite A, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4b00dc86-9330-11ea-8522-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "eat",
   "food",
   "eat",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=10777509174882902200",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food and LJ was an amazing waiter! I will definitely be back soon. The margarita was delicious and the funnel cake fries were delicious with caramel, raspberry and chocolate sauce.",
   "I eat here fairly regularly. The food is great! The service is excellent. The prices are good oh, and they have some wonderful specials 4 days a week. It is a sports bar / restaurant and when certain teams are playing it gets loud in a positive way.\n\nThe food and the people are both wonderful",
   "In town for work so love finding decent places to eat. Extremely satisfied with this place, LJ  was our waiter  he was so nice and on top of everything even the host that seated us was great. Wings were awesome. I will definitely be going back and can't say enough as to how satisfied we were with how friendly and good this place  is.",
   "Typical bar food, but very GOOD bar food.  Lots of TVs showing pretty much anything you'd want to watch.  Excellent,  friendly service.",
   "Chef salad is delicious!"
  ]
 },
 {
  "name": "Kountry Kitchen",
  "address": "1055 us highway 127 south, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4b4e0ef4-9330-11ea-a932-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3225208294024297234",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful service. Sweet people. My second visit. Best blt I ever had in any restaurant. First visit my food was great too. They know I only get a 30 minute lunch so let me call ahead and have it ready when I walk in. This is going to become my regular place for lunch. Love it.",
   "A good place to dine. GOOD food at good prices and friendly service.",
   "Amazing breakfast.  Pancakes fluffy. Coffee hot. Sugar jug on table! Hashbrowns and breakfast potatoes perfectly crispy.  Gravy on delicious biscuits.  We will be back!",
   "Friendly staff.  Quick seating.  Good food & very good pie!!",
   "If you want fantastic food at a reasonable price, this is the place you want to be. Home cooked food, nothing fancy, but it's fast friendly and delicious. I eat here when ever we are in Kentucky and get my chance. It's better than those chain restaurants."
  ]
 },
 {
  "name": "Captain D's",
  "address": "15 Carson Place, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4b96ff08-9330-11ea-a888-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=150297425251694008",
  "source": "GoogleMaps",
  "reviews": [
   "All right I gave this restaurant a 5-star because of the way the manager on duty handled my problem even though it didn't happen on his shift. I had gotten 2 giant fish sandwiches from here at lunch time and asked for them to be plain and even though the receipt said plain when I got back to the office with my lunch they both had lettuce and tartar sauce on them. I called spoke with the manager on duty at that time, his name was Jared, he told me to bring them back that he would be glad to fix me fresh. When I got to the restaurant Jared wasn't there but the other manager was on duty (I didn't get his name sorry), but he was wonderful in fixing my problem and I will return to this restaurant cause I do love Captain D's fish and the great service!! Thank you for taking time to read this. 😁",
   "The service was good, friendly cashiers. Environment was clean and the interior design was interesting to look at. Food was so delicious and hot, although I wasnt really a fan of the mac and cheese. But other than that, i will definitely be returning.",
   "Captain D's in all my meals there have been very good.  The fish always well prepared.  One time years ago,  we had a couple of pieces not all done.  They apologized. Replaced them.   They were very busy.  Being a former manager of Long John Silver's,  I could appreciate the problem. \n The restaurant is  clean . People friendly.  \n Glad to see the new one opened on East side of town. Looking forward to trying it out.",
   "Good food for deep fried, fast-food seafood restaurant. Clean and tidy, friendly staff and service was quick.",
   "Food was good"
  ]
 },
 {
  "name": "Hardee's",
  "address": "1248 US-127 S, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4bdf7dd2-9330-11ea-b39b-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "affordable",
   "walk",
   "food",
   "free",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17868867240992420837",
  "source": "GoogleMaps",
  "reviews": [
   "I love Hardee's for breakfast.  Apparently everyone loves Hardee's for breakfast.  The biscuits and gravy are my favorites.  They also have eggs and sausage, bacon,  coffee and soft drinks.   I like to eat at Hardee's every chance I get.  I have lunch there also. Their food is good and affordable.",
   "The flavor of our breakfast sandwiches was good enough and the staff was very friendly. That's where the good ended. The floors were super sticky and hard to walk on, to the point of sounding and feeling like pulling velcro apart. The food looked absolutely nothing like the pictures. The bread on our Frisco breakfast sandwich was touching, as though there was basically nothing on the sandwich. This is the most disappointing, because they have a huge picture advertising it on the menu board. To top things off, the outside of the wrappers were extremely greasy, defeating the purpose of something to keep your hands at all clean. \nDisappointing to say the least.",
   "Very good service, had a roastbeef sandwich, juice and very tasty. A Great sandwich. Will Go Back.",
   "They have the best hamburgers of any fast food chain. Great food, great service.  A couple of times they were very slow due to lack of employees and we got our food free. I argued with the manager and wanted to pay but he insisted. Clean most of the time.",
   "Bryann made us feel more than welcome from the second we came in the door. One of the best Hardee's restaurants we have been to I completely give Bryann that win though he went above and beyond for customer service to me and my wife just passing through never seen him before in our lives but treated like family elders !!!! Great food especially good service and clean establishment."
  ]
 },
 {
  "name": "G. Gerrad's Jazz Restaurant & Lounge",
  "address": "76 C Michael Davenport Blvd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4c23eb0c-9330-11ea-b609-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1690028994853840174",
  "source": "GoogleMaps",
  "reviews": [
   "The food was delicious and friendly hospitality bit the reason why I give it a 3 star is because the silverware was dirty and i think my cloth napkin had a lil bit of mold spots in the corner of the napkin (forgot to get a pic of that). Luckily i didnt have to use the silerware that was dirty. But other than thatx everything was great!!",
   "The grand opening offered a buffet style lunch that gave us all a snippet of what's to come. The food was delicious.",
   "G. Gerrad’s is committed to rebuilding communities and strengthening families one bite at a time. Great hospitality and AMAZING southern comfort food with a twist.",
   "Great. Loved it",
   "Very nice venue"
  ]
 },
 {
  "name": "Willie's Tiki Bar",
  "address": "651 Benson Valley Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4c6adf4c-9330-11ea-b563-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7573550350104866554",
  "source": "GoogleMaps",
  "reviews": [
   "Nice quiet Marina atmosphere.\n can beer including Blue Moon and others. Simple food where the locals eat after Boating",
   "I'm treated like family here. Sometimes that's a good thing, sometimes not! 🤣 A very laid back atmosphere. Being on or near water always makes me feel better. Plus Doug serves great food in the summertime. Try the veggie sandwich. I came up with that recipe and Doug perfected the technique of grilling it. Hope you love it!",
   "Absolutely fabulous! The quintessential double burger topped with an onion ring and beer cheese. An exercise in gastronomic extravagance. I will certainly be back before cold weather shuts them down for the season.",
   "Nice environment",
   "A nice burger joint located at the Benson Marina. A good place for lunch or happy hour. Their karaoke is very popular in the summer months."
  ]
 },
 {
  "name": "Terrace",
  "address": "405 Wilkinson Blvd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4cb41d9c-9330-11ea-bb65-14b31f159f22.png",
  "tags": [
   "tasting",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7548921302926208987",
  "source": "GoogleMaps",
  "reviews": [
   "No service at all, sat for over ten min and never saw one person .  phone rang over ten times while were waiting and no one even bothered to come pick it up",
   "The bartender did not come take our order, he just stared at us while he went an took orders from the older crowd. We was about to leave an go back to our room when one of the other employee came an took care of us. She apologized an said she thought he got us when we came in. We were there for awhile waiting but her being friendly an the great tasting food made up for it.",
   "Great food!!! Great atmosphere..will definitely go there again on my next trip to Capital Plaza Hotel!!",
   "Omg the Cheesecake is to die for. Very nice place. ",
   ""
  ]
 },
 {
  "name": "Penn Station East Coast Subs",
  "address": "1303 Lawrenceburg Road, US-127, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4cfa0054-9330-11ea-8916-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6126221818025301809",
  "source": "GoogleMaps",
  "reviews": [
   "Good food. The bog guy taking your order with the beard is pretty rude. Happened more than once. Went in 2 different times for lunch that week.  It was cold in the place also. The seats made your buttocks cold",
   "I love it",
   "It was delicious, but expensive! My first time eating here, I was impressed with the quality of the food and service. However, $11+ for a sub and fries? Wow.",
   "The GM and employee are so nice and pleasant, food is so delicious. store is cleaned Bathroom are spotless. Will come here often and recommend to friends and family",
   "Fast friendly service, yummy food."
  ]
 },
 {
  "name": "Parlay's Tavern",
  "address": "1410 Versailles Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4d456168-9330-11ea-aa04-14b31f159f22.png",
  "tags": [
   "music"
  ],
  "link": "https://maps.google.com/?cid=14806651382171289011",
  "source": "GoogleMaps",
  "reviews": [
   "The folks that own this place are really good folks and a really good bunch of a down-home good people hang out there. Recommended if you'd like to relax and enjoy some good company",
   "A great place to relax and enjoy good friends and awesome music.",
   "Very nice local bar. Excellent friendly staff.",
   "Loving it but I miss my buddy joe!",
   "Was an amazing place to just hang after work. Great people running the place"
  ]
 },
 {
  "name": "Panera Bread",
  "address": "101 Westridge Drive Suite D, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4d8aa7f4-9330-11ea-b582-14b31f159f22.png",
  "tags": [
   "food",
   "free",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=312131970075448705",
  "source": "GoogleMaps",
  "reviews": [
   "Yum! They never disappoint.  The new double bread bowl is AMAZING and more than enough to share. The staff was friendly and quick with our order.",
   "I never have a bad experience at this Panera location! Super clean, fantastic service, and nothing beats parking it with my food and a book next to the fireplace. ❤",
   "Great large location to get work done. Not very crowded and ample parking. Nice crowd of regulars, felt very at home there.",
   "It was very good service, however they forgot a sandwich in our bag. Went back in and retreived the sandwich and got a free cookie. Very good service and apologies.",
   "Great place and love the food. Today i asked the make the sandwich warmed up but it was still served cold in-spite of asking multiple times. Also, they are out of that ginger drink figured it out after buying the same. Otherwise its best place in Frankfort."
  ]
 },
 {
  "name": "East Side Diner",
  "address": "Frankfort, KY 40601, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4dd2869c-9330-11ea-a603-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=233011591879008485",
  "source": "GoogleMaps",
  "reviews": [
   "I absolutely love this place good food wonderful service lovely atmosphere and the best hamburgers in town."
  ]
 },
 {
  "name": "Subway",
  "address": "238 W Main St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4e29f662-9330-11ea-8895-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=571317125969434642",
  "source": "GoogleMaps",
  "reviews": [
   "The worker was polite and courteous. \n\n The food was average. The place was clean. No complaints.",
   "Great place to stop and grab a quick snack",
   "Great food fast and friendly 😊",
   "One of the better subways I've had the opportunity to eat at. Clean store and friendly staff.",
   "The nicest people ever! Always the best service and great food!"
  ]
 },
 {
  "name": "Tienda La Chiquita",
  "address": "4 Grandview Dr, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4e71d43e-9330-11ea-9c0f-14b31f159f22.png",
  "tags": [
   "learn",
   "eat",
   "food",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2321687045021690019",
  "source": "GoogleMaps",
  "reviews": [
   "They need learn English if living here. And stop acting like american walks in store that they want to steal.",
   "I ordered my food to go, started to eat my tamale and found a staple in it.\nMy wife called the store slash restaurant and told them and they hung up the phone.\nFood was mediocre and will never go back again.\nVery very disappointing and furious for the lack of concern.     Eat with caution!!!!!!",
   "I placed an order for 4 meals.  3 of them were wrong and one of them had a staple in it.  I understand the language barrier and getting orders wrong, but staples in the food?  How on earth can that even happen ??   So I called the store to let them know what happened and she didn't understand me, mumbled a few word and hung up on me.  Again...language barrier ...but hang up on the customer??? I wasnt even speaking in an angry voice..  I was very nice and simply informing them.  For $48, that's not right.",
   "More than five times I had eaten here even yesterday, so far the food is excellent with reasonable price, and people are so kindly and friendly...",
   "Excellent food, made fresh, and a warm family atmosphere."
  ]
 },
 {
  "name": "Koi Express Frankfort Ky",
  "address": "101 Jett Boulevard Suite 500, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4ed159ba-9330-11ea-a18c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10537821346787999797",
  "source": "GoogleMaps",
  "reviews": [
   "Not sure what other reviewers experienced, but today our lunch was a total bumber!! Got our steak and teriyaki chicken platters, opened them up and reminded us of school lunch, skimpy and bland with no flavor. Almost all rice for $23. Never again!",
   "Great service and food at competitive prices without sacrificing quality!",
   "FOOD IS SOO GOOOD!",
   "Delicious food",
   "Highly recommended. Prepared very fast and was surprised me!! Great job for all staffs, all meals very tasty, love it 😍!! Koi express at Frankfort  👍👍👌"
  ]
 },
 {
  "name": "Tammy's Diner LLC",
  "address": "3624 Georgetown Rd, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4f125a68-9330-11ea-b1e1-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14085900889797701981",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to eat! Best chili and chocolate pie around. Staff are friendly and down to earth. If you want home style cooking and atmosphere, come here! The breakfast is also spot on.",
   "Awesome Home Cooking..Very helpful staff. I bought a plate of food to go home after eating meatloaf dinner.  See Y'all next time I'm in town.. Thank you 😊",
   "Great mom and pop restaurant friendly staff and patrons wonderful and fast service the kind of place you see  a lot of regular customers",
   "My wife and I were staying nearby in a RV park and decided to go out to breakfast.   We had platter 1 and 2.  The eggs were cooked perfectly to our order(over medium), the sausage was ok and the toast was good.  My fried potatoes were very salty which is my only complaint.\nThe service was excellent and the prices were very fair.",
   "I came here with my papaw a lot before moving to Utah. The food is great. It’s closest place you can get home cooking food in Frankfort Kentucky. The staff is like family to you. Highly recommend."
  ]
 },
 {
  "name": "Goodwood Brewing Frankfort",
  "address": "109 W Main St, Frankfort, KY 40601, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4f5ef438-9330-11ea-8044-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walking",
   "food",
   "kids",
   "food",
   "delicious",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3316488888928131557",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful Wonderful WONDERFUL service, AmAzInG food, Delicious beer!! What more can you ask for?! \"Courtney\" a.k.a. April is a phenomenal server with great recommendations!! Our food was slap ya mama good! Fish and chips, mac and cheese, the chicken, buffalo cauliflower...my my my!!! Jerry, shout out, you are beyond wonderful!!! Could have sat with you for hours! Thanks for taking such thorough great care of my hubby and I!!",
   "I was in the area checking out a couple distilleries, didn’t see this location on the map and happened to found it as we were walking by. The burger was really juicy and good! I had the Beer Cheese and Bacon Burger with a side of Tatertots. I had an Bourbon Barrel Stout which was amazing as well.",
   "Our server was polite and attentive (trystin?) Our food came hot fresh and quick. Prices are very reasonable for the portions. Only complaint would be extra parking...not extremely difficult to find but could use a sign or something.",
   "Great spot downtown on the river! Looking forward to coming back when it's warm out to sit on the deck overlooking the river. Space was welcoming with plenty of seating. Food was fantastic and the beer was great! Our server was amazing. We had a large group with kids and he did a great job. We will definitely be coming back!",
   "💥Fabulous view of the Kentucky River with delicious reasonably priced above average bar food. Park your car 🚗 anywhere in downtown Frankfort and walk to all the tourist points of interest including this Fabulous tavern!\n😊Nicki, our server was friendly, informative and very attentive. 👏"
  ]
 }
]