[
 {
  "name": "Wildwood Park",
  "address": "100 Wildwood Way, Harrisburg, PA 17110, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4fb6ff78-9330-11ea-a42d-14b31f159f22.png",
  "tags": [
   "history",
   "art",
   "parks",
   "nature",
   "field",
   "kids",
   "family",
   "nature",
   "walk",
   "kids",
   "family",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=4416242564558215861",
  "source": "GoogleMaps",
  "reviews": [
   "Not as 'wild' as the name leads to think but a great time for all ages, mostly hardened trail and seemingly stroller accessible (although not attempted myself). The visitor center is great and informative with plenty to read about the history of the park and the items you wondered about whilst hiking. I'd recommend to keep the visitor center for last.",
   "Great for walks and strollers. There is always wildlife to observe. You can go and have a different experience each time. From the trail you take to the people you run into do the life that you see. There is also some pretty cool natural art.",
   "Great place to enjoy the woods, scene and FRESH AIR for our LUNGS. Lets give the future(young people) a great world to live in. Support your local parks and stop the Gutting and Dismantling of the EPA.  \"Mother Nature\" gives us love and life, lets love her back and PROTECT HER PEOPLE!!!",
   "This place is amazing for nature. They have a small coloring room for kids. Provide binoculars for the view outside! In case of bad weatherthe inside has a lot to see, in the outside has. I went on a job field trip, but it's definitely family fun!",
   "Our family loves Wildwood park. It's a nice place to take a walk or teach a child to ride a bike. The nature center is amazing for kids, lots of hands on activities."
  ]
 },
 {
  "name": "The National Civil War Museum",
  "address": "1 Lincoln Cir, Harrisburg, PA 17103, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5005bbd2-9330-11ea-8180-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=9869454732216220801",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful museum! We spent only a few hours here, but you could easily spend the entire day looking at everything. It will take you back in time. The curators did a great job with the layout, some of it is a bit redundant, but all worth seeing. We went on a Monday when they first opened, it wasn't busy which made the experience more reflective, as you're not trying to hover or read around a crowd, also it was very very quiet and peaceful, which I imagine it would not be on a busy day or if they had a field trip of kids.",
   "They got big guns, they got little guns, they have roughly medium sized guns that are not quite as big as the big guns. It is also important to note that the roughly medium sized guns are not quite as little as the little guns. If the little guns are a 2 and the big guns are a 18, the roughly medium sized guns would be a 9. If you like guns, you might lile this place, no promises.",
   "This is a very nice museum. There are so many interesting artifacts that I was very impressed to see. It is very nicely laid out and you could certainly spend a few hours here learning more about our Nation's history.",
   "Good Learning Experience\n\nI enjoyed my tour of the museum! It was very informative with actual Pre and Post Civil War artifacts! Being a Southern Black American, and seeing the real chains and clothing worn by slaves that could have been my ancestors was a very moving experience. I would have liked to see more exhibits about the contribution made my slaves to the winning of the war.",
   "This is a top notch museum. Not crowded on march 12. We walked through it in about 3 hours."
  ]
 },
 {
  "name": "Pennsylvania State Capitol Complex",
  "address": "501 N 3rd St, Harrisburg, PA 17120, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/50525554-9330-11ea-9f7c-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "tour",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2684007419609550321",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful Capital Building.  We took the free guided tour which takes a little over a half hour, then followed that will the self guided tour and took another 45 minutes.  Guided tours run every half hour.  The building, artwork and furnishings are impressive and in excellent condition.  Especially check out the artwork in the Moravian tile floor.",
   "The tour was quick, we got the House, the Senate and the Supreme Court room.  The building and history are truly amazing and pictures will never do it justice.  Make it a point to visit this exquisite place.",
   "This is the best and pretty good place to come after work to grab some pizza and drinks. I definitely coming back here again. Best of all the best!",
   "I was very impressed by the architect and artwork that went into this Capitol building. It's a good place to meet with your state representatives and to have Rally's to push important bills through. Wonderful offices to  work in, very secure, handicap accessible to all complete with a cafeteria although I would consider the food that was served to be substandard and a better quality needed for our state representatives. I must stop in if you're in the area Harrisburg Pennsylvania",
   "Here's the mega troubling on routes of 119 and 30 interchange is problem on lots of traffic jam on the holidays and some evenings and now coming soon new business is unconstruction now and will be open for summer, it's will be biggest trouble in the traffic jam on location and area!! Here's some succestion for the location now first remove which business now is the time for road work and adding the new road ramps to route 30 interchange now and that's good idea right now!!"
  ]
 },
 {
  "name": "The State Museum of Pennsylvania",
  "address": "300 North St, Harrisburg, PA 17120, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/509cf336-9330-11ea-8538-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "kids",
   "free",
   "food",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2740927400991494691",
  "source": "GoogleMaps",
  "reviews": [
   "Beyond expectations. What a great place to spend a couple of hours, meandering through ancient and recent history.\nEverything is covered from dinosaurs to the development of the Penna Turnpike! My 7 year old was captivated throughout the exhibits and really liked the civil war spread.\n\nRecommended!",
   "Went here, and enjoyed every moment. The vastness and variety of the historical pieces here really made me like this place.",
   "Great history and nice place",
   "I love taking my daughters here because there is so much for them to do in the toddler area right in the front of the museum. We haven’t made it out of there except once and my oldest kept asking to go back! It is for kiddos up to 5 and there is so much to do! They have large farm animals including a GIANT baby chick, building blocks, apples that can be “picked” from the trees and carrots and cabbage that can be “harvested.” There is also several costumes for the kids to dress us, tons of books, lots of stuffed animals, a play bedroom with a small kitchen and tunnels, a play bus with a small slide, and they also have toys that they routinely swap out so there is always something different. \n\nOne of my favorite things is there is a bathroom right inside with a kid sized toilet that is perfect for potty training toddles. They do not allow food or drinks inside and are open starting at 10 am.  Another great thing is that it is free for AD military and dependents so that is not only appreciated but also a plus! The perfect hot or rainy day activity.\n\nI’m sure we will be back many times!",
   "We enjoyed Charter Day (free admission!)! It was nice to explore our states history and see the actual charter from the King of England to William Penn allowing him to establish a colony here. The only complaint was the show in the planetarium. It was nothing but a giant ad for NASA and their cries for more funding. But for free...it was something to do."
  ]
 },
 {
  "name": "Pennsylvania National Fire Museum",
  "address": "1820 N 4th St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/50df7ada-9330-11ea-92cb-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "history",
   "history",
   "knowledgeable",
   "historic",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=8292496716732030661",
  "source": "GoogleMaps",
  "reviews": [
   "Great museum filled with fire fighter history. It was a great stop on the way back fro Hershey. The staff was very friendly and knowledgeable.",
   "As a volunteer firefighter i loved this place. A converted fire station with tons of history! Lots of antiques to see, price was awesome ($7/person)",
   "Very awesome displays, perfect place for any fire department enthusiast or current/past members of the fire service. Members of the museum are themselves retired fire service members and very knowledgeable.",
   "What a wonderful experience! I took my 17yr old son and his 12yr old stepbrother on a Saturday morning - it was not very crowded at all. The staff was polite, well-informed, helpful and attentive.\nOriginally the Reily Hose Co. No. 10, a Victorian Firehouse built in 1899, this museum exceeded my expectations. The website doesn't do it justice!\nThe lower level houses apparatus, firefighting equipment and the gift shop. The upper level has the historic Gamewell Alarm System - a fantastic, interactive display from the 1920s - as well as an exquisite collection of firefighting memorabilia. Don't miss the beautiful memorial wall, and remember to visit the gift shop - prices are super reasonable!",
   "Absolutely loved the museum. Lots to look at and learn. They were even nice enough to allow my toddler to sit on the engines. Highly recommend for the fire fighter lover in all of us."
  ]
 },
 {
  "name": "Riverfront Park",
  "address": "200 S Front St, Harrisburg, PA 17104, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/513405cc-9330-11ea-89f2-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12306657875280771791",
  "source": "GoogleMaps",
  "reviews": [
   "You can take a walk over the river if you like to. Or just enjoy the sites from this side of view. Overall plenty of action.",
   "Nice park with scenic views of the river. Plenty of places to sit and admire the view. Very difficult to find a place to park nearby though.",
   "Thus is a beautiful site to sit back, relax, and take  in some sunshine",
   "Great place to take a dog",
   "Photos Copyright Freundly Sky's Aerial Imaging LLC"
  ]
 },
 {
  "name": "Susquehanna Art Museum",
  "address": "1401 N 3rd St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5182e962-9330-11ea-afd5-14b31f159f22.png",
  "tags": [
   "free",
   "creative",
   "delicious",
   "learn",
   "art",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=459338181913927615",
  "source": "GoogleMaps",
  "reviews": [
   "There are essentially four exhibit areas. Very well done. Perfect additional stop if you're headed to Midtown. Take advantage of the free parking in back. I didn't realize it was there until I saw the sign on the front door.",
   "What an amazing place! We are here for the 1st time on a school trip. The morning presentations were divided into to parts for the elementary children (k-2/3-5)& was at a level that was easily understood by them without treating them as if they were unintelligent. My son (7) thoroughly enjoyed the creative actitivty & said he even liked learning about the artist & seeing the other paintings.\nMy daughter (11) attended the afternoon (6-12) presentation & said that it wasn't as boring as she thought it would be. The also did a creative actitivty which she loved and said the presentation on the pictures was very interesting & informative.\nWith the muesum changing exhibits every 12 week there are multiple times each year you could visit & do new things. We enjoyed this trip a lot & plan to become members to enjoy it even more. Some of the perks are AWESOME.",
   "My husband and I visited the museum during the Picasso exhibit, and we had a wonderful time! For starters, we had no problem finding regular meter parking on the same block as the museum which made for a very pleasant beginning to our artsy adventure. The museum and exhibition itself was somewhat on the small side but not disappointing in the least. If anything, it helped to create a more intimate, laidback atmosphere. You did not feel the need to rush through the exhibit. It gave off a relaxed vibe , and allowed for you to spend time truly enjoying and discussing each piece. It was a very nice, and much welcomed change from  the hustle and bustle of the larger museums and/or exhibits we have been to. We also were very happy and excited to learn that just a few blocks down from the museum was an absolutely beautiful and wonderful bookstore complete with a delicious coffee bar. From the outside, it was not much to look at, but upon entering, it was indescribable! It was just like the old bookstores you always see on movies. It was the perfect ending to a relaxing and inspirational day! I highly recommend anyone who is a fan of art check out Susquehanna Art Museum via Facebook for more information and their upcoming events!",
   "Small but current collections are diverse and engaging. Kid friendly, inexpensive, and only a couple of blocks from the market.  Would definitely do again.",
   "Very unique place with lots of different mediums used in displays. The staff is very friendly. You don't want to miss going through this museum."
  ]
 },
 {
  "name": "Benjamin Olewine III Nature Center",
  "address": "100 Wildwood Way, Harrisburg, PA 17110, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/51c2ffd0-9330-11ea-b4ff-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "kids",
   "nature",
   "walking",
   "art",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13126036292508777383",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to go with kids.  Lots of neat exhibits and a bird watching area",
   "Awesome trails. Some right over the water on docks. Great for walking the dog or going for a run. And of course there are all the animals and aquatic life.",
   "We love coming to Wildwood and the Nature Center. There are so many fun things for the kids to explore and find. Bring your walking shoes and get outside!",
   "Great place (Wildwood Park, just north of Harrisburg PA).  We walked the main loop which is about 2.5 miles.  Saw an otter, a couple of great blue herons, a turtle, a coot, some mallards , etc.  They have some fun \"natural\" art exhibits along the trail.",
   "This was always a wonderful place to take my kids. It was great to revisit that with my grandchild who had an awesomely good time."
  ]
 },
 {
  "name": "Cathedral of Saint Patrick",
  "address": "212 State St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/52119522-9330-11ea-af27-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=11310087575696880764",
  "source": "GoogleMaps",
  "reviews": [
   "This is such a beautiful church.  I dont think the regulars are used to visitors because folks weren't overly welcoming,  but that's ok, I still really enjoyed my time with God!",
   "Went to an ordination here and this place is spectacular! Beautiful, elegantly designed and the acoustics are out of this world! Exactly what you want your cathedral to be, and I can't wait to visit again!",
   "Imposing exterior and beautiful interior! Worth a stop-by for those visiting downtown Harrisburg.",
   "As goes for most cathedrals the architecture and interior design, the work of the artist that had a hand with finishing off the inside the decor I have to say outstanding. A wonderful place to check out as well as to Worship in",
   "A beautiful sacred space, blocks from the Capital. I wish I had more time to spend in prayer and exploring here."
  ]
 },
 {
  "name": "Negley Park",
  "address": "210 Cumberland Rd, Lemoyne, PA 17043, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5266ba40-9330-11ea-b7e6-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9559186711326403876",
  "source": "GoogleMaps",
  "reviews": [
   "My partner and I had the most wonderful experience. A very clean park, I’ve never even heard of this gem until my coworker recommended it to me! It’s so nice to see a skyline view across the susquehanna river of Harrisburg. Highly recommend.",
   "Very relaxing family-friendly beautiful view of Harrisburg over the river",
   "Very nice skyline view of Harrisburg especially during a sunset :)",
   "My kids grew up playing at Negley. That was 27 yrs ago! Loved it then, live it now. Great for all day fun! 👍",
   "Perfect vantage point to watch the sun rise over Harrisburg and the Susquehanna River."
  ]
 },
 {
  "name": "Pennsylvania Governor's Residence",
  "address": "2035 N Front St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/52b29158-9330-11ea-babb-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "tour",
   "tour",
   "free"
  ],
  "link": "https://maps.google.com/?cid=14600518875514604586",
  "source": "GoogleMaps",
  "reviews": [
   "What an amazing opportunity to walk through the PA State governor's have resided. This building is rich in history and has a beautiful garden.",
   "Very cool inside. Well worth a tour.",
   "Marvelous Christmas open house. Staff was so welcoming. The residence is beautiful!",
   "This past Sunday was the first time we visited the Governor's Residence.  On a special occasion of course --  the Annual Holiday Open House!  You see, normally the GR is only open for tours during the months of April, May, June, September, and October between the hours of 9:30 am and 2:00 pm.  I don't think anyone would take a day off from work just to go on the tour, do you?  So this was a golden opportunity that we didn't want to miss.\n\nNow it was for the Christmas holidays so it was even more the reason to visit. There were a total of 8 Christmas trees inside the GR!  Garlands and ornaments were everywhere.  Santa Claus was there for picture taking.  The Christmas village and the 3 trains that were running on the tracks -- so fascinating!   There were free hot ciders, hot chocolate, and cookies.  All of the staff were out greeting people and answering questions. Choir was singing Christmas Carols and the pianist was playing funky tunes.  Governor Wolf and his First Lady, Frances were there shaking hands with visitors and posing for photos.  And most of all, the mansion itself was simply amazing, as ornate as a residence can be!\n\nWe were fortunate to be part of this occasion on our first visit. We had such fond memories of the time we spent there.",
   "This is truly a timeless historical landmark that pays homage to the rich tradition of the Commonwealth of Pennsylvania's democracy. the campus is well manicured and the staff that keeps it in great condition is truly phenomenal."
  ]
 },
 {
  "name": "John Harris-Simon Cameron",
  "address": "219 S Front St, Harrisburg, PA 17104, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/530e1e46-9330-11ea-8d6d-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "free",
   "delicious",
   "food",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7923855908331887278",
  "source": "GoogleMaps",
  "reviews": [
   "Event was a re-enactment of the first public reading of the Declaration Of Independence.  Train, plane and automobile traffic occasionally drowned out the speaking, but the event was well informed, well executed and well oriented.  The tour of the mansion was also well done.  A good way to begin our holiday activities.",
   "The young woman sitting at the desk didn't bother to look up when I entered the building to sign in for the tour, but another woman quickly came up to greet me and was very helpful...and friendly.  The mansion is beautiful and transports you back in time.  The tour was informative and the tour guide had the answers to all our questions.  There were renovations being done to bring the mansion back to a period true state and we can't wait to come back to see how the changes come out.  The free parking was a nice surprise after paying for parking for our other stops in downtown Harrisburg.",
   "This was interesting and it was historical!",
   "Very traditional Arabic restaurant with delicious food",
   "Great history and beautiful home."
  ]
 },
 {
  "name": "Reservoir Park",
  "address": "100 Concert Dr, Harrisburg, PA 17103, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/53620ad8-9330-11ea-b7bd-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=14056719519702847125",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice park with great city views. We saw the largest red fox walking around on our visit here. It decided to sit down about 50 feet from us off the walking path. It just sat and watched us like we watched it. It could've cared less about us. It was such a neat thing to see.",
   "Some of the best views of Harrisburg are from this park. My favorite time of day to pause here is late afternoon and sunset. There is a one way road that makes a full circuit around the park and 3 entrance/egress.  I will cut through not just to save time, but for the views. An extra 10 seconds at a stop sign, looking across the city I grew up in, always brightens my day.",
   "Reservoir park is a huge park.  It has a giant playground, nice basketball courts and they have great live events.",
   "Nice city park. Great location, nice and sunny with plenty of trees for shade.",
   "A place of calm and quiet amidst a busy city."
  ]
 },
 {
  "name": "Harrisburg Sunken Garden",
  "address": "1210 N Front St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/53aa379a-9330-11ea-baad-14b31f159f22.png",
  "tags": [
   "unique",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=1284915114737824598",
  "source": "GoogleMaps",
  "reviews": [
   "Nice riverfront park park. Walkways and park are good for relaxation.keen eyes may find some wildlife at the river bank",
   "Unique feature enclosed in a very unique Riverfront Park. The park was created in the early 1900s. The statues are both old and new and the Riverview is always beautiful. The sunsets are beautiful!",
   "Great area to walk especially in the spring and summer. Very spacious for exercise and benches for reading and picnics.",
   "Beautiful place to walk your dog 50 yards away is the Susquehanna River so you can make a loop through the garden down to the river and back up your dog will thank you for it",
   "Awesome place to run through along the river."
  ]
 },
 {
  "name": "Fort Hunter Mansion and Park",
  "address": "5300 N Front St, Harrisburg, PA 17110, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5401588a-9330-11ea-a72b-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "free",
   "nature",
   "walk",
   "family",
   "field",
   "knowledgeable",
   "kids",
   "tour",
   "learn",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=18401054692886015411",
  "source": "GoogleMaps",
  "reviews": [
   "Although I live in the area, I haven't visited here before. We came for the Maple Syrup festival but stayed for the nature walks and beautiful scenery. We didn't pay to go into the mansion but walked the grounds and took in the river views. There is a little playground, benches, and picnic tables. The mansion is across the street from the barn and covered bridge, which are also cool.  If you are looking for something free to do outside, this  would be great to bring the kids and walk around, enjoy the day, maybe have a picnic. You could even have a fun adult date here.",
   "This was a delightful place for the holidays. They had displays, tours of the mansion, and crafts. Mainly though my little one loved the model railroad display they had for the holidays. Really a good place for nice walk even when it's not the holidays. They do have events throughout the year, so you will want to check their website.",
   "We went to the mansion on Friday because the kids were off school for Columbus Day. Both of my children went to Fort Hunter for their 3rd grade field trips and my daughter has been asking to go back for over a year! Plus my husband has never been. We walked up and rang the bell and a very friendly tour guide answered and we paid for the tour. It was extraordinary! Despite 3 of the 4 of us having toured the mansion before she provided a great deal of new facts. Even my 11 year old son said it felt like a different tour. She spent almost an hour with us and answered all our questions and was extremely knowledgeable. Unfortunately none of us took note of her name. I would love for Fort Hunter to know she is amazing! Thanks for a fun family day!",
   "Great place to learn history. Beautiful wedding venue! Friendly staff. Neat little gift shop. Nice picnic spot. I highly recommend taking the tour of the house.",
   "The views of the Susquehanna River at this park are always soothing. It's one of my favorite meditation spots!"
  ]
 },
 {
  "name": "Adams-Ricci Park",
  "address": "100 E Penn Dr, Enola, PA 17025, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/54489b1c-9330-11ea-ab97-14b31f159f22.png",
  "tags": [
   "walk",
   "pets",
   "walking",
   "family",
   "walk",
   "kids",
   "nature",
   "walking",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=6083827918069324174",
  "source": "GoogleMaps",
  "reviews": [
   "A nice, clean park with walking trails, shades, seating arrangements, picnic areas, options to grill. There are many areas for children to play. Tennis courts. I always find sports, events going on here at all time. Parking convenient and available at diff places throughout the park. Good place to walk pets too. Love this park.",
   "This was a fantastic park! Very clean, and well kept. Numerous courts to use: tennis, basketball. Picnic tables readily accessible, trash bins near every table. Full bathrooms open for use. We saw many small playgrounds at various places, and one gigantic super fun play area. Big win for the family on our road trip.",
   "Very awesome park. Lots for kids to do, nice walking paths, nature trails (make sure wear sturdy shoes) that go down to the creek. Great place to walk your dog as well.",
   "Nice clean park. There are multiple different sport fields there. You can play tennis and basketball. They have bathrooms and benches. A lot of parking space. There is a children playground. In addition, there are few trails. There is a bench on the river shore. It is a peaceful place",
   "A nicely kept park. Clean with plenty to do. Railroad car to visit, Tennis courts, soccer fields, long walking trails, multiple playgrounds and pavilions with portable toilets during the off  season. Dogs are welcome on leashes. Ample Parking lot, that's long and close to everything. I highly recommend visiting."
  ]
 },
 {
  "name": "Do You Even Escape?",
  "address": "2201 Market St, Camp Hill, PA 17011, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/549beb40-9330-11ea-8182-14b31f159f22.png",
  "tags": [
   "cheap",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2612295487374240418",
  "source": "GoogleMaps",
  "reviews": [
   "They had off street parking, and friendly game master. The puzzels themes are fun.\n\nNow for the 3 star rating stuff.\n\nThe room felt a little thrown together and cheap. \n\nIn the room my group did, there was a bonus objective, however there was NOT a puzzle on how to complete it. You just had stumble upon it.",
   "I had a fantastic time here with my family in one of the Titanic rooms. It's a very interactive experience, and it takes a lot of different types of brains to escape. The staff is amazing - they test you on how to use different types of locks before you enter the room so that you know what you're doing once you're in there. And they are watching/listening the entire time, so they can offer clues along the way if you get stuck. The rooms are very claustrophobic-friendly, too. We had a window in our room that we could open, and there's a button next to the door that opens it if you need to step out for a minute or use the bathroom. Very fun experience, I would definitely return!",
   "We liked the shipwreck theme and it was challenging without it being too difficult. The person who explained the rules/room spoke very fast and made us feel rushed. The one lock was very difficult to open- we had the correct code and tried it multiple times without it opening. They should have locks that work for an escape room.",
   "Four of us did one of the smaller rooms. We had a blast. We talked with one of the owners for a bit, he is a bit, he was really nice. We look forward to going back and doing the other room some time.",
   "We started here with a group of 10 people for my wife's birthday party. Let's just say we had a blast. Unfortunately, we did not make it out in time but we had such a good time. We want to say thank you for helping us celebrate a wonderful day with all of our friends. We highly recommend them!!!"
  ]
 },
 {
  "name": "Boyd Big Tree Preserve Conservation Area",
  "address": "401 Fishing Creek Valley Rd, Harrisburg, PA 17112, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/54de72c8-9330-11ea-9b2e-14b31f159f22.png",
  "tags": [
   "walk",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=5611678272588257890",
  "source": "GoogleMaps",
  "reviews": [
   "The Creek trail is really nice and also the end of the Janie trail. Most of the trails are covered by gravel so it doesn't get too muddy",
   "Wonderful place to spend the day, Hiking! Very Beautiful scenery, with 6-9 different Trails to walk, hike, jog on!! My wife and I hike there various times of year, and always enjoy the different scenery of the Forest!!",
   "Peaceful and serene.. The trails arent too difficult. There are benches to sit on when you get to the pond.",
   "Very quiet.  Like green trail was difficult in parts, but not too difficult.  The views on this trail are nice.  Watch for mud after recent rains.  Some spots were muddy for five or ten feet. Overall, a very peaceful place.",
   "Great mix of trails and that good balance of maintenance with low impact on environment. Many trails so make sure you pay attention to the trail markers and remember the trail names to get out easier. Connects to the Appalachian Trail as well."
  ]
 },
 {
  "name": "Walnut Street Bridge",
  "address": "E River St, Susquehanna Township, PA 18847, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5527d7fe-9330-11ea-aa62-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "historic",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=16696359219568298459",
  "source": "GoogleMaps",
  "reviews": [
   "Neat looking bridge for pedestrians and dogs. The narrow concrete walkway on one side is where most people walk on. The wider area of the bridge is metal and it has small holes where you can see through to the water. Definitely not paws friendly and not for those with fear of height. It has a great view and f the river on either side.",
   "Just enjoyed the scenery and the history of the bridge just adds to it .",
   "I love walking this historic bridge. Steel truss bridges are hard to find. Of course not dealing with cars is a bonus. Great views of Harrisburg and City Island too.",
   "First time visitor on Sunday October 21 2018.  Walked halfway.  Great views.  Very windy.  Actually too much wind so I walked carefully back to safer ground.  Will visit again when visiting Harrisburg.",
   "Love this bridge and cross is often on my bike rides and 5ks"
  ]
 },
 {
  "name": "Five Senses Gardens",
  "address": "Capital Area Greenbelt, Harrisburg, PA 17111, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/557c12b4-9330-11ea-95a8-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4629577239021063060",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful garden, it could use a nice clean up though - quite a bit of trash",
   "Best place to relax and expend time with family.",
   "This is such a sanctuary. I love walking by myself and hooking up with the GreenBelt. Its also a great place to take the kids (I have 3 little ones). Swimming in the summer and the shade it provides make it a great place to picnic.",
   "I found the Five Senses Gardens while researching for a visit to Harrisburg on Google Maps.  Thank you Google Maps, I would be lost in the world without you.  I visited the gardens for the first time on Sunday October 21 2018.  Unfortunately the weather wasn’t the best but it was partly sunny and I had a wonderful time exploring with my cameras.  I was impressed that the crossing from the parking lot to the park and trail is being upgraded.  I posted pictures of this.  There is an island in the middle of the street for people crossing to the park.  It looks like the crossing will have a flashing light.  It will be fun to see the improvements when I visit next year.  The park could be used as a rest stop for travelers on the Greenbelt.  Unfortunately there are no facilities in the park.   The sound of Spring Creek stimulated the hearing sense which is very relaxing.  There are no picnic tables but there are a few benches for you to sit and enjoy.  I would love to come back and visit in the spring.  I’m sure it would be more colorful then.   The park is easy to find right along South 28th Street (Route 441).",
   "So peaceful, just water gurgling and birds chirping. You'd never know it's in the middle of an urbanized area"
  ]
 },
 {
  "name": "City Island Harrisburg",
  "address": "Station Rd, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/55ce0392-9330-11ea-b794-14b31f159f22.png",
  "tags": [
   "walking",
   "walking",
   "sightseeing",
   "family",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=791122362815465720",
  "source": "GoogleMaps",
  "reviews": [
   "I always love coming here because there is so much to do. There's walking paths that circle much of the island and observation areas that overlook the Harrisburg skyline. There's also batting cages, miniature golf, a train, volleyball courts, playground, and concession stands. The Pride of the Susquehanna boat is worth checking out for a quick boat ride or dinner cruise. One of my favorite things is walking the Walnut Street Bridge, a steel truss bridge closed to cars. It connects to Riverfront Park in Harrisburg.",
   "Serene..... Quiet island in the middle of the Susquehanna -or at least off season. Great views of the Harrisburg skyline and surrounding hillsides. Nice walking areas here, mini golf, boat ramp and the Senators! Also take a cruise on the Pride of the Susquehanna May - November",
   "Perfect view from all the decks by the river and cute sightseeing train around.",
   "Beautiful place for the family. Lots to offer. Good food, and nice mini golf. Nice safe place for walking with the family.",
   "Great place to catch a ball game, or play a game of kickball."
  ]
 },
 {
  "name": "Market Street Bridge",
  "address": "Market St Bridge, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/56145b88-9330-11ea-8c0e-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "walk",
   "walk",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4396280214825915261",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing sunsets, nice park, great views, walk the bridge, grab a bike, take a train ride, watch a baseball game, have a picnic, putt putt and much more. Awesome place for the family to spend the day.",
   "Early morning walk along the Riverfront Park is something I would recommend. Several bridges can be spotted from the park benches. The Market Street Bridge seems to be the one with markers. Details about the construction of the bridge can be found in front of the bridge near the park pathway.",
   "Visited Harrisburg on Sunday 21 October 2018.  The bridge looks nice from a distance.  Up close it looks like Reading's Penn St. Bridge before its current makeover.  Needs a lot of work.  Don't park your car underneath.",
   "Not sure why a bridge gets a rating but I'll give it 5 stars. This bridge is a BEAST! In the 90's the walnut street bridge collapsed and floated into it. Market street bridge held it's ground! It is also the only driving bridge onto city island.",
   "Access point to the park and side walk. Nice place to fish or play frisbee. Walking with kids is a great activity"
  ]
 },
 {
  "name": "Market Square",
  "address": "201-205 Market St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/565b28e8-9330-11ea-b930-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=10751218470119853156",
  "source": "GoogleMaps",
  "reviews": [
   "HARRISBURG.  Pa.  HARRISBURG.   From.   2nd.    And.   Market.   St.    To.   Cameron.     And.   Market.   St.     It.   Reminded.    Me.   Maryland      Baltimore.      1934.",
   "The center of downtown.",
   "Nice, city bus center, hotel center",
   "I go there mainly to catch a bus or an Uber. Nice place to be.",
   "Interesting Harrisburg destination"
  ]
 },
 {
  "name": "Adventure Park",
  "address": "1775 Lambs Gap Road, Mechanicsburg, PA 17050, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/56a1ced8-9330-11ea-b145-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "walking",
   "kids",
   "free",
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=146712233696800103",
  "source": "GoogleMaps",
  "reviews": [
   "A wonderful park to bring children of all ages and abilities. There is both an accessible playground for bigger kids as well as one for the younger kiddos.  From tunnels, to slides and balance beams as well as swings, there really is everything! There is even a rock wall. here is also a sandbox.\n\nIn addition to the playgrounds, there is a paved walking path that goes around a large grassy field. There are two pavilions with picnic tables and one of them also houses some outdoor exercise equipment. \n\nIn addition to all of this, there is grass volleyball courts, soccer fields, and plenty of space for just about anything. \n\nYou can rent the pavilions for your outdoor gatherings such as birthday parties, etc. there is a pretty well-maintained bathroom facility as well. In at least the women’s, there is a changing table provided. They are closed during the winter months so keep that in mind. There are drinking fountains on the outside of this building as well but they are also shut off during winter months. \n\nOverall, a wonderful, ENCLOSED park for kiddos to burn off some energy. Even on a wet day, the playground is pretty dry because of the rubber flooring.",
   "Nice and free park for kids. Playground is fenced.  Nice running track around the compound. Bathroom close at sunset. You can  even have parties (I believe you need permission from the church). Good Place 😊",
   "Great park! There's a lot of tiny humans playing so my own tiny human made a lot of friends! People were so nice they lend my tiny human their ball and we end up playing ball kick. lol there's also pavilions for grilling or just for eating food etc. Overall, great experience and great place!",
   "This is attached to a church and offers a neat outdoor fitness area.  There is a huge area for the kids to play in and a pretty long running track.  This area would be great for a picnic on a sunny day and there are plenty of benches along the trail.  Parking is plentiful and there is no cost to visit.  While I was there they had a 5K race going on, but I was still able to enjoy the area.",
   "This is a great place to take your child if they love to climb steps.   There are plenty of different heights to maneuver across and the majority of high places have a tall sturdy railing to prevent falling.  There is tons of parking and it's separate from the vast play area.   Nice amount of swings, monkey bars and activities to tire out the little ones on."
  ]
 },
 {
  "name": "SpringGate Vineyard & Brewery",
  "address": "5790 Devonshire Rd, Harrisburg, PA 17112, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/56f5e2b6-9330-11ea-8f6e-14b31f159f22.png",
  "tags": [
   "food",
   "winery",
   "tasting",
   "food",
   "music",
   "winery",
   "food",
   "music",
   "winery",
   "knowledgeable",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11176070943408064772",
  "source": "GoogleMaps",
  "reviews": [
   "The staff were friendly and helpful even though the place was packed for Valentine's day.  They ran a nice promotion for buying two bottles of wine.  The prices were reasonable and the wine tasted great!  They had great food trucks out back that made the experience just outstanding.  I definitely plan on coming back.",
   "Great location all year round but summer is the best. From the winery to the beer garden. Food trucks and live music. Wine slushees are good as well and not too badly priced if you get the refillable cup to use. A great community location and great tasting beverages.",
   "Love this winery, good variety of craft beers and wines. Food trucks and music are a huge plus.Out door fire pits and two big indoor areas are nice.Staff very helpful,we enjoy coming here on special events.",
   "I love everything about this winery. The wine variety is fantastic. The staff is always so very knowledgeable. && there is always some kind if food truck. I have been here multiple times and have never left unsatisfied. 👌",
   "We Had a great time at the Vineyards With my boyfriend. The wine was great. However, the ultimate part of our  weekend was the food we ate while there. My boyfriend had the  Cumin coffee robbed steak which was amazing. We also had the Salmon and pickled shrimp which delicious as well. Hats off to chef Tony. We had a great time at the Vineyards,  will be back soon..."
  ]
 },
 {
  "name": "Indian Echo Caverns",
  "address": "368 Middletown Rd, Hummelstown, PA 17036, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/573d4c1e-9330-11ea-ae42-14b31f159f22.png",
  "tags": [
   "tour",
   "kids",
   "history",
   "tour",
   "family",
   "knowledgeable",
   "family",
   "hike",
   "cheap",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=13902370875268682759",
  "source": "GoogleMaps",
  "reviews": [
   "This place is amazing. Beautiful formations throughout. Really something to look at. The tour guide was awesome. With her quirky way of telling the stories that went along with the history in each area, to her genuine kindness. This place is definitely worth a visit. Many steps to get to the entrance so keep that in mind. Kids of all ages will love it here.",
   "Highly recommend this tour with Daniel! Here was an amazing tour guide,  very animated and informative.  My family truly enjoyed our experience there. If you get a chance,  ask to hear the dirty about the mommy and the giant",
   "I went with family and friends. We absolutely loved it. Friendly, knowledgeable staff. Beautiful caverns. Only downside is lots of step to the caverns. So people with disabilities would have a tough time but can obviously overcome the difficulties due to being strong minded and some help. I would definitely recommend this site for every family.",
   "Not as colorful as Crystal Caves but much larger. Great guide service and friendly staff. Be prepared to hike a lot but worth the effort.",
   "This place was amazing! Not crowded, and the temperature in the cave was nice. The tour guide was very nice and was able to explain all of our questions. There was very interesting scenery both inside and outside of the cave. Very beautiful formations. Unfortunately we went during the winter so we were unable to sift for gems and stuff, but you were still allowed to buy bags and take them home to sift yourself. We got to pet different animals as well. All in all, it was a wonderful experience and I have no complaints. I would recommend this to all ages, because the adults, teens and toddlers all enjoyed it quite a bit. Awesome place to visit! Oh, and the gift shop was really cool, and the prices were very cheap."
  ]
 },
 {
  "name": "Veterans Park",
  "address": "1955 Elmerton Ave, Harrisburg, PA 17109, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/578d8ef8-9330-11ea-aa7b-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "kids",
   "family",
   "structure"
  ],
  "link": "https://maps.google.com/?cid=10922280778029489681",
  "source": "GoogleMaps",
  "reviews": [
   "We had a graduation/trunk party. Perfect spot. We were able to do some grilling. And we had access to the kitchenette. Plenty of room for the young people and lots of space for physical activity. Great park",
   "Clean and modern! The location is safe and open. There's a smaller children's play area right beside the big kids play space. Baseball field, soccer/football field and basketball courts.",
   "It so kid friendly.  It has two different parts to the play ground.  One side for smaller kids and the other for older. Two baseball fields, basketball court and tennis courts also. Nice Pavilion area. Great for family picnic...",
   "I like this park. There are some things on the bigger play structure that no longer work and/or are broken, which is upsetting, but my son has a great time. There is also a Cornhole/beanbag toss game behind the picnic pavilion, however, the beanbags are missing. My son (2 years old now) loves to run around so I take him to the baseball outfield sometimes when no one is playing baseball (there are two).",
   "My daughter plays softball & I love that my younger child can go play at the playground. It's clean & well maintained."
  ]
 },
 {
  "name": "AACA Museum",
  "address": "161 Museum Dr, Hershey, PA 17033, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/57df31b6-9330-11ea-9841-14b31f159f22.png",
  "tags": [
   "learn",
   "family",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7942961484890312558",
  "source": "GoogleMaps",
  "reviews": [
   "Took my grandson and had a great time! Very nostalgic seeing some of the cars I rode in as a child and drove as a young adult. The train room was a big hit with my grandson. Highly recommend a visit!",
   "Fun and informative. Great for a car buff in your life or to learn more about cars and other vehicles since their inception. It's a fun and well worth it time for the entire family.",
   "I've been waiting awhile to visit this museum. I was not disappointed during our visit yesterday. I know zip about cars - I felt the placards next to each vehicle were very informative and made me feel I could walk away with a liiiiittle bit more knowledge about these beautiful objects. Fantastic variety of automobiles that would interest so many.",
   "Wonderful staff full of knowledge! My boys and I really did enjoy ourselves. They especially liked being able to go in some of the busses. We will definitely be going back regularly as the theme and vehicles on display change a couple times a year.",
   "Worth your time!  Wife and I spent almost three hours looking at and reading about the cars, lots of documentation.  We were the last visitors to leave, a few stayed late in the gift shop for us to look around, prices are VERY reasonable!"
  ]
 },
 {
  "name": "Hersheypark",
  "address": "100 Hersheypark Dr, Hershey, PA 17033, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5825d7c6-9330-11ea-831d-14b31f159f22.png",
  "tags": [
   "tour",
   "kids",
   "kids",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11461405127196257636",
  "source": "GoogleMaps",
  "reviews": [
   "The sweetest place on earth. Here fun meets chocolates. Real attractions are Hershey trolley tour, thrilling coaster rides, Hershey garden with hundreds of butterflies from around the world, Zoo america with exotic animals, Milton S Hershey museum experience. Lovely dining restaurants. Kids too enjoyed a lot. Will visit again with kids soon.Ample of parking space. Certainly recommend to others.....",
   "There is some major changes happening this year, including an expanded entrance much closer to convince world, and a new roller coaster for thrill seekers. I will always return here my kids love it. The water park is awesome for a hot summer day. There is a large variety of things to do for every age!",
   "I absolutely love this place. Rides for every age. If you have a ride around the age of 5 and want to introduce roller coasters rides to them that go upside down / speed, look no more. This is a great start. I started with my child at age 4 here and now she's 9. My daughter loves roller coaster rides and becoming a thrill seeker.",
   "I had the best time ever at Hersheypark. Its Christmas lights alone are worth the trip.  It was an awesome experience to ride the train through the lights. The new Chocolate World is very fun and it has some free attractions. I will definitely come back. Tip: if you come after 6:30 p.m. you can reuse the same ticket next day (but you need to ask for).",
   "Hershey park has been a staple for central Pennsylvania. The park goes through phases of stagnant rides or outdated attractions but continues to update and keep people coming back. They have an abundance of rollercoasters and have added more sensory experiences. The park normally struggles with cleanliness so bring whatever you might need. Make sure you bring cash or was to get lockers or have someone watching all personal items. It can be an ideal location for opportunistic thieves but I have not personally had an issue. Food courts are crammed and can be a tedious task. The park used to have many food locations that made buying food seem less and much variety. Now there is one main hub that Continues to disappoint and and drain the pockets. Security is decent and they take it serious. Local law enforcement has many contingency plans in regards to park safety. Overall a great experience but with slow updates and conscience lacking the park definitely draws return visits less frequent."
  ]
 },
 {
  "name": "Friends of Wildwood Lake Nature Center, Inc.",
  "address": "100 Wildwood Way, Harrisburg, PA 17110, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/586ca4f6-9330-11ea-8166-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "free",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=14372005510743259567",
  "source": "GoogleMaps",
  "reviews": [
   "Nice place to vist and to take walk or run with family and friends it's free",
   "Love this place! So many beautiful things to see. It is so peaceful and relaxing there!",
   "People go there, because they have nothing better to do with themselves...",
   "Good place to walk and enjoy family.",
   "Very peaceful,  clean."
  ]
 },
 {
  "name": "ZooAmerica",
  "address": "201 Park Ave, Hershey, PA 17033, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/58b37234-9330-11ea-949b-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "family",
   "kids",
   "active",
   "walk",
   "family",
   "food",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=3974270009090143122",
  "source": "GoogleMaps",
  "reviews": [
   "The staff take very good care of the animals. They are healthy and their environments are clean. The staff are very friendly and knowledgeable. They always take time to answer questions. They also have a program that works with your phone to show you educational videos. It is a fun, family place to be.",
   "A good selection of animals to see for a little local Zoo. Especially being attached to a amusement park. The Zoo staff is very nice and do nice educational learnings at certain days and times during the week for kids. My daughters love to go there. Like normal Zoos there are some exhibits that make it hard to see the animals. The mountain lion enclosure especially is very hard, especially for kids. We have been there probably 15-20 times and have never seen but maybe a couple legs or tails ha gong out somewhere.",
   "Great little zoo. We went in November. Not crowded at all. Enjoyed seeing the bears, owls, wolves and the animals in the southwest exhibit (roadrunner was super cool). Perfect place to take a small child who has sensory issues. Was not overwhelming for him. We will definitely visit again.",
   "Nice outing for younger children on a late winter day.  Good tie in to a park or Chocolate World visit.  Not a vast array of animals, but enough to entertain a 2 year old.",
   "I appreciated the fact that apparently not many wild animals are inhabitants of North America, IF the zoo is an accurate depiction of this. Don't set aside a whole day to visit this zoo, it's more of an hour long visit.  Most action can be seen on a cool, cloudy, even rainy day: the bears might be active, you might see some action in the deer pen but overall there is not a ton to see, if you're used to the 'big' zoos. We, as in my family, hit the zoo often early in the morning, right at opening and are, many times, the only visitors. Walk around for an hour, enjoy the reptiles, desert, bears, otters, snowy owls, wolves and go back home.\n\nThe park is clean and well maintained as a part of Hershey Park. If you have the Hershey Park food plan or drink cup, you can fill it up in the zoo also."
  ]
 },
 {
  "name": "Hershey's Chocolate World",
  "address": "101 Chocolate World Way, Hershey, PA 17033, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/590b2f58-9330-11ea-aed2-14b31f159f22.png",
  "tags": [
   "food",
   "tour",
   "kids",
   "tour",
   "free",
   "tour",
   "free",
   "kids",
   "walk",
   "tour",
   "free"
  ],
  "link": "https://maps.google.com/?cid=6134741601256491514",
  "source": "GoogleMaps",
  "reviews": [
   "Hershey’s chocolate world is one of the most joyous experiences I’ve ever had. Chocolate is my favorite food, so this is like heaven. The best part was create your own candy bar, where, as the name suggests, you make a chocolate bar. The gift shop also has tons of cool trinkets that you can’t find anywhere else, such as Hershey themed legos, dolls, and toy cars. All in all, the whole place is really great.",
   "Fun stop to add to the travel books, great for adults and kids! Take a ride in a chocolate themed ride that bring you through a visually engaging guided tour of their chocolate factory inner workings. They have other interactive options like creating your own chocolate bar and plenty of different chocolate creations to purchase.",
   "We got there at opening on a Monday, and still ended up waiting an hour to see the 4D movie. Don’t bother with the movie, it was less movie, way too much audience participation, the story was horrible, not sure I agree with the message they were sending, and the effects under the seat hurt. The free tour was great, because we were there so early, we just walked right on, and I thought it was very fun and informative. We also did the make your own chocolate bar experience. Worth it. You get to customize a chocolate bar, and the packaging. You get to watch it be made, and have a fun souvenir to take home! Don’t bother with the candy in the gift shop, they don’t have anything you can’t get at your neighborhood Walmart or target for much cheaper (and I’m from the west coast), but otherwise a very fun gift shop. My friend had the new hot chocolate that is advertised as having a full melted chocolate bar in it. It doesn’t. Just a boat load of syrup. I also had the chocolate strawberries, they were great, and reasonably priced I thought.",
   "Interesting enough. The chocolate tour was short and sweet (pun intended) and free, so can’t really complain. The other experiences were kinda pricey, but if you have kids I think its worth a try. Also, very clean.",
   "Awesome place with a HUGE assortment of flavors of chocolate and other sweets that you can only buy on the East Coast. Fun, festive and colorful place! As you walk in, you are hit with the typical Hershey chocolate mouth that will immediately get you salivating. Pretty fair prices and amazing staff. \nLove the free tour and ride from the parking lot to the main attraction."
  ]
 },
 {
  "name": "Hershey Gardens",
  "address": "170 Hotel Rd, Hershey, PA 17033, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5957c92e-9330-11ea-ad72-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=13651760741087759728",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful garden with many different botanical species and new type of indoor and out door plants and flowers. Many beautiful different type of colorful butterflies. Very professional, courteous and friendly staff who greets visitors with smiles. It is such nice and wonderful place in Hershey.",
   "One can easily spend a couple hours here. The butterfly room is amazing! Volunteer staff seem to really know their plants and Hershey history. Well priced and kid friendly. Every season has something different to offer.",
   "Butterfly atrium is very nice. Christmas trees inside building were very nice as well. Grounds were spacious outside with many beautiful and mature trees. I will come back in the spring to enjoy the flowers outside.",
   "Very beautiful and well tended rose garden. There are also many other sub gardens included in this vast garden. This could take an entire day to see and smell and experience all that is here. We will definitely need another trip here. Extremely breathtaking!",
   "We visited today as part of the Hershey Park Season Pass add on plan. None of the staff had ever heard of such a plan but honored it anyway. The weather was cold and rainy so we stuck to the Butterfly Garden and the Christmas tree show case. How fun!\n\nThe staff were super friendly and very children oriented explaining things about the butterflies left and right. Showing the scorpions and other bugs in a very educational manner.  \n\nWe can't wait to go back to see the rest of the gardens when the weather warms up!"
  ]
 },
 {
  "name": "Toys On The Square",
  "address": "22 E Main St, Hummelstown, PA 17036, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/59a3ed5c-9330-11ea-8c8d-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=3520657373541532579",
  "source": "GoogleMaps",
  "reviews": [
   "Such a cool store. We are in town from Cleveland and saw an add for this place so we had to check it out. They have everything in here for all ages. If you are in town or driving by, I’d highly recommend stopping in.",
   "Absolutely love this place! The selection they have is impressive and prices have always seemed reasonable. Lots of different toys for all ages, a lot that I haven't seen anywhere else. Anytime I go in I always end up wandering around for like an hour just looking at all the cool stuff. Highly recommend!",
   "Very diverse selection of toys here. The best die cast car selection I've seen so far. Really great place to bring the kids.",
   "WoW amazing... needs multiple visits to successfully see everything!!",
   "Parking on street. Well maintained restrooms and clean store. Waaaay friendly staff. And great off the wall selection of toys.\n\nAs is almost always the case with my reviews parking hurts this business. Other than that support this place. Go in, play with the stuff, and buy something fer yourself, your kid, or even to donate. It will make you feel pretty damn good."
  ]
 },
 {
  "name": "Kohl Memorial Park",
  "address": "1050 Dowhower Rd, Harrisburg, PA 17111, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/59ebcc0a-9330-11ea-afc9-14b31f159f22.png",
  "tags": [
   "parks",
   "field"
  ],
  "link": "https://maps.google.com/?cid=12133312843377584136",
  "source": "GoogleMaps",
  "reviews": [
   "Nice, large park. People are always around when the weather is nice with large groups playing baseball, cricket, or volleyball. Dog park is fine. Large enough but not maintained real well. They rely on the community to take care of it. They refill bags and provide chairs which is nice.",
   "Love this place just because my fur baby can have fun in the dog park",
   "Nice dog park. Both small & large dog areas, plus adjacent baseball fields and playgrounds. \nWell kept & friendly atmosphere.",
   "This park is one of the top parks that I have ever been to. I definitely would recommend this park for this area!.",
   "Great spot to hang out with your dog and let him hang out with his doggo friends. Nicely maintained dog play areas with chairs for the hoomans to sitting socialize with the other owners. The park is really well maintained and equipped. Softball field, tennis courts, picnic areas and restrooms are also available."
  ]
 },
 {
  "name": "Lake Tobias Wildlife Park",
  "address": "760 Tobias Rd, Halifax, PA 17032, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5a35cd9a-9330-11ea-820d-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "tour",
   "family",
   "kids",
   "walking",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=11460364732215885172",
  "source": "GoogleMaps",
  "reviews": [
   "Good one for family with kids. Don't miss the ride located  at the back. You get to see almost all animals in this small park. Kids would love feeding the pet animals inside their cages. Good Park and it's worth Visiting.",
   "My family has enjoyed many trips to this amazing wildlife center. The animals are well cared for. The educational center is amazing and teaches everyone to respect animals. The best part is the Safari tour and seeing the beautiful animals up close.",
   "The kids had a blast!! Just enough walking that it doesn't tire out the kids. Loads of fun. We loved feeding the giraffes!",
   "My son and i love this place! Highly recommend for any age. We go atleast 5 or 6 times a year and always put a smile on my sons face",
   "A very nice \"travel at your own pace\" affordable zoo! I love that you can get so up close and personal. You're even allowed to bring in your own food and drinks which is almost unheard of anymore but helps families on a budget who still want to get out. We ate there this time though and the food was reasonably priced for a zoo and yummy."
  ]
 },
 {
  "name": "Escape Room",
  "address": "253 W Chocolate Ave, Hershey, PA 17033, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5a82dc5c-9330-11ea-884a-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=11468081080408718482",
  "source": "GoogleMaps",
  "reviews": [
   "Took my work group here.  We raced in two groups between two rooms.  Everyone had a great time.  My first experience doing an escape room and I really enjoyed it.  Would recommend for families as well.  Problem solving for all ages.  Encourages thinking outside the box and working together.  The Mill is close by if your looking for a nice dinner after!",
   "Second time we have done an escape room and it was just as much fun. They change the rooms - we did a magician / harry potter themed one previously and this time roaring 20s. The person running it / giving tips was lovely and helpful. We made it out with seconds to spare!",
   "What an annoying experience.  First time there with our work group and got stuck with a couple who brought a young kid.  First you need to have a age bracket and second the parents should have known better.  The woman took over.  Definitely not the way I wanted to spend an hour of my time!",
   "Not exactly an escape room because you don't have to escape. I'd call it a mystery room because you need to solve a mystery to win. Or a puzzle room or a lock room, but not an escape room. Overall it was a fun time with my work team and we all agree we'd go again!",
   "Loads of fun! Took my 12-year-old and her friends and they had a blast. (So did I.)"
  ]
 },
 {
  "name": "The Hershey Story Museum",
  "address": "63 W Chocolate Ave, Hershey, PA 17033, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5abf9748-9330-11ea-bbab-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "history",
   "tour",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=4012052452029262672",
  "source": "GoogleMaps",
  "reviews": [
   "First class museum! Wonderful staff who were all so friendly in all areas of the museum. Enjoyed a flight of hot chocolate which were delicious. Also got to make truffles which was fun and delicious, and the teachers were very friendly and informative, making the class a great experience. You get wooden chip which activate different kiosks throughout the museum, personalizing your experience. Would plan on at least a half day if not a full day to see it all if you're a slow mover who likes to read everything like my wife and I do. All in all we loved our visit here and would highly recommend!",
   "This Museum is a great history of the Hershey company and of the life of Milton Hershey. We spent 1.5 to 2 hours wandering through all the exhibits, reading, watching and learning. We enjoyed the interactive displays. We only purchased the Basic Museum experience. The building is clean and well kept. The workers were fun and knowledgeable. They made the experience much better for us all.",
   "Not a place you need to go to often but a very informative and well delivered history of Hershey and his chocolate. The cashier will hand over a coin which provides the interactive part of the tour. You activate the coin and put in your information. Then you enter the museum via a long and luxurious stairwell (or elevator) and you'll be supplied with a scavenger hunt paper which leads you through the story and ensures you don't miss a thing.\nExpect to be educated about the life and times of Milton Hershey, his machines, extravagant purchases, including a beautiful chandelier and a Titanic ticket and his establishing of the town of Hershey.\n\nWell done Hershey Entertainment!",
   "A Real nice... We didn't have time to finish the entire tour; so we will go back again.  I love that we could go at our own pace.  \nOh yeah, you have to try the chocolate covered bacon .... Yummy",
   "This very much was an enjoyable and enlightening experience. Such an interesting and inspiring story that is told about Milton.  Very engaging with some pretty high tech exhibits that will inform you of just about every aspect of the Hershey experience. Definitely worth a visit the next time you stop at Hershey!"
  ]
 },
 {
  "name": "Let's Pretend",
  "address": "320 W Main St, Middletown, PA 17057, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5b049508-9330-11ea-bf64-14b31f159f22.png",
  "tags": [
   "sampling",
   "kids",
   "kids",
   "music"
  ],
  "link": "https://maps.google.com/?cid=12336519388680791479",
  "source": "GoogleMaps",
  "reviews": [
   "This place is definitely worth a try for any child.   There are a variety of small themed rooms to play and interact in that will hopefully touch your child's imagination.   We took our 2 year old and he had a blast even though a few themes were geared for children above his age.   I feel this is an excellent alternative to a playground when the weather isn't cooperating or just to mix things up.   There is a price point per person, so you lose value if 2 adults bring 1 child.",
   "Idea has potential but this location fell short in execution IMO. Additionally, there are signs EVERYWHERE telling parents and kids what not to do. I attached a small sampling of them.\n\nIf your business caters to kids under 6 or so, they may not know that the groceries cannot possibly 'make sense' to be in the postal office. And if they do, who cares?! Well, the proprietor of this location thinks very differently.\n\nFor $7/ea (parents must pay too), it's an expensive place to play with donated toys that are limited to their pre-designed spots only.\n\nAlso noticed prices going up soon. It will be $10 each over two hours. Not that you'll stay that long to begin with...",
   "Super cute idea! Loved that I could let the kids run around and be as little or as much involved as I wanted. I will say that maybe some music would be nice, theres a stereo system that isn't used except to alert the time left for the party. Overall lots of fun though.",
   "This was so much fun for my daughter. She didn’t want to leave. I wish there was a membership but otherwise it was awesome.",
   "Great place for younger children to explore and pretend."
  ]
 },
 {
  "name": "Doll House Museum",
  "address": "2004 State St, Harrisburg, PA 17103, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5b5d1578-9330-11ea-801d-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=10587765373407991901",
  "source": "GoogleMaps",
  "reviews": [
   "This place is the coolest. Each room is it's own exhibit, carefully curated and crafted by the owner and her family to fit a specific theme. It's a must see if you enjoy kitsch and slightly spooky things. Also, the owner is a really nice lady who is happy to answer your questions.",
   "Owner, Suzy, is very nice and accommodating  !!",
   "I love visiting niche attractions, and this is definitely one!",
   "Great museum! Must see.  Brought my 2 year old niece and she loved it.  Spent over an hour, plenty to look at.  Awesome train set too! Check it out",
   "Not only is it a doll museum they do Tailoring there, they do clothes excellent and the prices are marvelous"
  ]
 },
 {
  "name": "Appalachian Trail - Hawk Rock Overlook",
  "address": "Appalachian Trail, Duncannon, PA 17020, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5baae78c-9330-11ea-a0cb-14b31f159f22.png",
  "tags": [
   "walking",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=4277766817238594847",
  "source": "GoogleMaps",
  "reviews": [
   "I don't know how everyone else arrived at this Sherman's Creek Rd location but it is private property. There is a single lane dirt road that passes by many homes with Private Property\" signs on there structures... Beautiful area though.",
   "Awesome view on the top. There are interesting places on the trail itself.it is not long or difficult . Easy to follow. There are some stone stairs in one spot. However, it almost continuously goes up . It is a good cardio exercise . My heart rate was 140 bpm. at times.",
   "Great place. The trail is rocky and narrow so you sometimes have to stop to let others pass. The steps are at times twice the height of a normal step, so I would suggest using a walking stick. The stick/cane will help go up and also help to slow your speed on the way down.\nTake a binocular if you have one. Yesterday Thursday Feb 20,2020 around 5 pm I saw a pair of bald eagles flying in the distance beyond Hawk's Rock. This was a treat and a lucky sighting. This is the 1st time I'm seen Bald Eagles here coming here for over 3 years. \nBe sure to take water with you, because the the steps will drain your energy and calories on the way up.",
   "My wife and I enjoyed hiking to Hawk Rock overlook this week.  The hike itself and the view at the top are totally worth it!  The trail is easy to follow and maintained very well; however, you do gain a lot of elevation, so the hike is moderately strenuous. There are many stone steps built into the mountain to help your climb.  Most of the hike is along a portion of the Appalachian Trail. We found the trail head easy to find - there's a huge sign that you can't miss. Would do this again for the opportunity to sit at the top, enjoy the breeze, and see the surrounding countryside!",
   "The place has a nice overlook, can be grounded so get there early. Lots of steps over 12 inches high."
  ]
 },
 {
  "name": "Adventure Sports In Hershey",
  "address": "3010 Elizabethtown Rd, Hershey, PA 17033, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5c0822fe-9330-11ea-b241-14b31f159f22.png",
  "tags": [
   "affordable",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9758755719454546659",
  "source": "GoogleMaps",
  "reviews": [
   "There were not many people here so we almost had the place to ourselves. We had so much fun. We passed by and seen the sign and decided to stop in. So glad we did. We will be back once the weather gets better.",
   "Weather was beautiful. No lines, no wait. Had a wonderful time with my grandson this morning!",
   "Loved it! And affordable prices",
   "Great clean fun for the whole family! Very clean and staff was very friendly and professional!! Very fun place!",
   "Its really a nice place for family to play games"
  ]
 },
 {
  "name": "The Butterfly Atrium at Hershey Gardens",
  "address": "170 Hotel Rd, Hershey, PA 17033, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5c629f50-9330-11ea-acbd-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=15549174671709018391",
  "source": "GoogleMaps",
  "reviews": [
   "Loved visiting here with my family.  My girls enjoyed seeing all the beautiful butterflies.  It was very relaxing and we would definitely come again.  We have visited a different butterfly place that had given out something like cotton swabs with nectar on it and my girls did say they wish they had that here.  Otherwise a wonderful experience.",
   "We love visiting The Butterfly Atrium in Hershey, Pa! There were over 50+ different, beautiful, butterfly species and magnificent plant life. We took many photos and were lucky enough to have two butterflies land on us! We also learned how the cocoa beans are harvested, which was extremely interesting.  We plan to go back this spring to visit the gardens outside.🦋",
   "Tons of butterflies from different regions. The man working was very informative. We learned a lot today and had a great time viewing all the butterfly’s. 🦋🐛",
   "The different varieties of butterflies are absolutely gorgeous! The employees are very nice. It’s VERY humid inside so make sure that if you have a coat, hang it up because you don’t want to be wearing it once you step inside.",
   "This was my first time here. We had a small picnic outside of the grounds where there were tables (no grills though).\n\nThere are public bathrooms and a small gift shop. There are WAY more plants and butterflies than my camera (phone) would have room for and the family would have time for.\n\nThere is a room where you are surrounded by butterflies and this was what we did after walking the grounds and seeing various displays.\n\nI am NOT one that knows a whole lot about the different kinds of plants...but I like seeing God's creation! And the pics never do justice as compared to the reality.\n\nIt did cost $40.50 for my wife/daughter/myself to gain entry to the grounds...but they truly enjoyed their time!\n\nMore than a few times some of the flying butterflies would land on people. Really cool for the kids!\n\n😇😎"
  ]
 },
 {
  "name": "White Rocks Trail",
  "address": "1387 Kuhn Rd, Boiling Springs, PA 17007, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5cb5054a-9330-11ea-929d-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=5623073284110572870",
  "source": "GoogleMaps",
  "reviews": [
   "Different terrains, good hiking, beautiful views on high rocks! Brought my teen girls for a nice hike and it had some challenging areas that mad eit interesting.  Came across a snake hidden inside crack of rocks when looking out at the views...immediately made escape so no introductions were made. 😊",
   "Climbing on the rocks while hiking is beautiful and cool. It can be a bit if a challenging to climbed but so much fun. Good trail to takes your dogs on, mine loved it. I can't wait to go again.",
   "Very nicely marked trail. Beautiful scenery. Unfortunately some people can't follow rules. Evidence of people making fires which is not allowed. Broken beer bottles in 1 small area. But overall a great place to hike. It has a good climb. The path is very rocky and uneven so wear shoes to accommodate.",
   "A fairly short and relatively intense out and back hike. It took me with a dog about an hour each way. -It is extremely rocky, from small, almost gravel stones, to ankle twisting mind fields, to scrambling boulders. \n- the only steep section is getting up to the ridge, the ridge itself, though rocky is fairly level with some good scrambling.",
   "This trail is so much fun! I have totally different experiences every time I revisit it."
  ]
 },
 {
  "name": "U.S. Army Heritage and Education Center",
  "address": "950 Soldiers Dr, Carlisle, PA 17013, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5d0f5a9c-9330-11ea-8e18-14b31f159f22.png",
  "tags": [
   "history",
   "walk",
   "walk",
   "learn",
   "family",
   "tour",
   "history",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=12277628987031602420",
  "source": "GoogleMaps",
  "reviews": [
   "This is an amazing museum! The grounds themselves are so awesome! They've got tracked vehicles, artillery pieces, replicas of old Army buildings/barracks, and even a trench! My favorite was the pill box, that was pretty eye opening. Inside you have a ridiculously detailed museum, truly incredible. Great place for vets, history buffs and civies alike.",
   "We just did the outdoor trail and most of the buildings were locked.  Not sure why, I think they were getting ready for some event.  It was an interesting place and a nice walk.  The Trench exhibit was quite interesting.  It just would have been better if we had been able to get inside some of the exhibits.",
   "A wonderful place to visit with family of all ages. The interactive displays were enjoyed by all. Very educational and the trail is a nice walk with beautifully displayed military hardware! An excellent place to visit, explore and learn about our great Army!",
   "As a Iraq war vet, it was nice to tour this place!  I'm huge into military history and this was great!  I will be coming back for sure, I really enjoyed it!",
   "I am Glad I found this Place! Lots of History and terrific Displays! I recommend the walking trails out back with the different military objects."
  ]
 },
 {
  "name": "Cullari Vineyards & Winerys",
  "address": "1251 E Chocolate Ave, Hershey, PA 17033, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5d665470-9330-11ea-9c3a-14b31f159f22.png",
  "tags": [
   "tasting",
   "delicious",
   "knowledgeable",
   "tasting",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=14690658191397191894",
  "source": "GoogleMaps",
  "reviews": [
   "I’ve known about Cullari for a while as they’re on of my mom’s favorite wineries, but I had yet to venture to their tasting room. The tasting was not rushed, completely reasonably priced, and you keep the glass for no extra charge. The staff was friendly and knew a lot about the wines. It was the only tasting that we have been to where we were able to sit down, have snacks, and actually enjoy the wines without being rushed to the next taste. The two women working the shop when we went were great, and we stayed much longer than anticipated because we just enjoyed their company so much. My wife bought a bottle of the Pink Orchid, but we easily could have purchased a bottle of each.",
   "We visited on Sunday 2/10 and enjoyed great wine served by a very friendly and knowledgeable hostess! Cocoa Nostra wine was pleasantly delicious. Also took a bottle home of the old world red, great table wine. Cute and cozy atmosphere.",
   "Very friendly. Wine was great. Nice variety clerk was entertaining ❤️",
   "Wonderful experience. The gentleman was so helpful and fun to talk with. The ambiance is very nice and comfortable. A nice place to sit and relax with a wine tasting.",
   "Jenna and Larry made this visit a great one for me. Very personable and knowledgeable when it comes to wine and food/snack pairing. The wines are great and reasonably priced. Coco Nostro is my favorite. Pinot Noir and Sweet Chambourcin were smooth and fruity!"
  ]
 },
 {
  "name": "Fort Hunter Mansion & Park",
  "address": "100 Fort Hunter Rd, Harrisburg, PA 17110, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5db3d88a-9330-11ea-b454-14b31f159f22.png",
  "tags": [
   "music"
  ],
  "link": "https://maps.google.com/?cid=3914138213516478929",
  "source": "GoogleMaps",
  "reviews": [
   "Really nice Park and clean restrooms",
   "Beautiful park.",
   "Cool place to visit ",
   "One of the best music festivals Harrisburg had ever had! Vanessa Collier was amazing!",
   "Awesome!"
  ]
 },
 {
  "name": "Cocoa Castle",
  "address": "Hershey, PA 17033, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5e0b6eac-9330-11ea-b137-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=3454175738786319204",
  "source": "GoogleMaps",
  "reviews": [
   "Kids love this place.  Not enough shade. Benches get extremely hot.",
   "If you visit Hershey park this park Is worth looking up.  It is a huge well kept park and tons of play equipment for the kids.  And room for the parents to relax and watch over the kids while the kids run off some energy !!  Check it out.  Plenty of parking too!",
   "Our grandsons, ages 4 and 10, both loved this park. A lot of structures to climb - ladders, steps and ramps - slides and other tactile activities along with swings and room to just run. This is a Derry Twp. (Hershey, PA) park and is well maintained.",
   "A lot of cool playground equipment I've never seen in other playgrounds. There is good parking to be had and you can walk from here to a lot of places in town.",
   "Very clean safe and tons of playground activities! Tons of swings as well!"
  ]
 },
 {
  "name": "Gifford Pinchot State Park",
  "address": "2200 Rosstown Rd, Lewisberry, PA 17339, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5e59dcca-9330-11ea-bd92-14b31f159f22.png",
  "tags": [
   "nature"
  ],
  "link": "https://maps.google.com/?cid=13339053804080242659",
  "source": "GoogleMaps",
  "reviews": [
   "Love going here; it's like our second home! When you have an awesomely trained dog, this place gives you so much freedom to just explore! Sadie and I have our favorite rock that we love to sit on and listen to the water. So relaxing! Great off-leash space ❤️",
   "Trails? What trails? These should be referred to as streams and bogs with the occasional dry section. I have been here in every season and there's never a full trail. With so little distance you'd think boardwalks would be feasible. The appalachian trail is better maintained by VOLUNTEERS.",
   "I love taking my children to pinchot! Or alone to explore the beautiful trails.\nPinchot is also a great place for birthday parties!! Lakeside cookout with playground , sandpit & swimming during summer months. \nI do wish the nature learning center was still open or they’d have educational programs for children.\nI’ve never camped here so I can’t rate the campgrounds.",
   "Amazing state park! Hiking, biking, swimming, picnicking, paddling, hunting, camping...even frisbee golf! Great beach on the lake, concessions, and a huge ammount of parking. I can't remember a prettier place to spend a day.",
   "Lovely local park with swimming, boating, fishing and a great frisbee golf course. The snack bar has good Philly cheese streaks. We'll worth a day, or a weekend. They have cabins."
  ]
 },
 {
  "name": "Pennsylvania Farm Show Complex & Expo Center",
  "address": "2300 N Cameron St, Harrisburg, PA 17110, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5e9e871a-9330-11ea-bad5-14b31f159f22.png",
  "tags": [
   "organized",
   "food",
   "kids",
   "history",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15008329415503372908",
  "source": "GoogleMaps",
  "reviews": [
   "As usual, events held at the Farm Show Complex are well organized. This year, I have been to the Farm Show and now the Harrisburg Auto Show. Plenty of parking is available, though on well attended events off-site parking is added with shuttle service. Today I was able to park next to the complex. The complex has restrooms and food stands through out the building. Parking charges are high at times, but the proceeds go to PA agriculture funds and outreach. Definitely a place to attend an event of your liking.",
   "Pennsylvania's finest farm show.  I highly recommend going and enjoying one of PA staple shows.  Amazing people and food. Animals are always gentle and safe for kids of all ages. Lots of history behind this once a year venue.\n\nI highly recommend being there when they open.  Plenty of parking across the street,  you'll also beat the crowds and enjoy the animals the best.  When early lunch comes, the food court will be still manageable and plenty room to sit or stand.\n\nEnjoy...",
   "I definitely recommend wearing comfortable shoes - there is so much to see! Love seeing all the farm animals. You get an appreciation for all the work that goes into farming. Make sure to stop and watch some demonstrations and presentations at the stages and arenas. The more time you allow the better.",
   "Very good got there this morning 45 minutes before it opened 9 it open we got in. No problem at all walked around But as time goes by the vendors change. different ones that was a lot of AR aftermarket accessories there a whole lot.... Ammunition and shell prices we're in line some of the quantity discounts were pretty good.. I thought the food was just a little high but that's vendors I understand and not they are open everyday like McDonald's to got to make it in three day five days ...",
   "Great location for any size trade show or expo. Easy access parking and plenty of local hotels and restaurants to choose from. Access to I-81 is super easy. Definitely a venue to come back to and one that you would hope to be used for your next event or show."
  ]
 },
 {
  "name": "Rockville Bridge",
  "address": "800 S Main St, Marysville, PA 17053, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5ee50662-9330-11ea-ac79-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=4407322506042508253",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful scenery here. I enjoy seeing trains crossing this old bridge!",
   "Built in 1902, to accommodate 4 tracks, it is the third bridge to be built at this location.  As pointed out, it is the longest continuous stone arch bridge in the world.  Just missed a N&S freight crossing to the west side.",
   "Over 100 trains a day and over a hundred years old.",
   "An amazing experience, as it is heaven for the train fan. The bridge gets hundreds of trains every week, with high rates of traffic. This is probably best watched from Bridgeview Bed & Breakfast, made specifically for the trainwatching purpose. I give this a five-star, as it is AMAZING!",
   "Great views for amateur and professional photographers alike."
  ]
 },
 {
  "name": "Oakes Museum of Natural History",
  "address": "1 College Avenue Messiah College, Mechanicsburg, PA 17055, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5f35ea58-9330-11ea-90fe-14b31f159f22.png",
  "tags": [
   "kids",
   "learn",
   "family"
  ],
  "link": "https://maps.google.com/?cid=6112436899183000486",
  "source": "GoogleMaps",
  "reviews": [
   "This is an impressive museum for the small space. My favorite section is the one with the full-sized elephant and giraffe, but my 3 year old loves the skunk! It's a must-see during homecoming when students offer crafts, storytimes, and tours of the prep room with snake holding. Could spend an hour in the little kids room with microscopes, books, and crafts. (Full disclosure: proud Messiah College alum here.)",
   "Great little local museum. Loved the cards at each display identifying the animals. Nice place for younger childer to learn.",
   "Fun place to visit with my son's 5th grade class. The animals were amazing !",
   "Very well laid out and informative.  Nice saturday afternoon!!",
   "Awesome experience and awesome prices in gift shop. Fun outing for the family."
  ]
 },
 {
  "name": "Miniature Statue of Liberty",
  "address": "US-22, Dauphin, PA 17018, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5f790e08-9330-11ea-b075-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=3269645473233933777",
  "source": "GoogleMaps",
  "reviews": [
   "A great trip if you have experience kayaking and can navigate through some rapids. Kind of tough to observe and get a pic of the statue up close unless you land and get out due to the very rapid water and lots of rocks which make up this part of the river. If you go, go with a group.",
   "Its beautiful but there's no place to park your car and admire it",
   "Very fun section of the Susquehanna for whitewater kayaking. You can access this area from downstream on the west shore near Marysville. It's a short paddle upstream where you can spend all day playing in eddies and surfing some waves. Then paddle back down to the takeout. The sunset from here is spectacular.",
   "Very impressive statue in the midst of a gorgeous river!",
   "It was hard to take pictures.  No off the road parking! Still made it fun to do!"
  ]
 },
 {
  "name": "Fort Hunter Conservancy",
  "address": "480 Camp Reiley Rd, Harrisburg, PA 17112, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5fd055f6-9330-11ea-b2ad-14b31f159f22.png",
  "tags": [
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=11898954226610909828",
  "source": "GoogleMaps",
  "reviews": [
   "Nice park / trail system. As a somewhat experienced hiker, I will say the paths weren't marked clearly, but that wasnt a huge problem. There was a lot of overgrowth, and fallen trees. Still a fun time, great rewarding Vista and super fun hike / rock scramble.",
   "Pros: maybe the best view in the Harrisburg area- with a swing on the power line at the very top!(and a boat too but hey whatever you think you need)\nCons: getting to the top is horribly marked and overgrown. Because much of it is below power lines  the trail is full of loose stones and it’s very easy to lose your footing and fall into the thorny brush because it is not well maintained.",
   "This was a mildly hard hike, that makes you want to stop and go back, but then you keep going. The peek is gorgeous and I would 100percent go again.",
   "Awesome hiden gem in the Harrisburg area. Great views. However, the trail is not well maintained and get really overgrown during the summer months.",
   "When you get to the top of the hill under the powerline,  this is one of the best views in Harrisburg"
  ]
 },
 {
  "name": "The Centennial Barn",
  "address": "5300 N Front St, Harrisburg, PA 17110, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/602a6a76-9330-11ea-aab6-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18242754818398473013",
  "source": "GoogleMaps",
  "reviews": [
   "Always an education and the staff is knowledgeable and friendly",
   "Nice historical building in Fort Hunter park",
   "Good food and service!",
   "Never been here before!",
   "very nice place to visit"
  ]
 },
 {
  "name": "Turkey Hill Experience",
  "address": "301 Linden St, Columbia, PA 17512, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6082ff10-9330-11ea-81ef-14b31f159f22.png",
  "tags": [
   "kids",
   "eat",
   "kids",
   "free",
   "eat",
   "tour",
   "tasting",
   "free",
   "tasting",
   "kids",
   "free",
   "tasting",
   "family"
  ],
  "link": "https://maps.google.com/?cid=5971145307480075369",
  "source": "GoogleMaps",
  "reviews": [
   "Had a great time at the ice cream taste lab. Spend the extra money to include this in your ticket as it’s both fun to create your own ice cream and rewarding to eat a pint of your own creation. Both kids and adults were enjoying it. \n\nThe experience upstairs was cute, but mostly designed for kids. Happy we had a chance to see it and taste some of the label’s current flavours. We had fun designing packaging for our ice cream flavour.",
   "Very cute experience with my 5 year old.  We explored the place for 4 hours and did the ice cream making class.  The plain ice cream they gave was amazing.  But it was fun to add in the toppings.   The class was informative as well.  Afterwards, we explored the play area, free ice tea area, awesome slide, free popcorn and more free ice cream.  \n\nThe five year old didn’t want to leave but we eventually did to go eat a late lunch.  \n\nI’d recommend to a friend with kids 4-10.",
   "It was a fun afternoon to spend with friends on a rainy day. \nWe enjoyed the museum, but were surprised to find how child-focused it was. There's nothing wrong with that, but it wasn't quite what we expected. \nWe participated in the tasting lab to create our own ice cream flavor which we enjoyed a lot. Tour samples are generous.",
   "Such a fun place.  Visited on our way down from Hershey and so glad we got to visitl!  Loved everything about this place.  We particularly enjoyed recording TV commercials and tasting free samples (ice cream and drinks).  It's great for all ages.  Highly recommended!  Easy parking, friendly staff, and clean space.",
   "What an amazing place! Brought my family kids ages 1-4 and they had a blast. We were there over 4 hours having fun. Unlimited ice cream tasting and unlimited lemonade and tea tasting for free no additional package needed. Staff great"
  ]
 },
 {
  "name": "Hershey Triple Tower",
  "address": "100 Hersheypark Dr, Hershey, PA 17033, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/60d935be-9330-11ea-a6e5-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=8238024175226842314",
  "source": "GoogleMaps",
  "reviews": [
   "Very thrilling! My son and I had never been on a tower of this magnitude and really had no idea what to expect! We went on the Reese's tower, in the middle. This tower is very thrilling, you are not even expecting moving and wham, you are launched super fast to the top of the tower, fly out of your seat and before you can comprehend what is happening you go back down a short way. On the way back up the second time, my son had his head in the direction of the over-shoulder harness, and when we made it to the top and got the air time, he got a bloody nose from smashing his head into the harness. He still loved it though, it was a bit too intense for me though. Great fun anyways, and a must experience thrill!",
   "Drop in on the thrills and fun at Hershey Triple Tower, the first choose-your-thrill triple tower in the United States. \n\nHershey's Tower \nStanding at 189 feet high, our tallest drop tower features two gravity-defying experiences, SPACE SHOT & TURBO DROP, which rockets riders to the top before blasting back to the bottom at 45 miles per hour! \n\nReese's Tower \nStanding at 131 feet high, kick it up a notch with two thrilling cycles of positive and negative G forces on our second tallest drop tower! \n\nHershey's Kisses Tower \nStanding at 80 feet high, warm up with two exhilarating cycles of positive and negative G forces on our thrilling drop tower!",
   "A nice little piece of the overall park. A themed triple set of the same ride that offers three levels of \"challenge\" to anyone who's up for it. Visually the whole set up is pretty striking as well. Kudos to whoever came up with the idea.",
   "Pretty long lines today, but it's a holiday weekend and kinda expected. Great weather for a trip to Hershey!",
   "Fun but not worth the wait! Line times were incorrectly posted. Only one tower open and empty seats on every ride."
  ]
 },
 {
  "name": "Little Buffalo State Park",
  "address": "1579 State Park Rd, Newport, PA 17074, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/611c1354-9330-11ea-ab14-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "kids",
   "walk",
   "family",
   "nature",
   "family"
  ],
  "link": "https://maps.google.com/?cid=16579812443474077247",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place. Great place to take the whole family for a day retreat. Has a nice pool and one for the kiddos, as well. There is a big long lake that you can rent kayaks or two person paddle boats to row on. There is also a food stand at the pool area. The scenery is also amazing. It's in the mountains. Highly recommend. Prices are decent, too.",
   "My kids love the pool. We live almost an hour away and are driving up at least every other weekend when it's open. \nWe'd pack up lunch and enough snacks to last the day. Sometimes a small dinner. There's plenty of grills and space to sit down and picnic.",
   "Beautiful place to walk, fish boat or just sit and look out over the beautiful lake. My family appreciates the staff and all their hard work at keeping it that way. Big plus there are always things to do at the lake. Arts festival, apple harvest, and several opportunities to explore nature and the creatures and their habitat hosted by the Rangers. My family loves Little Buffalo State Park",
   "Took my grandson for a homeschool day seminar on mammals. Very informative and fun. Great job!",
   "Went in January and hiked around the lake through the woods.  Saw around 50 ducks,  in the middle of the lakes, divers from up North.  \nLots of facilities mostly closed for winter.  Looks like a great place for family camping and outings in the summer."
  ]
 },
 {
  "name": "Cousler Park",
  "address": "1060 Church Rd, York, PA 17404, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/617334c6-9330-11ea-bc02-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "walking",
   "family",
   "kids",
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=13691048617288067336",
  "source": "GoogleMaps",
  "reviews": [
   "This park is beautiful and well kept. There are endless opportunities for enjoyment. There are several types of game courts, fields, a walking path, a bouldering rock, older kids' and younger kids' playground. Parking is abundant.\n\nOne uncommon thing I enjoy is all of the memorial plaques. It always reminds me to be grateful for everyone I love and all of the family. \n\nLots of other friendly dogs walking here too.",
   "Awesome park! Great area for littles especially with a small misting sprinkler system in the warmer months. Huge layout with several different areas including a large pond and stage for events. Clean to boot. Great family place !",
   "We have always loved this park, my mom always took us here when I was young and we walked the trails and feed the geese. Recently I took my kids here for the Halloween festival they through and they had so much fun. The park is nice for kids of all ages, the pond is beautiful to see and all the geese around it in warmer months. Also a good place to go hunting for painted rocks that people make and leave around for you to find and rehide or hide your own, an activity my daughter and I do.",
   "Best park in the area for littles, especially on hot summer days. The little sprinkler system in the fenced off Park area coupled with some spots with overhead shade makes for a good time to relax and watch the kids play, or join in if you prefer. \nThe rest of the park is HUGE with lots to offer from 🎾, to 🏀 and a great walking/biking trail. There's a large pond, a stage, a rock climbing and rope climbing portion and often, lots of dogs to meet along the way!\nWe LOVE this park!",
   "Love this park I can get a good walk with my dogs."
  ]
 },
 {
  "name": "John C. Rudy County Park",
  "address": "400 Mundis Race Rd, York, PA 17406, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/61b8fd68-9330-11ea-b62d-14b31f159f22.png",
  "tags": [
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=724870258067042349",
  "source": "GoogleMaps",
  "reviews": [
   "They have a great dog park for small and large dogs. Wish the lot near the dog park was bigger though! Overflow parking not far away.",
   "Love all the space and my pit Lexi was so happy to run around and play with all the other dogs",
   "Its so much fun its not just what the pic shows there is a other set with bigger slides",
   "Amazing dog park. A wide open fenced in area. My puppy always comes home tired and happy from her visit",
   "Our family rented a pavilion here today. It was a very nice place. There is a playground for children, horseshoe pits,walking trails and within walking distance of a major walking trail. There was also a place to grill using charcoal. Bathroom facilities are wheelchair accessible as are the pavilions. Very lovely day. Pavilions are for rent but you must reserve them in advance or take a chance that you can use a pavilion not reserved."
  ]
 },
 {
  "name": "Pastorante",
  "address": "1012 N 3rd St, Harrisburg, PA 17109, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/620aa00c-9330-11ea-bd33-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "food",
   "delicious",
   "drink",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=1745152678905296084",
  "source": "GoogleMaps",
  "reviews": [
   "I visited today with my friend and we both wanted to order the chicken bulgogi. Our waitress was nice to start, and she recommended we order the lunch special which included a side salad. The lunch special was $11 with the salad included where as the dinner portion was $13, so my friend and I both agreed on the lunch special. The food was very good and we enjoyed our meal, but when the waitress brought the checks by, we were both charged the dinner portion ($13) and an extra $3.75 for the side salad. I told the waitress it was a mistake since she had specifically recommended the lunch special which included the salad. She apologized and admitted it was her mistake for not letting us know that we would be charged extra but insisted the manager said there’s nothing they could do. The manager came over and was incredibly rude. There was a bit back and forth between us with me trying to explain the issue. She finally stopped pushing it and grabbed the checks, discounted them, and then brought them back and cleared our table in a forceful way without saying a word. Her demeanor was very unprofessional and caused us to feel awkward and unwelcome. A good business would accommodate for their customers, especially when a mistake was done on their part. I’m glad they discounted the check, and the food was great, but the service needs a bit of work.",
   "Nice, Small restaurant. \n\nPastas are all fresh & good except lobster crab mac & cheese. Macaroni was just a bit undercooked.\n\nWe had crab guacamole as appetizer,\n oxtail ragu pasta, squid ink pasta with shrimp, and lobster crab mac & cheese as main dishes, \nand Tiramisu and pistachio Gelato as dessert. \n\nThe only complaint was that sauce was a little too salty on all the pasta dishes.  Otherwise they all had very nice flavor.",
   "I 💓💓💓 everything about this restaurant❗  The food is exceptionally yummy & fresh.  The staff is friendly, and intentional about assuring you have a good dining experience and the prices are reasonable.  It's a small place in a cute walkable neighborhood.  It's unique & definitely NOT \"like every other restaurant.\"",
   "Ordered the seafood mac along w lasagna. Order came out on time lasagna had creamy smooth ricotta and seafood mac had lots of crab n shrimp very cheesy a tid bit pricey but def worth the trip thanks guys for staying open",
   "Delicious handmade pasta, great sauce and meatballs, super friendly service. The tiramisu was great, too! Ordered two cappuccinos to drink with dessert. Next time, we'll just order one, and share it, as the cappuccinos were so huge my wife could only drink half. Will definitely come again. Next time, we'll bring a bottle of red wine to drink with dinner. We're so grateful to live within easy walking distance of this amazing restaurant!"
  ]
 },
 {
  "name": "Mangia Qui",
  "address": "272 North St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6251bb5c-9330-11ea-a44c-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4632264904864951227",
  "source": "GoogleMaps",
  "reviews": [
   "Service started out a little slow, but the food was incredible.  Just an overall amazing dining experience.  I'm still thinking about the   linguine and clams.  And, the steak was wonderful.  The roasted beet salad was great, so were the cocktails. Five stars.",
   "We loved this place. We definitely want to visit again. The lamb dish and NY steak dish were great. The service was phenomenal by everyone that served us. Thank you!",
   "This place is phenomenal! From our drinks, to our appetizers, to our entrees. Everything was world class. This will be a new staple. Such a great ambiance as well. Seriously just go here immediately! You won't be disappointed!",
   "For $32 I needed a steak knife for my lobster tail. However, the linguini was flavorful and delicate and our Tuscano rib eye was beautiful",
   "Top Notch!  First time dining here and this will be a go to for me.  Service and the dining experience matched the quality of the food perfectly."
  ]
 },
 {
  "name": "Dodge City Steakhouse",
  "address": "1037 Paxton St #1645, Harrisburg, PA 17104, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/62957b52-9330-11ea-8855-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "creative",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=1733624672261042571",
  "source": "GoogleMaps",
  "reviews": [
   "Always a great dinner! Service is not super fast but I wouldn't expect it to be. Great specials--don't miss it for the Outdoors Show and Restaurant Weeks. I've never had room for dessert while there, but I've taken home their strawberry shortcake and it is packaged perfectly to enjoy at home.",
   "We just had a wonderful Easter takeout dinner from Dodge City. The portions were great and the food was very good.  We will each get another meal out of it.  It included a salad, full course main meal, rolls with cinnamon butter and dessert. We couldn’t have been happier and the price was reasonable.  And they made the pickup very easy with virtually no contact with another person. Well done Dodge City!",
   "Don't be shallow and judge this book by its cover. Looks shabby and run down on the outside...And frankly, on the interior as well. But the food is amazing. The most tender steak in memory...mozzarella sticks that were actually breaded and fried from real mozzarella. The crab encrusted haddock was perfect with handcut fries from fresh potatoes. The wait staff was attentive and efficient, worthy of a healthy tip. Looking forward to being in the area again for another terrific meal.",
   "Great place for lunch or dinner. In between visits I forget how reasonable their pricing is. I usually get the prime rib sandwich and it is so tender. For only $11 it includes fries (which are fabulous!). The service is prompt and efficient. I've tried their french onion soup - also wonderful.",
   "I was here with a group. I myself did not get steak. Those who did said it was very good. I had the bison tots, which were delicious. The wedge salad was good but not super memorable. The Pork belly mac and cheese was not bad but was underwhelming. Maybe a more creative mix of cheese or a more creative presentation would help that. Maybe a few crispy pork belly pieces on top to suggest the soft pieces that lie beneath and some garnish would go a long way. I had the burger which was generous for the price and the bun, crispy onions, and fries were delicious. My big issue was that I ordered it medium well, and in my opinion it was medium rare at best. If I get sick it will be my fault for not sending it back, I just hate being “that guy”. My first experience was a solid 4 stars."
  ]
 },
 {
  "name": "Home 231",
  "address": "231 North St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/62d93b74-9330-11ea-b076-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17473049666070964359",
  "source": "GoogleMaps",
  "reviews": [
   "Home 231 is my favorite sit down dining experience in the city of harrisburg. I love how their menu rotates seasonally and how fresh the local ingredients are. The staff is always friendly and offers some of the best service around. They have parking in a few places along the street they are located. Even better than all that though are the phenomenal choices for brunch. Home 231 has consistently been my favorite brunch spot for years, close to a decade now. A true gem in this great city. I’m so thankful to have found this restaurant and look forward to supporting a great local spot for many years to come!",
   "Food was excellent. Service was a little spotty. Our server was pleasant but seemed to forget about us several times, including never bringing the 2nd cocktail that I ordered. Our food took awhile to show up. Maybe because we were outside on the patio? Overall, just need a little more attention to detail.",
   "Went for Sunday brunch and was not disappointed! You need a reservation to get in, so we ended up at the bar but they were still kind and attentive to us there. Really enjoyed the bloody Mary! Had chicken and waffles and the smoked salmon with poached eggs and both were delicious. Definitely check them out for brunch!",
   "Good food, wine & service! Parking is VERY CHALLENGING in this area of town!  We enjoyed the apps: General Tso's Cauliflower (EXCELLENT!), Roasted Veg Board (which is COLD by the way, not hot!!! Also be aware if you share, there won't be enough bread on the board. Asking for additional bread is $1.00 more. At $13 for the board, additional bread if needed shouldn't be an up charge. Just my opinion.) & fish stew as a soup option (which was very spicy to my palate & I sent it back, unusual for me). Dinner: We shared the cornbread which tasted great but it took a considerable amount of  time for the honey butter to come out so it didn't melt. I had the short rib w/grits (Amazing!!!), my husband had the rabbit which had a lot of bones & was very messy to cut the way it was served in the bowl with the other ingredients but he said it tasted good. For dessert, he had the 3 flavors of ice cream which was great & I had the apple cobbler...just ok & was cool in the center, not warm. Perhaps if we went on a weekday & not a busy Friday, the food would have been a bit better as expected by all the previous reviews. Don't get me wrong, it was good but for $165 (with tip) it should have been perfect. I don't mind spending money for great food that's worth it. We'll give it another try on a week night to see if the food is as good as previous Yelp & Google reviews. Service was excellent & we felt well attended to (Service gets 5 stars).",
   "Cozy brunch spot. Great Bloody Maria. Good food. Friendly service. A few more vegetarian options would be awesome, but I wasn't without some nice choices."
  ]
 },
 {
  "name": "Cafe Fresco Center City",
  "address": "215 N 2nd St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6324274c-9330-11ea-bdad-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "eat",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=16428622140230322839",
  "source": "GoogleMaps",
  "reviews": [
   "Definitely a solid choice for brunch in downtown Harrisburg overall. The drinks get a little pricy but the food is reasonable for the level of quality and flavor. I had the Oyster Rockefeller Benedict which was I have to say was one of the best around. \n\nIt would have been a 5 star review for the food overall, however being that has been my second time at Cafe Fresco and each time my food took 45 minutes to an hour and 15 minutes to come out. \n\nSpeed it up and it's a 5 star restaurant!",
   "I really enjoy eating lunch at this location. The cashier was friendly the options are plentiful and I don’t have to wait long for my food to come out. Pleasantly surprised",
   "We dropped by for the Saturday Brunch. The food was uniformly excellent. My wife had a wonderful omelet, my breakfast baguette was fantastic. Our grandkid had pancakes with bananas and bourbon caramel sauce.  The service should have been better. The woman was nice and friendly, but oh so slow. We spent an hour an a half in the restaurant. It took ages to get the check because she spent that long gabbing with a coworker. So if you are in Harrisburg on Saturday, you want some really good food and a lot of time to kill, this is the place to go.",
   "This is a great place to eat, when you are Downtown, in Harrisburg. What makes it great, is the food and cocktails. The atmosphere and the staff professionalism is excellent.",
   "Everything is outstanding.  Don't miss the roasted to perfection crispy brussel sprouts and my entree:  Sriracha Panko Salmon with black rice risotto, yuzo-dill creme fraiche & asparagus... DELICIOUS!"
  ]
 },
 {
  "name": "El Sol Mexican Restaurant",
  "address": "18 S 3rd St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/63664f28-9330-11ea-af6a-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16194108493183183515",
  "source": "GoogleMaps",
  "reviews": [
   "This place was awesome. Their brunch menu is pretty good, with huge portions and perfectly priced. Plenty of vegetarian choices as well. The service was fantastic - great with kids and a big group. The build your own Bloody Mary station was a nice touch!",
   "We were traveling to see family for the holidays and got to talking with our flights captain before we boarded and asked if he had any recommendations for dining in Harrisburg and he recommended El Sol.\n\nNice atmosphere and decor, we felt like we were dining in a restaurant in Mexico. Come to find out the owner and head chef is from Mexico and he takes an incredible amount of pride in his place. You can tell that but the decor and more specifically the food.\n\nYou definitely won't leave hungry as they have huge portions and everything we ordered was served hot and tasty. We decided to sit in the bar and the bartender Mark was awesome. Great recommendations for the cocktails we had and he didn't skimp on the alcohol. \n\nDefinitely not expensive either like you would expect for a more upscale Mexican restaurant.  Would definitely recommend this place to anyone who is interested in having some great food and great service.\n\nSafe Travels! SPGDL_Traveler",
   "I understand the pressure but this restaurant was unorganized with orders. As people were in and out I waited two hours for an order I never received. I also understand due to the epidemic the orders are coming in fast. But as a business you should respond to orders as received and continue to update the customers rather then tell them you don’t know where their order is. Orders were made through the phone and they had memory of taking the order. Horrible place with horrible employees, please find employees who are dedicated instead of being frustrated every time a customer comes in.",
   "It's hard to find parking. But wow! The food was so freaking good! Best Mexican food I have ever had. The waiters are super kind and very welcoming. The fried ice cream is AMAZING as well!!!!!",
   "Very Friendly Staff and Manager !!!\nI Recommend this place.\nA couple things need some changes and I'm glad that the Manager was Open minded to get the Restaurant to Invite New Customers in to Experience this place.\nCheck out the make your own Bloody Mary Bar... I've never seen this before."
  ]
 },
 {
  "name": "Char's Tracy Mansion",
  "address": "1829 N Front St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/63afa186-9330-11ea-a25b-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "music",
   "library",
   "food",
   "art",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17212176281134081899",
  "source": "GoogleMaps",
  "reviews": [
   "Being a college student, I'm by no means accustomed to fine dining. However, I took my girlfriend here one night because I wanted to treat her to something special, and special it was. For starters, the atmosphere was great. There was live music that night, and the decor wasn't over the top or anything- it was just right. Second, our waitress was a class act,  she was helpful with opinions on wine and menu items. The moscato was absolutely amazing, and our food was delicious (I had the scallop dish- would recommend). After our meal we walked the river front and it was one of the most perfect dates I've ever had. I will definitely return from time to time.",
   "Amazing! The food was spectacular and the service top notch. We loved the bread we were served as we were seated so the waiter brought us a box of the bread to take home with us at the end of the night. She had the lime and risotto shrimp, I had scallops. Dessert was a warm chocolate souffle... Heaven on a plate. The only down side was the noise level. The manager moved us to a quieter table in a corner that has sound dampening panels around it. So much better. The next time we go we will probably ask to be seated in the library. Highly recommend visiting the mansion.",
   "Because of some health issues I have decided to cut meat out of my diet.\nJanuary 31st. Is my last day for meat.\nSo I wanted to come here for my last meal (of meat) I had the prime rib, bone in.\nI ordered it medium rare. With garlic mashed potatoes and fresh veggies.\nI have been a meat eater my whole life.\nI have dined at Ruth Chris in Boston as well as Atlanta and Chicago, and those places are very good, but I would stack up the prime rib that I had at Char's against any one of those other places!\nI really mean that. It was done just right (and you don't get that much in Harrisburg PA) there was enough fat to add to the flavor, without being too fatty and the mashed and veggies we're good as well.\nI also like the cappuccino that I got after the meal. All in all it was a great meal. You could argue that it was somewhat pricey, but it was with it to finally get what I ordered, the way I ordered it.",
   "I will be back  had a chance to talk to the executive chef and understand why the food is good.  He loves the art of cooking and their fish is fresh daily.  So good!",
   "The food and atmosphere at Char's are exceptional. In the summer, the view of the river is so pretty. The servers are attentive and know their stuff. But the food is the star here. Favorites include the escargot appetizer and the risotto of the day. This time it was a parmesan crusted chicken breast with sausage risotto. Yum. A great place for celebrations and for anytime you want an amazing dinner."
  ]
 },
 {
  "name": "Las Delicias Restaurante",
  "address": "2060 Derry St, Harrisburg, PA 17104, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6404c69c-9330-11ea-a8a4-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11981414682082885410",
  "source": "GoogleMaps",
  "reviews": [
   "This is an absolutely amazing place to get some great Caribbean food! I absolutely love their empanadas and pepper steak! Get whatever is on the menu, you truly can't go wrong! It's a fast, excellent,  buffet style setup.  Trust me, you will go back!",
   "Best food best service!!",
   "They had a lot of options, very clean place, they made my tostones very fast.",
   "Clean place delicios food freindly people",
   "Dominican food..... great food great service"
  ]
 },
 {
  "name": "Bangkok 56",
  "address": "1917 Paxton St #2962, Harrisburg, PA 17104, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/644b93d2-9330-11ea-9ee2-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15061295360577514819",
  "source": "GoogleMaps",
  "reviews": [
   "I was first introduced to Thai cuisine here and since I have introduced many family members and friends to it too. This still remains my favorite Thai restaurant. Although it's small - and honestly looks questionable from the outside - the inside atmosphere is very cozy, and the food is excellent. Best to make a reservation if you're planning to go during a busy time of day.",
   "Best Thai place in the area! Great service and very welcoming! The ingredients are fresh and authentic! Can’t believe I found an authentic Thai place in Harrisburg, PA. I had the Tom Yum soup, Thai Seafood salad and Pad Thai and the taste is amazing! If you enjoy local Thai flavors don’t miss this place!",
   "This place is fantastic. Every dish is an explosion of good tastes, smells and great visual presentation.  Don't let the small parking lot and modest dining area fool you.  I would put this place in it's own special Asian food category.  If you haven't tried it, then you for sure should go and sample their board of fare.  Also, you can tell the wait person how spicy you want the food.",
   "Food was great! Tasted very fresh and authentic like Thai food should be",
   "The prices for amazing food are reasonable and won't break your lunch budget. The variety of options and levels of spice leaves the patron with a welcome tough choice. Please note that Thai hot is very hot. While they are not open on Monday, you will find them busy other days of the week. The only issue is parking. I highly recommend car pooling if possible."
  ]
 },
 {
  "name": "Bacco Pizzeria and Wine Bar",
  "address": "20 N 2nd St, Harrisburg, PA 17111, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6496f4ee-9330-11ea-964b-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "drink",
   "food",
   "knowledgeable",
   "food",
   "foodie",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13796540076403597174",
  "source": "GoogleMaps",
  "reviews": [
   "I had lunch here yesterday. It was delicious and a step up from your normal pizza shop! The bar tender was friendly and down to earth. She was pleasant company but also did her job and let me eat in peace. I will be back with others. Thanks!",
   "Perfect atmosphere, not to crowded. Amazing food. I got the crab cakes and veggies. Relaxing and laid back service. Jean Paul was awesome! Ask for him!",
   "Saturday around 7:30, I came in with a group of about 15 sober people to simply have a drink in the bar area. We made it easy on the bartender (who also called himself the General Manager) by ordering beer or wine rather than time-consuming craft cocktails. We did not occupy any of the tables or chairs and simply stood around the bar. This GM was overwhelmed and made us know it. As soon as we all got our drinks (and tipped him out), he became incredibly rude and told us the space was reserved for dinner guests with reservations even though we were feet away from the tables. After a few minutes, my mother-in-law calmly mentioned to him that his approach was aggressive and could have been handled better and he literally had a melt down and began yelling at her! He then proceeded to threaten to kick us out and said the owner would agree. He told us we could take the owner's card and call him - that his cell phone number was on it. Today I called the number only to find that it is not a cell phone, no one answered, there is no voicemail, and the email address is a general account for the business. In short, I've always thought the food was mediocre and overpriced, but I've always loved the bar and atmosphere. We were treated so rudely and for no reason (other than spending a few hundred dollars in 15 minutes) that now I can't even enjoy the bar. The bar-tender/GM was incredibly inappropriate and unprofessional. He should not be working in customer service.",
   "Absolutely love Bacco- it’s a must-visit in downtown Harrisburg!! I’ve been going with my boyfriend consistently since we moved to the area, and we love the food, service and atmosphere here. The Happy Hour specials are THE BEST- I highly recommend coming here after work during the week with friends. On weekends, there’s always a great crowd at the bar. John at the bar is amazing- he’s such a knowledgeable bartender and foodie. I can’t say enough good things!",
   "Came here for lunch one day. Great food and service. Wish we stopped by after 1pm though. That’s when their happy hour starts."
  ]
 },
 {
  "name": "1700 Degrees Steakhouse",
  "address": "1 N 2nd St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/64de101a-9330-11ea-afe6-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=3381661427201711297",
  "source": "GoogleMaps",
  "reviews": [
   "The food was very good and so was our waitress. However, I’m not so sure about the reception though. We arrived at 5:26pm for our reservation for 5:30pm and was told that we needed to wait until they open at 5:30pm. Which was fine, but then we didn’t get seated until 5:34pm, even though we were the only ones there...very interesting operation.",
   "Was really good food.. service was excellent.. my first time enjoying a Tomahawk steak",
   "Ohh!! How should I start, always had great experience at Hilton’s, no matter where you are. Never had issues with Hilton’s, after got disappointed at one restaurant went to Hilton’s made my day and night. Amazing service, great menu, beautiful ambience. Everything perfect!!!!! The perfect Hilton the perfect restaurant. Just look at the preparation and work marvelous......",
   "Amazing dinner tonight! The steak, the sides and the drinks were perfect and the service was stellar. So excited to have found an NYC quality steakhouse right here in Central PA! We cannot wait to return.",
   "Thoroughly enjoyed the Tomahawk Steak. Scott Hamdon was an AWESOME waiter! Very friendly and knowledgeable! Definitely will be back."
  ]
 },
 {
  "name": "The Jackson House",
  "address": "1004 N 6th St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/652579a4-9330-11ea-93f9-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9224120016002293273",
  "source": "GoogleMaps",
  "reviews": [
   "I heard rave reviews about the restaurant but was disappointed. I ordered Lester burger and asked for hot sauce. There was no hot sauce. I also order a side of fries and the fries were in tiny bits and they were burnt. Maybe I will give them another try in the future and order something else.",
   "Hands down, the best burgers, subs, and cheesesteaks in the Harrisburg area (and beyond). An old fashioned style Italian deli inside, this family run business slings food equal to the best joints in NY, Philly, etc.  Hours are only Mon thru Fri, 10:30am to 2:00pm, and rusty are closed on all state holidays. They are cash only and usually busy.  Burgers are cooked to order. I can't say enough good things about this place, their food is THE example of delicious.",
   "Great burger!! It's a little pricey, but I can definitely see why they keep winning best burger in Harrisburg. Family owned and managed, and they are awesome. Super friendly staff and welcoming atmosphere. It's a mixer of Philly and NYC right in the heart of Harrisburg. The French \nFries are fresh cut and the oil and sea salt is done perfectly. Everyone needs to experience this place.",
   "The hallmark of a quality cheeseburger is when you pick it up and the juice runs down to your elbows. That was the burger I had today. Thick, and juicy. Great little spot for lunch!",
   "Great food and friendly service.  The burger I had was superb. Just be aware that if you go, it's cash only."
  ]
 },
 {
  "name": "Los Tres Cubanos Restaurant",
  "address": "540 Race St, Harrisburg, PA 17104, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/657372e8-9330-11ea-85b4-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3782174922396495289",
  "source": "GoogleMaps",
  "reviews": [
   "We went without a reservation on a weeknight. It is a cute little place, and I could see it filling up quickly. The decor is nicely done. I love the out side tables, but I was happy to be in the air conditioned inside.\n\nI started out with a mojito. It was tasty and the sugar cane was a nice touch. \n\nI got the steak special (32) and my husband a pork dish (22) so we could share. The meat flavors were rich and complex. The rice and beans were much simpler. \n\nIt was a great meal and we will be back.",
   "Love Tres Cubanos.  We have been here several times.  You dream of a mojito--that's it.  Great cocktails all around and everything on the menu is better then expected.  Most restaurants in Harrisburg are hit-or-miss.  Tres Cubanos is not.  Consistently great food.",
   "Great place. The Cuban bartender Aerial, great guy ...A++",
   "Awesome food.  The service was top of the line.  Could not ask for a better waitress. Atmosphere was great.  Myself and coworkers had a great evening.",
   "Loved the food, really good, it made me feel like  I was back in my beautiful country Cuba."
  ]
 },
 {
  "name": "Sammy's Authentic Italian Restaurant",
  "address": "502 N 3rd St #1112, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/65bce88a-9330-11ea-b090-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11044221227699990760",
  "source": "GoogleMaps",
  "reviews": [
   "Visited this location on two different occasions within the last six months because I am now employed downtown and can easily walk there on my lunch break. Both times the service was horrible! The first time I did carry out the portions were too small, the second time coworkers and I ate the buffet the food was bland and not enough options. The server was rude, I was the only Black person at a table of 4 and He didn’t clean my dirty plate until the lady next to me told him to",
   "Awesome atmosphere awesome view and fantastic homemade food. Fresh spices. One of my favorite places worth hour and 20 minute drive 🙂",
   "Today is my first time dining at this small, quaint establishment.  It was party of 16 I think. We placed everyone's order two days before. When we arrived, they had everything ready for us.  We got our drinks right away, than our salads, than our meals. I think everyone had everything in 30 minutes... AND it was hot. Very impressed! I'll def be recommending this place",
   "Great food, great service. Love the authentic Italian dishes. Can’t beat the loacation at the base of the capitol steps as well!",
   "Excellent server and dinner.  So happy to find vegetarian options on the menu.  We will be back."
  ]
 },
 {
  "name": "Freshido",
  "address": "300 Market St #157-159, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6601b9f8-9330-11ea-9164-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "affordable",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12786987706920951073",
  "source": "GoogleMaps",
  "reviews": [
   "I tried this place on a whim and was not disappointed. Excellent quality of food and large portions for the price. I got mine to go, but the restaurant looked clean and tidy. I will definitely be headed back there soon.",
   "This is my favorite low key spot for a date night. It's affordable and delicious. If you are looking for a date night location, this spot is nestled right in strawberry square. There are lights strung up over the street and it's gorgeous at night. While this restaurant doesn't provide the cocktails that one might want to enjoy during an evening out, there are many bars and a couple more restaurants near by that serve alcohol. There's also a cute, authentic crepe spot just a hop skip and jump away for dessert.  Easily my favorite area of Harrisburg.",
   "Great Poke Bowl Restaurant if you need a quick in and out or to go or just sit down and enjoy the atmosphere while eating a delicious healthy food this is the place to go in Harrisburg, PA. Totally recommend it, available street parking with park i meter in the area. \nWe had 2 bowls: \n-Freshido Special.\n-Turf & Surf.",
   "Favorite place to get lunch in Harrisburg. Great food and great service! Had an issue with an order and Ben C. had it fixed right away.",
   "I love any place where I can pick exactly what goes in my good. Great poke."
  ]
 },
 {
  "name": "Ad Lib Craft Kitchen & Bar",
  "address": "1 N 2nd St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/664c30c0-9330-11ea-89cd-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4436924327360258970",
  "source": "GoogleMaps",
  "reviews": [
   "This place is so good with the choices of food that they have. Monkey bread and Brie for an appetizer. Marinated chicken wings for an appetizer and grilled octopus for entree. Oh my God so good so wonderful please if you're in Harrisburg check this place out",
   "Stellar experience, honestly. I took my wife here for her 40th birthday, and we were both blown away by the service and quality of food. Our server Parker was very attentive and Michael the bartender went out of his way to make a custom drink that would make my wife’s evening extra special. \n\nI have to recommend this place to anyone looking for a quality experience.",
   "Ad Lib has a great menu.  Their lunch specials are presented on a large, rectangular plate and offer a good value for the price and quality.  Their clam chowder is possibly the best I've ever had - rich and creamy with bacon added to enhance the flavor.  If you're a burger lover, you would be hard pressed to find one better than the Ad Lib Burger.  It is served on a pretzel roll with stone ground mustard (containing large seeds) and hand cut fries on the side.  Finally, if you're a seafood lover, order a couple of the giant shrimp from the 1700 Steakhouse menu. They are an expensive treat, but well worth it. Overall, Ad Lib delivers a superior dining experience which is commensurate with the price.",
   "We have been wanting to check this place out for a while and it did not disappoint. For starters the Bloody Mary's were spiced to perfection. Then I had the Pork Cheek Rye Bagel which was crazy good with hot sauce cream cheese!\n\nService was very good and quick!",
   "The burger I ordered was pretty decent even if the fries were a bit lacking. My wife ordered meatballs and was highly underwelmed by them. The cocktail and other alcoholic beverage options seem to be the strong suit here. I wouldn't be opposed to returning to explore more of the menu however so overall I will say I enjoyed my visit here but I have also had much more impressive experiences elsewhere."
  ]
 },
 {
  "name": "Burger Yum",
  "address": "400 N 2nd St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6692dbc6-9330-11ea-94be-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1826592800133313587",
  "source": "GoogleMaps",
  "reviews": [
   "The Yum Burger is amazing. I don't understand all the natural, organic or whatever. I do understand taste. It is fresh and amazingly delicious! You have to experience it. Good atmosphere. Great staff-quick and friendly.",
   "The food at Burger Yum is fantastic. If you are looking for a smash style burger, fries, and a milk shake Burger Yum is for you. I didn't get to try the Chicken sandwich but I will be next time. The staff was courteous and the location is great.",
   "Burger Yum is the best burger in Harrisburg!!!\n\nThe burgers are very juicy and cooked perfectly. The Yum Sauce is delicious and a great addition to any of their sandwiches. The chicken sandwich rivals any other in the industry. The french fries are great, including the parmesan fries.\n\nI love the quaint atmosphere and the owner is very friendly and a valuable part of the Harrisburg community.  Keep up the great work!",
   "My friend and I always order the strawberry smoothie, loaded fries and chilly bacon dogs right after we leave HACC. Sheetz used to be our spot but to be honest, not no more😂😂💀. The food here is SO good and the energy the employees give off is amazing. I love how chill the vibe of the atmosphere is and everyone is really nice and down to earth.",
   "I’ve been eating cheeseburgers a long time, this is by far best burger since I was a kid! If you’re near by make this a stop on your list. So good!!!"
  ]
 },
 {
  "name": "Au Bon Lieu",
  "address": "1 N 3rd St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/66e74926-9330-11ea-88e0-14b31f159f22.png",
  "tags": [
   "music",
   "food",
   "theatre",
   "drink",
   "family"
  ],
  "link": "https://maps.google.com/?cid=4810322747516767159",
  "source": "GoogleMaps",
  "reviews": [
   "Such a quaint little spot tucked downtown! Huge menu with over 80 varieties of crepes. Outdoor seating for when the weather is nice. Authentic French music (at least I think) playing at all times. Reasonable prices, too. Lovely Friday night spot.",
   "Great crepes! And the owner was very kind. A homeless person walked in and the owner asked him if he was hungry. Then he proceeded to provide him with some food. I offered to pay for that person's food but the owner refused to accept any payment! Definitely coming back here again.",
   "THIS MAN IS THE TRUTH. Friendliest man alive. Extremely polite , caring and fun. Pretty little establishment and the crepes were TO.DIE.FOR. I think I wanted to spend an entire paycheck on Nutella banana crepes. 10/10 recommend",
   "My husband by ourselves or with friends and family have been coming here for years. The shop is intimate and cozy with window nooks and pillows and fur. In warmer weather there are cafe tables outside. It is very convenient to the Harrisburg Symphony and Open Stage and the Gamut Theatre and State Museum and Whitaker Center for example. We stop in for a dessert crepe and coffee or tea after a show or between meals after a museum visit. We go for lunch or dinner before a show and get a savory crepe/salad and a dessert crepe plus a drink for 1/2 the price of a meal at other restaurants and although it feels like time slows down a bit at Au Bon Lieu, the timing of the service is perfect and we always get to the show on time!",
   "Convenient location with good menu options and customer service."
  ]
 },
 {
  "name": "Rubicon",
  "address": "270 North St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/673996b8-9330-11ea-9e2a-14b31f159f22.png",
  "tags": [
   "drink",
   "tasting",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9518212084235302665",
  "source": "GoogleMaps",
  "reviews": [
   "Restaurant and bar are seemingly clean and nice. Service was decent. We were there on New year's and ordered drinks early that came out in good time and made correctly. Once they got busy, they were unable to handle their bar, and the drinks came out inconsistent, and worse tasting as the night went on. The drinks were top dollar, so for that price I expect them to be on point. The last round was so bad we decided not to drink them.",
   "Holy cow this place is good. The Rubicon Mule was fantastic, such great flavor profiles. The steak is great. The accompanying potatoes are not great. I certainly suggest substituting them out. Honestly, the steak is so large, you won't even need to worry about the side item.",
   "Atmosphere is very relaxing, tastefully done, and preserves the architecture of the building with a slight (very slight) modern feel.\n\nFood is very good, menu offers something for all tastes.  Specialty cocktail menu is a nice touch as well.  We'll be back!",
   "Staff were excellent! Only ordered starters and drinks. Escargot and mussels were great! Wine was excellent. The decor was underwhelming, I expected more I guess.",
   "Always good but the bar is what I love about this place.  The food has never disappointed.  The staff is friendly without being overly attentive.  They have the best burger around"
  ]
 },
 {
  "name": "Carley's Ristorante",
  "address": "204 Locust St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/678f583a-9330-11ea-8a89-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "music",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1440910348228630328",
  "source": "GoogleMaps",
  "reviews": [
   "Although on the pricier side, Carley's is a lovely place to dine that offers live piano entertainment every weekend. We were there on an off day for the piano bar, but a patron was allowed to play piano by the owner and regaled us with what amounted to a tiny concert for our table as barring that patron, we were the only other guests for a while. \n\nI would highly recommend this place. The food is superb. The owner treats patrons like family. And the music is just the icing on the cake.",
   "Wonderful place,  great piano bar. A nice remnant of restaurant row.",
   "Cute place! Loved the live piano music, the food was great, and it was a lovely atmosphere! Service was good too 👍",
   "Would have liked to given 4 stars, but I just couldn't.  Is it it a downtown fine dining establishment or just an everyday place?  The piano player while very good was loud when we first arrived such that my wife and I had to talk in elevated voices to hear each other.  I finally asked our waitress if she could ask for lower volume, which she did and then once lowered I thought was appropriate for dining.  The food was good, but not extraordinary.   Our waitress was just OK as well.  Worth a try.",
   "I have always had a wonderful experience any time I have gone to Carley’s. Though I was introduced to the location through Show Tune Sunday, I have been a patron outside of that event. The staff is always kind and professional. It’s my go-to recommendation for people new to Harrisburg. I look forward to my next visit."
  ]
 },
 {
  "name": "Keystone Restaurant",
  "address": "1000 N 3rd St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/67d959b6-9330-11ea-be8b-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "free",
   "food",
   "food",
   "cheap",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14605716960475138762",
  "source": "GoogleMaps",
  "reviews": [
   "Food is amazing here, always comes out fresh and taste really good. Price is within reason as well. You would have to pay for parking around the area during the week even Saturday.  But Sunday is free parking, has nothing to do with the restaurant. Family owned business and the people here are polite and attentive. Safe area right down the street from the cap5so you can walk off those calories if you like.",
   "Easy, fast, classic breakfast. Open kitchen gives a great atmosphere! Get there early or you may have to wait! Very busy on weekends!!",
   "Good service. Good food. Small town prices.",
   "Quick service, cheap prices and family-owned. Love this place!",
   "Great breakfast friendly staff. I had there bacon and cheese omelette and my partner had French toast with eggs and beef sausage. Amazing portions great food loved it. Very fast and filling. If we are back in the area we will be coming back."
  ]
 },
 {
  "name": "Cork & Fork",
  "address": "200 State St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6823340a-9330-11ea-8796-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "creative",
   "knowledgeable",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=17719774551755557798",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome and distinct food choice. Loved every single thing we ordered. Great recommendations by our server!! Will come back",
   "This place is great! Just in town for one night and we happened upon it. The happy hour is totally nuts. The food is so delicious — the scallop risotto is such a treat and the sopressata pizza is spot-on authentic Italian. Our server, Danica, was so cool, too. Happy to recommend this spot!",
   "This place it’s amazing! First time here and the customer service is excellent and food delicious! Definitely coming back here. Recommend 20/10 lol",
   "Such exquisite cocktails made with the creative spirit of folks who know their spirits. Jonathan the mixologist was extremely welcoming and knowledgeable about the menu and beverage pairings. His testimonials and creations behind the bar were welcome and enjoyed by all.",
   "My husband and I decided to stop here after Little Amps Coffee Roaster and we are so glad we did. They were offering their brunch menu. Which was smaller plates and it was all so delicious and fresh. They make all of their dough, sauces, dressings, and pastas in house. The gnocchi with cherry tomato sauce was the favorite of everything we had gotten. We also had the veal meatballs, margherita pizza, and sopressata. It was all so amazing. We will definitely be going back."
  ]
 },
 {
  "name": "The Sturges Speakeasy",
  "address": "400 Forster St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/686d0ea8-9330-11ea-8a92-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "delicious",
   "music"
  ],
  "link": "https://maps.google.com/?cid=7418052556403605056",
  "source": "GoogleMaps",
  "reviews": [
   "Lively atmosphere, a variety of sports on the TVs the vibe you want in your neighborhood bar. We sat in the bar side to watch everything, the bartender although busy was totally attentive. Cold beers out within minutes of ordering, menus brought for when we were ready. It was our first time there and we will for sure be back!",
   "Hands done, bar none, one of the best places that I've ever had a meal and I have particular standard's. I like my steak well-done and most places I have to send it back, sometimes more then once. When I told the waitress what I wanted, she said I'll tell them to kill it. My steak was cooked to perfection, and the asparagus and mashed potatoes were full of flavor. The drinks were 🔥. That bartender is a master of his craft. They were packed on the first floor, but upstairs was nice an intimate. The calamari and the potato soup was delicious. The peanut butter pie was heavenly. This was one of the best dining/culinary experiences I've ever had.",
   "The waiter was very nice and helpful, he recommended the espresso martini and it was delicious! The sandwiches we got were really good too and pretty big. They also have a nice, little deck with tables and a bar.",
   "My 'Pittsburg style' steak salad was delicious!  It was a first for me to have fries in a salad but it definitely worked. Big beer selection and great prices.",
   "Had a great time.  Good selection of drinks and a wonderful atmosphere. The bar is on one half and tables on the other. There is normally music in the evening.\nThe steak salad was good and the bar tenders on point."
  ]
 },
 {
  "name": "Stock's on 2nd",
  "address": "211 N 2nd St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/68bf2652-9330-11ea-adc1-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6289328957993988024",
  "source": "GoogleMaps",
  "reviews": [
   "I came in the door and immediately greeted with a server named Christina. \nShe asked me where I wanted to be seated which in other places they just put me where they wanted.\nI sat down didn't rush me too order which I love. I mean who likes to be rushed when trying to pick the right choice or anything at that. I ordered Buffalo wings and Crispy short rib 🍟 fries. Man the wings were the best I had in a long time perfectly cooked 👌. Had the fries with beer cheese OMG i can eat fries with that cheese all day every day. I'll definitely be coming back here again.",
   "I love the rustic, country decorations. Food was delicious and our waiter was very helpful. I'd highly recommend this place.",
   "Very nice place! We went on a Monday evening and it was very empty. I'm sure it would be busy on the weekends. We loved the atmosphere. The food was nice serving size. I got the brisket and it was very good!!",
   "Had a great experience, I love this place. Happy our deals were solid. Our server mike was a 11/10. He had great food recommendations and an incredible personality. Man deserves a raise.",
   "Food was tasty. Waiter was pretty agressive and pushy. Sometimes he was pleasant, but not consistently. Weird experience."
  ]
 },
 {
  "name": "Café 1500",
  "address": "1500 N 6th St #101, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/69046cd8-9330-11ea-b78c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food",
   "hospitable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10008097930151483380",
  "source": "GoogleMaps",
  "reviews": [
   "Good food, excellent ambience. We didn't like the Buddha bowl but it is because this was the first time we were trying Golden beets  and it turned out we were not a fan of it. So if you have tasted golden beets before and don't care for it then please don't order Buddha bowl. Apart from this, everything else was perfect!",
   "I wanna give it four stars but the past few times I have came here, it has been pretty disappointing. Two different occasions I went to order something, they didn't have the I ingredients to make it.... Last time I've been (a few weeks ago) we waited forever and our food came out cool. It didn't even seem that busy. Great cocktails though, that hasn't changed. I definitely will be back for some bottomless mimosas but may hang tight on the food. I hope they can improve themselves!",
   "The food here was good and so was the service.  Although there are reservations required for tables, but none required for the bar. The servers were very friendly.   I had the 5 course meal.  The Korean fried chicken was delicious and so was the flight chicken.  I would go there again.",
   "Food and staff was amazing more people should come here literally had the whole restaurant to our selves.",
   "Looking for Brunch on a Sunday Morning? Cafe 1500 is where you need to be!  A Craft of Mimosas (4 glasses $20) great deal, cornbread battered house pancakes, crab floretine omelettes, amazing french toast and a divine avocado toast for sharing!\n\nAbsolutely stunning atmosphere! \nFresh green plants, hospitable waiters/waitresses, great open space, outdoor seating,  fresh food, fast service and reasonably priced! \nI had a great time at Cafe 1500. And if I'm in PA again, I'll be back!"
  ]
 },
 {
  "name": "Tres Hermanos",
  "address": "712 S Cameron St, Harrisburg, PA 17104, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/694e6e7a-9330-11ea-bf9c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "affordable",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11958176933702342931",
  "source": "GoogleMaps",
  "reviews": [
   "Cant beat them with real authenticity food and product's keep the good work🙏🏽👌🏽",
   "This is a great place with very authentic products. The staff is friendly and everything tastes great. They have a small bar for onions, pick, and salsa. Highly recommend! There's also a Mexican store in the back where you can get authentic Mexican foods, juices, candy, breads, meats, and spices, as well as boots, souvenirs and other Mexican trinkets.",
   "Definitely one of the best places around! If you're craving Mexican cuisine it's the only place I recommend to anyone. Incredible, fresh, and flavorful food. Excellent service. Overall best place around. If I could give a higher rating I would!",
   "Very authentic and very tasty dishes.  Also very affordable.  Simple decor with a grocery in back.  One of my favorite restaurants in Harrisburg.  Highly recommended.",
   "Being from Colorado, I am always craving authentic and delicious Mexican food.  Thankfully, I finally found it here!  AMAZING FOOD!"
  ]
 },
 {
  "name": "Garden Vietnamese Restaurant",
  "address": "304 Reily St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/698f21d8-9330-11ea-9b4c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11203582442861321956",
  "source": "GoogleMaps",
  "reviews": [
   "Picked this up to go! Quick and easy, price is great.  Quality is off the scale.  The just have great food!  Service is fast, polite staff.  Very pleased!",
   "The food here was good. The coffee as well. If you're looking for vietnamese fare there should do nicely. Nothing major stands out, however everything was very solid and as it should be.",
   "This restaurant has the best service and egg rolls you should try it for whoever is reading this.",
   "Fine spot for tasty Vietnamese food. Came here on a Friday I think. Looking forward to returning with my relatives. The bill was appropriate for the quality. Similar to a place in Denver I liked.",
   "This is definitely one of my most favorite little restaurants. It's fun with friends or just some quiet time for yourself. The food is the absolute best and the staff is awesome."
  ]
 },
 {
  "name": "Kanlaya Thai Restaurant",
  "address": "1030 S 13th St, Harrisburg, PA 17104, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/69d292f0-9330-11ea-a8e9-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5812850152496200747",
  "source": "GoogleMaps",
  "reviews": [
   "Brings back memories of the food in Thailand especially the   tom yang soup with mushroom. Salad is spicy which is good. Staff is friendly and efficient. Spacious dining area. Food serving is large enough for a group meal.",
   "I really enjoyed my meal i had. Crispy KaPow chicken and it tasted great. I am not sure what everyone else at my table had but they all enjoyed their meals. Will definitely be back. The portions were a lot too. Have some left overs for later.",
   "Excellent food!!! I really loved the pot stickers, spicy fried rice and the drunken chicken noodles... Also a special mention to the mango sticky rice which was an amazing dessert!!",
   "Came back for the second time this trip. I’m usually going to only new places, but this place got me hooked the first time I had to come back. The menu I had 2 days in a row, from bottom to top.\nThey all taste very authentic. I highly recommend as a Thai.",
   "Always good food and best bubble tea Harrisburg"
  ]
 },
 {
  "name": "Miyako Sushi",
  "address": "227 N 2nd St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6a1f0574-9330-11ea-ad63-14b31f159f22.png",
  "tags": [
   "eat"
  ],
  "link": "https://maps.google.com/?cid=18121820785702152046",
  "source": "GoogleMaps",
  "reviews": [
   "best sushi around! love the valentine roll. everything is always super fresh & they have a remarkable amount of options at reasonable prices.",
   "Very good quality sushi! I was thoroughly impressed. The prices weren't that bad as well. I eat a lot of sushi and am used to all you can eat specials for $20-$30. Here I had the 2 for $14 special which wasn't bad. It took a little long for the sushi to come out when it felt like we were 1 of 3 other customers here but that's just my experience. Would love to see an all you can special.",
   "I ordered delivery and it came fast and still warm. I had the Yum Yum Roll, Philly Roll, and Pork Gyoza. All of it was amazing and I'll definitely order from there again.",
   "I’ve been here 50+ times and every single time I am blown away by the customer service and cuisine. The owner and staff are polite and hardworking. Very proud to have them downtown.",
   "The sushi here is pretty good. Presentation is also good as well. I tried sushi here before and this time tried there combination fried rice. Was pretty average but not bad. I haven't had a bad experience here just okay."
  ]
 },
 {
  "name": "Millworks",
  "address": "340 Verbeke St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6a647300-9330-11ea-971e-14b31f159f22.png",
  "tags": [
   "food",
   "kids",
   "eat",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1416522214234903457",
  "source": "GoogleMaps",
  "reviews": [
   "Good beer, good food and great service. Went on Saturday around 1pm and place was pretty full. Service couldn't have been better. Orders arrived to the table quicker than expected and everything tasted amazing. Parking can be tricky but just be patient because its worth it. Also several nice artist shops inside. First time visitor and was impressed. Wish there were more places like this!",
   "Food was sooo good. I wish I could eat more to try everything! Service was great. I particularly appreciate the kids menu with coloring and the salt dough. It's great to have a place to go with good for and drinks that the kids will enjoy too. Love the local ingredients!",
   "Good beer selection. Their brewer seems to know the way to a good beer.\nThe food's..... Marginal. The wife's burger was cooked perfectly and had a nice char taste. The fries were hot but slightly undercooked.\nI went for the pierogies. Didn't find the burnt ends on my plate and they were very dry dumplings. Nothing like the menu described and the main reason I picked the restaurant for the evening.\nMaybe the chef was having a bad night but...\nNot Recommended beyond bar food.\n:D",
   "I'd made a reservation for yesterday for a party of 8; it was for a birthday celebration for my boyfriend. The server was really friendly, the beer was delicious, and the food came out super fast. For a starter I got the Butternut Squash Bisque, which was phenomenal, and for the main course I got the Vegan Mushroom Stroganoff. Aside from it being extremely salty, it was still delicious. That was really the only vegan/vegetarian thing I seen on the menu (other than pizza). Of course, I was also chatting with 7 other people while I was looking at the menu, so I could've easily missed something. It was my first time here and there was so much to see! I can't wait to come back in the summertime and see the rooftop!",
   "Holy wow! First time here and we will certainly will be back! Atmosphere felt very cozy and staff was very friendly. The food was spot on amazing and you could tell that everything was just so fresh."
  ]
 },
 {
  "name": "Subway Café",
  "address": "1000 Herr St, Harrisburg, PA 17103, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6aac9fb8-9330-11ea-878b-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "family",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11637355087953339932",
  "source": "GoogleMaps",
  "reviews": [
   "The Subway is a long established (1948) Italian restaurant.  I've been eating here since 1965.  Their Pizza won a Harrisburg area contest as the best Pizza, which was judged by the owners the five best Pizza restaurants in the area.  There is one personal size and it has a thin cracker crust along with all the other typical Italian food.  This place has been thriving for over 70 years in a downtown location in an era when restaurants are failing as quickly as they can open.  Go there & enjoy it!!",
   "I hadn't been here in years, but always remembered them for their peanut butter pie. I went in tonight with my boyfriend since he had never been there before. Our food was DELICIOUS!! He got a personal pizza, homemade sweet sauce & LOTS of it! I had the toasted ravioli bites (which are really hard to find these days). Sauce waa awesome! Had bits of meat in it (which is ALSO hard to find). Our waitress was Carmen & she was a sweetheart. Good price for the excellent meals you get. We will be returning--highly recommend!! They also carry a decent size wine selection as well!",
   "Best pizza in the area. If you like thin crust pizza you must try it. It is clear why this establishment has been around for so long. We have been coming here for many years and come back time and time again. All my family and friends love it too. Try the amazing house dressing on your salad and if you want a fantastic dessert try the peanut butter pie. Yum!",
   "The pizza is good, thin and crisp. Fast and friendly staff great lunch spot",
   "Delicious comfort food and excellent service. Strongly recommended!"
  ]
 },
 {
  "name": "The Vegetable Hunter- Plant-Based Cafe & Boutique Brewery",
  "address": "614 N 2nd St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6af25b7a-9330-11ea-a62a-14b31f159f22.png",
  "tags": [
   "food",
   "foodie",
   "food",
   "delicious",
   "delicious",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3857021938941928157",
  "source": "GoogleMaps",
  "reviews": [
   "This is a hidden foodie gem!  If you thought plant based would be tasteless, you better think again and try the sweet potato salad, not what you would expect and the mushroom risotto was out of this world and they made me my own special dessert!  It was so well thought out and perfect, every detail.  You must try this awesome food!",
   "First visit here was pleasant. Staff was friendly and food had a amazing presentation. Parking ended up costing $4 for an hour and 20 minutes. Beer was better than expected.\n\nMac and cheese was only okay. Might need to try it again, but overall a nice experience.",
   "I'm not a vegan, but open to trying new foods. I got the black bean burger with spicy beets on the side. Both were delicious and will be going back to try other stuff. Check them out!",
   "WOW! This place is incredible. Our family visited on a snow day and had the place to ourselves. They cooked us up a feast. EVERYTHING is plant-based. The food was delicious and we cannot wait to visit again.",
   "The food was fresh and awesome. The staff was great.\n Im not a Vegan but I really enjoyed the food as a change of pace. Very good selection s on the menu\nI didn't try the beer but I will next time Im back in the area"
  ]
 },
 {
  "name": "Crawdaddys",
  "address": "1500 N 6th St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6b33aa74-9330-11ea-a5f7-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "walking",
   "eat",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11405343253262636078",
  "source": "GoogleMaps",
  "reviews": [
   "First time actually eating there. I was there for a retirement lunch for a colleague. We were a large group that emailed our menu choice ahead of time. Everything was ready when we got there. Our place settings were labeled with our name and meal selection. As we were seated our food was brought out. Everything was delicious. Not one complaint. Our Server was attentive, and the Owner came out to greet us. It was a wonderful dining experience.",
   "The food was just okay. Some seasoned well, some not enough and some was dry and overcooked. Space is very small. Dance area, bar and tables, plus DJ. We were seated at a table that was clearly in the way and we were bumped all night by people walking back and forth. Food was a little too pricey for what we got. I would love to try some more from their menu. I'd try to go when it was a little less crowded maybe.",
   "Our waitress Ms Paula was excellent, however our food was not prepared as ordered. The owner was not accommodating and refused to hear our concerns because he felt he already addressed the issue despite us wanting to address other concerns. Its unfortunate that black owned establishments have poor professional service especially when your willing to patronize them.\n\nI appreciate your response, however the Birthday Club and their event had nothing to do with the lack of  customer service my party and I received in the dining room.   I ordered a salmon salad and received a piece of salmon on a plate. I requested it be sent back and it was rushed back to me over a salad mix. Presentation was not flattering. Others received their food sporadically causing some to eat and complete their meals before others. Because it was a Birthday celebration many didn't want to upset the Birthday honoree by complaning about their food and lack of professionalism. We tipped our wait staff  handsomely, and strongly noted that we would not forget our treatment and experience. We should have been notified when we were seated by the manager and waitress about all house, happy hour, and dinner specials. We arrived prior to 7pm. Management should never dispute the customer especially a group of mature,  professional, proud paying women.",
   "We all loved our food. It was delicious. Very well seasoned so the flavor was off the charts. It reminded us of New Orleans. We definitely plan to dine there again.  And the service was delightful just rounded off the entire experience. I had the voodoo juice and gumbo with shrimps.",
   "The service was great! The food was pretty good, just not as good as I remember it being. My mom had the shrimp and grits. She absolutely loved it! The grilled chicken was a pleaser too. I was not too crazy about the fried chicken wings! We had a little group and the atmosphere was nice."
  ]
 },
 {
  "name": "Bollywood Bar and Grille",
  "address": "110 N 2nd St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6b787bd8-9330-11ea-a198-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "unique",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9519384155441746191",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent food and super friendly people! I will be returning. The $9.99 lunch buffet is simply amazing. Delicious and fresh food. Very clean establishment. I am beyond impressed!",
   "We decided to stop here for dinner on a Sunday. The place was empty. We were a bit worried, because usually that is a sign that it's not very popular. Let me tell you, the food was AMAZING!!  The staff was very kind, and as we were waiting to order, more and more people came in. It did take a very long time for our food to be served, but I feel that is because the food is very high quality. Each and every item was obviously cooked with such care. The flavors were amazing and to be honest, it was honestly some of the best Indian food I have ever had!! My one and only 'complaint' is that many people know that to get really good food, it takes a long prep time. So there were quite a few orders that were placed through Grub-Hub. We kept seeing orders go out, and I started to feel a little neglected, because our order seemed to take a long time to finally be brought out. But let me tell you. It was WORTH it!! I would wait an hour to have their food again! I am most definitely looking forward to returning! And , next time, I'm going to order a whole slew of food to take back with me, so I can have it the next day!!!",
   "Love the vegetarian options and they have a couple of unique fishes. Great service. We usually get carryout and are always satisfied. I do wish the buffet had more veggie options but regardless the food is really good.",
   "Really great food with a friendly staff making some excellent recommendations.  If you like culinary flavors and meals from India, this place should be on your must visit list.",
   "Wish I still lived in Harrisburg so I could order food from here more often. Food is spiced well and the flavors are good, not too heavy and service has always been good whenever we are there! Looking forward to coming here whenever we visit the area."
  ]
 },
 {
  "name": "Cidra's Cabana Restaurant",
  "address": "1716 Derry St, Harrisburg, PA 17104, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6bc31992-9330-11ea-bc73-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=32903473165378804",
  "source": "GoogleMaps",
  "reviews": [
   "Grrreat!!!! Huge Portions!!! Yummy Alot Choices...So Kind and welcoming... Real consistent Food & Service... Above & Beyond Service...",
   "We visited this place today and it was a great experience. The food was delicious , the service was excellent and they take good care of their customers. It's family owned and the feeling is very warm and friendly. They do need more tables inside because businesses is booming and is too cold to sit on the tables they have outside. I'm still giving them a 5 star review, so you can tell I loved their food.",
   "Let me explain and tell you that as a hispanic this is the only Spanish food restaurant in Harrisburg that is worth visiting and trying and also making it a habit. There’s several restaurants out here but it doesn’t taste as good or is well cooked as this one. The employees are friendly and very passionate about what they do. \n\nIf you have not tried this or you’re skeptical. stop what you’re doing and please enjoy the meals here.",
   "For Spanish food, Cidra's is a must go. A mouthwatering selection of food. And the portions, wow, huge. My eyes are always bigger than my stomach. Well Done. You have me looking forward to returning.",
   "The food is great, but it's served cafeteria style. It would be nicer if there was a menu and food was made to order. Husband loves it so I will send him here for carry out once in a blue moon."
  ]
 },
 {
  "name": "Philadelphia Steaks & Hoagies",
  "address": "23 N 4th St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6c0db836-9330-11ea-b2c1-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=16232512546135593685",
  "source": "GoogleMaps",
  "reviews": [
   "Alright cheesesteak, it was just alright. The bread from Philly was great, the meat was flavorful but a bit dry. Not enough cheese, looks cheesy but it's only on the outside, not inside of the sandwich. Fries were pretty ok, I got cheese fries and it was over kill. So ok food, but the expensive prices and tiny amounts aren't doing it any favors.",
   "By far the best cheese steak around! I had to actually get on here and look at the \"one star reviews\" those are bogus!!! I love going to grab a cheese steak at lunch!! Know what you want before you get in line and there isn't much of a wait at all!! Keep up the good work guys!",
   "Ok, so it's not in Philadelphia, but it's close enough.  Good sandwiches and quick service name this a great lunchtime stop while in Harrisburg.",
   "Some of the best Philly Cheesesteaks outside of Philly!  This is close to the state capital, and provides some of the best mid week dining options around.  Both the traditional and chicken cheesesteaks are fantastic, although you should make sure to be prepared to order when you get to the counter.  The staff appreciates people who don't fumble about.",
   "Great place for a quick sit down meal! First time coming here and will definitely be back again!!"
  ]
 },
 {
  "name": "The Cheesesteak Guy",
  "address": "1233 N 3rd St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6c654d74-9330-11ea-abe0-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18071448021566497172",
  "source": "GoogleMaps",
  "reviews": [
   "Best cheesesteaks in all of Harrisburg!!!",
   "Best cheeseteaks in the area. I like hamburgers better though, and their hamburgers are dangerously good. Haven't tried much else on their menu to date, but I intend to.",
   "I swear every time I go here, I am never let down. You can't go wrong with any choice on the menu. The food is phenomenal and the employees (maybe owners) are very friendly. My only complaint is that I can't get this food 7 days out of the week!",
   "Food was good and hot... employees are nice and professional",
   "Farm fresh ribeye cheesesteaks and burgers, nothing else like this in the area.  Amazing!"
  ]
 },
 {
  "name": "note. bistro & winebar",
  "address": "1530 N 2nd St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6cacb70a-9330-11ea-8a7d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8037453842053928463",
  "source": "GoogleMaps",
  "reviews": [
   "Just dined there for the 2nd time. Tonight was the first of their Community Table events. Highly recommend. 4 courses paired with wine. Dessert was not included,  but I had it any way. Everything,  start to finish was excellent!",
   "Went here with my friend for my birthday.\nThe place is small but cute.\nVery romantic inside!! Great for date night!\nFoods are really really good! So moist and rich in flavors. They also sell and serve alcohol too.\nThe red beets salad were great and the duck leg also fabulous. I got the lamb with goat cheese raviolis with spinach and mushrooms. And my friend got pork chop.\nThey're both very tasty.\nDefinitely will make a come back!",
   "Absolutely amazing ! We drove all the way from Maryland just to come here and it was totally worth it ! If we could give it 500 stars we would ! Our server Danielle was personable, polite, prompt, attentive, and created the perfect experience for us ! The food was perfectly executed and the flavor pairings in each dish was impeccable. We WILL be back !",
   "The bartender was a delight a mixologist,host was the best and the chef and his staff food spectacular.",
   "If you're looking for high end food, this is the place. Perfect spot for a date night and probably the best pasta I've ever had."
  ]
 },
 {
  "name": "Aleco's Café & Restaurant",
  "address": "714 N 3rd St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6d07814a-9330-11ea-bed4-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "affordable",
   "free",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6379885169953972944",
  "source": "GoogleMaps",
  "reviews": [
   "We ordered a couple times now for delivery. Food was decent each time. The cheese steak has the bread you expect for an authentic taste. We'll order in future.",
   "Unique taste,  Affordable and well maintained.\n\nEmployees are very professional and well spoken.\n\nVery humble place to take your love ones.\n\nHighly recommended.",
   "They get 3 stars because the food was good (not incredible, just standard), and the price was fair. I'm taking off 2 because the restaurant was dead (only 1 other patron in there) and service was still kind of meh... and because I ordered and received water, and got charged for soda. Water is free - I'm pretty sure that's a law. I don't see how this could be an accidental mistake instead of some kind of bill padding. If you go here, be sure to check your receipt at the end.",
   "Friendly staff, good food, good location. Went for lunch, easy to get too on N 3rd St. Everyone is very friendly there, the food is good and the prices are good. Very clean restaurant.",
   "It was a bit tense in the kitchen during our visit as we heard some choice words come out of it. That definitely didn't give a good first impression but the food hit the spot and our server was very friendly and attentive."
  ]
 },
 {
  "name": "Cafe Huey",
  "address": "260 Championship Way, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6d504a62-9330-11ea-8696-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "walk",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8452207058061573974",
  "source": "GoogleMaps",
  "reviews": [
   "If you are looking for somewhere with really good food and decent prices this is the place to be. Located perfectly across from the river lookout a great place to sit and have a meal with your family and friends. The staff is kind and courteous and they are quick with the orders.",
   "Exactly what should be in this spitm. Good fresh food, drinks and ice cream",
   "My daughter and I stopped here after we did a walk around City Island recently.  The steamed clams, cod sandwich, potato salad, and the crab cake were all  some of the best we ever ate.  The service was wonderful and Cindy is great with conversation.  When I'm in town, I plan to stop here at least once a week.  Two thumbs up!",
   "Nice people good food. I hope one day we will see this place open year around.",
   "Awesome food ,great selection and service"
  ]
 },
 {
  "name": "2nd St Shawarma",
  "address": "316 N 2nd St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6daee558-9330-11ea-9a98-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17203781171128611612",
  "source": "GoogleMaps",
  "reviews": [
   "I love shawarma. Friendly service. Good food the right price. Not expensive or too fancy. Tasted like a home cooked meal.",
   "Loved the food! If we ever are in this part of Harrisburg again we will definitely be visiting. The staff was friendly and the restraunts was very bright and friendly.",
   "The best fresh Mediterranean food you can get. I have traveled the country and have never had fresher falafal than I had here. The flavor beyond authentic. Great prices as well you can beat the portion size. Amazing!",
   "Good place, and good service. The food is fresh so it's good. Wish it were just $1 dollar cheaper otherwise really good food",
   "Food was fabulous.  Loved my falafel wrap.  My table mates were also very happy with their meals.  And the dessert of ice cream and baklava was amazing.  Very casual, not a lot of atmosphere but will definitely go again.  And I heard they are expanding:)"
  ]
 },
 {
  "name": "Suba Tapas",
  "address": "272 North St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6df47a3a-9330-11ea-b64f-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "eat",
   "food",
   "delicious",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1496343898260813174",
  "source": "GoogleMaps",
  "reviews": [
   "Great tapas place. Loved the tacos El pastor and the lamb pops. Fun atmosphere and helpful wait staff suggested everything we tried and loved!",
   "This is by far my new favorite spot in Harrisburg. Tucked beside Rubicon and above Mangia lies the best tapas restaurant in Harrisburg, putting the almighty Cork and Fork at a distant second. Great Spanish wines, superb service, and delicious plates await you, but, show up early as the place is small (rustic) and it began to fill up quickly around 6p on a Saturday. Worth any wait you may have.",
   "One of my top locations for delicious spanish food. Good place to hang and eat some good food. I had a cousin come into town and asked me to take him back here. Bring your hunger - portions are large.",
   "Their drinks are excellent. I really enjoyed the firefly. \nThe staff is very friendly and helpful. \nThe food was was absolutely delicious! \nThe Suba tacos I got were amazing. The fish was nicely cooked and the mango was a nice touch.  The Monte Caballo was tasty but I felt like maybe you should get more than two for the price. They're very small but very delicious.",
   "Excellent service at the bar with great recommendations. Food and drink excellent. Shared our plates and left pleasantly stuffed and satisfied."
  ]
 },
 {
  "name": "Capow Jamaican Restaurant",
  "address": "1403 Market St, Harrisburg, PA 17103, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6e386134-9330-11ea-bb10-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "tasting",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17908654243407955841",
  "source": "GoogleMaps",
  "reviews": [
   "Yeah man,di best Jamaican any weh round yah seen👍👍👍",
   "The food is amazing bottom line",
   "Great food we make that 25 minute trip",
   "Food was terrible, rice soaked in gravy mac and cheese was rubbery as hell, i wouldn't recommend and i wouldn't go back, i had a better tasting meal at rice and beans on 17th st",
   "Delicious food, quick, expedient service. Only issue I had is the container size a bit small for price."
  ]
 },
 {
  "name": "Roxy's Cafe",
  "address": "274 North St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6e84faa4-9330-11ea-b694-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "delicious",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=5548403072261880966",
  "source": "GoogleMaps",
  "reviews": [
   "Friendly place just a short walk from the Capitol.  Stopped in for a quick lunch and they have a wide selection of great food.  Food and service were great.",
   "Delicious breakfast, fair prices. Great gathering place in historic area of Harrisburg.",
   "A favorite place for tasty breakfast. Staff is always super even when they have a full house. I had a cousin come into town and she asked me to go back here. The prices are good for what you get. Reminds me of a cafe in Chicago I liked to visit.",
   "The lunch menu appears unimpressive. I ended up getting a chicken salad, and was pleasantly surprised. Good quality ingredients and friendly staff. the place has that diner feel, and I would love to come back for breakfast.",
   "Breakfast was very good and not busy at all for a Sunday morning at 10:00 am. I would highly recommend to a friend and will definitely be back."
  ]
 },
 {
  "name": "Hilltop Restaurant",
  "address": "138 S 17th St, Harrisburg, PA 17104, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6ecf717a-9330-11ea-b8c7-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "walk",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=16104265608603526009",
  "source": "GoogleMaps",
  "reviews": [
   "Good prices and great food stop in for breakfast or lunch and maybe something for dinner if you are too tired to cook",
   "Dont let the appearance fool you the have very good food here in the coffee is brewed fresh all day  3/28/17",
   "Love their food and they offer Turkey options for non pork fans",
   "Great spot....... remind me of Brooklyn",
   "We wondered around town hungry as a horse...and we came across this gas station playin music. As we look over we see 'hilltop restaurant-soul food headquarter', interesed we walk in. We were greeted with such hospitality.  We both ordered smothered pork chops..it was served over rice and beans, with two sides. I got the amazing mac and cheese and cabbage. He got collard greens and sweet potatoes. Omg! Everything was freakin awesome. The rice was cooked perfect.  The chops were fall of the bone and perfectly smothered! The sweet potatoes were mmmmm delish! We gave kudos to the cook, it was that good. The guys there were awesome...oh and to make it better, he don't add salt to his food!!! (: we got 2 (1 meat 2 sides) w 2 drinks for $12 (lunch special, an hour after it ended)..plus what we tipped um..We had left overs for reheats, too. I hands down recommend this place to anyone searching for good eats.. they also have awesome breakfast specials...well definitely be back to gice a try.\n\n5stars!!!!!!"
  ]
 },
 {
  "name": "Appalachian Brewing Company",
  "address": "50 N Cameron St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6f2e0c5c-9330-11ea-b87f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "brewery",
   "creative",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11979814368184648590",
  "source": "GoogleMaps",
  "reviews": [
   "Great food menu first and foremost.  Cool place with really nice staff.  Beer isn't amazing, but it's not bad either.  The food honestly makes it worth having just an \"OK\" beer.  The craft sodas are actually really good as well, and if you haven't had them, they're worth trying!",
   "Great brewery with TONS of beers on tap. There is also a wide menu list, with plenty of varied food to try. There is something for everyone! Come in for a great time. Bar staff is great!",
   "This place is awesome! My first time visiting and I was impressed. The building is beautiful inside and out. It is comfortable and not too loud. The staff is friendly and efficient. The beer is great and the food is not only delicious and creative, its plentiful. Prices are mid range for food that is top notch. I was very impressed as was my guest. Thanks Appalachian brewing!",
   "Outstanding food! Tonight we had the Rockfish tacos and Bourbon trail tips. Everything was great including the vegetable sides dishes. You have two choices of sauce with the tacos. One sauce was a sweet spicy honey and the other was a tomato based. However the sauce already in the tacos was superb.",
   "The location and atmosphere are great. They might be trying too hard with the menu. Of the three plates we ordered, it seems like the burgers are the best way to go."
  ]
 },
 {
  "name": "Taco Solo",
  "address": "200 N 2nd St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6f846aba-9330-11ea-bf3a-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13816610574410714797",
  "source": "GoogleMaps",
  "reviews": [
   "The staff is wonderful. The food is awesome-Great quality, delicious, best salsas and guacamole. Great price and packaging is always perfect if you place an order for delivery. This is a gem of a restaurant. You can tell the care they put into the preparation and consistency with the items. Thank you!",
   "All of their food is great quality. I go here all the time for a quick lunch during work. They never disappoint. Always so fresh and delicious and the staff is super friendly too! Highly recommend! \n(this is a picture of their Rice and Bean Salad)",
   "Fantastic food and staff. Friendly and fast and always professional. I ordered today and when I picked up they were dealing with belligerent and frankly racist customers but the staff here never break their friendly and professional demeanor. I wish nothing but the best for this company and staff and will eat here often.",
   "Best taco in downtown Harrisburg, my favourites are grill fish taco, carne asada taco, and Red Green and White (guacamole, pico, and grill shrimps w/ chips) staffs are always friendly and nice !",
   "today I stopped at taco solo during a bicycle ride and was blown away at the service we received!  I highly recommend this place if you’re looking for amazing service to go along with their highly satisfying food! Thanks you Jorge and Angelina so much for going beyond you’re duties to accommodate us today!"
  ]
 },
 {
  "name": "Grilled Cheese Plus",
  "address": "405 Walnut St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6fcae912-9330-11ea-9465-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=1000774970467849692",
  "source": "GoogleMaps",
  "reviews": [
   "I had the Lady with Tattoos and it was sooo good. I had it on rye bread and had my egg over easy. Yeah that's right, it came with an egg in inside that delicious grill peace of food gold. I recommend this place to anyone who wants to give it a try. It's worth the little bit of money you're going to spend here, cause the prices are very good and the lady behind the counter was really nice and  Courteous. I enjoyed it a lot.",
   "Stopped for breakfast few minutes after 8 am on a Monday morning. As a vegetarian, it was great to see that they had a 'Create Your Own' choice on the menu. We ordered two grilled sandwiches (with veggies) along with hash brown patties. You could chose your \"cheesiness\" level - a nice customization for people who like their sandwich a bit cheesy!\n\nThe place has limited seating and a friendly service staff. We enjoyed our hot breakfast and will visit again. Hope they add more vegetarian options to the menu though!\n\nTip: Limited street parking is available right outside ($3/hr).",
   "The food was so, so good! And even though we walked in just before closing, they were super friendly and didn't give us any Hale about ordering. I also loved the aesthetic and atmosphere!Will totally stop by again if I'm in town again!",
   "Food was great and atmosphere was calming. Two for lunch was $21.99. I will be going back",
   "I grabbed a late lunch here - no wait at 2pm!  I had a Huevos Rancheros breakfast sandwich on the biscuit bread option - very glad I made that choice, it was delicious.  It took a bit longer than expected for my sandwich to be ready, but when I ate it I found out why - it was cooked to perfection.  Perfectly grilled, cheese just the right amount of melted, the fried egg was over-hard just like I'd requested... YUM!  The service was very friendly and helpful.  The sitting area was clean and they have made good use of the small space - seating for 20-25 at 2 and 4 top tables.  If you are looking for a leisurely place to sit and eat, I would recommend coming outside of normal meal times to beat the rush."
  ]
 },
 {
  "name": "Queen's BBQ & Southern Cuisine",
  "address": "912 N 3rd St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/701deb58-9330-11ea-bb3c-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "delicious",
   "food",
   "kids",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17582857016439599538",
  "source": "GoogleMaps",
  "reviews": [
   "Nice employees, food is presented well, and you'll try to eat all of it because it's so good but stop yourself if you have the willpower. Otherwise you'll end up like me, in a food coma. \nEat the ribs! \nI ordered ribs, sweet potatoes and collard greens.\nAll were absolutely delicious and just what I needed on a Friday of a very long week! \n💕",
   "I expected great food and was not disappointed! They were good to tell me the wait on brisket, which was unfortunately longer than my lunch break, and instead I ordered the pulled pork with some worry... I usually don't like pork all that much. This however has made my list of good food. Delicious, juicy, and so much meat that some fell out despite my best efforts. And I WILL be coming back for that brisket!",
   "I went in to see what the establishment was about, as I love southern food. I was pleasantly surprised not only by the food, but by the hospitality, and better yet a sign that showcased that they fed homeless and had an honor roll program for kids. It's amazing not only to have pleasant service and good food, but to see hardworking people who just started out giving back to the community! Good luck in all you do!",
   "Had the Maryland crab soup for lunch today and it was fantastic!  Very excited to try other menu items in the future.  Keep up the great work!! :)",
   "Great soul food selections. Just great food period! Very warm and welcome individuals, that you know care about their customers."
  ]
 },
 {
  "name": "The Midtown Tavern",
  "address": "1101 N 2nd St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/70610efa-9330-11ea-8148-14b31f159f22.png",
  "tags": [
   "unique",
   "music",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15325936246096452360",
  "source": "GoogleMaps",
  "reviews": [
   "Such a hidden gem. The atmosphere is really laid back, but well-maintained and fun. Lots of sitting room, a nice big bar, and pool tables. Their menu has all the classics - wings, pizza, etc - with some really fun twists and unique items as well. The Dark Side of the Mustard chicken sandwich is my personal favorite! They have a great beer menu with lots of local PA nods (they also make it a point to support independeny owned breweries, which I think is awesome). 10/10 will be back!",
   "I’ve always liked coming to Midtown (especially Taco Tuesdays!) but they recently started offering brunch. We came with a large group and half of us ordered the chicken and waffles. Without exaggeration, it was the best chicken and waffles I’ve ever had. It comes as a small sandwich and is made with a raspberry Melba sauce. The chicken was wonderfully seasoned. I’m probably going to be here every Sunday for the next month.",
   "We were there for the Millennium music conference. Got the best table right in front of the band. The sound has always been great when I go there for live music. The service is very good as well",
   "I had the Bacon Ranch chicken sandwich and it was delicious. The portion size was generous and the draft beer selection provided a good variety of relatively local craft beers! Service was excellent.",
   "I only came in here for a few beers but once I do give myself a chance to eat here I will update this review but so far it is a nice cool spot to chill. I do look forward to trying out their food so until I eat here, take care and I hope this place fits your liking"
  ]
 },
 {
  "name": "Phyllo Greek Cuisine",
  "address": "1233 N 3rd St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/70b263a8-9330-11ea-b9ed-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5074244263528875856",
  "source": "GoogleMaps",
  "reviews": [
   "It's in the Market but the whole atmosphere here is impressive. I like that the hummus is consistently fresh and flavorful. They are good and quick here.",
   "Delicious and authentic Greek food.",
   "Based on other reviews I acknowledge that maybe they were having an off day, but I did not enjoy my order today. I waited 20 minutes for a veggie pita and chicken souvlaki skewer. The pita was ok, nice veggie mix but no seasoning that I could catch. The whole thing was sort of blah and I didn't feel well after - like it didn't sit right. \n\nThe chicken souvlaki was offensive. As a Greek I have high expectations and honestly if you can't make a decent souvlaki...there's just no excuse. It was bone dry, and no garlic, lemon, or oregano to speak of. I don't understand how this could go so wrong. Guys hit me up, my recipe is bomb and I will seriously give it to you!!\n\nI'd wanted to visit this place for so long, and I was so excited. Needless to say I was incredibly disappointed.",
   "Our favorite spot to grab lunch. Love their gyros and horiatiki with pork or chicken. The food is amazing, and the staff is friendly. The only name I can remember is Thomas, he super nice and really easy to chat with. Definitely recommend.",
   "The Greek salad is insane!! We order it each month when we attend the 3rd in the burg."
  ]
 },
 {
  "name": "Yokohama",
  "address": "560 S 29th St, Harrisburg, PA 17104, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/70fcdaec-9330-11ea-aac8-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15352678120946745393",
  "source": "GoogleMaps",
  "reviews": [
   "If I could leave 0 stars, I would. I heard good things about this place so I decided to order food and have it delivered. They say they send you a confirmation e-mail after ordering. After almost 30 minutes, I hadn't received it so I called to verify that they had my order. After saying yes, the girl on the phone then hung up on me. An hour and 15 minutes later, I still had no delivery. I called again to see where my order was and POLITELY said that it had been over an hour. She god rude and proceeded to tell me that I only ordered 30 minutes prior. My call log clearly stated an hour and 14 minutes had passed. She proceeded to scream back to her kitchen (I'm guessing) and then said, it's on the way and hung up on me again. If you're looking for politeness, I'd advise you to stay away from this place. Coming from a customer service position, I strive to be unlike these individuals every single day. Oh yeah, I still haven't gotten my food yet....",
   "I actually was not looking forward to it but I have been surprised. The General TSO chicken was amazing , great times and very great atmosphere 🙏🏾👍🏾👍🏾👍🏾. Food was nice & hot not a long wait. They play certain foods on metal dishes which keeps the food hot while your eating as well !!",
   "I order from Yokohama online (beyondmenu app) all the time. Like several times a month, over the past probably 2+ years. From all of those orders, they only ever made ONE mistake. They had written my order down for pick up instead of delivery. Pretty minor mistake, which they immediately fixed after I called in by sending someone out to deliver it. They even tried (unprompted) to give me a discount for the wait. I gave the full amount + tip, and I'm pretty sure this just confused them.\n\nSorry, but I'm not sorry. Here's the thing: I appreciate what they do and I love their food. I don't think any less of them and I will continue to order regularly. They've never messed up the food in my orders (kind of unheard of in this industry) and the attention to detail in packing everything for travel is impressive. Perhaps most important: everything is delicious!\n\nIf you haven't tried Yokohama yet, why not?? And if you have, but they happened to make a mistake, why not try them again? That might've been the only mistake they make for you for 2+ years.",
   "Everything is \"OH SO FRESH\"! So we wanted to have Asian cuisine for Valentine's day. The first place we went to was overly packed and highly disorganized. The second place we tried making a reservation only to have then tell us they have to push it back an hour and a half. We got to our car, did one last search to try and find something locally and Yokohama popped up in the search bar 4 min away from where we were at. We got there and there was just 1 other couple in there so I was a bit sketched at first. But once I started trying the appetizers and random pieces of sushi or shisimi the taste was probably the freshest I've experienced since I started eating these delicacies. Will definitely go back again and will probably not go anywhere else just based off of the QUALITY of their food. Plus their wasabi is DA BOMB!! THANK FOR A GREAT TIME YOKOHAMA!! BE BACK SOON!",
   "You'd never know this was here, just riding by, it looks vacant. The food is ALWAYS fresh. Service isn't super fast, but I've had slower, so I don't mind. I took my kids (6 and 8 years old) but there's no kids menu. They split a hibachi chicken entree. The Thai iced tea reminds me of bubble tea(A MUST HAVE) and the appetizer was piping hot. Arrived around 5:35 on a Friday and we were the only patrons dining in. By 6:15 the place was half filled. In a nutshell, this place is a gem, for sure!"
  ]
 },
 {
  "name": "Federal Taphouse",
  "address": "234 N 2nd St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7150a062-9330-11ea-8189-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1369558457871005646",
  "source": "GoogleMaps",
  "reviews": [
   "This bar is awesome. They have over 100 beers on tap and great food too. I highly recommend the bison burger and poutine fries. The bartender was very knowledgeable and gave me a great sour beer recommendation. If you're in the area I highly suggest checking out this place.",
   "Excellent wood fired pizza.  The pepperoni has a superior taste.  I highly recommend.  I will say the personal pizza is large enough to split.  It is a nice size.",
   "First time here and it was quiet at the time. 100 beers on tap! Bartender was very helpful in choosing a beer that's close to what I normally like. Cannot wait to go back and try different drinks!",
   "The service is always nice. The only thing that I dislike is that the food is way too pricey for the quality you get. They're also hardly ever busy, so it's a good place for a large group, but not if you're looking for a high-energy bar.",
   "Chris was a phenomenal server and made sure I was taken care of. I had the fig and pig pizza. It was savory and full of flavor. First time here and I plan to come back to explore the menu further!"
  ]
 },
 {
  "name": "Quigley Restaurant & Tavern",
  "address": "1517 S Cameron St, Harrisburg, PA 17104, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/71a6d710-9330-11ea-8a24-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=13041902840054172308",
  "source": "GoogleMaps",
  "reviews": [
   "Friendly atmosphere!!😊",
   "Great little dive bar. Food is great. Their wings are the best around. The beer is cold and served in a chilled mug. Prices are fair. And love my bar goddess Kellen.",
   "Nice comfortable place",
   "Awesome hometown bar with cold beer and awesome wings!",
   "If I could give zero stars I would. We just order lunch to go from here. I ordered a turkey club. It came on a sub roll and the turkey looked like rotting flesh. Rubber sub sandwich going directly in the trash! I couldn’t even bring myself to take in bite!!"
  ]
 },
 {
  "name": "Mariama's African and Jamaican Restaurant",
  "address": "1029 Market St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/71f06346-9330-11ea-b8fe-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3865877606343714955",
  "source": "GoogleMaps",
  "reviews": [
   "The food is GREAT here. My favorite dish would have to be the oxtails and rice n beans. The food portions are HUGE. I usually divide 3 portions from just one plate.",
   "I’m a vegetarian and I ordered their rice and beans with cabbage and onions on top- best decision I’ve ever made! Nothing better. Friendly service and great prices. Get the hot sauce and coco bread, and you’ll have the best meal ever.",
   "The reviews on this Restaurant are hilarious! The owners are all African! There will be cultural differences, be respectful. The Restaurant is seat yourself, and there is an African family vibe that I love. \n\nAlso, this Restaurant  mostly caters to west African foods. Wouldn't recommend the Jamaican foods bc the cooks are from Niger. Great west African soups!\n\nAmericans- go for the meat pies! : )",
   "Authentic and home made food. It was a great restaurant for some very different food than we are used to eating. Great prices and service!",
   "Was traveling from up state PA to Philly...Greyhound overlay in Harrisburg so decided to find some close good grub, found a gem. Good blend of African and Jamaican food. I got the Curry Chicken, but it smelled like African food..it was kind both, was good though!"
  ]
 },
 {
  "name": "Soul House Cafe",
  "address": "1852 North St, Harrisburg, PA 17103, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/72364612-9330-11ea-8c17-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14664291840241244056",
  "source": "GoogleMaps",
  "reviews": [
   "Do not be fooled by this rough exterior, the food is to die for!! Full of the right flavors, made with love you can taste. The cake is amazing (lemon is my favorite).  The catfish is crispy and tender at the same time (without being slimy inside the batter) and the everything wings are a must try!!",
   "I STOP BY TODAY SURE GLAD I DID IT WAS ONE OF THE BEST CHEESEBURGER SUB I EVER TASTED 5/25/17",
   "twice a year, i get to eat anything i want. i love this place.  prices are good. since i found it, i always order fried fish, mac/cheese, greens or cabbage.  love the fish and cornbread every time.  a few weeks ago, cabbage was bland; the mac/cheese was just boiled mac w cheese on top.  disappointed to say the least. since we have to buy whole dinners, be consistent w your sides. i gave 5 stars cause the food is almost always perfect. for 1 who only gets to eat soul twice a year, i need satisfaction both times.",
   "Good Soulfood! This was my first visit but not the last.  The food was Hot, fresh, and delicious.  Because I'm from Florida I know good soul food and this was Good.",
   "The food was very good. I loved the collard greens, baked beans, mac n cheese, wings, shrimp. It was all so good. We are from the south and its hard finding a place that has good southern foods. We will be back"
  ]
 },
 {
  "name": "Emerald",
  "address": "2300 N 3rd St, Harrisburg, PA 17110, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/727aa252-9330-11ea-9188-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "cheap",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14984958142292432723",
  "source": "GoogleMaps",
  "reviews": [
   "Well I move here to Harrisburg 2 years ago and I never could find a good Chinese food so my sis told my wife about this place so just 20 minutes for the first time I try it and I have to give u  a 5 stars because the ladies was nice the food is amazing keep up the good work",
   "Favorite Spot... Fried Chicken, cheese fries, shrimp egg foo young, Shrimp Chow mein allll of that is on point.",
   "Grew up a couple blocks from this spot and it’s always been a gem. Not much for atmosphere inside there lol 😂 but the food is always tasty and they hook you up with good portions too. Known for chicken wings and General tso’s.",
   "Lived in Harrisburg for 8 years before coming here. What have I been doing with my life!?\n\nI think this may be one of those places that remains a well kept local secret. Lots of foot traffic on a Thursday night.\n\nService was friendly and prompt, food was cheap and fresh. I’d recommend this to anyone looking for some fairly cheap and very delicious take out. \n\nI recommend the bean curd in house sauce, you could easily feed 2 with it on the cheap. General Tso’s chicken is also plenty good. Be forewarned they want $8+ to use a credit card.",
   "The atmosphere of this restaurant was, bad to say the least. The food however was great! Get to this restaurant on busy days and you won't regret it because there is a lot of fresh food and for $8 not much else to say other than it looks to have a lot of parking and it is quick, looks be in a shady part of town but don't be intimidated it's a good restaurant at heart."
  ]
 },
 {
  "name": "Ted's Bar & Grill Midtown",
  "address": "1313 N 2nd St, Harrisburg, PA 17102, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/72c1e4b0-9330-11ea-910c-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16671608147736946241",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice staff! The wings were ultra yummy and the fries were perfect!! Good food to veg out and watch a movie 😁",
   "It took a while to get to place an order but once order was placed food came out very fast. Chicken gyro was very good, fresh cut fries are good as well. Their wing sauces are very unique and good. Beer was a little pricey, a draft of Dirt Wolf IPA was $7.",
   "Good food with what appeared to be an updated menu since the last time I was there. The fish sandwich was hand battered and tasted great. Very good and the cream of crab was excellent as well. The food and prices are worth it.",
   "A favorite hangout with a view of the river. Great beer selection and great food. A really fun place the the deck has the doors up.",
   "Food was great! I had the Crown burger and she had a Rueben, both looked great and tasted better. Also tried the Maryland Crab soup and it was also great! Typical sports bar scene that had plenty of TVs with all the games playing. Had a view of at least 3 games from my seat and could see 2 more if I looked around. The service was a bit slow but they were packed full so that's to be expected. The staff was friendly and very personable, did not feel neglected even tho they were very busy. We will be back next time we're in midtown for anything."
  ]
 },
 {
  "name": "Flamingo Grill",
  "address": "317 Market St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7300265c-9330-11ea-bc48-14b31f159f22.png",
  "tags": [
   "food",
   "cheap",
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=14809381872493216745",
  "source": "GoogleMaps",
  "reviews": [
   "The best pancakes I ever had came from right here at Flamingo. Great food and atmosphere.",
   "Great cheap breakfast.",
   "Good food.. great people.",
   "Great food and staff I will be back when in the area",
   "Meal wasn't that good, but it was a nice chill spot to read and eat."
  ]
 },
 {
  "name": "El Rancho Restaurante y Pupuseria",
  "address": "210 N 3rd St, Harrisburg, PA 17101, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/73451f6e-9330-11ea-8687-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "family",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=2092142268774379506",
  "source": "GoogleMaps",
  "reviews": [
   "AUTHENTIC & DELICIOUS QUALITY FOOD! \nSo sad I couldn’t get a picture of my entree. Deserts are made to order and from SCRATCH!! You can see them cooking your food. The place is very clean, kid friendly and friendly staff. The food was PERFECT! Fresh, flavorful and good amounts. This place is a 10 STAR! The best is PA for sure!!!",
   "Ok to start I want to tell you that this place is a gem. The staff is super friendly, ask for Ana she is super nice and attends so nice, you won't be disappoint. Those who work in the kitchen they have a special hand for cooking. The truth is that I recommend this place, to eat,hangouts and have a good time, they will make you feel welcome and treat you like family. And I travel from Lancaster which are about 45 minutes and it's really worth it. Authentic Mexican cuisine with a lot of flavor.",
   "Listen, guys. I NEVER write any reviews, but tonight I feel like I have to. This food is absolutely AMAZING! Tastes like authentic home cooked food, unbelievable. My husband and I are very impressed. Great way to celebrate Cinco da Mayo! Ordering again soon, for sure!!",
   "I was very impressed with El Rancho. Me and the wife decided to come in on a sunday afternoon when half the restaurants in Downtown Harrisburg are closed. I had some tacos and she had a taco salad. The flavors of everything were top notch. I hope this places gets more business because it definitely hit the mark for us.",
   "I wanted tacos, so we came into Harrisburg on a Saturday afternoon and none of the other restaurants opened until 4:00 p.m. We found that this place was open and fit the bill for my taco craving. It was delicious and fast!"
  ]
 }
]