[
 {
  "name": "Elizabeth Park Conservancy",
  "address": "1561 Asylum Ave, West Hartford, CT 06117, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/738e0f58-9330-11ea-b8b3-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "walking",
   "parks",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=3840179562941772669",
  "source": "GoogleMaps",
  "reviews": [
   "A lovely place to visit anytime of the year. Bearing in mind that flowers are seasonal and peak season for roses is in June.  This gorgeous park also offers many gardens of other flower varieties to enjoy in spring, summer and fall.  Year-round visits take you through acres of walking trails winding around specimen trees and other lush vegetation.  An occasional spotting of a Great Blue Heron at the pond with other water fowl makes it extra special.  After meandering about relax on a bench or bring your own blanket and take in all the beauty.",
   "The park is beautiful with lots of areas to walk around and different gardens full of roses. The pond is lovely. The Pond House restaurant in the park is also great. It's a lovely place to visit in all seasons, and great for walking the dogs too!",
   "Well 1st off,it's winter so nothing was in bloom. However I love parks and I ended up there as I was doing some rideshare driving and I found my way in the area and couldn't resist. So the layout is beautiful. the park was very clean. Some parts looked romantic. I also love tree's. So I enjoyed those. I'm definitely going back when everything blooms. They had all the different species(of rosebushes) labeled.",
   "Good place to be when your stir crazy from quarantine. Social distancing and great scenery",
   "So pretty to walk around. The area is not huge but the space is well taken care of and a nice visit of you have some time and friends to walk and talk with :) great place for pictures if you like floral and landscape/garden settings. Depending on when you go some flowers might be going out of season so go earlier in the summer for a fuller scene"
  ]
 },
 {
  "name": "Connecticut Science Center",
  "address": "250 Columbus Blvd, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/73d4b57e-9330-11ea-a95d-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food",
   "kids",
   "free",
   "food",
   "learn",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15444590483587269234",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to spend a day with the family. Lots of fun and learning activities. There is a 3D theater with several shows a day. Butterfly exhibit is very enjoyable. If you are lucky, a butterfly may just land on you. There is a separate fun playground-like area where the kids can play with the water-based machines. For the water activities, there are rain covers available of various sizes. I would recommended that the parents bring a pair of water-proof shoes for the child since the feet do get wet. There is a food court offering a variety of sandwiches and pizza. There is a tea and coffee stand, a snack vending g machine and a Frozen yogurt stand.",
   "In my option this is the best kids museum in the state. There are multiple floors of learning entertainment for kids of all ages. On the first floor there’s a water play area. On another floor there’s space, LEGO play zone, and an environmental area with live animals and. A flowing river to understand water dynamics. They always have rotating exhibits like a live butterfly garden and an energy STEM exhibit. The place is always clean and well cared for. A bonus is the great view from the top floor of Hartford and the Connecticut River. For food, there’s a subway and ice cream place. The gift shop has awesome stem toys. To note: the parking garage I the building is often full when there’s a convention at the convention center next door but there are other nearby garages within a block. \n\nIn the past they have done an exchange with Mystic Aquarium whereby your membership at one gets you in the other for a month for free.",
   "Wow, this place is packed with so many neat exhibits and things to learn and experience. You can touch, listen and play while learning with all ages. There's dinosaurs to how sound works to energy and lights. Great place to check out with kids or just yourself. Cant wait to go back.",
   "Kids love to come here. They had a cool sock skating rink that the kids thoroughly enjoyed. They change out different areas which is nice so that there is always something new to see or do.",
   "The CT Science Center is excellent on many levels...Six exactly.  The different exhibits they offer are for a wide variety of ages and they switch things out frequently enough that you never feel like it's an old hat.  We were gifted a membership and it's one of the greatest gifts we could have ever received.  Certainly one of Hartford's shining stars."
  ]
 },
 {
  "name": "Bushnell Park Carousel",
  "address": "1 Jewell St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/741cbb2c-9330-11ea-acb2-14b31f159f22.png",
  "tags": [
   "kids",
   "affordable",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=4105488620105195403",
  "source": "GoogleMaps",
  "reviews": [
   "I LOVE this place! My kids and their friends do too! The staff is super friendly and accommodating. We just held a birthday party of my daughter who was turning 3 and I can't stop saying good things about my experience. Our guests loved the place, the helpful staff, and the facilities. The price for the birthday was ridiculously affordable, and the staff bent over backwards to ensure everything was perfect! This is gem in the Hartford area and more of us should support it!",
   "Love the park the carousel,so nice. I visited when Santa was there, amazing experience they also had the ice skating what a experience the kids loved it. will be back for other future events.",
   "It's not something you see very often anymore, a good old-fashioned carousel. what I found disappointing was that they had two signs hanging from the ceiling and very large print saying \"BE NICE!\" The explanation point was part of the sign not something that I added.",
   "The horses are beautiful and it is a very charming place. I used to go there when I was little, and I still love it. :)",
   "Free ice skating...yes..FREE  skates and Free ice time. They also have Free lessons on Saturday morning. It's Seasonal so check the website. They do sell Hot Chocolate."
  ]
 },
 {
  "name": "The Mark Twain House & Museum",
  "address": "351 Farmington Ave, Hartford, CT 06105, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/747256b6-9330-11ea-a12d-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "tour",
   "tour",
   "free",
   "history",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=412189419859660495",
  "source": "GoogleMaps",
  "reviews": [
   "Enjoyed touring the Mark Twain House & Museum. The writer loves WOOD!!! so you will see the beautiful woods everywhere inside the house. The writer had a great taste for designing house requiring a lot of woods. Every room of the house I visited had been impressively restored to beautiful condition. Taking photos inside home and touching any thing is not allowed!!! Great historical location. Highly recommend so you won't regret!",
   "As a big Mark Twain fan, this was a treat! Highly recommend the reenactor-guided tours. Our guide, Samuel's daughter Suzie, was so knowledgeable!  She made the tour especially interesting with little tidbits of information you wouldn't know to ask, all shared from Suzie's perspective. Truly a delight!",
   "A fantastic museum and a look at a very different time and way of life. Easy to get to and park. Great museum store. Tour guides are fantastic. A bit pricey but totally worth it and there are different pricing options. Will go again for sure.",
   "Of course this is a must place to visit if you are interested in culture, history and famous writers. Very interesting and informative tour. Guide is super friendly and knows a lot! Museum as well. Free parking. Clean restrooms.",
   "Great living history tour.   Well worth the trip.  Will come back  and take the tour by George the Butler or the maid! Tour guide excellent!"
  ]
 },
 {
  "name": "Wadsworth Atheneum Museum of Art",
  "address": "600 Main St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/74c6903e-9330-11ea-b7db-14b31f159f22.png",
  "tags": [
   "art",
   "walk",
   "history",
   "food",
   "free",
   "tour",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1727727471248975113",
  "source": "GoogleMaps",
  "reviews": [
   "A really impressive collection.  Plan on spending the entire day exploring the galleries.  Nicely annotated and displayed.   The cafe was a nice place for a light meal.  We will definitely need to visit again.",
   "Weddings at the Wadsworth Atheneum are my new favorite thing! As a professional photographer based in Hartford, I absolutely adore working there. The space is so inspiring and just perfect for art + Hartford lovers! You and your guests are surrounded by art and sculpture and color which creates a wonderful backdrop for your day. Love this venue as a Hartford local and artist!",
   "History museum is really quite good. Better than I expected. A beautiful building easy to walk around and a very manageable collection. In addition we had lunch in the cafe and the food was great. I would recommend this excursion to anybody looking to spend some museum time in the Hartford area. It is $12 per adult for admission however.",
   "A must-see visitors museum. A local favorite that many locals fail to enjoy to its fullest offering. The many galleries provide great viewing of rotating exhibitions and permanent ones.\nPlenty of transportation options afford easy access to this great location in downtown Hartford. Free coat room services and nice cafe.",
   "A beautiful home lovingly restored to the Clemons family era. Highly recommend a living history tour. George Griffin,the butler, gives a fabulous view."
  ]
 },
 {
  "name": "Elizabeth Park Rose Garden",
  "address": "1561 Asylum Ave, Hartford, CT 06105, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/75148b10-9330-11ea-9f73-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "eat",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7062509474654055556",
  "source": "GoogleMaps",
  "reviews": [
   "I got married here and I recommend it to my mother in law and she also got ma\nTried there too. Great place to see some beautiful roses. Bring your dogs and take awesome pictures, kids and just friend with blanket conversing. We took great pictures here. I would recommend here for shoots",
   "If you need a small walk filled with some flora you can actually casually admire, this is the place to be. When the flowers are in full show it may be busy and a bit noisy. All adjacent grounds are appealing too and worth a visit. Parking is spread out. There's a sit-down place to eat and a small path/ trail on the grounds.",
   "This is always a great destination especially when the weather is good enough for a walk.",
   "Lots of trails and beautiful gardens. Nice place to spend an afternoon.",
   "Nice place to unplug, stretch your fit on green, and if lucky to see show on new build3 arena.  And flower, flowers."
  ]
 },
 {
  "name": "Bushnell Park Foundation",
  "address": "99 Trinity St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7562d2a8-9330-11ea-bb2d-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=14153132506615250314",
  "source": "GoogleMaps",
  "reviews": [
   "This park is beautiful there's a lot to see a lot to do, whether you're into people watching, bird watching, I just watching the leaves fall. It is quiet, peaceful, and a place that I would visit again and again and again.",
   "Neat and well-maintained park. Enjoyed walking around and taking pictures of the green space and the modest Hartford skyline. The place felt safe overall during the day. Street parking available close by.",
   "Bushnell Park is clean a nice place to walk your dog place ball with your Kids or simply sit and watch all the people that are doing this type of things. Its a place where You could grab a blanket and have a picnic or just sit and talk. Very  Peaceful.",
   "Bushnell Park is a gem in the heart of Hartford. I visited on a Saturday morning with friends and their children, and the kids enjoyed climbing, jumping, and swinging at the brand new playground, which just opened in November. It is located just next to the carousel, making for a fun few hours. I appreciated the way that the playground was designed to evoke nearby architecture, and my friends' elementary-aged son appreciated its educational aspect. He pointed out to the adults that there was information about how bills become laws, presented in a way that kids could understand. I don't often find myself in downtown Hartford, but my recent experience at Bushnell Park gives me a great reason to return.",
   "Trees are dying.  Who is taking care of them?  The largest oak is in need of help.  Please attend to the trees."
  ]
 },
 {
  "name": "Connecticut's Old State House",
  "address": "800 Main St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/75b22b5c-9330-11ea-b57b-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "history",
   "unique",
   "learn",
   "tour",
   "history",
   "knowledgeable",
   "free",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=1307383078817442113",
  "source": "GoogleMaps",
  "reviews": [
   "A good tour of the old state house.  Interesting history facts.   The room of curiosities was a surprise.  The basement had exhibits about Connecticut industry and history.",
   "I've walked by The Old State House hundreds of times, but never thought to go in. When I finally did, the staff was so friendly and willing to give any information when asked. And they offered guided tours as well.\nIf you're a AAA member it's only $3 to get in. I spent about an hour here, about 15 minutes on each of the top floors and the rest on the bottom, which has a small museum set up about the History of Connecticut.\nIf you have a little time to spend, I recommend stopping in and giving them your support. And you can see a gorgeous painting of George Washington, one of the only originally located portraits by Gilbert Stewart in the country.",
   "Amazing building. Historical information and unique items. There is information on on the 1839 slave ship La Amistad",
   "Wonderful place to visit with always more layers to it than meets the eye. Long a centerpiece of Hartford and the state of Connecticut, this modest building packs in more exhibits and history than any single tour could cover. The tours are information-filled to be sure, and they leave you with your head buzzing and an appetite to learn more. The OSH is continually evolving, incorporating new historical facts, adapting to new audience perspectives and needs, and introducing new programs and ways of experiencing history that the modern visitor will find relevant and provocative.",
   "I really liked taking the tour. The tour guide was super knowledgeable and you could tell she was passionate about the subject. She had answers for literally every question and detail. Methinks she studied extra information in her free time."
  ]
 },
 {
  "name": "Cathedral of Saint Joseph",
  "address": "140 Farmington Ave, Hartford, CT 06105, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/75f9e2ee-9330-11ea-bafa-14b31f159f22.png",
  "tags": [
   "music"
  ],
  "link": "https://maps.google.com/?cid=16391279802796417456",
  "source": "GoogleMaps",
  "reviews": [
   "My mission is to visit all CT catholic churches and this was #39. There is Street parking and a lot behind the cathedral. The exterior is modern and 'cold' but the interior will take your breath away. Open, spacious and modern but traditional in that it had the stained glass. But it's all very grand and absolutely gorgeous. The ceiling lights are shaped like stars and they look 3-D. This is one of the most amazing churches I've seen to date.",
   "I had a great pleasure to see polish folk music group \"Ślask\". Wonderful place, great acoustic. I love this place.",
   "Wonderful liturgy in a Most beautiful church!  Organist and Cantor we're magnificent.  Preaching was extraordinary!",
   "The House of  Our Lord. ,,it's a peaceful place to visit and pray\nI felt the Holy Spirit coming to me.....",
   "The Cathedral of Saint Joseph, the mother Church for the Archdiocese of Hartford, is always an inspirational experience.  The sheer size and height of the space are humbling but it's the enveloping affect of the stained glass windows the worshipper is left with.  The narrative expressed is clear and in combination with the intense colors, the overall experience is heartwarming, breathtaking, and draws the person forward to focus on the altar, the center of Catholic worship."
  ]
 },
 {
  "name": "Riverside Park",
  "address": "20 Leibert Rd, Hartford, CT 06120, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7658cc52-9330-11ea-aeaa-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "family",
   "walking",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=449769619430400379",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for just winding down or having a friends and family cookout. Kids are welcome, great play area, very clean. Peaceful. Gazebo is beautiful and the after serene",
   "That's a go to store you find all kinds of good stuff",
   "Very nice park overlooking the Connecticut river.  There are lots of things to do here for the entire family. There's a nice river trail for walking  connecting downtown Hartford, play area, basketball court wall/rock climb, and a Gazebo if you want to host a party or just getting together with the family. Also,  there's a boat house and I've seen people boating. There a sport area for soccer, etc.",
   "Very nice park, only downside is it's close to the highway but that's hard to avoid",
   "Great moon light hike along the Connecticut River with the River Front Recapture Group!"
  ]
 },
 {
  "name": "Museum-Connecticut History",
  "address": "231 Capitol Ave, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/76ab8026-9330-11ea-acb7-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "history",
   "free",
   "library",
   "history",
   "library",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13444578608618512267",
  "source": "GoogleMaps",
  "reviews": [
   "Lots of great history! Self guided tour with lots of great information. Great price (free!)",
   "This is the smallest state museum I've seen and the most in need of a budget infusion.  Times are tough, no one wants to pay for educational places.  Still, in their exhibit on Colt firearms, one of the typed tags had an incorrect word crossed out and rewritten.",
   "Small museum that can be visited in under an hour. Admission is free. The exhibitions are a loose collection of local items and memorabilia. While interesting when seen individually, they lacked the cohesive story and narrative expected of a history museum. Also missing are the exhibitions that would fill the gap and allow visitors to piece together a story. Some serious curatorial work is definitely in order.\n\nThe museum is in an elegant building that also houses a public library and courthouse. Check them out as they are quite beautiful and picture-worthy.",
   "Fascinating exhibits, which is focused on Connecticut’s government, military and industrial history, trace the growth of our state and its role in the development of the nation. The collections include portraits of 72 Governors of Connecticut, American coins from as early as the 17th-century and Colt firearms.\n\nInterestingly, the 231 Capitol Avenue residence, which is located across the Connecticut State Capitol, is made up of Connecticut Supreme Court, State Library, and Museum of Connecticut History.",
   "Spectacular building. Uber friendly staff."
  ]
 },
 {
  "name": "Harriet Beecher Stowe Center",
  "address": "77 Forest St, Hartford, CT 06105, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/76f13be8-9330-11ea-bcd8-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "art",
   "history",
   "food",
   "field",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=4356372178507467628",
  "source": "GoogleMaps",
  "reviews": [
   "Really interesting conversations with the group we were with and our guide that added spice to an already interesting, awesome author. Different way of presenting a historical property and really focused on a forward thinking Harriet Beecher Stow. Also check out the Mark Twain house next door. Hartford was an exciting mecca of writers back in the day.",
   "This was a fun last minute thing to do and well worth it. Our tour guide was well informed and funny. Made it well worth it... I had a great time and learned a lot. Thank you. Highly recommend. 👍🏻",
   "An extremely well curated museum that recognizes the parallels between history and the present. The tour was enjoyable and relevant to modern events, despite taking place in a 150+ year old house. The house itself was beautiful and almost all of the furniture and art is original. Best of all, the gift shop focuses on modern political movements and writings that echo the importance of Beecher's work in her own time. This is an important museum in our time and does not feel like a dated history lesson. Well worth the trip.",
   "Excellent historical landmark. The guides are very helpful. You will get a deep look into America's dark past of slavery. The ticket counter offers a discount of $3 if you show them your ticket from the more famous Mark Twain museum. This place also has a restroom, so it's helpful for travellers. There are also a number of food joints nearby, a little up the street like Domino's Pizza and some others.",
   "Went with a field trip. The tour guides were great. They were informative and kept the children engaged."
  ]
 },
 {
  "name": "Friends of Elizabeth Park",
  "address": "1561 Asylum Ave, West Hartford, CT 06117, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/774aa6f0-9330-11ea-8700-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=14369852060197497557",
  "source": "GoogleMaps",
  "reviews": [
   "The Spring flowers are blooming.   Beautiful display of Tulips.  Elizabeth Park is a true gem for Harford",
   "Gorgeous ❤️",
   "Awesome",
   "",
   ""
  ]
 },
 {
  "name": "Great River Park",
  "address": "301 E River Dr, East Hartford, CT 06108, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7795b9cc-9330-11ea-9b64-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "walk",
   "walk",
   "art"
  ],
  "link": "https://maps.google.com/?cid=9864561278591544070",
  "source": "GoogleMaps",
  "reviews": [
   "Love the view and the length of the trail. Being by the water at any time of year is always nice.",
   "Great place to walk by the Connecticut River or sit down on a bench and enjoy it. It has walking trails in case you choose to exercise or simply walk your dog. There is a boat dock in case you want to sail your boat on the river. You can cross the bridge in the end of the park and you are in Downtown Hartford within minutes. Great place for families.",
   "Great River Park is a great place to take either a run or a walk in either Hartford proper or East Hartford.  Walker/runners can access The Riverwalk foot bridge  and cross the Connecticut River.  The whole park is scenic and there's other folks around during midday, which makes it a very safe place to exercise.",
   "This park is one of my favorite places to go for walks. Depending on which direction you go, you will come across lots of wonderful things. One side has a lot of plants and cool trails of varying difficulty, and the other side takes you farther along the river and to different art installations having to do with a former U.S. president. It's really quite lovely. The walk has plenty of benches but due to the fact that the park floods up to a certain level every year, not all of the benches are safe to sit on. Overall, it's a nice easy walk in either direction that can get you some great photos and won't be too difficult if you have a mild disability or are in a wheelchair. It's also quite romantic at sunset, and a known spot for families and lone people that love the view from their car.",
   "The only problem with this park is the stench from the trash to energy plant across the river, It's a shame that the d.e.p. does nothing about it.\nI am hoping it closes soon! I have complained for twenty years plus to no avail, this facility has ruined Hartford,  East Hartford, Wethersfield, and anywhere else you can smell the rotting garbage!"
  ]
 },
 {
  "name": "Butler-McCook House & Garden",
  "address": "396 Main St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/77efe80c-9330-11ea-b243-14b31f159f22.png",
  "tags": [
   "unique",
   "historic",
   "history",
   "family",
   "family",
   "history",
   "music"
  ],
  "link": "https://maps.google.com/?cid=5092491194388017161",
  "source": "GoogleMaps",
  "reviews": [
   "A wonderful museum with a unique setup where part of the home is a more traditional museum space and the remainder is a historic house museum.  The history of the family is very interesting and the architecture of the home is stunning.  We had a young high school student as our guide on Connecticut Open House day and he was wonderful!  The garden in the back is very peaceful and worth a moment of quiet.  You can't even tell that you are downtown Hartford.",
   "This was my first visit to the Butler McCook House. The garden is beautiful. I was surprised at the amount of Chinese artifacts that were there in addition to the New England treasures!",
   "This is a fascinating place to delve into Hartford history through the lens of a family who stayed in their house over many generations while Hartford downtown grew up around them. Four siblings last lived in the house until their deaths, and the story of their lives captured the interest of our whole family.",
   "Great location for music with Among the Acres",
   "Truly an Oasis in the middle of a City Desert(Concrete Jungle), with a beautiful assortment of flowers, bushes, and trees, it is another world inside the city of busy businessmen, we need to slow down and smell the roses😁🖖❤🙏"
  ]
 },
 {
  "name": "Soldiers & Sailors Memorial Arch",
  "address": "15 Trinity St, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7836b51c-9330-11ea-9140-14b31f159f22.png",
  "tags": [
   "history",
   "structure",
   "history",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=4743464701600330488",
  "source": "GoogleMaps",
  "reviews": [
   "It is a huge arch. This memorial is such a majestic city landmark. Its so beautiful even just driving through or gazing from Bushnell Park. We couldn’t climb but Im sure it would be worth it. This is truly a gem in the middle of the Hartford. Autumn season is the best time ti visit.",
   "Eye-catching structure welcoming visitors to Bushnell Park and the State Capitol. I was curious about its history so I checked the park website and learned that:\n\n\"The arch was dedicated on September 17, 1886... to honor the 4,000 Hartford citizens who served in the Civil War, and the 400 who died for the Union... Be sure to read the bronze plaque under the freed slave which honors the 128 African American residents of Hartford who fought for the Union...\n\nThis Gothic monument is made of brownstone from Portland, Connecticut, and cost about $60,000 (from the city treasury) to build.\"",
   "Very nice park! Lovely to take a stroll around! Great views of the capital. A little piece of history!",
   "When you’re in Bushnell Park, it’s worth a diversion just to look at this edifice up close...its really a marvel of engineering and worthy of one’s eyebrows to be raised for what it memorializes!",
   "Historic, iconic."
  ]
 },
 {
  "name": "Fernridge Park and Pool",
  "address": "567 Fern St, West Hartford, CT 06107, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/787c97f0-9330-11ea-8463-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=5319895424115970223",
  "source": "GoogleMaps",
  "reviews": [
   "Great Precious Vibe And Really Good To Enjoy With Familys And Friends..",
   "It was great! My gkids loved it. I wish non residents could have the opportunity to buy the pass.",
   "Really good place to spend some time or bring the kids. It has a lot of amenities (pool, spray park, baseball field, basketball, wide lawns, clean bathrooms among others).",
   "This is an awesome park for toddlers and children. They have a playground there especially for younger children and another playground for older children. They have a digger and shovels and also have a few Tonka trucks for children to play with. They also have sprinklers and a pool.",
   "We liked this park!!! The kid's place perfect for summer...the park with tables to eat and the playground area...There is a pool too.. so it is a perfect place to spend your summer time!!!!"
  ]
 },
 {
  "name": "Noah Webster House & West Hartford Historical Society",
  "address": "227 S Main St, West Hartford, CT 06107, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/78c958b6-9330-11ea-bc75-14b31f159f22.png",
  "tags": [
   "approachable",
   "knowledgeable",
   "tour",
   "history",
   "history",
   "tour",
   "history",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=12380289078460895412",
  "source": "GoogleMaps",
  "reviews": [
   "When I have visited it has always had an approachable, knowledgeable and friendly staff. The tour is through the house and newer additions and does not lack a piece of history at any turn. \n\nA definite Connecticut staple I suggest to anyone passing through, it took us a couple of hours at most but it was well worth the price of admission.",
   "Words. Words. Words. Thanks Noah for making them American!  In 1828 his own Dictionary was published and the rest is history!  Webster’s Blue Back Speller gave us pronunciation and a commonality for equalized relations among our people. We still depend on his dictionary in schools and homes throughout our nation. This house is a little gem that brings his story to life.",
   "A wonderful and informative place about the history of one of America's founding fathers noah Webster. Staff was friendly and informative helping us get the most we wanted out of the tour and prices were very reasonable.",
   "NWH is a truly excellent museum. Featuring a fascinating history of the Town of West Hartford, the museum also showcases exhibits of general interest to the historically curious. \nStaff members are congenial,  personable and always willing to be of assistance with any and all queries.\nOn site parking is a bit limited, however, ample spots are available on South Main and local streets. \nA simply wonderful museum!",
   "Went here with my friend from school; we had a very good tour guide who gave us the ins and outs of Noah Webster’s life and home. I really enjoyed the tour and home tour !"
  ]
 },
 {
  "name": "Charter Oak Landing",
  "address": "50 Reserve Rd, Hartford, CT 06114, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/79152ee8-9330-11ea-8c79-14b31f159f22.png",
  "tags": [
   "free",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=11688172352340415456",
  "source": "GoogleMaps",
  "reviews": [
   "They are doing a wonderful job cleaning up since the flood! Very quiet relaxing place to go!",
   "We go here for the Riverfront fireworks every year, and sit by the water, near the bridge. It's the perfect view of the display, and pretty easy to get out of. I haven't been here any other time, but it seems like a serene place ",
   "A place where you can relax from the rush of Hartford. Unfortunately not much to do here besides chilling next to CT river. If you have a bout you can lunch it to the river here for free however you have to check hours because the gate might be close.",
   "Nice spot by the river... Place was desserted though...",
   "Good place to take the kids to walk or ride their bikes on a weekend."
  ]
 },
 {
  "name": "DownTown CT",
  "address": "CT-2, Hartford, CT 06108, USA",
  "avg_visitor_review": "",
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=6569859767921157053",
  "source": "GoogleMaps",
  "reviews": []
 },
 {
  "name": "A. Everett Austin House",
  "address": "130 Scarborough St, Hartford, CT 06105, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7958a106-9330-11ea-ae5d-14b31f159f22.png",
  "tags": [
   "tour",
   "historic",
   "art",
   "knowledgeable",
   "tour",
   "art",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=450399902642928090",
  "source": "GoogleMaps",
  "reviews": [
   "Very interesting tour of Chick Austin's house in the wealthy and beautiful area of Hartford!  He was the art director of the Wadsworth Atheneum from 1927-1944 and was innovative at the museum by introducing modern art to America. The house is a historic house museum built in the Neo-Palladian style and is only one room deep while being long in length. It is filled with 17th- to 20th- century Italian and German furnishings, with the second-floor modern style with Bauhaus designs.",
   "A little oddity in Hartford. It's a private building and you cant get too close, but you can still get the idea from the sidewalk. Don't go out of your way to see it, but if you're in the area it's fun to check out.",
   "Absolute gem. If you care about art, culture, or interior design in the 1930s, the Austin house is a must. The house has been lovingly restored and the tour guide was knowledgeable and very engaging. Also, just responding to another reviewer, thr Austin house is not private; it’s owned by the Wadsworth Atheneum and is opened to tours twice a month—you just have to call to book in advance. Well worth the $ and the time!!!",
   "Interesting, not enough so to pay $25 for a tour of the inside though.",
   "Beautiful"
  ]
 },
 {
  "name": "Westmoor Park",
  "address": "119 Flagg Rd, West Hartford, CT 06117, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/79a22df8-9330-11ea-a61c-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "walk",
   "family",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=16580475440182918910",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice place to take the family too.  The employees are polite and its very scenic.  I love this place and would definitely go back.",
   "Great scenery.  Fun summer camps.  Kind animals.  Apply a lot of bug spray before coming.",
   "We first went here for a friend’s daughter’s first birthday, and have been back several times since with our own little girl. It’s a wonderful place to kill some time with little ones while being outside and teaching them about animals. You can’t beat the price (free)! We love Westmoor Park!",
   "Beautiful place. Lots of farm animals and huge park",
   "Fun family place to see the animals plus a safe nature walk through the forest. A quiet afternoon stroll."
  ]
 },
 {
  "name": "Colt Park",
  "address": "106 Wethersfield Ave, Hartford, CT 06114, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/79e8fa2e-9330-11ea-adc2-14b31f159f22.png",
  "tags": [
   "kids",
   "music",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6544216041862940694",
  "source": "GoogleMaps",
  "reviews": [
   "I've been a regular at Colt Park since 2008. I stopped going for a few years when there were two muggings in the middle of the day. I also was sick of the quad/ATV riders ripping through the place. \n\nWhile that has improved, the place is still trashy. There is literally trash all over the place. \n\nWhile the park does host many games, at most time it is empty. Part of the green new deal is to ensure everyone has access to outdoor space, but no one even uses what they currently have.",
   "Awesome area. But restrooms needs to be open during daylight",
   "It was a beautiful day to stroll through the park even at then of the day when all sporting events were winding up. The breeze was subtle, music was still playing in the background, kids still running back and forth on the courts- in the grass & some just snuggled in moms' arms as they watched the softball games. Nice progress on fixing the park in general.",
   "Kids love the pool. Clean water.  The lifeguards actually form relationships with the  kids from the community my daughter knows their name. Please follow @blacksheep106",
   "Convenient clean and safe with police providing drive by making sure things r safe."
  ]
 },
 {
  "name": "Webb-Deane-Stevens Museum",
  "address": "211 Main St, Wethersfield, CT 06109, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7a319c1c-9330-11ea-b31b-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "knowledgeable",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17839617853716772444",
  "source": "GoogleMaps",
  "reviews": [
   "unlike NY. CT. values their old homes. CT has so meaning historical house its one of the best states in the New England area. which makes Webb-Deane-Stevens Museum a wonderful stop. not only do you have the museum but the surrounding area is loaded with old homes which makes a great walk around town. the guides are very nice, litrtle gift shop and a very nice historical house that is now a restaurant. even my 12 year old enjoyed it. this in my book is a must to see. i hope you feel the same. in this post there will be a few picture of the restaurant and other homes that are near by.",
   "Three different house tours at once, all homes unique and with their own stories. Our guide was wonderful. The staff was friendly and very accommodating when we showed up at the end of the day. You need a good two hours minimum here to really take it all in.",
   "Three great colonial homes with a lot of history.  Our guide was passionate and knowledgeable.",
   "They have a real electric chair. Follow me on ig @Emperorkaioyus",
   "The venue is wonderfully maintained, definitely enjoyed the set up and breakdown of my brother's wedding here. The facility is so simple and easy to access, while still being away from the main road of the town."
  ]
 },
 {
  "name": "Wolcott Park",
  "address": "1341 New Britain Ave, West Hartford, CT 06110, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7a96ede6-9330-11ea-ae05-14b31f159f22.png",
  "tags": [
   "nature",
   "walking",
   "walk",
   "kids",
   "walk",
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=12335989510632904757",
  "source": "GoogleMaps",
  "reviews": [
   "Made use of the picnic area for a barbecue (fireplaces no longer available). The park is kept very tidy and the sports and grass areas are always in very decent shape. Only issue is the parking areas can get very full at times - but street parking is nearby anyway. Bathroom facilities are within walking distance of the whole area. You may not be able to play every outdoor game here due to the terrain not being flat and it is situated next to a main road, but there is a pond and a wooded area away from these if you \"need some nature\".",
   "Nice park. Great facilities to use. My only complaint is that the playground was a little boring for my kids over the age of five or so. However, the school playground is only a short walk up the path from there, which was a really fun walk! We spent hours here exploring, having a picnic, and feeding the ducks.",
   "Always a pleasant park to walk around during the day if I'm out with my dogs. Great to see kids using the area all year round. Clean, safe, well- lit and lots of parking.",
   "Very nice new playground and the kids will love cooling off in the splash pad. Parents will like all the shades benches to relax on while the kids play.",
   "Clean and enough space for the kids to play.  Is missing a pool.  Great park for the kids to play sports"
  ]
 },
 {
  "name": "West Hartford Reservoir",
  "address": "West Hartford, CT 06117, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7aede7ca-9330-11ea-8e7b-14b31f159f22.png",
  "tags": [
   "family",
   "walk",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=5714032694886052504",
  "source": "GoogleMaps",
  "reviews": [
   "This place was fantastic. I really enjoyed the fireworks and pyrotechnics!! However it scared my pet iguana and he scurried off into the lake. Please help me find my son thanks for the memories",
   "Great beginner, to expert trails...",
   "Beautiful sceneries, excellent trails, quiet roads, and family place.",
   "Great place to walk or run here solo, with friends, with your kids or dogs.",
   "Wonderful! Enjoying with our dogs even on rainy days... One of the best places for walking."
  ]
 },
 {
  "name": "Riverfront Park",
  "address": "300 Welles St, Glastonbury, CT 06033, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7b549930-9330-11ea-9c5b-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "kids",
   "parks",
   "field",
   "field"
  ],
  "link": "https://maps.google.com/?cid=12167359406408852907",
  "source": "GoogleMaps",
  "reviews": [
   "Great trails for walking or biking. Nice wide sidewalk along the scenic river. Expansive playgrounds for the kids. Boat launch near the huge dock and boathouse. Probably a beautiful spot for a wedding. The dog park is huge and super fun to watch. Bonus points if you bring water to pour in the water bowls for all. Very clean facilities throughout. We love this place.",
   "This place is amazing.  I'm hoping that there is enough foundation to hold it all together.  This place is a beacon for me and my kiddos.",
   "Great fenced in parks. One fenced in area for little ones and one fenced in area for big little kids. Only downside, no shade! In the summer it's too hot to play there.",
   "Park with soccer field, baseball yard, basketball court,crew, playground, fishing dog park, picnic,relaxing place.",
   "Nice park. Decent baseball field. Lots of bugs at night."
  ]
 },
 {
  "name": "Pope Park",
  "address": "Pope Park Dr, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7ba9492e-9330-11ea-91ab-14b31f159f22.png",
  "tags": [
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6521820578196522281",
  "source": "GoogleMaps",
  "reviews": [
   "I wouldn’t recommend anyone to bring their children here. Although the pool area is ok, the rest needs some serious TLC! First off the play area is always full of poop, from the geese and the homeless and addict sleep there so you can imagine what types of things are left laying around on ground that could potentially harm kids and/ or adults. I understand that everyone needs some where to 🛌 but it needs a major clean up.",
   "Love the community center there! Also they have both an indoor and outdoor pool :)",
   "Well the last thing that I want to go but it's a good place Salado people in",
   "Best spot in downtown Hartford,CT",
   "Always a nice place to go when it's nice out. Especially 🌻🌾🌷 spring and 🍃🌴🍂 fall. But winter ❄ is great for the kids ⛄ ❄ my son likes to go to pope park to see the ducks he usually brings 🍞 bread. As well as the playground area that's nice also... There's also a swimming🏊 pool but he hasn't been there for swimming yet.. But now that he reaches the specific height he'll be able to go in the pool area this year!!!!"
  ]
 },
 {
  "name": "Talcott Mountain State Park",
  "address": "Summit Ridge Dr, Simsbury, CT 06070, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7c00df1e-9330-11ea-bcc2-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "parks",
   "hike",
   "history",
   "walk",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=4492348404963324188",
  "source": "GoogleMaps",
  "reviews": [
   "If you're not scared of breaking a sweat on a walk and think of a vista as a reward, then it's the place to visit. There is an easier route to follow too. Generally the folks you encounter are friendly, but I did have a bit of a bad experience this time round with bringing my dog with (someone setting off fireworks nearby). Do note that if you're really wanting to appreciate the views, bring binoculars/ telescope with as you can see for quite a distance. Also, the cool place to go is the tower.",
   "This is one of the best state parks in Connecticut. It becomes much more beautiful during fall. I visited last fall with my then 4 months old baby and it was her first hike. We hiked up till the summit. The views were gorgeous and beautiful. The hike to the summit was also good. Plenty of parkimg space available too.",
   "Beautiful park. Nice hike, not to challenging. Stunning views and interesting history. The castle is very impressive and we can't wait to go back when it opens in May!",
   "Was a great walk. Very pretty ..lots if cute wooden benches as you walk up. Where this trail starts it all up hill..so be ready! Lol..but was a great walk.",
   "Beautiful wooded hike with an amazing view along the top of a \"mountain\". The majority of the hike is fairly close (or very close) to the cliff,  so if you have young children be careful. The park is well used; we were there on a weekday evening in the fall and passed approximately 20 other people in the park. There are a few different trails, one being a wide well cleared path away from the ledge, and another narrow slightly more rugged path along the ledge. There are few connector and side trail options, but they all essentially lead to the same spot. A gorgeous building at the peak. There's a gift shop and museum area, unfortunately they were just closing as we arrived. Note, there are one or two connector trail points, well marked, which cross this trail and are part of a much larger trail system, these do not lead to either the building nor the park parking lot."
  ]
 },
 {
  "name": "Wickham Park",
  "address": "1329 Middle Turnpike W, Manchester, CT 06040, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7c4450f4-9330-11ea-b8d5-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "walk",
   "unique",
   "family"
  ],
  "link": "https://maps.google.com/?cid=5268345661313079610",
  "source": "GoogleMaps",
  "reviews": [
   "Heavenly! This park is so beautiful! Wickham Park is a true hidden Gem! My first visit I couldn’t believe how large it was- totally exceeded my expectations! When you look at the views all around the park the first word I can think of is Heavenly! So many gardens to visit (total of 10 ranging from ½ acre to 8 acres!) and see all the different kinds of flowers and how it is set up. I was in heaven with my professional! So many different places and scenery for pictures of any kind! I always thought it was really neat to see they had the Aviary there; the kids also enjoy it! \nThe sensory garden is my favorite ~ not just because my husband proposed to me in front of a beautiful statue where a couple bonded together holding hands and forming the shape of a heart . One of these years I will buy a brick with our wedding date on it  I recommend for anyone in CT to go and check this park out.",
   "Great place to walk, jog, play Frisbee golf, play Pokemon go, or just work out on the trails.  I've only recently discovered this place but I will most definitely be buying season passes next year.  The grounds are maintained very well and the staff are super helpful.  The various gardens and sitting areas are beautiful. \nVery kid friendly for all ages.  There is a per car fee to get in or you can buy the season pass.",
   "Wickham Park was an incredible experience. I attended my granddaughter's wedding here. The grounds, the \"lodge\", the scenery and the staff was totally fantastic. The view across the valley was amazing. The lodge's dance floor had ample room for everyone with the energy to dance the night away. The grounds with unique walkways that wound around a garden of trimmed shrubs and flowers - all leading back to the lodge. The entire staff was attentive to your every need. The night lighting was set to seclude if you chose and open enough to safely walk about the gardens. You will experience a memorable event with any venue here at Wickham Park. I surely did.",
   "Beautiful park. The grounds and the landscaping are amazing. Great place to go with the family for an hour or two. The gardens are also amazing. You’ll see a great view of Hartford as well. They also have a small little bird zoo too!",
   "This is a great Park that is far bigger and more interesting that I had originally imagined it.  If only for the sheer variety of things to see and do is Wickham Park worth visiting.  The various gardens on the grounds were beautiful and well kept even in October. Only down side was this place is clearly a destination for weddings and wedding photography and we couldn't go for more than few minutes without getting in someone's shots."
  ]
 },
 {
  "name": "Connecticut Historical Society Museum and Library",
  "address": "1 Elizabeth St, Hartford, CT 06105, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7c9e5846-9330-11ea-901d-14b31f159f22.png",
  "tags": [
   "history",
   "free",
   "organized",
   "learn",
   "free",
   "free",
   "library",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1657766683417372498",
  "source": "GoogleMaps",
  "reviews": [
   "We really enjoyed our visit to the museum. There was plenty to appeal to older history and war buffs,  as well as young children who can play \"house\" in a colonial setup. Lots of interesting CT history as expected, as well as interesting exhibits like a film about commercial items manufactured in CT and vintage toy commercials. We loved the war artifacts and left with a feel for historical CT sentiment regarding the Revolutionary and Civil wars. We had lots of laughs in the canoe display.",
   "The place is large and well organized, when you enter someone tells you where you should go. The duration in depends on how fast you see things but it is between half an hour and an hour. On the second floor there are many fun and educational activities for children. \nWe went today because it was free the entrance but if you have to pay l don’t know how much.",
   "A lot of information you can learn about CT by visiting CT Historical Society Museum in Hartford. The museum is open for public for free first Saturday each month. However, I was surprised to see the size of the museum and the artifacts they have I thought since it's named CT historical society, I thought it would be bigger and the most museum that has artifacts in the state.",
   "We have visited the Connecticut Historical Society (CHS) Museum in Hartford, Connecticut multiple times, most recently on Saturday, January 5, 2019, and have always enjoyed it. Both the permanent and special exhibits in this museum have consistently been nice representations of Connecticut’s history. Although we only were able to spend about an hour and a half at the museum this time, we estimate that it would take at least two hours to see this museum and appreciate all that it has to offer. Admission into this museum was free because it was the first Saturday of the month but museum passes may be available at your local library for free admission on other days.",
   "Loved the museum and the standup storytelling show they host."
  ]
 },
 {
  "name": "Dinosaur State Park",
  "address": "400 West St, Rocky Hill, CT 06067, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7ce8cf92-9330-11ea-a57c-14b31f159f22.png",
  "tags": [
   "learn",
   "field",
   "family",
   "history",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4301958991609267567",
  "source": "GoogleMaps",
  "reviews": [
   "Fun and educational.   I love that they constructed a building over the tracks.  All of the accompanying exhibits were great too. Very interactive.   I liked that one of the staff came out for a presentation.   I've seen so many dinosaur skeleton exhibits in other places. This was great to have a place focused on tracks. There was so much to learn.",
   "Fantastic place. A hidden gem in the middle of Connecticut. The staff do a great job of bringing the history of the park together with the history of the dinosaurs that once roamed the area. Great for a family day trip or a school field trip.",
   "Fantastic park and amazing exhibit.  I highly recommend stopping by!  The exhibit is totally worth a drive over.",
   "My kids loved this place! They enjoyed so much we had very nice afternoon here.",
   "A hidden gem. Such an impressive site. Can't believe I never knew about the park till now. Actual fossilized dinosaur tracks. Wow!"
  ]
 },
 {
  "name": "Heublein Tower",
  "address": "Simsbury, CT 06070, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7d2d04ec-9330-11ea-ac28-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "walk",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=631132687075028137",
  "source": "GoogleMaps",
  "reviews": [
   "You have to go there during the fall! You can really enjoy the beauty of Connecticut. A great hike. I have also seen lots of families.",
   "Visited this place during fall and the view from top on a clear day was amazing, during the hike there are several view points from where you can catch amazing views and see beautiful fall colors. The hike is not very tiring and it is just over a mile so it an easy hike with amazing views!!!",
   "Great Hike, super busy many many people. First part is the hardest of the trail, the rest is a nice walk. The views are beautiful! Nice little picnic area near the tower all worth it.",
   "One of our favorite hikes.  There are different routes to get up the mountain, one is a little steeper than the other.  You still end up with the same gorgeous views!",
   "Love the hike even if there are a ton of people. Fall is so beautiful up there. I just wish I picked the October fest weekend when the band plays. Easy hike, hard to find parking when busy."
  ]
 },
 {
  "name": "Beachland Park",
  "address": "847 Quaker Ln S, West Hartford, CT 06110, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7d77efc2-9330-11ea-bc7a-14b31f159f22.png",
  "tags": [
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=14366519742052962573",
  "source": "GoogleMaps",
  "reviews": [
   "Newly renovated playground for the young and older kids. Has a nice pool/splash pad combination for the older kids. Has a separate fenced in splash pad for the younger ones. It also has a wheelchair accessible swing. Has a lot of picnic tables. \n\nThere are also basketball court and other fields for sports.",
   "After 50 years, this place still remains a true summer staple. Favorite time of year, as the masses have cleared out. My mom took me here in the 60s , so now it's my turn to bring her. We had an aquatic fun time!!",
   "Newly updated playground and the sprinklers were open as well. No bathrooms available in the building next to the playground, but there is a Porta potty down the hill. It's cleaned once a week from the paperwork posted. Just bring disinfectant wipes for the seat. There was plenty of paper.\n\nThey have plenty of benches for family but unless you get there early and \"claim\" one, you might have to bring your own. People were grilling on small portable grills, no grills that the park provides. Huge amount of park space for these sort of gatherings. Not enough parking near the playground, but there is quite a bit down the hill by where the Porta potty is at.",
   "Lovely park. Went to the temporary dog park with my pups. It was fun!",
   "Probably one of the greatest playgrounds I've ever seen. My son really enjoyed it here. There was plenty of space to run around, two playgrounds depending on age."
  ]
 },
 {
  "name": "Nomads Outdoor Adventure",
  "address": "240 Governors Hwy, South Windsor, CT 06074, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7dca55e8-9330-11ea-a9f5-14b31f159f22.png",
  "tags": [
   "drink",
   "kids",
   "active",
   "active",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2058287458342116545",
  "source": "GoogleMaps",
  "reviews": [
   "Place is nice and interactive. Elementary school kids do not have much to do - only 2 rope course for them. They are not allowed to go to more challenging adventure for a good reason. But for given 3 hours you get with admission price it is enough. Choose warm and dry weather. You do not want to stuck in the mud there.Bring good snack and drink, you will definitely be hungry after all.",
   "First time I look my daughter to Nomads and she loved it. Spend the entire session building our way up each level and missed finishing it as our time was up. Will return time and time again as it's a great way to keep your kid active and not stationary.",
   "Amazing experience! Paul, Dave and Conner were great. Extremely helpful, friendly...can’t say enough about their personalities! \nI attended with three boys 10, 9 and 8...they made sure that we were okay throughout the duration that we were there. Great outdoor course...highly recommend! We will definitely return very soon!",
   "Nomads Outdoor Adventure is an awesome friendly place to take your family for a fun active experience. The staff was very welcoming and very friendly. There price is very reasonable compared to other similar places around the area. One of there employees named Diego was very helpful. He was very quick to help my girlfriend when she fell and got stuck on one of the courses. The staff was always making sure that everyone was safe and doing good. The entire staff was very observant of everyone on the courses and were always very quick to help anyone that needed it no matter how big or small. I would highly recommend checking them out. My family and I will definitely be going back many times.",
   " Great staff!  Always watching the climbers and acting quick if someone gets stuck.  The courses are well maintained and a lot of fun. Highly recommended. "
  ]
 },
 {
  "name": "Mill Pond Park",
  "address": "123 Garfield St, Newington, CT 06111, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7e0e6424-9330-11ea-bf8a-14b31f159f22.png",
  "tags": [
   "walk",
   "field",
   "kids",
   "walk",
   "parks",
   "field",
   "free",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9351854700705423873",
  "source": "GoogleMaps",
  "reviews": [
   "Its a nice place to admire the view and to see the ducks and also if you want you can even set up a picnic there. Its kid friendly and so the children can play, there is a park where the little ones can play",
   "It’s a local park folks. Has a pond, fields , pool and a pretty big playground for the kids.\nThe waterfall is not a mile walk off a trail. It’s off the street. Great for locals to hang out or relax. The Ducks destroyed the baseball field with droppings otherwise as I said it’s a local park with some events during the summer.",
   "Nice friendly visitors. Was surprised how much trash is in the bushes there. People , pick up after yourself please.",
   "It's a great place for my toddler, she can do different types of games and be running around as the playground has a very decent size.\nOne plus is that the playgrounds floors are cushioned.",
   "This is really one of my favorite parks here in the area. It is quiet and peaceful, very nice for watching turtles and a variety of birds.  It is always well-kept, easy and relaxing to walk the full loop around the pond.  The playground is extensive and has a lot of options and variety for kids so that there is plenty of space.  The playground's astro turf was delightful.  Felt like walking on a marshmallow. There is a public swimming pool, but I'm a little confused with the hours of operation since it has always been closed and the water level low every time I have seen it.  There's a baseball field, a basketball court, free parking... but always my personal favorite is the little waterfall under the bridge that you always see in pictures. My wife and I came here for wedding pictures."
  ]
 },
 {
  "name": "New Britain Museum of American Art",
  "address": "56 Lexington St, New Britain, CT 06052, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7e631446-9330-11ea-8a07-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "kids",
   "family",
   "walk",
   "family",
   "free",
   "kids",
   "art",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6313485732500081317",
  "source": "GoogleMaps",
  "reviews": [
   "A lovely place to visit. Beautiful art, many events to be a part of including First Fridays with bands and dancing, painting classes. There's a lot to be a part of.",
   "I took my my 3 shorties on Saturday morning to see the art museum. (Ages 7,6,5)  Was definitely worth it a couple hours. Was very nice. Was exactly what was expected. No WOW factor. But very happy.",
   "Have not visited in decades. Went last weekend with our family and it is a beautifully remodeled building. Great activities for kids to do downstairs and was a great hour or so to look silently over the collections in the museum.",
   "I have seen commercials for this museum on TV for a while. On the commericals, the place seemed really small to me. It never seemed like it would be worth the trip, but it was actually much bigger than I had expected.  It was a great afternoon with the kids. They are sculptures that surround the building which made for a nice walk before going inside.\n\nMost of the art on the inside are paintings, of course.  The have a wide variety of art from various time periods and styles.  I'm not a huge art buff, but there are paintings there by several artists that are household names.\n\nAnd the price was right.  The tickets for my 8 and 12 year olds were both free and my ticket was only $15.  A really nice afternoon family outing at a great price.",
   "All the staff were very friendly during my visit, and there was plenty of good food in the cafe!"
  ]
 },
 {
  "name": "New England Air Museum",
  "address": "36 Perimeter Rd, Windsor Locks, CT 06096, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7ea59b3a-9330-11ea-9696-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "kids",
   "knowledgeable",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=3817325704085809164",
  "source": "GoogleMaps",
  "reviews": [
   "Pretty standard museum. The collection was very impressive. The staff was friendly and knowledgeable. My kids enjoyed themselves a lot. There was a lot to see and read. My only disappointment is that most of the cockpits that were marked as being able to enter them were closed. Would have liked a bit more hands-on stuff. Otherwise a lovely way to while away an afternoon and I would recommend it.",
   "If you are an aviation enthusiast, this museum is a great time!! It has fantastic displays. I was continually amazed at the quality and content of aircraft they have. Furthermore, unlike many air museums, New England has many many aircraft that visitors can sit in. There is a wonderful play area for children. But the best part is easily the Docents. They are each so kind and so knowledgeable about the museum exhibits but even more so, several of them flew and, if you’re interested, have many wonderful and funny stories. This museum is well worth the time spent there.",
   "What a great museum, packed full of iconic planes. Staff were really friendly and helpful. I even got to talk with some of the guys that helped restore the B-29. I'm just going to post pictures instead of telling you why it's worth your time to visit.",
   "Very cool place to see airplanes up close and learn about aviation. It's pretty awesome to hear the air traffic of Bradley while wondering the 3 massive hangers filled with cool planes. You can sit in SOME of them and having Veteran Volunteers really makes all the difference as you get REAL stories and knowledge from people who ACTUALLY flew these planes.",
   "This Museum is a hidden gem. Lots of information on aviation, with plenty of hands on opportunities. This Museum also contains real aircraft you can see, touch and explore. The Museum is also easy to get to, with plenty of parking. Great place for all ages."
  ]
 },
 {
  "name": "Hill-Stead Museum",
  "address": "35 Mountain Rd, Farmington, CT 06032, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7eeba51a-9330-11ea-8e15-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "unique",
   "art",
   "history"
  ],
  "link": "https://maps.google.com/?cid=11240196349828481961",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to visit. Kids would love to see how people used to live -150 years ago, with no internet, no iPads, more people in family. Very big house. A must see place.. Maintained pretty well. stuffed parrot Albert in the house would be one of the biggest attraction..",
   "We didnt go into the museum but rather say on a bench and read . The grounds are breathtaking set up on a small hill looking out over the valley. I have been in the museum several times and it is wonderful also.",
   "Great place to visit. Totally went there on a random day. They had feeding of the sheep with pumpkins from the community. The also had a wool spinner and you could buy wool socks and gloves. Taste apple cider donuts and apple cider. Very cool place to check out.",
   "What a beautiful place.  Just outstanding. Highly highly recommended.",
   "So great to see art in the way it was supposed to be displayed.  You really get a sense of history and a feel how they lived. Great experience, unique museum."
  ]
 },
 {
  "name": "Church of the Good Shepherd",
  "address": "155 Wyllys St, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7f35a69e-9330-11ea-87ae-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "history",
   "delicious",
   "free"
  ],
  "link": "https://maps.google.com/?cid=17354608596699997159",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice people. They offer soup and maybe food around 1130am-1230pm I think are the times. Not sure if its everyday or not. They sometimes have clothing they give away too. It's a old old church. I like the architecture of the old building.",
   "Family church years. Great to visit and spend time with those you love. Beautiful buildings with history from the 1800s.",
   "Beautiful church with lovely grounds to go and meditate.",
   "Saturday morning 7am inspirational sermon, followed by delicious free breakfast, for those in need. All are welcome. Popular. Arrive at 6am.",
   "The service was awesome.  Pastor Pope preached about the Blood of Jesus and One Hundred Fold Blessing."
  ]
 },
 {
  "name": "Hartford Reservoir 6",
  "address": "3070 Albany Ave, West Hartford, CT 06117, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7f7b8964-9330-11ea-8fe8-14b31f159f22.png",
  "tags": [
   "pets",
   "walk",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=15168421535566512090",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for a nice stroll or bike ride, not a picnic spot as there are not many benches to sit on the way. There are paved roads for bikes and people and non paved trail path with no bikes allowed. Lot of people with pets",
   "Beautiful! Half open sky and half forest path... Nice and flat for an easy walk or jog!",
   "What a beautiful day at the West Hartford\nMDC Reservoir #6 💕\nJanuary 2020 !",
   "Great place to take a long walk.  very scenic",
   "What a great place to walk... It's almost 4 miles around the practically flat path. The views of the reservoir a quite impressive."
  ]
 },
 {
  "name": "Connecticut Trolley Museum",
  "address": "58 N Rd #9606, East Windsor, CT 06088, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7fd123b4-9330-11ea-89e8-14b31f159f22.png",
  "tags": [
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=8863794742464738814",
  "source": "GoogleMaps",
  "reviews": [
   "My daughter and I love this place. For a reasonable price you can ride multiple historically accurate trolleys in the same day. On busy summer weekends they may have as many as four or five trolleys operating. They vary from open air cars to completely enclosed. Compared to other historical rail experiences like steam trains,  you have just about a 360 degree view around you from inside the trolley.The volunteers are very knowledgeable and do their best to make it an enjoyable experience for all.",
   "Bought tickets for the holiday trolley ride, was told to go outside and we'll board in a few minutes. 30-45 minutes later, miserable children, miserable parents finally board. There wasn't even anything impressive to see on the ride. Just a few decorations at the start of the ride. After all this, they never checked our tickets. I didn't even have to pay for that poor experience. 😖",
   "We did Holiday lights and had so much fun. My granddaughter who is almost 3 enjoyed meeting Santa Claus tremendously. The open sleigh trolley provided a true feel of the holidays.",
   "We did the holiday light ride on 12/20/19 in the open car.  Don't waste your money.  We were the 1st ride of the night and we had to stop so someone could get out and turn the lights on at every display.  Also the tunnel affect lights were out for the last half of ride.  \nJust rode in darkness.   We stopped at end of track and they tried to fix them but didn't work.  They had a radio station on that played a christmas Carol for the first minute or so then we listed to radio commercials for most of the ride.  Very disappointing!",
   "Rails to the Darkside was much better than I anticipated. The actors do fantastic jobs, however, the wait is a bit long for the amount of scaring that gets done.\n\nI'd definitely go again. Be sure to bring a very warm jacket! You'll be there for a while."
  ]
 },
 {
  "name": "Lutz Children's Museum",
  "address": "247 S Main St, Manchester, CT 06040, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/801c0f9a-9330-11ea-b10f-14b31f159f22.png",
  "tags": [
   "learn",
   "kids",
   "library",
   "kids",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=17510358728455956021",
  "source": "GoogleMaps",
  "reviews": [
   "My son is 19 months old and he loves Lutz. This was our second time visiting and we easily spend 2 hours there. It's a perfect outing on a scorching summer day.",
   "For kids seven or younger this is a great activity for 1-2 hours. I love the kid's size storefront of downtown Manchester. Also some cool antique train sets.\n\nIt's a great place for kids to learn through play. The Lutz has a small but cool animal museum. Check out Flemish the rabbit.\n\nCheck your local library for discount passes. You'll save half off addmission.",
   "It was a great experience for the first time for both me and the children. Thought it was going to be much bigger but still had enough activities and animals for the kids to enjoy. Will go again",
   "I want to love this place, as I normally like supporting the arts, and businesses in our town. But for the price of admission this place charges, a lot of the children's play area is run-down. Paint is chipping off furniture, my son sat on a chair and almost fell apart. For the price of admission they should do more upkeep.",
   "The Lutz Children's Museum has grown tremendously since it's humble beginnings and today is so much more than a \"chidren's museum\". It's a place to play, learn and explore for children of all ages and developemental abilities. The detail paid to the both the educational and play value if each display was stellar! Even adylts accompanying a child will enjoy your visit (with real antique toys displayer behind plexyglassto view) you will find nostalgia at every turn."
  ]
 },
 {
  "name": "Kidcity Children's Museum",
  "address": "119 Washington St, Middletown, CT 06457, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/806044a6-9330-11ea-87ca-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "performance",
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6390829957939425977",
  "source": "GoogleMaps",
  "reviews": [
   "Kid City is such a great place for children. So many things for children to do, each part of the building has a different theme. we were there three hours. Saturday was packed with kids and adults. Our grandchildren were both sleeping on the way home.",
   "The kids had a great time. You can pack a lunch and spend the day for $10 each. Adults must pay too. You find different things in the rooms you didn't see before every time you go. My kid loved the fishing boat room and the performance room.",
   "My family and I live in CA, and we visit children's museums wherever we go. This one is my favorite as they do an outstanding job of integrating basic scientific principles with play. The museum used to be a large home/mansion and has several separate rooms to explore. There are quiet areas and bathrooms all over to relax, breastfeed, etc. I also appreciated all of the little touches, like signs about spare clothes' kits in case your child has a potty accident. Really cool kid's museum. My kids are 6.5 and 8.5 years old, and they didn't want to leave. So much to do. Budget at least 2 hours and longer is better.",
   "Really fun! So many different themes and activities. Saw staff consistently rotating through swiffering the floor and putting toys back so no matter when you got to room, most likely it was set up the way it was intended and  not left in disarray from the kids. Nice to see a place that is well maintained despite the how rough and relentless the clientele can be.",
   "Fantastic  place to bring the young ones.  The under 2 area is great when the little ones need some \"waddle\" space.  The 3 years old finds so many things that he loves.  This is one of his favorite places to go on our special outings."
  ]
 },
 {
  "name": "Lake Compounce",
  "address": "185 Enterprise Dr, Bristol, CT 06010, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/80aeda3e-9330-11ea-8d2c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4009577369708773363",
  "source": "GoogleMaps",
  "reviews": [
   "What a great Amusement park. It’s got such a great classic feel mixed with great new rides. Tons of great places to get food. This park has water rides so bring a bathing suit but also has enough regular rides where you can have a great time even without one. This is the oldest amusement park in the US and it really has an old timer feel. This park also has rides for people of all ages. It also has wooden roller coasters that are not the best option for people with bad backs, so be cautious. Lake Compounce is especially beautiful in the Fall. With New England’s famous Fall Foliage and during Halloween time in particular there are extra fun events. The views from the park are also breathtaking. Lake Compounce itself is gorgeous and the wooded area surrounding the park are beautifully well",
   "Its a fun place, but every time I go there is a ride broken down. They need to create a ride that is fine without any bumps. It was fun and they had great food.",
   "Perfect for ages 2-7 but dress accordingly. The park is lite up beautifully, smaller rides going, hot cocoa and some Santa make for a perfect little evening out. People working at the concession stands could have been more professional but overall a great night!",
   "Drove here from Pennsylvania, was not disappointed. Very nice park just what we expected. Small but charming.",
   "Kids enjoyed this place. park that has been around a very long time but still has lots to do with many options. Watch out for the wooden roller coaster though very rough ride."
  ]
 },
 {
  "name": "Northwest Park",
  "address": "145 Lang Rd, Windsor, CT 06095, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/80ffb968-9330-11ea-9433-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "nature",
   "nature",
   "walk",
   "free",
   "history",
   "family",
   "nature",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=11852461500008198710",
  "source": "GoogleMaps",
  "reviews": [
   "My family loves this park! The grounds are well kept, and the park is very clean. My kids love the nature center and playground, and I enjoy hiking and exploring the trails. On our most recent visit we were even able to observe a maple sugaring demonstration in their sugar house. Very nice way to spend an afternoon.",
   "Lovely park in Windsor.  Tons of trails, very choose your own adventure.  The nature center is quite cute.  Grounds are always clean.",
   "Every year we have picnic there. The Pavilions are large and fine. The place is neat and clean and maintained. The tobacco museum has some old machinery to appreciate the history if you are interested in that stuff. Nice to walk around. The parking is free.",
   "Great place to visit with family and friends. They have a few tobacco museums and also a nature center as well with description of the wildlife found in that area. They also have a decent children's play area. My daughter loved this place",
   "Playground, covered barn, indoor nature center, 3 pavilions available to rent for parties, and many beautiful trails."
  ]
 },
 {
  "name": "Vintage Radio & Communications Museum of CT",
  "address": "115 Pierson Ln, Windsor, CT 06095, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/81504ad2-9330-11ea-b88d-14b31f159f22.png",
  "tags": [
   "walk",
   "hospitable",
   "history",
   "learn",
   "knowledgeable",
   "tour",
   "cheap",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=14188242444770019346",
  "source": "GoogleMaps",
  "reviews": [
   "Fascinating walk back through history of communication.  All the way back to Marconi. \nMany reminders of my childhood.  Ham radio, television production, old shows,. So much to see.  Very hospitable docents.  They love what they do.",
   "Amazing museum for all broadcasting and media enthusiasts. A fair share of everything from the 1800's to the 90's. There's a fully functional HAM station that you can operate as long as you hold a HAM operator license. Keep in mind they only accept cash.",
   "What a hidden gem! I expected to tour the museum in about an hour  to one and a half hour range, nope! Three hours later...and my teens were engaged the whole time, as was I! \nI recommend taking the guided tour since the volunteers are so knowledgeable, passionate (about all forms of technology) and extremely personable!\n We will definitely plan another visit, as I know there is so much more to learn! *oh, and bring cash. They do not accept credit cards.",
   "As nice as it is to see functioned antique radio, television, telephony, morse etc equipment its even better to interact with the staff. They are volunteers and really love showing off the old equipment. You wont find more motivated people than these! They make the tours fun, interactive and they are quick to answer your questions!\n\nAs a former Radio Shack employee it was great to see some of the products still in everyday use. A lot of the stuff back in the day was built to last better than today's disposable electronics. Of particular note was an old 9V Radio Shack battery, not the cheap red batteries we used to give out with the battery of the month cards but one of the even earlier 'premium' 9Vs!\n\nIf I was going to deduct a star it would be that these devices are also used as a resource, sold off, split up, parted out etc. They are not making these antiques anymore. But its good to see them used and shown!",
   "Great place to visit. Very friendly and very knowledgeable staff. It's an eye opening display of where we have come from in the world of technology."
  ]
 },
 {
  "name": "Mill Woods Park",
  "address": "154 Prospect St, Wethersfield, CT 06109, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/819c9634-9330-11ea-b350-14b31f159f22.png",
  "tags": [
   "nature",
   "family",
   "pets"
  ],
  "link": "https://maps.google.com/?cid=7509426802114712282",
  "source": "GoogleMaps",
  "reviews": [
   "Been going here since I was a kid. Great memories and lots to do. Check out the Nature Center. It's awesome",
   "Nice park with a summertime water feature.  Dog friendly.  Lots of Canadian Geese on the lower pond.  One large white swan on the upper.",
   "Great park, nice playground and great soccer & baseball fields.",
   "Great park with everything from playgrounds, swimming, fields, skate park, and much more! Fun for the whole family. ",
   "I used to live in that town and like the park always. This time I was even more impressed when I follow the signs to a dog park that they had way way way in the back of the park. Had a dream the lots of the wood chips that were done quite wet but it was still fun place to visit very shady for the pets"
  ]
 },
 {
  "name": "Adventure Rooms",
  "address": "282 Main Street Extension, Middletown, CT 06457, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/81f0f7ec-9330-11ea-9b41-14b31f159f22.png",
  "tags": [
   "unique",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3889391301626894574",
  "source": "GoogleMaps",
  "reviews": [
   "Lots of fun with friendly and helpful staff. We did the remedy and it was more challenging than expected, we only finished because they extended the time by an extra 5 or so minutes. Definitely read everything very carefully... If something looks like it should be used or is out of place, definitely use it!",
   "We played two rooms The Hidden Cabin and the Swiss Original. They were two very different room. The Cabin was your standard, pretty well themed room with some fun and unique puzzles. Overall we had a great time in this room. Wouldn’t suggest more than 3-4 people due to the size however. \n\nThe second room Swiss original was very different than normal rooms (and they make this very clear upfront.) It is a series of 3 rooms filled with puzzles with no theming or story line. This was an interesting experience. It felt like a sprint through puzzles (which was a good thing honestly). It was fun to really speed through several different puzzle types. \n\nOnly down fall is it is difficult to find and the GM was helping two rooms at once which seemed to cause delays when we needed help on the very last puzzle.",
   "Lots of fun. Done several rooms. One time one lock was not reset and I found that disappointing but it was just once.",
   "Wonderfully awesome.  Super fun. Only did one puzzle so far but looking forward to trying the others",
   "So much fun to do as a family reunion! You really get to see each person’s strengths. We did the Swiss Original which didn’t have a story but a lot of fun puzzles to solve over 3 rooms."
  ]
 },
 {
  "name": "Corning Fountain",
  "address": "Horace Bushnell Promenade, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/823f8d5c-9330-11ea-83ee-14b31f159f22.png",
  "tags": [
   "field"
  ],
  "link": "https://maps.google.com/?cid=3586591362142781905",
  "source": "GoogleMaps",
  "reviews": [
   "Interesting! No plaque to explain the\n Native Americans depicted or the relationship of Mr Corning with the site or the people. Very detailed sculptures!",
   "Please where you can rest and hang out with friends out of the city noice. Great view at the capital building. The fountain itself is very interesting. There are four different native Amerikans 90 degree apart, and on the top there is deer or antelope or something similar.",
   "Gorgeous fountain in the middle of a spacious field which lies at the foot of the hill in front of the state Capitol building. If you are near Bushnell Park, stop to see this, the CivilWar arch, and the carousel. ",
   "Finally the fountain got repaired after one and half year 😊",
   "Nice place to relax in the heart of Hartford city..."
  ]
 },
 {
  "name": "New England Carousel Museum",
  "address": "95 Riverside Ave, Bristol, CT 06010, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8296ae6e-9330-11ea-b23c-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "history",
   "free",
   "history",
   "field",
   "learn",
   "history",
   "kids",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=6276143242817570882",
  "source": "GoogleMaps",
  "reviews": [
   "I took my 3 1/2 year old grandson here and it my have been a little too much for him at this age, but I thoroughly enjoyed myself. The staff was very helpful and pleasant. I would definitely return with other family members.",
   "Fun place to spend an hour or two. Nice collection of beautiful carousel houses and other animals. Also a craft area where the kids have a lot of fun. Fire history museum upstairs is also nice.",
   "I went to check out the museum soon after I had moved to the area and was very impressed. The items on display show wonderful craftsmanship. I think it is a wonderful place to bring young children, and adults alike who like carousels and the history related to carousels. You even get a token for a free ride in one of the carousels. It also has an attached Firehouse museum which was very cool. Worth checking it out, definitely.",
   "This place is fantastic!! We took our 4 kids (ages 8, 6, 4 and 10 months) and they loved it!! We loved it too! Such a fun place to explore and learn. Much bigger than we expected it to be and the price was GREAT! our tour guide, Elaine was WONDERFUL! She was great with the kids, so much fun and every informative. Highly recommend. Makes a great homeschool field trip too. Be sure to go through the Fire history as well! \nWe will definitely be coming back soon.",
   "A great display if horses.... Only a little child friendly. Child section is growing."
  ]
 },
 {
  "name": "Penwood State Park",
  "address": "560 Simsbury Rd, Bloomfield, CT 06002, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/82e89f34-9330-11ea-a6ba-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=1146228081818920470",
  "source": "GoogleMaps",
  "reviews": [
   "A really nice park to take a walk on an old paved trail. It is not that difficult. It takes a little over an hour to walk the loop at a moderate pace. Make sure to keep an eye on where you're walking because people here seem to let their dogs poop right in the middle of the trail so watch out for landmines.",
   "Quiet and secluded. Restrooms are impeccable. Plenty of trees and grass. Great for dogs and children. Adults can have a good time too.",
   "Numerous trails and look outs. Easy access. Good sized state park.",
   "One of my favorite place to hike. There are a couple scenic overlooks. Around 4.8 mile hike,  when you take the yellow trail and then go on to the metacomet trail back to the parking lot.",
   "Lots of trails. Dog friendly"
  ]
 },
 {
  "name": "Stanley Quarter Park",
  "address": "451 Blake Rd, New Britain, CT 06053, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/832de5a4-9330-11ea-9c48-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "free",
   "field",
   "walk",
   "kids",
   "walk",
   "nature",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=1466512633918681497",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful park! Great place to take a relaxing walk around the pond, while enjoying the swimming geese. There is a nice playground for the kids, as well as soccer and tennis fields and plenty of free parking. Good spot to relax the mind and to decompress! 💕",
   "Great park for walks, featuring woodland trails and a nice path around a lovely geese populated pond. Along the path are various fitness machines. You can find tennis and basketball courts, a skate rink, soccer field... This park has it all.",
   "Good for a walk, jog, chill-out and even a play with the kids and/ or dog. Lots of construction and upkeep going on and it shows. At the right time of day you will have lots of space to yourself too. Careful with geese though,  you can easily find yourself the subject of many beady eyed fowl.",
   "It's an ok part that needs the renovation be it's getting badly. It does have a pond to walk around, also wooded trails next to the skate park. The basketball courts I believe are getting redone currently 3/6/20 and they have baseball and soccer fields. The 4th of July fireworks are amazing here",
   "One of my favorite places to go and relax and hang out. Always people walking around and enjoying nature,  which is refreshing to see in a city setting. Really nice to see people of all ages enjoying this park and skate park."
  ]
 },
 {
  "name": "Wadsworth Falls State Park",
  "address": "721 Wadsworth St, Middletown, CT 06457, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/83866614-9330-11ea-9a86-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=3828780895000723801",
  "source": "GoogleMaps",
  "reviews": [
   "Really cool place to take your kids. As soon as we got there and saw how beautiful the waterfalls were my kids were begging me to go in the water. We took awesome pictures and had a wonderful family day.",
   "Really cool place to visit. The trail from the lower end to the larger falls gets very confusing, but to the lower falls is well marked. Both are beautiful. The connecting trail from the lower/smaller falls to the main trail seems to have been washed away, so I had to backtrack. If you’re going to see only the larger falls, you can almost access it directly from\nthe parking lot and there is a cool, fended-in, 1-person viewing platform over the larger falls.",
   "Beautiful state park conveniently located in Middletown! Breath taking views of big waterfalls and the little falls if you wanna take a little hike its definitely worth it. It’s such a beautiful relaxing atmosphere.",
   "Great waterfalls. They can be viewed from the top or the bottom. Several hiking trails with dome up/down hills but well kept. You will need to print a map as there ate no maps available at site.",
   "Pretty park. Just be aware there are two ends, one, the main park, swimming in season and trails. Long walks to the falls. And the second entrance a few miles away offers almost immediate access to the falls. Depends on why you are there. Enjoy!"
  ]
 },
 {
  "name": "Nevers Park",
  "address": "Chief Ryan Way, South Windsor, CT 06074, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/843ee122-9330-11ea-b9c4-14b31f159f22.png",
  "tags": [
   "nature",
   "kids",
   "kids",
   "family",
   "free"
  ],
  "link": "https://maps.google.com/?cid=9107678198213201394",
  "source": "GoogleMaps",
  "reviews": [
   "Nevers Park is wonderful all year round. I love the trails and the bucolic nature of it. The playground is outstanding! My two-year-old granddaughter loves it.",
   "Nevers park is beautiful and well maintained. It's a place for everyone, whether you're up for a jog, a bike ride, or in the playground/skatepark with kids. There's graveled trails in the sun and in the shade.",
   "Great park with playground, basketball, baseball court, skate park and woods.",
   "Great park. Lots of structures for kids. Highly recommend. My only complaint is the limited restroom facilities.",
   "Attended the strawberry festival. This was a great free family friendly community event. The park is lovely with a large playground, a beautiful exercise trail, a large pavilion and picnic area, many sports fields, and plenty of sunshine or shade depending on your needs."
  ]
 },
 {
  "name": "Charter Oak Park",
  "address": "Manchester, CT 06040, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/84a62eae-9330-11ea-a1bf-14b31f159f22.png",
  "tags": [
   "free",
   "music",
   "kids",
   "kids",
   "walking",
   "field",
   "kids",
   "music",
   "walk",
   "kids",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=16854838505345638998",
  "source": "GoogleMaps",
  "reviews": [
   "Charter Oak Park is one of Manchester, Connecticut's jewels. Recently upgraded, it is a great source of recreation for toddlers to grandparents. Easy access from downtown or I-384 with free parking. There are jogging/walking/bike trails along a river, ice skating in the winter, fields for softball, frisbee or flying kites, and basketball and tennis courts. Very popular are the two clean, inviting, engaging playgrounds, one for little ones and another for children of all ages. Don't miss the music garden.",
   "This park was a good time. For everybody, Men, women, kids, dogs. A lot of attractions to keep you busy.",
   "A very well designed park. Plenty of walking paths, access for dog walking, a nice play scape, basketball courts for the kids, tennis courts, and pretty well maintained at that. I give the landscaping team there big props for doing such a good job on the gardens.",
   "Great park for kids. Has basketball courts, tennis courts,squash courts, music garden, soccer field, public restrooms. They also have a nice play scape with slides and monkey bars as well as a bunch of other stuff.  Overall a great experience",
   "This park has been completely updated with gorgeous you paths, flowers, musical instruments, bushes, signage, murals, facilities, fields, courts, equipment, bike lockers and of course convenient access to the East Coast Greenway. Perfect place to get back to mother nature and enjoy a short walk along the brook. There's something for everyone and plenty of parking to boot. Bring your camera, bring your dog, bring your kids, sign up for one of the numerous on going classes and maybe try your hand at Geocaching. If you don't know what that is Google it, download the app and enjoy the fun and the community."
  ]
 },
 {
  "name": "Roaring Brook Nature Center",
  "address": "70 Gracey Rd, Canton, CT 06019, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/84fbc906-9330-11ea-92b8-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "kids",
   "knowledgeable",
   "nature",
   "free",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=1721029896877816169",
  "source": "GoogleMaps",
  "reviews": [
   "Friendly knowledgeable staff . Cute gift shop. Also they help injured birds  in the Hope's to release them back into the wild. Donations are greatly appreciated.  Will definitely have to go back .",
   "Great place to take your kids",
   "We had my daughter Logan’s birthday party there and it was amazing!  The children had such a great time and learned so much about the animals and they loved the nature walk/hike! Logan had so much fun choosing the animals for the demonstration.  \nJay is wonderful and so knowledgeable! Thank you again to Jay and the entire staff !! Highly recommend!",
   "Everyone respected me cause I cannot be around snakes.\nThe Hawks were simply outstanding. An all the other birds that have there own stories.",
   "This place is absolutely the best for introducing your young child to the wonderful thing that go on in nature all around us. There are free trails behind the building, and the museum, while small is very good. A small gift shop is on site too. Great for birthday parties too!"
  ]
 },
 {
  "name": "Keeney Memorial Culture Center",
  "address": "200 Main St, Wethersfield, CT 06109, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8540c16e-9330-11ea-a524-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=2440613715500670464",
  "source": "GoogleMaps",
  "reviews": [
   "Psychic Fair 4 times a year. Beautiful building.",
   "There are some great historical exhibits inside here. We've been on the lantern tours two years in a row (around Halloween time) and can recommend them. Get tickets early as they will sell out.",
   "Love the old building I go there for the Astrological Society Fair.  Love it",
   "Great Psychic fair!!",
   "Very nice and helpful attendant. The place to go for tips on what to visit in town."
  ]
 },
 {
  "name": "Brownstone Exploration & Discovery Park",
  "address": "161 Brownstone Ave, Portland, CT 06480, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/85a465cc-9330-11ea-b62e-14b31f159f22.png",
  "tags": [
   "active",
   "kids",
   "adventurous",
   "walking",
   "kids",
   "kids",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10161462098664143409",
  "source": "GoogleMaps",
  "reviews": [
   "Fun place for active individuals that enjoy the water.  There’s so much to do here & they separate by age along with intensity level of what you are trying.  Plenty of lifeguards all over, but it’s always best to use your own judgement.  Definitely an all day event that will leave you exhausted!",
   "Tons of fun to be had here!  With a wide variety of activities ranging from impressive zip lines to a relaxing day swimming and lounging in the sun, there is definitely fun to be had for everyone.  Most of my group got the full adventure pass and spent the day zip lining, riding the water slide, and climbing around on the inflatable water features.  The less adventurous people went with the less expensive swim pass and had just as much fun staying on the ground / in the water.  (they too had the option to use the floating water features). The floating trampoline was a particular hit with the kids in our group.  We rented a gazebo for the day and I can not recommend that enough.  The gazebo was floating attached to one of the docks and we could swim right off of it.  Definitely planning on getting a season pass next year and going as often as possible.   I was recommended to bring water shoes since there can be quite a bit of walking if you plan on doing a lot of zip lining, and I found that to be good advice.  That being said, plenty of people were barefoot all day and didn't seem too bothered by it.  Great place to spend the day, whether your goal is adventure or simple relaxation.",
   "Fun place to go in the summer! Always a fun time here! Zip lining and jumping into the water was awesome here!",
   "Pretty neat waterpark.  Several zip lines ending in water.  The middle has floaties for kids and adults to enjoy.  They also have a climbing wall you can scale either the old fashioned way or on a metal ladder.  Can be a bit of a line though with slow climbers.  Recommend you have shoes on for this.",
   "Cool place be prepared for a workout you will leave here sore and tired. Oh and you can bring your own food and drinks cooler permitted and chairs. Great for an all day family event! Had tons of fun kids and adults will love it. They provide life jackets ugh but majority if not all are broken and falling apart with gashing holes and just icky only downside I could think of."
  ]
 },
 {
  "name": "Batterson Park",
  "address": "Batterson Park Rd, Farmington, CT 06032, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/85f9b1b0-9330-11ea-9e38-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10866117269064320488",
  "source": "GoogleMaps",
  "reviews": [
   "It's a perfect place to bring your kids and dogs",
   "It's just a place of relaxation..",
   "Don't know if you're supposed to be swimming in here or not but we did and it was fun, very beautiful here",
   "Our local little happy place!",
   "Perfect place to fish with your Dad & others!"
  ]
 },
 {
  "name": "Salute",
  "address": "100 Trumbull St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/865d07a6-9330-11ea-be7e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "family",
   "food",
   "delicious",
   "family",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5576146515959044435",
  "source": "GoogleMaps",
  "reviews": [
   "All of our food was delicious, and obviously very fresh. Service was fantastic and she went out of her way to help us find stuff to do in the area. Cheese bread was good but nothing special. Complimentary biscotti was a nice touch for sure.\nAll in all, the prices ended up being really reasonable for lunch. Definitely going back again.",
   "Visited this place for the first time.  The food was awesome, but most of all the service was amazing!  The place was packed, but you would never know it by the service we received.  They made you feel at home and they were genuinely kind.  Our food was delivered quick and it was delicious.  We  will definitely be returning.  Thank you for such a great experience.",
   "This is how it's supposed to work. You're going to be in Hartford (an unfamiliar city) for one night, so you go to TripAdvisor, and make reservations at the #1 rated restaurant. You show up on time, and even though the place is hopping, your table is ready. You have your first of seven encounters with waitstaff, and it's friendly and good-humored, as if you are family. Right away you know that someone has taught this team how important their efforts are to the overall experience.",
   "Awesome restaurant with great atmosphere. Good prices. Our server Vinny was awesome and the food fantastic. I have the No. 11 Special and was very pleased. Table service was fast and steady, while one of the owners stopped at our table as well.",
   "I went there for lunch with my family. It wasn’t very crowded and the service was top quality. The waitress was so friendly and polite and the food was very delicious. We loved the cheese and bread started so much!! They also offered us free cookies to take away when we finished. Great experience"
  ]
 },
 {
  "name": "Trumbull Kitchen",
  "address": "150 Trumbull St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/86a61eda-9330-11ea-9806-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=8270149726797616816",
  "source": "GoogleMaps",
  "reviews": [
   "I didn't know what to expect from the outside view, but I was very pleased with the Trumbull Kitchen's lunch options during a recent business trip. The place was recommended by a coworker who is local to the area. I was told that it can fill up quickly during lunch, but we had no problems getting seated for a group of five at noon. \n\nThe beer list is outstanding with some top of the line Connecticut craft brews, as well as some national staples. The menu had a lot of great options, and my bourbon burger was outstanding. The sweet potato fries were also very well prepared. \n\nThe interior setting and seating is very stylish, with an old school speakeasy motif. Service was also very pleasant and responsive. \n\nI will definitely be back the next time I'm in Hartford!",
   "Food and atmosphere was really nice. We had a great waitress and deserts were delicious. Definitely a good spot to go back too.",
   "Food was good, great venue, ate at the bar, nice crowd.  Nice adult feel.  Good outside patio seating.",
   "Very good meal, attentive server.  Seated quickly with reservation.  Food came hot and. In a timely manner.  Wasn't to loud, though it was moderately crowd for a Wednesday evening.  Good experience",
   "Ordered the Grilled Fillet Mignon as an appetizer and it was delicious.  Steak was perfectly cooked (rare) and the tater tots on top added a nice crunch. Everyone enjoyed their meals as well. Very nice ambience with plenty of room in between tables. Will definitely will go back!"
  ]
 },
 {
  "name": "The Capital Grille - Curbside Takeout & Delivery",
  "address": "44 Front St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/86efd26e-9330-11ea-b3af-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14016276002407512501",
  "source": "GoogleMaps",
  "reviews": [
   "This place is my first choice site.  Of all restaurants I know I love it most. I never miss an opportunity to go to that place. Whenever  I want to go to a decent dinner, this is the place that comes right away to my head. outstanding and varied  food and a rich menu.professional staff members, and great spirit. Also important, the charge is modest. I tell about this restaurant with pleasure.",
   "Stopped by while on a road trip with the family and can honestly say I was pleasantly surprised. Everything from the incredible food to the unsurpassed service, to the atmosphere was magical. The location is just super as well. If I lived in the area I would probably be a regular.",
   "What an amazing and wonderful experience!!!! Be warned, it is a on the pricey side! So worth every dollar though! The steak was so flavorful and delicious, the lobster crab cakes were more lobster and crab than cake. The crab on top of the steak wasn't held back, but piled on! Lobster Mac and cheese so creamy and big pieces of lobster! I have never had a better glass of wine or better dessert! Don't walk....drive there! The valet is fantastic as well! Very speedy and helpful!",
   "I celebrated my PhD this evening in this delicious restaurant. Well we passed a magnificent evening and the restaurant was evidently one of the reasons for this outstanding celebration. The crew  contributed in a graceful way, the meals were very good and my guests were so  delighted. We shall surely return for more celebrations. thanks very much.",
   "Beautiful ambiance, amazing and umpecable service a digital drink/wine menu. Food was amazing! Love it here ...will be back (next time I'm in Hartford)"
  ]
 },
 {
  "name": "Max Downtown",
  "address": "185 Asylum St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/87314846-9330-11ea-a4b0-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=12753422735432709986",
  "source": "GoogleMaps",
  "reviews": [
   "I celebrated my nomination earlier this evening in this fine place. happy to tell that we passed a fabulous evening and the restaurant was surely the reason for this fruitful gathering. The stuff  helped in a very nice style, the cooking was tasty and my buddies were extremely  glad. We shall surely return for more celebrations. thanks very much.",
   "Great great great restaurant. We actually went back a second time in the same trip the food was so great. Prime rib was amazing, the pasta small plates were great, the tartar and buffalo cauliflower were great. Honestly everything was so good, we got the baked Alaska twice, if you like marshmallow this is for you.",
   "Some parts are amazing and other parts need improvement.  The decor of this place is amazing.  Love the design of the bar and dining areas.  The mixed drinks are great too.  Probably the best old fashioned I've ever had was made here. Some of the food was great too; lobster pierogi and Mac & cheese were great. That said, the prime rib was sub par. I've had better elsewhere and have even made better at home. It was under cooked, very fatty, and was served with a horrible knife.  I might as well have been given a butter knife to cut this stringy cut of meat. Overall, the whole experience was simply inconsistent.",
   "Relaxing place to have a late afternoon/happy hour bite & cocktails. Service is impeccable and our bartender was \"bar none\" ;) an artist making a delicious Negroni and beautiful Aperol Spritz! The atmosphere is upscale-downtown while still maintaining a casual feel. The seafood is always fresh and plated to please. Anyone passing through Hartford near the XL Center or locals who are making a stop @ the \"banking corner\" should duck into Max Downtown!",
   "One of the most reliable \"great dining experiences\" in greater Hartford and still, I think, the flagship restaurant of the Max family of restaurants.  Always superb beef and fish entrees that make me think of this as a chop house style reminiscent of the great Manhattan restaurants of the 50's and 60's but with a sophisticated contemporary design.  The bar is a great choice for a convenient lunch if you don't have the time to indulge."
  ]
 },
 {
  "name": "Black-Eyed Sally's Southern Kitchen & Bar",
  "address": "350 Asylum St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8778b198-9330-11ea-aca9-14b31f159f22.png",
  "tags": [
   "music",
   "food",
   "walking",
   "food",
   "food",
   "music",
   "food",
   "music",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3722758062320331814",
  "source": "GoogleMaps",
  "reviews": [
   "Love this place. From the decor, artwork, ambience, music and food it’s just on point. If you like southern food and blues music it’s a must! Came in on a very cold rainy day and just felt the warmth just walking inside. Good food, music, service. Also great atmosphere. Was within easy walking distance from our hotel. Loved their ribs and the artwork on the walls. Recommend it highly.",
   "Have been a few times and the Nashville hot chicken sandwich has consistently been better than the last time. It was pretty good to begin with. Cornbread is good and a few other things I've tasted were good as well. Not a fan of the prices or the portion sizes always but it's pretty good food.\n\nI don't go for decor but if that's your thing, I'm not fond of it. I think it's going for like a New Orleans vibe but whatever it is but I don't care for it. But as I said it doesn't make a difference to me.",
   "Omg! This place was bomb. The vibe was perfect. The food reminded me so much of home. I am from the south and they definitely have got the taste and flavorings just right. We stopped in on a Thursday night where a live band was playing. The music was so good. Everyone was having a great time. If I am ever in Hartford again I will definitely be popping in.",
   "We took the Fastrack bus line from New Britain to go here to see \"Jake Kulak and the Lowdown\". They had a small cover charge, but the band was awesome and so it was well worth it. As a matter-of-fact, I had gone here before to see another great young local band,  \"The New Amsterdam Nobles\". They put on a great show and the crowd as really into it. \nI don't know who books the live acts here, but they know good music. \nThe food and drinks were all good and the prices were reasonable. I'd recommend trying the ribs or perhaps the wings.\nThe waitstaff was attentive and kept up nicely with demand.\nThis is a nice place to go for a meal or just drinks...",
   "Best BBQ that I have eaten in Hartford! The chicken and waffles were surprisingly great. The way they fry chicken is just down home goodness. The flavors from the ribs, beef brisket and chicken were savory with just the right amount of sweet. The rib meat did not quite fall off the bone, but they had awesome smokey flavor. The fixings were next level with melt in your mouth cornbread and red beans & rice. We will be going back soon. Bonus, walking distance to the XL center."
  ]
 },
 {
  "name": "Bear's Smokehouse Barbecue",
  "address": "25 Front St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/87be1f4c-9330-11ea-8254-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "cheap",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12300596955110226988",
  "source": "GoogleMaps",
  "reviews": [
   "Bear's BBQ is a cafeteria style restaurant. You get in line, place your order, receive a tray, get your sides and beverage. You pay for your food and go and find your seat. Bear's BBQ is the best BBQ in Connecticut in terms of a restaurant. The food is great every single time and it's high quality food that you can get very quickly. The mac attack is my staple. It's macaroni and cheese topped with Pulled Pork (you can choose your style of meat). The meat and pasta are always cooked perfect. Something about the Birch Beer here is better than anywhere else that I've had it.",
   "The food here was very good. If you like BBQ, this Smoke House is the place to visit. For lunch, dinner, take out and, they even do catering. If you are in the Hartford or the Hew Haven area, you won't want to pass this place up.\n\nVery large menu, great sides, desserts and an outstanding staff. Customer service was very nice and with a smile of kindness. Very helpful and attentive. The Brisket was on the money good. \n\nParking might cost you about $3.00 an hour because, you may have to use a parking garage. \n\nThe only reason I didn't give a 5 Star is because, the food wasn't served very hot. However, I highly recommend.",
   "The foods good but the staff is not. I tried to call in and waited 20 minutes and no one picked up. Also tried to order online. I'm about to click checkout when the clock hits 7 30 pm. They wont let you place the order. Had credit card info and everything but still wouldn't let me order. Also the food is very expensive to go along with all of it.",
   "Come here if you want to see how cheap someone can be. The way they cut the meat is like asking a hungry homeless guy to share his food. I've never watched someone work so hard to cut so little. If they cut a little extra off they'll actually put it back in the wrapping and not on your plate. Its amazing to watch. Then they'll tell you its $20 and ask for tip. Following you'll take your jailhouse tray and seat yourself.\n\nIn short: Got food poisoning and pretty expensive for the small portions and the fact you have to seat yourself. Won't go back",
   "Ordered and paid a week ahead of time for Easter. Had to wait almost an hour just to pick our order. Then many of the things we ordered (a week ago remember) were not available. Total bust. Very little respect for their customers if they can’t honor what people have ordered. Won’t be going back"
  ]
 },
 {
  "name": "ON20",
  "address": "400 Columbus Blvd, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/881e681e-9330-11ea-8c42-14b31f159f22.png",
  "tags": [
   "music",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13704055684385063880",
  "source": "GoogleMaps",
  "reviews": [
   "Me and my girlfriend visited and decided to go somewhere fancy for our four year anniversary. It was one of the most amazing meals we've both enjoyed in a very long time. Service was impeccable and the atmosphere was simply sublime. We picked a wonderful night since they had live music and I would recommend to anyone trying to have a wonderful evening.",
   "Great environment and amazing food. Perfect combination regardless if you are celebrating something or just want to enjoy a nice meal. It has the great restaurant vibe without the pressure from the staff. Compliments to the chef. Hands down the best foie grass I have ever had.",
   "Ambience and view were amazing (probably the best one in Hartford), but food was not special. Recommend for special occasion.",
   "Amazing views of the Hartford skyline and out to surrounding areas.  Food is extremely well seasoned and prepared, staff is attentive and not over anxious.  Pretty laid back and relaxing place.  Not easy to get to but worth it.",
   "I was blown away by the food. We had a slow start with service, but that was remedied. We came for the monk fish and were not disappointed. It was incredible. And... HALF PRICE BOTTLES OF WINE. I am not sure how long they are doing this promotion, but it was Friday night and we had an amazing petite syrah bottle for a steal. It was worth every penny."
  ]
 },
 {
  "name": "Ted's Montana Grill",
  "address": "35 Front St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/88753ac8-9330-11ea-a3d0-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=6034580238822972383",
  "source": "GoogleMaps",
  "reviews": [
   "This place is absolutely one of the tastiest place in the neighborhood. Whenever I visit this place I am extremely satisfied. They maintain their high  level service and the topmost level of meals  they provide. You surely will enjoy this this place. Highly  recommended.",
   "Last week was our first time we went to this magnificent restaurant. But It is definitely not the last time. We passed a splendid evening with the generous service, with the first-rate  meal and booze and with the comfortable pay. We will surely come back in a short time.",
   "We frequented the branch in Naperville years ago, and were pleasantly surprised when we noticed one in Hartford. The decor remains the same blend of wooden panels and green leather. The menu is also what we remembered. The crab cakes we're as great as ever with a guacamole spread. And the bison pot roast is tender and goes well with the mash potatoes.  It's great that some things remain the same.",
   "Awful service. Waiting over an hour for food. 45 minutes to be told they were 86 on crab cakes, and 30 minutes for drinks. Just ridiculous! Plus our server David came over once to check on us!! After visiting the science museum, their website  recommended dinning at Teds. I would  highly not recommend going there at all unless you like waiting and sitting there for 2.5 hours. I understand things get busy but no common courtesy to keep us informed. This food was nothing special! I couldn’t honestly get it anywhere. I suggest working with your staff to ensure a better service.  Waste of money and time being there.",
   "Great ambience. Servers were pleasant and very polite. Bison is on the menu and shrimp appetizer was particularly good. Good cocktail offering, enjoyed New Happening with Woodford reserve. The bar also looked liked a lively place for after works happy hour."
  ]
 },
 {
  "name": "Sorella",
  "address": "901 Main St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/88c64154-9330-11ea-ad57-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "cheap",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12912267294745293335",
  "source": "GoogleMaps",
  "reviews": [
   "Located right across from an outdoor municipal carpark, it remains a happy Italian bistro. I stopped by a few weeks ago for a pizza and an iced tea. Their pizzas are not inexpensive but so it goes everywhere now. I must applaud the waitress who was outstanding in service. The pizza was delivered to my table quickly and was bubbling hot. My only problem was salty mozz. I use fresh at home all the time and this cheese was either soaking in salt water, or more salt had been used in the recipe. So here's the daft me. I removed the cheese, and brought that DELICIOUS CRUST home with me. You know a good pizza crust by just how long it can remain in your fridge. This crust is thin and yummy, and so three days later, I found myself making a sauteed veggie pizza using the same crust. I will try another type of pizza the next time I visit because I like the vibe. There's a bar counter for those who are the beer and lunch set, but I was fortunate to have a table. A different sort of review, I know!",
   "Great happy hour and even better meals.  I highly suggest checking this place out.  The happy hour options are fantastic.  The house red blend wine is delicious, the pizza is cheap but amazing, and all the ingredients taste fresh so the meals are exceptional.",
   "Stopped here on a very short trip to Hartford. Food was really good and the  service was excellent. Would definitely recommend it here!",
   "two days ago was the first time in this good restaurant. But It is definitely not the last. We passed a splendid evening with the efficient service, with the fine cooking and booze and with the friendly payment. We will surely return there in a short time.",
   "Nice place to grab a bite before the show, summer salad, calamari, and garlic bread mmmmm delish!! Service was great !!"
  ]
 },
 {
  "name": "Firebox Restaurant",
  "address": "539 Broad St, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/890aeb98-9330-11ea-b01c-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15206297806573229014",
  "source": "GoogleMaps",
  "reviews": [
   "This restaurant is a winning combination of gourmet dinning combined with a community social service agency. Being able to support a community effort while having a first class dining experience is a winning combination. Service was excellent. The hummus was good and the Brussels Sprouts appetizer was the best we have ever had. My duck was tasty but they should have removed the extra fat. The salmon dish was also a winner.",
   "Wow 1st wings of the day awesome the Hummus was tasty main dish scallops where beautiful. Service great (Amanda)",
   "Let me say first off, the service was excellent. Wonderful setting and ambiance.\n\nI ordered the 14 Oz NY strip steak. Ordered as medium rare and it came out medium-well and dry. Potato puree was lumpy, was borderline cold, and had zero flavor. Sauce was over reduced and incredibly bitter. The rest of the table seemed to enjoy their food so I guess steak wasn’t the best choice? Too bad. Mushroom bisque was flavorful but very grainy. Good drink list.",
   "The last couple of times my wife and I have had a babysitter, we have come here for our date night. The food is exquisite. We always get the Brussels sprouts and I have had both the duck and the pork shank which were to die for. It's a nice laid back atmosphere with energetic and attentive service and great food and libations. If you live in the area and haven't been, you truly must go!",
   "We go here all the time despite it being a bit out of our way. Best Sunday brunch I've found in Connecticut! Great, fresh food perfectly cooked every time. Great, friendly service every time. Worth every penny."
  ]
 },
 {
  "name": "Feng Chophouse",
  "address": "93 Asylum St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/895c1900-9330-11ea-9c42-14b31f159f22.png",
  "tags": [
   "food",
   "cheap",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=8946148364221302842",
  "source": "GoogleMaps",
  "reviews": [
   "I was very impressed by the food I was served. I would definitely recommend the chef’s choice nigiri platter, some of the freshest and finest sushi I’ve had in the northeast. They green tea cake will not be a bad decision either!! The restaurant is pretty big and ambiance is in line with their food story.",
   "This is a high end steakhouse and sushi sashimi.  In my experience is hard for a single location to been good at both, they do an extraordinary job. Just had an amazing NY Steak and the high end blue fin tuna sushi. We had a large group of 12 people and the service was excellent. Highly recommend this place.",
   "Off the charts GREAT!! There were so many good things on the menu we were having difficulty making a decision. Server was a great help and fun.  Very comfortable and upscale atmosphere. Couldn't have asked for a better night - 5 stars!",
   "Beautiful Restaurant, modern design, great interiors.\nGreat ambience, great music (not the typical cheap elevator Muzak)\nFood was excellent. Portions a bit on the small size.\nService was exceptionally professional.\nWould go there anytime again.",
   "This restaurant gives fantastic service and enjoyable menu. One of my favourite restaurants around here. The meals served quick and the rates were inexpensive. I recommend this place."
  ]
 },
 {
  "name": "The Blind Pig Pizza Co.",
  "address": "89 Arch St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/89b583dc-9330-11ea-8ceb-14b31f159f22.png",
  "tags": [
   "creative",
   "food",
   "food",
   "family",
   "food",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=14360288682457656668",
  "source": "GoogleMaps",
  "reviews": [
   "I was in downtown Hartford on a Sunday afternoon with some friends and was really excited to see that this place was open. A lot of restaurants are closed on Sundays in the area so that was a relief. The restaurant doesn't have its own parking lot but there is street parking and even a garage right across the street. We walked in and the place was already busy (around 3pm) so we sat at the bar. Our bartender was nice and checked on us a few times while we were sitting. We got the chicken bacon ranch and the pulled chicken pizza which were both good. The crushed dorito seasoning really adds to most of the pizzas. Additionally the drinks and cocktails they offer are creative and all very good. I'd recommend a visit in, good food and good drinks.",
   "The pizzas were awesome, and the staff was so welcoming and friendly. We didn't realize at the time, but we went near closing time. They didn't make a fuss over that at all and served us without a rush. We later found out we had cut it a little close and felt bad, but they were so kind about it. We really appreciated it, and we'll definitely be back!",
   "The Pup, Pints, and Pizza event at The Blind Pig is so much fun. Their food is always great as is the service. My server tonight couldn't have been better. Look for their special events; they do some really cool themed dinners. I need to go to try their happy hour menu and their Monday night tacos, which I'm sure are as great as their regular menu.",
   "Our family loves the pizza and mozzarella sticks. We always get a couple cheese pizzas with a meatball pizza and sometimes a bacon pizza. Bacon has a kick to it. Love the charred taste of the crust. The marinara for the mozzarella sticks used to be like a vodka sauce but this past week they changed it. Basic marinara taste but excellent. Usually there isn’t anywhere to sit but Valentine’s Day evening no one was there except at the bar. We always get our food to go but plan on dining in one day soon. Definitely very tasty and fresh food!",
   "Best pizza in Hartford, possible the best in the state. Perfect crust, great and unique styles, restaurant has nice ambiance. On my last visit (5/19) they were clearly short handed but Sarah R was still wonderful despite it being so hectic. Cent wait to come back."
  ]
 },
 {
  "name": "J's Crab Shack",
  "address": "2074 Park St, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/89f6f564-9330-11ea-9ef9-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "family",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=13770005244792406566",
  "source": "GoogleMaps",
  "reviews": [
   "The wait staff was attentive and knowledgeable. I really liked the New England Clam Chowder it was very hot and full of flavor. I got the captains platter which had shrimp, fish, scallops and calamari. I opted for the baked potato which was for an additional fee but was well worth it. My food came in less than 15 minutes I was pleasantly surprised on the speed in which I received my food. As an avid seafood eater I will definitely be back. I highly recommend the experience.",
   "This was our first time going to this restaurant we always hear our friends and family always talking about going but we never thought about going urself. We always thought that chowder pot was the best place to always go for seafood, I can tell you No No No way, from we walked into the place the waitress was extremely nice positive they made sure that we were very comfortable and happy. when we was ready to placed our order we got the shovel that was amazing I mean like it had the best part of the seafood you can would have to buy separately.",
   "Very casual very fresh...one side a fresh fish market the other a restaurant. They make very best clam chowder, great lobster bisque and we have not had a meal there we did not enjoy. Haddock with lobster stuffing is a favorite, along with fried haddock and chips. The lobster roll is great and come on the freshest most substantial roll.",
   "J. - Crab was originally Tinkers in the good ole days. Very little has changed. If you want good, fresh, tasty seafood J - Crab is a great place for it. Always bustling with seafood hungry folks, noisy and filled with laughter. Quality food portions so you won't leave hungry. Highly recommended. Yum!",
   "Great fish and chips. I always get the fish and shrimp combo comes with fries. And the clam chowder is awsome. Been going to the old location on new park Ave for years and now there new location here. Great place to eat seafood.  Better than City fish market."
  ]
 },
 {
  "name": "Trinity Restaurant",
  "address": "243 Zion St, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8a4068e6-9330-11ea-8c05-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "unique",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5940541333348208108",
  "source": "GoogleMaps",
  "reviews": [
   "Not sure how this place even stays in business – so often it is virtually empty during peak dining hours. With such amazing food, it deserves to have a far wider audience and clientele. Have dined here a number of times and have never been disappointed once! Located on Zion Street, behind Trinity College in Hartford, the restaurant is small, cozy yet chic. Parking is on the street. Beer and wine available.",
   "Awesome food.. Homely decor.. (literally its a home converted to a business) The lady takes care of the guests really well.. I loved every bit of my veggie panini.. The Tiramisu was awesome too.. The lunch service can be little slow, but you will enjoy the food.",
   "The food was delicious and the atmosphere was inviting. The prices were reasonable as well. We had the squash ravioli as an appetizer, with the  balsamic vinegar added it was a very unique and delicious treat. We both ordered salmon entrees, but one was a salmon salad the other was with potatoes and veggies. They were superb!!",
   "Some of the best food anywhere. Squash ravioli are to die for. Soups are hearty, tasty and homemade. Vegetables are fresh and usually organic. Even the little knot dinner rolls are fabulous. Serves wine and beer only. Highly recommended!",
   "If for some reason you still haven't eaten here, you're truly missing out. It has to be one of the very best restaurants in the area. Like so many people have said, the homemade butternut squash ravioli can be habit forming. All of the pasta dishes are wonderful though. The Bolognese is the best I've tasted. The owners, who do the cooking and the serving, also could not be any lovelier if they tried."
  ]
 },
 {
  "name": "U.S.S. Chowder Pot IV",
  "address": "165 Brainard Rd, Hartford, CT 06114, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8a936b1a-9330-11ea-a8d3-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "knowledgeable",
   "eat",
   "family",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12521220722742079624",
  "source": "GoogleMaps",
  "reviews": [
   "I came here with a friend to try the Taste of Hartford menu after work. I'd recommend making a reservation, I'm not sure if it was so busy because of restaurant week or if it's usually like that, but people were definitely waiting. \nThe food was was good. I got Rhode island clam chowder, blue crab casserole, and the cheesecake. The soup was really good, it had a fair amount of salt but I like salt personally. The crab casserole was also good with big chunks of crab. The stuffing was alright but I personally found it too buttery with too much bread. \nOur waiter was extremely attentive and friendly. All the staff seemed to be friendly with a smile.\nThe inside seems to be a little dated and needs some updates. Also make sure you drive around to the back since that is the main restaurant entrance.",
   "Yum! 😋\n\nThe entire experience was fantastic. The hostess greeted us with a smile and was genuinely happy. We were told our wait time would be approximate 35-40 min, which was fine for us. Our wait time was closer to 10 minutes! \n\nOur server was knowledgeable about the menu and very cheerful. She was very accommodating with our inability to pick something. There are so many great choices on their menu. We finally decided on the Oysters and Escargot for our appetizers. The oysters were delicious and the Escargot was presented with puff pastry on top, soaked in butter and they were amazing! \n\nFor my entree I ordered the Lazy Man’s Lobster, which was cooked perfectly and I didn’t have to dig through the shell! The fries were delicious and the cole claw was also great. I can’t remember what my boyfriend ordered, but I know he enjoyed his meal as well. If we’re ever in the area again we’ll defiantly eat here again!",
   "From the moment  you enter that place  team give you a great feeling. Very warm stuff, it is a kind restaurant to  enjoy with buddies or with your date. very good  cooking, professional  chief cook and stuff, modest  price and generous  service. Highly recommended.",
   "My wife and I ate there Sunday approximately 1 p.m. . service was great. Started with a shrimp cocktail, the shrimp wasn't fresh nice try. what the heck did you do to the clam chowder? Very few potatoes, and where were the Clans? and watery. Baked stuffed shrimp for dinner. Where's the flavor? I must admit, haven't eaten here over 10 years. The reason Crab Shack! If you want fresh food eat at The Crab Shack. I wanted Seafood and the Crab Shack was closed due to family problems so we decided to go to the Chowder Pot never again thank you",
   "TO GO ORDER ...VERY DISAPPOITING!\nChowder Pot is one of my favourite restaurant. Last week I place to-go order because I missed their food so much. How shock I was when I saw my order. There were half amount of food that I got when I dine-in and it was not fresh at all!! ! I paid a lot of money but it was not worth it at all!!!"
  ]
 },
 {
  "name": "Vivo Seasonal Trattoria",
  "address": "200 Columbus Blvd, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8ada588c-9330-11ea-9326-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3228111476641128255",
  "source": "GoogleMaps",
  "reviews": [
   "Good food, clean rooms. We stay at the Hartford Marriott whenever passing through that way or when we have an event in Hartford. The food at Vivo is excellent, we've enjoyed both breakfast and dinners there. Our breakfast waitress, Christine, is always smiling and provides great customer service. They're lucky to have her! Nadine Mullings has also always provided great service. She's a true professional.",
   "Cozy and warm. Great service and food. Give it a try. I have been several times and it never disappoints.",
   "I love the settings and the atmosphere. It’s lovable! I would have rate this five stars if only things went the way it should be. And I completely understand it was a holiday, so I had my patience with everything that was going wrong the minute we sat down. Despite that, I honestly highly recommend this place for guys who are looking to make their girl happy! Because it’s also reasonable price:)!!",
   "I like to go with friends to this place with my highest recommendations. I  go to this restaurant often. This recommendation is always successful. The the food there is appetizing and the team is efficient and cooperative. Whenever we go to this place we have a cheerful time.  highly recommended.",
   "We had a great dinner there this past fall (2018). My dining partner and I wanting to order two different things, the steak and the gnocchi,  the waitress asked us if we wanted the chef to split the two items between us, which we happily agreed to do. Delicious pairing and amazing gnocchi. Our friend who joined us had a full order of gnocchi which he agreed was perfect. Modern interior. Attentive staff.\n\nFollow up visit in early May this year (2019): \nWe returned to have the share the same two entrees we did last fall they were so delicious. The steak with a reduced wine sauce, asparagus and red potatoes and the gnocchi. With restaurants, chefs can change or buyers for their menu items, so this visit was not as impressive. Our food was good but not exceptional as it was our first visit. The grilled sirloin steak seemed to be of lesser quality and the gnocchi con funghi was quite overcooked with a brown crust. Plenty of mushrooms, however. \n\nThis chef did not split our two dinners for us in the kitchen either. We each got one entree and were told to split them ourselves. The bread,  olive tapanade and bowl of olives that comes with your meal is still good, and our waitress did go and find some white bread for us when one of us couldn't eat seeds. Our friend who joined us liked his bolognese alla rigatoni very much. The atmosphere is spacious and pleasing decor wise. Our drinks were well made. There is a large wine selection, too. The appetizer portion of the menu could use a little variety as there's nothing we have felt like ordering this visit or the previous one. Photos from May meal below."
  ]
 },
 {
  "name": "DISH Bar & Grill",
  "address": "900 Main St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8b243e88-9330-11ea-a312-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=16324019112047962807",
  "source": "GoogleMaps",
  "reviews": [
   "On a holiday weekend, the restaurant was relatively empty at dinner, but the staff seated everyone together in the front room and took good care of us. We appreciated their recommendations about the menu. Both cocktails and food were very good. We particularly enjoyed the shisito pepper appetizer, the short rib meatloaf, and the key lime pie. The ambiance is very pleasant. Not sure how noisy the restaurant would be if it was busy.",
   "Delicious menu with healthy options.  Busy but the staff was very attentive.  We also were able to doodle on the paper table.  Very enjoyable. Thank you.",
   "I celebrated my nomination earlier this evening in this fine place. Well we enjoyed a sensational evening and the venue was undoubtedly the reason for that fruitful event. The waiters  collaborated in a splendid style, the cooking was delicious and my friends were very  glad. We shall absolutely visit again for more joyful events. thanks very much.",
   "My husband and went to Dish for brunch. We loved it! Our waiter Matt was very attentive and was a big part in making our dining experience great! We started with the Calamari appetizer, it was so good breaded and cooked perfectly! My husband had the Maryland Crabcake Benedict, and I had the Shrimp and Grits! Both dishes did not disappoint! I would highly recommend Dish Bar and Grill to family and friends!",
   "Nice spot for brunch. Small menu makes it easy to find something nice, the inside is beautifully decorated and the servers are very kind. I ordered the crab cake Benedict and thought it was pretty yummy. Service didn't seem slow like had been mentioned on previous reviews, especially if you're chatting and enjoying yourself."
  ]
 },
 {
  "name": "Carbone's",
  "address": "588 Franklin Ave, Hartford, CT 06114, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8b7d4c26-9330-11ea-91e0-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15501688574764956719",
  "source": "GoogleMaps",
  "reviews": [
   "Had a wonderful dining experience here with friends last nite. The service provided by Linda and Christina was outstanding. Although the restaurant was completely full and they were quite busy, both these ladies remained cool, calm and professional. Both were extremely witty with great personalities which made everyone feel very much at home and welcome. The food was amazing. The lemon chicken, salmon and shrimp scampi were enjoyed by all. And the homemade cannoli in puff pasty was exquisite. Loved it all. So nice to see that a restaurant that has been one of our favorites for years is still going strong and maintains it reputation for excellence. Thanks to everyone and we will be back soon.",
   "Best customer service, great quality of food, prices are really good and the environment is phenomenal. Recommended!",
   "The food here is amazing! Literally get anything and you won't be disappointed. The drinks taste great too!  And I can't forget the awesome staff!",
   "Great business lunch. Salmon was very good. Cheesecake too",
   "Always agree to go to Carbone's. Never have they disappointed us. Highly recommended for a special occasion or just a nice night out."
  ]
 },
 {
  "name": "Costa del Sol Restaurant",
  "address": "901 Wethersfield Ave, Hartford, CT 06114, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8bb9ea94-9330-11ea-a47c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17583238873544665424",
  "source": "GoogleMaps",
  "reviews": [
   "One of the very few real Spanish restaurants in the area. Used to visit this restaurant every once in a while (a 35 minute drive from home). Always happy to visit: very friendly and efficient servers.   Food was good to excellent. Could be a bit pricey, but you’re paying for the service and the ambiance and the quality. Very clean restaurant (bathrooms always super clean and fresh). IMPORTANT!!! Costa del Sol Rest. is CLOSED (they said TEMPORARILY) but I’m afraid it will not reopen at least not with current owners (for more than 30 years). I hope I’m wrong and they reopen.  It’s been closed for a few months now; I just heard about this yesterday... VERY SAD. Can’t believe it...",
   "I've never had paella before tonight, but I am a huge fan now.  For the quality and quantity of food, Costa del Sol is well priced.  The cava sangria was delightful as well.  For dessert, I had the almond torte was the perfect ending to a fine meal.  I look forward to going back!",
   "Looks like they're going to be closed for Good. Where do I go for paella now?",
   "Absolutely delicious food. The paellas are to die for. Highly recommend. Love the atmosphere they created and they keep the Spanish flair. The sangria although very delicious, tasted more like a juice rather than a alcoholic beverage. It was fine for me but those dining with he would have enjoyed a bolder sangria. Food is delicious you will love it!",
   "Delicious food, excellent service, great prices, I love Costa del Sol Restaurant!"
  ]
 },
 {
  "name": "V's Trattoria",
  "address": "280 Trumbull St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8c09b870-9330-11ea-8d26-14b31f159f22.png",
  "tags": [
   "food",
   "tasting",
   "food",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=16087282411469786503",
  "source": "GoogleMaps",
  "reviews": [
   "I had the classic chicken parmigiana with fresh pasta.  The red sauce was sweet and flavorful.  I then had the bread Pudding for dessert which was freshly made, warm and tasty.  If you are downtown Hartford and looking for a good Italian restaurant, then this is the place to go.",
   "Great service, well designed with an industrial vibe.  Had an excellent bloody Mary, the kale caesar was out of this world, and Roberto's Pasta with meatballs.  The food was truly decadent, I will definitely be back.",
   "I love this restaurant! They provide first-rate food, their menu is varied, The cook in that spot is very experienced, I love very much tasting all their food. The dishes are always good, the attitude towards the guests  is efficient. I  go often to this place and I not even once was discontended. I recommend it with no hesitation.",
   "This spot offers superb service and yummy meals. My favourite spot in the city. The drinks and food arrived rapidly and the prices are affordable. Highly recommended.",
   "Ordered the Chicken Parm platter. Great taste and texture. No tomato sauce from the can here! Great service from the staff as well. Good ambiance and they have a private room if you have a big party."
  ]
 },
 {
  "name": "Stella's and Mazie's",
  "address": "461 Capitol Ave, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8c528202-9330-11ea-8a0d-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "delicious",
   "family",
   "food",
   "family",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9664773054418182412",
  "source": "GoogleMaps",
  "reviews": [
   "This was my first time going. All the five star reviews are accurate. I had the rustic curry hummus, side of rice and cabbage. If I had ate there (rather than to go), I would have ordered a second to go.",
   "A wonderful journey into your auntie's kitchen is what Stella and Mazie's feels like. Fresh ingredients - freshly prepared, interesting cultural selections, dietary friendly and no long wait. I love the food and the love you feel when you walk in. Run, don't walk and keep going back!",
   "I have eaten here often and have been satisfied with the customer service and food portions not to mention how delicious everything I've tried has been. Small but quaint and love the decor.  You must try the mac n cheese with gravy. The owners welcome you like family. Highly recommends this eatery. Positively the best in african fusion soul cuisine that takes you from West Africa through the Caribbean to America. The Jollof rice is outstanding, the jerk shrimp are always so nice & spicy cooked to perfection!! Fish and grits, domoda, and cabbage are fabulous, I highly recommend it!!",
   "Good Morning.\nMy Dad and I have been patronizing Stella and Mazies since they opened.  Their food is consistently GREAT.  They treat Us like family.  I call my Dad the “Customer of Month” because he dines there once a week.  And, they’re very accommodating to his dietary restrictions.  Keep up the good work ladies and thanks for all of the Hugs!!!",
   "I have eaten here often and have been satisfied with the customer service and food portions not to mention how delicious everything I've tried has been. Small but quaint and love the decor.  You must try the mac n cheese with gravy. The owners welcome you like family. Highly recommends this eatery."
  ]
 },
 {
  "name": "Primavera Pub",
  "address": "283 Newington Ave, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8c9ab990-9330-11ea-abdc-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "cheap",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7792668623288872548",
  "source": "GoogleMaps",
  "reviews": [
   "Food is amazing.   So much flavour.   You can really get anything you want and change any type of a dish as you wish.  Great portions.  So unreasonably priced.  Only take reservations for 6 & more.  Nice sized bar.  Will definitely revisit.",
   "The food was great. First time at this restaurant and I wasn't dissappointed. It's like living by the ocean and when the boat's come in and you're eating the freshest seafood.  This is going to be one of my 'go to' spots now.",
   "This please continues to knock it out of the park during this Covid BS..they have maintained quality control on their to go orders and it’s the best I’ve had.  Don’t forget to tip (yes extra cash) for you cheap types that don’t understand.  Keep up the good work and thank you",
   "The Portuguese guys I work with invited me to  Go to this amazing restaurant. They had been talking to me about it for months. And it more than lived up to the stories they told me. The food was fantastic, And the service was  Exceptional.  I can't wait, To go back Again this time with my wife she loves This kind of food.",
   "Great vibes and very personal service. The meals were crisp and delightful. Will clearly recommend this spot to friends. Fair rates and generous portions. Great work."
  ]
 },
 {
  "name": "Banana Brazil Grill (Steakhouse Restaurant Buffet) Hartford CT",
  "address": "341 New Park Ave, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8ce02c14-9330-11ea-b7e0-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "tasting",
   "food",
   "food",
   "eat",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12059098722374193628",
  "source": "GoogleMaps",
  "reviews": [
   "All you can eat, of everything (buffet, bbq/meat) is $15.99. Buffet only is $12.99. Or you can buy by the pound for $7.99. Best fried banana I've ever had. Very good buffet with ribs, fish, beef, chicken. BBQ meats also great. Yeah, you could go somewhere else and maybe get a little better food, but you'd pay three times as much and it wouldn't be three times better.",
   "I adore this restaurant! They serve first-rate meals, their menu is large, The chief cook in that place is very trained, I like a lot tasting all their food. The dishes are consistently fresh, the service towards the clients  is good. I often go to  this restaurant and I was never discontended. I recommend it to all.",
   "We met with friends at this spot for a meeting. we heard about this place from a lot of people.  Well, it was very successful. the staff were so friendly and we felt good. The food was just great. We loved this restaurant a lot and we will visit this place again. We recommend this place to all.",
   "Truly a neighborhood establishment with an ethnic Brazilian Flair that is great for a nice evening meal during the week. This place is doing it right. All you can eat buffet with plenty to choose from. And their meats right off the grill are superb. You get personal attention from The Grill Master and the price is not to be beat. All you can eat Plus BBQ for under $17. Beer and wine are served as well. I would go back there in a second... and probably will very often. Keep up the great work!",
   "This place is great. The food is great, every sing dish was cooked perfectly and had excellent flavour. Some of the best steak I've had anywhere in the Hartford area. Looks a little dumpy outside, but is a whole in the wall gem. Staff is incredibly friendly and helpful and knowledgeable. Cook on the meat is perfect and the pricing is more than reasonable. Will be a repeat customer for a long time."
  ]
 },
 {
  "name": "Peppercorn's Grill",
  "address": "357 Main St, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8d26f94c-9330-11ea-8e71-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9524324552313054198",
  "source": "GoogleMaps",
  "reviews": [
   "Think of trying new places but there is always something new on the specials list and I know the food will be good.  Dino is willing to make something special if you ask as well.  You can't get that everywhere you go.  This place is on the top of my list.",
   "I celebrated my PhD earlier this evening in this fine place. happy to tell that we enjoyed a enjoyable evening and the place was undoubtedly the reason for this fruitful evening. The waiters  helped in a splendid way, the cooking was extremely good and my buddies were so  happy. We shall definitely visit again for more events. thanks very much.",
   "I came here with my boyfriend for happy hour before seeing a show at the Bushnell. Happy hour ran from 4 to 7, which was great sense it was in extended time frame compared other restaurants nearby. They had drinks anywhere from $5-$7 and good appetizers. There was only one person behind the bar however and I think that made service a little slow, because it was really popular night. However everything was delicious and I'd recommend it.",
   "I went there other night for dinner and drinks. it was fantastic! The food was so tasty and fresh! I must say the staff was great also!\n\ntoasty and fresh",
   "From the first moment  you step in this restaurant  the stuff gives you a good feeling. Very comfortable hosts, it is a kind place to  enjoy with friends or with your date. tasty  food, qualified  chief cook and stuff, honest  price and professional  service. Warmly recommended."
  ]
 },
 {
  "name": "Thai Farms Restaurant",
  "address": "104 Jefferson St, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8d762b34-9330-11ea-90b3-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6195522366832226620",
  "source": "GoogleMaps",
  "reviews": [
   "Hands down one of the best Chicken Drunken Noodles I've ever had. Incredibly fresh, cooked perfect and perfectly cooked veggies in the dish. The soup that came with my lunch meal was delicious as well. For a $10 bill, this will definitely stay on my go to list when I'm in Hartford. Plenty of metered parking spaces around the hospital to get in for an hour and have lunch or dinner",
   "This is some top notch Thai food. Spicy and flavorful. I had passed by many a times with stopping in but had the time for lunch today and I'm glad I did. We had to wait a little, there was a lunch rush, but the food was worth it.",
   "We attended tonight to celebrate a post event success for a toy drive. The owner was generous even though we told her 10 would attend. We were a group of 20. We were late and the owner smiled the whole time. \n\nThe food was delicious. I had the drunken noodles. The service exceptional. Some of the best Thai food ever.",
   "Nice small restaurant. Fast service and it looks pretty fancy. Food was great too!",
   "I very much love their dishes and service, awesome location nearby to my house. The cashiers are always helpful. I highly recommend this place."
  ]
 },
 {
  "name": "Market Restaurant",
  "address": "101 Reserve Rd, Hartford, CT 06114, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8dc0622e-9330-11ea-a301-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8995764620079124284",
  "source": "GoogleMaps",
  "reviews": [
   "This small, clean, friendly restaurant located within the Hartford Regional Market is shockingly good!! I went there with a colleague today. I couldn't believe there was a restaurant in this location. Clean. Parking. Great burgers, fries, onion rings etc. All items were made to order but were exceptionally fast and very good. Great food. Great value. Definitely going back.",
   "Good food and a great price. It is in a location one wouldn’t imagine a good place. Great hidden gem and they serve breakfast till 11.",
   "Brian and the staff at Market Restaurant have played a critical role in helping us grow our business.  They are the most professional, adaptable, responsive and thorough corporate catering team around.  I come from the world of catering management and have high expectations.  Market meets and exceeds my standards on a continual basis.  Our clients rave about the quality of the food and rightfully so.  If you're in the \"market\" for an excellent catering company, your search can end right here.",
   "Exceptional place to eat something when in a rush. Their customer service is efficient, pricing is convenient, great character. Will visit here again",
   "Excellent food, excellent value, super nice people. Basic decor (not a great first-date place)."
  ]
 },
 {
  "name": "Monte Alban Restaurant",
  "address": "531 Farmington Ave, Hartford, CT 06105, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8e05dc12-9330-11ea-9d3f-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "food",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18028728995185085912",
  "source": "GoogleMaps",
  "reviews": [
   "Our family settled on having Mexican Food recently and we met at Monte Alban for lunch. We had been there before - the lunch specials are very appealing and we settled on the Pork Burrito, Beef Burrito with extra onions, and Mole Enchiladas - each served with a Mexican Rice and Refried Beans with a dab of Corn Pudding. A side dish of a perfect Chicken Tamale started us off and it was all very delicious. We were full very satisfied very happy with the food and the service when we left! We will come again!!!",
   "Summary: Authentic Mexican restaurant serving all the classic fare such as tacos, burritos, and enchiladas with various meat options. The flavor of the food is more authentic than other Mexican restaurants and various meats are seasoned superbly. The restaurant is lively, especially during the summer, and the service is excellent.\n\nMust Try: Lengua burrito and tacos\nAlso Recommended: Gordita.\nAvoid: N/A\n\n⭐⭐⭐⭐ - Great, worth a detour",
   "Monte Alban is one of the best smaller Mexican restaurants as I enjoy their authenticity (food, vibe, music), great/caring service each time I go. I have never been disappointed each time I have came here. Their chicken burrito dish is very fulling as it is tasty.",
   "two days ago was our first time in this good restaurant. But It is no doubt not the last time. We had a good time with the attentive service, with the high quality  food and wine and with the comfortable payment. We will definitely go back there in a short time.",
   "Average neighborhood Mexican. Mole\nPoblano and tacos were very tasty, but the veggie burrito was missing flavor . The chicken in the chicken quesadilla was cooked to death"
  ]
 },
 {
  "name": "J Restaurant and Bar",
  "address": "297 Washington St, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8e4a3a36-9330-11ea-8e44-14b31f159f22.png",
  "tags": [
   "food",
   "foodie",
   "organized",
   "food",
   "family",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4817445900842454642",
  "source": "GoogleMaps",
  "reviews": [
   "I am lucky to have been introduced to J Restaurant 8 years ago when a colleague brought me to lunch to meet the owner and enjoy the food. As a foodie, it didn't take me long to realize how much J (Jordan) cares about the quality of each dish and the customer service provided by the servers and the bartenders. And yes this converted pizza place still serves great pizza but what is so impressive is how J restaurant continues to explore new tastes, new wines, and new cocktails. If you have not been there, make a point to go to stop in for dinner before or after a show at the Bushnell, see a show at the Arts Academy or just seek outstanding, gastronomical delights. You wont be sorry.",
   "J Restaurant are wonderful to work with and their cuisine is mouthwatering! Great team and even better food! I had the pleasure of working with them for a client's wedding and their catering was top notch! I highly recommend them. Kris & Jordan are awesome to work with - organized and on top of things. Exactly what you need in catering a special event!",
   "We had a great time! The atmosphere inside AND outside were amazing!!",
   "I take my family to this nice place quite a bit! This is the best place to eat.  I visit this place many times. The meals are very tasty, the staff is helpful and the prices are decent. I like meeting in this restaurant over a good meal.",
   "Beautiful restaurant. Owner is very friendly and great food each time! Looking forward to the next visit!"
  ]
 },
 {
  "name": "Republic at the Linden",
  "address": "10 Capitol Ave, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8e8d5dca-9330-11ea-b992-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7378010064276521269",
  "source": "GoogleMaps",
  "reviews": [
   "Really nice chick place. I have been there twice and it was great. I didn't get food but my friends did and they liked the food as well. Service was good and fast",
   "Phenomenal restaurant.  Great atmosphere great food we got the cheese steak and the beef Wellington both were prepared to perfection.  And the smoked ribs app was also some of the best ribs I've ever had.  Don't skip the dessert the sorbet was incredibly good",
   "Fillet mignon was flavorless but tender, nachos ok, oysters with raspberry vinaigrette were really good and fresh, avocado toast was meh",
   "Wonderful environment and super amiable service. The menu was fresh and enchanting. Will clearly recommend this restaurant to friends and family. Convenient prices and big portions. Great job.",
   "Visited for birthday 🎂 brunch with large group.  Wait staff handle large groups just as well as couples. Kali, Kar and Jessica were very attentive and precise with all orders from kitchen, bar and split checks accurately. Will visit again in the future. Make your own Bloody Mary bar recommended.👏🥂🍸🎊🍽🍴"
  ]
 },
 {
  "name": "Dunn's River Jamaican Restaurant",
  "address": "2996 Main St, Hartford, CT 06120, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8ed5d8cc-9330-11ea-b986-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=12041257098716554434",
  "source": "GoogleMaps",
  "reviews": [
   "This place is my favorite. I go to a lot of restaurants but to this place I go the most. The crew is very friendly and the cuisine they serve is so flavorful. I never decline to have a good meal in this place. Highly recommended.",
   "DO NOT park at Star Chinese food and run over to Dunn's River.  My medium meal cost me $120.00 due to my car being lifted on a tow truck.  Verrrry angry...",
   "Why were my veggies spicy hot? Why were there hot green peppers in my food? Why was my fish spicy hot? Higher priced and smaller portions compared to others. My aunt finished her whole dinner in one sitting, and she never does that. Gave it a boost in stars because they do have a lot of patrons, so they must be doing something right, I guess. I'm not so impressed though.",
   "I made the trek from Amherst to this place and let me tell you I was not disappointed . I got the brown stew fish with ground provision and I would 10/10 go there again. The food was absolutely sublime! The only thing was the peanut punch was kinda watery but I can’t blame them for that. And the Johnny cake was good to...it wasn’t hard to eat like big stone or nothing . Overall very good food and I will go back!",
   "The steam fish, with white rice is excellent, when freshly made...\n\nService is decent, and music is nice. \n\nWait times could be better, but their not serving burgers here. \n\nWould have given a 5, but had maybe one or two slip ups here after 7pm with this place. Seems they tend to not make anything fresh fish Wise after a certain time. \n\nAlso, it seems things are often not available, or they run out at times.\n\n"
  ]
 },
 {
  "name": "Ashley's Restaurant",
  "address": "221 Main St, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8f1aaa12-9330-11ea-8642-14b31f159f22.png",
  "tags": [
   "food",
   "cheap",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13950300233020511876",
  "source": "GoogleMaps",
  "reviews": [
   "Found this place on Trip Advisor looking for something new. Not too far off the highway but parking could be an issue. There is parking on the street but if spots are all taken.... My meal was good. I had French toast. I was there early and had the place to myself and couple people with takeaway orders. It seems like a place where locals go. Good food. Not fancy. Reasonably priced. If you want fancy go elsewhere. I would not hesitate to come back.",
   "Homestyle diner with good breakfast options. Hash browns were really good, condiments (syrup and jam) tasted like cheap quality. Service was okay but food came out fast, decently priced.",
   "Although i didn't take any pictures i can ASSURE you Ashley's Restaurant is that Great homemade kinda food! I went here ONE time On a Friday early afternoon the place was outstandingly clean you can sit on the stools or in a both the cook is right there making all orders!! The home fries are fresh potatoes coffee was great the toast was perfectly toasted and the French toast was Perfectly cooked. I'm hooked I'll be going back 100% i didn't even know anything about Ashley's I'm happy my boyfriend new about it from years ago when he use to go with his great friends patty and June. 🌟 🌟 🌟 🌟 🌟 🌟 🌟 stop in you'll be glad you did!",
   "Been going here for years. They cook your order almost in front of you and can add almost anything you want on the menu at the last minute. Great spot to eat great diner food and be full with great prices. Relaxed atmosphere friendly workers who pay attention to their customers.",
   "i love this little diner style cafe.... it reminds me of my older days in ny where we would find spots like this & make them our hangout. highly recommend this spot"
  ]
 },
 {
  "name": "Sunberry Cafe & Catering",
  "address": "65 Pratt St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8f617752-9330-11ea-b36e-14b31f159f22.png",
  "tags": [
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3117590876150294923",
  "source": "GoogleMaps",
  "reviews": [
   "Yesterday was the first time in this magnificent restaurant. But It is obviously not the last time. We enjoyed the evening very much with the good service, with the exceptional  dishes and wine and with the comfortable cost. We will definitely come back in a short time.",
   "I needed a Healthy meal this week before my many corporate Italian Pasta and Pizza meals we would be having.  Sunberry Cafe was an awesome surprise.... I had the BBQ Tofu and vegetables.   Amazingly fresh and great flavor. Short walk from the Marriott.",
   "The food here is average at best. The prices are not reasonable for the quality of the and they have too many options on their menu. Perhaps if they stuck to one type of food and mastered that, the food quality would be better.",
   "If you're in the mood for something but you're not quite sure what you want then this is the place to go.  They have a little of everything.  Ramen dishes, burritos, burgers, smoothies, etc.  One stop shopping for all miscellaneous foods.  The noodles we're decent.  I'd get those again if given the opportunity.",
   "I love the a one rice the best. It makes my winter warmer"
  ]
 },
 {
  "name": "Banh Meee",
  "address": "399 Capitol Ave, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8fab0476-9330-11ea-a42b-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "tasting",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15458272757790439338",
  "source": "GoogleMaps",
  "reviews": [
   "Sandwich smelled and tasted like old fridge. Was served spoiled cilantro. At first I thought maybe it was grilled with the meat. Nope. Meat still cold. Bread soggy. Not coming back. If you prefer a cheaper better crispy bahn me, seek kien market on park street",
   "My first \"Banh Mi\" experience. I got the Pho Mi Banh Mi - would I get it again? No. Too many pickled vegetables and not enough meat. I ended up taking off some it was over whelming. Did I finish it? Yes, but I wasn't licking my fingers wishing I got two. And I was still hungry. Would I return? Yes. The ambiance was nice, very clean and the staff was friendly. I'd probably try one of their noodle dishes and steer clear of their sandwiches. Very well priced for a quick lunch. I could tell these people know what they're doing which is why I give 4 stars. Perhaps Banh mi just isn't my thing.",
   "I totally love this place owner and worker are awesome. Food is delicious and will always support small business owners. I appreciate you all",
   "I love this restaurant! They offer delicious food, they have a rich menu, The chief cook in that place is a professional, I like very much tasting all their dishes. The food is always fresh and tasty, the service towards the clients  is good. I frequently visit this place and I was never discontended. I recommend it to all my friends.",
   "Love the atmosphere! Great authentic food served quick! Healthier versions of dishes set this place apart from many other Asian food places. Vegan options available!"
  ]
 },
 {
  "name": "King & I Thai Restaurant",
  "address": "1901 Park St, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8ff68ba8-9330-11ea-a157-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18217256193278519583",
  "source": "GoogleMaps",
  "reviews": [
   "King and I is a hidden gem. It is somewhat difficult to find in a busy street, recessed from the main frontage so that you can easily drive by it. Well worth looking for, though. Housed in a small building that was probably a private residence at some time, it is a cozy little room with no more than 10 or so tables. The food has a great, authentic, home-cooked ambience. As vegetarians, my wife and I often find it difficult to eat out and get a satisfactory meal. This is never been a problem at The King and I, since they can make almost any dish in a vegetarian version. We particularly like their Drunken Noodles. Probably the best Thai cuisine in the Greater Hartford area.",
   "Good service, clean, quick and fair prices. My downside was that massaman curry is by far one of the most popular Thai dishes in America -the one I tried didn't measure up. I tried others curry from so various cities and states but this one was disappointing in the proportions of the meat and vegetables. Taste was okay but lacking color. Above all it had almost no meat for the price I paid. The atmosphere in the place is very cozy, small and romanticish. I would go again to give them a second try with a different dish.",
   "We enjoy to go out. Last night we  visited this delicious restaurant which friends told us about. We passed a lovely experience there with fine meal and a courteous crew and a great  chef. We put this restaurant in our phone list  and we shall certainly return soon. We deeply recommend.",
   "Loved it! Delicious food and our server was so sweet and friendly. We had  fried tofu and Thai egg rolls as our appetizer followed by pineapple fried rice. Everything came out perfect! Will definitely be visiting again",
   "I like this place and being there gives you a sense of eating at home. I ate traditional Thai fried rice with chicken and it was damn good. This tasted like authentic Thai food in the US like I had in Thailand. Also, I tried the ice Thai tea and it was okay. It tastes like cream and water with aroma of tea. However, I would rate 5 star for this place."
  ]
 },
 {
  "name": "Agave Grill",
  "address": "100 Allyn St #1418, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/904bfee4-9330-11ea-a840-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9449253950133699592",
  "source": "GoogleMaps",
  "reviews": [
   "We've eaten here before and it's always good. They start you with tortillas and their fresh, delicious salsa. The salsa is so thick it clings to each chip. I got a pork taco and a beef taco. Both great. My friend is Keto so he got a steak with grilled veggies. Fantastic. Great meal. Glad they haven't lost their touch.",
   "Pretty decent food I got the fajitas, they do not come out sizzling FYI. drinks were pretty reasonably priced for being in the city. The flour tortillas are a little small for how much stuff you get. But the food was amazing overall cleanliness was top-notch.",
   "Not impressed at all, ordered a beef burrito and it was just spiced finely ground beef. I expected a little effort behind the beef, looked almost like a chain food beef. The black beans were very good though so not all was lost. The rest of our party appeared happy about their food but each has had better for the same money. \nFamily friendly as a lot of little ones dressed for the local event across the street- nice to see them out and about. Service was excellent as our server maintained my water glass as I was enjoying a brew.",
   "Great atmosphere.  Good food and service.  Unisex restrooms. Handicap access.  Street parking.  Nice bar. They have an additional room on the side for large functions.",
   "Went last night and had a great time. \nMargarita pitcher was a great value and tasted amazing.  The quesadilla was perfect.  I wish they stayed open later but I had a good time was not rushed out to finish our drinks. The waitress Latonya was friendly with a great personality."
  ]
 },
 {
  "name": "Han Restaurant",
  "address": "310 Prospect Ave, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9095d980-9330-11ea-aebf-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "adventurous",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=8135216039833055112",
  "source": "GoogleMaps",
  "reviews": [
   "Discovered this place in 2019 on a whim with some friends, and have since been back many times.  The staff is super friendly and always seem to be patient and willing to explain hotpot to any newcomers.  \n\nThe steps:\npick a soup base\norder an assortment of meats/veggies/noodles/etc\nmake your sauce - they also have little picture guides for an assortment of sauces\ncook your food, add some sauce and enjoy!\n\nI always look forward to coming back, its a fantastic authentic place, which is a nice refresh in the sea of chain restaurants.",
   "Summary: Sister restaurant to the famous Shu and another Szechuan masterpiece located in Hartford, CT. The location provides various authentic hotpot soup bases and fresh selection of meats and vegetables. Patrons can also design their own dipping sauces with many different savory options. All broths are excellent but the Chengdu hot and spicy soup is a must try for mala spice aficionados.\n\nMust Try: Chengdu hot and spicy soup and Chinese herbal daily soup.\nAlso recommended: Tomato based sour soup.\nAvoid: N/A\n\n⭐⭐⭐⭐⭐ - Outstanding, worth a special excursion",
   "Han Restaurant is one of the few places in all of CT that has AUTHENTIC Chinese food. The flavors are incredible, the presentation is always perfect and the choices are great! Great food, drinks and staff. Always a go-to, always leave loving my time there! ❤️",
   "Our server was so patient with us and that helped us make the most of our experience. We learned about all the many flavored broths, made our own dipping sauces to each of our tastes, and enjoyed lively conversation over our simmering hot pots. Highly recommend for both adventurous diners and those that want to taste delicious variations on familiar ingredients.",
   "What an amazing place!! It was our first time and the host (perhaps owner, I'm not sure) was very informative and helpful. We didn't feel like total noobs once we got our orders and were able to dive right in. My dinner companion and I both got the mini pot combos for around $20 each. Everything came out super quick. As you can see, the combo included the broth/soup base, 2 proteins, a raw egg, and a HUGE platter full of veggies, fried tofu, and glass noodles. Veggies were fresh, the meat was delicious, the broth though...wow wow wow. So flavorful!! \n\nStaff was very friendly and the place has a nice ambiance and vibe to it. I can't wait to go back. They definitely have gotten a regular customer out of me!"
  ]
 },
 {
  "name": "Fire-N-Spice Vegan Restaurant, Bakery and Juices",
  "address": "491 Capitol Ave, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/90d77688-9330-11ea-a8a4-14b31f159f22.png",
  "tags": [
   "kids",
   "eat",
   "food",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1614598753584016833",
  "source": "GoogleMaps",
  "reviews": [
   "We stopped here with our vegan kids. The staff are very friendly and helpful. Very popular. The place is very small but has a few stools and a bar to eat at. Lots of choices and options to have 3 or 5. The food was good as was the vegan ice cream. Has a small parking lot. Lots of giant flies when we were there which is a little off putting.",
   "Great place for a quick vegan breakfast in the mornings, and lunch/dinner or snacks later. Some sweets and ice cream too. The food is great and the staff is friendly. Cozy atmosphere, but not a lot of seating. \n\nOne of my favorite spots for vegan food in CT.",
   "The food is absolutely 🔥🔥🔥. I have never had vegan food as good as they prepare it. An absolute MUST TRY for anyone looking to have a meatless meal without sacrificing taste! (and their desserts are absolutely divine as well!) The staff is super helpful, and the restaurant has a great vibe to it. The only thing to keep in mind is that it is a little small inside, so if you want to go with a large group you're better off getting everything to go. Also, they sometimes don't have the menu for the day written down anywhere so don't be afraid to ask the peraon working the counter what they have available for the day.",
   "The best take out in Hartford bar none. An impressive quality of food with generous portions. What really makes this place shine is the charisma of the owners, they are the nicest people you could ever hope to encounter.",
   "The food here is hearty, flavorful, tasty, full of protein.... An all-around win. It's a small place, with a few counter seats, so you may want to take it to go if your party has more than 2-3 people, but it's worth the trip! The menu varies daily. I've had 4 different tofu dishes, and somehow they make tofu delicious every time- that's some kind of magic. It's especially good if you like intense or spicy flavors."
  ]
 },
 {
  "name": "Vaughan's Public House",
  "address": "59 Pratt St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9124852e-9330-11ea-8e49-14b31f159f22.png",
  "tags": [
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8109383484800704038",
  "source": "GoogleMaps",
  "reviews": [
   "We like a lot to go out. Yesterday we went to this excellent place which we didn’t know before. We passed a beautiful evening there with first-rate cooking and a professional team and an impressive cook. We put this venue in our list  and we will certainly visit again soon.  Highly recommended.",
   "I had a pleasent experience here. I ordered the Shepard’s Pie, Guinness Stew, and a Guinness Brownie. I have to admire the food quality, the taste of the food was homemade and savory, and had a unique pub flavor to it. Vaughan’s is definitely going down as one of the best pubs in the Hartford area, if not one of the best in the state.",
   "Great atmosphere, love it! Drinks are delish and I do like cheesecake but theirs is FLIPPING AMAZING!!!",
   "This spot is my favorite. I go to a lot of restaurants but to this place I go the most. The team is very affectionate and the cooking they offer is so flavorful. I would always prefer to have a nice dinner in this restaurant. I recommend this place with pleasure.",
   "Great place to hit before going to XL center. Quaint bar with upper and lower levels for seating. Menu has great selections and good portions.  The staff is very friendly and would definitely go there again when in town."
  ]
 },
 {
  "name": "Tisane Euro-Asian Cafe",
  "address": "537 Farmington Ave, Hartford, CT 06105, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/916cb1e2-9330-11ea-ba52-14b31f159f22.png",
  "tags": [
   "music",
   "food",
   "drink",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17671287109549594034",
  "source": "GoogleMaps",
  "reviews": [
   "We went for Sunday Brunch and everyone really enjoyed what they had. Our server was very friendly and attentive. It was very busy so we had to wait about 30 minutes for a table. Enjoyed some pear ice tea and iced coffees while we waited. Only thing I didn't like was the section with \"regular tables\" was closed off so we had to sit at a high top which was challenging after undergoing hip surgery.",
   "Very cute tea shop selling both normal and alcoholic teas. Very interesting. It’s just a little crowded at night time. There’s a big night scene here.",
   "Friendly waitstaff. They had a vegan option for Saturday brunch. Nice music. I got there early (around 10 am) before the brunch crowd rolled in and it was pretty quiet. It got busier around noon. Fairly priced.",
   "I really enjoyed their food and customer service, excellent location nearby to my residence. The workers are always super nice. I highly recommend this place.",
   "Great food, great drink menu, indoor and outdoor seating, cozy and comfortable with wonderful friendly people. I came here alone on a Saturday night after moving to Hartford and met so many great people and had a fun time! I will certainly be back soon. \nThis place is popular with locals and is a must for anyone looking to meet friendly new people or just try great food. Also they had a great DJ starting around 11:30pm and they clear some tables out of the way for people to dance but have a separate section for large groups to sit and eat where you won’t be in the middle of the dance floor. Basically, they have everything covered, despite being such a small place. Enjoy your visit!"
  ]
 },
 {
  "name": "Ichiban Japanese & Korean",
  "address": "530 Farmington Ave, Hartford, CT 06105, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/91bbe39e-9330-11ea-928e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "free",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14871152783686082009",
  "source": "GoogleMaps",
  "reviews": [
   "While searching the many choices of restaurants available in Hartford, we came across this place. WOW! The food was delicious and the service was great! As it was our first time, the waiter offered suggestions for sharing dishes and it so delivered. So good. We will definitely return when in the area again. Love the Bibimbop at this place. Great service and reasonably priced. The sushi is also very good. Seems a popular spot in the West End of Hartford. Definitely recommend.",
   "A great place with great prices! The staff was really attentive and the food was plentiful for the cost. They gave so many free appetizers when we came from fried fish to soups. This is a great place to come if you're looking to spend a little bit eating out in Hartford.",
   "So far there best sushi I've had in the 5 months I've lived here. Nice atmosphere. Place was super quiet, which made it easy to carry on a conversion. Service staff was friendly and attentive. Will definitely be back.\n\nParking lot is a bit tight, so keep that in mind if you drive a large vehicle.",
   "First time eating here. Found it from a Groupon promotion which we had no trouble redeeming. Menu has many options, many of which we were unfamiliar with. Our waitress was helpful in explaining everything.\n\nWe received several appetizers while waiting on our meal, including lotus root which none of us had ever had before. It was quite tasty! Also the steamed dumplings were incredible. I've had dumplings before but these were so tender!\n\nThe portions of the meal were very generous and the food was delicious. We had a stonepot bibimbap, teriyaki steak and a sushi sampler. All the food was prepared perfectly. The sizzle on the bibimbap was particularly impressive as the egg in the pot cooks at the table from the residual heat of the stoneware bowl.\n\nWith an impressive array of delicious options on the menu, this is definitely a restaurant we will be returning to.",
   "Food is always hot, fresh and delicious! They have both Japanese and Korean entrees including sushi. I have never been disappointed eating here and the service is always very attentive. I find it a challenge to pick something off the menu because it's pretty endless.  This place is a diamond in the rough. Looking forward to my next visit!"
  ]
 },
 {
  "name": "Ajamo",
  "address": "30 State House Square, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9202d7d4-9330-11ea-8203-14b31f159f22.png",
  "tags": [
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7802899527095990203",
  "source": "GoogleMaps",
  "reviews": [
   "Very kind staff, they made me laugh lol it made my day. Good food, they’ll let you sample things and substitute for ingredients you dont like. They even make sure you don’t have any allergies as they put your food together. Prices are reasonable for a fresh food place, similar to prices at Moe’s.  I never write reviews so this must say something about how good their service was. The best salad I’ve ever had, fresh everything, great staff, much love!",
   "This was AWESOME! I was wondering why everyone was in line here! The owners are so very nice. Everything is fresh . I had wonderful avocado toast w lemon ..was sos ssos good!I would highly recommend coming here ! If your anywhere  close by this is so worth stopping in!",
   "Really wish i had found this place sooner! My salad was delicious and the staff was outstanding. Highly recommend this place if you are health conscious and looking for something fresh, quick & easy.",
   "Fantastic! Owners let you bring your own containers! Really appreciate that.",
   "This my go-to whenever I feel the need for a healthy lunch. The Baja salad never disappoints, and neither do the owner and staff. Very nice folks. Wallet-friendly and pallette pleasing. Can't go wrong."
  ]
 },
 {
  "name": "Ficara's",
  "address": "577 Franklin Ave, Hartford, CT 06114, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/924670dc-9330-11ea-b451-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12407626999021980156",
  "source": "GoogleMaps",
  "reviews": [
   "Ficara's Restaurant is a family run Italian restaurant in Hartford. Everyone works together and really make you feel invited and part of their family. The service is spectacular. My cousin and aunt come here frequently. The staff treat them as family, not customers. The food portions are massive, prepare to take some home and have a delicious meal the next day. The bread served with the meal really compliments each dish. They have a great menu and even accommodate for veggie and vegans.",
   "Great lunch. Veal Parmesan just right. Fresh garden salad, good service. Great prices..",
   "There is so much food you have to take some home. It's as good as my mother's who cooked these same dishes for over 60 years and came through Ellis Island. It's a comfortable atmosphere, no stuffy waiters. You want something, then ask, you get it. The quality of the food is perfect and the prices are very reasonable. You want to drop 300 on a fancy place then go.",
   "We had a party of nine people. We had four appetizers, nine entrees, their most expensive bottle of red (Sterling), and other beverages and the bill was around $200.00. What a bargain! The restaurant is unpretentious and the service is very relaxed, great if you want to relax and not in a hurry. The food was very good. It was very quiet.",
   "Possibly the best Italian restaurant in Connecticut!"
  ]
 },
 {
  "name": "Nutshell",
  "address": "229 White St, Hartford, CT 06114, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/929701e8-9330-11ea-9ea2-14b31f159f22.png",
  "tags": [
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=13461560288428371254",
  "source": "GoogleMaps",
  "reviews": [
   "We used to love this place.  Had a bunch of parties catered in the past but I feel like the food just isn't as good now.  The menu is very expensive..I don't think there was anything under $20 although they were doing a special for $20 where you get app entree and dessert.    But the entree was very small.  And my wife's cod came out cold and on a bed of salad.  I've never seen that before.  Probably won't be back which is a shame.",
   "The atmosphere and maria's ownership makes it the neighborhood gem.",
   "I visited in dart league night and had so much fun talking to the patrons. Great bartender, thanks Todd, great night. Cozy atmosphere and chill and friendly people.",
   "The ultimate neighborhood restaurant and bar. The food's excellent. Good choices including a few Portugese entrees. Don't miss this place, it wont be there forever.",
   "Delicious"
  ]
 },
 {
  "name": "Front Street Bistro",
  "address": "39 Front St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/92e1527e-9330-11ea-b5fb-14b31f159f22.png",
  "tags": [
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=3717567521021085788",
  "source": "GoogleMaps",
  "reviews": [
   "Inventive cocktails, full wine and spirits list.  Upscale pub faire available.",
   "I came to see the new Rambo movie very nice place and good vibe...",
   "My friends and I had a great time. The patio is a nice spot during the summer. Very friendly staff.",
   "I like the food and drinks and decent service.",
   "I have to say it was delicious"
  ]
 },
 {
  "name": "Broasterant",
  "address": "630 Park St, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/932f728a-9330-11ea-b006-14b31f159f22.png",
  "tags": [
   "family",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=5633161084204235383",
  "source": "GoogleMaps",
  "reviews": [
   "Hands down THE BEST fried chicken shop in CT! It's a small family owned shop with fresh and high quality ingredients and the chicken is always cooked to perfection. The chicken is pressure fried yet not oily or greasy. You can't taste the oil at all in the chicken.",
   "Summary: For the price and quality, Broasterant may serve the best fried chicken in the Hartford area. The fried chicken is consistently juicy and seasoned perfectly. The chicken plate is also accompanied by a mountain of french fries and dinner roll. The owner is very friendly and the service is excellent.\n\nMust Try: Fried chicken plate or any other size.\nAlso recommended: Shrimp and fries plate.\nAvoid: N/A\n\n⭐⭐⭐⭐ - Great, worth a detour",
   "Best chicken I ever tasted beside Popeyes but Popeyes better watch out because they have competition because Broasterant have chicken to die for. The staff are really friendly and I will definitely come back and eat here. I recommend this place to everybody. If I can give them 100 stars I would",
   "The Chicken here is Excellent!!! With such limited options I thought it would be suspect. But nahhhhh I was wrong. Its all about the quality of the chicken.   Number 2 on my list of Chicken Spots n the State!!!",
   "Awesome fried chicken with fries.  They are made to order. Open until late AM."
  ]
 },
 {
  "name": "El Pollo Guapo",
  "address": "26 Front St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/937de01e-9330-11ea-8a0b-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "unique",
   "eat",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=16850748506936996089",
  "source": "GoogleMaps",
  "reviews": [
   "wow the food is so flavorful! Happened to be in area couple times visiting a client and this has become a go to place for lunch. The service is quick and the food is delicious! I wasn’t too sure about trying veggie tacos, I’m glad I did because they were incredible! 👍",
   "Really enjoyed the bowl I had here and the service was super fast and friendly! I had the chicken bowl with blueberry pomegranate green tea, and at first I wasn’t sure how I’d like all of the ingredients in it, but once combined, it was delicious. We also got a side of guac that was really good and definitely enough to take to go",
   "More take out out oriented than eat in (although there are tables. Unfortunately they didn't take orders by phone but are quite quick to \"assemble\" an order. They have a unique colelction of chicken, vegetable and rice plates plus a varity of greens. I've been twice and wasn't disappointed. I research various cuisines and cook (as a hobby),so I am always interested in new ways to present standard fare, such as chicken and vegetables in this instance. I would highly recommend the charred broccoli and crispy Brussels sprouts, neither of which is usually not a go-to for many palates, but they are good.",
   "So excited that El Pollo Guapo is finally in Hartford.  Their second location has much more room (about 60 seats) and they serve beer and wine!  The food here is amazing and you really can't go wrong with anything.  Another tip, they have an awesome catering menu.  Definitely give them a call if you are hosting a party!",
   "This was my first visit to El Pollo Guapo and I was wonderfully satisfied.  I tried the \"Almost Legal\", a rice bowl loaded with flavorful toppings such as plantains, grilled corn, pickled onions and more!  Every bite was delicious!  The location is great, the atmosphere is inviting, and the staff was very helpful and friendly.  Loved it!"
  ]
 },
 {
  "name": "George's Pizza Restaurant",
  "address": "2027 Park St, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/93b9d7cc-9330-11ea-a98a-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "delicious",
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=1163591583841049242",
  "source": "GoogleMaps",
  "reviews": [
   "My sister and I were on our way to the XL Center to see the Wolfpack play. Sometimes, it's tough to find a reasonable place to eat near the Center so I did some research online. Georges got good reviews. We were glad we went. The menu is extensive and has something for everyone. My sister got a turkey grinder (sub or hero) and I got the grilled chicken sandwich, fries, and a slice of pizza. We both got sodas too. The food was delicious and service was friendly and speedy. The bill came to about $21! We were very pleased and will go back again.",
   "Their pizza is absolutely delicious \nFirst time I come here and I will be coming back soon!! I definitely recommend stopping by",
   "There's quite a selection of food here, it's pretty good, but there is better pizza in the West Hartford area.\n\nIf you like traditional pizza, you will enjoy this place a lot. The prices are very good, and there's a good amount of parking, although this place can get busy at times, and it's about average in terms of. It's a little bit older of a restaurant in terms of decor.\n\nEverybody will find something they like here. This place has been around for a very long time, and after you've eaten a meal here, you'll understand why.",
   "Best pizza in Hartford!!! They have been around for 64 years and not a thing has changed. Quality food with a relaxing and comfortable atmosphere. It gets no better",
   "Visited George's for the first time to celebrate my husband's birthday with our children and grandchildren \n The pizza was great,  however after eating and asking for the table to be cleaned off to sing Happy birthday and cut the cake. The waitress was asked for a few plates to eat cake on. Once they  had taken our plates that we used for the pizza and small plates were provided the manager informed the waitress that we had to be charged for each individual plate. We were so disappointed that we left and will never go back.  We spent close to $100 and after you take our plates you want to charge us for small ones. I've never ever experienced that before."
  ]
 },
 {
  "name": "The Place 2 Be",
  "address": "615 Franklin Ave, Hartford, CT 06114, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/93fed052-9330-11ea-8c31-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "delicious",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13959710238668208005",
  "source": "GoogleMaps",
  "reviews": [
   "Atmosphere- 5/5: It’s a beautiful place. Nice and trendy with modern fixtures with a contemporary vibe. Tables are nicely spaced out as well\nService- 5/5: My waiter was fantastic. I was given drinks right away and the food came out relatively quick\nFood- 5/5: The French toast is amazing. It’s huge. They also have their unique way of making eggs. You’ll see when you get here!\nWorth the money?- Yes: The meal was fantastic and the portions were massive.",
   "I really liked this place, but I ordered the wrong dish for my first experience. My chicken and waffles were not great. Most of the chicken had bones, and was extra crispy. So, I could not easily cut bites of chicken with the waffle below. I ate the chicken separately from the waffle but that is not really how that dish is designed. The stuffed French toast was very good, my daughter liked it immensely. The place had very little parking so I worried about a long wait but it is huge inside. We were seated immediately at some high top tables. Cute salt and pepper shakers and the whole place was very cozily decorated. I will try the eggs Benedict options or the breakfast quesadillas. We will be back and I expect a 5 star experience.",
   "Absolutely love this place and I’ve only placed an order once. I can’t wait till this pandemic is over so I can actually dine in ! The place is gorgeous and their brunch orders are to die for !",
   "I really like this restaurant. Prices are excellent. Food is delicious. I love their egg benedicts. Service is always good as well. Must visit!",
   "Tonight i made large order through GrubHub, averaging at about $80. I normally have no issue with this restaurant. The food is always delicious but in this instance there were several things missing. Mind you I made the order at 3:38. It was supposed to be at my house by 4:35 give or take a few minutes. I called at 4:55 and they said it was on it's way, which fine, no problem. When it finally came, I was missing my grinder, muffin, and both french toast had no whip cream. I had to resort to going to the corner store to get myself something to eat. So yeah, I'm extremely annoyed considering how much money I spent, how long i waited, and how hungry I was. DISSATISFIED to the max!"
  ]
 },
 {
  "name": "Siam Hartford",
  "address": "77 Pratt St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9445285c-9330-11ea-bba8-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11300786017307194723",
  "source": "GoogleMaps",
  "reviews": [
   "The best restaurant in the downtown area.  Fast service.  Food is always amazing and authentic.  For $9.99 you get a soup or salad and an entree.  I highly recommend it if you want to eat a great lunch.i always order Drunken Noodles. It's always hot, delicious, and spicy. If you love THAI food and work in downtown, I highly recommend this establishment. The employees and owners are very nice and treat me like family.",
   "Nice vibes and super attentive service. The food was fresh and enchanting. Will easily recommend this place to anyone. Reasonable rates and large meals. Great job.",
   "First the food...I like it, great prices, tastes good, good variety. But the service...when it gets busy during lunch, the service is extremely slow. Even to get water. So plan your lunch hour accordingly.",
   "Came here for lunch and ordered chicken druken noodles from the lunch specials, the taste was good but it was very oily.",
   "I liked the dessert better than other items I ordered."
  ]
 },
 {
  "name": "Coyote Flaco Mexican Restaurant",
  "address": "635 New Britain Ave, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/949f7d92-9330-11ea-8f02-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "free",
   "food",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10919343138716115919",
  "source": "GoogleMaps",
  "reviews": [
   "Great place!  I've driven by for years and finally stopped for dinner. The staff was super friendly and welcoming. The menu had a lot of choices. I had the California Burrito and it was very good and served quickly. The prices are very reasonable. The atmosphere is casual. I will definitely be back to try something else.",
   "My son and I discovered this gem while looking for a family owned restaurant with good home cooked food. The first time we went, we were already talking about going back. Now we go as often as we can. Everyone is super friendly and the food is delicious (I love the stuffed poblano peppers). Fun decor, free parking and great prices. You'll be happy you went.",
   "I like this place! They offer high class meals, their menu is rich, The chef in that spot is an expert, I like a lot eating all their food. The dishes are always fresh, the service towards the visitors  is good. I visit often this place and I not even once was unsatisfied.  I highly recommend it.",
   "Pretty good food and had a good deal for lunch, though it was unadvertised. I got the chili relleno and my wife got the fiesta quesadilla. The menu is fairly limited, but the place was clean with a nice cozy atmosphere",
   "My favorite Mexican place. Go there weekly. The best Margueritas, food is awesome. Staff is friendly and helpful. This is a family run place, food is very authentic. \nIn this time of stress and sickness these restaurants need help. Please get food to take out or get delivered from here you wont be disappointed. Hopefully the alchohol delivery will be a go. Their 1800 margueritas are the best."
  ]
 },
 {
  "name": "Effie's Place Family Restaurant",
  "address": "91 Park Rd, West Hartford, CT 06119, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/94e9a710-9330-11ea-a719-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13099521630295334446",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful find in West Hartford. Great service and great food. The staff was helpful with a variety of food allergies and we all had excellent meals. I tried the crab stuffed flounder with was flaky and delicious. We also tried two of the homemade desserts and even though we can't pronounce the greek one, it was delicious. Strongly recommend them based on service, price and quality of meals.",
   "Best Liver I have ever eaten. Clean please and fast serve, very friendly staff.",
   "I had been dying to visit and I finally got the chance. I treated my mother in law there for breakfast and it was both our first time. The place is cute and quaint, the people are friendly and nice and the food was delicious. We will be back for dinner. This is definitely a recommended choice.",
   "Hot food, servers were very attentive.  First time visitors.   Out of State - California visitors. We are here to visit our daughter and grandchildren.",
   "I went to Effie,s place quite a few times. I  had very good service.  I know the owner he is very nice."
  ]
 },
 {
  "name": "O Camelo Restaurant",
  "address": "1841 Park St, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/952e0240-9330-11ea-9ca4-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "walk",
   "food",
   "food",
   "eat",
   "food",
   "food",
   "walking",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10420216645058563478",
  "source": "GoogleMaps",
  "reviews": [
   "One of my greatest friendly favorite spot. Great delicious authentic Portuguese food & seafood mixed in with some  American traditional styles too. Great place to relax and watch some soccer games from Europe and other American sports like football basketball baseball hockey etc. Workers and customers are very friendly with smiles. If you ever come here you'll walk out with a full belly a smile and definitely want to come back again along with some family and friends. 🙂",
   "The place was great for Valentine's dinner...the wait staff, the people, and the owner (Catarina?) were so nice, and the food was good. A very nice, fun group at the separated bar area as well. We were nicely impressed and will be back!",
   "This is precisely where the local ethnic Portuguese Crowd Goes to eat. Authentic Native Food and Portuguese spoken almost exclusively. It rates high in my book compared to the few other authentic Portuguese restaurants in the area. Food and service were great. Everybody was friendly and you would think everybody is back in their native country at the local eating establishment. If you want to get a sense of what it would be like to eat at a local Portuguese Pub in Lisbon , this is the place!!!",
   "Great food.  Casual atmosphere.   Friendly people.   Its like walking into a Portuguese cheers.   Lol",
   "Great food.  Nice servers"
  ]
 },
 {
  "name": "Wood-n-Tap Bar & Grill- Hartford",
  "address": "99 Sisson Ave, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/95a2e474-9330-11ea-98b8-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10869126797709499820",
  "source": "GoogleMaps",
  "reviews": [
   "Had dinner here on a week day evening with co-workers a few weeks ago. The service was excellent and food were delicious and the price was very reasonable. My guests enjoyed their time here. The fried calamari was delicious. I told someone about my experience a few weeks later and it was a different experience. I had the drinks for the first time and they were terrible. My soup was cold which didn’t make sense because the place was empty. I will not be going back. I do not recommend this experience.",
   "Great bar & restaurant. Pleasant and comfortable. It feels like your neighborhood restaurant & bar. We ate a range of appetizers at the bar and enjoyed every one of them. Prices are quite reasonable given the high quality of the food. I'll be back.",
   "Although the staff was friendly and gave us what we asked for, there was a timeliness that was missing. The restaurant was not full and yet it was a long while after ordering before we got out food.  The food was good but not outstanding. One thing I believe is missing is handmade dressings?  We asked if their chicken tenders were fresh or frozen and they were the latter.  Why not cook from scratch? That’s what the consumer expects now.  The Cobb salad I got was very good and my husband’s chicken wings were good. The other thing that made our visit less than great was that the temperature of the restaurant was too cold!  Who wants to be cold when dining out.  All in all unremarkable and not place we will be anxious to visit again. .",
   "Ordered the Thai Salad with Blackened Salmon and thai dressing.....I'm in love with this salad, had it 3 times in the last week. Perfectly blended. Always fresh and delicious.",
   "Hickory burger was delicious! But I'm so upset i forgot to take a picture of the nachos! Those are the best nachos I've ever had. We ordered the half size and it was more than enough for 5 adults and 2 children. Our waitress Thalia if i remember correctly was very nice and kept checking up on us. Not average checking up on us... like above average checking up on us. Can't wait to go back. Pricing was also great for the quality of food you get. Everyone go check it out. You wont be disappointed!"
  ]
 },
 {
  "name": "Aladdin Halal",
  "address": "100 Allyn St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/95e85210-9330-11ea-a2da-14b31f159f22.png",
  "tags": [
   "delicious",
   "economical",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=330158236228643985",
  "source": "GoogleMaps",
  "reviews": [
   "This place is absolutely amazing. The mixed platter was pretty good. The hummus was really good too.\n\nThe pizza was amazing. The crust was crispy and the sauce and toppings were very flavorful. The employees were friendly and helpful too.\n\nTheir baklava was delicious as well.\n\nWould highly recommend!",
   "This spot offers awesome service as well as enjoyable food. One of my favourite spots around town. The food and drinks came out quick and the rates were economical. Recommended.",
   "Great flavor, I love lebanese cuisine! I chose a vegetarian plate 👌🏾 Servings are good, reasonable value. Super recommended, no doubt",
   "Wow one of the best kebab wraps I've had in a very long time. The lamb pieces were generously sized, tahini sauce on point, and the pickles added the perfect bite. AND the prices are fantastic and guys working there are welcoming. Will definitely be back!",
   "This place was dope! I had my first ever pepperoni pizza here because they had beef pepperoni and it was so good! The house hot sauce is amazing and the variety is great. Its also very affordable and the staff is friendly."
  ]
 },
 {
  "name": "Chosen 1 Seafood Hartford",
  "address": "2074 Park St, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/97f588a4-9330-11ea-a145-14b31f159f22.png",
  "tags": [
   "family",
   "organized",
   "food",
   "food",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=13366506751161479969",
  "source": "GoogleMaps",
  "reviews": [
   "I was recommended this restaurant a week ago and they told me that the chicken wings and seafood are very good.  I decided to try Saturday night. I Order to take out i wait nine minutes on the phone so they could attend me, i order chicken wings, sweet potato, fried squid and fried onion rings but the ladies  forgot to order the onion rings.  They told me between 20 and 25 minutes to pick up.  I entered at 19 minutes later.  The restaurant was super full, there were more than 10 groups waiting, they delivered the order to me within 24 minutes very well, many people left did not want to wait.  Now let's talk about the food, the chicken wings were well cooked a little dry very little sauce, the sweet potatoes were well cooked but saggy for the packaging they use and the squids were very good well seasoned but also very saggy for the packaging they use  and onion rings for next time.  I know that the restaurant was very crowded, I am proud to see that Hartford has an opportunity for small businesses.  When i comments regarding a place it is not to hurt but it is to help correct the small problems that occur at the moment.  It's a good restaurant I don't know the owners just need to be more organized and better managed.  I know it's hard but they have a goldmine in their hands Good luck God bless you.  I will return with my family to enjoy their dishes.",
   "The food is filled with flavor. Our server was Michelle she was great. The price was worth it,  I will definitely be coming back.",
   "It was very good I cannot complain we all enjoyed our food very well seasoned very fresh. We were all so very full. I will most definitely make this a regular stop on my visit to Connecticut anytime I come back. And I most definitely would recommend\" Chosen 1 Cajun Seafood.\" The only thing I would change is the chairs not very comfortable at all but I guess they're easy to wipe down 🙃 also if you have a large group like we did get the shovel and add some bags",
   "4.5 Stars.\nFood was enjoyable. Seasoned seafood is always enjoyable. The actually seafood ( crabs, shrimp, scallops, clams) seemed fresh and well prepared. We had the spade (serves 4) and it's adequate depending on appetite. \nWill visit again.\n\nCheers.",
   "So DELICIOUS. Our waitress was great. Some of the best seafood I've ever had. A must try! I highly recommend. The prices are competitive. Restaurant was clean."
  ]
 },
 {
  "name": "The Russell Restaurant",
  "address": "103 Pratt St, Hartford, CT 06103, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/983eedde-9330-11ea-8b3d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "approachable",
   "food",
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=14815330717315590247",
  "source": "GoogleMaps",
  "reviews": [
   "This is a nice place with great drinks and even better food. The ambiance is quaint yet magnificent at the same time. The owner is very personable and greets customers. I recommend this experience.",
   "Always a great time. Bammy Fries are Amazing",
   "Good food and good vibes! Love the atmosphere but gets really over crowded! Need more space!",
   "Very delicious and innovative twist to authentic Jamaican cuisine with a global appeal. The perfect ambiance and atmosphere to experience the Jamaican food and culture. If you are seeking a delicious casual/business lunch, formal dinner, or a happy hour with great eats, this is the spot in Hartford! The employees are very friendly, welcoming and approachable. The owner was on spot, he blends right in with the patrons having casual chats and being a great host.",
   "This restaurant has a very impressive decor and theme with an elegant ambience. Great for date night, group outings, lunch meetings, dinner meetings. I ordered Peppered Steak needless to share how delicious it was, I enjoyed every bite! Big up to my Yardy fren' who took my spouse and me to this hot spot. Go today and live like a Jamaican jetsetter'. Dress nice and check out The Russell when you are in Hartford. Cheers"
  ]
 },
 {
  "name": "Aqui Me Quedo Restaurant",
  "address": "622 Park St, Hartford, CT 06106, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9887b6ec-9330-11ea-b264-14b31f159f22.png",
  "tags": [
   "family",
   "knowledgeable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4048525546299404548",
  "source": "GoogleMaps",
  "reviews": [
   "I asked where I could get good tasty shredded pork yellow rice beans & plantains & Aqui Me Quedo was the answer! Sam and his family really enjoy what they do & that’s making Puerto Rican dishes that taste so good.",
   "Best bodega spot in town! I go here every morning for my bacon, egg, cheese on a toasted roll. Can't complain about the portion size.",
   "Pretty small but quaint restaurant located at the intersection of Broad and Park Streets. There are about 3 small tables with chairs, as well as a long counter with bar stools facing Broad Street where you can sit and dine. The young man serving behind the food counter was very friendly and knowledgeable about the different types of food he was selling. The food was very good and filling as expected, if you're used to Puerto Rican foods. There was also a variety of dessert options. The place was clean on the inside and I was very impressed when I saw an older gentleman who obviously works at the restaurant (He was wearing a t-shirt with the name on it), sweeping the sidewalk and the streets outside the restaurant and picking up the trash. Bravo! I would definitely recommend this place based on my experience, and based on the amount of patrons that came in to pick up food while I was there, I guess others feel the same way too.",
   "Love empanadillas marisco seafood place and P.R food good.",
   "I'm been coming here for a long time and love it"
  ]
 },
 {
  "name": "The Half Door",
  "address": "270 Sisson Ave, Hartford, CT 06105, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/98ca6566-9330-11ea-a8be-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "music",
   "food",
   "historic",
   "music"
  ],
  "link": "https://maps.google.com/?cid=8757677780177390457",
  "source": "GoogleMaps",
  "reviews": [
   "Best St Patrick's place....great food, excellent service.. fun time",
   "Food & service amazing! Went when Jack Riley played, awesome music, laid back sound, classics, contemporary and not so loud that my friends and I couldn't enjoy our food and conversation. The perfect combination. We will be back!",
   "I really liked their food. I always get great service there. The place is always clean and the workers are always very friendly. Will come back again.",
   "When in Hartford's Historic West End...",
   "The atmosphere at the Half Door is just like being in Ireland. The occasions I have been here are on St. Patrick’s Day But I do want to return for some wonderful Irish dining at a quieter time. \n  On St. Patrick’s Day the menu is shortened to a few selections because it is so busy with people partying and dancing to the wonderful Irish music that is played. It is a very special night! I loved it!!! I’ll be back!"
  ]
 },
 {
  "name": "Lion's Den Vegetarian: Eat Ital; You will know Rasta! IRIE",
  "address": "3347 Main St, Hartford, CT 06120, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9913f1ae-9330-11ea-9435-14b31f159f22.png",
  "tags": [
   "food",
   "nature",
   "food",
   "affordable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11859675096611765899",
  "source": "GoogleMaps",
  "reviews": [
   "Quite possibly the most conflicted review I've ever done. On the one hand, the value is tremendous -- you get a LOT of food at a very reasonable price. On the other hand, the \"potluck\" nature of it, overall bland taste, and the presentation/store ambiance leave more than a little to be desired. I'll be generous and go 4-stars. The curry soy pieces are easily the best part of this \"sampler\" I photographed. The rest of it? It reminds me of military slop, with a Jamaican/vegan twist. Worth a try though and, again, the value is definitely there.",
   "Awesome food, super nice staff, always fantastic vibes. They charge affordable prices and the food quality is very good. Keep up the good work.",
   "If you are vegetarian or you just don't want to have meat for the day this place here is spot-on you will love it.. can't even tell there's no meat",
   "Warm friendly inviting great healthy restaurant . great prices 😁",
   "IF YOU WANT YOUR FOOD FRESH AN YOUR A NO MEAT PERSON LIKE ME OMG YOU NEED TO VISIT"
  ]
 },
 {
  "name": "Andrea's Restaurante",
  "address": "371 Franklin Ave, Hartford, CT 06114, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/995da568-9330-11ea-bceb-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "music",
   "food",
   "food",
   "cheap",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=7209882024565835398",
  "source": "GoogleMaps",
  "reviews": [
   "Service was great. I was ordering take out at the Time.. The Restaurant was. Very Clean. I was Greeted really Quickly mad the Order was Placed. The Food is Outstanding. The Yellow Spanish Rice and Pink Beans was outstanding and there Pernil was Really Good. It's a Must Visit.",
   "The music is always on point and the drinks are always on point. Love the mason jars 😉. The food is very good too!!!  I love hanging out there on the patio in the summer!!",
   "Great services,awesome food I always feels welcome here. I really recommend this restaurant",
   "Parking and lines to get a table are the downfall. Food is great, have tried the Pork chops with rice and beans. The beans were full of flavor and nice size chunks! Sangria was sweet and strong.",
   "Andrea's is all about the food. Really great food at affordable prices and the portions are huge. The drinks are cheap too."
  ]
 }
]