[
 {
  "name": "Cathedral of Saint Helena",
  "address": "530 N Ewing St, Helena, MT 59601, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/99acafc0-9330-11ea-8c63-14b31f159f22.png",
  "tags": [
   "tour",
   "walk",
   "art"
  ],
  "link": "https://maps.google.com/?cid=3980382309941788170",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome! Amazing that a church of this magnitude was built in rustic Montana in the early 1900's. Stunning stained glass with a notable origin.  Take the tour when it's offered to best experience it. Great place to sit and pray.",
   "Very beautiful! No timings online and when we went the doors were locked and no one was around. We really wanted to see the inside.",
   "This is the most gorgeous cathedral! Definitely worth a visit regardless of your faith!",
   "It was breathtaking to walk inside and see this place.  You can see it towering above the town from almost anywhere in town.  It's great that the let anybody walk in and see it.  There is art and decoration on every square inch of the outside and inside of the building.",
   "Beautiful Mass and beautiful architecture. A wonderful and welcoming place to worship."
  ]
 },
 {
  "name": "Great Northern Carousel",
  "address": "989 Carousel Way, Helena, MT 59601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/99fca4a6-9330-11ea-b105-14b31f159f22.png",
  "tags": [
   "delicious",
   "kids",
   "family",
   "kids",
   "kids",
   "free",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=2287163964011099553",
  "source": "GoogleMaps",
  "reviews": [
   "Great Northern Carousel is a fantastic place to bring children and enjoy some of the local ice cream flavors.  The local flavor is huckleberry, seldom seen anywhere else, and they have all the classic favorites, too.  The carousel is in doors and can be enjoyed regardless of changing weather.  There are seats for 40 riders, with various fantastic real and mythical animals, all artfully rendered, as well as a teacup style spinning seat for four and a loveseat.  There is a small gift shop with toys, stuffed animals, and stylized t-shirts to keep as mementos of your visit.  Tokens for the carousel are $2 each, but you receive an extra 20% on purchases of $20 or more.",
   "This is such a good place to stop as a family. The employees have always been friendly, the ice cream is Montana made and delicious, and the carousel is a blast for the kids. Rides are $2 a go for all ages and there are plenty of fun characters to choose from.",
   "Totally fun place to be! I used to bring my son here for ice cream and carousel rides when he was little. We both rode the carousel and had a blast!",
   "So fun!  Even to ride the carousel as an adult and get scoop icecream.  There was an outdoor large musical instruments to keep kids busy.  While I was there, a dog training business was having a session in the grass area.  So fun to watch all the different breeds of doggies running around while we had our icecream.",
   "It's a great place for kids and adults to have fun with their kids. Riding on the carousel is only $2, they except cash, debit or credit card and with cash you need exact change. It's free for a baby I believe up to 3 yrs to go on but they need to have an adult with them that does have to pay for themselves. They have icecream and soda there and a lot of room. There is also a nice long walking area with eateries and instruments you can play out side. There are right next to the Exploration Works which is a cool science building all ages can go through, haven't been there yet but I'm going. It's a good time for kiddos there."
  ]
 },
 {
  "name": "ExplorationWorks",
  "address": "995 Carousel Way, Helena, MT 59601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9a342f8a-9330-11ea-a2d9-14b31f159f22.png",
  "tags": [
   "kids",
   "affordable",
   "kids",
   "kids",
   "kids",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=3693007355100649082",
  "source": "GoogleMaps",
  "reviews": [
   "This is an awesome children's museum in the heart of Helena.  We stayed at the Best Western right next to this and the famous carousel and suffice to say it was a huge success.  This place has lots of random cool educational things for kids to do.\n\nSome of my favorites were the water features including a tsunami simulator and trying to build buildings that could withstand the force of a tsunami (spoiler alert, many things don't and can't and that's the point).  They have the same concept for earthquakes as well which is just as interesting.\n\nUpstairs they have a more relaxed playing area but it includes a funny feature where you put bands on your head and your brain waves move a ping pong ball type object.  I can't tell how this works or if it's staged, but it cracked me up watching my kids try to \"out think\" each other to move the ball to the other person's goal.\n\nAffordable and accessible other than some parking issues.  Highly recommend coming here if you're in the Helena area or even just travelling nearby like us.",
   "A nice stop.  Better for younger kids, under 12.  Could keep kids entertained for an hour or 2.  Pass is good for the day, so you can come back.",
   "Just awesome.  Fun for all ages (adults included!). Always interesting, and so much fun that it's the reward my kids pick after a good week of school.",
   "A wonderful educational experience!!! Great hands on learning! Bring coins for the tornado machine.  Kids love it.  Carousel and ice cream next door.",
   "Nice place for kids who like to play and explore. Not a super “scientific” place but a nice, quiet and fun place for kids to free play. And free wifi for parents ;) We have a pass to a science centre from Alberta and they accept those for admission."
  ]
 },
 {
  "name": "Reeder's Alley",
  "address": "212 S Park Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9a84c0c8-9330-11ea-aff6-14b31f159f22.png",
  "tags": [
   "walk",
   "eat",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=17907716614742836623",
  "source": "GoogleMaps",
  "reviews": [
   "Really cool historical area. Reeder's Alley is situated in the southwest corner of downtown Helena, the capitol of Montana.  It is the oldest intact piece of early Helena. The property is a strong link to the beginnings of a settlement here, offering insights into the lives of miners, the Chinese influence, building techniques of the time, and life of the common men and women who came here seeking their fortune.",
   "It's Sunday so a lot of it's closed but very pretty and is a nice walk up and down the alley. I believe there's a restaurant that you could also eat at. All in all, it's a very nice place to visit and walk around",
   "Quaint corner of the town that seems lost in time.",
   "Fun look into the past.  Enjoyed the buildings and brick street.  Quick stop on the edge of Helena.",
   "Wow, what a beautiful part of the downtown helena area. It's no wonder it's a popular place for portraits. My personal favorite location for a relaxing evening walk."
  ]
 },
 {
  "name": "Holter Museum of Art",
  "address": "12 E Lawrence St, Helena, MT 59601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9ae57eca-9330-11ea-b934-14b31f159f22.png",
  "tags": [
   "kids",
   "art",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=15404688562212786715",
  "source": "GoogleMaps",
  "reviews": [
   "Good museum with great art and variety of pieces. I love that they sell local art in the gift shop! Fun classes for kids AND adults!!! The paint and sip helped me rekindle my love of painting! Stellar teachers to boot! ;)",
   "Wonderful! Small space but well worth a visit. I loved the current exhibits. Highly recommend this place & wish I could see their next exhibit but I'm just passing through town.",
   "I love this museum. Normally i don't like museums very much, but since the end of last year I've come here almost every week, normally twice a week. It supports teens such as myself very well, and is very all inclusive to all groups",
   "Small but mighty art gallery. Brilliant installation by Catherine Weldon currently, great artwork by women from Peru, live demo of loom work and wool spinning. Lots to see, buy and treasure!",
   "Richard Swanson's \"Red Shift Rocker\" is a public art installation at the Holter Museum of Art in Helena, Montana.  The piece is quite lively and animated and reminds me of a rooster's comb!  The gallery handles work by many diverse and talented artists and has something to fit most everyone's budget.  Definitely worth a visit!"
  ]
 },
 {
  "name": "Spring Meadow Lake State Park",
  "address": "2715 Country Club Ave, Helena, MT 59620, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9b4181a6-9330-11ea-97fb-14b31f159f22.png",
  "tags": [
   "family",
   "walk",
   "kids",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=9815587054112226382",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to take the family out for the day and even get some fishing in. Located right in the heart of Helena, it is not out of the way at all and certainly worth a trip even just to hang out for lunch. The view is really nice especially for being right in town that you would never even know.",
   "State Fish & Game rehabs birds and animals near this site. God bless them!",
   "Such a great local treasure Helena has to share with people",
   "A beautiful Spring-like day to go for a walk. Did 2 laps to listen to birds sing and see the geese stand on the ice. A perfect afternoon.",
   "Spring Meadow Lake State Park is the crown jewel among all the local parks. It is close to town, so people who can't go too far afield on their own (kids, for instance) can get there on foot or by bicycle.  \n   The lake itself is also a gem - it is usually clear and it is always deep, cold, spring-fed and full of fish that everybody and anybody can try to catch.\n   Helena is blessed with abundant parks and lots of nearby venues for outdoor fun, but compared to any other urban parks and fishing spots anywhere, Helena's  Spring Meadow Lake State Park cannot be beat."
  ]
 },
 {
  "name": "Original Governor's Mansion",
  "address": "304 N Ewing St, Helena, MT 59601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9ba23f94-9330-11ea-ace7-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "tour",
   "knowledgeable",
   "tour",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15579055039977204497",
  "source": "GoogleMaps",
  "reviews": [
   "Gorgeous craftsmanship and immaculately preserved and restored rooms and objects from another age, presented by lovely and knowledgable people.  The green leather paneling and detailed woodwork in the dining room alone is worth the visit.",
   "We had a wonderful tour of the governor's mansion in helena.  Anthony was a great tour guide and we learned a great deal about the history of the mansion and the early history of Helena.  If you have an hour and like old buildings, this is well worth your time",
   "Unfortunately we weren't able to go inside but we walked all around the grounds.  It's a very cool building and I'm glad that it is still around as a museum.  There's an entry fee and limited hours for a tour.",
   "We had a great tour and my granddaughter enjoyed doing the scavenger hunt. Tour guides were very knowledgeable!! Fun afternoon and hour tour",
   "Nice slice of history. Easy to pick out some non period specific restoration items though. Glad its here and the tour is very nice."
  ]
 },
 {
  "name": "Last Chance Tours",
  "address": "225 N Roberts St, Helena, MT 59601, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9becb62e-9330-11ea-b2e9-14b31f159f22.png",
  "tags": [
   "tour",
   "family",
   "kids",
   "history",
   "knowledgeable",
   "tour",
   "tour",
   "history",
   "tour",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=8511002920931752679",
  "source": "GoogleMaps",
  "reviews": [
   "Went with the family. We had a great time. The kids enjoyed the ride while the wife and I were entertained by the tour itself.\nLots of interesting history in the capital city of Montana. Things I've never heard of about the city I was born in. So even if you love in Helena it's worth a ride.",
   "The tour is about an hour long and the driver was very knowledgeable, there was always something to look at and hear about.",
   "Great little tour a d history of Helena! I believe the train leaves hourly. Wear a coat if it's a cool or wear day because you might get wet.",
   "My girlfriend and I rode the tour train on our anniversary, and it was a hit! Short (1 hour) and sweet. The conductor was friendly and entertaining. I would recommend it :)",
   "Our students took the Trolley from Helena College to Carroll College for the Montana College Fairs. The students had a great time! Awesome and affordable experience."
  ]
 },
 {
  "name": "Visit Helena Montana",
  "address": "105 Reeders Alley, Helena, MT 59601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9c3fb892-9330-11ea-8900-14b31f159f22.png",
  "tags": [
   "eat",
   "knowledgeable",
   "free"
  ],
  "link": "https://maps.google.com/?cid=13549794115348058591",
  "source": "GoogleMaps",
  "reviews": [
   "Our home town and Capitol of Montana  many attractions and things to do live theater excellent places to eat  play  socializing  good schools Carroll College  junior college",
   "Karen was very helpful and personable glad we stopped in!",
   "Staff was knowledgeable and able to recommend a number of good hikes. Wish they were able to provide maps of mount Helena trails for free",
   "The most awsome town ever. Next to my hometown Its the best",
   "Very friendly staff. "
  ]
 },
 {
  "name": "Memorial Park",
  "address": "1203 N Last Chance Gulch, Helena, MT 59601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9c98ae22-9330-11ea-b5e8-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9700292341106462566",
  "source": "GoogleMaps",
  "reviews": [
   "Great park. Wonderful grassy area to enjoy on a sunny day. Wooden playground. I really like how large it is but it is getting worn down. Several spots a board is gone or weak so need to watch the littlest ones extra careful.",
   "It's a really nice park, lots of places to sit around and talk with my friends. There's a really nice playground for kids to hang out in, and the lawn is really well taken care of. There's also a really nice stage, which I'm sure is great for events. Wonderful park, I suggest you go there and have a picnic or something.",
   "Fun and spacious park with lots of playground equipment and swimming pool and water slide. Great place for picnics as well. I used to bring my son here alot when he was little. Great memories with him here.",
   "I really like visiting memorial park, especially in the summer when they have the band that plays. The only thing that I’m a little unsure of is when I take my children to the kids park and there are people sleeping inside of the slides.\nThe park itself is a great spot for a fun family picnic or group get together, and the kids playground has one entrance and one main exit (unless you count jumping over the fence)",
   "Great playground for bigger kids as well as for the small toddlers"
  ]
 },
 {
  "name": "Montana Wild - FWP",
  "address": "2668 Broadwater Ave, Helena, MT 59602, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9ced5e06-9330-11ea-bee3-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "family",
   "field",
   "kids",
   "learn",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=401159168710770",
  "source": "GoogleMaps",
  "reviews": [
   "Our daughter wanted to go on her birthday. She had been there before, we had not. Although not a huge venue it was EXCELLENT!  A fun place! I learned a lot. Really enjoyed all the \"stuffed\" animals. Also enjoyed the live fish aquariums.  Definitely a place to take your kids or grandkids. Just off of the Hiway on the west side of town... would make a great place to stop if on a rode trip and just want to stretch and give the kids something interesting to see and do.  If you wanted to go for a walk it also connects to the trail around Spring Meadow Lake, the new 10 Mile Creek park and trails and the trail (Centennial?) back to Carroll College, Centennial Park, Memorial Park, the Great Northern Town Center.  Would also be a good destination for a family bike ride from almost anywhere in Helena.",
   "Went there for a field trip with kids I work with and they loved it, definitely taking my son there soon.",
   "Amazing opportunity to learn about native wildlife! Very fun place to visit!",
   "Great place to learn about Montana’s wildlife. Good for out of state guests with children.",
   "Beautiful,  great wild life information about montana! "
  ]
 },
 {
  "name": "Centennial Park",
  "address": "1200 N Last Chance Gulch, Helena, MT 59601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9d42f9a4-9330-11ea-8270-14b31f159f22.png",
  "tags": [
   "family",
   "structure",
   "walking",
   "field",
   "unique",
   "walking",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=3897534288860047031",
  "source": "GoogleMaps",
  "reviews": [
   "Great playground, lots of places to ride your bike, pump track is small but fun for the whole family!",
   "Lovely park. Quite large including a flat area to kick or throw a ball around, baseball diamonds, walking & biking trails, skate park, bike park, volleyball courts, dog park, small playground and climbing structure for younger ones. Great place to spend a sunny day!",
   "Fun, little park, great views....next to dog park, entertaining to look at the dogs. My 18month old enjoyed it. Could use some swings for little ones..but Mountains on one side, Carroll College on the other, we'd go back.",
   "Great park. Large sports field and walking paths. Also a bike area, dog park and excellent news playground. One of our favorite playgrounds, unique compared to most.",
   "This park is pretty big considering that it's entirely within the city limits. It features a skate park, many soccer and baseball fields, a dog park (with separate areas for large and small dogs), many picnic tables, a playground, some stationary fitness stations, and some outstanding pedestrian walkways that are connected to trails that go all the way out to Springmeadow Lake State Park (passing Barney Park along the way) in one direction, and to Nature Park in the other. It is also adjacent to Carroll College and the YMCA, and is connected to Memorial park via a pedestrian underpass, making it a top-notch, comprehensive recreation destination. This is a fine city park."
  ]
 },
 {
  "name": "Broadwater Hot Springs & Fitness",
  "address": "4920 W, US-12, Helena, MT 59601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9d9b2aac-9330-11ea-b1e2-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "food",
   "walking",
   "family",
   "food",
   "food",
   "affordable",
   "free"
  ],
  "link": "https://maps.google.com/?cid=16900879517355035034",
  "source": "GoogleMaps",
  "reviews": [
   "We did swimming on a Thursday afternoon in Feb. taking advantage of toddlers swimming free. Nice pool, only the one big pool/hot pool were open by the restaurant. They are building a new indoor pool and another outside pool areas that were not open. Nice dressing room, clean. Wait service at the pool for people who wanted drinks or food. Plenty of room, with a bench all along the edge. An island in the middle my kids loved walking around.",
   "Great hot springs and amazing food.\n\nI came to visit my family with my girlfriend and they took us here to show off a little. The hot springs were great, and my girlfriend especially had a lot of fun. But the real treat was the food we had after. I couldn't have expected how amazing the good was. I figured it would be decent, like a kitchen added to the side of a main attraction, but the food was sole of the best I've had in a long time. The reuben sandwich i had was actually probably the best one I have ever had.\n\nGood beer selection as well.",
   "Was crowded but still pretty nice. Will definitely try going again when there aren't so many people. The restaurant was amazing! Great food and prices where affordable.",
   "Nice clean dressing/shower rooms. The old pool needs a little TLC but is nice for laps. I will give it 5 stars when their new pools open...which is a mystery but they look ready. If you are of age try the Bloody Caesar with sake.",
   "Well, first, having multiple pool temps is way cool. You can soak & relax in warmer stuff, you can swim & exercise a little in the lukewarm rec pool, and you can get that body temp up & then cool it down with the hot tub & cold plunge. Secondly, picking from the excellent beer selection & some good pub grub in the well appointed bar is a nice way to go after a healing soak & swim cycle or two. And thirdly, and so hugely appreciated, is the Broadwater allowing cancer patients to soak free for a couple of hours on Thursday afternoons! Thank you so much for that Broadwater!!"
  ]
 },
 {
  "name": "Sleeping Giant Lanes & Mini Golf",
  "address": "3355 Tricia St, Helena, MT 59601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9e491f9c-9330-11ea-9490-14b31f159f22.png",
  "tags": [
   "cheap",
   "eat",
   "kids",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1282195331843928708",
  "source": "GoogleMaps",
  "reviews": [
   "Great Bowling Alley.  Recently raised prices by quite a bit, which is unfortunate.  Used to eat dinner there weekly and buy beer by the pitcher because it was cheap, but now the prices are a little too high for that.  The bowling however is great, and the staff is awesome!  No longer has mini golf either sadly.",
   "Great bowling alley. Im not sure if he's the owner, but the guy that's at the counter on the weekends is a great guy! The staff are always friendly! I went every other week the 9 months my girlfriend was doing her internship at the hospital. It really was the only thing I enjoyed about helena.",
   "Fun place to take my toddler, pretty average as far as bowling alleys go. Definitely can't eat any of their food being gluten sensitive. But I'm grateful it's here since helena doesn't have a huge selection for kids",
   "Love the new owners. It feels like they care about the place more than the last.",
   "Nice and easy mini golf area and bowling area. Good place to hangout"
  ]
 },
 {
  "name": "Pioneer Park",
  "address": "120 S Last Chance Gulch St, Helena, MT 59601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9e956a22-9330-11ea-94c6-14b31f159f22.png",
  "tags": [
   "kids",
   "library",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2690746730509859779",
  "source": "GoogleMaps",
  "reviews": [
   "Great park right next to the library. A fully fenced in playground great for the smaller kids age 2-5. This will definitely be our favorite place on sunny days with all of the shade trees.",
   "We came in time for \"five alive\", loved the food trucks, the kids activities, and what an energy, you people of Helena! Looks like a fun town to live in.",
   "Went to live at 5. It was great fun",
   "This park is beautiful— Alive @ 5 on summer Wednesday’s are very chill and relaxing.",
   "A nice park with a place for smaller children to play with an enclosed playground"
  ]
 },
 {
  "name": "Last Chance Splash Waterpark & Pool",
  "address": "1203 N Last Chance Gulch, Helena, MT 59601, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9efeda78-9330-11ea-871d-14b31f159f22.png",
  "tags": [
   "kids",
   "cheap",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6521596503471914479",
  "source": "GoogleMaps",
  "reviews": [
   "Great looking pool. Haven't actually been inside yet but looks clean and the lifeguards always seem to be paying attention.",
   "Had a great time. We were there for a swim meet. There's lots of space available in the park for the spectators. They also have a nice playground for the kids to play on.",
   "My kiddos always have fun here. They love to swim and goof around at the splash park. They've taken swim lessons the last few summers as well, and the instructors are always helpful and patient.",
   "My kids love going here admission is cheap and we always have lots of fun.",
   "Awesome park, friendly staff clean and good location"
  ]
 },
 {
  "name": "Thomas Francis Meagher Statue",
  "address": "Helena, MT 59601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9f75df68-9330-11ea-b04a-14b31f159f22.png",
  "tags": [
   "family",
   "history",
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17863045255438363532",
  "source": "GoogleMaps",
  "reviews": [
   "A very interesting spot full of history. You could spend the day discovering, picnicking, and checking out the visitor center. The particular day I met my family there, it was VERY HOT and there were dogs involved so we didn't last long in the heat. I would definitely go back when the summer heat has cooled. It was intriguing to see the battlefield, trails walked by soldiers, and the trees were so big and beautiful!",
   "A must visit if you're in the area and are a student of Irish history.",
   "The man who made the Irish Tri-Color flag, fought in our Civil War and became a legislator way out west. A real American hero, and an Irish legend to boot! I am proud to see this here, and hope in the future to help preserve Thomas' history!",
   "Statue of the first governor of the Montana Territory.  Interesting history/: Sounds that like most Irishmen Tommy not only had good leadership skills he had the gift of gab.",
   "Drive out and see it."
  ]
 },
 {
  "name": "Black Sandy State Park",
  "address": "6563 Hauser Dam Rd, Helena, MT 59602, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9fe0af8c-9330-11ea-aa28-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=16254524344211162785",
  "source": "GoogleMaps",
  "reviews": [
   "Went overnight for tent camping. Nice spot right next to the water. There are 6 tent spots, none of which are bad. RV pads look nice right next to the water.",
   "Great site, beautiful area.  Minus 1 star for super small camp sites, but they don't have much land to work with. We will be back for sure",
   "The first few spots are really nice, grass and on the lake. Spots down further are congested with the fire pit and table on the opposite side from where you exit the camper. The hornets are horrible.",
   "Very nice areas, usually less crowded than Canyon Ferry. Make sure you stock up before you go, there aren't any stores close by. Some nice hikes and chances to see some wildlife.",
   "This is an excellent location for outdoor recreation. Plus, the staff are super friendly and the facilities are always maintained; very clean!"
  ]
 },
 {
  "name": "The Montana Blue Jewel Mine",
  "address": "5582 Four Cee's Rd, Helena, MT 59602, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a03eae42-9330-11ea-ace5-14b31f159f22.png",
  "tags": [
   "history",
   "kids",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=15624218590599087905",
  "source": "GoogleMaps",
  "reviews": [
   "A1 experience. Did Philipsburg earlier this week and had fun but this place was way better. You get to see the whole mining process as well as participating on a small scale in your own mining experience digging your own dirt, seiving it as well as picking out stones. The genuine experience. Sapphires n garnets far larger than we found on Philipsburg. Plus owner Bruce was full of history and stories. Well worth the money.",
   "Off the beaten track and lots of sweat equity needed to get your sapphires and absolutely worth it! Beautiful views and good conversation with the boys and other clients.",
   "Our group of nine traveling across the country was looking for something new and exciting to do while near Helena.   Mining for Sapphire sounded like a great opportunity for the kids in the group.  We called the night before for reservations, and woke up early to head to the mine.  Bruce welcomed us and showed everyone the ropes.  Within seconds, the kids were all smiles and enjoyed every second of it.  We had a blast and can not recommend this enough to anyone interested.  Enjoy and dig away...  good luck Bruce!",
   "We had a great time with Bruce, Bob, and Nina! We were shown the ropes for mining with good instruction and patience. Bruce was particularly interactive and we enjoyed listening to his stories and advice. Out family of five had a nice time and came out with some significant stones! Our kids were 10, 13, & 16 for this. A younger boy (6?) with another family needed a hand keeping entertained. My 16 year old enjoyed the final hunt more than the dusty work required to get there.",
   "We didn’t even end up going here, but they put a bad taste in my mouth just from the call. I understand it’s a busy holiday weekend but basic manners still apply. \nMaybe we will give it another chance in the future as they had great reviews, but for now we are going to Spokane Bar Sapphire Mines instead 🤷‍♀️ Next time, be polite even if you’re full for the weekend."
  ]
 },
 {
  "name": "Tizer Botanic Garden & Arboretum",
  "address": "38 Tizer Lake Rd, Jefferson City, MT 59638, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a0d437d4-9330-11ea-9afa-14b31f159f22.png",
  "tags": [
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=13270073556108216896",
  "source": "GoogleMaps",
  "reviews": [
   "This was an unexpected find. My wife loves gardens so, as we travel, we’re always on the hunt. We drove away from Helena about a half hour, then turned off the highway and ended up on a dirt road…. “what are we getting ourselves into”? But even though the entrance looked modest, once we got past the office/shop/store, the place really opened up. The nice lady gave us a great overview of the place, a map with numbers to go by and off we went. Two hours later, we got done! So many hidden curves to explore. And many, many hidden areas with chairs, or a bench, where you can just sit and enjoy the serenity of the gardens. This aspect is so unlike most gardens we’ve gone to. This is really more of an interactive experience. A creek flows right through the gardens, adding to its charm and makes the flowers have sound too. The staff is extremely knowledgeable and takes a lot of time to answer questions. Really worth the entrance fee.",
   "If you like to photograph plants, this is the place to be! A wide variety of sculptures, furniture, and knick-knacks add character to the gardens.",
   "Very beautiful and eccentric! Didn't get to see it when everything was in bloom but still worth it. A must place to see and visit",
   "stumbled on this amazing garden by chance, absolutely loved it. Great place for a picnic and has a nice retail nursery so you can pick up a living souvenir",
   "What a wonder place to stroll through and rest from travelling.  Peaceful and serene.  We hated to leave."
  ]
 },
 {
  "name": "Great Divide Ski Area",
  "address": "7385 Belmont Dr, Marysville, MT 59640, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a138511e-9330-11ea-b7b9-14b31f159f22.png",
  "tags": [
   "kids",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=2117579557813643913",
  "source": "GoogleMaps",
  "reviews": [
   "I knew this guy in high school - he was a senior, I was a sophomore - he was one of the cool kids. Not cool in the slick, my-daddy-bought-me-a-camaro-for-my-birthday kind of cool but, like, down to earth and easy - going cool. For instance, once, in the middle of winter, he showed up wearing gym shorts - the cute shorty ones from the 80s (because it was the 80s), cowboy boots, a pink polo shirt with the collar popped, and a straw cowboy hat - like it was a Tuesday. Great Divide is like that. Also, Betsy is particularly great - super helpful and kind. We love it here.",
   "I came here from Colorado to do work related training and wow I have to say this place is a gem, amazing! no crazy lines, people and staff are friendly and their hospitality is by far the best. This place has a small town feel and the staff and regulars will make you feel at home. Like I said I'm from Colorado and have been to places like Vail, Keystone, and Breckenridge, but this place I can see my self coming back to Montana just for this Ski Area and the vibe and all around atmosphere it provides!",
   "Fun local mountain. Definitely worth the small amount of money to ski here. If there is a lot of snow then you will have an amazing time. When snow is lite it is still a fun place.",
   "Great ski area. Nice bar to have a drink. Changing table in the restroom.",
   "The drive in is simple, no traffic at all. Staff were incredibly friendly. I didn’t wait even once in the 2.5 hours I was there to get on a lift. Lifts seem a little outdated, but move fairly quick, much faster than the explorer lift at Big Sky, yet smaller. Seems to have a wide variety of terrain to ride. I’m looking forward to getting into those trees once they get just a bit more snow."
  ]
 },
 {
  "name": "Grandstreet Theatre",
  "address": "325 N Park Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a197d68a-9330-11ea-b8e3-14b31f159f22.png",
  "tags": [
   "theatre",
   "theatre"
  ],
  "link": "https://maps.google.com/?cid=287035180010139971",
  "source": "GoogleMaps",
  "reviews": [
   "A nice variety of plays to choose from, a relaxing experience, and quality acting from the performers!",
   "I love that Helena has great community theatre! Reasonable prices for high-quality local productions. It's great fun whether you are in the audience or the cast!",
   "I go to Grsndstreet and it is like my second home. Thank you Grsndstreet! Love, Quincey",
   "I am never disappointed by the shows Grandstreet puts on. They have top notch designers, strong actors, and one of the best programs for children I've ever encountered. This theatre rivals some of the best urban regional theatres in the US. ",
   "Great staff and volunteers. Nice variety of productions. Super theater school."
  ]
 },
 {
  "name": "Gates of the Mountains",
  "address": "8320 N Montana Ave, Helena, MT 59602, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a1f27a00-9330-11ea-8165-14b31f159f22.png",
  "tags": [
   "history",
   "nature",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14709813762683127289",
  "source": "GoogleMaps",
  "reviews": [
   "The boat ride was a perfect way to see some beautiful Montana backcountry you couldn't otherwise see.",
   "Pretty good spot to drop by and fishing, but other than that, you might be disappointed. Lack of parking space",
   "Beautiful 2 hour boat excursion on the Missouri River in a canyon with a great narrative relating history and nature.",
   "The river boat guide was very informative and knowledgable, as well as humorous & entertaining.  We really enjoyed the cruise in the open boat.",
   "Inexpensive, pleasant boat ride, OK for history buffs following Lewis & Clark trail, entertaining guide though he is retiring. Not much wild life, a very distant eagle, some osprey, and a dear."
  ]
 },
 {
  "name": "Pediatric Dentistry",
  "address": "3116 Saddle Dr #1, Helena, MT 59601, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a263647a-9330-11ea-bb6c-14b31f159f22.png",
  "tags": [
   "creative",
   "knowledgeable",
   "knowledgeable",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1614084382384089977",
  "source": "GoogleMaps",
  "reviews": [
   "We have been to multiple pediatric dentists in a variety of states. Dr. Nate, Dr. Kevin and Dr. Rich and their staff are the best we've ever experienced. They are knowledgeable and wonderful with children. Their staff is always friendly and are experts in being flexible and creative with children who need different modalities of care. Our daughter has special needs and they are consistently fantastic with her. We are so grateful to have them here in Great Falls.",
   "A great practice and overall experience for me and my 2-year-old daughter. She first saw Ember who was knowledgeable, fun and patient when my daughter was hesitant to get in the dentist chair. Dr. Kevin was warm, a good listener and summarized some key things we can do to keep her mouth and teeth clean. Very pleased with our visit- thank you!",
   "I took all 4 of my children in for a dental check-up at the same time. I was a little nervous about handling all of my kiddos at one time but it turned out to be a wonderful experience. My kids really enjoyed all of the decor and the live fish tanks! Everyone was very understanding of my children and their nerves and helped them feel comfortable. Having moved to Helena from Portland, OR, I left wondering why the big city didn't have any medical or dental office nearly as cool for children.",
   "There was a little mixup with our appointment time but the ladies at the front desk made sure they got us right in!  We met Dr. Richie for the first time and what another GREAT doctor.  The whole staff is just wonderful!  Thank you to you all for making every experience at the office terrific.",
   "Helena is so lucky to have two amazing Pediatric Dentists locally in our community. The front staff are very welcoming and warm. The dental assistants are always professional and really create a WOW experience for every child that enters the dental clinic. I highly recommend Pediatric Dentistry for the whole state of Montana."
  ]
 },
 {
  "name": "Nature Park",
  "address": "2250 Gold Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a2a528f6-9330-11ea-861a-14b31f159f22.png",
  "tags": [
   "walking",
   "kids",
   "walk",
   "family",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=15730079493789378140",
  "source": "GoogleMaps",
  "reviews": [
   "Close to home with a nice paved walking trail. (Another unpaved trail on the west edge along Bill Roberts Golf Course.) The paved trail connects or continues along the south side of the golf course and ends close to the trail to Spring Meadow Lake and the new Ten Mile Creek park.. that stretches all the way to Fort Harrison.",
   "Awesome place to take a stroll with the kids",
   "It's relaxing is beautiful and it just makes you feel like you're in the woods",
   "It's a fun and quick walk with the family.",
   "This a beautiful easy paced walk!"
  ]
 },
 {
  "name": "Memorial Park Warming House & Ice Rink",
  "address": "5 Memorial Dr, Helena, MT 59601, USA",
  "avg_visitor_review": 3.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a31046c6-9330-11ea-a6a1-14b31f159f22.png",
  "tags": [
   "cheap",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=9485585084367772300",
  "source": "GoogleMaps",
  "reviews": [
   "This place is awesome it’s super cheap and fun for both people who are learning how to ice skate and for people who already know how to ice skate great place highly suggest it!",
   "It is a fun place to go if your bored cause there is nothing to do in helena. The ice could be better tho...",
   "It is a great place to learn how to ice sk8",
   "Over the many years not much has changed with this place. It's a Helena Hometown favorite in the winter time with the ice skaters. Nothing too exciting to see here. Whether you're learning to skate or an expert skater it's a great place to go in the winter time for outdoor skating. You never know what you're going to get with the conditions of the ice. It's usually the best mid-season and as spring gets closer conditions begin to degrade.",
   "Purrrfect place"
  ]
 },
 {
  "name": "Montana Preservation Alliance",
  "address": "44 W 6th Ave #110, Helena, MT 59601, USA",
  "avg_visitor_review": 3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a3614d5c-9330-11ea-b885-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=5287264426106661843",
  "source": "GoogleMaps",
  "reviews": [
   ""
  ]
 },
 {
  "name": "Lewis & Clark Caverns State Park",
  "address": "25 Lewis & Clark Caverns Road, Whitehall, MT 59759, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a3a97a1a-9330-11ea-882d-14b31f159f22.png",
  "tags": [
   "family",
   "historic",
   "tour",
   "kids",
   "hike",
   "unique",
   "hike",
   "history",
   "kids",
   "tour",
   "tour",
   "unique",
   "tour",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=17732188484920875900",
  "source": "GoogleMaps",
  "reviews": [
   "The caverns are amazing and the tours are fantastic. I have been through several times over the years and always loved the experience. The candlelight tours in the winter are amazing for the experience and historic aspects, but the summer tours really show off the caverns with the lights. All of the guides are passionate about their jobs and the caves, and love to teach. Great place to visit and bring friends and family.",
   "This was a great experience. At the time our kids were 5 years old and 8 years old (almost 6 and 9). They did okay getting through the tour but it is a pretty good hike. I don't think I would bring kids any younger then that unless you are prepared to carry them for part of the stroll outside the caves.\n\nIt was hot outside the cave and cool inside so make sure you pack water and a hoodie or warm clothing. Small snack would not hurt either.",
   "A good hike and interesting tour. Long eared bat's seemed to like us. If you are affraid of small tight areas or cannot hike about 2-3 miles you might not be tough enough!  It is an old school hike that is fairly easy downward caverns tour with MT history lesson. Definitely a unique spot that keeps the kids off the phone!",
   "These Caverns are a jewel.   The drive to the caverns winds along the Jefferson River,  with cliffs adorning the sides of the road.   Our party were excited to to the Caverns today, as it was the rare tour through the cave system with candles!!!  This Candlelight tour is offered only at Christmas.   What a treat!!  The vision of the fellow participants weaving among the cave features is idyllic.   It is surprising how much light the candlelight can make in the total dark.   This is a best kept secret.  The tour guides are top notch.",
   "A truly fascinating and unique experience! Amazing formations of nature. A true treasure. Outstanding tour and educational experience. Highly recommend!"
  ]
 },
 {
  "name": "Grant-Kohrs Ranch National Historic Site",
  "address": "266 Warren Ln, Deer Lodge, MT 59722, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a3f15886-9330-11ea-b37b-14b31f159f22.png",
  "tags": [
   "tour",
   "parks",
   "family",
   "parks",
   "kids",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13491190021137778661",
  "source": "GoogleMaps",
  "reviews": [
   "This place was pretty amazing!! We went to get our National Parks Passport book stamped but it turned out to be pretty spectacular!!! There was a working blacksmith shop and a real cowboy with coffee brewing over an open fire! LOTS of buildings to self guide through. Cows and horses and chicken. We went out of our way to go so we didn't have time for the tour of the house but wish we had! The views were amazing as well. The husband and wife team that we met at the visitors center were so nice and super helpful. They volunteer their time to work there! We were both super impressed!!!!",
   "If you are anywhere near this park, do not miss out on the only operational ranch in the National Parks registry. This is one of the best kept secrets of our NP system. The park is a working ranch still. The family that ran and operated this ranch very carefully kept all the records, details and many of the artifacts from the past. There are very few reproductions in the main ranch home and the cowboy housing which is awesome. You get to see how life was for the cowboys back in the 1800s.",
   "Awesome experience and very informative. Park ranger at the entrance taught me and my kids all about bison and how they were used in the 1800s. Tons of stuff to look at, recomend taking the horse drawn carriage around the farm and then enjoying some cowboy coffee made over a fire by a cowboy.",
   "Amazing. I learned a lot about US History. You must visit the main house. Wait for the tour. Most important part of the tour. They are not allowed to take a pic inside of house.\n\nMy private tour guide (Dan Shook) was amazing. He explained everything very clear.",
   "Very nice place. Worth a visit. There are scheduled events that you might wanna check before you go."
  ]
 },
 {
  "name": "Montana Historical Society",
  "address": "225 N Roberts St, Helena, MT 59620, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a4406328-9330-11ea-952b-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13415848861276317779",
  "source": "GoogleMaps",
  "reviews": [
   "Really neat little museum. Also, the gift shop has some jewelry that is very specific to Helena and so e semi-precious stones that are specific to Montana. I couldnt find any of these stones at the other gift shops in this area. Also, excellent customer service at the gift shop.",
   "what a great museum with tons of Montana history. The CM Russell artwork display is worth goin to see in itself! this is a must do while in Helena",
   "Great Montana history and depth of knowledge on our great state.",
   "Nice meusem with kid friendly exhibits",
   "Love this place! Great places to go to learn about Montana History!"
  ]
 },
 {
  "name": "Old Montana Prison Museum",
  "address": "1104 Main St, Deer Lodge, MT 59722, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a4877e88-9330-11ea-aa89-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13563982738206079859",
  "source": "GoogleMaps",
  "reviews": [
   "This is a really cool place for a bit of American History. The prison offers a lot of information on a self paced, self guided tour. Between google, signs  and the map the museum provides, you get all the information you could ask for. You can explore inside the prison as well as the prison yard and surrounding buildings. This is a great place to discover some of America's past in regard to the handling and reform of criminals. Overall very interesting place to visit. There is a gift shop and public restrooms. Also attached to the prison by way of the gift shop is an amazing car museum. One stop 2 attractions. The employees are very friendly and helpful. I truly recommend making a stop here if you're in the area.",
   "Loved the experience of being able to go through the old prison. The car museum was just as cool. Great price for a great place.",
   "Great museum! They also have a car museum attached that you can view before it after touring the old prison. It is a self-guided tour, so the ladies at the front desk give you a very informational packet with all the signs listed that you can read aloud to your party as you tour the prison. Nothing spooky happened to use while we toured, but some of our pictures we took do give me the creeps. A fascinating experience for history lovers, and paranormal enthusiasts alike.",
   "This is a great place to visit. Make sure to stop at the store across the street. The People are friendly and the subject matter is fascinating. Just be sure to have enough money to pay to enter, as it is a bit pricey ($10-15). We hope to go back again.",
   "This is an incredible museum in a great little town. If you're out and come across the signs for this museum, stop and check it out. It's well maintained, the staff have great stories and are really friendly. Dropped one star because a good bit of exhibits are \"closed for repairs\"."
  ]
 },
 {
  "name": "Helena-Lewis and Clark National Forest",
  "address": "Neihart, MT 59465, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a4dd8df8-9330-11ea-9c95-14b31f159f22.png",
  "tags": [
   "free",
   "hike",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=16186088828038827425",
  "source": "GoogleMaps",
  "reviews": [
   "Best map system for any mountain range at the ranger stations for free! very diverse area, year round fun, grab a map and it's easy to explore the back country",
   "Beautiful location to camp or hike.  During the November December time frame you can pick up a 5 dollar Christmas tree tag and get a tree.  You can get some great exercise and views while doing any of these activities.",
   "A wild and rustic backcountry hike or backpacking journey can be found here. We back packed for three days and didn't encounter any other hikers even on the CDT. I do not like hiking in pants and my legs paid the price on these often overgrown trails but it was worth it. Don't forget your map and compass - one of the trails simply disappeared so you'll want tools to navigate. Water is fairly plentiful, as are butterflies! The area burned many years back and it's interesting to see how it is recovering.",
   "Trail #497 is a logging road. Pretty well maintained and easy to hike. We didn't get anywhere near the top of the trail, but it was a nice hike.",
   "Great forest. Lots of trails and mountain bike trails .... Glacier Park is amazing."
  ]
 },
 {
  "name": "Big Sky Brilliance",
  "address": "2728 Colonial Dr, Helena, MT 59601, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a5219c18-9330-11ea-8770-14b31f159f22.png",
  "tags": [
   "unique",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=14416295440494373303",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent experience working with Dillon and Big Sky Brilliance. He was able to make the exact ring I wanted for a price I could not find anywhere else. He did a great job answering any questions or concerns I had and was very responsive. On top of it all, my ring was delivered very quickly. Highly recommend working with him for your next jewelry purchase!",
   "When I almost gave up on my search for the perfect ring for my then fiance (now my wife) Dillion stepped in and helped me so much! I'm a needy customer and I can be difficult. Dillion patiently found the perfect sapphire and ring for my budget. Thank you so much!",
   "If you’re looking for an easy, unique and fun experience while choosing the perfect piece for your loved one, then Dillon with Big Sky Brilliance is your guy! He takes the time to get to know you and your loved one. This allows him the advantage to understand exactly what you’re looking for. We worked together for a few weeks and designed the most beautiful wedding set for my fiancé and myself. We are so proud of our rings and so happy that we chose Big Sky Brilliance to design such timeless, momentous pieces. Thank you Dillon!",
   "Dillon-\nThank you for making my experience so great! You were very informative and educated me on jewelry in a way I hadn't expected nor valued until working with you. The approach you took in helping find something so special and unique made the experience comfortable and enjoyable. I highly recommend anyone in search of fine jewelry to give Dillon a shout. He will work within your budget, and exceed your expectations, all while being flexible and eager to satisfy your expectations.  The ring arrived on time and was everything and more I had been hoping for. Thank you again Dillon! I will be recommending and using Big Sky Brilliance in the future!",
   "Dillon was very accommodating In meeting with me. His turnaround and ability to provide example renderings limited meetings to work through and bring our ideas together.  He has a wonderful eye for colors, etc. I enjoyed working with him and would definitely work with him again. LOVE my beautiful ring."
  ]
 },
 {
  "name": "Gates of the Mountains, Inc.",
  "address": "3131 Gates of the Mountains Rd, Helena, MT 59601, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a56a8c1a-9330-11ea-8318-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "history",
   "cheap",
   "history",
   "tour",
   "tour",
   "eat",
   "history",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=10267891481933598298",
  "source": "GoogleMaps",
  "reviews": [
   "This river is amazingly beautiful! You won't be able to take your eyes off the scenery! Our guide was very knowledgeable about the history of various sites along the river. I took one star off because the ticket building and the boat are swarmed with mosquitoes! Between the mosquitoes and the bees on the boat, it was enough to take a little enjoyment from the ride. But overall, the boat tour is an impressive experience!",
   "The place that runs the boat tours does a great job.  The boat drivers are informative about the history and events.  The boat ride is slow-going but enjoyable.  The scenery is amazing, and the price for a 2 hour two seem pretty cheap.  Definitely glad we went.",
   "My husband and I had been before and enjoyed it so much, we took my mother.  Very informational, educational and fun!!  Great for all ages!  The ride is smooth, the guides are awesome, and the scenery is beautiful!  We saw several bald eagles this trip.  We will most definitely be back again.  Next year we want to do the bat tour!",
   "Awesome boar tour. Some construction on road with a pilot car taking cars back n forth so had a good 15 min wait once getting into the park. Give yourself time. They ask you to line up 10 mins prior to your tour time. The office is the brown building to the left once you get to the marina and the do have bathrooms downstairs and on board. \nTour guides were super informative and funny, we saw the gates and lots of Bald eagle, osprey and turkey vultures. They showed us batcaves and told us a lot about the history. Very beautiful and enjoyable. Keep a jacket as it started raining and got cold on the water. \nPsycho insects (nats) were swarming us all, we were all going crazy in line. We thought they were mosquitos but were told they do not bite, they are nats and there are no mosquitos on the marina as the bats eat them all. \nEven thought it was so annoying as they were flying up our noses, they did back off once the boat was in motion and it was nice to know we would not be eaten alive!\nBrian was an awesome tour guide.",
   "Gates of the Mountain is a great little stop. Nice guided boat tour up the Missouri River and back down again. Good scenery and some history learned along the way!"
  ]
 },
 {
  "name": "South Hills Dental",
  "address": "2480 Tracy Dr, Helena, MT 59601, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a5c51ca8-9330-11ea-9b27-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6541469121141744535",
  "source": "GoogleMaps",
  "reviews": [
   "Not many dentists see VA patients but South Hills Dental does and their treatment is greatly appreciated. I drive from Great Falls to Helena to see Dr. Barry and its worth getting up at 5:30 to make it on time. Dr Barry is one of the best dentists I’ve seen in my 52 years. I was married to a dental hygienist for 22 years so I know. Dr Barry and his assistant Nina work great together and very little time is lost getting tools or prepping. Dr Barry knows how to give a shot and make it stick around for a while. Very little to no pain during and after his shots. What makes the difference is that they care about the patient and the work they do for them. I have never been rushed out or pressured to make a decision on work. Everything is explained to me so I know what work is going to be done. The girls up front are friendly and make you feel at ease. If more dental offices were like this one people wouldn't have any anxiety about seeing their dentist. Great Job!!! And be proud of the office you have all made together.",
   "You guys are absolutely fantastic. I have never been to a dentist office that is so caring and so informative and no surprises. Your prices are something that I can afford and today was especially nice. I cannot remember the dentist name but he was so kind and wonderful. The hygienist was very good \n and also very kind. Again thank you for being so professional but yet so compassionate. It was greatly appreciated.",
   "No wait time!  Professional and personable, made sure I was comfortable at all times and that I understood any concerns they had.  I highly recommend!",
   "This office is WONDERFUL!  They did custom mouth guards (athletic guards) for both of my kids.  The hygienist was super friendly and worked extra hard to make sure the insert wasn't uncomfortable for the kids.  Highly recommend these guys!",
   "Simply the best.  Best, most inclusive exam I've ever had. I've never sat in a dentist chair this long, but I've also never really had it this easy. I was assigned the best tech, she cared and was on top of her game, only surpassed by a great dentist, truly a great team.  It was obvious in the beginning that my plan was designed with care, not only for what I needed at the moment,  but what my mouth needed for the future, and I also saw how he passed on his profession.  I remain impressed, and for my first visit I think I'll stick to my first comment, Simply the best!"
  ]
 },
 {
  "name": "World Museum of Mining",
  "address": "155 Museum Way, Butte, MT 59701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a62343f0-9330-11ea-867d-14b31f159f22.png",
  "tags": [
   "tour",
   "kids",
   "tour",
   "history",
   "walk",
   "knowledgeable",
   "tour",
   "history",
   "unique",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=2643538350490051248",
  "source": "GoogleMaps",
  "reviews": [
   "We had an excellent tour of the Orphan Girl Mine led by Michael.  The World Museum of Mining focuses on the mining in Butte although there are displays that weren’t used in the Orphan Girl Mine.  The displays in the mine are interesting.  They have an eclectic collection of items on the property-some vintage from the era and town and some from other areas.  Much restoration is still needed on the mines and grounds.  Included in the modest price is admission to the doll house/doll displays and rock display from around the world.  Worth a stop if you’re in the area.",
   "Went here for treat street for Halloween and the kids always get ample candy. The wait is long, but definitely worth it.",
   "Just a fantastic experience! We took the 100 foot mine tour and just loved it! We really enjoyed the talk and learned so much about mining, the history of mining and of Butte. We now have such respect for the men who worked those mines and put their life on the line. Highly recommend this tour",
   "This is a neat place with an awesome underground tour. The guide was a born and raised in Butte and very knowledgeable about the history of the mine. The buildings are all from the old town and you can walk into the church buildings, but only get to observe others from outside. I've read some saying this is a waste of time, but it is not. The history is amazing and you also can walk up one of the head frames which is neat. My respect for the miners only grew as I leaned more and more. The history of Butte is tragic and beautiful at the same time. They had electricity before New York and how advanced they were blows my mind.",
   "Unique place to visit! Not entirely wheelchair accessible. A person using a wheelchair will need a significant amount of help. There is a lot to see and read about. Could easily spend a few hours here reading and learning. Would definitely recommend visiting. I would recommend to the staff to find a way to provide better lighting to the individual \"businesses\" on display. Very friendly staff! Would enjoy a guided tour next time!"
  ]
 },
 {
  "name": "Montana State Capitol",
  "address": "1301 E 6th Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a67338a4-9330-11ea-996b-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "learn",
   "history",
   "art",
   "structure"
  ],
  "link": "https://maps.google.com/?cid=2628615961625571874",
  "source": "GoogleMaps",
  "reviews": [
   "Montana State Capitol Building is a beautifully ornate building.  A walk through the State Capitol, through the many corridors, and up the staircases is a walk through the History of the Great State of Montana.  I've selected a few photographs of our visit.  If you find my review helpful, please like it. Thank you!",
   "I recommend driving by at night to snap photos. It’s really peaceful and quiet. You can take a picture at the steps out front fairly easy. Great tourist must do.",
   "So much history in this place. You can go on tours with a guide, or on your own. You can make a visit here be as short or long as you want. It just depends on how much you want to learn. During legislative session it is neat to sit in the gallery on the 4th floor for the House or Senate floor session. If you visit between January-April of even numbered years you may have to park a couple blocks away. This is when session is in, and it’s a packed house.",
   "Great place to visit. Lots of art to enjoy. My toddler loves going up the big staircase and down the elevators. We can see the done from our house and it is always beautifully lit up in the evenings.",
   "The Montana State Capitol is the state capitol of the U.S. state of Montana that houses the Montana State Legislature which is located in the state capital of Helena at 1301 East Sixth Avenue. The building was constructed between 1896 and 1902 with wing-annexes added between 1909 and 1912. A design competition for the building was conducted in 1896. The commission selected a design by George R. Mann as the winner. In 1897, after it was found that the Commission was planning to scam money from the building project, it was disbanded and a second Capitol Commission was convened. The new Commission abandoned Mann's plan as being too costly, and had a second design competition, won by Charles Emlen Bell and John Hackett Kent, of Bell & Kent of Council Bluffs, Iowa. In order to have their design built, Bell & Kent relocated their office to Helena. While Mann's building was never built in Montana, it was selected later as the basic design for the Arkansas State Capitol. The winning design by Bell & Kent had been altered already during the construction phase, when in 1901 the commission asked for the structure to be made more imposing by increasing the height of the dome. Kent opposed the changes, as his original low spherical dome was meant to be \"pure Greek\", but Bell advocated the commission's request. Between 1909 and 1912, the building was extended by the addition of two new wings on the eastern and western sides. This work was executed by Link & Haire, architects of Butte, with F. M. Andrews & Company of New York as consulting architects."
  ]
 },
 {
  "name": "The Myrna Loy",
  "address": "15 N Ewing St, Helena, MT 59601, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a6be99b4-9330-11ea-b263-14b31f159f22.png",
  "tags": [
   "historic",
   "walking",
   "cheap",
   "food",
   "independent"
  ],
  "link": "https://maps.google.com/?cid=6224031467431924057",
  "source": "GoogleMaps",
  "reviews": [
   "Had such a great experience! Myrna Loy brings super groups from around the world to Helena Montana! I went to see Rio Mira who are a group from Colombia and it made my wife tear up because she is from there. It was so special! Thanks so much!",
   "Great venue near historic downtown Helena, within easy walking distance of many great dinner spots, a perfect place to have a night out. Go check them for an enjoyably intimate evening.",
   "Very fun experience! A must if you're in Helena. Small, intimate movie atmosphere with drinks and food. The popcorn is super cheap compared to a big theater! I will be coming back OFTEN!",
   "Lots of fun. Old theater, excellent venue for the eclectic events held here",
   "Love the independent films here. It is such a sweet place"
  ]
 },
 {
  "name": "The Sewing Palace",
  "address": "124 E Lyndale Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a71bd512-9330-11ea-b2c9-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=7486283639857469590",
  "source": "GoogleMaps",
  "reviews": [
   "Friendly, welcoming staff.  Always willing to help.  They have a great selection for all your sewing needs even those new  things  you didn't know you \"needed\" until you see them nicely displayed.  Great place to shop.",
   "I love the ladies at the sewing palace. They've always been so helpful and willing to take the time needed when I was a beginner. I bought a sewing machine for a present, before I was even there they had it wrapped and ready to go! Thanks Ladies you guys are awesome!",
   "I went into this store yesterday and had a very genuine greeting and was welcomed into the family!! I felt positive and excited to sew my day away!! Sew, I will return!!",
   "I recently made a baby quilt with Jenny's 1 on 1 help. I highly recommend anyone that needs some individual help to work with her. She is very helpful and gives great tips. Cant wait to start our next project together!",
   "The fabrics are wonderful and these ladies know what you need. Awesome."
  ]
 },
 {
  "name": "Our Lady of the Rockies",
  "address": "5970 Montana 2, Butte, MT 59701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a76673a4-9330-11ea-99be-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13281641904632590763",
  "source": "GoogleMaps",
  "reviews": [
   "The diesel bus trip up the mountain on a 7-mile dirt road that is very narrow, curvey and bumpy was not fun for me.  I tried to look only at hubby & phone and not down the steep hillsides.  However, Mark is an excellent driver!  Dress warm as you reach @8500 feet elevation.  Despite poor weather, the 90-foot statute is worth the view inside the base & out.  Wonderful community effort and preserved history:)",
   "Nice view of Butte, the ride is rough and an hour up and an hour down. You're given 30 minutes, which isn't enough to get photos and really take everything in. Especially if you have small children. This would be great for a picnic for the afternoon, given you ever had time.",
   "What a neat place! I had heard of \"our Lady of the Rockies,\" but I never knew what it was. It was incredible.  No matter your religion you can appreciate this site. Just like I appreciate the Buddha on top of a Mountain in Thailand. Just beautiful and spiritual.",
   "Heads up the only way to get there in winter in by snow mobile. The road is unplowed and there was a good two feet on the road in February. Would recommend for summer!",
   "It was neat to see but not something of great interest to me. I understand it has a lot of history so if that is something that intrigues you for sure check it out! We are not Catholic but my wife liked the idea that it was built to honor women everywhere."
  ]
 },
 {
  "name": "Copper King Mansion",
  "address": "219 W Granite St, Butte, MT 59701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a7be30dc-9330-11ea-9156-14b31f159f22.png",
  "tags": [
   "delicious",
   "tour",
   "historic",
   "tour",
   "history",
   "free",
   "hospitable",
   "tour",
   "historic",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8736021895081496048",
  "source": "GoogleMaps",
  "reviews": [
   "Great historic hotel. Really enjoyed our stay. Meals wo delicious! The tour was fantastic. Beautiful old mansion in the heart of town",
   "I only loved this place because I was intoxicated and could make fun of why people make fun of things. The best thing about it was the person giving the tour made jokes along mine. Honestly,  it's a great piece of history. It's worth it's weight of cost. I say... see it.",
   "We drove by to see the Mansion. We had originally heard the tours were free but found out they were $10/adult and only at specific times. I'm assuming the tours were great, but we didn't get to go on any. The outside alone is very cool to look at and worth the drive by.",
   "great place to have a meet and greet with state legislator Debra Lamm who is running for congress for Montana Very hospitable beautiful environment for such an event.",
   "We are from Salt Lake and took the noon tour today Sept 2nd.  This mansion is amazing with such history.  Our tour guide was Zach and he was awesome, highly  intelligent,  fun and a great sense  of humor.  The history of William Clark is fascinating  and to this day the mansion has retained  its authenticity.   The people are so friendly I highly recommend that you tour this historic place.   Ask for Zach."
  ]
 },
 {
  "name": "Sole Sisters",
  "address": "327 N Last Chance Gulch, Helena, MT 59601, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a81fd90c-9330-11ea-8a47-14b31f159f22.png",
  "tags": [
   "learn"
  ],
  "link": "https://maps.google.com/?cid=4764278646249067227",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome customer service!  From work to play, clothing for every body. Plus shoes that you won't find anywhere else in town.",
   "A fun and friendly environment. They will learn your name and give you undivided attention and exceptional  customer service. They have things in a wide variety of price ranges. Always great quality and they take card or cash. They also do wrapping during Christmas.",
   "Always so many wonderful choices and the staff is very friendly and helpful!",
   "Best service and spectacular selection of everything needed for the spot-on wardrobe.   My favorite boutique.",
   "Very cute store. They have a great selection in a range of prices."
  ]
 },
 {
  "name": "Comfort Suites Airport",
  "address": "3180 Washington St, Helena, MT 59602, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a85c6cfe-9330-11ea-8fd0-14b31f159f22.png",
  "tags": [
   "free"
  ],
  "link": "https://maps.google.com/?cid=6514901389389448069",
  "source": "GoogleMaps",
  "reviews": [
   "Heating/air conditioning unit was VERY noisy when it came on waking us several times during the night. Otherwise our stay was great. Have stayed here several times in the last few years. The renovations look great.",
   "Been content with comfort inns over the years. This last stay was unusually unpleasant.\nThe young lady at the desk was polite and friendly as she explained that my credit card wouldn't work. I insisted she try again as that didn't make sense. Same result. (Kind of embarrassing) .  We used my wife's card (same account). No problem.  I immediately called my credit card company who explained to me that the reason for the decline was that the person entering the request was inputting the wrong expiration date.\n\nAlso the heater in the room has a noisy vibration every time it turned on. Made for a long night. We should have asked for a room change. We politely reported the problem to the receptionist as we were leaving. She would have it repaired but didn't seemed too concerned for our sleepless night.\n\nWe had spent the previous two nights at a comfort Inn in billings, mt. Nice place/people except that it kept running out of hot water.",
   "Friendly staff and nice rooms. Gas station/convenience store across the parking lot. Literally 5 minutes from Helena airport. Not over priced.",
   "Free shuttle service was appreciated. Room was clean and spacious!  Staff was friendly. Will return!",
   "Great hotel. I can't wait to stay again after the remodel is complete."
  ]
 },
 {
  "name": "Missouri Headwaters State Park",
  "address": "1585 Trident Rd, Three Forks, MT 59752, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a8a07b26-9330-11ea-8a13-14b31f159f22.png",
  "tags": [
   "kids",
   "history",
   "walking",
   "hike",
   "hike",
   "walk",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17820315131748282957",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent place to stop while driving up or down I-90.  Great place to stretch legs and see some history. It's really a gem of an experience knowing you are standing at the confluence of the biggest river in the USA and all of the history that goes with it.\n\n The pay station was unattended.  There is an outhouse bathroom by the pay station.   Recommend walking the mowed trail that goes by the old hotel. .  Kids enjoyed the park. We stayed about one hour total.",
   "This is a really nice state park in Montana. It is where three rivers come together, forming the Missouri River. One especially nice thing about this park, is that all around the headwaters, there are small rocky \"mountains\" that are really fun to climb. If you climb up one, you get splendid views of the river, the trails, roads, and of the surrounding \"mountains\" (hills). It's a great place to hike around, have a picnic, or just enjoy the weather.",
   "There is something magical and sacred about the three major rivers coming together to form  the longest river in North America. There are various short but very interesting trails to hike. If you are a bird watcher its a treasure and a must see. The confluence of the Madison and Jefferson is great enough but then you have the Gallatin river joining the other 2 rivers only 1 mile further downstream. There are restrooms, picnic areas and benches placed around the park. There is even a small cave with a couple of  pictographs in it, that is well marked.",
   "We enjoyed a one-night stay here while heading from Yellowstone to Glacier National Park. It is conveniently located near I-90 and was an easy late-in-the-day drive from West Yellowstone via US Hwy 191. We knew we would be arriving there late on a Saturday, so we made a reservation a few months in advance. We were glad we did, as it was pretty full. The campground has nice, had flat sites, running water and pit toilets, which were as clean as a pit toilet can be in the summer time. Be sure to walk around and check out the informative displays about the history in this location. Very interesting.",
   "We were brought here by our local friends, and totally surprised by this beautiful park.  As the “Head” of the longest river in the US, this park definitely left a clear and long lasting memory for my self, and gave me a good story to tell about the great state of Montana!"
  ]
 },
 {
  "name": "Best Western Premier Helena Great Northern Hotel",
  "address": "835 Great Northern Blvd, Helena, MT 59601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a8f726cc-9330-11ea-b020-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=14646865173637559181",
  "source": "GoogleMaps",
  "reviews": [
   "A nice quaint hotel with a welcoming lobby and staff.  The hotel parking for guests is not attached to the hotel and is slightly a bit out of the way. My main concern is having guest vehicles out of view from the hotel which could be a target of vandals and thieves.",
   "We always stay at this hotel in Helena.  It is very clean and has great staff.  The handicap rooms are very accessible.  The walk-in shower is most appreciated.",
   "They have always been good to me when I book here and when I'm in town for meetings and conference.  Only reason why I had 4 stars, is due to the swimming pool not being available.  (Remodel - hopefully there will be some cool lighting hint hint).",
   "Awesome hotel!\nClose to Carroll College.\nThe rooms are big and very clean the hand written message from housekeeping  welcoming you is a nice touch.\nThe breakfast was very good. \nThe staff is very professional.\nWe will stay there again.",
   "Attending a conference. Accommodations suitable for purpose. The individual lunches provided were in plastic containers with no flatware nor condiments provided. Some participants had to wait for food as not enough meals were not provided."
  ]
 },
 {
  "name": "C. M. Russell Museum",
  "address": "400 13th St N, Great Falls, MT 59401, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a945c958-9330-11ea-8120-14b31f159f22.png",
  "tags": [
   "art",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=11631079240117183798",
  "source": "GoogleMaps",
  "reviews": [
   "I thought this was just going to an art museum but it's so much more!  I love the Russell home with it's character and antiques. I loved the Cabin Studio and imagine watching him paint there or coming to check on him and finding him sleeping on the cot. And the museum with it's variety: Western Art, displays on Western life, so much info on bisons, native American items, saddles, hats and a hearse!  The museum store is also pretty awesome. They have nice gift items.",
   "Wonderful, beautiful and breathtaking paintings by Charles Russell. This is a wonderful museum with much to see along with other artists. This is my third year visiting from Canada and love it every time. Not to miss.\n\nLife is Good! :)",
   "We had a team building experience here for work and got a guided tour.  It was very educational and fun!  I plan to go back on my own in the near future and explore some more.  Definitely give yourself plenty of time, there is a lot to see!  Great for all ages!!",
   "Wonderful place to visit. The exhibits were excellent. The staff was great and helpful. I’d always been an admirer of his works I was so happy to finally visit the museum. \n\nIt was easy to find. Parking was ample and the cost was reasonable. I want to go back again. Take more time.",
   "Great place to visit in Great Falls. The museum was much larger than I expected. Don’t forget to go downstairs and that you can open the drawers!"
  ]
 },
 {
  "name": "Giant Springs State Park",
  "address": "4803 Giant Springs Rd, Great Falls, MT 59405, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a9919fa2-9330-11ea-a9e5-14b31f159f22.png",
  "tags": [
   "kids",
   "history",
   "learn",
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=6871033942956783003",
  "source": "GoogleMaps",
  "reviews": [
   "Turned out to be a great Sunday to visit the park. Sun was shining, no wind, 38 degrees out but it felt great. Picnickers we're about. Nice \"museum\" for the hatchery. Got to feed some really big rainbow trout.",
   "This is by far the best park in great falls and has a lot of good history posted around the park. There is a very clear natural spring, a playground for the kids, lots of barbecues and picnic areas. Just don't leave a mess like some of the tourists do.. throw your trash away and keep this place looking nice.",
   "Absolutley beautiful place top visit. Especially during spring and summer time. Trail access is easy from here and is a must see for anyone paying through or visiting",
   "This trail is absolutely stunning and well maintained! It's fun to feed the trout at the hatchery, learn history along the trail and find the geocaches hidden around the area.",
   "What a place to visit. It's down right gorgeous. Love bringing my family here!"
  ]
 },
 {
  "name": "Mount Helena",
  "address": "Dump Out Trail, Helena, MT 59601, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a9f17312-9330-11ea-8ff9-14b31f159f22.png",
  "tags": [
   "hike"
  ],
  "link": "https://maps.google.com/?cid=15264036461099162076",
  "source": "GoogleMaps",
  "reviews": [
   "Hiking up to the top of Mount Helena is a perfect afternoon activity regardless of the season. Choose your favorite among several trails that lead up, and take a different one to go down. Enjoy the gorgeous views of the town itself and the surrounding area. Take a break in your busy days, relax and spend some time among hills and forests -- it well worth it!",
   "Great local hike.  The hogback trail is less strenuous and steep. This is actually a nice way to acclimate a bit before you go bigger. I flew in from Texas and this was a first hike before I headed to Glacier!",
   "素晴らしいトレイルです。山頂まで1906トレイルで45分。途中でも山頂からも素晴らしい眺めが待ってます。",
   "",
   ""
  ]
 },
 {
  "name": "Parrot Confectionery Store",
  "address": "42 N Last Chance Gulch, Helena, MT 59601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/aa473468-9330-11ea-852b-14b31f159f22.png",
  "tags": [
   "historic",
   "field"
  ],
  "link": "https://maps.google.com/?cid=15598542968424665881",
  "source": "GoogleMaps",
  "reviews": [
   "As I have said before: a favorite historic haunt for lunch and treats. Lovely environment. Pleasant staff. Today, a Mexican Lime for my sister; a perennial favorite for all of us and one order of handmade vanilla ice cream with a pitcher of housemade hot fudge. Devine. For her,\n Cinnamon fondant mints , and for me, dark chocolate covered ginger pieces for later.",
   "Fantastic chocolates.  Salted milk chocolate Caramels are bomb! So are the hay stacks :) very friendly staff as well.",
   "Cute little candy shop. We always stop here when in Helena to grab a treat. They are super friendly and the candy is great.",
   "Recieved my box of \"thin mints\" ?...in the mail today, in Mi.  Perfect condition and just as good as I remember...I saw the picture of carmel apples and my mouth actually watered...I remember those too.  We used to bring our preschoolers down for field trips......WONDERFUL place...",
   "It is such a throw back, the chilli is great. The decor with all the sweets is a neat blend."
  ]
 },
 {
  "name": "Showdown Montana",
  "address": "2850 US-89, Neihart, MT 59465, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/aab5fc1e-9330-11ea-8b7d-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=6592882819594987743",
  "source": "GoogleMaps",
  "reviews": [
   "What can I say!?!?! Showdown is a great ski resort for all skill levels. Children and family friendly. At $49 a day, probably the most reasonable price you'll find in Montana for the chair/runs ratio. A weekend favorite for most around central Montana and with the hot spring a few miles away, perfect for any weekend get away. Highly recommend!",
   "Always a blast at Showdown. Super kid friendly.  The staff and instructors are always there to help.",
   "As a younger and quite proficient skier I find it is a very fun place to ski no matter the conditions, especially in the trees! The staff is friendly and very helpful. Anyways no complaints.",
   "I have been coming here for more than a decade. The snow is always fresh, fluffy, and natural. And the mountain is always quiet due to the small crowds. The staff is friendly and the prices are great! Definitely my favorite ski resort in Montana. #showdown #montana #skiing #snowboarding",
   "What a fun place to be. Wife never skied before, so signed her up for lessons. Was wonderful experience.  My first time on  the mountain was AWESOME.  Great friendly and professional staff. FOR A GREAT DAY OF SKIING: Showdown IS the place to be."
  ]
 },
 {
  "name": "First Peoples Buffalo Jump State Park",
  "address": "342 Ulm Vaughn Rd, Ulm, MT 59485, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ab041c46-9330-11ea-b3f9-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "history",
   "hike",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=16336033021394187038",
  "source": "GoogleMaps",
  "reviews": [
   "The museum itself was extremely neat and clean. It's a small establishment that you can tour yourself - which I LOVED! The 2 guides were helpful and answered any questions that we had regarding the jump. I would absolutely suggest this place to anyone visiting the Great Falls area.",
   "We were spending a few nights in Great Falls on our way to Alaska and had to get some parts at a local RV shop.  Fortunately for us, we missed our exit and had to drive to Ulm to do a legal U-Turn.  As we exit the highway I see the sign to First Peoples Buffalo Jump State Park. Interesting name so we decided to visit.  So glad we did; the young receptionist was very helpful and after talking with her and two Park Rangers we decided to tour the facility and site.  What a piece of history we knew nothing about.  Fascinating and then taking the drive to the cliffs I couldn't imagine running ahead of a herd of buffalo and at the last minute jumping over the edge to safety.  This park is definitely worth a visit.  Make the time.",
   "Great history and amazing views of the valley. A great 1 mile hike up to the buffalo jump cliff, or take the road around the other side of you don't want to hike it. Restroom is available in the visitors building and near the cliff.",
   "What a great place to see.  It is so peaceful and tranquil. I enjoyed it so very much.",
   "Always wanted to visit here. Very interesting place with lots of history. Staff was very friendly."
  ]
 },
 {
  "name": "Museum of the Rockies",
  "address": "600 W Kagy Blvd, Bozeman, MT 59717, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ab55553a-9330-11ea-9c5d-14b31f159f22.png",
  "tags": [
   "learn",
   "kids",
   "history",
   "kids",
   "history",
   "knowledgeable",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=6033162065714743128",
  "source": "GoogleMaps",
  "reviews": [
   "Such an awesome museum! Would reccomend for all ages! We enjoyed the reptile exhibit the most! The alligator snapping turtle is too cool. Very informative  and you can easily burn a couple hours here.",
   "I love to come here when they open a new exhibit. They always have fascinating exhibits. Their dinosaur selection is a little limited, but this is a good place to take some kids who want to learn a little more about history!",
   "Absolutely impressed with this museum. Great scope of local history and relevance as you're guided through the contribution Montana and neighboring states have made to better understanding previous eras. Lots of western history and places for kids to play. Staff was friendly and prices were fair.",
   "This museum is clearly a national treasure, worth of a few hours if you are in the area.  Particularly, we enjoyed both dinosaur fossil collection and the native Americans collection.  The dinosaur fossil collection is very extensive and informative.  Top of the world research on dinosaurs here as we were told.  The museum stuff and volunteers are very helpful and knowledgeable.  As we missed the regular guided tour, we were given a “short” version of the tour in the dinosaur fossil collection.  Highly recommended!",
   "I hadn't been to the Museum of the Rockies since I was much younger than I am now and, boy, I think i've been missing out.  Simply being surrounded by the knowledge, the history, of our state and the Rocky mountain area as a whole, was such a cool experience.  Don't forget about the super neat dinosaur skeleton stickers in the giftshop!"
  ]
 },
 {
  "name": "Blackfoot River Brewing Co",
  "address": "66 S Park Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/abaac86e-9330-11ea-af93-14b31f159f22.png",
  "tags": [
   "brewery",
   "free",
   "brewery",
   "brewery"
  ],
  "link": "https://maps.google.com/?cid=5785190621083976503",
  "source": "GoogleMaps",
  "reviews": [
   "Great beers and variety! Finally a brewery that doesn’t make a million IPAs and makes an awesome German beer! Super friendly staff. Look forward to drinking here for years to come.",
   "Great brewery. Loved the beer. Got very busy on a rainy Thursday afternoon. Free popcorn.",
   "Blackfoot brewery has some of the best beer in town. The atmosphere is very intimate and organic. There's almost no way that you can't fall in love with everything here.",
   "A real good place to meet friend's and have a real good beer.",
   "Pretty good IPA’s, but I honestly only go here for the popcorn, and yes, VEGAN."
  ]
 },
 {
  "name": "Ten Mile Creek Brewery",
  "address": "48 N Last Chance Gulch, Helena, MT 59601, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ac0bad66-9330-11ea-9e4b-14b31f159f22.png",
  "tags": [
   "kids",
   "brewery",
   "walking",
   "brewery",
   "food",
   "brewery",
   "walking",
   "brewery"
  ],
  "link": "https://maps.google.com/?cid=13348649467851449027",
  "source": "GoogleMaps",
  "reviews": [
   "Loved the brewery and the beer. Love the location. Great shelf of kids toys and a couple of kids tables. They share the bathroom with their neighbors so it is down a hall. They were adding a beer fridge while we were there. Can't wait to go back.",
   "Excellent brewery! I had an amazing experience having these local brews at Ten Mile Creek Brewery. This is one of Helena's coolest spots. Surprisingly, one of my favorite brews here was the Funky Cold Medina, a sour beer! I also enjoyed a pint of their Oatmeal Stout. If you are new, I would suggest trying out a flight and then choosing your favorite in a pint. The employees are helpful, and provide great customer service. My group asked if we could bring in some pizza from a place down the walking mall, and they did not hesitate to say yes. The staff welcomed this gesture, and I would like to personally thank them for hosting our group and being understanding. Cheers!",
   "A broad selection of well brewed beers, served by a friendly staff, in a nice, open (kid friendly) space.",
   "Great bar tenders. Excellent atmosphere for a brewery. Beer was good. Worth a stop if your in the area. No food at the brewery but plenty of places nearby.",
   "Great brewery right on the walking mall. Big open space with a patio in the front. Pretty good list of beers with 3 different IPA's on tap when we visited."
  ]
 },
 {
  "name": "Gallatin History Museum",
  "address": "317 W Main St, Bozeman, MT 59715, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ac647c4a-9330-11ea-bcf7-14b31f159f22.png",
  "tags": [
   "kids",
   "history",
   "knowledgeable",
   "tour",
   "wander",
   "history",
   "learn",
   "kids",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9972542205721655867",
  "source": "GoogleMaps",
  "reviews": [
   "An interesting small local museum in the old county jail. Not expensive to visit and easy parking out front. Lots of jail history exhibits but also lots of pioneer history. A few things kids can touch so great for families. Run by volunteers and self supported. Great bookstore with lots of local history as well as western, cowboy and Yellowstone. They also have Montana cookbooks.",
   "Being from Three Forks, I thought the GHM would be comprised of information I was familiar with. That was not the case by any means! Really interesting content, we enjoyed our time spent here.",
   "Awesome tour guide! Very knowledgeable of the history of Gallatin county and the history of the building the museum is housed in. Amazing artifacts on display! Absolutely intriguing to see the actual jail cells, gallows, and read of the criminal justice activities in the newspapers just as everyone read them over a century ago. Well worth the time and entrance fee, especially since allowed to wander at leisure after the tour. Antique items galore on display!",
   "A great place to learn about some local history of the town.  They have some interactive items that the kids seem to enjoy especially the jail cell.  The staff is very helpful & it's bigger than you would think looking at it from the outside.",
   "Wonderful history! This used to be the jail!"
  ]
 },
 {
  "name": "American Computer & Robotics Museum",
  "address": "2023 Stadium Dr #1a, Bozeman, MT 59715, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/acd4a342-9330-11ea-8fd7-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "free",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=16612854933273022076",
  "source": "GoogleMaps",
  "reviews": [
   "Insanely awesome museum with some incredible computers and things I never would have expected from a museum this size. You could easily spend a couple of hours here. The staff is super friendly and knowledgeable, and the computers and artifacts here will blow your mind. If Steve Wozniak has been here twice, you know it's good.",
   "This is a low-key museum in campus-type building but has a lot of amazing stuff. It's worth spending time and unbelievably it is free. If you have time before your flight from Bozeman, I recommend you to drop by here. It is 20 minutes to and from the airport. I definitely want to visit again if I have a chance.",
   "Kind of hard to find, it is surrounded by regular businesses and in the same type of building as the businesses.  And it doesn't have a big sign to let you know where it is until you are right outside it's door looking through the window at a 2X2 sign in the window.   That said once you find the place it is a great museum.   They go back to the precursors to computers and electronics all the way to present time.   They have a lot of first items (1st handheld gps, dna sequencer, consumer PC, etc).   The exhibit on the enigma machine is both big and in depth.   The part on womens role in programming was very interesting also  It is a smaller museum but most people would spend an hour or 2 here.  If you are really interested in computers and robotics they have videos playing and you could easily spend double that time looking around.",
   "This place basically has the history of all technology and how it became and developed I don't know how they got it all but they have everything this is a excellent place to go and excellent Learning Place also I was very very pleased not one to go to museums would go back",
   "Fantastic museum. I never thought a computer museum could be so interesting. The history starts incredibly far back, but covers the most important aspects of computer and electronics history. The collection of old computers and electronics is amazing. I can't believe such famous people donated to the museum. There is tons of stuff from Steve Wazniak and tons of other famous people from the computer and electronics world."
  ]
 },
 {
  "name": "Residence Inn by Marriott Helena",
  "address": "2500 E Custer Ave, Helena, MT 59602, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ad4da44a-9330-11ea-a2fe-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=18003207280190078207",
  "source": "GoogleMaps",
  "reviews": [
   "The Helena Residence Inn isn't what it used to be.  When it first opened, the breakfast and evening appetizers were much better than they are today.  I've stayed in several Residence Inns and this one disappoints.  I requested several times, the top floor.  I got stuck on the second floor.  The Best Western Great Northern is still a better hotel overall than the Residence Inn.  If the Best Western had kitchens, I would be there.",
   "Rooms were very nice and had a little kitchenette. Pool was good size but does need some refinishing. Breakfast selection wasn't bad, but a bit lacking given how much the rooms cost. Staff was mostly friendly and accommodating. \nCan't find a company email though and I can't get through to the phone number. Left something in my room just last week that I needed back.",
   "This hotel is right next to the airport. It's newly constructed with a comfortable, laid back atmosphere.  Large well layed out rooms with kitchenettes. They are set up nicely so no need to bring your own dishes and silverware here. Managers are friendly and always willing to help. Breakfast is not served until 6:30AM so early risers will need to fend for themselves.  Large jacuzzi with indoor kiddy splash area and large warm pool.",
   "Nice hotel not too far from Downtown Helena. Not immediately obvious, but it's near several restaurants, groceries, and shops which make it perfect for an extended stay.",
   "Very nice hotel, friendly staff and great location. Newer hotel and love the fireplace suites."
  ]
 },
 {
  "name": "Headwaters Heritage Museum",
  "address": "Three Forks, MT 59752, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ad9c3994-9330-11ea-841e-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "walking",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=15407093997539657490",
  "source": "GoogleMaps",
  "reviews": [
   "Incredible couple volunteering tonight. Just trying evenings 2 nights a week and hoping people will stop. We were walking by and noticed the open sign. Very knowledgeable! You need to take time to go. I especially loved the upstairs that had little shops set up like stepping back in time.",
   "Great museum with very helpful staff. Lots to see. Very helpful personal.",
   "Well done and interesting. I enjoyed seeing the local artifacts and learning about the area.",
   "Very informative!",
   "Great local heritage and historic representation"
  ]
 },
 {
  "name": "Barrister Bed & Breakfast",
  "address": "416 N Ewing St, Helena, MT 59601, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ade4dbb4-9330-11ea-b506-14b31f159f22.png",
  "tags": [
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=12502662960949633046",
  "source": "GoogleMaps",
  "reviews": [
   "The Barrister is a beautiful, warm and comfortable place to enjoy Helena.  Every room has its own charm and elegance. We ran into some troubled weather on our way from Portland and Beth was so flexible about our arrival time. We very much enjoyed our time chatting with our host, Nick, learning about the history of the Barrister. Definitely a place to return to. Thank you!",
   "Oh my! What a gem for Helena! Beautiful home, immaculate renovations and restorations. Nick, the owner, did a fantastic job. Tons of character! Beth and the other female were just as wonderful. This sets the bar for all B&B's! Breakfast this morning was just amazing! Close to an expensive restaurant in a big city. Nick spent time showing us around, and even chatted with us during breakfast. You can see the three of them are so proud of the home, it beams from them at all times. Great location, close to everything, and views are amazing. Thank you, we WILL be back.",
   "Great 1 night stay!  My husband and I stayed at the Barrister B&B on 8/28 while traveling from Glacier NP to Yellowstone.  We picked a good one!  We stayed in the Morning Room which was adorable and comfortable.  The property is in a great location and we enjoyed walking to the downtown area with many shops and restaurants.  We loved the breakfast - yummy! (thank you, Chris) and mostly enjoyed meeting Nick, Mary and Beth.  We are so glad we chose this property and will definitely stay again if in the area.",
   "A beautiful and comfortable B&B across the street from Helena’s lovely large cathedral only a few minutes drive from the capital building and museum. Wonderful staff make you feel at home.",
   "We spent 2 nights at The Barrister in The Garden room. The room was beautiful with a private bathroom. Offstreet parking was very convenient. Nick and Beth were both readily available to make sure we had anything we needed. The breakfast was fantastic and there were snacks and drinks available 24/7. Great service in a beautiful old world B&B!!!!"
  ]
 },
 {
  "name": "Paris Gibson Square Museum of Art",
  "address": "1400 1st Ave N, Great Falls, MT 59401, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ae32fbf8-9330-11ea-bc59-14b31f159f22.png",
  "tags": [
   "free",
   "unique",
   "family",
   "history",
   "free",
   "art",
   "art",
   "art",
   "free"
  ],
  "link": "https://maps.google.com/?cid=5266654063103895733",
  "source": "GoogleMaps",
  "reviews": [
   "Rotating exhibits. Small but free. The building itself has such a captivating ambiance. (Its actually my favorite building in all of Great Falls.) Gift shop filled with beautiful handcrafted items. A nice spot to kill a bit of time. They have multiple events and classes throughout the year to check out as well.",
   "The Paris Gibson museum is a great place to visit alone, with friends, or family. A very unique experience for lovers of art and history. My family visited the location, and it was very enjoyable. I highly recommend for anyone looking for a fun time. Admission is FREE to the general public, which makes it an even better experience! Also, if you play Pokemon Go, there are 2 gyms, and 3 PokeStops within the museum parking lot! Plus the nest is constantly changing. Highly recommend!",
   "We went to the Champagne, Chefs, and Art fundraiser hosted at the Paris Gibson Square Museum of Art and we had a delightful time. The Square really dressed up the place and they really did a beautiful job. The lighting, the decor, the set up, it was all just done very well.",
   "Beautiful building with amazing art and classes ! I love the way everything is decorated and clean and inspiring! Lovely people!",
   "A very cool spot. Glad we stopped! Plus it's free!!!"
  ]
 },
 {
  "name": "Lucca's",
  "address": "56 N Last Chance Gulch, Helena, MT 59601, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ae976318-9330-11ea-b457-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5350906344227008846",
  "source": "GoogleMaps",
  "reviews": [
   "I’ve been here twice since I’ve been in town and have not been disappointed. It is very comparable to other big cities’ Italian restaurant. The staff was very attentive. Their pasta dishes have been very good. The portions are fairly large and they do not skim on the meat/proteins. Everything is very well seasoned too. I also really like their dipping sauce and butter for the bread that they bring out. \n\nIm looking forward to coming back every time I’m in town.",
   "Personally I just don't see what people get out of Lucca's.  The few times I have been here it has been over priced for what you get and it takes forever to get your food.  The food is good but not amazing to me.  When it costs $25 for a piece of lasagna I would think it would be amazing.  I guess I'm just not cut out for this dining experience but I know a lot of people do enjoy it.  If you have 2 hours to burn this is the place for you.  The staff is great I can say that.  They were all very nice people and very helpful. It just took too long to get your food and in my opinion it wasn't worth the money or the wait.",
   "The food and wine were perfect! Our waitress was so amazing. I recommend this place to anyone looking for good food and wait staff that is amazing. Hard to find in Helena. Way to go guys!",
   "Incredible restaurant. Great experience, fun to visit, and awesome food. Dont miss the Tiramisu!",
   "Very nice romantic feel great for date night definitely recommend the mussels!"
  ]
 },
 {
  "name": "On Broadway",
  "address": "106 E Broadway St, Helena, MT 59601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/aed66810-9330-11ea-8527-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "drink",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=101925946196653098",
  "source": "GoogleMaps",
  "reviews": [
   "Great food. We showed up at 5:15 on a Thursday and we were seated right away. No children's menu but they provide rolls right away that entertained my kids. Nice cocktails at a reasonable price. They had a Thai peanut chicken appetizer that was really good.",
   "One of our favorite places for date night. They don’t take reservations, so if you are going on a weekend night, don’t be in a hurry if you want to enjoy the experience. Grab a drink at the bar and have a good time while you wait. Food is fantastic and atmosphere is top notch. They make great drinks and have a good wine list. The creamy Parmesan salad dressing is my favorite dressing of all time.",
   "Do you like to have happy times? Happy times are served here. No matter who you are you're likely to feel right at home here with quality food and genuinely kind people. Check out the wine list, check out the salmon, don't over think it. Did you have a terrible day at work? This place washes the patriarchy away. Give it a try, it's worth it",
   "Our evening at On Broadway was the most perfect dining out experience my husband and I have ever enjoyed. These people are Pros! From our hostess who's name we didn't catch to the bar tender (Adam) and our server (Ellie), the entire experience was fantastic. I thoroughly enjoyed watching the Chefs work from my seat upstairs, very well run kitchen. Superb food,, just the whole package!!",
   "Nice atmosphere. There was a live band playing the night that I was there. The band volume was reasonable, we were able to have conversations without shouting. The restaurant was packed, we got there at 5:30 on a Wednesday and had to wait 45 minutes for a table for five. The menu had a good variety of items. Every one at my table was very satisfied with their dinner. We also split some appetizers (artichoke & variety plate) both were very good. We will return."
  ]
 },
 {
  "name": "Cafe Zydeco",
  "address": "625 Euclid Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/af1a2818-9330-11ea-b9c9-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7038219070091300020",
  "source": "GoogleMaps",
  "reviews": [
   "I enjoyed my first meal here! Tried the chicken gumbo and half of the All That Jazz Po' Boy. The sandwich was served at a room-like temperature but was still really good. I also had hushpuppies. I left full. It was all good flavors, nice staff, and a unique decor, so I will definitely be back! ^_^",
   "I had the Catfish Cajun Taco. It was more like a burrito, which is fine with me. Very flavorful food & next time I want a burrito I'll go here. The ladies working there were great. I was happy they offer fried okra.",
   "Interesting and friendly. Had bunches of posters with interesting sayings. Food was good. Everyone there seemed happy and content.",
   "Hands down one of the best lunch places in this town. The food is full of life and flavor. The service is friendly, and the atmosphere is clean. I usually get orders to go from here and I love the way they package my orders with care. I wish they were open for dinner!",
   "They have some great combo meals now. Stop in and check them out. I had the Bayou Po boy and seafood gumbo today. So good!"
  ]
 },
 {
  "name": "El Vaquero Taqueria",
  "address": "1338 11th Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/af6d2a42-9330-11ea-8b85-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9475597453471097248",
  "source": "GoogleMaps",
  "reviews": [
   "Went here today with some friends who visit a lot. I'd never been nor heard of this establishment until today. The food is absolutely delicious,  and Is served out quickly. This is not a dine in establishment, but the food is made right before your eyes and the taste of homemade Mexican food cannot be beat.",
   "This is a gem in Helena that I recently discovered. I had the carnitas street tacos and they were to die for. I can't wait to try other things on the menu. The only negative I can think of is that there's absolutely no indoor seating and is very crowded inside when ordering during peak lunch time. They do have great outdoor seating if it's nice outside though.",
   "The BEST. My girlfriend and I come from missoula sometimes just to come here. Will never forget our burrito dates.",
   "If it's supposed to be super authentic Mexican food than it was fine. Although even though it was good, it was a bit unflavorful. I don't need to go back....🤷",
   "Great food, good service, and an all-around good atmosphere. I always stop for lunch ."
  ]
 },
 {
  "name": "Bullman's | Wood Fired Pizza",
  "address": "1130 Helena Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/afbd6d58-9330-11ea-bc50-14b31f159f22.png",
  "tags": [
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=61393695469854901",
  "source": "GoogleMaps",
  "reviews": [
   "I liked the experience but it wasn't a 5.5 star experience.\nThe food was good but the asiago and garlic had no real flavor. The culture and atmosphere was fantastic. But it feels weird that the kitchen and the windows seem like someone installed the building backwards. With that said, the patio looks cozy and quiet due to its location at the back of the building, albeit a bit dirty.\n\nThe wait staff and people were great, I'd come back for that alone.\n\nFour stars is kinda generous, but 3 stars is way too little.",
   "This was the best pepperoni pizza I've ever had. Definitely coming back.",
   "All I can say is wow! Best dang pizza ever! Not like pizza hut or those nasty name brand places. I was gold mining last year out there on the Discovery Channel and we all fell in love with this place. Kid friendly all the way.",
   "More and more the pizza has burt bits attached or the crust is scorched. I love wood fired pizza and have eaten it from coast to coast. I think more care needs to happen in the oven. I love their thin crust, their sauce, the balance of cheese with all ingredients. They have some of the best specialty pizzas and you can split a pie for variety; you can build your own. The apple walnut salad with choice of dressing is one of the best in town. Staff was polite and attentive this visit. I do wish the would have some seltzers, Pellegrino and fruit seltzers by bottle or can. NO TV is a marvelous feature.",
   "My first time at Bullman's was amazing. This place knows how to do pizza and they do it well. It's a very cozy 11 table building, but the amount of take out orders they did while we were waiting was crazy. I had the Glacier which has pepperoni, Canadian bacon, bacon, jalapeños, vreen peppers, and pineapple. It was great. I wanted to eat the whole thing but I restrained myself.\n\nOn top of the fantastic pizza, the waitresses were also awesome. Super friendly, made sure our drinks were good, and made sure we didn't burn ourselves on our pizzas when they came out. \n\nWe'll be coming back to Helena just for this pizza again."
  ]
 },
 {
  "name": "Shellies Country Cafe",
  "address": "3122 US-12, Helena, MT 59601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b00852dc-9330-11ea-be08-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13624274463816033167",
  "source": "GoogleMaps",
  "reviews": [
   "I got their \"Holy cow chicken fried steak\" dinner and I 110% understand why they call it that. The plate it came on was the size of the hood of my car. The chicken fried steak was HUGE and came with mashed potatoes and corn as well as chicken & dumpling soup (The soup was also absolutely amazing 'just like mom used to make' )  the meal was easily two meals. It was delicious and I'll definitely return. They also had a large selection of pies and desserts which all looked and sounded amazing. I HIGHLY suggest you check this place out. It's also a truck stop so truckers stop on in. It's more than worth it. Quality+quantity. 11/10",
   "Just plain good food! I ordered tomato soup in a bread bowl, which was obviously homemade with chunks of tomatoes and cream, in a crusty sourdough bun. Hubby loved his burger! The strawberry rhubarb pie with huckleberry ice cream was memorably delicious! Service was friendly and efficient. Price was reasonable. Only 4 stars...? Should probably be five... But the noise level was a bit too high for comfort.",
   "What a gem tucked away in this little town. Had the Friday special tuna sandwich and best clam chowder I ever had. Service was fast and friendly. The place was busy and filled with locals. If you are in the area, I recommend you stop in.",
   "Stopped in for coffee and PIE and Shellies did not disappoint!!💯 The PIE was AMAZING 😍 There was four of us and we all ordered something different (then taste tested them all). We tried the banana cream, the German chocolate, the peanut butter chocolate & the butterscotch. They were BIG 🥧slices too😁 The pies are homemade and they have a huge selection to choose from. I could have taken a piece of each one to go...lol. The coffee was hot fresh and tasty as well!!",
   "Holy Cow!  Seriously, the menu includes the Holy Cow section where portions are as big as yur head and there several pie flavors to choose from...  open 24hrs it's great for earlier mornings and late nights."
  ]
 },
 {
  "name": "Mediterranean Grill",
  "address": "42 S Park Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b04e5cd0-9330-11ea-b0fa-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=27290017512123608",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing! Great service, food and wine list!! Went with my dad while visiting Helena.  We had a great time. The food came with tons of vegetables which was a bonus. The salmon was cooked perfectly and tasted delicious. The swordfish was also cooked perfect. Nice and tender and not overcooked.  I would come back here again.",
   "I got the lamb chops and matcha tea creme brulee and they were both very yummy! I like my lamb medium, and it was slightly medium rare, but it wasn’t too bad. \n\nStaff was friendly. Atmosphere is good.\n\nMy second time eating food from here was through delivery. I ordered the lamb chop again and it was cooked super rare. I called and the chef spoke to me and after seeing pictures, agreed to remake my order. Soon after, the owner called me to make sure I was satisfied with how it was handled. \nEven after this mistake, I will definitely come here again based on the customer service!!! The food is amazing too!",
   "Very beautiful food. Good beer. More than friendly staff. \n\nSome of the food I couldn't pronounce but I'm sure it's amazing. \n\nWould recommend to other people and people who are more cultured than I am. \n\nChairs are not American sized. I'm balancing on a single cheek. Worth it.",
   "Wow! Who would have thought that such traditional  Mediterranean food in Helena.  Stuffed grape leaves are as good, or better than being in Greece.",
   "Anyone traveling through Helena should make this a destination, not to be passed by. These folks know how to prepare and present food. Flavors are authentic to their name."
  ]
 },
 {
  "name": "Nagoya | Japanese Steakhouse & Sushi",
  "address": "2790 Washington St, Helena, MT 59602, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b0a281c0-9330-11ea-b7b2-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15348531997736811947",
  "source": "GoogleMaps",
  "reviews": [
   "Great take out, i would say the hibachi portions seems slightly more generous if your looking for more. The other Japanese dishes we got tasted perfect. Maybe too much onion on the bottom of the teriyaki chicken, in the take home box on the way home it just really baked that onion on the bottom DEEP into the chicken. The dynamite roll was amazing!  Thank you for picking up the phone right away!! First time trying the restaurant, wished it was in person! Will order again!",
   "I always love this type of place. Good show as always. Everything was cooked perfectly. The dressing on the salad was unique flavor compared to other places. Good veggies. We tried a couple of sushi as well. I loved the veggie one.",
   "It’s a decent spot for Japanese food. It’s quite expensive for an average quality of food, even though they advertised it as “finest and freshest ingredients”, this is plainly not true because the fish were frozen (still tasted frozen in sashimi and nigiris), knowing that’s it’s impossible to get fresh fish such as tuna or oysters around here. A platter of oysters were $10 for four tiny pieces. We also got a chicken teriyaki that came out over cooked and dried, which was very disappointing. Despite this, I understand that it’s not easy to get fresh ingredients here so I still enjoyed my time at Nagoya because I acknowledged that there’s not many Asian restaurants around here. The servers were super friendly and accommodating, but I think the hostess needs to check her attitude because we did not feel welcomed when we entered the restaurant. She didn’t even look at us and immediately said “follow me” without “please or thank you”... and no smiles! Of course I didn’t come here for service, but it would be nice to have a good atmosphere for the dining experience.",
   "The best thing about this restaurant is the side where the chefs provide a stunning show as they prepare our meals on a huge grill in front of us.  Highly skilled chefs.  Food was wonderful.   I found the other side of the restaurant's atmosphere where the tables and booths are less spectacular.",
   "This place is always consistent. The food has so many wonderful flavors! Service is always impressive and attentive. The hibachi grill is a great experience for any age. So unique since we have nothing else like it in Helena."
  ]
 },
 {
  "name": "Ristorante Bella Roma",
  "address": "22 N Last Chance Gulch, Helena, MT 59601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b0eb2324-9330-11ea-b65b-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "music",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17335523542866979584",
  "source": "GoogleMaps",
  "reviews": [
   "My girlfriend and I split a four course meal. Overall, I really enjoyed the meal, although there wasn't quite as much to eat as advertised, so the two of us ended up being only mostly full.\n\nThe quality of the food was good and the presentation was great. If you're going to split a four course meal and you've got an appetite, of recommend splitting a four course meal and tacking another salad on the side.",
   "Magnificent food,  wonderful cocktails,  professional staff beautiful environment, lovely murals on all the walls,  gentle music.  It would be a fantastic place to bring a very special date,  celebrate an anniversary or treat yourself to high quality 5 star cuisine.  You get a traditional Italian 4 course meal starting at $50 or can pick and choose your  meal selections instead. For all that you get i firmly recommend the 4 course, we found  it's more value for dollar. I also highly recommend the cocktails, they were absolutely perfect.  I did not try the large wine selection yet but i plan to,  the menu also gives food pairing with wine suggestions,  i found that to be helpful if you aren't as familiar with wine like myself.",
   "Delicious, authentic, lots of food! Honestly exceeded my expectations. The waiter was very friendly, prompt, and helpful recommendations.",
   "The place is way overpriced and not accommodating at all. My fiancé loves authentic Italian but I’m more of a simple chicken and pasta type. We went in thinking they would have a bit of a variety, or at least an option for those who don’t like eggs in their spaghetti, but no. Don’t go unless you’re both huge fans of overpriced “authentic” Italian. We ended up leaving right after sitting down.",
   "We enjoyed a delicious four course meal here and loved every bite. The desserts were amazing. The espresso was fabulous. That's a big deal in my book-lots of bad espresso out there. \n\nThey recently enhanced the interior, which is a lovely change from the austere atmosphere of past iterations.\n\nThe chef clearly knows food and has a gift for interesting combinations. Helena needed this. And I love it that you can sit outside on a patio away from car traffic. \n\nGoing back immediately."
  ]
 },
 {
  "name": "Brewhouse",
  "address": "939 Getchell St, Helena, MT 59601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b12d5c68-9330-11ea-9330-14b31f159f22.png",
  "tags": [
   "food",
   "kids",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12707126282715131455",
  "source": "GoogleMaps",
  "reviews": [
   "This was one of my first meals in Helena! They have great beer cheese soup and coconut onion rings! I also enjoyed the IPA I tried. Note: people either love or hate the beer cheese soup but I really liked it.",
   "The Brewhouse is a stop for us every time we come to Helena.  They have a great selection of beers and ciders, food is great (can be a bit pricey though), and the service is always very good.  Waitstaff work well as a team and servers are very attentive.  My favorite is the sweet potato fries and the onion rings as well as the black and blue burger paired with the Miner's Gold.",
   "Great lunch and fast service at the upstairs side. I had a burger with bacon added and it tasted amazing. The meat Patty was slightly too thick to be perfect though. The side salad was good, I was very happy to see no cheese on it. The kids meals were a good size.",
   "Food was well worth it! Mac and cheese and cheese curds are delicious!",
   "The Buffalo chicken sandwich wasn’t bad but the pizza 🍕 was awful. My buddy got the pizza. The beer 🍻 was good tho. 3 stars ⭐️ all the way"
  ]
 },
 {
  "name": "Windbag Saloon & Grill",
  "address": "19 S Last Chance Gulch St, Helena, MT 59601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b1756962-9330-11ea-85a5-14b31f159f22.png",
  "tags": [
   "delicious",
   "historic",
   "food",
   "free",
   "food",
   "walking",
   "drink",
   "food",
   "kids",
   "food",
   "delicious",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=8392123116004629825",
  "source": "GoogleMaps",
  "reviews": [
   "Historic setting that about a year ago was completely remodeled. Still very genuine and authentic feel AND delicious food. Also good selection of Montana beers. I had the fish and chips which were delicious.. and even better when I spotted the malt vinegar. My lovely bride had the philly burger special and said it too, was delicious. The Windbag remains on the list of top local, (non chain or franchise) eateries.",
   "I've been here a couple times and have been impressed each time! They have a great selection of beers, an awesome atmosphere, and really great food options. Pictured is the pretzel, but the wings were great too. I also love that they have a different special for each day of the week. It is located on a neat car free, walking area in downtown Helena!",
   "We were able to seat ourselves rather quickly. Our waitress arrived with menus and took our drink order. Drinks arrived and placed out order. My salad arrived ask the gal that brought the salad for silverware; my wife asked her if they had sweet and low. She did not know but would ask. She never came back. Finally our waitress showed up. Got silverware, sweet and low. Food arrived from same gal as previous. Ask her if our daughter could get a refill. She said yes, but never returned. Waitress arrived and got refill. \n\nRecommendation is to have support staff take ownership or work with wait staff to address customer issues or assistance.\n\nBesides that the food was great. I had the Mac n cheese burger, my wife had the BLT and my daughter had the original Mac and cheese. She said it was very good. My burger was still hot after I ate my salad. I thought I may have waited too long. We also ordered the funnel fries. Nice sweet and tasty desert.",
   "We came to Helena for a quick trip & the Windbag was recommend to us. Hands down one of the best restaurants I've been to. Everyone that was working was very friendly & helpful. We loved that there were so many choices. They also had a great kids menu. We love the ambiance of the restuarant & their prices are worth the amount of amazing food you get. They also have a wide variety of specialty drinks & handcrafted beers. Definitely a must if you are in Helena, MT",
   "Had a great experience at Windbag Saloon! The drink specials are quite unbelievable. I had a $5 Moscow mule that was absolutely delicious. Then during happy hour I was informed all pints of draft beer are only $2.50...unheard of. Nick the bartender was very kind and provided excellent service. Would recommend this place to anyone! Thanks"
  ]
 },
 {
  "name": "Benny's Bistro",
  "address": "108 E 6th Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b1cdf064-9330-11ea-92d5-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=15072358789117233201",
  "source": "GoogleMaps",
  "reviews": [
   "Benny's Bistro is easily my favorite restaurant in Helena! I go there almost every week and am greeted with smiling faces and exceptional customer service. Every one of the employees do their absolute best to ensure the customer has a wonderful experience and this results in the most pleasant dining experience Helena has to offer! Every item is house made and always blows away my expectations. I applaud Eric, Hillary, Nash, and Zack for making every visit better than the last!",
   "Benny's is the best. Simply put. I've been visiting this establishment since I was young girl. Memories of family gatherings, celebrations, birthdays; etc are all held within those walls..Beside the nostalgia, the service, food, and atmosphere is amazing. Love it here. Love the owners, love it all. 💓 \n\nPS. Best tomato soup in town!",
   "Had lunch there with my mom yesterday. I had the Thai Curry chicken which was good and she had the Montana Rancher sandwich. The sandwich was cold. And not just cold as in a cold cut sandwich, but as if it was pulled out of a cooler and mildly thawed. The bread was nearly frozen, tomatoes and lettuce were frozen and all of that was covered in a lot of mayonnaise. It should not have come out of the kitchen at all. Really disappointed that they served something like that. Doesn’t seem that they take any pride in their meals.\nI’ve always had this issue with Benny’s- they’re never consistent with the quality of food they serve. It’s been a while since I’ve been there and I had hoped that changed but clearly it did not.",
   "Always a wonderful experience here at Benny's!\nAlthough, one time they ran out of the Walleye special really early one evening, it still has some of the best & freshest food around.\nGreat, friendly servers and cool, lite live music adds to the ambiance. \nA must if visiting Helena!",
   "Had the Creole \"Brick\" Chicken. It was very good. Could have been a little more spicier since it was advertised as having \"creole seasoning\". Enjoyed the Chocolate Ganache Tart for dessert. Very nice atmosphere. Lovely local place. Will be back for sure!"
  ]
 },
 {
  "name": "Steve's Cafe",
  "address": "630 N Montana Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b2211980-9330-11ea-abad-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5300219083746700566",
  "source": "GoogleMaps",
  "reviews": [
   "Can anyone say enough great things about this absolutely wonderful restaurant! The menu goes on and on or create your own . So many homemade items you'll be amazed ! Everyone of the staff is always cheerful and they make your experience worth going over and over again ! Don't miss out on stopping at either of their two locations !",
   "OMG THIS PLACE WAS GREAT! I had the pleasure of indulging the taco omelet. The staff was good, the service was....they offered me a cup of coffee while waiting to be seated. Grade A on customer service for that alone. Add that to fact that the waitress was on point,  I'll  be back",
   "Excellent food. We had two littles with us so they put us off to the side. They put a paper under the high chair to make cleaning the floor esaier, which was a great idea. All of us enjoyed the food. Can't wait to come back. They had a infant seat in the bathroom which is great.",
   "I was looking for a local Helena restaurant for breakfast before leaving Montana and happened upon Steve's Cafe. I tried the shrimp omelette with hash browns and berry pancakes. It was a large serving, so i couldn't finish everything. I was not disappointed. Food was delicious. Service was good, staff were friendly, and prices not too high. Great coffee! I really enjoyed the authentic diner ambiance. I would definitely stop again for a good breakfast and try something else. I recommend eating here for breakfast.",
   "Homemade corned beef hash was amazing. Super clean inside, and easy to find the restaurant too. The service was great, all the staff was super polite, super attentive, and very prompt. The food came moments after ordering, really fast service. Everything was cooked perfect, but the ham in my wife's omelette needed to be cut into smaller pieces. That was our only complaint and I'd hate to call it a complaint because our experience was wonderful and we'll always eat breakfast here anytime we're in Helena."
  ]
 },
 {
  "name": "Melaque Mexican Restaurant",
  "address": "1827 Prospect Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b269947a-9330-11ea-af6e-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13398682175479701383",
  "source": "GoogleMaps",
  "reviews": [
   "Tried a combo plate and it was good, better than two of the other places I tried in town. They do have good refried beans and rice, better than most places that serve that sort of side. They have really strong margaritas! I had to wait around a bit after only drinking one before I could drive home. 🤣 the staff were very nice to me as well. Cute decor.",
   "After eating at Fiesta Mexicana the night before, we decided to try Melaque, glad we did as it was great.  Waitstaff worked well as a team, our server was attentive, took our order in a timely manner, made sure chips and salsa were full as well as drinks, and our food was great and served very quickly as well even though the restaurant was completely full (people were actually waiting for tables to open up).  Great job!",
   "Love this place! The food is good can’t really go wrong with anything. I recommend the Melaque Burrito and the tamales. The only negative is that it’s pretty small and can wait for a table for a while sometimes.",
   "Great service and consistent quality! There are very few places in Helena and Montana for good or close to authentic Mexican cuisine, this place is not too bad. Some of the traditional dishes have been adjusted because locals don't necessarily like some dishes, so it has been altered to fit the local tastes which is primarily Caucasian.",
   "Instead of simmering sauce to proper consistency. They do not season and add corn starch.  Despicable.  Never again.  called to confirm the cornstarch. Yep. No effort. Lazy cooks.  Save yourself."
  ]
 },
 {
  "name": "Silver Star Steak Company",
  "address": "833 Great Northern Blvd, Helena, MT 59601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b2b347ca-9330-11ea-805c-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14311981139660183593",
  "source": "GoogleMaps",
  "reviews": [
   "Great service and fabulous food.  Silver Star makes the best Dirty Martini in town.  Their bar menu is superb.   The muscles are served in a jalapeno butter sauce that is just scrumptious.   My husband is a fan of the lettuce wraps. My daughter loves the calamari.  And the desserts!  The bread pudding is a must and the Tuxedo cake is my favorite.",
   "Their bison burger is delicious! They also have a great cocktail menu and nice staff. I can't wait to go back and have another meal! 😍",
   "We ate dinner in the lounge at happy hour on a monday. We were able to order off the happy hour menu, lounge menu and main dinner menu. We got the steak tips and raviolis off the happy hour menu. They had run out of the potatoes. The steak tips were very salty but the ravioli was great. Also tried onion rings that were really good. I had the steak and lovely mashed potatoes. My husband has the bison burger which was huge. The special happy hour cocktail was a cranberry apple that I enjoyed. Service was really good. Did slow down a bit at the end when they started getting busy.",
   "We just sat at one of the tables in the bar and ordered from the menu there. The food and drinks are great and I was able to order exactly what I wanted. My waitress was extremely professional, kind and friendly. Ther kind you don't get much anymore. I had a good time.",
   "Understated Montana elegance with a superb menu. Seafood, steaks, pasta, and great cocktails; Silver Star is a destination spot to relax and enjoy a delightful dinner with friends. One of Helena's finest establishments, but come casual and fit right in."
  ]
 },
 {
  "name": "Bad Betty's Barbecue",
  "address": "812 Front St, Helena, MT 59601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b306f162-9330-11ea-b2e9-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "free",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2715625122633740299",
  "source": "GoogleMaps",
  "reviews": [
   "Great service, awesome food. We went on a Wednesday and got the briket special. Was fairly busy for lunch but still got our food quick. Two meals was enough for two adults and two toddlers.  We were given a couple of fidget spinners that made my toddlers day. Loved the Mac and cheese",
   "Want honest to goodness good smoky barbecue? THIS is the place you're looking for! Though the orders can sometimes be slow coming out of the kitchen, the food is worth the wait. This is among my Top 5 Cue Joints in the U.S. Repeat trips are authorized and encouraged.",
   "Just plain good eatin. You can't mess up slow cooked meat and when presented in a laid back, inviting environment what's not to love? The only problem is their business hours. I almost never get to enjoy this establishment because they're always closed when I try. 🥺",
   "Third time visiting Bad Betty's. Pretty tasty barbeque but it's the slaw and tater salad I really enjoy. Only have two wishes... First, two to three types of BBQ sauce would be awesome. Their sauce is good, but looking for more of a sweet BBQ style (picky what can I say). The second would be tater tots. Being gluten free I can't do their sandwiches but putting BBQ on tots with slaw is an awesome alternative and a great side! \n\nHowever, good overall! A place that I recommend to eat at when in Helena.",
   "Awesome BBQ, as usual. This place never disappoints. Good food. Good service. Usually get a seat in 5 min or less. Down to earth good food. I'll be back."
  ]
 },
 {
  "name": "MacKenzie River Pizza Co.",
  "address": "1110 Rd Runner St, Helena, MT 59602, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b34b74a6-9330-11ea-9060-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "eat",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=14933403490572542925",
  "source": "GoogleMaps",
  "reviews": [
   "Great meal. My husband and toddlers loved the pizza. And I loved the pasta. Nice kids menu. Fast service.",
   "Good service, good food, good quality and nice atmosphere. My only complaint is the chairs, while quaint, they are extremely uncomfortable. Other than that, there's a great menu selection. And everything we ordered came out fast, hot, and tasted great. Reasonable prices.",
   "Take a look at a $12+ Ruben Sandwich that was delivered to me. Where’s the Corned Beef?",
   "We usually get great service and food when ordering to go. The last two times has not gone so well. The first time they made our pizza incorrect. Last night we order 2 sandwiches with a wait time of 30 minutes. There is only one sandwich ready when we come to pick the order up. It has been done awhile as it was soggy and cold by the time we got home. The second sandwich was bbq that wad so watery that the bread was mush. You couldn't even eat the sandwich it was that wet. Neither sandwich was eaten and to top it off, it was no big deal to the staff that the order was not complete in 30 minutes for 2 lousy sandwiches. We wont be back.",
   "The kitchen manager Bryan is awesome!! Love the atmosphere here. The take out is always really good too, the salads and pastas are soooo delicious"
  ]
 },
 {
  "name": "Taco Del Sol",
  "address": "21 N Last Chance Gulch #103, Helena, MT 59601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b3a15d0c-9330-11ea-aa29-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11197731677192818318",
  "source": "GoogleMaps",
  "reviews": [
   "Really great service and very nice people. The food was awesome and the price was petty good for what I got. The place was nice and clean no sticky stuff on the floor or tables.",
   "Large burritos and large tacos. Great location to sit and eat or take it with you. Quick service.",
   "This place is absolutely amazing in my opinion best mexican place in Helena. They have amazing food with delicious flavors. I've never been disappointed and they have absolutely amazing vegan and vegetarian options",
   "Nothing bad about the place, but i found the food to be very mediocre. Friendly staff though.",
   "Love their tacos. Get a shrimp taco and a Barbacoa - you can thank me later."
  ]
 },
 {
  "name": "Perkins Restaurant & Bakery",
  "address": "1803 Cedar St, Helena, MT 59601, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b3e65ac0-9330-11ea-841f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "family",
   "food",
   "family",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14409576271555542968",
  "source": "GoogleMaps",
  "reviews": [
   "I enjoy the atmosphere, staff and of course the food. I was pleased when they served fresh fruit. The breakfast potatoes were just right. The strawberry crepes were delicious.",
   "Our dinner was very tasty! We had excellent service. Our waitress was courteous and attentive without being overbearing which is always appreciated. We were there to celebrate with family for a wedding from that afternoon. We had a variety of foods from breakfast, lunch and dinner items. Everyone was pleased with their food. Steaks were cooked just right, condiments were asked about, and refills were given appropriately. They were nice enough to be ok with the wedding cake we brought in beings that they have many desserts but no cake. Had they had it we would have gotten it from them. They were awesome enough to bring out a pie/cake server along with plates and new forks and napkins. Thank you Perkins! You were awesome!!",
   "Located in the same parking lot of the hotel I'm staying at. You get a discount if you show your room key. Great place to eat at. Fantastic food great prices great for the family",
   "I like Perkins and usually I get the good meal I hoping for~ sadly I've been disappointed but only maybe 2 times...mostly I've been very happy with my order but I doubt I will order the Eggs Benedict again unless they have a new cook, which they most likely do by now...the sauce was wrong...thick, stiff and very little...but no place gets it right 100% of the time...and that certainly hasn't stopped me from going there...my friend and I really enjoy Perkins...the regular menu as well as the senior one...the service is good, the atmosphere too...it's clean, including the ladies room (love that) and the prices are good as well...so I give Perkins 4 stars only because it couldn't give it 4.5...",
   "I have the Meatloaf it was the best I had ever gotten in a restuarant. Staff is excellent.  As usually we always have a great experience.  My go to restaurant. Thank you"
  ]
 },
 {
  "name": "Pizza Ranch",
  "address": "3200 N Sanders St, Helena, MT 59602, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b42c64ae-9330-11ea-819e-14b31f159f22.png",
  "tags": [
   "delicious",
   "foodie",
   "eat",
   "food",
   "food",
   "eat",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=10297862765239065170",
  "source": "GoogleMaps",
  "reviews": [
   "I'm from out of town,  was pleasantly surprised on how much variety of pizza, chicken and salads and pizza desserts...staff were friendly and helpful! Will definitely come back when I'm in the area again and again. Our grandson love the fun zone. Thank you ❤",
   "Best place to eat in Helena! \n\nI've been a long time Pizza Ranch fan from the Butte location. For the opening day the service was fantastic, the food was delicious and the prices are extremely good value! I would recommend this to any local foodie! \n\nThey custom order pizza, they deliver, and always have fresh pizza and chicken available!",
   "On 2/12/2020 we stopped in for lunch. Normally the ranch is great. This time the chicken was over cooked and the breast dry. I asked the attendant if they had other breasts. He stated they had just put out fresh chicken which was false. He did say he would check and never came back. Not only was the skin toasted dark brown there was to much oil under it. The salad bar had mushy spinach in it.  This was the first time I had been disappointed. Still quality control is necessary for customers to have a good meal.",
   "Best fried chicken in Helena. Some of the food is better than most restaurants in Helena, but you'll get plenty of of it. Nice staff. If your hungry, this place is for you. I think PR is three steps above fast food.",
   "This establishment is convenient and fun for both adults and children. The large TV screens with video make it so that adults can continue to enjoy their meals while keeping an eye on their playing children in the arcade. They also have large rooms setup that can be reserved for bday parties. They have excellent pizza, and even offer chicken, mashed potatoes, a well stocked salad bar with many options for topping, soup, ice cream machine, and desserts. Affordable, all you can eat, and custom made pizzas to order. My only complaint is I have been here multiple times where they have run low on food items or the bar has been out and refill has been slow, especially on the dessert bar. Staff is always friendly and helpful."
  ]
 },
 {
  "name": "R-B Drive-In",
  "address": "932 Helena Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b4729a74-9330-11ea-87ee-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "delicious",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=18102356683546911350",
  "source": "GoogleMaps",
  "reviews": [
   "I have been here before and always had great food and service. Tonight I waited 45 minutes then went to tell them after people who arrived after me were getting their food. They had lost my order. The woman who owns it was apologetic and offered to make the food at no charge. I agreed. She brought our food and left. We open the burgers are wrong, and the worst part is the fries and tots were simply not done and dripping in grease. Oh and we had a free fish sandwich thrown in literally burned black on one side.",
   "halibut fish and chips with their sauce...just as good as I remember from my childhood.",
   "Love it. The food was delicious as always and was fast and affordable. Can't wait to go back",
   "Nevermind In'nout... Awesome burgers.",
   "Great staff, and the burgers I remember from years ago!"
  ]
 },
 {
  "name": "Nosh Cafe",
  "address": "105 6th Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b4b76d5c-9330-11ea-ada7-14b31f159f22.png",
  "tags": [
   "kids",
   "eat",
   "food",
   "eat",
   "eat",
   "food",
   "food",
   "affordable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15919806292302291931",
  "source": "GoogleMaps",
  "reviews": [
   "Great food. I really enjoyed the chicken and waffles.  My husband got a waffle as well that he enjoyed. Got the toddler the biscuit which was yummy. I could just eat a basketful of them. I would love to see some smaller portions options for the kids but the food was fresh and great.",
   "I've eaten at Nosh more times than I care to admit this last year! I've never had a bad dish, but the BLT Waffle, Egg-in-a-hole and Chicken and Waffles are my favorites. Whatever you do, ASK FOR GREEN GODDESS DRESSING with/on it. It's the best dressing I've ever tasted... I could literally eat it by the spoonful.",
   "Phenomenal food! Wish I was staying longer so I could eat here every day. Had the egg in a hole and the flavors were amazing.",
   "Very yummy food. Good atmosphere and location. Also super affordable! I enjoy how they have healthy options but also comfort food. I only wish they had acai bowls and espresso and this place would be perfect!!",
   "I have enjoyed the food here quite a bit.  But after the last few visits, I'm not as excited to go. \n-Needs to be detail cleaned, badly.  Dusting isn't an issue, until it blows on a guests food.  The entire store needs some serious love.  \n-Smiling :) We had a young highschool girl work there for a few weeks, and it was amazing what she brought to the atmosphere.  I would encourage a better effort to show the guests a positive response - not that I'm an inconvenience for coming back 😣 which is the general vibe I get.\n- and dear LORD!!! Move the ironing table with the sides!!! Me and damn near everyone else trips on that blasted table!!!!"
  ]
 },
 {
  "name": "Planet Gyros",
  "address": "1421 11th Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b4fd9cac-9330-11ea-b392-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12939016805792628178",
  "source": "GoogleMaps",
  "reviews": [
   "So I just stopped cause I was hungry. Unfortunately they were out of soup so I was disappointed and was gonna leave but decided to order the original Gyro. It was good and satisfied my hunger. The staff was friendly and helpful. I recommend eating there.  It fit my standard--cheap and reliable...sure wish they had some soup...",
   "Great Gyros, Best in Helena! Had to give four stars because I was running late and called in my order, when I arrived they were not busy and had not started my order making me even later.  I will be back because they do have great Gyros!",
   "We love this place.  Always delicious food.  Definitely once of our favorite lunch spots in Helena!  They are fast too which is awesome!",
   "I've tried several gyros places around the states, and they always leave me missing Planet Gyros. Planet Gyros has the best gyros! 👁️❤️🌎🥙",
   "Friendly service...greeted as soon as we entered. Super quick to have the food ready and out to the table, and it was delicious as usual!"
  ]
 },
 {
  "name": "LaPa Grill",
  "address": "32 W 6th Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b54135a2-9330-11ea-bf6e-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=8715687920197527323",
  "source": "GoogleMaps",
  "reviews": [
   "I used to love this place because of the fresh ingredients. The ingredients are still great, but the last 3 times they have gotten my order wrong. Mind you, this was ordered as is from their menu, no substitutions. Once the order was to stay, so it was no problem getting the correct one. The staff was great about making a new one. The 2 times I took it home & it would have been a pain taking it back to the restaurant. This last wrong order was nothing like what I ordered, it actually was the worst burrito I've ever had. I would probably only go back for chips and salsa. Their hot salsa is really good. Their beer selection is also really good.",
   "Good food. Typical American Mexican food. We tried the chips, tacos and burritos. You definitely get the most flavor and most food with the burritos. Nice quick lunch. Nice selection of beer to have as well as a few games to play. Nice place to sit and hang out for awhile.",
   "Wonderful local fast casual food. They have a bunch of options on the menu or you can make your own. Salads, bowls, burritos and tacos that are all easy to customize. The service was great and everything was tasty.",
   "The food tasted good and the staff was friendly. I asked for black beans and was given pinto beans and wanted guacamole but it was brown :( I would try again because my family really enjoys eating here!",
   "I had the nachos and they were delicious! Love the atmosphere and vibe. The artwork is phenomenal!"
  ]
 },
 {
  "name": "Toi's Thai",
  "address": "423 N Last Chance Gulch, Helena, MT 59601, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b581e83e-9330-11ea-a6c8-14b31f159f22.png",
  "tags": [
   "food",
   "kids",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2275968364850659643",
  "source": "GoogleMaps",
  "reviews": [
   "I ordered the Pad Nar and waited 45 minutes before leaving. I was the only customer in the restaurant when I ordered, and the watched new customers served their appetizers before I even got a water refill. I have had great Thai food here before, but the poor the reviews about the new ownership must be true. If you can order to go, and can spare an hour, then this is a great choice. But the waiter, and his fedora, were overwhelmed by 5pm on a Friday.",
   "Great food. We came in for lunch right at noon. Only one person working so he cooked and waited on us. He did great. Lots of food. My kids loved the plain kids noodles. I did feel that all the food had the same base including the pad Thai which made it taste different than normal. Still good just different.",
   "I love this place hey Sam it’s me kk love y’all we y’all soon can’t wait to see you guys and eat some spring rolls",
   "Called at 545 for a pickup order of 2 items, they said to come in at 630. I sat from 630-7 waiting for my food, fairly certain they forgot until I came in. The Tom kha gai soup was excellent! But the veggie pad Thai had zero flavor... Ended up chucking half of it. Super disappointing all around, other than the tasty soup.",
   "This little place has come along way. Curries are great but the Thai Spaghetti is my families FAV! Always worth the wait!"
  ]
 },
 {
  "name": "The Montana Club",
  "address": "24 W 6th Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b5ce0ca8-9330-11ea-93c8-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "history",
   "food",
   "drink",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9888041329992972072",
  "source": "GoogleMaps",
  "reviews": [
   "Christine our server was ABSOLUTELY AMAZING!!! she went over and beyond to make sure we had the full experience. She is very knowledgeable on the history! The food was amazing we even had dessert. We will def be back! (Pricing was right on point)",
   "Very cool old historical location.  Great place to grab a drink after work.  The Bourbon selection is fantastic!  While you are there stay and have some appetizers or a full meal.  Very quiet and comfortable.",
   "The Rathskeller is amazing! The main dining bar is so freaking cool. Nearest place to have a drink in Helena.",
   "Food, especially the vegetarian fare was excellent. Chanteuse usually brings us in to listen.\nLarge elegant room surrounded by windows where we could watch snow falling was very pleasing.",
   "Awesome"
  ]
 },
 {
  "name": "Suki Café",
  "address": "15 W 6th Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b616607a-9330-11ea-bf01-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "free",
   "eat",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=11289313809199769642",
  "source": "GoogleMaps",
  "reviews": [
   "I haven't been to this place since they opened. We decided to try them again since we forgot about the place. The food is really delicious and clean. The staff are very friendly and always made sure we had enough water/beer throughput our experience here. \n\nI would have given them 5 stars but because my wife and I got our orders at different times and our appetizer came after we were done eating. We also had to wait 15+ minutes to get our bill. The restaurant wasn't very busy either. Ultimately, the food is absolutely delicious and inexpensive! I would recommend if you give them a few more minutes. Wish I had photos of the food but I ate them too fast!",
   "Great meal. We did the all you can eat sushi dinner for $30 each person. It includes all the sushi and most of the appetizers and a few other items like noodles. We had two toddlers with us that ate for free. Changing table in the restroom.",
   "Good sushi - for Montana. It isn’t a coastal sushi joint but definitely one of the better places you will find in the treasure state. Nice environment and VERY friendly staff.",
   "Such good food, and great hospitality. Girl there remembers us every time and is the sweetest lady. Such a fun environment. Hands down my favorite restaurant in Helena.",
   "In my honest opinion,  best sushi around. My wife and I drove down from the Hi-Line to eat here. The Suki's in Great Falls is temporarily closed until they find a new location. We are eagerly awaiting for them to find location and open. Our #1 place to eat."
  ]
 },
 {
  "name": "Bridge Pizza",
  "address": "70 S Park Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b65e661e-9330-11ea-a2e8-14b31f159f22.png",
  "tags": [
   "free"
  ],
  "link": "https://maps.google.com/?cid=7036696940305928514",
  "source": "GoogleMaps",
  "reviews": [
   "Great pizza place. $3-3.50 for a slice of pizza which is a quarter of the 16 inch one. Happy hour you get free beer with purchase. Small outside sitting area or inside seating as well.",
   "I tried the pesto bread sticks and two kinds of pizza, and you guys knocked it out of the park!  World-class eatery, everyone.  Check em out!",
   "A great business with a friendly and helpful staff! You can always expect good service here.",
   "Great place! The pizza is reasonably priced and tastes GREAT the staff know their stuff and are friendly and fast! Have a busy and stressful day at work? Relax here or take the pizza and make the night that much better. 10/10",
   "You cant go wrong with Bridge Pizza.  Their salads are spectacular and easily a meal by themselves.  We like to stop in and order a \"slice;\" which is a quarter of a pizza.  Different slice selections each day.  Best pizza in Helena.  And they deliver."
  ]
 },
 {
  "name": "Steve's Cafe",
  "address": "1225 E Custer Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b6a24d22-9330-11ea-8a0b-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15432538132935733812",
  "source": "GoogleMaps",
  "reviews": [
   "This is a very good mom and pop dinner. Cute and friendly. I had their Ruben and it was delicious. Their homemade sausages were good too. I preferred the chipotle and Italian over the chicken apple one. I would love to come back and get their meatball sandwich when I get a chance!!",
   "Great service, huge portions, and great food. The Marion Berry pancakes tasted great, and the jam that came with it was amazing on some toast.\n\nI can eat a lot, but I couldn't finish my food. Two moderate eaters may be able to split the Chicken Fried Steak meal.\n\nCoffee could have been better; I expect a place called a cafe to have decent coffee but it's the same meager stuff you get at any breakfast place.",
   "Amazing stuffed huckleberry French toast! Awesome sausage and eggs were perfect! Make a stop you will enjoy it.",
   "Helena, Montana.\nWhen I was messing around in Helena, I asked the four locals that were available \"What is the best breakfast place in this town?\"\n\nAll four men replied with Steve's Cafe.\n\nIt was a no-brainer to head to cafe de esteban to be nourished for the following day's massive activities.\n\nThe host, waiter, and staff were awesome. Montana's hospitality is second to no other state (unlike Nebraska at rank 48 and that's cause I haven't been to two states yet).\n\nI did not try coffee here (had my own french press with the hotel).\nHowever, the ice cold water was refreshing.\n\nFood is standard diner food. It wasn't as OG as Waffle Plus in Spokane (sorry to compare) however beats the heck out of 90% Cali diner food.\n\nVeggie ommie - decent sized. It has olives so make sure to omit.\nThe avocados not too shabby.\n\nPancakes - Smaller than anticipated. Had nice thickness and not too dry. Tasted more commercialized (pre-made pancake batter) than a house recipe.\n\nFrenchie Toast - Standard size. Yummy. This was bomb with the crisp strawberries on top. The s-berry mix was sweet enough that it didn't need syrup. Plus the powdered sugar made it sweet too.\n\nHash Browns - Commercialized. Came from a bag. Ya can taste it. They do give a good amount.\n\nOverall I loved the place. Can't compare it to any other local flare.\n\nPricing - Appx $10 per head which is expensive for Montana. But that's what happens when you win a bunch of awards.\n@cigarcpa",
   "Always a must stop when I'm in Helena.  Staff is always attentive and friendly. Love the Corn beef hash, but their pancakes and French toast are equally AWESOME!"
  ]
 },
 {
  "name": "Jade Garden",
  "address": "3128 N Montana Ave, Helena, MT 59602, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b6eb8b70-9330-11ea-8c2a-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "knowledgeable",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5459359029379095340",
  "source": "GoogleMaps",
  "reviews": [
   "The server was very nice. But the food was expensive, the seafood in the seafood dishes we ordered wasn't visible, and there were things (more than 1) floating in my water. But the absolute worst part was when I went to use the restroom, it was beyond FILTHY! Smelled horrible, and the feminine hygiene disposal was OVERFLOWING (a large part of the gag inducing smell, I'm sure)! When I told the woman  at the hostess station, who was one of the owners according to my server, she got really rude with me;almost confrontational. As if I alone was responsible for the bathrooms being in such a state. I told her she ought to be ashamed, and if the front of the house looks like that, I'd hate to see what their kitchen looks like. We'll never go back. \n\nWe'll spend out money at The Chinese Kitchen on Euclid. Where there actually shrimp in the shrimp fried rice, and customers are treated like humans.",
   "This restaurant definitely is the rich, deeply flavored version of Chinese food. The egg flower soul is one of my favorite soup of all time. The almond butter chicken sauce is guilty pleasure to the max. The Canton noodles have wonderful flavor but I don't love the quality of chicken they use in the dish. This is one of my favorite Helena restaurants and I love visiting it when we are in town!",
   "A nice Chinese restaurant in Helena. Is quality Chinese food with large portions and very reasonably priced. This place has a knowledgeable and friendly staff. Great place to get lunch or dinner and has room for a decent group of people.",
   "The best Chinese restaurant in the region! We ordered Kung Pao Tofu, with steamed tofu (rather than fried), and Sesame Tofu. Food was served quickly and it was fresh and delicious, with large, family style portions. We left with a full second meal each! The menu offers a great variety, including beer and wine--a good wine list, even though the server did not quite know how to serve it. Our server was efficient and pleasant. The atmosphere is upscale and neat as a pin. Wish there was a Jade Garden in my town!",
   "I really enjoy Jade Garden. It's kind of expensive but worth the extra money on a special occasion. However, we placed a to go order & it was an hour late & we didn't get the whole order. I'm really disappointed. Probably won't go there again."
  ]
 },
 {
  "name": "Murry's",
  "address": "438 N Last Chance Gulch, Helena, MT 59601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b734063a-9330-11ea-aa36-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "tasting",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7322378294857317823",
  "source": "GoogleMaps",
  "reviews": [
   "Passing through town and stopped at Murry’s to meet up with friends for brunch. Mick helped us and was incredibly helpful and kind to us during our visit! She helped us with food suggestions, which we all took! We had some yummy spicy potato quiche they just made for the first time today. Very welcoming environment",
   "The service and the food were really good!! I got the Hashbrown Waffle and it was absolutely delicious!",
   "Overhyped. My palette was all set based on people raving about this place. The food was good but unfortunately it was underwhelming. This is not intended to bash this establishment by any means. The ambiance and atmosphere was great. The food descriptions were a little short so it was hard to be wowed by the choices before tasting. The apple sauce had the apple skins in them :) kudos for that!",
   "I was rather disappointed. Food in the display case all looked really good, the flavors of the quiches sounded tasty. I was rather excited to try the quiche, my husband ordered a hash brown waffle. My quiche was put in the microwave before my husband had ordered and his waffle took a standard of 13 minutes to cook. Not only was my quiche(obviously) unevenly heated but the crust texture was gummy and not entirely appealing. I think it would have been much better to be reheated at a low temp in a small toaster oven, especially since my food was ready long before my husbands.",
   "beautiful little arts shop\nPerfect for clay sculpture and pottery!"
  ]
 },
 {
  "name": "Hokkaido Ramen and Izakaya",
  "address": "825 Great Northern Blvd, Helena, MT 59601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b784be82-9330-11ea-9469-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=14091145267057679428",
  "source": "GoogleMaps",
  "reviews": [
   "I was a big fan of the Fusion Grille when it was at this location, so was super bummed when it went out of business. Not anymore. Absolutely love this restaurant! You won't find food like this anywhere else in Montana. I've never been to Japan, so I can't speak to its authenticity, only its quality, which is excellent. I've enjoyed every dish I've tried here, and will definitely be back often. And hats off to the staff, who are always friendly and helpful, and wear the coolest t-shirts!",
   "Lovely restaurant. Friendly attentive staff. Wonderful food. I had the vegetable roll and the vegetarian ramen with a lovely glass of sake. So good. I'd come back every day if I could.",
   "Pretty authentic ramen with good noodles. Not what you would expect in Montana. Pretty good sushi and other food as well. Service has always been good. One of my favorite places to eat in Helena.",
   "The staff really cares and it shows. They are among the friendliest and kindest I have ever seen! They are quick to fix mistakes and apologize, many times they have gone above and beyond to ensure satisfaction. I have been here many times and have not had one thing on the menu that I have not liked or enjoyed. If I could give more stars I would! Love this restaurant!",
   "A unique restaurant in the capital of MT. Great Asian foods and drinks. The Ramen is their specialtie that will surprise you. It is well prepared with various flavors of your choosing. If don't like Ramen and want to try something new they have a  great menu that will please everyone in your group. The restaurant is beautifully designed to enhance your experience. A grear place to go with a bunch of friends."
  ]
 },
 {
  "name": "Suds Hut",
  "address": "2701 N Montana Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b7ca5350-9330-11ea-a694-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3689156917184630748",
  "source": "GoogleMaps",
  "reviews": [
   "Waited 20 minutes for a table then ten more to order drinks. Party of 5 gave up and left to eat somewhere else. Too bad, the food is great. Possibly the best burger in Helena. Famous fried chicken. Good beer selection. Get here early if you don't like a long wait at popular times.",
   "Can’t beat this place. Such a great Montana feel. Of course their chicken is great, but the burgers are the best in Helena. Prices are very reasonable for the quality of food you get. Sometimes there can be a wait if you have a party of more than 2, but it’s rarely longer than 15-20 mins. Well worth the wait.",
   "Good chicken place. Kids menu. My kids had the Mac and cheese wedges. One loved them, one hated them. I had the chicken and JoJo's. Very good JoJo. Chicken was pretty good too. Got pretty busy around noon when we were leaving.",
   "I finally went here! Heard about it for years now and have been seeing their food posts on Facebook! They lived up to everything I have been told and have seen. Service was great, drinks were cold, and food was top notch. My only complaint would be, it was uncomfortably hot inside there. However, the open pit fire was neat! I enjoyed the stained glass up and around the ceiling.",
   "Sud's hut has the best wings I've ever had. The atmosphere is awesome, and the beer seems especially good! I don't think I've eaten at the same restaurant so many times. It's THAT good."
  ]
 },
 {
  "name": "Smokejumper Station",
  "address": "2850 Mercer Loop, Helena, MT 59602, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b810d23e-9330-11ea-8ece-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "food",
   "drink",
   "food",
   "music",
   "tasting",
   "food",
   "drink",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=792577593836417139",
  "source": "GoogleMaps",
  "reviews": [
   "LOVE this restaurant! We've driven out for lunch here several times now. Great bar, even better food! Being gluten intolerant I have missed having spicy chicken sandwiches, and the Smokejumper Station has the PERFECT gluten free spicy crispy chicken sandwich! Home fries are delicious and menu options also tasty. If you're traveling into Helena, grab a bite. One of Helena's better food options is right here at the airport.",
   "Cozy lil place with a view! Good music, food, drink. Steak n veggie soup is fantastic! Bloody mary is also great!",
   "They would not honor the discount from MTN Deals an ad they did on TV, very sad.  The wait was long to get our food, and they were not sorry, just gave us food and left.  Overpriced for bland tasting food and meh service. I guess if your waiting for a plane you are trapped and have no choice.  Homeless shelter would have better food and service.",
   "Amazing place to drink a beer and eat some great food!",
   "Mediocrity at it's best.  Sunday is buffet only and it costs a whopping $15.20 which is slightly above average for most buffets.  When you factor in dirty plates, buffet items running out twice within 15 minutes with not a packed house; I'm left with the impression that I'm not getting top service for the top dollar they demand here.  Chicken enchiladas tasted decent with good flavors but looked unrecognizable.  The Mac and cheese was a grease pit with blandness flavors.  The bacon was great and the mini pancakes were decent.  Amazingly there were no eggs available in the is breakfast and lunch buffet.  Interesting enough, they had a massive table blocking the fire exit.  I expected a slightly elevated service and dining experience here, unfortunately I left unimpressed leaving with a price tag that doesn't reflect what I received in exchange."
  ]
 },
 {
  "name": "Fiesta Mexicana",
  "address": "3425 US-12 E, Helena, MT 59601, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b85ecb64-9330-11ea-8d9f-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11341261441697358424",
  "source": "GoogleMaps",
  "reviews": [
   "Terrible service. Terrible food. Went there with my wife last night-just 2 of us. Restaurant was only about half full which means about six tables full. Had to wait 15 minutes for drinks and waitress brought wrong drinks. Then had to wait an hour and 20 minutes for our meals and one of two was not what we ordered. Didn't have another hour and a half to wait for the correct meal so tried to choke down part of what was served. Waitress didn't apologize or discount meal.   Don't go there if you want decent Mexican food served in a timely manner.",
   "Terrible service. Took 5 minutes for waitress to acknowledge me at door waiting to be seated. Order was received wrong. Only time waitress interacted with me was to throw (literally threw) the check on the table.",
   "First and foremost, the food is delicious. The atmosphere is great with the music playing in the background. The staff was very friendly and did very well about checking up on everyone. A great experience all around.",
   "The service was so poor and lacking it was ridiculous.  The waitstaff have no understanding of the concept of teamwork, service was slow, the server forgot to pick up our order and deliver it to the table, and the restaurant wasn't even 1/4 full.  When I went to pay the bill, our server asked who our server was... seriously?  There were only 4 tables with people and their were 2 servers.  Servers were not very friendly or attentive.  For a place that advertises on television so much, you would expect that once they get customers in, the service would be decent at least (or perhaps that is why they need to advertise so much - because once people go there, they don't return?.  If you are even considering this restaurant, try Melaque instead.",
   "The food was pretty good. The tortilla soup was very tasty. I would recommend it for a Helena, Montana Mexican food experience"
  ]
 },
 {
  "name": "Steffano's U-Bake Pizza and Sub Shoppe",
  "address": "2100 N Last Chance Gulch, Helena, MT 59601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b8a830ac-9330-11ea-bb7d-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18205647484298990661",
  "source": "GoogleMaps",
  "reviews": [
   "Instructed to cook 10 to 15 minutes. \"For a crispier crust, remove from pan for final 1-2 minutes and bake directly on the rack\".\n\nOne pizza had a burnt bottom. The other was perfectly cooked... around the edge. The rest fell through the oven rack. \n\nIt would have been less messy to throw $25 directly into the trash.",
   "This place is rock-solid for almost 40 years. Great food at excellent prices! I'll be back.",
   "Love this place! I've been coming to Steffano's since the early 90s and their quality and customer service has been consistently great. Love the pizza roll ups!",
   "Amazing food and service. Had a  wonderful atmosphere and great vibe!",
   "I love their soup and breadsticks! Everyone friendly and fast service"
  ]
 },
 {
  "name": "MRH Eatery, Mountain Ranch House",
  "address": "625 Barney St, Helena, MT 59602, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b8f0ab8a-9330-11ea-bfbd-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16029388885645703947",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped in for the first time today and loved it. We had a free slice of pepperoni pizza for the anniversary celebration which we really enjoyed. I got the BLT which had amazing bacon on it. It came with your choice of chip flabors. And the bread sticks which were also good. We will definitely be stopping again to try a full pizza.",
   "Best pizza in Helena. The dough is fresh, some of the meat is cured in house which is so cool, and it’s clear the food is made with love.",
   "We had the Brisket BBQ pizza today and it was delicious. The brisket was just delicious. First time in here as we just moved back. Staff is super friendly and the menu is attractive. We will  be back for sure!",
   "The food was awesome! But the tweaked out blonde waitress took it upon herself to give herself a $30 tip on our credit card after we'd tipped her in cash.",
   "Amazing switch of ownership, chef and waitstaff. Worth it!! Homemade ravioli, calzone, lasagna, spaghetti and meatballs, and pizza."
  ]
 },
 {
  "name": "Hwy 55 Burgers Shakes & Fries",
  "address": "2530 N Montana Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b93b705e-9330-11ea-b8e3-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "kids",
   "free",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8169542356880373063",
  "source": "GoogleMaps",
  "reviews": [
   "Let's face it, you're craving a cheeseburger right now.  If you weren't, you wouldn't be reading reviews of burger joints.  Hwy 55 is THE burger cravers burger joint.  With style and substance, the cheerful folks here will leave you satisfied.  Juicy burgers, salty tots, and oh so sweet milk shakes all made to order.  Give 'em a call and swing on by, you won't be disappointed.",
   "The food was amazing. The bacon cheeseburger was delicious. The meat was juicy and very well cooked and The cheese was the perfect kind of melty goodness it needed to be. I ordered a milkshake and definitely wasn't disappointed. The server was so helpful and very nice, she made me very welcome and comfortable. My order didnt take too long to come out and everything was so fresh and yummy. The decor is my freaking favorite. Super cute and very retro 50's chic. Definitely wouldn't mind being a regular there while in town for a bit.",
   "Great burger and chicken. My kids loved the car the kids meal came in. Fast service.  God shake",
   "Shrimp Po sandwich was very sub par. (Looked like they didn’t devein the shrimp.) I’ve had a BLT also in the past which I didn’t enjoy at all. Burgers are alright.. shakes are good.",
   "Cute decor!  So many fun things in the restaurant and that's where it stops. The service is horrible and food was a disappointment.  They serve subpar food.  We asked the waitress if the fries were fresh cut, she said yes.  They are frozen fries not fresh cut. I needed gluten free so I ordered without a bun.  The hamburger patty was thin and tiny.  I expected an amazing burger joint and got McDonald's quality.  We will never eat here again."
  ]
 },
 {
  "name": "The Rib Shack",
  "address": "2800 N Montana Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b97df7f4-9330-11ea-8d17-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=45070391767140343",
  "source": "GoogleMaps",
  "reviews": [
   "I pulled up in my truck today hungry as all get up. I said I'm really hungry and I'm a heavy duty beauty and I want brisket. He said he feeds hungry people all day and pointed me to the brisket platter. Doubting it would be enough, I asked what the next largest size was. He said he solves hunger problems all the time. I'm glad I trusted him. Excellent brisket, excellent portion. Very happy customer!",
   "Great ribs. However, they routinely use their bare hands to grab your ribs and put them in the carton. No sink in the trailer, no gloves, no tongs, but bare hands. Kind if disgusting since you have no idea how dirty their hands are. Especially now.",
   "Had an amazing take out meal here. The meat was well cooked and smoked. There was more than enough and the owner was the kindest person I have seen serving food. The pork was a little dry and tasteless but everything else was so good it didn’t even matter. The sides even hit the spot. And the cost was reasonable. This is somewhere we will go back to time and time again. Thank you!",
   "The owner does a nice job with his BBQ.  My family tries to eat at his place every time we are in Helena.  Love the brisket and BBQ sauce.  Large portions and a reasonable price.  I would highly recommend.",
   "My fav bbq in Helena"
  ]
 },
 {
  "name": "Staggering Ox",
  "address": "400 Euclid Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b9bf6dd0-9330-11ea-b7cf-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "food",
   "unique",
   "art",
   "music",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=34613011030036067",
  "source": "GoogleMaps",
  "reviews": [
   "Had to wait 40 minutes for an order I placed on location. And the poor gal up front got no help at all and had to go get my food after I went up to find out what was taking so long. Food is good, but they need more workers and need to get the food out more quickly.",
   "Pretty good collection of Colorado growlers on the wall. Most are Montana of course, but I was glad to see some familiar logos. Nice venue for parties, too. I'm a bit sad I wasn't able to try one of their rather unique food items though.",
   "I will admit, slightly above normal sandwich prices, Until, I received my meal...\nObviously freshly baked 🍞, fresh ingredients, unique ambience to boot  \nInteresting  yet pleasantly surprised...\nThen I wandered to the back area and discovered a comfortable music venue & coffee shop...\nBut WAIT, THERE'S MORE!!!\nNot originally from Montana, I found TREASURE, REAL FRENCH PASTRIES & Classic cinnamon rolls, so Cool!!!!\nI was told the variety of pastries vary and are all Great...\nGive it a try, unique employees and art",
   "Good food. Kids loved the peanut butter and jelly. Very large place. Lots of high chairs and tables. Very orginal sandwich in a roll.",
   "Sandwiches and atmosphere were awesome! Service was not. No one in line and it took almost 15 minutes to make our 3 sandwiches."
  ]
 },
 {
  "name": "Godfather's Pizza",
  "address": "2216 N Montana Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ba0ddc2e-9330-11ea-b764-14b31f159f22.png",
  "tags": [
   "eat",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17355007138648564342",
  "source": "GoogleMaps",
  "reviews": [
   "Some of the best pizza in town. Not as good as it was in the 80s, but still tasty and they have lunch buffets and dinner buffets on certain days. All you can eat pizza and salad bar.",
   "Pizza was great.  Salad bar was minimal. National website said they offered gluten free pizza.  They do not at this location.  Customer service was ok.  Not great but not horrible.",
   "salad was empty. hot items were cold.  other hot items too hot so were rock hard!  friendly staff but poor service.",
   "The Super Taco pizza is the best pizza I’ve ever had in my life. Please don’t ever close!",
   "One of the best Godfathers I've been to. Clean, friendly, and good food."
  ]
 },
 {
  "name": "La Casa Fiesta",
  "address": "632 Euclid Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ba508a9e-9330-11ea-a94f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9889666054021538827",
  "source": "GoogleMaps",
  "reviews": [
   "A great little Mexican restaurant out of the way and no sign showing where it's at! But good Mexican food! Huge taco salads! Nice waitress:)",
   "The staff is really friendly here was pretty good service. The prices are pretty expensive for the amount of food you get. Chips and salsa were average at best not the biggest fan. Personally not a big fan of their red sauce they put on their enchiladas and the rice is not great to say the least. The restaurant is really tiny. I could see it possibly as a good date spot.",
   "BEST BURRITOS EVER, MY siblings call them spicy beans and they want them every day!",
   "Like the new location. Food was great as always and arrived quickly.  Service was excellent.  It was very busy with all tables full but you could talk and visit without raising your voice.",
   "Always so freakin tasty!  Hope the new location helps them gain some recognition in Helena.  The absolute best salsa so I buy a couple pints to take home too."
  ]
 },
 {
  "name": "Last Chance Casino",
  "address": "1001 N Last Chance Gulch, Helena, MT 59601, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ba94e6ec-9330-11ea-a07b-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18267250246467462815",
  "source": "GoogleMaps",
  "reviews": [
   "Enthusiastic service and good food.  Good portions at a fair price.  Bathrooms aren't spotless but are fairly clean.  Minus 1 star for product consistency issue on the BLT sandwich(still a good sandwich) Not a deal breaker we will be back.",
   "The food here is decent and the service was prompt. The Live Keno here is a great attraction as there is only one other spot for that here in Helena. I liked the beer selection and the amount of gambling machines available. This was a nice visit for a beer or two in a very casual setting.",
   "It is always a hit or miss here for food and gambling. Food for the most part is amazing if you get what you ordered. 😏 Gambling...most of the time you have to ask for refills on your drinks. The restaurant side is different. I have had wonderful staff there...however food still comes out wrong even though the bill is what I ordered.",
   "Sometimes a great meal can get you to in the box sure smashed allot of bosses on the way to get here me and this chew guy crushed it thanks for the chance . Always a next meal never a last one with you guys. You should let me and Jim put your next floor in",
   "Amazing burgers! Nice place to escape the cold on a snowy night!"
  ]
 },
 {
  "name": "Village Inn Pizza",
  "address": "1830 Prospect Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bad87fc0-9330-11ea-a755-14b31f159f22.png",
  "tags": [
   "cheap",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=13707536378852581326",
  "source": "GoogleMaps",
  "reviews": [
   "Love this place.  Pizza is amazing, the workers there are always awesome.  My favorite pizza place in town,  plus if you put in an order you can throw a 20$ in a machine and enjoy a nice beverage while they make your order.  Recomend highly.",
   "They used to have one in Missoula. It closed many years ago. Very sad.\nI road trip to Helena at least twice a year for this pie. Not the best in the world...but damn good! And it brings back fond memories!",
   "Really solid pizza. Always our families first choice.  Great crust. Tasty sauce.  Great service. Very reasonable prices.",
   "Unsatisfying and basic pizza. Marina also tastes unpleasant and overly tangy. Just a bland affair through and through.",
   "Maybe the best value lunch in Helena. Village Inn AYCE Pizza & Salad lunch buffet includes a bottomless Pepsi fountain drink or Iced tea..... Fast, friendly, fresh and cheap, what more can you ask of a work day lunch in Helena, MT. Monday thru Friday, lunch time only."
  ]
 },
 {
  "name": "Shellie's Country Cafe WEST",
  "address": "908 Euclid Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bb22f662-9330-11ea-83bd-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10359840532873195768",
  "source": "GoogleMaps",
  "reviews": [
   "You can't beat the Holy Cow meals! Food is great and take home the leftovers.  Have never had a bad experience here.  Great place for pie!!",
   "Nothing fancy, just good food.  Nice selection of entres, and extra large portions available if you need to feed the bear.",
   "The food is FANTASTIC.   Great staff to boot.  Thanks for a great experience.",
   "Fabulous spot. Relaxing and inviting. Great staff and the grub is spot on!",
   "Good basic cafe fare, reasonably priced. Also a full service bar. Friendly service."
  ]
 },
 {
  "name": "Motherlode Casino and Diner",
  "address": "1420 Cedar St, Helena, MT 59601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bb6d6d5e-9330-11ea-853a-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=15866413142145608671",
  "source": "GoogleMaps",
  "reviews": [
   "The chicken fried steak is as big as your head! We love eating here. Better portions than alot of others in town.",
   "Love the tomato soup. I go here every Tuesday because I work right next to here hehe",
   "Good food,  but the hash browns were under done.  Restraunt has outdated decor. Great customer service!",
   "Rest his soul and I guarantee he's turning. Love you Taco. Gone downhill after his passing rude service no greating as you enter. Disappointed...",
   "I've always liked going here for the breakfast and the atmosphere. It's a laid back bar and I have enjoyed it every time I've visited."
  ]
 },
 {
  "name": "Montana Nugget Casino",
  "address": "612 Euclid Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bbb01ba8-9330-11ea-963e-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9662550932658957739",
  "source": "GoogleMaps",
  "reviews": [
   "You get a lot for your money in the restaurant. Burgers a pasta dish, fried chicken and even prime rib. Restaurant a bar and about 15 slot machines. Bar is small and squeezed in among the slot machines. Feels like a inexpensive, middle of the week date night spot for Gen X'ers and older.",
   "Food is always good minus burgers. We have been sick off of every burger. Machine runners are amazing minus one. We try and avoid those nights.",
   "Excellent food! Fun friendly atmosphere and the casino games are always fun! This our date night treat yo self location of choice!!",
   "Been coming here since I was a child. Loved it then, love it now! Everyone's so nice and helpful, food is great except one time we found a hair in my boyfriend's food... which was a little off putting but other than that it's a great place",
   "I love getting a late weekend breakfast here. Highlight of my week!"
  ]
 },
 {
  "name": "Dairy Queen Grill & Chill",
  "address": "1700 Prospect Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bc0d5718-9330-11ea-9442-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2782312303250186231",
  "source": "GoogleMaps",
  "reviews": [
   "Locally owned fast food with desserts! Great for the family. A clean place with lots of seating, and more than a few dessert choices ! Service is good, even when the lines are long, which does happen. Be warned, if there is a kids sporting event in town, 15 mins after its over, it will get busy here, but they will get to you as quickly as they can.",
   "Ok for \"fan\" / fast food.  They do make your stuff after order for the most part.  One of the better options for FF in Helena.",
   "No stars! We just went through the drive through and ordered lunch... the burger was ice cold like they were using previously grilled meat that had been refrigerated and the fries were hard as rocks. They were more like chips. We won't be back. We contemplated calling but didn't want to fight with anyone. There was no one else in the place so not sure why they can't just do a decent job. What a waste of 15 dollars as the food went on the garbage.",
   "This is one of the best Diary Queens I have ever been to!! The bathroom was SO CLEAN, the staff were very friend, and the food was great. I will definitely be coming back!",
   "This place has always been a little slow hence the 4 stars, but the food has always been good. The orders have been accurate, food hot or cold appropriately and the staff friendly."
  ]
 },
 {
  "name": "Neveah's Cafe",
  "address": "1431 11th Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bc51652e-9330-11ea-9448-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7244814931252834760",
  "source": "GoogleMaps",
  "reviews": [
   "Wow. Floored. I was looking for some delicious Mexican food and I saw this places and decided to try it. Unreal! First off the owner is the most friendly, positive person I met that day and he lifted my spirits! The taco special was huge and fresh.",
   "Amazing I will definitely be eating here again best tacos in town hands down",
   "Amazing restaurant with an awesome owner. Great food for a great price",
   "Louie is the kindest person you'll ever meet serving the best food I've ever had. If you get the chance, strike up a conversation with him. You won't regret it.",
   "I ordered the two crispy tacos. \n\nNow. I love tacos. Like, really love them. If I had to pick on food where I could only eat that food for the rest of my life, it would be tacos. If someone ever asks me \"Pizza or tacos?\" I'd take tacos every time. No amount of money would be enough to get me to stop eating tacos.\n\nI've eaten tacos of all kinds from all sorts of places. The two tacos I received at Neveah's were the absolute, hands down, best tacos I've ever had.\n\nI mean, the people that work there were really nice, but I feel like I got the deal of a lifetime on these tacos. I could die tonight, and be ok with it, because those tacos were so fantastic.\n\nYou would be doing yourself a disservice by passing up an opportunity to eat at Neveah's."
  ]
 },
 {
  "name": "Subway",
  "address": "Pad D, 3048 N Sanders St Suite A, Helena, MT 59601, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bc9c781c-9330-11ea-8881-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11506935438758696079",
  "source": "GoogleMaps",
  "reviews": [
   "I have visited this place on 18Dec2019 night.\nThe sub is tasty and good. Fresh bread.\nI am happy with the service and tasty food.",
   "Super clean, fast, fun and friendly. Best Subway I've ever been to... And that's saying a lot.",
   "Great food. Always friendly and speedy service. Recommend highly 👍",
   "The food is pretty consistent. The big thing is customer service. The people helping you can vary anywhere from awesome to horrific. Anywhere from extremely fast to really slow. But I would say 75% of the time I get a really good employee who knows what they're doing and will give me a well made sandwich with clean service providing. I recommend to those people who are on the town chilling with a friend and you want something to eat real quick. Good stuff.",
   "Better staff. Good sandwich."
  ]
 },
 {
  "name": "Dive Bakery Cafe",
  "address": "1609 11th Ave A, Helena, MT 59601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bd017bd0-9330-11ea-931f-14b31f159f22.png",
  "tags": [
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7556506725246783348",
  "source": "GoogleMaps",
  "reviews": [
   "The employees are really nice & friendly. The peasant rolls & vegetables are always fresh. The coffee is also good- not bitter or burnt.",
   "Fantastique! Our favorite was the flourentine sandwich on sausage cheddar peasant roll. If I lived here they'd be seeing a lot more of me!",
   "Best crepes in town! Their sandwiches (breakfast and lunch) and excessively delicious too. (Please open on Saturdays!!!)",
   "Love this place! The quiche is my favorite and am never disappointed with their coffee.",
   "ONE OF THE BEST OR CLOSE TO IT, CARAMEL ROLL I HAVE EVER HAD. WILL DEFINENTLY BE MAKING REGULAR VISITS FROM NOW ON."
  ]
 },
 {
  "name": "Costco Food Court",
  "address": "2195 E Custer Ave, Helena, MT 59602, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [
   "delicious",
   "cheap",
   "drink",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5332696173276927786",
  "source": "GoogleMaps",
  "reviews": [
   "Good for a thrifty quick bite. Good variety, fast and hits the spot.",
   "Good cheap food. Great staff. The chicken ceasar salad is delicious and good size for $4. The hot dog's are just like you get at the ball park, and comes with a drink for only $1.50.  The pizza is really good and they have 3 options. Pepperoni, all meat, and combination. Would recommend to anyone wanting a quick cheap meal.",
   "Gotta have a Costco dog every so often.",
   "Consistent hot dogs and slices. Cheapest lunch in town.",
   "Eat there almost everyday for lunch, great deals great food."
  ]
 },
 {
  "name": "Pita Pit",
  "address": "101 E 6th Ave, Helena, MT 59601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bd4d03dc-9330-11ea-ace6-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17879112720722921593",
  "source": "GoogleMaps",
  "reviews": [
   "Fast, friendly and tasty. Offers gluten free wraps for a little extra. Vegetarian options also available. Wheel chair accessible. Parking is downtown street availability or pay-lot parking around the block.",
   "Pita Pit is the bee's knees! 🐝 🐝 good food, fast. 😎👍 Pitas > sandwiches 😉 lots of healthy options, thanks Pita Pit!!",
   "The manager is a really cool guy. His staff is nice and the food is good. I recommend the Gyro pita.",
   "Decent food, but limited menu. Lacking pride in there quality of food.",
   "Four stars for a pita pit. Food was good, fast, friendly. Not remarkably clean but decent. Not at all busy at 1:30. New pita menu is an upgrade."
  ]
 },
 {
  "name": "Brewhouse Downstairs",
  "address": "939 Getchell St, Helena, MT 59601, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=6386569728659636214",
  "source": "GoogleMaps",
  "reviews": [
   "Come to Helena often and this was our first time at the Brewhouse and WE WILL be back!! Great food and service with local beers. Freeking fantastic 👍🤩🤩🤩"
  ]
 },
 {
  "name": "Los Cazadores",
  "address": "3000 Canyon Ferry Rd, East Helena, MT 59635, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bd96b74a-9330-11ea-bb47-14b31f159f22.png",
  "tags": [
   "cheap",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14073785916759125158",
  "source": "GoogleMaps",
  "reviews": [
   "Los Cazadores is a great place to eat a cheap lunch or dinner. The smothered burrito is all I ever order. A complete meal in one burrito. The red sauce has amazing flavor. The chips and salsa are wonderful as well. Very clean eating area and the kitchen as well. Service is always great with great attitudes.",
   "🍽Pleasant combination of casual and sit down dining. Good table service. Large portions. Fair prices. Strong flavor! Unassuming but rewarding dinner spot. Could only use more 🌶hot sauces 😉🌮🌯",
   "First time there. Service was outstanding. I had the Grilled Chicken Super Burrito. Best burrito I've had in 25 years and I could barely finish it. Happy anniversary. Here's to 21 more years of great food",
   "Los Caz is always great food.  The portions are generous and the quality is awesome. The wait staff is very helpful and keeps things moving.  Their signature burritos are to die for.  Better bring a big appetite though as they are not for the faint if heart.  They are always consistent on quality and I have never left here hungry.  The home made salsa is amazing as well.  If you are in the area at lunch time this is a must try place.  Make sure to check their days though as sometimes they are closed.  Keep up the good work and great food guys.",
   "Excellent food loved their fish tacos! Place is clean and very friendly. The waitress was wonderful! Received food quickly. Very laid back and had coloring books and Legos for my little one. Will definitely go again."
  ]
 },
 {
  "name": "Wassweiler Dinner House and Pub",
  "address": "4528 W, US-12, Helena, MT 59601, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bde7bd9e-9330-11ea-9333-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17301497215798652674",
  "source": "GoogleMaps",
  "reviews": [
   "Meal was great... only thing I would comment is that my entree side was more delicious than the entree itself. Compliments to our server Sam she was great and engaging, would come back often however travel distance might limit the number of visits!",
   "The most amazing place we've ever been,  the amount of love the owner has compelling! The food is so good you don't want to finish because it's truly that good! The atmosphere is classy , relaxing, and welcoming! Boy if you have not gone you truly are missing a piece of heaven I highly recommend Wasseweiler's!!!!",
   "Outstanding food! Great atmosphere! Very expensive. House was built in the 1800s. You feel you are back in time of the 1800s. Great service! Wonderful wine and beer menu.",
   "The food was amazing! The bruschetta was the best! The carrot gnocchi and salmon will be high on our list to have again soon! The venue is cozy and perfect for a romantic dinner!! Great way to welcome the New year!!",
   "Fantastic!  Best meal I’ve had in quite a while."
  ]
 },
 {
  "name": "Wing Street",
  "address": "Helena, MT 59602, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=7319668645293556045",
  "source": "GoogleMaps",
  "reviews": [
   ""
  ]
 },
 {
  "name": "The Gold Bar and The Western",
  "address": "406 N Last Chance Gulch, Helena, MT 59601, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/be2a450a-9330-11ea-92e2-14b31f159f22.png",
  "tags": [
   "delicious",
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=2687460565432786141",
  "source": "GoogleMaps",
  "reviews": [
   "Very clean and friendly, positive and upbeat environment and friendly and professional service. My fiance and I went there tonight to have a couple of White Russians which were delicious and enjoyable. We also gambled there and won a little money and had a great time.",
   "This is the coolest batender ever. Will keep my service here!! ",
   "Miss Sandy's got the tastiest cheap breakfast/lunch deals around and David makes the BEST bloody mary in town!!!! Had SO much fun at the Former Felon's Ball on Saturday night!",
   "Great friends to meet there every time I go in.",
   "Best place downtown"
  ]
 },
 {
  "name": "Eat Greekish",
  "address": "W Main St, Helena, MT 59601, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/be716076-9330-11ea-9aa5-14b31f159f22.png",
  "tags": [
   "family",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3716033745422778953",
  "source": "GoogleMaps",
  "reviews": [
   "Eat Greekish food is so full of flavor! I love the menu and all the options they offer. Each of my family members can find something they love. We especially love that they add fries to the sandwiches! Such a fun touch. The staff is fun and so friendly too. Love the bright look of the trailer too, it can't be missed! Thanks for serving Helena Eat Greekish!",
   "",
   ""
  ]
 }
]