[
 {
  "name": "Iolani Palace",
  "address": "364 S King St, Honolulu, HI 96813, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bedd41d0-9330-11ea-91ed-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "family",
   "history",
   "tour",
   "history",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=7544239747649233175",
  "source": "GoogleMaps",
  "reviews": [
   "This place was beautiful.  Talk about royalty!  We had a hilarious and amazing tour guide for this.  He used to work for the District Attorney, so he was telling us stories about how he used to come to this palace to do work here.\n\nThe palace is beautiful.  The tour is so interesting and has a lot to show you in such a short amount of time.  They go through every room and show you so many things, it's hard to take it all in that this once was a place where royalty lived.\n\nWe did the first tour of the morning and since this place is beautiful at that time.  It's definitely worth checking out.  Make sure to bring a camera or your phone because there's a lot of things you don't normally get to see up close like the jewels and crowns.",
   "The restoration and preservation of the remaining royal collection is phenomenal. I have lived on the island for 20 years and had never thought to tour the palace until family from the mainland visited.  I chose the audio tour for us and was not disappointed. Each room had so much visual history and the audio gave feeling and life in each description and clarification of the history of Hawaii's Royal family.  Each item displayed had so much beauty and the design from the wooden doors to the inlay found on the Mason tools.  There was so much to see and so much I may have missed in my excitement that I am positive that my family and I will return sometime again soon.",
   "I grew in up in  Hawaii but had never visited the palace. 56yo now. Great visit. Marvelous docent. Well restored.  Well worth the time and money on a rainy day. Weather has cleared and headed to the beach next. Mahalo.",
   "Beautiful wood work and excellent job of keeping it as original as possible. Great audio tour. You may want to bring headphones for the audio but they have some available for use. Leave your bags in the car as they want to limit the risk of damage by accident within the palace. The docents were friendly and courteous. A great history lesson for anyone interested in the Hawaiian monarchy.",
   "Great tourist spot or something you should definitely see as a local. Beautiful building with some stipulations no wheelchairs, no scooters, and no strollers. They have wheelchairs to borrow but because of it being historic you are not allowed to use your own. The process for someone who's wheelchair dependent and not self transferring is a pretty big pain but is doable. \n\nThey offer military and Kamaina discounted rates."
  ]
 },
 {
  "name": "Diamond Head State Monument",
  "address": "Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bf2d851c-9330-11ea-ac4a-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "walking",
   "hike",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=4800286696185848402",
  "source": "GoogleMaps",
  "reviews": [
   "So incredibly beautiful and the best part was not only the view after the hike but the dole pineapple whip at the bottom in the parking lot. But the views are breathtaking for sure. There were 148 steps near the top I believe that is what we counted. I recommend going early morning or late afternoon because of the heat and take water with you. There are a few view points on the way up where you can rest and see other views. It was just beautiful no matter where we were.",
   "The views were amazing. The hike was not bad at all. There are 142 steps to get to the top, or there is an easier route if you go left after the tunnel. Rocks got a little slick after the rain, but the view was breathtaking. Also at the top we had good timing. It got busy after we were up there a few minutes. Total time up and back was about an hour and half. And I'm average shape I'd say.",
   "It is quite close to Waikiki and you can easily get there by bus for less than $3 US in 2020. There is some steep stairs but most people would be able to reach it and return in 2 hours.  There was a lady who appeared to be in her 60s with a walking stick returning. However on a hot day taking frequent stops is advisable",
   "I loved this place. I had a small bite to eat before going for the hike and rewarded myself with a pineapple smoothie after i left. the soft serve at the place was great. the views were awesome. i don't recommend bringing very small children (or infants in that case) on the hike as there are some steep steps. Great experience overall",
   "Go early as they advised. We got there only at 620 am and already the parking lot was getting full  the diamond package through the visitors center for $20 is a wonderful bargain. At top after you get through tunnel go to the stairs on the right  it's harder but less travelled. The views are magnificent and worth the trip up. If it rains remember to be careful to not slip. Great place"
  ]
 },
 {
  "name": "Bishop Museum",
  "address": "1525 Bernice St, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bf6cff1a-9330-11ea-a103-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "learn",
   "educate",
   "history",
   "kids",
   "unique",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=12774152068312517577",
  "source": "GoogleMaps",
  "reviews": [
   "The bishop museum is a little pricey especially if your not military but I would say it's worth it. The exhibits that they have are very well put together and nice and informative. They have multiple buildings of exhibits and a planetarium as well! Parking is $5 all day and the grounds are pretty.  Recommend if you have the chance to come and learn more about the history of Hawaii and the other Pacific islands 😁",
   "I'm the type of person who genuinely loves a good museum, to the point where I refuse to view them as 'rainy day activities'. The Bishop Museum has some interesting items but I couldn't help but feel there was a lack of narrative to tie everything together. Many of the items were poorly lit and one of them also had a dead bug in the display case. I was really expecting more for the entry price ($25). Definitely not worth the distance I travelled to get to this place from Waikiki.",
   "This place is amazing! Honestly, everyone needs to go to the bishop house and educate yourself about Hawaiian history. And in fact, you need to go multiple times because there is so much in there and so much to learn. Truly an amazing resource. If you ever have visitors, PLEASE take them here!",
   "Interesting place. An amazing exhibit of the Hawaiian culture. The science center is designed more for kids. There are even activities on the volcano science discovery building, and the planetarium.  Everywhere in the museums tells a story about the traditional Hawaii and Polynesian culture. That was an incredible visit, lots of information and learning.",
   "With the $2 planetarium ticket, it cost about $28 total. It was worth the money; I loved the exhibits and planetarium show. All of the staff were super friendly and knowledgeable with all of my questions. My only negative feedback is that one of buildings clearly labeled on the map as a part of the museum was not open to the public. Even without exploring that building, I spent four hours here so you'll get your money's worth. The gift shop also has some unique, locally made items crafted in old Hawaiian tradition. Definitely much better souvenir or gift that you'll get in a shop at Waikiki."
  ]
 },
 {
  "name": "Kapiʻolani Regional Park",
  "address": "3840 Paki Ave, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bfba34f8-9330-11ea-987b-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "family",
   "parks",
   "family",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=10727458728963942112",
  "source": "GoogleMaps",
  "reviews": [
   "This place is awesome. \nI had a great walk with my husband while in our vacation. Perfect if you like to go for a run or just to have a nice walk. \nIf you are into pics, we will be able to find tons of greats spots. \nTotally worthy",
   "One of my favorite parks where you can go and have a family day or a small gathering with friends. But if you prefer to have it all to yourself for me time. Best part about it, it's just across from the beach. My preference is to walk my fur babies around the park and it is no a small park.",
   "Beautiful place, great for picnicking, alone time, or time with the family.  Great place for exercise.  They have a multitude of work out bars and a beautiful running path. Many extra curricular activities after dark too 🤣🤣🤣🤣🤣",
   "Lots of activities going on here all the time and one of the safest places for teams, leagues to practice and have tournaments in soccer. Best place to have a picnic with big/small grouos, walk, jog, run and jump in the beach after a good workout. If you happen to be there in the late afternoon, also a good place to watch the sunset - or sunrise depending on the time of year!",
   "Wide and spacious. Offers varied opportunities to enjoy; vigorous or relaxing. Beach or grassy, many comfort stations throughout entire park. Parking is also widely available."
  ]
 },
 {
  "name": "Fort DeRussy Beach Park",
  "address": "2055 Kalia Rd, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c009b4c6-9330-11ea-9723-14b31f159f22.png",
  "tags": [
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7135774444090390345",
  "source": "GoogleMaps",
  "reviews": [
   "Best place to watch the sunset in Waikiki! I arrived just as the sun had gone over the horizon dipping into the grand Pacific Ocean!  I've also been during the day and there is plenty of lawn space to sit and just relax. There was also a volleyball game going on, as well as plenty of people exercising or just visiting the park. If you like to people watch, this is a good place. People from all over the world! I like to try and guess where people are from. There are lots of visitors from Australia, NZ, Japan, and the West coast of the US.",
   "Stayed at the hill in the Hawaiian village and this is just right next door to it. Basically past this beach park every day I went for a walk to go venture around Honolulu and Waikiki. This is a beautiful path to walk especially when the sun is about to set.",
   "We watched the fireworks here and it was a perfect spot! We got there about 20 minutes early and had a really nice place to view the fireworks. About 5 minutes before the show the beach filled with people. I would suggest to show up about 15 minutes early.",
   "A beautiful park area located on Waikiki beach with expansive views from Diamond Head to Hilton Hawaiian Village.  This is an ideal location to view the magical Hawaiian sunset.",
   "This place is gorgeous! Great beach for the family! Nice sandy beaches, and gentle waves. Just make sure to check the signs for man o war, as they can congregate here. Their stings will definitely ruin your day!"
  ]
 },
 {
  "name": "Honolulu Zoo",
  "address": "151 Kapahulu Ave, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c04fbeb6-9330-11ea-8c20-14b31f159f22.png",
  "tags": [
   "field",
   "walk",
   "kids",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=16581971013231599930",
  "source": "GoogleMaps",
  "reviews": [
   "This was a great zoo! The safari animal portion of the zoo was the best!!! It wasn't too crowded and we missed the all the school field trips which was perfect!! I really enjoyed the different animals they had. I have been to the biggest and best zoo's but the way this place was set up was fantastic. The staff was so incredibly helpful when. Buying a bottle of water and informing us that we can use the fountain machines to fill the bottle back up if we needed to. One of the smallest zoo's but one of the best at the same time. Great to see local species as well.",
   "We finally visited the Honolulu Zoo after living here for over a year. When we first moved here it was undergoing construction, and still has some underway. \n\nThe zoo is much larger than I expected. Looking at the zoo from the outside it appears small however it is quite spacious once inside. I am a bird fan so I was very thrilled with the aviaries when you first enter the ground. \n\nOnce past the birds you come to the larger animals. Such as the tiger, the elephants and such. The walk around the zoo was very calm and relaxing. the path is in the shade of trees whenever its possible and the nice habitats for the animals are interesting.  My trip to the zoo was near midday so the larger animals had gone for shade to escape the mid-day heat. I will have to go back again to see the exhibits I missed. \n\nI was so enjoying the Zoo I forgot to take very many pictures, a situation I shall have to remedy on my return trip.",
   "I loved how well taken care of the animals were. My favorite exhibit was going into the bird sanctuary and having them flying around me like they would in the wild. If course the kids loved the large animals like the elephants, tigers, and giraffe. The only thing that could have been better was having water filling stations.",
   "Really nice little zoo. Beautifully landscaped and nice enclosures that offer the animals privacy while still letting us view. Nice few hour stroll to get through everything. Became a member today, we will return!",
   "Great animals... great views... most important-- they treat the animals well.  Really enjoyed feeding time info sessions. Super knowledgeable.  Super loving!  I'd pay way more to support this place..."
  ]
 },
 {
  "name": "Ala Moana Regional Park",
  "address": "1201 Ala Moana Blvd, Honolulu, HI 96814, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c08e00ba-9330-11ea-9a60-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "walking",
   "food",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=841396098583325021",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely park and beach. Convenient and easy to get to. Lots of activities and seems family friendly. Great vantage point for sunsets and Friday evening fireworks. Wonderful place for outdoor fitness on the water and land. Across the street from major shopping center with pricey and eclectic food court.",
   "One of the best beach on Oahu considering easy access from Waikiki in addition to how beautiful and relaxing it is. \n\nI love walking from my hotel in Waikiki area to this beach. It's not crowded like Waikiki beach and I like that a lot. So if you wanna just go lay on the beach, relax and get in the water to cool down...on repeat like myself lol, this is the place to go. I see people hanging out there by themselves too so you will probably feel more comfortable doing so if you care.\n\nWater is calm and beach is long so a lot of room for people to hang without getting super close to each other. \n\nWe spotted some turtles poking their heads out too, which is always exciting to see no matter how many times you've seen it!",
   "Love this place (magic island too) \nBeen coming here since I was a kid!! The beach is super calm, no waves, they have 2 L&L’s there now, also they put a bathroom & showers on the Magic island side. \nPlenty of Grass on the park side, a work out course with plenty stations, tennis, lawn Bowling, & that’s always been enough for me so I never bothered to look for anything else... \noh, you can BBQ & have parties there too!!",
   "Great Park with plenty of green space to to kick/throw a football around, depending on your preference. There's a couple of shops on the centre offering food and drinks and there's also great toilet facilities here. The park has great proximity to the beach and the shopping centres where buses run from frequently.",
   "This is the first park/beach I visited when I was in Honolulu and we had a great time. In July the sun sets around 7, so if you go to the beach you should ho around 5. The sunset is incredible and the beach really calm. You can go for a walk in the beach too, as the water isn’t cold, which is great for everyone to get into."
  ]
 },
 {
  "name": "Pearl Harbor Tours",
  "address": "1649 Silva St, Honolulu, HI 96819, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c0e1c5ca-9330-11ea-b360-14b31f159f22.png",
  "tags": [
   "family",
   "tour",
   "tour",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3889655191681733262",
  "source": "GoogleMaps",
  "reviews": [
   "Our driver and guide cousin Shaq was an outstanding  person.  He was so kind and thoughtful to my brother who has a brain tumour. His understanding and patience was truly appreciated.  His knowledge of the places we visited on the island was terrific I recommend him highly.",
   "This amazing company has taken exquisite care of my family and our trips on numerous occasions.  The professionalism and attention to detail, all while treating you like a member of the family - or cousin - is beyond compare.  All of these pictures are shots from our trips with this awesome group!",
   "This Pearl Harbor tour was the best tour we have ever been on. Big shout out to JJ our tour guide. He was amazing and very informative. I would definitely recommend this tour group.  Check them out. You won’t be disappointed.   The Campbell’s 🤙",
   "Today, we went on the tour with our guide Fu’a (Fabian) and what an amazing trip and time!!! This was perfect! Fu’a is the BEST guide! His knowledge of Oahu and Hawaii in general was so appreciated, but also his smile, kindness and willingness to show us everything he could in a day. No regret that we booked with you guys, it’s been memorable!!!",
   "We had so much fun on our first trip that we went back again... and again!!  There's something for everyone.  I loved the adventures like diving with manta rays, snorkeling with dolphins, viewing volcanoes, hiking, swimming, horseback riding and just wondering around the towns we visited.  Others on our trip liked the historical tours like Pearl Harbor and Hulihee Palace.  Then there are the heritage and cultural experiences like Luaus and the Polynesian Cultural Center. There are also the movie set tours (Jurassic Park/World, 50 First Dates, etc).  And of course everyone loves the food!  I'm still dreaming about those pineapple upside-down pancakes.  We got shaved ice every day.  The company arranged most of our activities but we still had plenty of time to relax on the beach.  Our flights were booked, our transportation was arranged, our hotel rooms were booked, and our activity reservations were made.  Everything was included.  The guides are locals and you will feel like a member of their family before you leave.  A hui hou!"
  ]
 },
 {
  "name": "Koko Crater Railway Trailhead",
  "address": "7604 Koko Head Park Rd #7602, Honolulu, HI 96825, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c12cb1ae-9330-11ea-9499-14b31f159f22.png",
  "tags": [
   "walk",
   "field",
   "hike",
   "music",
   "kids",
   "family",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=968213005616863462",
  "source": "GoogleMaps",
  "reviews": [
   "A tough climb but truly worth it. You have to park in the car park near the baseball field and walk to the start of the railway. From here the gradient of the track gradually increases untill you reach the base of the mountain. From here it goes to easily a 70/75° angle for the majority of the way up. It must be noted that before this point there is an elevated, bridge like, section that runs for about 10 meters with a 5 meter drop below. The sleepers are spaced quite close together here but there is also an easy route to the right for those not keen on going over it. Once at the top the views are amazing in every direction with the sense of accomplishment when you look down at what you've just climbed backing them up. We did the walk when there was a few showers every now and then. This made the sleepers quite slippy so great care was needed on the way down. One of the best walks we've done on the island by far.",
   "Great trail. It’s definitely a hard hike with steep incline up and down. No shade on the trail so it’s best done early in the morning or later in day when it cools down. Two things need to be changed about this trail: 1. Ban speakers from the trail.  No one is interested in listening to your music so please use headphones and be respectful to other hikers. 2. There is shooting range nearby which disrupts the peace and beauty of this trail. Highly suggest timing your hike when the shooting range is closed. Breathtaking views form the top. Enjoy and stay hydrated.",
   "Amazing workout! Loved doing this with my family. Our 3 year old did it halfway up on her own and then my husband carried her. I had my 9 month old on my back. Took us 50 minutes to get up. We spent 30 minutes at the top and carried the kids down, taking only 35 minutes to get down. Don't do it if you have bad knees! So worth it to make it to the top!",
   "Great views for a short hike. Crazy busy hike. We decided to do this as a sunrise hike on a Sunday. We were not the only ones. We got there just after 6am and there were probably 20 other cars there too. Brought headlamps and started climbing. No need for hiking poles but would recommend hiking gloves as I was constantly grabbing the rails to help get up or down. Going at a slow steady pace we only had to stop a few times. I used the \"safe way\" around the bridge section, my husband did the bridge section. Most the rails were normal step height there were definitely some that were massive. We got to the summit around 645am. There were some locals that knew better and were already going down. Look at the nautical sunrise time if you want to see the sun peak over the horizon. We were up top exploring for almost an hour. Each side of the top has such different view. I believe this trail can continue down to Koko Arch too (but we didn't do that). Took us 45 min to get down at that point there were people coming up too. I can't imagine how busy this hike is during peak tourism season. If you don't have time for a 4 hour hike but want some views this one is a good one. We had a dry sunny day, would not recommend if wet and would recommend early in the day as there is NO shade",
   "Hard hike. You climb ~1000 stairs of all variations. Not maintained, so some areas have a 40 ft drop beneath the stairs. I'm scared of heights so I had to bear crawl my way through that section. The stairs get steeper on the top.\n\nAt the end, the reward is panoramic views of the Bay, Waikiki and a lot more of the island. You basically get a 360 view. Apply sunblock, bring water in a light backpack because you may want to use your hands in some areas of the hike."
  ]
 },
 {
  "name": "Tantalus Lookout - Puu Ualakaa State Park",
  "address": "Nutridge St, Honolulu, HI 96822, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c178b0b6-9330-11ea-be43-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=13981050253359018092",
  "source": "GoogleMaps",
  "reviews": [
   "Very beautiful views, rain or shine. Enjoy cruising with my significant other just to hear the rare birds living away from the city.. If you go further up the mountain there’s a beautiful park perfect for photogenic sceneries.",
   "Pretty drive and nice look out\nVery pretty drive and a nice view. I don't know if we would go out of way to do this, the weather wasn't great for hiking that day so were looking for something else to do. I feel like the loop too us 15-20 minutes to drive?",
   "Amazing view of the city, diamond head, and ocean. You can even see the airplanes landing at the airport. It's worth the drive up. Not a lot of parking at the top but there were not a lot of people.",
   "Great lookout with 270° views from diamond head, through the city of Honolulu to the airport and west side of the island. From the city it is approximately a 15 minute drive to the carpark of the lookout, which is very small so bare that in mind if arriving by car. The drive down has amazing views of the city and offers a place to stop and take photos. Deffinately worth the drive up.",
   "If you like steep, twisty switchbacks (which I do), to get to great views then this is the place. It gives you a massive area to see from diamond head all the way to Honolulu airport and Pearl Harbor. Get there just when it opens so you can catch the remnants of the sunrise."
  ]
 },
 {
  "name": "Honolulu Museum of Art",
  "address": "900 S Beretania St, Honolulu, HI 96814, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c1bce476-9330-11ea-8860-14b31f159f22.png",
  "tags": [
   "free",
   "delicious",
   "history",
   "art",
   "food",
   "knowledgeable",
   "art",
   "tour",
   "art"
  ],
  "link": "https://maps.google.com/?cid=3228498999430771335",
  "source": "GoogleMaps",
  "reviews": [
   "Went to the Museum during our trip to Hawaii. Our hotel, Alohilani (also fantastic) provides free entry to the museum with room key. My husband and I had a great afternoon exploring the exhibits in the outdoor museum. There was a new exhibit highlighting African American artists, which was being led by one of the museum's educators, which was informative and fun. There is a yummy little cafe and a cute coffee shop in case you need a snack!",
   "Great day to spend time to brush up on your art and artifacts history. To see amazing artwork from different cultures and time period throughout the history of the world. Beautiful place to come to explore history of the arts and dine on delicious food at their cafe. Wonderful for all ages.",
   "A real gem! So much amazing artwork! From early Roman to contemporary and all the good stuff in between!! The docents are knowledgeable and articulate - I learned so much and it just felt like a pleasant conversation. In addition to the art (Western, Asian from East to South and other cultures), the building is gorgeous with lots of little garden nooks. A coffee shop, gift shop and cafe round it all off. The perfect place to spend a rainy day.",
   "I loved the this museum. The open air courtyards are picturesque, each one inspired by a different location. There are many interesting exhibits but the tour of the Doris Duke museum of Islamic art takes the crown. Worth your time.",
   "The museum was great. Ordered Sunday Brunch  at cafe - vegetarian eggs Benedict. Beautiful plate arrived but both the eggs and sauce were not even warm much less hot. Obviously they had been sitting quite a while before being served. So very disappointed. Since I was alone and they didn’t really seem to want to wait on me anyway I just ate them."
  ]
 },
 {
  "name": "National Memorial Cemetery of the Pacific",
  "address": "2177 Puowaina Dr, Honolulu, HI 96813, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c2103488-9330-11ea-a8a0-14b31f159f22.png",
  "tags": [
   "free",
   "walk",
   "history"
  ],
  "link": "https://maps.google.com/?cid=10469634200304662144",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful memorial to those that lost their lives in battles in the Pacific. This is definitely a must see when your on the island of Oahu. It's about a 15 minute drive out of Honolulu and is free to enter. The grounds are wonderfully looked after and you have the freedom to explore them all you want. It is a drive around cemetery but you can pull up on the right of the road to get out and look around. Worth the visit and doesn't really take that long to look around the place.",
   "We searched and search punchbowl cemetery and finally found a very nice gentleman who directed us to visit our Papa whom we miss dearly.  12 of us came from California and were not going to leave until we visited him.  A big thank you to the nice security guard who personally escorted us to his headstone❣",
   "One of my favorite places to see in Honolulu. The best of you on the island. I love the peace and serenity here. Such a humbling experience being right next to so many great heroes.",
   "The Punchbowl Cemetery affects a person like no ordinary cemetery. The magnitude of sacrifices made to ensure our national sovereignty and therefore our freedoms is on full display here. Headstone after headstone reminds me to appreciate what they had to do on my behalf today. The immaculate grounds are kept up better than any other park on Oahu. That shows how high of respect is shown here. The wall murals depicting major engagements in the Pacific are an education in themselves. The walk up to the Punchbowl overlook is lined with memorials of appreciation. The view of the city and mountains is grand, but also of the size of the National Cemetery.",
   "This is a must do and see when visiting Hawaii.  It has some of the best panoramic views of Waikiki to the Eva plains.  If you can get past the construction cranes ruining the views from all the new developments, it is an amazing view point of picture taking.  At lease Diamond Head is unobstructed for now.\n\nIt is very easy to get to via car and right outside of downtown Honolulu as well as only a few miles from Waikiki.  The memorial it's self has an amazing pictorial history of the wars with a focus on WWII.  It is just an amazing construction to pay tribute to those who served during those times.\n\nYou don't need much time there, maybe an hour tops depending on how much looking around you want to do.  Once done, it is easy to get back on to what ever other site seeing you are doing."
  ]
 },
 {
  "name": "Shangri La Museum of Islamic Art, Culture & Design",
  "address": "4055 Pāpū Cir, Honolulu, HI 96816, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c258d698-9330-11ea-a468-14b31f159f22.png",
  "tags": [
   "tour",
   "art",
   "tour",
   "knowledgeable",
   "tour",
   "art",
   "art",
   "knowledgeable",
   "tour",
   "art"
  ],
  "link": "https://maps.google.com/?cid=5543683494019762302",
  "source": "GoogleMaps",
  "reviews": [
   "Shangri La Museum is like stepping into a whole different world of Islamic culture and art. Last time I was there was back in March 2003. I traveled with my parents and we met the global international facility as guests. We took the Shangri La Tour with the University of Hawaii Faculty. I simply had a blast and yes you have to dress up nice. The seabreeze was great to cool off.",
   "There are no words to describe how beautiful this plablce is. We really enjoyed our tour and the guide was knowledge and conversational.",
   "If you get the chance, definitely do the Shangri-La tour!!! Really cool experience and a chance to see art dating as far back as 1200 Persia (or something like that). The house is incredible and very inspiring. Plus the views are just amazing! Our tour guide was also very friendly and very knowledgeable about Doris Duke, the art, and the home. Would definitely do this one agian.\n\nPS. I posted several pictures but left some out for you to discover on your own, enjoy 😎🤙",
   "This is another place to add to your visiting list, especially if you're local.  You need to make arrangements through the Honolulu Academy of Arts to see it - don't bother showing up to the site otherwise - but it's well worth the effort.  They have an impressive array of Islamic art and architecture; quite remarkable considering this was a private residence.",
   "I visited Pearl Harbor, I hiked Diamond Head, but I think Shangri La was my favorite thing I did during my time in Honolulu. It's such an amazing place with so much art and gorgeous views. It's hard to imagine anyone ever actually lived there. We also had a great tour guide (wish I could remember her name!) who was very knowledgeable and relaxed with the tour. I recommend this to anyone visiting Honolulu who is even mildly interested in art.\n\nMake a reservation in advance, and note that this is a guided tour that takes 2 hours. The only way to get to Shangri La is on the tour shuttle that leaves from and returns to the Honolulu Museum of Art. In other words, you can't go park at Shangri La and then leave the tour whenever you want. So plan your visit beforehand!"
  ]
 },
 {
  "name": "Duke Paoa Kahanamoku Statue",
  "address": "Kalakaua Ave, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c29a2562-9330-11ea-82b2-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=10095675863439327367",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic statue of Duke Kahanamoku!  The society does great work with keeping the statue well preserved and beautiful, plus there is no shortage of leis adored around Duke’s arms and neck.  It’s a beautiful reminder of Duke Kahanamoku’s legacy and his representation as an ambassador to the island’s strong surfing culture.  An absolutely wonderful must see location.",
   "A trip to Waikiki isn't complete without checking out and getting pictures of the Duke statue! There are always tourists surrounding it so that's a sure sign it's a must-see attraction. I love how leis are around the statue's neck. With the palm trees and glistening water of Waikiki Beach in the background of the statue, it's really a picturesque part of Waikiki.",
   "Stayed in hotel across the road. Very popular statue for tourists. Cool cultural aspect to the beach.",
   "A trip to Waikiki Beach isn’t complete without stopping by the Duke Paoa Kahanamoku SHRINE without paying homage to the GOD of surfing. \n\nThis man surfed his way to FIVE Olympic medals, mastering his craft on a board that weighed 114 pounds. \n\nLocals and visitors stop by daily to adorn his outstretched arms with leis to pay homage to a master of his craft.\n\nTime it just right, and you can enjoy a world famous Waikiki sunset on the iconic Kalākaua Street. \n\nALOHA!",
   "Nice statue that gets lots of attention. People constantly taking pics and placing lej on it. Can be tough to snap a nice angle. \n\nHomeless people wandering around the area screaming random obscenities also adds a nice touch."
  ]
 },
 {
  "name": "Lyon Arboretum",
  "address": "3860 Manoa Rd, Honolulu, HI 96822, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c2e3639c-9330-11ea-beb2-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "free",
   "hike",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=7638451036224466539",
  "source": "GoogleMaps",
  "reviews": [
   "Lyon Arboretum offers a pretty fun and easy way to see a lot of Hawaiian animals and plants (native and invasive alike). I especially enjoyed getting to see the myriad birds that frequent the park. Definitely take the time to hike up the waterfall trail and explore the side trails, though you'll want to try and shoot for dry weather when doing so. Overall, it's a great place to hike for a few hours.",
   "Very beautiful and peaceful 1 mile hike inside the rainforest. The hike ends with a small waterfall. Make sure you have bug spray on before attempt to hike. Also it can be muddy so hiking shoes would make it more enjoyable. It’s free and less crowded in the morning.",
   "This place is beautiful. I just wish there were slightly more trail marks in the more remote areas. Be prepared for mud and mosquitoes in the side trails, but you can avoid them if you stick to the major paths. There is enough variety in the different garden areas to make several days of exploring.",
   "Beautiful place! Well maintained trails, but slick when raining. The poncho at the gift shop was very useful since we had a downpour. The falls at the end of the hike were gorgeous, especially since it had been raining.",
   "Such a wonderful experience again at the Lyon Arboretum,  we loved it! \nIt was second time for us with my husband and we're another path then before,  breathtaking views and some steep hiking as well!\nNature is beautiful and the vegetation/flowers are amazing!\nHighly recommended to all ages who loves Nature!\nManoa Falls Trail was very busy today,  but not too muddy,  so we could do it easily.......\nAloha🤙\nPearl and Peter"
  ]
 },
 {
  "name": "Ho’omaluhia Botanical Garden",
  "address": "45-680 Luluku Rd, Kaneohe, HI 96744, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c337020a-9330-11ea-a997-14b31f159f22.png",
  "tags": [
   "free",
   "free",
   "walking",
   "walk",
   "kids",
   "free",
   "food",
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=9207507988096413480",
  "source": "GoogleMaps",
  "reviews": [
   "A nice, calm place to spend an afternoon! It's very well maintained. There's a paved walkway with labeled plants and a dirt/rock path that leads to the lake. The lake is man-made but it's fun with ducks and plenty of fish, all sizes. They're all hungry if you want to feed them. Bring a blanket because there's a large grassy area to settle down at. We visited later in the day so parking wasn't difficult, but they have more than one lot. It's free!",
   "The plants are beautiful.  The area is beautiful.  The constant feeling of being policed and the not-so-subtle racism is not beautiful at all.  Basically, if you are Hawaiian you will be treated like you are trying to steal something, or might practice your actual legal gathering rights (gasp) in the wild areas.   Unless, of course, you are a known hula practitioner who has done all the formal hoops of working for them for free while agreeing to their extremely colonial restrictions.  \nThat being said, it is a beautiful place with lots of cool stuff.   Meeting rooms are useful places for meetings (I mean, you expect bureaucracy there, right?), as are the picnic tables. Nice bathrooms, peaceful feeling when it is not being interrupted by employees with nothing better to do than drive around in their little carts and constantly assert wannabe cop authority, or just give the impression that they might.   \nFor local settlers: the apparent uniform here consists of walking shoes with socks, khaki shorts, and a hat, preferably with a store-bought walking stick and an assertive stride.   Heed this dress code, or they might mistake you for one of those damn natives.   \nAnd you don’t want that.",
   "Beautiful and peaceful. And great place to walk after gates close around 4pm. \nJust wish they didn't add the ugly cones and signs along the road near the entrance. Seems like a dramatic overreaction to folks who take photos. I think there are other ways to address the issue without ruining the ambiance for others.",
   "This was such a beautiful outdoor experience for my husband, 2 kids and I. Free entrance, parking, and fishing. Bamboo poles can be borrowed for free! Clean bathrooms and grounds. Very picturesque, nice, easy walks. Very friendly and informative staff. Park in the designated stalls only, and don’t be foolish and try to take a picture in the middle of the road where it’s clearly marked not to. Bring food, water, sunscreen, hat. There are water refill stations at the visitor center. We’ll be back.",
   "Nice place to have a look around if your in the area. Entry is free and from the front gate it's about a mile to the visitor centre. From here you can go down to the lake and look around the galleries. You can also drive around the gardens to the dedicated sections from around the world, however you will not see the lake this way. There's also a look out that you can park and walk up to that overlooks the gardens. The park has the mountains to the back of it which provides an amazing backdrop to photos taken here."
  ]
 },
 {
  "name": "Kahanamoku Beach",
  "address": "Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c37f55ee-9330-11ea-afe8-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=17626686286220233259",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful beach located next to the Hilton Village. Nice place to relax during the day with plenty of rocks and coral in the ocean to look at. This is also a nice place to catch the sun set and on a clear day you can watch it dip beyond the horizon. It is also a good spot to catch the Hilton fireworks on Friday nights starting at around 7:30/7:45. There's showers and public facilities along the promenade.",
   "Nice beach — sand is a bit coarse in places. There’s only about 5-10ft (depending on tide) of non-rocky wading before getting into some less pleasant surface to stand on. Beach officially doesn’t allow alcohol on it, but the rules seem pretty relaxed. Most people are drinking casually. Waves are pretty absent. Overall, not bad — Still Hawaii so you can’t complain!!",
   "The Hilton Hawaiian Village Lagoon beach is a great spot for swimmers of all levels from novice to expert. even thrill-seeking adventurers can be seen plan@ Boogie boarding snorkeling to ripping the waves out at Kaiser's world famous surf spots quote the Kaiser Bowl on quote from your little cake he's too seasoned citizens of all ages... The view is unspeakable with the Hilton Hawaiian Village rainbow Tower hovering above with its beautiful mural and LED lights at night panoramic in the scenery of scenic Beauty!",
   "This is an amazing beach, I highly recommend checking it out. Due to the coral in relatively close proximity the water on this side of the island is much warmer than it is elsewhere. Warmer than Hanauma Bay and much warmer than it is at Waikiki. The surf here is very calm, hardly any waves at all, we took our 3 year old here and she has an absolute blast.\n\nThe sand here is unbelievably fine, it feels incredible. This is a launch location for Kayak tours, so you will need to be mindful of that, but there is a designated swim area that they are not allowed to paddle around, only launch out and come back in through.",
   "Beautiful views of Diamond Head in the background!  Small, course sand with a lot of rocks.  Nice and quiet in the morning but near noon, there’s a lot of people.  Excellent place for wedding on the beach photos, in the morning"
  ]
 },
 {
  "name": "Nu‘uanu Pali Lookout",
  "address": "Nuuanu Pali Dr, Kaneohe, HI 96744, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c3cdeb68-9330-11ea-a7c4-14b31f159f22.png",
  "tags": [
   "history",
   "free",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=14517673050352653783",
  "source": "GoogleMaps",
  "reviews": [
   "The view is incredible from this lookout and the plaques throughout the attraction share some history as well. It's a great place to really appreciate Hawaiian culture and their history even if what happened here wasn't great. When we went it was pretty windy so maybe bring a light sweater with you just in case.",
   "The lookout is free. But you have to pay a flat rate parking fee of $3, regardless of the time you spend 'looking out'.\nSomeone is always watching/supervising/policing the lot. \n🚙 Be careful. \n\nYou won't regret the $3 fee. The Pali Lookout is amazing and a great photo op.\n\nAloha.",
   "DEFINITELY a spot you MUST visit. Do whatever you need to and get up here! There is a easy drive up here or you can do what we did and hike!\n\nThe view is fantastic and the wind gets really crazy! It's really cool to stand up here by the ledge and enjoy the view of the mountains on both sides, green everywhere and the city and the sea in the distance!",
   "This place is breathtaking. The views are phenomenal and is a must do when on the island.\nI recommend going before the sun starts to set as the light conditions are so much better in the morning, or around midday\n\nYou have to pay a set fee for parking but it is valid for all day.",
   "This lookout has the most stunning views of the island. High up in the mountains the view looks down the settlements and forest below. Parking is $3 no matter how long you stay. We only stayed for the lookout but there is also a few trails to do. All the money from parking goes to the upkeep of the area. The lookout is about a minute from the car park so we only spent about 10 minutes there. It gets extremely windy up there so you'll need to hold on to your hat."
  ]
 },
 {
  "name": "Koko Crater Botanical Garden",
  "address": "7491 Kokonani St, Honolulu, HI 96825, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c43a9012-9330-11ea-aeac-14b31f159f22.png",
  "tags": [
   "art",
   "hike",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=16109351853749081144",
  "source": "GoogleMaps",
  "reviews": [
   "Cons: Limited paths and large stretches of common weeds between exhibits.\n\nPros: Curated areas have amazing specimens of unusual plants from all over the world. I went to the upland palm exhibit. The plumeria grove at the entrance is amazing. They were just starting to bloom now (start of second week of February) I suspect that at the end of the month it will be full of gorgeous blossoms. It would be an awesome spot for a picnic.",
   "This is a bottom of Koko crater, so it may be very humid and hot depending on the day and season. But if you took the right day, it is such a peaceful short hiking site with cool breeze. Especially around the entrance area has tons of plumeria trees, smells really good! Going with a pair of shoes is recommended.",
   "Gorgeous garden! It's in a very dry part of the island, so there's lots of cacti and trees, but it's not super lush-green like the gardens on the windward side (eastern coast). There's tons of plumeria trees and benches underneath. A great place to relax, read a book, make art, or meditate. There's also a 2-3 mile dirt road around the property that makes for a beautiful afternoon stroll to see plants from all over the world growing in harmony. It's also a great place to escape crowds as well, as it's normally quiet.",
   "Well worth the hike up. You won’t think so on the hike down though.  Beautiful views all around. Good!",
   "It was nice, quiet, and peaceful. My girlfriend and I had a nice time walking through. Lots of flowers and cool trees from all over the world."
  ]
 },
 {
  "name": "Waikīkī Aquarium",
  "address": "2777 Kalakaua Ave, Honolulu, HI 96815, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c4953382-9330-11ea-ac3f-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=6730453467101991303",
  "source": "GoogleMaps",
  "reviews": [
   "Short walk through exhibits  We went through twice. Loved the fish and seahorse exhibits.  We did this before our flight going home. Not expensive at all. Gift shop was small but I found great unique items. Beautiful walk along the beach.",
   "Within easy waking distance of Waikiki Beach. It has nice displays, several beautiful tanks, a large fish gallery with a shark, and an adorable leopard seal outside 😍 the sea dragon's and several seahorses tanks were an absolute favorite. Would make for a great stop for families with small children. Indoor and outdoor exhibits. It's not a huge facility but it is nice, has clean restrooms, and a cute gift shop. Oh, and the jellyfish tanks are very pretty too!",
   "Almost feels like this attraction should have been part of the zoo due to its location and size. Nothing too spectacular here. Just your run of the mill aquarium. The sea lions are cool if you arrive on time to see them.",
   "Moderate sized aquarium with a rich history run by the University of Hawaii.  We spent about 90 minutes going through at a modest pace, which I felt was perfect.  Really enjoyed the jelly fish, octopus, and tropical fish exhibits. Very few dedicated parking spots, just plan on parking elsewhere and walking a bit.",
   "The Waikiki Aquarium contains the right amount of exhibits for a visit. There are enough exotic specimens to interest about anyone. They have less outdoor exhibits than some bigger aquariums; but I don't think many folks would stay out in that tropical sun very long anyway. I was able to put into use the advice the marine biologist gave about the proper distance to stay away from a beached monk seal. I encountered one and did accordingly with no incident."
  ]
 },
 {
  "name": "Try Scuba Diving Honolulu",
  "address": "Magic Island, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c4d6a9b0-9330-11ea-ac14-14b31f159f22.png",
  "tags": [
   "tour",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=7844587105788526738",
  "source": "GoogleMaps",
  "reviews": [
   "Go try this if you want an awesome peaceful experience on the island. It's a short tour around the lagoon. We saw a ton of fish and coral.  Zola is a great instructor and very chill. He will make sure you understand everything and are comfortable with what you are doing. It was a very relaxing experience!",
   "I was really unsure about doing this but it ended up exceeding all of my expectations. It was super fun and well worth the price. Bruce was our instructor and was really cool and helpful. He took great care of our group and made it all seem pretty easy. I would highly recommend doing this.",
   "Highly recommend \"try scuba diving\"! Bruce and violet were great instructors and love what they do. They helped all of us individually so we all would be comfortable. Nice remote location with little to no people on beach or in water. \n\nThis experience will be for people that haven't scuba dived or is interested in getting into it",
   "Best experience yet on the island!  I was a little hesitant about which company to go with, but Try Scuba Diving was awesome!  Bruce and Violet were great getting us comfortable and making sure we were all ready before taking a deeper plunge to deeper waters.  Highly recommended if you have a couple hours early in your day.  DON'T EAT before you dive.",
   "Zola was an amazing instructor! I am excited to come back and get certified as a diver with him. :)\n\nSide note - someone else was in trouble and Zola was able to go rescue the person even before the lifeguard could get to him. Felt super safe with him all the time."
  ]
 },
 {
  "name": "Children's Discovery Center",
  "address": "111 Ohe St, Honolulu, HI 96813, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c544d4e4-9330-11ea-9da4-14b31f159f22.png",
  "tags": [
   "food",
   "library",
   "organized",
   "food",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9124985480296315961",
  "source": "GoogleMaps",
  "reviews": [
   "This place was one of the best things to do with my toddler. He absolutely loved it as did we. So much to see and do. Super friendly staff. Super clean environment. We only stayed about 2 hours but he could have played there all day. There is a cafe there to get food which is nice but they only accepted cash. Cant think of anyway this place can be improved exact cards accepted in the cafe\n\nPlease give me a \"like\"!",
   "It's a place I take my son's to let their imagination run wild. A variety of cool things to keep your child occupied. It's also a nice escape from the heat",
   "This is the best children's museum in the entire United States! The entrance price is great, as well as the way the center is organized. Downstairs is dedicated to gigantic body functions, community service jobs, restaurant chef, police, dentist, baseball hitting practice, race cars, and then a whole room dedicated to reading with an actual library with about 500 books, a gigantic reading chair, a real storyteller/reader. Then the next two floors are dedicated to the other Polynesian countries with dress up clothes, play food, games, books, culture activities as well as an airline flight simulator that really works, and every area has full costume dress up for what ever the activity happens to be, such as a pilot, airline hostess, etc. If I lived here full time, I'd have a membership. It's fantastic!. Oh, and the cafe has the most reasonable prices I've ever encountered.",
   "I went with my family. It was much improved from the last time I went. Though it is pricey in my opinion. We really enjoyed the waterplay area.",
   "This is a great place for children...preschoolers to elementary.  Everything is \"hands-on.\"  No matter what style of learner a child is, their interest is captured, i.e. auditory, oral, kinesthetic, visual.  It does not matter if a child has challenges or is advanced, this is the place to bring your child(ren).  💞\n\nAs for \"big kids\", they have things for us to do, too.  My favorite place is the Story Room...the big over-stuffed chair and wall to wall books!!  I'm sure you can find your favorite!!  And let's not forget the fireplace.  All that makes for a cozy place to be!!  I failed to mention, there is a rocking chair, too.  😉"
  ]
 },
 {
  "name": "Kūhiō Beach",
  "address": "2453 Kalakaua Ave, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c589311c-9330-11ea-93bc-14b31f159f22.png",
  "tags": [
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=17413385378315184132",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful beach. You can enjoy more still water because of the breakwater, and this part of the beach alongside Waikiki seems more quiet in general. There are many people around but that definitely doesn't mean it's not relaxing and enjoyable. You can take in the sunshine and all the beauty of the place! If you want waves and action, go on over to Waikiki Beach; this isn't your place.",
   "Great for all ages. The sea wall provides an area protected and sandy and warmer waters. Great fit paddle boating and surfing. Crowded, your typical busy beach located in the heart of Wikiki.",
   "We came here because we have small children and the beach here is protected by a rock wall and the water depth is very shallow up to the wall.  Beautiful beaches at an iconic part of Waikiki.",
   "Calmer than the rest of Waikiki. Has walls around it to keep the surf down. Great for smaller kids, but still in the heart of Waikiki.",
   "Was a great kid friendly beach.  With the rocks there it made it very nice for the kiddos, perfect ocean swiming for younger kids."
  ]
 },
 {
  "name": "Foster Botanical Garden",
  "address": "180 N Vineyard Blvd, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c5e0ee5c-9330-11ea-9dea-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "walking",
   "tour",
   "wander"
  ],
  "link": "https://maps.google.com/?cid=16539608677740877674",
  "source": "GoogleMaps",
  "reviews": [
   "Great lush garden full of beautiful foliage and varying trees. Cute little conservatory housing different orchids and leaf hybrids. I loved listening to the bird songs that were all around and the butterfly garden is great. Definitely worth $5 just to come see the cannonball tree and rainbow eucalyptus. ($3 for residents, $25 for a year pass) The paper map they give you is easy to navigate and informative. I'll definitely be back often!",
   "Great little sanctuary in Honolulu. Wonderful old trees and a variety of other trees and shrubs.  Not very many were flowering while we were there, but that could be the time of year.  There were a number of orchids and other flowers in the conservatory.\n\nLast, but definitely not the least, is a rainbow eucalyptus.  It was tough to get good pictures due to the time of day and angle of the sun, but it was very pretty.",
   "WE went to 3 botanical gardens in Oahu and this was THE BEST of all of them. And the best of any botanical garden in the states that we have been to. We saw SO many birds and lizards and the trees are incredible. The grass is so soft you could walk on it with just your feet. I am not uploaded all of the photos of the TREES because you will just have to go see for yourself. I would literally bet anyone $100 that they will be amazed when they come to this place and I would be rich.",
   "This was one of my favorite botanical gardens. The guide was very informative, and we felt like we left really understanding the collection and its value. \n\nThere are parts of this garden that are NOT paved, so wear shoes you don't mind getting a little muddy. If it does rain, while you're there, then the garden does have umbrellas available for you to borrow! Definitely at least take a picture of the bird checklist too before you start walking the garden. We saw so many unique birds and I was grateful I took the photo to carry with us.",
   "Beautiful. Lovely landscaping. A nice relaxing escape in the middle of a bustling city. Beauty everywhere, and you can stay and wander the grounds as long as you like. They also have a guided tour at 10:30, it's recommend calling in advance to secure your spot. Picture just can't even begin to express the beauty."
  ]
 },
 {
  "name": "Koko Head District Park",
  "address": "423 Kaumakani St, Honolulu, HI 96825, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c63c7c08-9330-11ea-8a2a-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "family",
   "nature",
   "family",
   "walk",
   "field",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=3040610435395897318",
  "source": "GoogleMaps",
  "reviews": [
   "This is my all time favorite hike. It's a straight shot, and is a good medium difficulty, but they only time I've seen anyone turn around is my cousin and her friends because they were convinced there were giant centipedes everywhere. Which, maybe, but chances are pretty high that you could avoid them if you saw them, (I haven't), but anyway. The hike is great, and the views are better. There are a couple of good vantage points and some rock surfaces to sit on close to the edge, just be aware that it's a fall you should probably avoid",
   "My family and I visited Koko Crater Regional Park for a quick hike to get a little exercise and see some great views. Koko Crater Trail is a 1/2 - 2 mile trail that is definitely very heavily trafficked out and back. The trail is located very close to Honolulu, Oahu, Hawaii that features beautiful wild flowers, spectacular views and is primarily used for hiking, running, nature trips, and bird watching. The trail is rated as difficult and is accessible year-round.",
   "Truly enjoyed the experience here at the park where it wasn’t super busy and you can enjoy the waters. There was fresh water to wash off sand and lots of cranes chilling around the park. Loved spending time with my family here and would definitely do it again and it’s so beautiful and relaxing to be at!!! Highly recommended!!!",
   "Did the railway hike here. Its a tough climb but truly worth it. You have to park in the car park near the baseball field and walk to the start of the railway. From here the gradient of the track gradually increases untill you reach the base of the mountain. From here it goes to easily a 70/75° angle for the majority of the way up. It must be noted that before this point there is an elevated, bridge like, section that runs for about 10 meters with a 5 meter drop below. The sleepers are spaced quite close together here but there is also an easy route to the right for those not keen on going over it. Once at the top the views are amazing in every direction with the sense of accomplishment when you look down at what you've just climbed backing them up. We did the walk when there was a few showers every now and then. This made the sleepers quite slippy so great care was needed on the way down. One of the best walks we've done on the island by far.",
   "The whole hike follows a deserted train track. It has a hollow portion in the middle (but there is a safe path if you are not comfortable with height) and is pretty steep in the last portion. The view at the top is amazing and the hike is a good workout! It's better to have proper shoes, not sandals."
  ]
 },
 {
  "name": "Makapuʻu Beach",
  "address": "41-95 Kalanianaʻole Hwy, Waimanalo, HI 96795, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c68c70f0-9330-11ea-add9-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=166299317273660154",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful beach, I come here every time I go to Oahu. Currently the beach is “closed” according to signs but people still can go on the rockier areas towards the tide pools and smaller pockets of sand as opposed to the main beach. It’s super peaceful and there aren’t many tourists in the winter/early spring due to the riptides.",
   "Nice beach to enjoy some tide pools and look for creatures amongst the rocks.\n\nAlso fun to play in the waves and relax on the beach (not crowded at all).\n\nDownside is it's pretty rocky.",
   "The beach was breathtakingly beautiful with bright blue water against dark volcanic rocks. We didn’t see anyone in the water because the surf was strong that day. Not a very busy place, we only saw a handful of other people wandering around. A must stop if you’re in the area just to take in the beautiful scenery. Restroom facility was decent.",
   "It was a very pretty beach. The fish were all different colors. The water was very cold.but I loved it.",
   "Beautiful beach, but get there early to avoid the crowds. Easily accessible restroom and shower facilities. Big surf."
  ]
 },
 {
  "name": "Spitting Cave",
  "address": "7 Lumahai St, Honolulu, HI 96825, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c6d11b3e-9330-11ea-ba9a-14b31f159f22.png",
  "tags": [
   "kids",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=3205652682025803084",
  "source": "GoogleMaps",
  "reviews": [
   "Easy to get to. Beautiful views. Keep an eye out to the right and you'll often be able to see a few sea turtles if you hang out long enough. The cave is really cool to see and can give you some awesome video. It's never been really crowded in the few times I've gone. Take a short trip to China walls of you're in the area as well.",
   "Just simply beautiful. Be very careful when you're out there do not fall off the cliff or slip. Great place to watch the sunset, or fish.  The waters are incredibly clear and blue, and The Rock lava formations beautiful.",
   "Breath taking views , best views and picture taking during mid day but caution its very tricky going down the path to see this beautiful place so please use your own discretion when going down the path and when going back up its also much more harder when going back up. I do not recommend young children going down there cause its very dangerous as for young teens its up to the parents to decide if its safe for them( sorry young ones and teens I'm only looking out for everyones safety). I recommend using shoes when going here...there is street parking in a quiet safe neighborhood. Overall the reward is breathtaking Have a much Aloha stay.",
   "Fantastic spot to view the cave from a small cliff. The waves bounce off the walls making the cave \"spit\" it back out. Great vistas of diamond head too. Lot of the kids like to jump off the cliff here but it's dangerous as the shoreline is rocky and the ocean currents can be strong. Definitely not recommended. But you can get some cool pics and watch the water spray off the cliffs and cave. It's a short hike down. Steep in some spots but short. It's easily doable. Great spot to visit while on Oahu.",
   "I could have sat watching the cave for hours. Also spotted some whales and a sea turtle. It's a great place to watch a sunset. The pathway down is not for the faint of heart."
  ]
 },
 {
  "name": "Mānoa Falls Trail",
  "address": "Na Ala Hele, Honolulu, HI 96822, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c72a8638-9330-11ea-946c-14b31f159f22.png",
  "tags": [
   "family",
   "hike",
   "walking",
   "hike",
   "hike",
   "free"
  ],
  "link": "https://maps.google.com/?cid=17761571952313762704",
  "source": "GoogleMaps",
  "reviews": [
   "A family friendly trail if you are brave enough! Make sure to wear comfortable shoes as it gets slippery and mud! Great views the whole trail! Very humid!",
   "Very awesome hike. Only .8miles. Lots of older people on the hike, but most definitely experienced. The hike itself when my wife, daughter, and I went was very muddy and slippery. Lots of bamboo to choose from for walking support though. It's worth it, to see the 50ft waterfall!",
   "Absolutely loved this trail. It is so beautiful, and in the first bits of the hike, you get stunning views of the area that basically makes you think you're in Jurassic Park. The views are unbelievable, and with the birds chirping, truly feels like paradise. Past that though, it starts getting quite damp and muddy, and very easy to lose your grip. The park has considerately places rugs on these paths to help you get a good foothold. But still, it is very muddy since it's a rainforest area. At the end of the trail is a waterfall. Unfortunately for us, the waterfall wasn't full but rather a dinky little thing. \n\nThe park provides a washing station for your shoes after the hike. There are also washrooms available. Parking fee is $5 but the parking lot is a mess because the lot is small and tough to accommodate all of the people visiting. The park is closed for majority of the week due to maintenance so check the times before you go. \n\nAlso please be considerate. The paths are narrow and the tourists are so rude. They cut people, push oncoming people. Be patient so everyone can be safe and enjoy the hike.",
   "Parking was easy for the $5. The trail was beautiful, but very muddy and slippery. Also very crowded, so there were bottlenecks in places the trail was narrow. Beautiful falls! I wish people would be considerate and obey the signs!",
   "This is a nice, fairly easy hike. I think it's less then 2 miles back and forth but can be very, very muddy (be careful on slippery rocks). Wear shoes that can get dirty and plenty of bug repellent. Lots of pretty trees/forest, bamboo, and creeks to see. The waterfall isn't super majestic (especially depending on amount of rainfall) but it's still beautiful. We always have fun stomping through the mud and laughing at each other trying not to slip on our butts. My 3 year old was able to manage this hike with very little assistance. \n\nThere is a parking lot that costs $5 or you can always park farther down the street for free. And thankfully there is a water hose in the parking lot you can use to wash off the mud."
  ]
 },
 {
  "name": "Wiliwilinui Hiking Trail",
  "address": "2390 Okoa St, Honolulu, HI 96821, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c77969ae-9330-11ea-92c9-14b31f159f22.png",
  "tags": [
   "walking",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=6520974776193357778",
  "source": "GoogleMaps",
  "reviews": [
   "This trail is a treat, it’s well worth the couple hours walking to the Summit. It hadn’t rained so the path was not muddy, though some spots had ropes if you required. We hiked at midday and were happy with a number of covered spots along the way to shade us on the ascent. The lush greens and the gorgeous blue sky led the way with sweeping views down the valley and towards the sea.",
   "Amazing views, but got stuck there during longer than usual rain when the trail turns into a muddy river:) although afterwards it's fine. Couldn't go all the way to the top  - too slippery for me, and all of sudden developed a fear of heights 🤷",
   "A simply amazing hike! Take a taxi there and you won't have to worry about parking. The hike takes you all the way up the mountain along a ridge, so there are views for days all the way. Bring a jacket or something warm for the top - it can be very windy and sometimes wet too. Prepare for muddy conditions, and some strenuous climbing. Lots of traffic here but worth it!",
   "AMAZING! the trail gets difficult for the last 3/4 mile up but it's worth it. Go slow and watch your footing. Once you get to the top where there's a radio tower, go to the left and continue the trail to the next peak only a little further away. There is a bench to sit down on and you can look over the other side. Also a great spot to watch the clouds roll over the crest of the mountain.",
   "Beautiful hike. It started down pouring while we were up there but it was still fun. Would recommend. It is alot of steps but feels good when your up there. I recommend going on a non cloudy day."
  ]
 },
 {
  "name": "WWII Red Light District Tour",
  "address": "1130 Bethel St, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c7d71a4a-9330-11ea-b664-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "tour",
   "tour",
   "free",
   "tour",
   "history",
   "tour",
   "history",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=8332527273860951867",
  "source": "GoogleMaps",
  "reviews": [
   "Great tour!  We had a lovely time learning about WWII and all of the history within China town. Carter also has a vast amount of historical knowledge about other sites and times of Honolulu,  and we loved hearing about those, as well. Great tour for both  history buffs as well as those not as familiar with the time (we had both in our group!).",
   "Great tour!  Had fun learning about a side of WW2 that is not talked about.  Highlight was the Smith Union Bar, my husband laid his Dad's WW2 picture from China town in 1942 on the bar and did a shot of Whiskey with the owner.  Papa's shot was poured out in his honor.  We put this in the must do category if you are on Oahu.",
   "If you're in downtown Honolulu and have a free morning or afternoon, go on this tour! I did it...twice! That's how interesting it is. Carter brings the era and its characters back to life.",
   "I highly recommend. Great tour and fun, informative guide. She has wonderful stories and photos to help you get the feel of that time. She is not just a tour guide but a history buff and continues to research the history of the area.",
   "Great tour by Carter! Fun presentation and walking tour - We have come to chinatown for ages for food, snacks etc - but Never knew the WWII history of the area. Definitely recommended!"
  ]
 },
 {
  "name": "Lulumahu Falls",
  "address": "4459 HI-61, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c82401f8-9330-11ea-aacd-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "walking",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=14001594044718525855",
  "source": "GoogleMaps",
  "reviews": [
   "A truly exhausting hike with a nice pay off! I haven't been hiking in about 10 years & yet I thought I would be prepared for this. The mud, rocks, and trees are NOT a joke on this trail. If you're an avid hiker I'm sure that won't be a problem for you, but the constant slipping and ducking and hoisting and tip-toeing on rocks across the river were quite exhausting for this novice. Sunning view at the falls made it worth it though!",
   "Great hike. Wear hiking shoes or shoes you are ok with getting muddy. You'll cross the stream a few times and the ground is slippery and muddy. I would recommend using a walking stick or a piece of bamboo. Well worth the hike to the falls!! Absolutely stunning water fall!!!!",
   "Awesome hike, made me feel like a wannabe jungle explorer. Shoulda brought my machete, whip, and Indiana Jones hat! Definitely wear water boots without socks. It's a muddy and wet trail. Several ankle deep river crossings. Very slippery from all the mud and algae on rocks. Not for folks that like to stay clean and tidy. Sometimes, it's fun to be dirty!",
   "We missed the initial right turn sign from the parking lot and ended up following the access road back and picking up the trail behind the back fence.\nThe trail crosses back and forth over the stream. There are several options, many marked with ribbons. Just don't stray far from the stream. The trail can be very muddy.",
   "Fun little hike.  Most challenging part was finding the right trail at the onset. Luckily some locals were about and pointed us in the right direction."
  ]
 },
 {
  "name": "Hanauma Bay",
  "address": "7455 Kalanianaʻole Hwy, Honolulu, HI 96825, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c8816494-9330-11ea-884d-14b31f159f22.png",
  "tags": [
   "food",
   "cheap",
   "free"
  ],
  "link": "https://maps.google.com/?cid=12353983521499366277",
  "source": "GoogleMaps",
  "reviews": [
   "Swim in a real-life aquarium! Great 1/2 day trip. Water is crystal clear and the fish are plentiful, and come in all shapes and sizes and colours. Parking is limited so we decided to take the #22 bus from Waikiki which was easy and convenient and only $2.75 each way (one bus every hour/ 45 min journey time). The bus will drop off and pick up in the car park at Hanauma Bay. \nWe arrived at 08h45 and the beach was quiet, but it got pretty busy very quickly. \nSnorkel gear available for hire on the beach. \nBring food/ snacks with as there aren’t many options available.",
   "Great place to relax and snorkel. Cheap entrance fee and you can bring your own gear, significantly reducing cost.\n\nHighly recommend supporting this place to help maintain and preserve this natural beauty. Don't touch the coral and wear coral-safe sunblock!",
   "Such an amazing experience. My first time snorkeling and it couldn't have been easier. There's an orientation video you have to watch that explains the rules of the bay and gives the back story of how it was formed. \n\nI would suggest going early in the morning as it does get crowded later in the morning. There is a shuttle to take guests up and down the hill, its inexpensive.",
   "Beautiful beach. Unfortunately, that's likely the problem. Too many people and like so many other reefs the coral seems to be mostly dead (at least closer to the shore). If the wind and waves are up you likely won't be able to snorkel the deeper reef, but that makes sense for safety. I think a large number of people that go to the bay are not strong swimmers. The conservation needs to enforce reef safe sunscreen ONLY! I saw people using all kinds of aerosol sunscreen. At least provide free samples of reef safe sunscreen and advocate for purchasing reef safe sunscreen at the gift shop. Maybe even remove people from the bay that don't follow the rules regarding reef safe sunscreen.",
   "Nice beach with above average snorkeling in pretty clear water.  Water is fairly shallow so even beginners to snorkeling will feel comfortable in the water.  Water and beach was very busy but that was expected.  Snorkeling is best past the breakwater but only for good swimmers."
  ]
 },
 {
  "name": "Best of Hawaii Tours and Activities",
  "address": "1690 Ala Moana Blvd Unit 102, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c8daa864-9330-11ea-990c-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "free"
  ],
  "link": "https://maps.google.com/?cid=5797302462311156082",
  "source": "GoogleMaps",
  "reviews": [
   "I only have 2 more days here and needed something awesome to do! Abraham helped me fill my time with some amazing adventures! He went above and beyond to help my time left in this paradise fabulous! Great prices and even greater customer service. Thank you SO much!",
   "Definitely will be using Best Of Hawaii again.  Abraham was my go to guy throughout my entire trip in Hawaii. He would go out of his way to make sure all my needs were met. I had two of my buddies that decided to show up last minute and he was able to add them into my activities without a problem and with a positive attitude, which made my entire experience much smoother and enjoyable.",
   "Abraham was amazing - he went above and beyond in helping me book my activity. Initially, he had contacted me when there were no availabilities for a package ATV and zip line. We booked the zip line and to my surprise he contacted me a couple of weeks later to try to coordinate the package! I was super excited and appreciated Abraham’s tenacity and desire to ensure that I had the best time on the island.  \n\nI will update this review once I do the zip line/ATV tomorrow 🤗",
   "Booking for our upcoming honeymoon, we were in great hands with Carlos.\nHe was absolutely sensational. \nBeyond helpful. Very friendly. Very knowledgeable. \nStress free. Good pricing.\nHad our best interests in mind. \nCannot fault him or his high level of customer service.\nWe're looking forward to it :)",
   "Carlos was awesome!  We were booking activities on our own and, evidently booked an ATV adventure on another island!  Carlos called to verify that this is what we wanted (we did not!) and he cancelled that booking for us and helped us book one on our island!  He was also very personable!  Thanks, Carlos!"
  ]
 },
 {
  "name": "Diamond Head Beach Park",
  "address": "3300 Diamond Head Rd, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c931c95a-9330-11ea-890f-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "kids",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=13003152098359399863",
  "source": "GoogleMaps",
  "reviews": [
   "If you want to get away from the crowds, take a walk or bus/trolley down past the lighthouse. Quieter beach with beautiful views, and you'll get the sun from a different angle in the afternoon for sunbathing. No bathrooms tho so keep that in mind",
   "A nice low impact walk takes you to the top. By low impact I mean “no serious climbing” but “don’t forget there are still stairs in front of you.” When you get to the top you can choose to go right or left for the final ascent. Right takes you through the internal military facility complete with old metal staircases and corresponding claustrophobia. To the left are simply stairs. The view from the top is worth the walk.",
   "Stunning Views once you get at the top. Wear sneakers and get plenty of water. Great hike even for kids.",
   "My wife and I made the climb while she was 5 months pregnant. We were not disappointed when we reached the top! Beautiful views!",
   "Amazing views with virgin beaches at the bottom. Make sure you don't fall...;)"
  ]
 },
 {
  "name": "Hanauma Bay Nature Preserve",
  "address": "100 Hanauma Bay Rd, Honolulu, HI 96825, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c97d034c-9330-11ea-b15d-14b31f159f22.png",
  "tags": [
   "organized",
   "affordable",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=9854873145107100983",
  "source": "GoogleMaps",
  "reviews": [
   "This beach was very clean and organized. The presentation they require you sit through prior to coming into the beach was very nicely thought out. \nWe went snorkeling and the equipment was affordable to rent and no wait time. \nWe saw lots of tropical fishes and didn’t have to swim out too far. \nVery fun thing to do with your spouse/family.",
   "This place is beautiful and to me it is a must-see if you visit Oahu! The number of fish you see and the great variety of sea life is so fun! A monk seal swim up to the shore and took a nap on the beach during our last visit. The staff had a safe area around him roped off and taught a little class about them and answered questions, which was great! It tends to get very crowded, so it is definitely best to arrive early in the morning to get a parking spot. It is well run and looks great, but I do wish that people would be more careful not to step on the coral, especially after being educated by the video!",
   "I absolutely love Hanauma Bay! It’s a great place to pack a lunch and spend the afternoon. If you do decide to enjoy the bay, please wear coral reef safe sunscreen and pay attention to the educational video. If we want this beautiful place to thrive we must do our part.",
   "Unforgettable experience! Extensive coral reef in an extinct volcano crater, maintained as a nature preserve by the University of Hawaii. Plan on spending the day to fully explore the many coral formations abundantly populated by numerous tropical fish species.",
   "Absolutely beautiful. The story behind the bay makes it even better. The staff does a great job keeping this place looking in great condition and there is a lot of fish in the bay you can see while snorkeling. Highly recommend if you visit Oahu."
  ]
 },
 {
  "name": "Sea Life Park Hawaii",
  "address": "41-202 Kalanianaʻole Hwy, Waimanalo, HI 96795, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c9dd2514-9330-11ea-a040-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "tour",
   "kids",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6768792526069816321",
  "source": "GoogleMaps",
  "reviews": [
   "Our family goes to Sea Life Park pretty often. Probably because we have annual passes. We enjoy the shows, the touch pool area, the playground, the food, and the scenery. Our children enjoy it a lot too and that's mainly why we go. Every time we go we experience something different and always positive. Oh and they added a conservation area which is educational and neat. Definitely check that out if you have a chance. We're going to renew our annual pass this month and continue to enjoy the sea life here as a family.",
   "This was a nice little park but emphasis on the \"little\".  There wasn't much to do and see.  It was quite out of the way, so we ate there too (food was pretty disappointing and amusement park prices).  The dolphin show was good and feeding the birds was cool, but we could've walked around the park and seen everything in an hour.  It wasn't worth the admission cost.",
   "Solid park.  I would highly recommend and give it 4 stars if you were driving as oppose to taking a tour bus or public transportation.  That way, you can stop and take in the beautiful scenery at various lookout points along the way. \n\n The park itself only deserved 3 stars though.  My kids enjoyed the the aviary where they can feed the birds.  The dolphin and seal shows were also enjoyable.  We spent about 4 hours here.\n\nI wouldn't buy the general admission at full price (39.99)  AAA offers a discount and you can find various discounts in various tourism brochures available at the airport or in Waikiki.\n\nI can't say anything about the dolphin experience as we didn't get that.  Costco on Oahu has discounts for that though.",
   "I would recommend going here on discounted days. I don't believe it's worth the full price unless you decide to pay for the different experiences they offer. \n\nIt's great for small children as it's not crowded and it's a good bit of animals to see. \n\nParking is $5 so be prepared for that.",
   "Very interactive park experience for the kids. Focused on loving marine life and learning about it. We were there for 3 hours with 3 kids and saw everything including the dolphin show, which I highly recommend.  We did the luau here and it was okay. My teenager and tween found it a little hokey, but the performers were amazing and the food was quite good and the activities as the luau began were fun and created souvenirs."
  ]
 },
 {
  "name": "Dolphin Quest Oahu - Swim with Dolphins",
  "address": "5000 Kahala Ave, Honolulu, HI 96816, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ca28fb26-9330-11ea-bfe1-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=13583079683845995068",
  "source": "GoogleMaps",
  "reviews": [
   "This was such a great experience for my daughter and I. While I was in Mexico I went for a dolphin experience and this was 1000 times better. The instructors were very protective over these beautiful animals as they should be. They answered any questions we had and made sure that we had one on one time. I love how if the dolphins weren’t interested in coming over they just leave them and how great it was that they loved to perform. We could tell that the instructors had a very special relationship with them. I would highly recommend this encounter for anyone",
   "Treat yourself and participate in this experience. I can't imagine anyone who wouldn't enjoy this. It's located in the Kahala Hotel and Resort, but you certainly do not have stay there to book the experience. The staff are so friendly, and the dolphins are wonderful! You're in a small group, so you actually get time to touch the animals and ask questions. The space is enclosed, so everything feels very contained, but in a good way. This is not a \"swim withe dolphins\" experience. It's an opportunity to see them in action, understand them, and watch them show off. Highly recommend.",
   "This was an amazing experience. It truly was an honor to be in the presence of these intelligent animals. This was a bucket-list item for me and it did not disappoint. The trainer was super and she clearly loves what she does. It is pricey, but if this is something you’ve wanted to do, don’t hesitate. Do it. You won’t regret it. I have a lifetime of amazing memories!",
   "Hannah was the best guide.  Everyone was professional, kind and shared the ways in which the dolphins are cared for and why this is the best environment for them.  Hannah encouraged us to take steps to protect wild dolphins by reducing single use plastics.  Beautiful animals in a beautiful setting with caring people! Would definitely recommend.",
   "Our 5 grandchildren each had age-related good experiences with the dolphins. Approx. an hour of interactive instruction and about 40 minutes with the dolphins. Small groups of 5 or 6 participants, referring to each by name. Parents can sit in on educational preface, and leaders include you by name, too."
  ]
 },
 {
  "name": "Halona Blowhole Lookout",
  "address": "8483 HI-72, Honolulu, HI 96825, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ca83c59c-9330-11ea-b63d-14b31f159f22.png",
  "tags": [
   "tour"
  ],
  "link": "https://maps.google.com/?cid=3141118850009516640",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful place for a quick stop. Easy to park. Views were perfect. Blowhole is not easy to spot but awesome when you do see it. I also saw a few turtles down in the gorgeous blue water.",
   "Great place to stop if your driving past. We were lucky to come on a day where the ocean was quite rough. This made for great activity coming from the blowhole. You don't really need to spend more than 15/20 minutes here as apart from the blowhole and views there isn't much else to see. The car park is quite small but has a high turnover rate so you won't be waiting long for a space.",
   "It was such an amazing sight to witness. Got to trek down the path a little to see cool layers of rock and feel the splash from the ocean. Definitely a great little treat next to the highway and won’t take up too much of your busy holiday schedule :)",
   "Decent amount of parking and even if it's full the turnover is pretty fast so with minimal patience you'll get a spot. \n\nWhile the actual action depends on the wave action, direction and even tide it can range from minimal to amazingly large spouts of water. But even if it's not going you can still catch some amazing views of Destiny Beach and Sandy Beach. \n\nDefinitely worth a quick stop.",
   "This is one of those scenic spots that makes you feel both on top of the world and terrifyingly small in the same breath. I live on Oahu yet keep returning to this tourist-filled spot because it’s so well-placed. Parking can be a little tough sometimes with tour buses cycling through, but it turns around quickly, so if you’re willing to cycle around a couple of times you’ll get a spot even when it’s busy."
  ]
 },
 {
  "name": "Hawaiian Luau",
  "address": "140 Liliʻuokalani Ave, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/caceb182-9330-11ea-9f62-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "nature",
   "tour",
   "knowledgeable",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=5454119252216412998",
  "source": "GoogleMaps",
  "reviews": [
   "We’re saving money to shopping here! Yahoo!",
   "Aloha, It's a fun place friends, check it out.",
   "Great places to visit. So relaxing and interesting. Makes trip to Hawaii really enjoyable and memorable. Hawaii is Heaven on Earth. Nature is incredibly beautiful. gorges beaches, tasty delicious food but hospitality of the people is what will create great lasting memories. They are very kind and welcoming to tourists. Unmatched hospitality. Aloha Hawaii!",
   "Our guide was Shannon!  Fun and informative, fed us yummy local snacks all while providing amusing commentary.  We did the early tour that covers Honolulu to North Shore.  Fresh shrimp was amazing from local grower.  Ask lots of questions, live your best life and enjoy.",
   "This tour was so awesome!  The guide was super funny ! Friendly ! Thoughtful ! Personable ! Knowledgeable on everything good around the island ! By the end I learned tons of very cool things about the Hawaiian life with awesome sights and pictures  ! culture ! history ! habitat ! Secret beaches ! Local hangouts and activities !  You're missing out big time if you don't hit this tour while in Oahu ! Ask for Miah without a doubt ! CHEEEHOOO COUSIN !!!"
  ]
 },
 {
  "name": "Star of Honolulu",
  "address": "Pier 8, Aloha Tower Marketplace, 1 Aloha Tower Dr, Honolulu, HI 96813, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cb21177a-9330-11ea-a46f-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2860756351838433557",
  "source": "GoogleMaps",
  "reviews": [
   "A great organization to go whale watching with. There are 5 different levels to whale watch from from inside to upper outside decks. Not only did we see a few pods of whales we also say dolphins and a sea turtle. The views from the boat out at sea looking back at Honolulu are breathtaking. I highly enjoyed this whale watching cruise.",
   "Nice boat, lunch buffet is decent. Wish they were better at announcing the whale sitings. Best to go to top deck and just walk back and forth until you see them. Location is somewhat difficult to find. Should have better signs showing where you're located once people get to the tower you are \"supposedly\" located at.",
   "It's okay. If you like a cruise and just want to spend with your loved ones, should be okay. But nothing sort of ultimate experience. Food was  okay and the dances provided there , are pretty basic. You can find much better dances at Waikiki mall.",
   "Booked the Star of Honolulu for my boyfriend's birthday and we had a great time. The food was delicious and the crab was all-you-can-eat. The views were beautiful and the staff was very friendly. The hula shows were entertaining and we very much enjoyed our time. Highly recommend.",
   "I've used this cruise twice to go whale watching and have seen whales each time. Both times were in February. The crew is so nice and helpful. The second cruise we did we saw multiple whales breach and the captain said \"that was a once in a lifetime experience.\" We saw dolphins as well."
  ]
 },
 {
  "name": "USS Bowfin Submarine Museum & Park",
  "address": "11 Arizona Memorial Dr, Honolulu, HI 96818, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cb6b6726-9330-11ea-b361-14b31f159f22.png",
  "tags": [
   "tour",
   "historic",
   "drink",
   "kids",
   "food",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=16500342211391290832",
  "source": "GoogleMaps",
  "reviews": [
   "This is a short tour of a historic submarine. Prices were fair for military members. During your tour you have a headset that describes different parts of the submarine to you. It even has recordings of Veterans sharing their personal experiences. It was definitley worth the trip.\n\n I will say it's not handicap friendly as you climb up/down things and through small holes.\n\n You can't bring bags or purses, anything bigger than a small clutch / large wallet is a no go.",
   "Museum was closed, No kids under 4 allowed. 1 star, because NO INFO about restrictions until you are buying the tickets, but they have a security check before, where   you can bring in only what in your pockets. Even baby food or diapers not allowed. I'll understand it, if they provided any baby food or drink for babies or diaper stations, but... Nothing. 5 hrs for kids without food if you want to visit USS Missouri.",
   "Loved it! Make sure to get the audio guide. It’s a really cool experience and I learned a lot. \n\nIts a shame the most interesting parts of Pearl harbor at an additional coast. Also charging more than the entry price for a “newspaper photo” seems disproportionate. There might be a better way to sell them than printing everyone’s photos only to throw them in the garbage afterward. Paper are trees and that’s definitely a waste of trees.",
   "Good exhibit at Pearl Harbor.  You go at your own pace, with audio automatically triggered for each room.",
   "The USS Bowfin Submarine Museum is more than what I ever expected. I took the audio tour of this historical piece of history. I just can't imagine living in the Close Quarters that are heroes did as they fought in World War II. The sacrifices made only goes to show why that generation is the greatest generation of our country today. It's nice to see that little pieces of our history are being maintained today to show and teach just exactly why we have the freedom we have today. If you're ever at Pearl Harbor I would highly recommend that you take the audio tour yourself of This Magnificent piece of History."
  ]
 },
 {
  "name": "Lanai Lookout",
  "address": "8102 Kalanianaʻole Hwy, Honolulu, HI 96825, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cbb25b52-9330-11ea-b75b-14b31f159f22.png",
  "tags": [
   "nature",
   "free",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=18137027597356316897",
  "source": "GoogleMaps",
  "reviews": [
   "Just beautiful. This is the prettiest, most scenic drives of my entire life. As soon as we turned this one bend of the road, my eyes instantly welled up because the beauty of it was so overwhelming❤ Definitely a must-see when in Oahu.",
   "Feel the great power of mighty nature. Big wind gust, huge splashing waves. I felt very very tiny standing at this lookout, and all life problems no longer seem to matter compared to the view in front of my eyes. It was very refreshing, quite glad to have made this stop!",
   "Love this place, its incredible...the water is perfectly beautiful with several shades of blue. You can see whales offshore here and the breeze is always steady which feels great because it can get warm over on that part of the island",
   "Nice stop along an island drive around.  Per someone else, just wait and a parking spot will free soon.  You need to go over the wall to get best views.  Note there is a sign to not go any further, although it appears everyone was well beyond the sign to get best photo and selfies.  It is pretty far from the water unless you climb all the way down, but not set up for stairs, so at your own risk.  Looks fairly manageable you can climb wall level easily.",
   "If you are driving east along the coast and wanting to quickly stretch your legs then this is a great stop. The parking may be full when you first pull up, just wait for a few moments as people are constantly in and out of this parking lot. You will be able to see what the waves have done to the rocks over time and the amazing design on the rocks. If you hop the wall (at your own risk) you can walk down to get a closer look. The rocks if wet and also the sandy parts can be slick so be careful. You will love the designs on the rocks...they are great for photos. This is one of the quick pull outs that is says is worth the quick stop."
  ]
 },
 {
  "name": "The Brewseum",
  "address": "901 Waimanu St, Honolulu, HI 96814, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cc0647f0-9330-11ea-8a23-14b31f159f22.png",
  "tags": [
   "food",
   "walking",
   "drink",
   "walk",
   "unique",
   "food",
   "history",
   "free",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=3783638367122215660",
  "source": "GoogleMaps",
  "reviews": [
   "I love the decor in this place. It is like walking into an aviation museum. There is an actual small museum next door.\n\n6 beers on tap with a whole range of cans and bottles. Make sure you try their brews before you try the rest. \n\nGreat place for photos as well. You can jump in the Jeep and props (helmets, sailor hats) are available as well. \n\nFood is available as well.",
   "A fine military themed watering hole that any service member past or present can come to and share stories and feel the steel, the brotherhood that binds us together. Sometimes we need to be around our brothers as we have a bond that is extremely tight.  I would like to see more military members there.  Especially my Marines,. Sometimes the boys need to be with the boys. A bond that is unbreakable.  Really enjoyed my visit here.",
   "This is a great place for a drink.  But this is so much more than a speakeasy or a bar. This is a living and breathing museum. Beautiful and accurate artifacts",
   "Such a fun bar with a cool and chill vibe. I completely felt like I was transported back into the 1940’s. The owners and employees were beyond friendly. They also had a great beer selection and solid cocktail menu at the speakeasy! I will definitely come back with friends.",
   "This spot is a pretty unique idea for a bar, especially for lovers of WWII history. The bar itself looks sort of like an auto shop from the outside, so it can be a little hard to miss if you're not paying attention. Once inside, there are neat little Americana paraphernalia strewn about, which makes this a popular place for military folk to hang out. The downside though, is that they don't serve food here so you'll need to either eat before you come or satiate your appetite with the free popcorn they give out. They do have pizzas you can order at the bar but that's about it. \n\nThe second part of this treat is the speakeasy located on the roof next door. When you walk in on the first floor, you're hit with a flash from the past with walls upon walls of WWII barracks-style memorabilia and decor. Once you get to the top, you have to knock on the door with the \"secret knock\" to be let in and you can make your way to the cocktail bar from there.\n\nParking is a real pain though as most of the street parking is private and you will likely be towed if you park there. The safest place to park is most likely the Ward center, so make sure to allot enough time to scout out a spot before you get there."
  ]
 },
 {
  "name": "Summit of Diamond Head Crater",
  "address": "Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cc483334-9330-11ea-85b9-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=10176739386703339597",
  "source": "GoogleMaps",
  "reviews": [
   "The views of Waikiki Beach, and all of Waikiki for that matter, are spectacular from the top of the Diamond Head Crater. It is so serene and peaceful at the top (besides the many people), and you feel quite cut off from the craziness of Waikiki. The hike to get to the summit isn't super difficult, but make sure to bring lots of water, especially if it's hot out. This is a hike that I have seen many families and older people do, but take a look at some of the other reviews to get a better all-around understanding of the difficultly level. If you're staying in Waikiki or on Oahu, I definitely recommend doing this hike! The breathtaking views at the top make it totally worth it!",
   "For a one dollar admission the views are worth every penny. To echo every other review - go early! The park opens at 6am. We ran from our hotel to the site, were there by 10am and glad we were off the hill before 11:30am - as the crowds were beginning to come increase. \n\nI would recommend a pair of shoes (not sandals) for the hike as any precipitation can cause the rocks to become slippery. All in all - great hike!",
   "Touristy but worth the trek. Bummed to see people wandering off trail, especially the instagrammers perched on top of the old military bunkers. The hike trail is mostly clear, but not paved. Wear athletic shoes and plan to get a good workout in. Too many tourists wearing fashion shoes and skirts! Arrive before 8am if you want to skip lines and the heat, though anytime before 9 isn’t too bad.",
   "Fun hike. Takes about 45 minutes on average. Steep climbs and uneven terrain. You will love it once you get there, plus you can say you did it.",
   "One of the most beautiful places I've ever seen. It's somewhat of a challenge going up but the view at the top and pineapple mango twist at the bottom make it well worth it. Must see..."
  ]
 },
 {
  "name": "Makapu‘u Point Lighthouse Trail",
  "address": "Waimanalo, HI 96795, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cc8dc7c8-9330-11ea-a03c-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=2743595067257522545",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing trail along the sea cliffs with the best view of Oahu southeastern shoreline. The views at the end of the trail is totally worth it and I would definitely recommend this trail as it gives one of the best views on Oahu. If you are lucky you can also see humpback whales. There is no shade during the entire trail so be advise to carry lots of water.",
   "Great views from the top. The trail is all paved but it is quite a long steady uphill climb. You will be grateful for the strong ocean breeze. You can’t actually get very close to the actual light house. The scenery is spectacular.",
   "What a beautiful place for a hike. Just be prepared, it's a hefty hike up and back. Make sure you bring water and sunscreen. It is not for the faint of heart. be prepared. If you're lucky, like we were, you'll get to see a pot of whales swimming by. It was a spectacular day.",
   "This hike is very easy for all ages and abilities. The view during the hike is phenomenal, the whole way up and down there are places to rest and take in the sights. Because the trail is entirely paved, it is very stroller friendly. This hike is very popular with a lot of young families and elderly. So many cute dogs too! Definitely one of my favorite places to go and take visitors to the island.",
   "This hike was INCREDIBLE. Absolutely breathtaking. Oh, and the best part... it's 100% paved! That means no muddy shoes (unlike most other hikes in Hawai'i).\n\nThe hike isn't very hard either. We saw young children and elderly people doing it. It's basically just uphill the whole way and downhill the whole way. Lots of incredible spots for photos. \n\nIt will be windy the higher you go. I would recommend a light jacket or one with a hood. And bring a camera, of course. \n\nWe didn't get to spot a whale but people do see them from the trail all the time."
  ]
 },
 {
  "name": "Pearl Harbor National Memorial",
  "address": "1 Arizona Memorial Pl, Honolulu, HI 96818, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ccd33598-9330-11ea-afb7-14b31f159f22.png",
  "tags": [
   "free",
   "history",
   "historic",
   "tour",
   "free",
   "history",
   "tour",
   "knowledgeable",
   "tour",
   "walk",
   "unique",
   "history",
   "free",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13314209119576285228",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful memorial with great views of the harbor and Ford Island. There's plenty of parking here and is also easily accessible by bus. Numbers 20 and 42 will bring you here from Waikiki at a cost of $5.50 for a day pass. It's strictly a no bag policy anywhere whilst inside the memorial and on the island so just don't bring one. If you do bring a bag then you'll have to pay $5 per bag to store it for the day. We arrived early in the morning, just as the park was opening. I would recommend doing the same as you entitle yourself to the free tickets for the USS Arizona Memorial. This is free anyway but at this time there's less crowds and you watch a short video with a bit of extra information from rangers. Once this was done we went on a short boat ride to the memorial itself spending approximately 15 minutes there and then came back to the centre. From here we got the shuttle across to the Missouri Memorial where we were able to look around and got guided tours included in the price of the ticket. It is truly a brilliant place to spend the day learning about history and paying your respects to those who lost their lives.",
   "My trip to the Pearl Harbor Memorial has become a staple for visitors who come to the islands to visit. This time around it was my parents (who have grown into some stability issues with time) who came. Somewhat surprisingly, there were no issues regarding those stability concerns. There were ample places to sit down throughout the facility for them to rest which meant energy level wasn't an issue, either (Just understand that half the point of the place is resting or riding on water and pay close attention where needed.).  We got there early so the memorial still had plenty of free tickets to take advantage of. In addition to that, I purchased the audio tour which has several locations around the facility where additional explanations and content are given to the listener. It was a bit pricey, but worth it for at least one of them who wasn't as big of a history buff. If you get the earliest tickets, be prepared to jump into the first movie presentation and boat tour that they offer which gave me (just barely enough) time to purchase the audio tour and catch up. Following the combination of movie and boat tour, we were able to enjoy the rest of the audio tour, at our leisure. The content was all relevant to the memorial. The facilities were clean and well- kept (there was construction on the submarine memorial side but it did not detract from the visit).  There was also enough historic information provided without feeling overwhelmed by it. It has ramps and braille for visitors, but is otherwise mostly at ground level. They have a snack store on the premises and a busy souvenir shop to cap off the visit. We easily used three hours and felt like we could have spent longer. Definitely worth recommending and probably won't be my last visit.",
   "Really nothing to complain about. The site was beautiful. The tour was excellent. And the people there really invite an atmosphere that appreciates the gravity of what happened there while keeping it enjoyable. Definitely try to visit if you're around!",
   "A significant historical landmark. Very busy of course so tickets can be hard to get sometimes. The movie is moving and very well done. It sets the perfect mood for the rest of the visit. The memorial itself is lovingly taken care of and on clear days it's cool to be able to see most of the Arizona through the water. The park employees are knowledgeable and helpful. The Navy sailors who drive the ferry boats are professional and will try to answer your questions, but it's best to ask the actual national park workers if you have any. If it's excessively windy or if there's lightning in the area they may have to shut down the tour rides but that rarely happens. Worth your time!",
   "This is a must see if you have any time on Oahu.  The obvious historical significance should be more than enough reason, but the exhibits and tours available make it very unique.  I first visited the Arizona memorial more than 40 years ago.  They've made significant improvements in every aspect of the experience and more are in process.  For younger kids it is probably not going to be something they enjoy, but for middle to high school kids with an interest in US history or WWII it will be worth almost a full day.\n\nThe views are spectacular, and it is relatively easy to put yourself back in time, to immerse yourself in the moments that changed lives almost 60 years ago.  \n\nWe arrived about 15 minutes before the memorial opened and the line was already huge.  I'm note sure when you need to arrive to be at the front of the line.  Once the line started moving it moved very quickly.  \n\nYou get a ticket and check in for a time to go out to the Arizona Memorial.  While you wait there are a variety of exhibits to walk through, and like I said you could spend the day at the site.\n\nThere is lots of free parking, but remember where you park and don't lock your keys in your car.  We tried to help two groups that locked their keys in their car on our way back to ours.\n\nDress for the weather.  You are going to be outside for the boat ride out to the Memorial, the Memorial is essentially open to the elements, and many of the exhibits are also open/outdoors.  Thankfully the weather is usually excellent."
  ]
 },
 {
  "name": "Moanalua Gardens",
  "address": "2850 Moanalua Rd A, Honolulu, HI 96819, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cd14ab6e-9330-11ea-8cfc-14b31f159f22.png",
  "tags": [
   "unique",
   "family",
   "knowledgeable",
   "historic",
   "kids",
   "art"
  ],
  "link": "https://maps.google.com/?cid=13201529393826668012",
  "source": "GoogleMaps",
  "reviews": [
   "You can see these giant trees from the highway so we stopped by during vacation to take a closer look.  Amazing how big they are. We're visiting family from the mainland, so it's nice to see some unique birds and trees. Lots of Japanese tourists since its own/maintained by Hitachi",
   "This is a really awesome park wow. This is also a really great place to have a wedding. So beautiful and historic. The staff is very friendly and knowledgeable. I highly recommend this place for even just a nice visit.",
   "Very nice I had a great time there. Easy access from the highway and your experience here will be awesome. If you visit the islands of Hawaii this is a must see.",
   "Moanalua Gardens is beautiful - lots of open space (lawn/grass) and some gorgeous trees including a HUGE monkey pod tree. Flowers, not so much. There are several interesting buildings including a Japanese tea house, and King Kamehameha V's summer cottage and a very ornate 1903 Chinese Hall. There is a koi pond, and lots of water fowl that are very comfortable around humans, but they don't bite (at least they didn't bite me). It is very open and though there were a few busloads of tourists while we were there, we wandered around without any problems - never felt crowded.\n\nThere was also a major woodshow there when we were there that was interesting and had some really nice wood art.\n\nThere's not a lot to do or see, and admission isn't much either ($1 for military).\n\nIt really is worth a visit, but the kids will hate you if you're taking them away from the beach or the pool.",
   "Simply gorgeous.  Also, there was a rainbow off in the distance really making every photo perfect"
  ]
 },
 {
  "name": "Hawaiʻi State Capitol",
  "address": "415 S Beretania St, Honolulu, HI 96813, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cd69a974-9330-11ea-9dfe-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "walking",
   "creative",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=16605059791450568064",
  "source": "GoogleMaps",
  "reviews": [
   "As a 1st timer in Honolulu, you will like the place, it’s history and it’s opulence. Good spot yo spend 2 hours of quality time. \n\nKeep your lenses ready and clean as building and locale is very photogenic. Staff is very nice helpful and courteous. Walking tour add to your knowledge about the background and story about the place.",
   "The Hawaii State Capitol building epitomizes the creative architecture of the early 60s. Soaring support columns rise out of flat pools. The inner courtyard makes you look skyward. Renovations are currently underway for upkeep.",
   "It is a very distinctive Capitol building and unlike any other in the United States. The building is not the prettiest, but it's interesting to look at.",
   "What a beautiful building!\n\nIt's surrounded by near by lush trees, and water fixtures. In the interior is a beautiful atrium.\n\nThere is so much unique architecture, I highly recommend a store to explore here!",
   "Looks nice building. Never seen before"
  ]
 },
 {
  "name": "Round Top Forest Reserve",
  "address": "Honolulu, HI 96822, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cdbd961a-9330-11ea-b5b7-14b31f159f22.png",
  "tags": [
   "nature"
  ],
  "link": "https://maps.google.com/?cid=7410564662793238857",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely gorgeous! What an amazing place to view the sunset. Get there early if you plan to get a decent spot. It's a very peaceful, relaxing place to spend the sunset. Be sure to wait until after the sun sets because the sky turns amazing colors. Spectacular view. Mother nature puts on a wonderful show.",
   "Extremely clean reserve with an amazing view. At night it is extremely pretty. Over look the entire city. You can't enter the reserve but you can pull off on the side of the road just before it and take pictures. Absolutely breath taking. Just be sure you're careful of incoming cars.",
   "The drive up to this place makes you feel like you are in a different planet. The view once you get to the top is just breath taking. They do mention that there is lots of car thief in the parking lot of the reserve and don’t take them lightly!",
   "So beautiful! Vast vistas and dense, jungle-like foliage. Follow Round top loop for a lovely drive with many spectacular views of Honolulu. Hiking trails- many trail heads with parking - and a park with a lookout point.",
   "Spectacular view of the Honolulu, airport and Perl Harbor! Easy drive. Limited parking! Restrooms located just prior to reaching the peak!"
  ]
 },
 {
  "name": "LeiGreeting.com",
  "address": "3375 Koapaka St f245, Honolulu, HI 96819, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ce17eb4c-9330-11ea-b462-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=11099330951798639804",
  "source": "GoogleMaps",
  "reviews": [
   "Drake was so awesome and friendly. He took our picture and gave us suggestions of things we may enjoy on the island of Maui. I surprised the rest of our group with the lies and they were all so pleased! Highly recommend.",
   "First time visiting Hawaii for the youngsters in our group. The Lei greeting made it even more special and memorable! The young lady met us with a smile and was genuinely happy to greet us. She even went the extra mile and asked us if we knew where baggage claim was. We were not too sure and we wanted to walk some of the energy off of our littlest member as he had a pretty long flight of sitting still. She walked us all the way to baggage claim, making sure not to lose any of us in the hustle and bustle of the airport. Thank you for the lei greeting and the lasting memories!",
   "Absolutely wonderful greeting! Our plane was delayed and I received a phone call just making sure everyone was ok and once we deplaned she was waiting right at the door of our jet bridge! absolutely special service and  my boyfriend was thrilled. We also got to keep our sign. Such a fun and memorable experience and welcome to Kauai!",
   "I ordered this for my friends arriving in Oahu.  I used the website to order, and when one friend decided against going, I also called to change one of the names on the greeter card.  Phone experience was very pleasant and professional.  My friend texted me that they were greeted at the gate, and the greeter escorted them to baggage claim and gave help on getting to their rental car, which is more than I'd expected.  She was so happy with the leis and service.  Mahalo for your wonderful service!",
   "So glad I scheduled a Lei Greeting.  They could not have made it any easier.  They had a professional sign made up at the bottom of the escalator when you went to baggage claim.  The girl who presented our Lei's could not have been friendlier, helpful and was even nice enough to take a photo of us.  Make sure you use this firm for your Lei Greeting.  Have to have one when you land in Paradise.  August 9, 2019"
  ]
 },
 {
  "name": "Waimānalo Beach Park",
  "address": "41-741 Kalanianaʻole Hwy, Waimanalo, HI 96795, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ce5d31fe-9330-11ea-8790-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=15043031385397686992",
  "source": "GoogleMaps",
  "reviews": [
   "Great beach park with ample parking, bit of a shame about the tents pitched up by the side of the road though. The beach is amazing with beautiful white sand and crystal clear waters. The view of rabbit island is great, especially when the sun is shining and the water has different shades of blue. Awesome place to spend the day, would highly recommended.",
   "Very nice beach. The facilities were great. It was nice to have lifeguards there just  to be on the safe side. The beach was very calm and the mountains in the background were an outstanding to see while swimming. The view is just amazing. Lovely place to stop.",
   "This is honestly my favorite beach spot on Oahu. The views are spectacular and there is plenty of shade to relax and read. Like many who have visited before me there are caution signs posted for jellyfish and shore break. Please read and respect the signs! We prefer to bring a good book and enjoy a picnic here.",
   "INSANELY BEAUTIFUL! Towering cliffs surrounding, islands off the coast, gorgeous white sand and stunning glowing blue-turquoise water. Beware of the man-I-War jelly fish in this side of the island though. Especially during high tide and/or high wind.",
   "Out of the typical tourist path. Parked car almost ON beach. Tons of shade AND we had a hammock we could attach to trees there. The water was a little choppier on the day we went. Winds higher also, but its not always that way. Gonna go back. Considering the amount of people going to beaches ON A WEEKEND, this was an awesome gem. So few people. Actual lifeguard stand WITH someone there. Almost no seashells to speak of though. The beauty was spectacular though."
  ]
 },
 {
  "name": "Waikiki Friday Fireworks",
  "address": "Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ceaf97dc-9330-11ea-8e3c-14b31f159f22.png",
  "tags": [
   "free",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1742638065675579123",
  "source": "GoogleMaps",
  "reviews": [
   "Pyrotec setup is right on the beach near the end of Kahanamoku Beach, 30 min before it starts security will guard the area and tell off people who are too close. Depending on wind they may rope off quite a bit of the beach. When the show starts you will be glad they did lol. Also beware of falling ash and debris. Stay safe.",
   "Excellent, intense, brief fireworks! The hotel says it is at 7:45 but that is only the suggested time that you get there. The viewing location near the cantina gets full of beach blankets, so that is right. The prime viewing is along the orange cones blocking off the end of the Rainbow Tower, which prevents inconsiderate oafs from standing when the show starts and blocking your photo-taking.\n.\nThe fireworks are lit from the coned area, so you are quite close. That means a great show, but it also means it is loud and you feel the concussion when the rockets launch and explode. It's like the subwoofer you wish you could afford! It could also frighten children, so please consider that.\n.\nThe show lasted 4 minutes in our experience, beginning at 8:06. That was plenty of time to enjoy the excellent variety of shells and effects. The whole of the experience is wonderful and a must-do if you stay at the village.\n.\nBe aware that when it is over, the crowd jams the departure routes. Be patient, and make your way over to the WikiWiki store for shave ice. That's an exclamation point on the evening.",
   "Short but good show. They were not super high end fireworks shot higher into the air, but was dull fun for a free show.",
   "I suspect this could be a really good display, but like everyone else who crammed on to Waikiki beach tonight I missed it.  It's at the next beach down.  At the Hilton Lagoon, get yourself to Kahanamoku Beach!",
   "Experienced great memories for my family"
  ]
 },
 {
  "name": "Makapu'u Tide Pools",
  "address": "Makapuʻu Point Lighthouse Trail, Waimanalo, HI 96795, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cf075502-9330-11ea-80d6-14b31f159f22.png",
  "tags": [
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6661586600792132598",
  "source": "GoogleMaps",
  "reviews": [
   "Great beach on a sunny day for body boarding or flying a kite. The water is a bit rough on the northern side of the beach but makes for great body boarding. There are several very nice tide pools to wade in (about knee deep) and you have a decent chance at seeing a few sea turtles swimming around near the pools. Definitely in my top 10 beaches to visit.",
   "This place was cool! Awesome to see the sea cucumber and crabs loving in the low tide areas. Just be careful to not slip on the rocks, move slow so not to step on creatures!",
   "The tide pools are beautiful with incredibly Clearwater to be able to see small fish fry along with baby crabs. Walking along the lava you should be careful",
   "Nice little tide pools to explore with kids. Right next to Sea Life and makes a good stop. Sometimes good surfers to watch from here. We saw fish and crabs.",
   "Beautiful and peaceful spot to visit however the climb down and up is dangerous. I don’t recommend taking children or dogs with you because it’s a steep and, in places, slippery route. Also, be aware in the tide pools there is marine life, namely, sea urchins situated in between slippery rocks. It’s easy to unintentionally harm marine life or yourself. Otherwise, a natural gift to enjoy."
  ]
 },
 {
  "name": "China Walls",
  "address": "Hanapepe Pl, Honolulu, HI 96825, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cf5267ee-9330-11ea-a0f9-14b31f159f22.png",
  "tags": [
   "music",
   "walk",
   "free",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3787987887093135217",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to jump off the cliff into the ocean and great place to watch the sunset.  Kinda a younger crowd vibe and usually some music playing.  Easy access from the street.  Make sure to respect private property",
   "Cool view! Do not jump in the water unless you're a good swimmer though! On a rough day, prepare to spend a good bit of time swimming against the current to climb out.",
   "Cool spot to stop by if in the area. Street parking was plentiful but I’m sure it can get busy at times so I’d stick to going on weekdays. Locals were jumping into ocean from cliffs but unless your a strong swimmer I’d avoid it. Great place for picture taking.",
   "Beautiful (no longer) hidden gem. Must park on one of the side streets before turning down and walking to end of street with dirt path leading to rock face. Easy walk along rock walls and can venture pretty far along coastline during the correct tide. Saw spear fishing and free divers as well as a brave solo snorkeler. Do not recommend snorkeling alone or without proper flotation / identification equipment as there were often fishing boats that came close to reef as well. Interesting view of Diamond Head. Many good spots for jumping off cliffs if timed correctly with waves and tide.",
   "Good place if you like to jump into the ocean. Huge waves though so you need to be a good swimmer."
  ]
 },
 {
  "name": "Room With A Clue",
  "address": "1130 N Nimitz Hwy b295, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cfa87778-9330-11ea-92a5-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=441325406239084227",
  "source": "GoogleMaps",
  "reviews": [
   "Our family has enjoyed Room With A Clue for a few years now. The staff is always helpful, the rooms are themes that intrigue and challenge all ages. We did \"A Stranger Case\" and LOVED the Stranger Things - like Theme.",
   "This was one of the best rooms we have done. It was challenging and exciting, we have done over 30 rooms. Our game master was absolutely fantastic. Can't wait to go back and do more of their rooms. Highly recommend this escape room establishment.",
   "It was a lot more fun than I expected! I definitely recommend that you try it out. We had a blast.",
   "Friendly staff. Good rooms. Clean space. Hint: ask for clues little bit before needing them so they have time to type it out. Also small waiting area with some activites to play with.",
   "It was fun and I had a great time. The game master was awesome! I would suggest this game room to everyone."
  ]
 },
 {
  "name": "Kolowalu Park",
  "address": "1240 Ala Moana Blvd, Honolulu, HI 96814, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cfeb4d08-9330-11ea-aeae-14b31f159f22.png",
  "tags": [
   "parks",
   "kids",
   "kids",
   "field",
   "structure"
  ],
  "link": "https://maps.google.com/?cid=14080808393822863499",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of the clean parks in town with fun children playground equipment. People generally is gentle and sweet when bring child/children here. Lots of space to run. around, close to big shopping mall and parking is usually great. One down side, no where to hide if it rains, and if it's a windy day, its EXTRA windy here because of all the high rise buildings around the park.",
   "Nice little park in the middle of the city.  Great escape for kids 6 and under.",
   "The park is nice. There's a decent playground and there are enough benches surrounding the playground so you can easily watch the little ones. The park also has a large grass area to have a picnic or run and play. Not a hilly park which is great to run around. The only problem is that there are no restrooms here. When the kids start to play, 10 minutes later someone has to go to the restroom. Other then that, the area is nice with shopping nearby in case you get an itch in the wallet.",
   "I remember some great memory's from being here in the past and it was a great place to revisit",
   "Nice fun park with large shaded field and play structure."
  ]
 },
 {
  "name": "Maunakea Marketplace",
  "address": "1120 Maunakea St #200, Honolulu, HI 96817, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d02e9814-9330-11ea-923e-14b31f159f22.png",
  "tags": [
   "unique",
   "wander",
   "cheap",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4988772095080178522",
  "source": "GoogleMaps",
  "reviews": [
   "There was a nice variety of Asian foods. I got a one choice combo at one of the Pinoy vendors that hit the spot. ~$5 to be nice and full!\n\nI definitely want to go back at a better time. I had gone right before closing. \n\nThere’s also little shops for household items.",
   "This is a place you want to wander in if you are visiting. Come in and check out the locals variety of produce and unique meats. You'll find great local restaurants around the market and as well as inside.",
   "I had lunch at Tuk Tuk Cafe and tried their green curry. I thought that the price was a little high, but the portion size was good. Flavor was milder than I was expecting, not spicy at all. I would be willing to return and try other dishes.",
   "cant go wrong with the $1 a bag veggies. be sure to wash the veggies good before cooking✌",
   "Slightly improved from what it used to but still alot of homeless around.  Fewer food places in here to choose from and some of the better ones closed down. Still has the cheap eats even tho prices have gone up."
  ]
 },
 {
  "name": "Lē'ahi Beach Park",
  "address": "3187 Diamond Head Rd, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d08ac1c6-9330-11ea-9f5e-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6889225461633113384",
  "source": "GoogleMaps",
  "reviews": [
   "A very nice quaint Beach picturesque",
   "Peacefully park with shade from trees. Beautiful views of palms, Diamondhead and the ocean. Only real downsides are that there is no place to buy a refreshment, no bathrooms, and occasionally some bums might hang out in the corner.",
   "Great little park. I am a real big fan because there is no real parking, so it tends to remain fairly private to those that walk to it. Easy stair entry into in ocean, a short Sandy Beach front that drops fairly quick. Makes for a perfect miss run stop to soak in the ocean. Open from 5am to 10pm. And a beautiful tree pergola to rest under!",
   "The one thing there is no really a beach to begin with... Mostly chopped-up coral dead reef rock sand and a mixture of green sea turtle shells... Joking about the sea turtles... And homeless people easy access to park facilities hence bathrooms and freshwater showers that are publicly used by anyone ... including temporary wannabes yes I'm talking about tourists!",
   "Great place for a relaxing picnic watching the  sun go down."
  ]
 },
 {
  "name": "The Honolulu Museum of Art Spalding House",
  "address": "2411 Makiki Heights Dr, Honolulu, HI 96822, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d0ec9130-9330-11ea-825d-14b31f159f22.png",
  "tags": [
   "nature",
   "art",
   "kids",
   "art"
  ],
  "link": "https://maps.google.com/?cid=17029790853592081444",
  "source": "GoogleMaps",
  "reviews": [
   "A beautiful museum located on the top of Makiki. The views are stunning and the artwork here is great as well.  When you’re here, it feels like you’re in another world because you’re surrounded by nature and lush greenery. It’s $10 to get in with a local id other wise it’s $20, but I do think it’s worth a visit.",
   "Didn't go into the museum. You can go to the cafe without paying the entry fee. The cafe is cozy. What I had was so-so. Service is good. \n\nThe grounds are beautiful. We walked around part of the property after lunch and it's very lush as well as peaceful and serene.  I enjoyed spending some time there very much.",
   "Great location for a quick picnic in the “country” and seeing the city spread out before you. The outdoor space has usually outshined most the the art exhibits (tough act to best). \n\nNow closed and on the market. We will see who buys this fabulous white elephant and then donates it back to HoMA again. Might make a great embassy site (one that does not need a lot of foot traffic).",
   "Our favorite weekend spot. Love getting a picnic from the case and eating it out on the lawn under the huge tree. The grounds are super fun for kids - easy jungle climbing paths and lots of space for them to run around. Inside had a small but nice at collection.",
   "Peaceful retreat high above the busy metropolis. Enjoyed the fresh air and art exhibits. Lush landscapes with beautiful native plants."
  ]
 },
 {
  "name": "Waikiki Marine Life Conservation District",
  "address": "Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d1481eda-9330-11ea-af84-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "learn",
   "free",
   "kids",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=11033568919628872041",
  "source": "GoogleMaps",
  "reviews": [
   "I absolutely love the Waikiki marine life conservation. There is so much to learn about fish, coral and Hawaii! Very family friendly, I brought tons of family members. They love it if you're in the military so bring your ID to get discounts. Young kids get in free too.\nI loved how they give wheelchairs to visitors that need them. My grandmother and her friend both couldn't walk the distance so we pushed them in a wheelchair. My sister had her own wheelchair, luckily the whole place was handicapped accessible. There was lots of room to fit 3 wheelchairs and my whole family and everyone else visiting.\nMy favorite thing was seeing all the amazing fish!\nSome of it is out doors so prepare for that and... Enjoy!",
   "Great place to take kids. Our 3 year old was very entertained by this. It's reasonably priced to get in, a fair bit to see. We spent about 2 hours here. There is free sunscreen available for the outdoor portions. The large fish and shark are fed around 11am, so that's a cool thing to see if the timing works out. There is also a small pond in the back for kids to touch and feel some shells and the like.",
   "A fun little stop. I've been to much bigger aquariums but this one still had a few surprises in store. Some fishes here were totally new to me. The staff were lovely to chat with.",
   "I love going to this aquarium. Lots of things to see and do. There is also a audio tower there. I love this place so much that I just want to come every time we come here. Love this place so much. There are things inside to look at and things outside to look at. I’d say this is the best aquarium ever because it is pretty big. I think that aquarium is the biggest aquarium I have gone it yet. Recommend mond for a attraction. Go there now if you love a good attraction. It is a good place if you live (or stay) in Waikiki. Best place ever! :)",
   "The best Aquarium I've been to. Tanks are very clean and well maintained. A lot of very interesting critters."
  ]
 },
 {
  "name": "Senia",
  "address": "75 N King St, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d1924768-9330-11ea-a7a7-14b31f159f22.png",
  "tags": [
   "eat",
   "unique",
   "food",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6305661973672905027",
  "source": "GoogleMaps",
  "reviews": [
   "Started by ex-chefs of one of the worlds most famous restaurants in NYC, Per Se. We ate at the chef’s table and ordered the wine pairings which I absolutely recommend. The sommelier, Mike, picks outstanding wines and makes it a very special experience. I woke up the next morning still thinking about how special each course was. The service was truly exceptional. I am so happy we were fortunate enough to eat here while visiting Oahu!",
   "Exceptional taste and presentation, and great service. Charred cabbage is an amazing dish with great texture, definitely a standout. The triple smoked salmon has been smoked with unique methods that make it not salty at all, which usually turns me off of smoked salmon. It was well presented and the accompaniments were well balanced flavor and texture wise. Very reasonable prices for dine dining, felt like a downright steal, especially for Honolulu. Make sure you reserve a few days in advance.",
   "Best experience you can find at Senia is at the Chef's Table. Chef Anthony prepared a menu that is simply amazing. Make sure you reserve your spot now. From the staff, kitchen, and the food, everything was perfect. Simple as that.",
   "One of the best kept secrets in Hawaii! Take your loved ones and your taste buds. You won't be disappointed!",
   "A beautifully executed, no bs, quality-focused experience. There is nothing that could've been improved: the food quality, the service, the wine selection. We went with the chef's tasting menu, and we loved every single course. Everything was done well, presented well, and just complemented each other. Excellent meal."
  ]
 },
 {
  "name": "Helena's Hawaiian Food",
  "address": "1240 N School St, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d1d82a98-9330-11ea-8d14-14b31f159f22.png",
  "tags": [
   "food",
   "walking",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1999430406045260437",
  "source": "GoogleMaps",
  "reviews": [
   "Letting you all know up front, this place only takes cash, so come prepared. There's also no ATM on site, so you're walking a block or so if all you're carrying is plastic.\n\nParking wasn't as bad as some let on, and seating wasn't an issue either. We visited on a Wednesday evening, so maybe that's the key.\n\nI got the kalua and ribs, both of which were awesome. I didn't try the poi, but the guys I was with (who had never had it) said it wasn't bad. It's definitely got to be an acquired taste kinda thing, but if it's your thing, I'm guessing this poi would deliver. I'm not native to Hawaii, but even I could tell the food was pretty authentic. The flavors were simple but rich. Really good food overall.\n\nService was awesome, and our server was very personable. They went over the menu with us, and let us know what was up with the condiments. \n\nThe place itself isn't sexy, and the building is pretty much a hole in the wall. That being said, these kinds of places typically deliver, and this one is no exception. They have been doing this a while (since the 40's or so), and it shows in the food. So long as that's the case, I can forgo the fancy decor.",
   "This is a must visit if you are in the neighborhood.  Came early and had one of the first tables for lunch/breakfast.  Recommend trying everything at this place as the plates are all family style.  The staff is all wonderful and you will have an authentic experience in here.",
   "It was good. It was not mind blowing. They won a James Beard award, which is no joke. But it was 24 years ago, so things may have changed a bit. The short ribs and kalua pork were the best part. The lomi salmon was quite fishy, but I guess what you expect from fish that isn't local. Over all, worth a visit. But don't expect to taste the best thing you ever tasted.",
   "The short ribs were my favorite by far, but the pulled pork and coconut custard dessert were also amazing. The staff was very friendly and the food came out extremely fast even though they were pretty busy. They are cash only so come prepared.",
   "Helena's provided us with great customer service and a very entertaining dining experience. We visited this place off the recommendation of Matt The Traveler on YouTube and it was exactly what he said it would be! We were able to enjoy the true authentic Hawaii food experience. The food was flavorful and we are glad we got the chance to experience it."
  ]
 },
 {
  "name": "Tommy Bahama Restaurant, Bar & Store",
  "address": "298 Beach Walk, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d224007e-9330-11ea-b9a4-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "food",
   "food",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=12576885708075629745",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent food and excellent service. The tortilla soup was amazing and the blackened mahimahi fish tacos were the best fish tacos I've ever had. The added touch of rooftop dining makes it that much.more appealing. Live music was great, too. Very reasonably  priced for the quality and presentation of the food as.well as the great service. I couldn't have asked for a better first dinner on Oahu.",
   "I came her for my birthday dinner with my wife and 9 month old.  This place has 2 levels, with the top level being more open aired where you can feel the wind rip right through your toupee.  The food was top quality and very tasty. My wife and I got fish as part of our main course, but we ordered too much food and were full way too soon.  But that's how you live when you travel to Waikiki. The service was top notch and friendly.  I would definitely go back the next time I'm there.",
   "Fun place and must visit. Incredible service. Food was great.  A group of 7 and we all talked about it the next day. 2 thumbs up",
   "Amazing stop by on our way to the beach front for drinks. Atmosphere was very relaxed and service was phenomenal. Very comfy furniture and a nice view on any floor. They have a bar on both floors and everyone was prompt in our drink orders. I got the typical Long Board which was cold and fresh! The mai Tai's were mixed well and a good refresher as well. The wine and beverage selection is very extensive and appealing to all taste and pallets. Highly recommend as a good lunch/dinner spot, especially if your heading to and from the beach.",
   "The best mahi mahi! Truly one of the best meals of my life. I loved the views from the rooftop (very romantic) and the service was excellent. Thank you"
  ]
 },
 {
  "name": "Roy's Waikiki",
  "address": "Next to Embassy Suites, 226 Lewers St, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d262693a-9330-11ea-8862-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "food",
   "food",
   "walk",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8481290603721730493",
  "source": "GoogleMaps",
  "reviews": [
   "I came here with my family several years ago. We ordered quite a bit of food; appetizers, sushi, drinks, entrees and desserts. Everything was delicious and the waiter was one of the best I've ever had. He knew everything about the menu, timed everything perfectly and was very professional. Perfection. I visited again two summers ago while on vacation with my girlfriend. Still amazing. Can't wait to come back.",
   "I've never felt more welcomed to a restaurant in my life when dining here. Every employee greeted me and my date on our way in and bid us farewell as we left. The food was worth every penny spent and their pineapple upside down cake is incredible. The wait staff were also very responsive and quick.  I would absolutely recommend this place if you are looking for a more casual fine dining experience.",
   "Busy, high turnover restaurant. Were seated promptly at our reservation time. I would recommend having a reservation, BTW. Our server was friendly and informative. The drinks were well executed. Food was above average, but executed within the price range. The only negative was that our table seemed a little cramped. Recommended!",
   "Attended with a large group.  Easy walk from most places in Waikiki. Chef prepares fish dishes wonderfully, have not tried other entrees. Spellbound Merlot made a nice pairing.  Wait staff easily kept up with our group.  Dining room fills up, so reservations a good idea.  Try their Mai Tai at their bar on the corner, very tasty.",
   "One of the best meals and service experiences I've ever had! The appetizer canoe for two is a must and all three of the fish dishes in the beach trio we're delicious. The food is great, but the phenomenal service is what made our experience worth the price!"
  ]
 },
 {
  "name": "Alan Wong's Honolulu",
  "address": "1857 S King St, Honolulu, HI 96826, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d2a73a9a-9330-11ea-836c-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "creative",
   "drink",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6301488838283363495",
  "source": "GoogleMaps",
  "reviews": [
   "My sister and I joined my best friend and his partner for a valentine's dinner here. \nThey have a special menu set for valentine's and the food, pictures I've added, were delicious. It cost $105 for the dinner and $155 to add wine pairing which was perfect.\nThe service by Mike was amazing - he's attentive, easy to talk to and funny.\nThere is valet parking so you don't have to fuss. However,  it costs $7 😆 🙄",
   "Favorite splurge restaurant in Honolulu. Always great food and impeccable service (without being snooty).  Elegant enough to be a perfect anniversary date, but accommodating enough to have small children.  I always get the short ribs, which are super tender and flavorful.  My wife recently got the salmon risotto, which was perfect.  Don't miss the haupia coconut dessert, if you're not already stuffed!",
   "The best place I have ever eaten to in Oahu! The restaurant itself decoration is not up-skill but it feels nice and a little fancy. The service was great, the waitress was nice and friendly, very careful of our needs and questions. I ordered a cocktail Mr Guava Lava to start. It was delicious and I could not taste the alcohol at all. Very dangerous ;)",
   "The food is exceptional,  extremely creative. The server was attentive and knowledgeable.  Very good bread rolls are brought around with regularity. My only criticism would be the drink I had. I ordered Beefeater's gin in the rocks. They didn't have any and the drink that did come was stingy--one ounce of gin. It was the only disappointment this Midwesterner had.",
   "Alan Wong's is Hawaiian fine dining at its best. If you're in the mood for a classier setting away from the casual Waikiki beach vibes, make the trek here. When you pull up to the building, don't be confused if you just see a regular office building. An elevator will take you up to the restaurant."
  ]
 },
 {
  "name": "Lucky Belly",
  "address": "50 N Hotel St, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d2e94ce4-9330-11ea-8a66-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "creative",
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17982999982095678997",
  "source": "GoogleMaps",
  "reviews": [
   "Great restaurant! Good atmosphere. Fairly small. We had a reservation and still had to wait a bit to be seated. The food was delicious. Little bit on the expensive side but worth it. Drinks are small, probably not worth the price.",
   "Decided to go to Lucky Belly without reservations on a busy night and they were able to accommodate us at the bar. The creative dishes, and everything we ordered was off the charts good! The service is equally amazing. Love this place.",
   "Been here twice and this place never disappoints me. The ramen was delicious and the salmon needed a bit more flavor but that lobster loco moco, I think that’s what it’s called, it is a must try here. The service is good and fast and the hibiscus lemonade was delicious.",
   "SO. GOOD. \nI wish this restaurant could follow me around in life so I could eat their incredible food all the time. \nSo so so good. The flavors were rich and perfect and the dishes also had a lightness to them... if that makes sense. I’d eat there weekly if I could!",
   "The staff was AMAZING, very kind and attentive.  The food was top notch as well. Very tasty and everything was cooked to perfection. Portion sizes were great, and the enviornment was very comfortable."
  ]
 },
 {
  "name": "Karai Crab",
  "address": "1314 S King St STE G2, Honolulu, HI 96814, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d33aa168-9330-11ea-bddc-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walk",
   "food",
   "eat",
   "delicious",
   "walk",
   "affordable",
   "music",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=18156266610386048733",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent food. Good service. Not fine dining, but delicious food. I had the mussels in Karai sauce and Garlic noodles. Exquisite.  The lighting is a bit bright. Friendly staff.",
   "This place was a little bit away from Waikiki Beach but not that far maybe 20 minutes walk. I wanted to go because I wanted to experience something more local unless mainstream like everything else on the Waikiki Beach strip. it was exactly what I was looking for absolutely epic food and more of a local experience. Highly recommend this place and I will definitely go back next time I am in Honolulu.",
   "OK....Forget my first post, Soooo love the flavors. I'm back in the South with a low country boil...Great parking, service with a smile and THE SEAFOOD....a must visit and eat. I love the seasoning, my favorite place now.",
   "Absolutely Delicious! The staff was personable with lots of Aloha. I live here and it's the best meal I've had only had 2 great dishes and this ranks #1. Sit outside the Botanical Garden is beautiful. What a jewel in my own backyard. I can walk here and will atleast once a week for dinner. The music was even enjoyable. Prices is affordable.",
   "First of all, it's crab, so expect to pay a decent amount to eat here.  They have other things on the menu but the crab is the main attraction.  They season the crab legs and put your desired level of spice on it before they serve it to you.  When I went, they forgot to bring out my appetizer of calamari but they made up for it by bringing it to me later AND removing the cost from my bill.  If you're in the mood for crab, I would highly recommend this place."
  ]
 },
 {
  "name": "House Without a Key",
  "address": "2199 Kalia Rd, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d382ce54-9330-11ea-bdfd-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=1086432809624291124",
  "source": "GoogleMaps",
  "reviews": [
   "We did wait a while despite having a reservation but the staff at the front desk were professional and nice. We had the catch of the day and the short rib and both were actually great. The coconut shrimp was average though. Cocktails were nice. Live entertainment was fun and not too in your face. It's a fairly casual place and the prices are definitely high for the vibe, but I think everything is expensive in the area so not too bad comparatively.",
   "Loved the atmosphere. Beautiful setting.  Amazing and accommodating staff.  I was not into the fish tacos so they comped that dish for me.  Chocolate cake was amazing. Great drinks.  I think the fish gave me food poisoning though.  I was up all night. 😔",
   "Tropical paradise outdoor venue.  Perfect for tasty meal or for a tropical drink prior to having dinner next door.  Evening are graced with live Hawaiian musician with a back drop of the ocean.  Orchids blossom everywhere.",
   "Wonderful sunset view. Please take time to visit for a romantic dinner. Slow paced, great plates. Stiff drinks! One of the most romantic meals we had while on Oahu.",
   "Thankfully we had reservations before sunset, this is imperative!! We requested a table to see the sunset and they gave us the best seat in the house, at least it seemed like it. Food was great, service was great, entertainment was even better.  What a awesome music and hula show!  We will be back every time we visit HI in the future"
  ]
 },
 {
  "name": "Koko Head Cafe",
  "address": "1145 12th Ave C, Honolulu, HI 96816, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d3d497d2-9330-11ea-b412-14b31f159f22.png",
  "tags": [
   "delicious",
   "hike",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1225932151596525065",
  "source": "GoogleMaps",
  "reviews": [
   "What a great place!!!  Staff is always friendly and full of aloha.  Food is off the charts delicious and served fresh and fast.  You may have to wait to get in but it is ALWAYS worth it!  Remember, breakfast only.  We always go early then hit a hike.  Perfect fuel to start an awesome Hawaiian day.",
   "Worth the wait! We got there shortly after 8am and we had to wait about 45 min for a table for 2, but the food and service was worth the wait. Their dumplings were amazing! The pork and onion omelet was fluffy and very flavorful, and the breakfast bibimbap was really good as well. The service was spot on with friendly servers who also made great recommendations. Would definitely recommend!",
   "The mix of flavors is something I could not have dreamed up but definitely created a party in my mouth! We arrived early morning to beat the crowd and found two seats at the bar. The tables filled up quickly by 9am. Food is fantastic and the service is friendly and entertaining. Highly recommend checking this place out.",
   "Best breakfast we had in Honolulu! Amazing, prompt service and tons of amazing flavour. Would highly recommend. They don’t take reservations but the line moves pretty quick. Lots of innovative daily chalk board specials too.",
   "Our waiter was so nice! In the middle of the brunch rush, he was able to accommodate a gluten intolerance and ensure that I wouldn't have any bubble guts after the meal. I couldn't appreciate it enough! The food was good. A little bit of a wait (~25 mins) but not bad."
  ]
 },
 {
  "name": "The Original Roy's in Hawaii Kai",
  "address": "6600 Kalanianaʻole Hwy, Honolulu, HI 96825, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d41a2c98-9330-11ea-8746-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "walk",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2389701697706284653",
  "source": "GoogleMaps",
  "reviews": [
   "During this time of COVID-19 it’s been challenging for everyone to hunker down and stay at home. Roy’s has been making great efforts to put together delicious individual and large family meals. Easy to call in, select a pick up time, & then park and walk up to the window to pick up. So easy, you don’t have to cook, and at such reasonable prices! They have daily and weekend specials and a select to go menu to order from. They even make drinks to go! Support local!",
   "Roys in Hawaii Kai is a great, family friendly, upscale restaurant where you can experience Asian Fusion and other classic dishes.  My son opted for the filet mignon and the server gladly accommodated his request for buttered pasta on the side rather fingerling potatoes that usually come with the meal.  We chose to sit outside where the views of the east coastline were breathtaking.  The upstairs dining area has the same views with a more intimate setting.  The meal ended with the chocolate souffle with the molten center, a must have...and a scoop of vanilla ice cream on the side for good measure.",
   "It's our go-to place for friends and family celebration. Very familiar with the menu and the taste remains the same all these years. We've hosted from birthdays to grad parties and it's always been a great experience with them.",
   "I frequent this place but tonight’s review is about the Wednesday night Wine night. First off all wines are 50 percent off the bottle. I was comparing prices and at that rate it brings some bottles down to the cost you can get them outside. \n\nTake a look at there happy hour menu and you will find plenty to delight your taste buds with. I went with the sampler this time since I wanted to save room for dessert. \n\nRemember to order ahead of time .... takes 20 mins, but the soufflé is amazing. Once in a while they change it up to the season so it won’t be just chocolate. I’ve had pumpkin, strawberry, matcha, chocolate and a couple others over the years.",
   "We had a great experience at Roy's. They knew we had a young one with us, (6) so they brought us a plate of pasta and something to color on right away. Not that they had to, but it made the rest of the night go smoothly. We had sushi, cocktails, wine, steak, fish, and shelf fish; all of which I would have again! Can't go wrong, everything was amazing! And get the chocolate souffle, it's worth the wait!"
  ]
 },
 {
  "name": "Livestock Tavern",
  "address": "49 N Hotel St, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d45e61b0-9330-11ea-9e77-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2325586420518680325",
  "source": "GoogleMaps",
  "reviews": [
   "Trendy and stylish casual eatery. Excellent food and service. Great menu - modern American food. The gnocchi was excellent, as was the octopus (so tender), and the pork fillet was fantastic. And don’t skip the cornbread with jalapeño butter - it’s amazing!",
   "Found this place on a list of top 50 places in Oahu.  It’s unsuspecting exterior and location nestled in “china town” just a few blocks from the Walmart were a bit surprising.  What was the most surprising, IN ALL THE BEST WAYS, was the quality of the food, the dedicated service, and the ambiance!  This place is a gold mine.  We made reservations same day without issue.  Inside has a ton of bar seating and the dining area hosts 20 or so tables.  Particular for bourbon with their bar, the drinks were delicious and the bar is stocked with a great variety.  The menu is meat based so it’s not vegan 🌱 or veggie friendly.  Think you could gather that from the name 🙄 but they have a few salad options and a Brie sourdough appetizer that was delicious.  I ordered the roasted chicken entree and it was the best meal I’ve had in a long time.  My other half ordered the prime rib, and the boy from Texas said it’s one of the best he’s ever had!  Highly recommend and will return again.",
   "Lovely place for celebrations of flavors, drinks, and friends. Their bone marrow with escargot was an experience I have been longing for since. Escargot was great, bone marrow was perfect, but the cheese melt above it all took away from the dish. Maybe lighter cheese may have helped but it definitely was not necessary. The cheese cooled off quickly over the escargot on bone marrow which was off-putting aesthetically and to other flavors. We ordered a variety of dishes which were otherwise satisfactory.",
   "A new concept in dining to hit Honolulu that others need to follow. We were at once transported to a Seattle or Portland type of eatery experience and were amazed by the innovative menu and cozy interior of this restaurant. Service was fast, friendly and efficient. No waiting for drink orders, course items were brought perfectly timed...not too fast and not too slow. A highly recommended dining experience for anyone venturing into the dark reaches of Honolulu Chinatown",
   "Well this is an unexpected gem way off the tourist path in Honolulu. The food was amazing. The service was impeccable. We will return when we get back to Honolulu for sure.\nNeighborhood and parking oddities aside, this is a 5 star restaurant with a great eclectic menu. \nWhat, buffalo corn dogs? Um Yeah, Awesome! \nSmoked Prime Rib was outstanding too!"
  ]
 },
 {
  "name": "La Mer",
  "address": "2199 Kalia Rd, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d4a555f6-9330-11ea-8151-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "knowledgeable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1264320493385931110",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of the most beautiful Restaurants I have ever been to. Our table was right in front of the ocean, service was Superb! Food was SUPERB! I mean you will not regret it. You must definitely go and have dinner here!",
   "By far the best service and finest restaurant in Honolulu. Treated like royalty from the moment you arrive and the food is superb. I proposed at La Mer 15 years ago and they accommodated my every need. Now we have returned 15 years later for our anniversary and the experience was just as memorable. A beautiful setting and wonderful service. The best restaurant experience possible anywhere in the world.",
   "A culinary delight! The service is impeccable and attentive without being intrusive.   We felt like we were the only guests and each of our three courses were simply fabulous.  What a delightful fine dining experience!",
   "There is a reason this restaurant is considered one of the top restaurants in Waikiki. Firstly from the moment we arrived we treated like Royalty and given the best table in the restaurant- table 25 looking over the ocean. Service was friendly, knowledgeable but not intrusive. The food was simply outstanding. Beyond the food we look at the overall experience and can honestly say this was a truly a memorable experience. We were never rushed. The waiter’s recommendations were spot on and the sommelier added some valuable insight on wines and cognacs.",
   "This was a special evening at a special venue. We had an amazing dinner set atop the Hawaiian waves brushing the Waikiki shore. The Halekulani is special to begin with. Place a French restaurant on top of the shore with windows looking out onto the beach and you have the set up for an AMAZING restaurant. To start it off, the service was on par with THREE STAR MICHELIN restaurants. Our waiter (Chuck?) was a local who had been there for years and was the best. No lack of timing in this place where each dish is served impeccably timed after the next. The food is on par with the best restaurants in the world. Why they have not been lauded elsewhere is beyond me. We had an amazing evening and would recommend the experience to anyone else traveling in the area. They bring true high class standards to the islands while still making you feel like your on island time (without sacrificing the wait)!"
  ]
 },
 {
  "name": "Orchids",
  "address": "2199 Kalia Rd, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d4f76dfe-9330-11ea-96e6-14b31f159f22.png",
  "tags": [
   "tasting",
   "food",
   "eat",
   "food",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=6992099294118103360",
  "source": "GoogleMaps",
  "reviews": [
   "We have just finished a birthday dinner for my wife. Jason was our waiter and was absolutely amazing. The food was so so good. We had the chefs tasting platter and it was next level great. We got engaged here is 2018 had our wedding reception dinner here in 2019 and now my wife's  birthday.  To some this up wow,wow,wow. This is one of our special memory places.",
   "The most amazing fancy brunch buffet. It’s expensive, but the atmosphere, service and seafood buffet section is worth it. This was my mom’s favourite meal during our visit to Hawaii and as people who like to eat, that’s high marks. Prime rib, poke of all kinds, luau pig, killer desserts. We had a prime covered outdoor table overlooking Diamond Head.",
   "Top notch service and food! Eric was our server and he was very professional and personable. Although we were not staying at the Halekulani, it appeared to be a beautiful hotel on the beach of Waikiki. The food was superb and we will definitely return!",
   "What a beautiful restaurant for a special occasion. The staff, food and ambience is amazing. Daniel was an exceptional waiter and couldn't ask for a better service.",
   "The service was excellent but the food was only mediocre given the price.\nIt was very empty even at dinner time.\nThe lounge nearby seemed a lot more lively with live music."
  ]
 },
 {
  "name": "The Pig and The Lady",
  "address": "83 N King St, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d5469fc2-9330-11ea-89e0-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "family",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4339913891030827719",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful place! Was seated pretty quickly for not having a reservation, but can definitely see this place being very popular most nights. The food is wonderful. Got the pork ragu tagliatelle and was amazed. Was able to try some of my friend's foods and highly enjoyed those as well. They also have some pretty crazy drinks too! Also shared the P&L sundae swirl and enjoyed it. Definitely recommend!",
   "Fried chicken was really good! Juicy and full of flavor. Spring roll are fresh and tasty.\nOnly the roast fish kind of stinky. You know you really didn’t do well when Chinese people can’t eat that food.\nBut service here is awesome, fast and friendly.",
   "Food was good, I ordered the chicken salad vermicelli bowl while my fiance ordered the pho beef dip. Service was really good, the bathroom was definitely a cool atmosphere. The fiancee and I enjoyed each  flavour, but the brisket he had gotten was a bit more on the drier side. Will recommend to any future family and friends going to visit Honolulu.",
   "I love the fact the waiters/servers not only hand you menus, but they also make recommendations and tell you what the specials are for the day. It's not only comfy and cozy, but also very trendy and modern. I love the set up of this place and the semi-open commercial like kitchen... the decor is beautiful. My coworkers really enjoyed the wings and the calamansi slushies. I simply loved the garlic noodles with crispy pork belly! The garlic noodles with the pork belly was so savory and delicious. Definitely recommend.",
   "Love this place, food is sensational. I sometimes get upset because they change the menu often to keep it fresh and then I fall in love with some new item. And do NOT forget to save room for a soft serve, they are out of this world,"
  ]
 },
 {
  "name": "Side Street Inn",
  "address": "1225 Hopaka St, Honolulu, HI 96814, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d59757b6-9330-11ea-8407-14b31f159f22.png",
  "tags": [
   "family",
   "eat",
   "affordable",
   "delicious",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14300980095629086662",
  "source": "GoogleMaps",
  "reviews": [
   "Easily accommodated our party of 8 at one of many large tables.  Family style portions mean you WILL be full when you are done.  Don't eat too much because desert is equally excellent to the main courses.  Don't sweat the location/ally this great place is in.  A very welcoming restaurant and staff made this our best Honolulu dining experience.  shockingly affordable.  Dinner for a table of 8 with 3 deserts and adult beverages for all 8 was $200",
   "The locals here are so warm and welcoming. I recommend the Kim Chi fried rice and the garlic fried chicken. Absolutely delicious. Call for reservations because they get busy quick.",
   "Had dinner here with friends from Fiji and Guam. Loved the food! Manila clams, pork chop, vegetable salad. big sized serving. Must try if you are in Honolulu.",
   "Family style sharing of food. Best with party of 3 or more due to quantity if food served. Fried pork chops are the best along with their fried rice",
   "Fantastic food place. Extremely highly recommended."
  ]
 },
 {
  "name": "Sweet E's Café",
  "address": "1006 Kapahulu Ave, Honolulu, HI 96816, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d5e550e8-9330-11ea-84f2-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2104760758963798141",
  "source": "GoogleMaps",
  "reviews": [
   "This place is so amazing. All the dishes are very delicious. You must try one of the many scrumptious omelets. The breakfast burritos are in sanely good I had one today. We also had the Belgian waffle with fruit so tasty. We had a delicious refreshing salad made with fresh local style greens. And we also had a side order of their amazing fried rice. They are very efficient and the wait is not long at all even though there's a lot of people outside.  Needless to say I highly recommend sweet e's for your breakfast cravings.",
   "From the outside the place looks like a dive but don't let this fool you.  The inside and bathrooms are very clean.  The food is amazing.  They were the best meals we had in all of Hawaii.  You can tell that there is care put in to the prep and cooking.  The staff is fast and very friendly.  6 stars if i could.",
   "I went here on a Sunday morning and was extremely pleased. They have a valet service upon arrival and a waiting area. I had to wait maybe a half hour but it was well worth it. This place is a smaller more local type restaurant, but the food does not disappoint. They are very generous with their servings and the pancakes here are some of the softest and fluffiest I have come across. They can probably be cut with a spoon. Overall food and service was great. I will be going again for sure.",
   "First time here but saw the star rating. Been on the hunt for a good eggs Benedict. Waiters very attentive. \nFood A+. Super stoked I found this. Super busy Friday morning. Parking a little tight so look to the street. Place is awesome sauce",
   "First time here at this restaurant and it was amazing!! Seating areas inside and outside for dining. Food is great and plenty to choose from. Bathrooms...cleanest restrooms I have ever been in. Parking is like any place, limited and hard to find. \nOverall Sweet E's Café is now on the GOTO place to eat, especially for breakfast"
  ]
 },
 {
  "name": "Uncle's Fish Market & Grill",
  "address": "1135 N Nimitz Hwy, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d62da4b8-9330-11ea-b6c7-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "music",
   "delicious",
   "tasting",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4452765542394428866",
  "source": "GoogleMaps",
  "reviews": [
   "Tasty food, lovely setting, excellent service, live acoustic music, generous portions, diverse menu, good iced tea! Neat find on the water, one of the intriguing dining choices at Pier 38. We were asked if we had reservations, we didn't, and were seated within about 10 minutes. Appeared to be many seats available,  so maybe they get hopping a bit later. Reservations are easy enough to make, so consider doing so. Also, spacious main dining room and a quieter room off to the side for more private meals. We enjoyed the back room seating and had very attentive service. Beautiful setting for a walk by the water after dinner. Overall, we found Uncle's to be quite a pleasing experience, and think you will, too.",
   "Truly an incredible dining experience. We had the combo sashimi and ahi belly. It was an unrivaled experience, and I am grateful we had the opportunity to finally go!",
   "Came here for dinner and definitely got what we were looking for!! The place itself and decorations is pretty awesome especially if your a fishermen!! Very nicely decorated, we got the catch up the day (I forgot the fish name) that was delicious!! And also got the poke trio, thought it was a smaller place when ordering and boy was I wrong (picture does seem like a lot but it really is! 3 VERY good portions of the most amazing poke I have ever had! I have eaten a lot of diffident poke and this place is by far the freshest/best tasting I’ve had!!",
   "We had the Uncle Combo platter. Best calamari steak I have ever eaten. Fish and shrimp were so fresh. Cole slaw better than I make at home. Staff is so friendly and happy. You must try this place.",
   "So we are in Hawaii for a big family trip. This place was highly recommended. The food was very good. The clam chowder quite possibly the creamiest with large clam chunks ive ever had. All of the fish was fresh. Waiter did his best to accommodate our party of 15, and only a few things kept it from being 5 star."
  ]
 },
 {
  "name": "Chef Chai",
  "address": "1009 Kapiolani Blvd, Honolulu, HI 96814, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d66d941a-9330-11ea-aad1-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "art",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1794616968748768527",
  "source": "GoogleMaps",
  "reviews": [
   "Took the girlfriend here for Valentine's Day. Firstly, the presentation of the food was immaculate. Secondly, the taste of the food was immaculate. Thirdly, the cost of the food seemed to be worth-while if you're a foody and are willing to pay for presentation. The staff was also great and responsive to requests. I'd highly recommend this place for a nice date or an important meeting. The alcohol selection was also decent and they had plenty of wines to pair with your meal.",
   "We recently were here for Valentine's day. The menu was prix fixe so there weren't as many choices as usual. The appetizer was very impressive. The ahi tartare and the oysters were my favorite. The entree was good. They cooked the steak to a perfect medium rare and the sauce was tasty.\n\nThe desserts were the star of the meal. The white chocolate truffle and raspberry/guava sauce was out of this world.\n\nWhen in Honolulu again, I will revisit to give the standard menu a shot and see if they still have that dessert.",
   "Amazing food! I ordered the vegetarian menu set and it did not disappoint! Even my daughter loved her appetizer sampler and she's six!",
   "The best dinning  experience I have had in a long time. I had the lamb chops in a brandy sauce and it was awesome.  The sevice was perfect.",
   "Had a great experience celebrating my wife's birthday. The food was fantastic in taste and artful presentation. Very cool street art around. Waiter helped me surprise my wife with a jewelry gift at desert. Also the duck taco's are fantastic. No misses on taste, quality, presentation, or service."
  ]
 },
 {
  "name": "Azure",
  "address": "2259 Kalakaua Ave, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d6b572d2-9330-11ea-a0a6-14b31f159f22.png",
  "tags": [
   "tasting",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2427623133092715878",
  "source": "GoogleMaps",
  "reviews": [
   "We had an absolutely fantastic evening at the Azure. I took the five-course Prix Fixe Menu, which was excellent. The location and atmosphere are just great.",
   "This was our first experience at Azure and we were very impressed. The restaurant is within the stately Royal Hawaiian Hotel on Waikiki Beach overlooking Diamond Head. We opted for the 5 course treating menu and every dish was extremely creatively presented and the flavors were sublime. Although it was a \"tasting\" menu, we were more than content when dinner was complete. Raymond was an outstanding server: very professional and affable. I also enjoyed the pacing of the dinner; unrushed, with ample time to enjoy every dish. This was a superb experience and we look forward to returning in the future!",
   "The ambience and presentation of food was amazing.  The waiter was very attentive and friendly.  The only thing was that although the food tasted good the food started getting really salty as we got closer to the bottom of the dish.   The part not in the sauce was very delicious.",
   "wonderful.  The view is awesome.  Exquisite food and 10 star service.  I recommend it 1000%",
   "Service was very friendly & attentive. 5*. Sunset view can't be beat. My scallops & ahi tuna was excellent. The mixed greens salad was a large portion & very tasty. $$$$"
  ]
 },
 {
  "name": "Hy's Steak House",
  "address": "2440 Kūhiō Ave., Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d700ae7a-9330-11ea-b3b3-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "cheap",
   "food",
   "walking",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10268829922205023026",
  "source": "GoogleMaps",
  "reviews": [
   "Best lamb chops ever. Caesar salad is unmatched by anyone. Best also is the escargot. I have eaten there many times over the years and it's always been great experience. Recommended to anyone. A little pricey but worth it.",
   "Awesome awesome food.  Steaks, rack of lamb, lobster tail, and king crab legs were the best! The desserts were excellent.  Bananas Foster is still our ultimate favorite. Capt Brett and the crew were super excellent.  They were entertaining and funny. Can't ask for anything more!  $$$ but worth every penny.",
   "AMAZING! From the minute we entered, we were in awe! From the service to the meal, everything exceeded our expectations. This is a MUST for those who have want fine dining, great food, and excellent service. And KIRBY is a great addition to the fabulous team. We will definitely return.❤️❤️🌺🌺",
   "Found this place just by walking by and went im for a quick meal not thinking much if it. To our surprise it was one of the best places I've dined in Waikiki.  Food and service was amazing.  Not cheap but well worth a steak there or anything on there menu everything was delicious with good old fashioned service. .",
   "Can’t go wrong with Hy’s and their Waikiki branch did not disappoint! From drinks in the bar to dinner in the dining room, everything was old school charm & elegance and the food was excellent. The Prime rib was some of the best I’ve ever had - seasoned well and cooked to medium rare perfection. We unfortunately didn’t have room for dessert but the bananas fosters with ice cream looked (and smelled) divine."
  ]
 },
 {
  "name": "Yard House - Takeout & Delivery Available",
  "address": "226 Lewers St l148, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d744a4ae-9330-11ea-970d-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "free",
   "food",
   "delicious",
   "food",
   "hike",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11881004039529429627",
  "source": "GoogleMaps",
  "reviews": [
   "I can't tell which I love more. The beer or the food. I just got into drinking craft beer last year and let me tell you how excited I was to see all of the different beer taps. Sam 76 is hands down my favorite beer and they actually had it. There's something for everyone. If you never tried craft beer it doesn't hurt to try because the staff are extremely knowledgeable. More knowledgeable than I thought especially with the quantity of beers they had. I requested for a random flight of beers and each one was a perfect choice. The food was spectacular. Baked Mac and cheese appetizer was unlike something I've never tasted before. I went with 6 friends and tried each of their food and it was all of top quality. I would recommend this to anyone. This goes in my book of 6 stars",
   "Amazing selection of beer, food was amazing. Love the lack of bright light. Got seated without waiting and my server was super friendly and helpful with the questions I had regarding the menu. Food came out quick and the appropriate temperature. Definitely will return often. We even had a free appetizer coupon that had expired and they allowed us to use it :)",
   "I love dining  at this restaurant. The food is great and the beer selection is beyond amazing! The server was great.  He was quick to greet us to get our drinks. The food was perfect. It was cooked exactly like I wanted it and it was delicious. Will come back for more!",
   "The first night we went to Yard House, we missed happy hour by 10-15 minutes. We asked our server if he would let it slide, and after talking to management, we got the happy hour specials on beer and appetizers. Our server, Fred (aka Jordan), was very friendly and gave us recommendations about things we should do on the island during our stay. I highly recommend the chicken nachos and boneless wings, both were some of the best plates we had while vacationing in Hawaii. The second time we visited Yard House, we were greeted by the waitress, who we had met during a hike the same day - what are the chances. She gave us dessert on the house. if I had it my way, I'd go to Yard House for apps and drinks every night.",
   "Yard House is a Waikiki favorite of mine. Never fails. Guaranteed great food and drinks. it wasn't after a year of eating there that I realized that it was a chain restaurant. I never would have guessed. It's great because they're open really late as well. So if you come in on the late flight and you're staying in Waikiki I recommend this place. However it can be a bit loud."
  ]
 },
 {
  "name": "Aloha Tortilla Factory & Cafe",
  "address": "1 Aloha Tower Dr, Honolulu, HI 96813, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d78c32c8-9330-11ea-8114-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4692806459223460360",
  "source": "GoogleMaps",
  "reviews": [
   "The best tacos I have had in a long time. They are made from scratch and you can tell. Just wonderful. A nice little salad came with it with a light dressing that we delicious. Nothing else comes close in Waikiki. Don’t not miss this little place, right under the Aloha Tower.",
   "I got the beef, chicken and pork tacos and they were all fresh and amazing!! The gentleman I had the pleasure of placing my order with was so courteous and friendly... I will find out how to spell his name and update lol!  I really appreciate the friend who recommended I try it!! I will DEFINITELY be back!!",
   "I have lived in Hawaii for a year now been to many restaurants but this is by far the best tacos I’ve had on this island. Owners are extremely nice and you can tell they care about your satisfaction. I will be coming back and often. Plus you can not beat the price !!!! \nMahalo !!!",
   "This was the best Mexican food I have had on this island!  You can tell that the food was prepared with love and a lot of precision.  I happened upon the place by chance.  I will definitely be back!  The service was wonderful.  They were welcoming and friendly.  The food was extremely delicious.  But on that note I would suggest to make two orders so that you have some to take with you.  The prices are very reasonable and I would recommend this place to anyone that likes Mexican food.  The carne asada is my fave hands down!  Make sure to get extra green salsa if you like spicy food!",
   "This is truly authentic Mexican cuisine! I was leery at first with the simplicity of the ingredients but then heard the owner speak and knew it was going to be legit. I ordered the 5 carne asada tacos and a side of chips and salsa, my husband ordered the 5 pork tacos and a torta.  Right off the bat (since they were close to closing) I had my husband go grab another chips and salsa to go for my dessert later. The tacos were so genuine that I can say as I born and raised Cali resident and avid Mexico visitor and being half Mexican, that these were truly the closest thing to what the women of the churches down there used to make for us. Doubled up corn tortillas, simple ingredients, and perfectly proportioned. I'm not a huge torta eater but my husband adores them and made me divulge...and boy was it worth it! One of the best I've EVER had! Thank you for bringing legit tacos to our island finally!"
  ]
 },
 {
  "name": "MW Restaurant",
  "address": "1538 Kapiolani Blvd #107, Honolulu, HI 96814, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d7f1d2ae-9330-11ea-9d9b-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "tasting",
   "food",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14877983487591960271",
  "source": "GoogleMaps",
  "reviews": [
   "I love MW. They were super accommodating to my allergy and let me know any dishes that had come in contact with my allergen/recommended against certain foods. The food is delicious, portion size is good—what you’d expect from a nice restaurant in this price range. The set menus are nice if you’re pretty hungry. The atmosphere was nice and the wait was a bit long without a reservation but I’d recommend going as long as you are okay with the wait, get there before the rush, or make a reservation.",
   "Loved it. Did happy hour and lunch pre fixe. Our waiter was just an awesome server. Explained the menu in great detail and was excellent at service. Our food was terrific. The soup, fish dishes were all just superb. We enjoyed this as our last meal on this island. Amazing finish",
   "Absolutely delicious amazing food. The dessert was fantastic. We had the 5 course tasting menu and loved the little sampler of different apps. Great place.",
   "One of the best dining experiences I’ve ever had. Big kudos to the chefs and servers for amazing food and service. I would highly recommend the boa buns and the “fried chicken” as starters. Make sure to make a reservation well in advance for this 5 star restaurant!",
   "Menu is limited if you have dietary issues (I don't eat certain meats), but the service is TOP NOTCH, and the food tastes delicious!!!! The strawberry pineapple soda (referred by our server) was so yummy, and The \"shave ice\" dessert was AMAZING. Seriously good."
  ]
 },
 {
  "name": "Fête",
  "address": "2 N Hotel St, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d837695c-9330-11ea-bfe3-14b31f159f22.png",
  "tags": [
   "food",
   "library",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10344377934156059419",
  "source": "GoogleMaps",
  "reviews": [
   "New American style restaurant in downtown in Hawaii. We did make a reservation but we had to wait to have a seat for 30 minutes or so as it was overbooked. That could have taken one star away but the quality of food is amazing so that I couldn’t take it. The staff is also nice and friendly so we did enjoy the good dinner. The restaurant looks so popular that the reservation is highly recommended. Also our reservation time was 8 pm but some plats were already out of stock, so early time might be better if you have something you want to have.",
   "The server was wonderful.   The location is in china town and we went on a Sunday night which meant dodging human poo on the sidewalk to get there.\n\nThe cheese plate was good and the dipping sauces were good.  Totally overpriced though. \n\nI got the risotto with beef cheeks which tasted bland like a braised pot roast on a plain risotto base.  Almost no flavor which is weird since risotto is normally a sponge for flavors.\n\nMy wife got the gnocchi which seemed a little undercooked.  The gnocchi was extremely soft and borderline raw, however it could have been a loose batter since the ricotta cheese. \n\nOverall it's not worth the prices since you can buy a cheese plate anywhere else for less and the protein I got was bland as well as the starch. \n\nI dont think we will return, if we do its because the server was awesome and the ambiance was great since we were in the \"library\"",
   "Great ambiance, however dishes are hit or miss. Appetizers & cocktails are fantastic, however the entrees are unspectacular and a bit run of the mill. Suggest hitting up this spot for starters and tasty drinks at the beginning of the night and another establishment with fantastic entrees elsewhere in downtown Honolulu for dinner. Service is great, very accommodating.",
   "Really good food. The nicoise  salad is large and delicious. The deviled eggs are some of the best I've ever had. Happy hour is $3 off cocktails and the bloody Mary is amazing!",
   "This is a cozy place, rather new, and shows signs of evolving into a quality restaurant. The special dishes off the menu are more imaginative and excellent."
  ]
 },
 {
  "name": "La Mariana Sailing Club",
  "address": "50 Sand Island Access Rd, Honolulu, HI 96819, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d89e42ae-9330-11ea-810d-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "free",
   "eat",
   "food",
   "food",
   "food",
   "free",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=10323173402332810971",
  "source": "GoogleMaps",
  "reviews": [
   "Great food, great service. We had the (double) burger, which was juicy and tasty, and the ribs, with their sweet and juicy taste. The Mai Tais were great, according to my wife, our little one enjoyed the linguine from the kids menu. Overall a pleasant stay, except for one bit of criticism: when asking for dessert, we were told they had some ice cream pie only. The table next to us, regular visitors, obviously, were offered with a variety of dessert just a couple of minutes later. Would still recommend, we liked the coziness of the restaurant.",
   "Great atmosphere! Quite the awesome restaurant tucked away in a corner by the sailboats! Twice a week they have a singing percussion playing group that performs as you eat. Parking is free. Food tastes good- we got the kailua pork nachos and calamari (theirs looks more fish stick like- not quite what I expected, but still good). Wish we came to this spot earlier, it's a fun place to go and enjoy the scenery and relax",
   "I can't rate the food because we never got any.\nThere seems to be an in crowd here that the staff all knows and caters to. And we weren't them.\nThere was a wait for a table, which is fine, but the staff missed open tables again and again. Literally, the people waiting were pointing out empty tables.\nAfter about 25 minutes, we were seated. The server visited the table next to us no less than five times--she brought their food, a round of drinks, extra horseradish--and never so much as cast us a sideways glance. 20 minutes and we hadn't gotten water or the time of day.\nA group was seated across from us--regulars. When the server brought then water, we walked out.",
   "Alena made our dining fun and memorable. The food was tasty as well. And the bartender did his job making excellent drinks. The female manager opened the store for us so we could buy shirts. Lots of tourists. The locals are missing out.",
   "There are few places left in Honolulu that are free from the tourist masses and this is one of them.  Food was great, and the live music entertaining, but nestled at the end of an industrial section of the water front the ambiance wasn't as inviting as I'd have liked.  But you can't have it all. Would I go back? Yes, but with slightly lower expectations."
  ]
 },
 {
  "name": "Ruth's Chris Steak House",
  "address": "Waterfront Plaza, 500 Ala Moana Blvd, Honolulu, HI 96813, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d8ea540c-9330-11ea-8f7f-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6595510966481680229",
  "source": "GoogleMaps",
  "reviews": [
   "Now the best experience ever. We have eaten here for years. It is out \"go to\" place for the best steak, seafood, and service. We have NEVER been disappointed in Ruth Chris in the past 23 years, 8 locations, and 5 states until last night. It was busy and I get that, but they failed on so many points throughout the evening it is very hard to give them any slack as being a one off. The manager did his best to make up for everything. It is hard to believe that our old faithful had let us down on such a special night. We will think about it if we are going to go back again and try again.",
   "Although it was very busy on Valentine's day, Victor was running around making sure we had everything we needed. Excellent service by Victor! \n\nFood was good and our server was good. Service was slow other than Victor's filling water, getting bread, and asking if we needed anything else. Ambiance is good. Great date night 🥂",
   "The staff was very pleasant and courteous. Menu is similar to that on Mainland, which was great! My rib eye was not initially presented to me in the manner that I ordered it (Req for MW but it came out R) but our server immediately rectified it. Looking forward to our next wonderful experience @ Ruth Chris, Honolulu (Ala Moana location)",
   "We went to Ruth Chris Steak House this evening for an office party. A Great location at Restaurant Row with lots of parking. It is located just outside of Waikiki. The food and service were excellent. The decor was upscale casual and very comfortable.\nI highly recommend Ruth Chris Steak House for great food, good prices and convenient location with lots of parking.",
   "The steak is always on point and the service is excellent ... they always make us feel so comfortable and relaxed.  They also have all our favorites for dessert.  Hard to not leave her feeling satisfied and at least 5 pounds heavier!"
  ]
 },
 {
  "name": "Da Ono Hawaiian Food",
  "address": "726 Kapahulu Ave, Honolulu, HI 96816, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d939ab90-9330-11ea-9515-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11888826448879778896",
  "source": "GoogleMaps",
  "reviews": [
   "Good food but priced high compared to other local spots. I liked everything we tried other than the poi. It just wasn't my taste. The staff is friendly and welcoming. Stop by if you're in the area.",
   "Service and experience we're top notch. A local buddy told me this is the best authentic Hawaiian food in the area; for that I had to try it. Glad I did.",
   "Great authentic Hawaiian restaurant. If you want a true taste of Hawaii, this is a must!! Food was delicious and the service was fantastic!",
   "Love the chicken long rice and laulau. Not as crowded as it used to be but the food seems to be the same to me so no complaints here.",
   "This was good but I think it can be better. I got #1 & #4.. #1 lacked a bit of flavor, I liked number 4 better and it was pretty good. And I would say it is pretty fresh. Lack of stars is due to flavor and size, the amount you got for the price you payed was a bit much and I saw the guy next to me get a large and there was barely a difference."
  ]
 },
 {
  "name": "Shokudo Japanese Restaurant & Bar",
  "address": "1585 Kapiolani Blvd, Honolulu, HI 96814, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d98eab3a-9330-11ea-9ce8-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15776328478705526338",
  "source": "GoogleMaps",
  "reviews": [
   "Returned to Shokudo after a long hiatus and happy to see that the food & service are still top notch! Known for their Honey Toast & fresh seafood offerings with a casual, welcoming atmosphere Shokudo restaurant does not disappoint.\n\nAt my last visit our group was greeted at the front and seated almost immediately. Our server April was very sweet and while admitting that she was new, she already had some favorite items on the menu, the Homemade Tofu Salad & Red Eye Roll. We ordered both as well as a few other dishes on the menu. Both of her suggestions were fantastic! The tofu salad is not only delicious, it's also huge and was great to share for our party of three. The service was very attentive, April as well as another server, Alex, answered our questions on some unfamiliar items. Even though April didn't know the entire menu yet, she was happy to check with senior staff and came back with answers and a beaming smile :D When our meal was winding down one of the managers, Karlo, stopped by and suggested the famous Honey Toast for dessert. He joked that some meals both begin and end with Honey Toast, suffice to say, we were sold. I was especially happy to see that it was available with two of my favorite flavors of ice cream, Cookies n Cream, and Green Tea! We will definitely be back.",
   "Wonderful happy hour. I love their housemade tofu and mochi gratin. Honey toast for dessert is a must.",
   "I would’ve given this place 5 stars if it wasn’t because of the booths we were sat on. They looked old and overused, so this place probably need to upgrade a little bit. The food on the other side was delicious. We tried the pizza sushi or something like that and the baked lobster roll, I can’t really remember the names, but they were very tasty. The lychee refresher was also really good with boba. The service was good, our server I think he mentioned he wasn’t a server but was covering for someone else, he did a pretty good job and was always trying to help. I would recommend this place.",
   "Took my friend here for her birthday. Everything was great. The waiter gave us a great recommendation for saki. The sushi were tasty. The mandoo was crispy and tasty too. The Honey toast is decent just for pics",
   "Prompt and friendly service. Comfortable booths. Some of the menu items are a bit pricey, but worth it for the quality. I like that they offer a sake sampler. The bread pudding is to die for"
  ]
 },
 {
  "name": "Duke's Waikiki",
  "address": "2335 Kalakaua Ave #116, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d9d264de-9330-11ea-971c-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "music",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18446429482955885041",
  "source": "GoogleMaps",
  "reviews": [
   "Was recommended Dukes Waikiki for breakfast from my hotel staff. They offer a breakfast buffet for only $18.00. Everything I ate was delicious. They have made to order omelettes, chicken sausage links, Portuguese sausage, potatoes with vegetables, french toast, pancakes, oatmeal, fried rice and a spread of fresh fruit. I ate her 3 times while I was here and was never disappointed. The best part to me was the coconut syrup for the french toast. Delicious!",
   "Whether here in Waikiki or at home in Huntington Beach, you can never go wrong with Duke's. Always great food deliciously prepared. Excellent quality fish and other options for those wanting something else. Lunch is easy and has a more middle road menu (but just as delicious) - dinner is a little more fine dining and here in Waikiki gets REALLY busy. Either have reservations or plan on waiting 1-2 hours! I had fish and chips today and it was awesome!",
   "Excellent breakfast buffet, only $18. Coffee, water and/or tea included in price. Additional beverages available for purchase. Host was extremely welcoming and struck a conversation after calling our party. Wait time was no more than 10 minutes. Scrambled eggs are savory and cooked the way they should be, not like the hard rubber-like eggs served elsewhere. Omelets made to order. Lots of fruit, yogurt, and cereal choices. Fried rice and white rice available. Definitely planning to visit the Huntington Beach location in the near future.",
   "The buffet at Dukes is fresh and fantastic. We have come here several times over the years and will keep coming back. The prime rib was perfectly cooked to my request. The atmosphere is classic Waikiki, the staff is extremely friendly and courteous and the live music drifting from table to table was a nice touch.",
   "This place is crazy busy but worth the wait. We visited twice while vacationing in HI. Once as a family with a reservation and once as a couple with no reservation. There really isn't a bad table in this restaurant.  The table we had as a family faced the ocean and the deuce was in a small quiet dining area. The food was great, the wine list quality and accessible and the martinis nice and chill. The local fish was delicious, tender and flaky."
  ]
 },
 {
  "name": "Kyung's Seafood Inc",
  "address": "1269 S King St, Honolulu, HI 96814, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/da1e893a-9330-11ea-989f-14b31f159f22.png",
  "tags": [
   "food",
   "tasting",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9537148217024722745",
  "source": "GoogleMaps",
  "reviews": [
   "Always fun, always great food. Lots of street parking close by",
   "And just wow!!!!  Love the small cafe feel and the big tasting food.  Everything is so fresh and so authentic.  \n\nFabulous food & atmosphere!  - call ahead for reservation",
   "I like that they close at midnight. When I crave spicy ahi and everywhere else is close, this place is my go to. I usually order BBQ chicken and poke plate. Or meatjun and poke plate. They have good quality food and their customer service is good. Auntie is always so friendly to her customers. They have parking at the back. But when its full, they are surrounded by street parking. So parking wouldn't be a problem.",
   "One of the most delightful meals we had on our Hawaii vacation! Inconspicuous, unpretentious locale. Easily the best Saba fish I've ever eaten.",
   "I HIGHLY recommend this place! It you love Korean-style sushi, look no more. They give hearty portions and you won’t be disappointed. They have lots of options but I mainly got the sashimi plates because that’s why I went. The owner was super sweet and gave lots of side dishes for us to try as well."
  ]
 },
 {
  "name": "Lam's Kitchen",
  "address": "1152 Maunakea St # A, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/da61ffda-9330-11ea-bc35-14b31f159f22.png",
  "tags": [
   "family",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=787969876759222331",
  "source": "GoogleMaps",
  "reviews": [
   "Unbelievable find recommended my family members. Amazing dumplings and dishes. You can't order anything wrong! A must stop! ❤️",
   "Solid taste and solid portion. You can't go wrong",
   "What a great little place in Chinatown for a noodle fix. Here they specialize in rice and egg noodle dishes that are made in house. Came in with a group of 7 and got their beef flank & tendon mien (8.99$), wonton mien (8.25$), and beef choysum chow fun (8.99$) and it was delicious. The portion size is amazing and the flavors were spot on. We had an order of wonton on the side (8.00$) to add it to the beef noodle soup and it was excellent. The service was also great. The servers were patient and attentive. Gave them an extra tip because they were so nice. The restaurant is small so you might have to wait a bit before if you come in a large group.",
   "Chinese comfort food at its finest! Service was fast and friendly. The atmosphere was inviting. Seating is minimal but turnover was fast. Parking may be an issue because it is in town. But, I will be going back a lot.",
   "OMG ! Off the Hook.... Delish and Great Value!"
  ]
 },
 {
  "name": "Hula Grill Waikiki",
  "address": "2335 Kalakaua Ave Office of Institutional Effectiveness, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/daa91b10-9330-11ea-a86d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "knowledgeable",
   "food",
   "free",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=863984581476500872",
  "source": "GoogleMaps",
  "reviews": [
   "My friends love this place and have been raving about it since I've met them, so I decided to tag along to try it out. I was not disappointed! First of all, the view was amazing. We on the patio with a view of Diamond Head and Waikiki beach. Secondly, the wait staff was extremely helpful and friendly. Lastly, the food was delicious! We got the ribs for an appetizer and I got the breakfast burrito. I will definitely be revisiting this place in the near future!",
   "Fantastic restaurant with nice views on beach and ocean. The food here is fantastic, no matter what you like and order. I personally like the fish dishes, and all I've tried so far were delicious. Don't forget to try the hula pie (easily serves two people), it's fantastic. The service has always been very attentive and great when we've been here. I've experienced some waiting for a table, depending pob when you're here, but no longer than 10 to 25 minutes. You can place a reservation online, just to be sure. Every time we've been on Oahu, we came here and were never disappointed.",
   "OUTSTANDING FOOD AND SERVICE\n\nWe were in the mood for seafood and were not disappointed. The menu offered several fish dishes along with a shrimp/pasta bowl. The very knowledgeable waiter described everything in great detail and his timing was spot-on. We were able to secure a prime table along the rail overlooking the beach due to the promise of the hostess, Bethany. Although somewhat noisy and hectic, a very memorable dining experience for us.",
   "Wonderful gluten free chowder. But double check your menu has correct prices. If you get old lower prices menu, they will not fix them to what you thought you would pay when you were handed over a menu. So besically fairly typical Hawaii non existent customer service aka. \"we don't care if you are back\" attitude.",
   "Perfect spot for a sunset dinner and a mai tai. Make sure you request a seat on the terrace and then sit back and enjoy the ocean views, live local music @ Duke’s and the lively activity on Waikiki Beach, all from an elevated position. \nGreat friendly service, and good food. Loved the Calamari Steak, and the Mac Nut Shrimp! Make sure you order the hula pie to finish- to share. It’s so amazing. \nLive music and hula dancing in the bar area."
  ]
 },
 {
  "name": "La Cucina Ristorante Italiano",
  "address": "725 Kapiolani Blvd, Honolulu, HI 96813, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/daf9fdcc-9330-11ea-83f8-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15623886058604963591",
  "source": "GoogleMaps",
  "reviews": [
   "Easily the very best Italian restaurant in the pacific! Such a treat in the middle of town away from the silliness that is Waikiki. The food is prepared per order from scratch...and it shows. The food is absolutely superb. The staff will tell you that there will be a wait for the food due to the impeccable preparation, but I've not once been displeased with the time it takes to receive incredible food. Another glass of wine never hurt the appetite anyway! The staff is friendly, attentive and jovial.  I cannot say enough great things about this place!",
   "Everything we've tried on our visits here has been excellent. The cioppino is great, and my wife loved both the bolognese and the gnocchi. The atmosphere is cozy and romantic. The service was prompt, attentive, and friendly. The food is made fresh when you order and thus takes awhile to arrive, and without reservations expect a wait to be seated.",
   "All food is made to order and is AMAZING!!!! You need at least a party of 4 to RSVP. The food is worth the wait. Definitely will be going back again.",
   "Came here on a Thursday a bit before 530 and snagged a table. If you're a pasta lover, you definitely have to try this place! We ordered the Crostini Al Porcini and the Bone Marrow for appetizers. Those were delicious! Bone Marrow was salty but still really tasty. For the main, we got Trenette Norcina and Ravioli Neri. Norcina stole the show for me. Pasta was so good and fresh! Ravioli was also good but scarce. Would definitely come again. Main dishes took an hour to come out but it's worth it.",
   "Great food, great service, just go already."
  ]
 },
 {
  "name": "A Place to Eat",
  "address": "1035 University Ave Ste 104, Honolulu, HI 96826, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/db455b62-9330-11ea-be06-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "cheap",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12738075650361326330",
  "source": "GoogleMaps",
  "reviews": [
   "Heard about this place through a travel guide. Was initially skeptical but the food and service were incredible. The no-frills, laid-back atmosphere made it feel like the place was dedicated just to us. Ribs were tender and cooked to perfection. Person I was dining with said the NY steak was one of the best he's ever had. Not even accounting for the low price, it's one of the best places to eat in Honolulu.",
   "A hidden gem of Honolulu. No table service and you can bring your own cutlery, plates and alcohol if you want or grab to go, but the food is fantastic and the owner is super nice. Awesome steak for $12! Should be called, \"A place to eat well for cheap!\" Looking forward to trying the rest of the menu. Mahalo.",
   "Super yummy super fresh. Very nice owner who was very accommodating! Thanks for making our New Year’s Eve meal (catering) great!!",
   "Will is amazing! I got off really late at night and came through hungry. Even though it was past closing he still went out of his way and he hooked me up with a delicious meal.  Thanks for making my night!",
   "What an awesome little, unexpected food joint! I stumbled upon this place on Yelp, asked a friend to join, and loved the whole experience. We came for a late dinner (they're opened until midnight). It wasn't too busy, but there are only a few tables so we did wait a few minutes to find a seat. We ordered at the counter and the girl working was super helpful and welcoming."
  ]
 },
 {
  "name": "PAI Honolulu",
  "address": "55 Merchant St #110, Honolulu, HI 96813, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dba4bb7a-9330-11ea-afdc-14b31f159f22.png",
  "tags": [
   "foodie",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9972998609271592383",
  "source": "GoogleMaps",
  "reviews": [
   "A beautiful place to go on a very special occasion or if your a foodie like me. We did the chef's seasonal 10 course meal. Yes pricey but worth it. Chef Kevin Lee is doing something amazing here and making Hawaii's local ingredients known to everyone. His team know what they are doing. The wine pairing was on point just have to go to experience it yourself. Salmon was cooked to perfection just🔥🔥🔥",
   "Great upscale fusion cuisine. The Naw maw gai was so tender and juicy. Lots of interesting flavor combinations.",
   "Absolutely incredible dining experience. Expertly crafted entree items and amazing specialty cocktails! The timing was slightly off between courses and leaves something to be desired from a few service aspect. Otherwise, incredible time.",
   "Service was excellent, food was also great. My only complaint was my main, the fennel fish sausage pasta, was overly salty. I love salty foods, but this was inedibly salty. I was a guest at dinner and didn't want to make a scene so did not bring it up, but I'm sure the staff would have handled it very well.\n\nI also saw that there was outdoor seating which was very pet friendly and staff supplied the dogs with water bowls and treats!! Bonus points!!",
   "Visited Pai Honolulu for Restaurant Week (RW). Its located inside the Harbor Court building on Nimitz Blvd. It's on the smaller size of restaurants but simply inviting. Aesthetics very clean, modern and borderline industrial. We were seated at the bar side and the place holders were locally sourced so that in itself is a plus. We were offered the restaurant week menu as well as the house menu. We opted for restaurant week and glad for it. The RW menu included two options for each course, a 3-course menu (see picture). The pictures say it all and likely does not do it justice. Each dish was well thought out, paired well with wine options and delectable but very filling.  My favorite was the NZ green-lipped mussel as well as the chocolate brownie. Well done, Pai Honolulu! We will need to come again to try your regular menu!"
  ]
 },
 {
  "name": "Nico's Pier 38",
  "address": "1129 N Nimitz Hwy, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dbe5c08a-9330-11ea-87a1-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "music",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=15960676630194966753",
  "source": "GoogleMaps",
  "reviews": [
   "Nico’s is a staple for fresh Hawaiian seafood. The atmosphere is the best because it is a bit outside the bustling city. The swordfish with mash potatoes is very tasty. Their beer menu is a bit on the smaller side. Nonetheless, my wife and I eat here every few months. Great place for dinner and lunch!",
   "Counter service restaurant. Big enough place to find a seat even if it's busy. Food comes out quick and is pretty darn good. The little fish shop they have attached here is also great with some ready made tasty pieces of seasoned fish to take away. If you're in the area and need a quick lunch, I definitely recommend this place. \n\nThey also have an upstairs restaurant for dinner with a different menu though I haven't tried it yet. I can only imagine that it is the same or better quality than it's downstairs counterpart.",
   "Ok so this place has been on my list to try for a long time and boy was it worth it! The food is amazing! Incredibly fresh! The fish and chips were fantastic! The fish was flavorful and tasted like actual fish instead of that frozen taste you sometimes get at other places. The mayo based dipping sauce that came with it had so much fresh flavor and was a wonderful compliment for the fish. Another time i had the fish burger and this was probably the best fish burger i have ever had. Every element of that fish burger was well seasoned and tasty! The open air atmosphere with the central bar is so great and full of energy.  There is often live music here which just adds to the great relaxed feel. Even though the place was busy, the food came out so fast! This place is worth the hype and excitement.",
   "Don’t bother with their Sunday brunch - zero effort to make a very limited spread delicious or even remotely appealing. We showed up at 1pm & the food looked like it had been there 2-3-4hrs. 6 or so slices of prime rib & 3-4 crab legs awaited customers. Military ID holders should head to KBay - limitless champagne & PILES of crab legs. Niko’s should send a team to observe & take notes - or don’t bother in the first place!",
   "My friend took me for birthday drinks and the bartenders really took care of us. They were very attentive and made good drinks.  We were lucky to be there during Happy hour when drinks are only$5 or $6. We ordered truffle fries which were delicious.  We also shared the salted caramel cake which we thought was cheesecake at 1st, but it's a layered sponge cake."
  ]
 },
 {
  "name": "MME Saigon Inc.",
  "address": "900 Fort Street Mall, Honolulu, HI 96813, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dc2d50ee-9330-11ea-b2ea-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2568189787812650082",
  "source": "GoogleMaps",
  "reviews": [
   "Food is great.  Friendly service. Really good authentic Vietnamese food.  This is the lemongrass chicken sandwich.  It has a lot of pickled veggies and good amount of meat.  I usually get my lunch from here.",
   "This is my go to for yummy vietnamese cuisine in downtown honolulu!  Lemon grass tofu on a salad or on papaya salad is delicious!",
   "Great food and great customer service! They were so nice and accommodating. There were good veggie and meat options to choose from. Will be back!",
   "Great flavors, good prices, lots of options",
   "I love their tofu!"
  ]
 },
 {
  "name": "Moku Kitchen",
  "address": "660 Ala Moana Blvd, Honolulu, HI 96813, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dc7d739c-9330-11ea-9b23-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "food",
   "food",
   "music",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=700602634640540987",
  "source": "GoogleMaps",
  "reviews": [
   "Great restaurant. Food is delicious, chef is on point! Duck Tacos were fire! Pizza was crispy and delicious, chicken wings were great. Truffle fries with dipping sauce was nice. We tried just about every cocktail and they were all unique and thoughtfully crafted. Our server Jenny was fantastic. Highly recommended.",
   "The restaurant was great and has a great location. Food was great, portions were smaller than most but will get the job done. Nice scene to be in especially for nightlife. Staff was great. For me personally I just don't believe the food is worth the price. It's not overly expensive. Just overrated in my opinion.",
   "Absolutley love this place. Good atmosphere. Extremely cordial helpful and chill staff. The happy hour is one of the best around. \nAnother plus, there was live music during part of their service, and props to the sound design of the space! Not just a guy with his monitor speakers blasting from the corner, the sound was actually piped through their well placed and balanced house speaker system. BIG props for that!",
   "We have eaten here twice on this trip! Both times amazing! The food and flavors are top notch! I docked one star because the second time we went there were a few things that came out wrong, which would have been no big deal but our waitress didnt even apologize for it and seemed bothered to fix it. Happy hour is also amazing deals, I would go out of my way for that!",
   "Happy hour is great here. Overall a wide selection of food and beverages to satisfy everyone. Staff is always very nice and the place is kid friendly. Outside seating is less noisy if you want to hear the person next to you. Butternut squash raviolis and the pizzas are great for sharing."
  ]
 },
 {
  "name": "Mexico Restaurant",
  "address": "1247 N School St, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dcd1d558-9330-11ea-92da-14b31f159f22.png",
  "tags": [
   "delicious",
   "music",
   "delicious",
   "food",
   "drink",
   "food",
   "delicious",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8380327975321075311",
  "source": "GoogleMaps",
  "reviews": [
   "Good Mexican, not great. There is an amazing Mexican place in Kaneohe that I was constantly comparing this place to so I was a little disappointed. However, the atmosphere is so much fun. It’s very authentic, had live music, the staff was friendly and the service was fairly quick. There is complimentary chips and salsa, and there is a wide variety of options. I would like to go back and try something else. I had the tostada salad and my husband had the California burrito. Their pork is very flavorful and delicious. That was my favorite thing I tried. Prices are reasonable and portions are huge!",
   "Great experience! My husband and I had an 8 hour layover in Oahu so we rented a car to explore Honolulu. This restaurant was fabulous! I loved the atmosphere, the décor was super cute. Our service was very courteous and recommended some great drinks! The food was delicious, would highly recommend to anyone needing a quick bite craving home style Mexican food!",
   "Not as good as I remember it from last year. The first few sips of the mango margarita were good, nice stiff pour....until I spotted a small ant in the glass. The drink was replaced with apologies and without question. In a tropical climate insects do happen.\nIn my opinion, the salsa left a lot to be desired. It is probably made in house, but tasted more like store bought; thick and no cilantro.",
   "Always have enjoyed the good food here. Now I have discovered the Hawaiian-Mexican fusion kalua pork crispy tacos with roasted pineapple I have a new obsession. And staff is always friendly and accommodating. Thanks!",
   "I came on “Taco Tuesday” for the $2.50 deal but decided against after discovering they’re real small corn tortillas with just meat and no toppings. Since my date already received his drink (which he didn’t like) I decided to order the Tostada Ranchero and boy was I pleasantly surprised when a large plate filled to the brim showed up. The food taste as good as it look. My date ordered the beef fajita and his order looked just as good. \n\nOverall if you want delicious food I recommend this place but maybe get your drink at a bar or don’t order the fancier margarita."
  ]
 },
 {
  "name": "Heavenly Island Lifestyle",
  "address": "342 Seaside Ave, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dd1b3ac0-9330-11ea-9243-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=6394596035766323226",
  "source": "GoogleMaps",
  "reviews": [
   "We have eaten here each of the last few times we have visited Waikiki. There is almost always a lineup down the steps which doesn't seems to move that fast but the wait is worth it. The staff were friendly and the food was fantastic, fresh and reasonably priced. We have never tried but I don't believe you can make reservations. We will keep coming back!",
   "Heavenly was recommend to us by some friends. It turns out they have good taste! Excellent French toast with fresh fruit. I would say portion sizes might be a touch small for the price. Then again, who wants/needs left overs from breakfast.",
   "Heavenly Island Lifestyle is a bustling but great restaurant to dine at. \n\nThe waiters and staff were very enthusiastic and always had a smile on their face. \n\nThe Big Island Ginger Pork Saute was very tender but should come with something to balance it out more. It's a bit salty with only the pork. The dish could come with more lettuce and tomato or something else. But pork tastes very authentic! I also think the prices are too high for the amount of food they serve. For example, the dish I mentioned above was $25.\n\nOne of the pasta dishes I thought didn't have much food on the plate. It was a gigantic plate with a blob of pasta in the middle. On the contrary, the sauce of the pasta tasted organic and the presentation of not only this item, but all of their dishes are spectacular. They really take the time to prepare everything nicely.\n\nThe outdoor seating is enjoyable and uncrowded. Sometimes there is a wait but it isn't too long. The staff told us 20 minutes but we got seated in no time.\n\nThe next door hotel where the bathrooms are has a nice seating area and has a really cool setting (see picture).\n\nOverall, I would recommend this restaurant to whoever's reading this!",
   "Delicious breakfast, there was a good variety of things from eggs Benedict  french toast, to ginger chicken Pho.  The service was good.  The restaurant is not that big but there is some outdoor seating. The ingredients are all local, sourced from the islands, so very fresh.",
   "Locally sourced ingredients cooked to deliciousness! We got the pork belly egg benny and the purple yam was a nice yummy surprise it was so good. Ambience is great and attracts birds coming in to visit, just remember not to feed them!"
  ]
 },
 {
  "name": "Herringbone Waikiki",
  "address": "2330 Kalakaua Ave #3, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dd622f10-9330-11ea-b644-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "music"
  ],
  "link": "https://maps.google.com/?cid=938316040274908016",
  "source": "GoogleMaps",
  "reviews": [
   "Sunday brunch. Bottomless mimosas. Great food and relaxed open atmosphere. it's a little iffy when it's rainy, but if you sit in the middle section or inside it's fine. Prices are a little high, but to be expected in Waikiki. I really miss Ray Ray's pancakes from the menu!",
   "This is one of the best restaurants I have ever eaten. My husband and I went during happy hour and ordered most of the apps on the menu. While everything was outstanding, if we had to choose a favorite it would be the brussel sprouts! I was ready to order a second round!!!",
   "This might be the best happy hour I've been to. Drinks were great, I had the Manhattan but they all got good reviews. Oysters are only $2 and they aren't the Pacifics I think it changes every day. The winner though,as weird as it sounds, is the buffalo octopus. By far the most well prepared octopus I've ever had. It sounds weird in the menu but I'd give it a shot.",
   "This place is on the 3rd floor of the outdoor portion of the mall. Google maps will mislead you and put you on the Macys side if the mall, but you want the opposite side.\nThe restaurant is in a quieter portion of the mall where one can hear the music downstairs,  but its muted enough to enjoy conversation. We started in the front patio area that had a high ceiling and was divided from.the mall by hanging platters and crab traps, so it was both airy and private. Service was efficient yet very pleasant and personable.  We had the Skiff seafood platter, plus two cocktails: Better Mules and Gardens and (I think) the Smokey Mistress. Both were sizable and well-constructed. Delicious.  The platter included oysters, crab, lobster and shrimp, all on a bed of ice along with 5 dipping sauces. All were perfectly prepared,  and the shrimp were a standout - we ordered a few more of those. So fresh and sweet.",
   "I’m oyster crazy so this is my happy hour heaven (4-6, 9pm-closing). Ask for the best ones they have ( seasonal). We got the Japanese oyster which I can’t recall the name. It’s one of the best I’ve ever had in the US. Similar taste to agate oyster I’ve had in Hog Island in San Fran."
  ]
 },
 {
  "name": "Stage Restaurant",
  "address": "1250 Kapiolani Blvd, Honolulu, HI 96814, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ddb44712-9330-11ea-8327-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "food",
   "delicious",
   "knowledgeable",
   "art",
   "food",
   "food",
   "delicious",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=1026334528521067673",
  "source": "GoogleMaps",
  "reviews": [
   "An awesome experience. The ambiance is trendy and romantic. The staff is very knowledgeable about their food, welcoming, and responsive. The food is delicious. There is a good variety. It's a fusion of various cultures, you can have a Beef Wellington, pork belly, or fish.",
   "First the good -  The food was excellent; the duck breast was perfectly prepared with delicious sides, their version of Caesar salad did not consist of romaine covered in dressing, but instead included endive and hearts of palm with just enough dressing.  Superb service, attentive but unintrusive servers, who were knowledgeable about the menu.  Stimulating art filled environment.  The not so good - we sat in what can be described as a booth, with wooden bench seats with pillows that proved to be uncomfortable as the dinner went on.  The tables was a little too high as well.  If you go, you might want to sit at a table with more conventional straight back chairs.",
   "Great food. Well worth the money. Only reason I couldn't give it 5 stars was the seating and set up of the tables. They have these weird low benches paired with tables that are far too high up. Not comfortable. Nearly every table is set up this way. Otherwise food and service were great.",
   "Great restaurant! The food was delicious and the staff was friendly. Very nice atmosphere and great selection of wines and drinks. Live music was also nice. You have to visit this place.",
   "We had a wonderful evening with a fantastic culinary experience. This is fine cuisine on a top-level."
  ]
 },
 {
  "name": "Tonkatsu Ginza Bairin",
  "address": "255 Beach Walk, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ddf96736-9330-11ea-a047-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14091297633285791714",
  "source": "GoogleMaps",
  "reviews": [
   "Wow, this place is amazing! Great food and great service. The rice and side dishes are refillable as well!",
   "Usually I had this dish with beef, but the pork was also tasty. The sauces were a bit different than those used in Japan but again, still tasty. Their soup was amazing",
   "Satisfy your cravings with some perfectly fried pork or shrimp.  Not a drop of grease and perfectly crispy on the outside.  For a reasonable price you get the main course which also comes with sticky rice, soup and a salad.  Super deal in Waikiki.  Staff are very friendly even if you ask for a spoon for your soup and a fork.",
   "First place we stopped to eat on our first trip to Hawaii! By far the best restaurant we’ve visited on our trip. A little expensive but worth it for the great food! Very nice customer service as well. Cute atmosphere.",
   "Absolutely wonderful meal. Our server was super helpful, and incredibly polite. Took his suggestion on a couple of our food choices, and I'm really glad we did. The crab cream cheese puffs were fried to perfection, and the pork katsu don was the best I'd ever had.\nOverall great experience with amazing food and service."
  ]
 },
 {
  "name": "Vino Italian Tapas & Wine Bar",
  "address": "500 Ala Moana Blvd #6f, Honolulu, HI 96813, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/de495b1c-9330-11ea-b634-14b31f159f22.png",
  "tags": [
   "family",
   "comforting",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4968582039335140227",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome dining experience. Had dinner with my family their tonight and everything was fabulous.  From the marrow appetizers to our entrees, all was phenomenal. Chuck and his team always make your time their enjoyable and memorable. This is a \"must\" experience whether you are a local or just visiting. Guaranteed you'll have a great time.",
   "What a great atmosphere and even better service! The food is exceptional yet very comforting. All the patrons look like they thoroughly enjoyed the whole experience...as we did!",
   "Excellent food and service.  Experiencing different regional wines from europe is on another level of its own.  The staff is very attentive and easy to speak to.  They really make you feel comfortable and go out of their way to explain everything and make sure you are okay with everything.",
   "Everything is fabulous here. I highly recommend to try the warm Apple tart paired with their Moscato. The bone marrow was amazing! Especially with the Osso Buco underneath. I also like the gnocchi because you can tell it's homemade",
   "Not a wine drinker but the food was amazing here. Definitely will return.  Service was good. Atmosphere was good."
  ]
 },
 {
  "name": "Hoku's",
  "address": "5000 Kahala Ave, Honolulu, HI 96816, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/de8ca60c-9330-11ea-9cdc-14b31f159f22.png",
  "tags": [
   "delicious",
   "tasting",
   "food",
   "delicious",
   "food",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12619089552581641629",
  "source": "GoogleMaps",
  "reviews": [
   "Hoku's at The Kahala Hotel & Resort is one of my favorite restaurants in Honolulu. The \"Global Hawaiian Cuisine\" is one of the best on Oahu and a fantastic dining experience. Chef Eric Oto combines tradition and innovation in a perfect manner. The atmosphere and view are fantastic.",
   "We ate here on Valentine’s Day 2019!. Food was delicious. We all got the tasting menu with the wine paring. Super pricey but the food was worth it. The staff were all very nice and the bathrooms were clean.",
   "Love the food, tried the fried prawns & fish, it was super delicious.\n\nThe Garlic rice was finger looking good.\n\nIn starter they provide \"Rice Crackers\" which is toooooo yummy. I asked them to refill it😂 as I finished the first batch too quick.\n\nAlso tried the dessert (forgot the name). It was good too.\n\nThe staff is very good. Ambience and cleanliness is 10/10. Highly recommended.",
   "What an incredible experience! My husband and I celebrated our honeymoon at the Kahala Resort and made reservations at Hoku's. I couldn't recommend them more! From the moment we stepped through the doors, staff treated us with respect and warmth. Our server, Chris, was incredibly attentive and positive and the food was the stuff of dreams. Hands down, the best dining experience of my life. Thank you so much to Chris and everyone else at Hoku's for making our meal such an unforgettable adventure.\n\nP.S. - the lamb is to die for.",
   "Wonderful, elegant food that was perfectly cooked with wonderful and unique flavors. The service was wonderful, the view was amazing, and I highly recommend checking out this restaurant within the amazing Kahala Hotel. I personally recommend the ahi sashimi and the duck."
  ]
 },
 {
  "name": "Char Hung Sut Restaurant",
  "address": "64 N Pauahi St, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ded80714-9330-11ea-8030-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "eat",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=1157489417602976379",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome Freshness Made to order every morning!\nDim Sum items & Noodles are both just right & Yummy!!",
   "I went for the Manapua and I was not disappointed. 40 years ago it cost $0.25 for one from the food truck that frequented our school. Today it cost $1.90: a bargain compared to the real estate cost increases in Hawaii over the past 40 years.\n\nTheir hours are limited and Char Hung Sut is not a restaurant.  They have a very limited number of options, but they do have soda in a cooler if you need something to drink. Your food is placed in a cardboard box and tied shut - everything is carry out.  \n\nTheir operation is very basic, fun to watch, and efficient. They take your order, get your food, take your money and you are expected to move on so someone else can get their food.\n\nParking is street parking, and because you’re in Chinatown you might want to take the time to explore a bit while you’re there.\n\nThe manapua is great, and I expect the rest of what they do is very good as well. I hope I have the time, and appetite given all the other great food options in the area.",
   "Small shop that makes everything right in front of you! Though there are only a handful of things in the menu, you should just get the pork buns. Extremely fluffy, sweet & savory - exactly how a pork bun should taste. Pork hash was good (texture similar to sticky rice dumplings) but didn't care for the half moon & pepitao.\n\nOverall, the portions of the fillings were a bit smaller than expected. Especially in the pork bun, there was much more bread than filling.",
   "Although there is no space to eat in, you are sure to get good manapua here! They open at 5:30am. Go early if you would like to get some. Don't forget to try black sugar manapua as well.",
   "Delicious manapuas and dim sum"
  ]
 },
 {
  "name": "Town",
  "address": "3435 Waialae Ave Conference Room, Honolulu, HI 96816, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/df1f227a-9330-11ea-b2bd-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15452099822321855823",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I had a good meal here. Very nice friendly service. Food was tasty and fresh. A relaxed atmosphere with a skateboarding/surfer vibe. A little pricey but it's nice to know you are eating farm to table.\n\nPasta was delicious.\n\nI liked that they reused old menus for coasters.",
   "Definitely one of the best restaurants in Honolulu. Amazing food and so much is locally sourced.",
   "Great food every time. Always something interesting and delicious. Beer selection is small but of high quality. Everything is locally sourced with a fresh menu each night. For me, it's a must-visit every time I come to Honolulu.",
   "Ate a la carte and all dishes were delicious. I would give them five stars for the food if they heated the plates (and bought a salamander for the pick-up counter). Two of our dishes were lukewarm at best. The neighbouring table had the same issue, so this may be systemic. And the toilets are atrocious.",
   "Town is a fantastic neighborhood restaurant trying to punch above its weight as a Honolulu ‘destination’ establishment. By that measure, they’ve got a ways to go ... But first, the food - fresh, local and well-presented - everything was good but not “I can’t wait to have that again” spectacular or unique. Decor-wise, it is a relatively small and busy space that can get loud. So don’t expect intimate conversation or to find a romantic nook. Finally, on the night we dined the service was friendly but oddly timed and noticeably slow at times to the point our server thanked us for our patience. My guess is that a new kitchen staff was being trained. Regardless, I’d expected better given the restaurant’s street cred and price point. Bottom line: a good but not exceptional meal priced in a competitive market that offers plenty of alternatives worthy of consideration."
  ]
 },
 {
  "name": "O'Kims",
  "address": "1028 Nuuanu Ave, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/df688792-9330-11ea-b574-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18174137468935668993",
  "source": "GoogleMaps",
  "reviews": [
   "If you want to know about the fresh great Korean food, this is the place. I love their food. Great price, clean, fast nice service. \n\nI had my friend baby birthday party with 10 people in the back yard. She put us own tables and private time. \n\nbig size foods and OYOB. \n\nIt was only cost $ 200 for whole things. and She was keep giving us something new, hot, delicious food. \n\nTry it. you will like it.",
   "The fresh dishes are mouthwatering and the execution is fantastic! 🤤 You won't be disappointed. I go weekly now.",
   "This place is wonderful. Food is consistently good and fresh. Portions are very generous. The ambiance was cool, big food portions. Price was right. Can't wait to go back.",
   "Best pork belly I've ever had the pleasure of tasting! Everything tasted so fresh and delicious.",
   "Good food and cozy vibe. Purple rice was really tasty - included in all dishes. Pork belly was tender, came with a side of salad which was refreshing. Would recommend"
  ]
 },
 {
  "name": "Maguro Brothers",
  "address": "1039 Kekaulike St #112/113, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dfaa99c2-9330-11ea-9e96-14b31f159f22.png",
  "tags": [
   "delicious",
   "affordable",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=17203932000256093635",
  "source": "GoogleMaps",
  "reviews": [
   "This is my second time here. My first time was 4 years ago. They have more choices now. The quality is top notch!!!!\nMust try the Miso Hamachi Grilled!!!! So ONO!!!\nEVERYTHING in this small corner store is delicious and fresh! Also very affordable not marked up at all.\nThey have very few sittings. \nI will come back again when I get a chance.",
   "Fabulous fish. Fresh and seasoned beautifully. Can never go wrong with Maguro Brothers. It's not the greatest atmosphere, the shop is tucked inside an Asian grocery in Kekaulike market. But the food is worth it. There are small tables with some seating but not for large groups. Staff work this location and the one o Nahua street.  Poke is served a bit more Japanese style so less saucy, allowing you to really taste the freshness of the fish. A must in Honolulu.",
   "Fresh seafood.  Very tasty and authentic Japanese style food.  Odd location in the middle of a Chinatown market place.  Worth finding.",
   "This is the best poke place in Chinatown, hands down. Nice people, open 10-3, fantastic and with some superior grilled items.",
   "FRESH FISH! So delicious fresh fish. The Spicy Ahi and Hamachi was so incredibly fresh and melted in my mouth. The sauce used is also very tasty. The prices are perfectly moderate. I'd say you're getting more quality than what you pay but that's subjective. $10-$15, depending on what you get. SO GOOD!"
  ]
 },
 {
  "name": "Basalt",
  "address": "2255 Kūhiō Ave., Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dff3d824-9330-11ea-99c6-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "cheap",
   "food",
   "kids",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10009189650499815092",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped by for brunch with family. They have outdoor and indoor seating areas. This place is super cute. Upon entry, everyone was so friendly. It's like a market/ restaurant combo. If you're just visiting,  I'm sure you'd find gifts for whomever. Now the for the food. The food was visually pleasing,  fresh, and delicious. The fruit was perfectly sweet and crisp in all the right places. My sister got the Fresh Salmon Bagel but I was too slow on taking the photo. I cant say enough about the potatoes that I stole from the plates of others in my party. 😁 Definitely a spot I'll return to.",
   "Was recommended by Guy from Hawaii News and his Cheap Eats segment. Highly recommend to visit during happy hour. Cheap eats it is! We got the charcoal bun pork belly and their vegetarian pizza. Both had fresh ingredients and always excited for the next bite.",
   "Fine dining in a market setting. Great bartenders, I sat at the bar and they were responsive and professional. My meal highlights were the fresh salad with watermelon radish and the main course, hawaiian shrimp with charcoal linguine. I was a little perplexed by the use of so much charcoal in the food, like the rolls which are black, my linguine, and then apparently they serve charcoal pancakes as well. I haven't seen much in the way of research regarding the health benefits, so I think it goes with the geologic-Hawaii theme alluded to in the name, Basalt.",
   "Had breakfast here as they were one of the few places opened at 7am and we were jet lagged. Service was great, enjoyed the outdoor seating. Food was okay. Ordered the loco moco and while tasty, I was told not authentic. Also had the charcoal pancakes as advertised by everyone. The kids and hubby gobbled it right up and didn’t even leave me a bite so I’ll take that as a good sign.",
   "First time eating their food. And it was take out.\n\nThe curbside pick up was Perfect timing, 15% off and our Wagyu patty fried rice Loco Moco  and prime rib melt were excellent.\n\nWe will do the take out again! We hope to keep Hawaii cooking and to see the local business survive during this difficult time. \n\nCharcoal pancakes are to be tried out for sure!"
  ]
 },
 {
  "name": "Duc's Bistro",
  "address": "1188 Maunakea St, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e040ad2c-9330-11ea-977f-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9743058460235678204",
  "source": "GoogleMaps",
  "reviews": [
   "What can I say but perfect!!!  French food is my favorite and this place takes the Cake with the finest food ever .. each dish and course I had was like a orgasm to my tease buds .. if your a foodies person like me?? This is a must eat please Thank you guys yummy",
   "Duck's Bistro is a quaint little restaurant in China town that serves the most delicious dishes.   The service is awesome and they make you feel at home.   Everything was amazing as you can see we couldn't wait to try the escargots.  I would highly recommend this place.",
   "Please do not pass through Honolulu without having dinner at this restaurant! We ate family style so we could all sample broadly. There was not a single disappointment! The rack of lamb melted in my mouth! The pan fried Basso fish was delicate and flavorful. The fire roasted eggplant was exotically seasoned. The iced coffee, cheese cake, and tapioca were fabulous! This place is a must!",
   "Food was great service excellent. A little warm.",
   "This is a stellar find - one of those \"best kept secret\" places. Just a small,  wonderful French Vietnamese restaurant with subtle, flavorful dishes that can surprise you in the best way. Every dish was something special. Leave room for the amazing desserts."
  ]
 },
 {
  "name": "Rangoon Burmese kitchen",
  "address": "1131 Nuuanu Ave, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e0827124-9330-11ea-816d-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "knowledgeable",
   "delicious",
   "free",
   "delicious",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12742402834201942360",
  "source": "GoogleMaps",
  "reviews": [
   "This is a very unique Restaurant.  The food IS REALLY GOOD.  The taste is like a blend of different Asian cuisines. Hard to put into words,  put your tastebuds & stomach will love it.",
   "We've been here a couple of times, very good. We had the Rangoon Tea Leaf Salad, Mashed Potato Salad and the Garlic Noodle with tofu. The atmosphere is very chill and the staff is kind and knowledgeable. We will definitely be going back again.... and again. See you there! Aloha",
   "Delicious Tea Leaf Salad, best on the island. The chicken and pork curries have a fish sauce flavor that makes it unlike any other curry, in a good way. The Samusas are great too. Parking is not bad in the evening. You can find free street parking easily in downtown, or use one of the many paid lots.",
   "I got the Burmese curry with lamb. It was so flavorful and delicious! It was also a ton of food - I hadn't eaten until I went here for lunch, and I still couldn't finish all the food. I got a side of rice, and also some of these flaky bread things to eat with the curry - I would recommend one or the other. (Note that both are an extra charge - the curry doesn't come with rice.)",
   "The food is quite delicious. The flavors are layered and subtle. The Tea Leaf Salad offers rich textures. The Brussel Sprouts with Dried Fish appetizer was probably my favorite choice that day, although the Burmese Fish Curry was also a standout. What most impressed our party was the fact that we arrived 20 minutes before the 2:00 closing of lunch hours, yet the service was excellent and we were not rushed by the staff. Atmosphere is vogue and comfortable, welcoming to professionals on lunch break, families, locals and visitors alike."
  ]
 },
 {
  "name": "Tango Contemporary Cafe",
  "address": "1288 Ala Moana Blvd #120, Honolulu, HI 96814, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e0c7699c-9330-11ea-b026-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12684569671380989270",
  "source": "GoogleMaps",
  "reviews": [
   "The food was decidedly mediocre.  Even if the food was half the price I wouldn't go back.  It had nothing that was alluring, or memorable.\n\nThe presentation of the food was good, but that left me with a deep sense of dissatisfaction as I was expecting more.  I'm not sure why this place gets good reviews.  There are numerous places that are better at the same price point or cheaper (which is sad).  Maybe, the chefs were having an off night.\n\nThe service was decent.\n\nEdit: I just realized that most of the reviews are for breakfast/brunch.  It's possible that the breakfast is better than the dinner menu.\n\nEdit:  Went to Fete in Chinatown next week.  Cafe Tango is trash.  The second worst restaurant I've been to on Oahu.  Do not go here if you like good food.",
   "It is very popular place for breakfast and lunch. \n(They are great for dinner too)\n\nCasual but I always feel that the food is prepared with intention to make good so everyone can enjoy eating.  Heart is in! .. so to say, in short \n\nI like the grass fed meat burger here.  Simple but fresh ingredients. \n\nFriends enjoyed their shrimp risotto and vegetarian sandwich as well.\n\nIf you are in the neighborhood I highly recommend trying this place.  It’s tucked away but just across the street from the TJ Max/south shore place.",
   "Wednesday at 2:15pm\nThey deserve the 5 stars. Service and food was more than a four star. Cool find near shopping and downtown. I will bring my guests here this month. Nice find! Very fresh ingredients.",
   "Attended an awesome fundraising event a few years back and forgot to upload the pics.  Food was awesomely original and tasty.  Their staff was incredibly professional and friendly.  Cozy place for a romantic dinner or a BFF celebration...",
   "A true gem in Honolulu. Food never disappoints here! Portions are not huge but they are filling. You cannot go wrong with whatever you choose. Their desserts are delish, so leave room for something! \n\nParking is validated or park nearby and walk over. I haven't had to wait but if you ever need to, there are tons of shops around to browse while you wait."
  ]
 },
 {
  "name": "Buca di Beppo Italian Restaurant",
  "address": "1030 Auahi St Bay 1, Honolulu, HI 96814, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e116c240-9330-11ea-a6b4-14b31f159f22.png",
  "tags": [
   "music",
   "eat",
   "food",
   "food",
   "delicious",
   "family",
   "food",
   "family",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=12909032204003251306",
  "source": "GoogleMaps",
  "reviews": [
   "We had a  enjoyable lunch and took in a movie later. The background music (60s rock 'n roll)  had a lot to be desired which also clashed with TV in the bar. Nice soft Italian music would have been much better. Server was friendly and pleasant.",
   "Good food and an interesting decor. Only issue was their pricing. Charged by the number of guests on your table. I explained to our server I wouldn't be having any of the shrimp pasta dish because of an allergy. Still charged although I carefully explained the situation. So, while it is good food be aware even if you can't eat the food for whatever reason you're going to be chargedif others on the table order the dish.",
   "Not sure if this was an anomaly but the food was not good at all. The fettuccine Alfredo was so plain and flavorless I had to add salt to it. The fried mozzarella looked like it had been refried to keep it hot. Grocery store bread is better than the complimentary bread they serve. The spinach artichoke dip was decent at best. The only good thing we had was the fried macaroni. I see why this would be a good option for parties of 4+ but for less it’s a complete waste of food and money. You could go to a fine dining establishment and be satisfied with the amount you pay for two people at Buca. (Around 75$)",
   "Large portion family style Italian food! Bar area has lunch menu for solo dining but portion is still large. Spicy chicken rigatoni was delicious with a kick!",
   "I would say the happiest and best experience and affordable each time we celebrate birthdays for my immediate and extended family from all over the world.  And best of all, the employees amazingly gathers together with candles to sing the BUCA birthday song to top off the celebration."
  ]
 },
 {
  "name": "Plumeria Beach House",
  "address": "5000 Kahala Ave, Honolulu, HI 96816, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e16c3594-9330-11ea-ae7a-14b31f159f22.png",
  "tags": [
   "cheap",
   "family",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3682001113820522943",
  "source": "GoogleMaps",
  "reviews": [
   "Mostly went for drinks, but we hit up the seafood buffet one night. Very, very good. I was humming with excitement every time I went back up to get more. The drinks at the bar are expensive, but the staff are very nice and professional. The views and decor are top notch. Keep in mind $$$$ and you will very much enjoy this place.",
   "Better than expected based on what friends and family had said! Not cheap, but you're paying for the exclusive location. I went for dinner. I liked the cheese platter and the New York steak. Get the mashed potatoes. It's four stars because the breakfast buffet is super crowded and the line for omelets is almost always a long wait.",
   "Lovely place for a wedding reception! Buffet was fabulous! Servers were attentive & full of the Aloha spirit!!!",
   "Food was delicious.. view's are awesome. Service was excellent.",
   "We sat at the Bar with Bobby and Steve waiting on us. It was the most pleasant time with the cool breeze and great conversation.  Next time we should take in the buffet.  Looks great!! They took great care of us."
  ]
 },
 {
  "name": "Tikis Grill & Bar",
  "address": "2570 Kalakaua Ave, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e1b4143e-9330-11ea-a3f3-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1405417295753333402",
  "source": "GoogleMaps",
  "reviews": [
   "Good food and ridiculously large portion sizes for a reasonable price. Can you find more complex flavors with a delicate touch? Sure! Sometimes you just want a good meal without sticker shock. Go during happy hour and get a $6 cocktail!",
   "I am a huge fan of tiki-bars. This one is excellent. Found it while staying at the hotel it is in. At first, drink prices look a tiny bit expensive. But, then you see you get really nice souvenir glasses INCLUDED. Worked our way through the drink menu AND had gifts for people back home. These are made locally (not Chinese factory items). Only had appetizers but enjoyed them. There is also a full food menu. The restaurant is very nice with a huge patio area overlooking the water (and sunset). Add the nightly live-music... we came back a lot. And the views of the sunset are incredible!",
   "Fun place with a great atmosphere!   We came off the beach and hit happy hour here, it was so good we ended up coming back for dinner later!   They’ve got some really neat glasses you can get with some of their drinks, they give you a new, boxed one to take home with you!!",
   "One of the nicest meals my wife and I have had in a while. Started with watermelon/feta salad which was such a beautiful combination of tastes. I had the Hawaiian fish which was absolutely delicious. We finished up with the macadamia nut pie which was scrumptious. Service was great, sunset view was gorgeous.\nOnly downside was the lack of main course vegetarian options.",
   "Oh my! Yum! The food and service was amazing! Our server was awesome! We notice how crowded the place was in each passing And decided to stop in. It did not disappoint. Located on the main strip of Waikiki across from the beach!"
  ]
 },
 {
  "name": "Nobu Honolulu",
  "address": "1118 Ala Moana Blvd # 100, Honolulu, HI 96814, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e207167a-9330-11ea-87a0-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "tasting",
   "food",
   "eat",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=1266635437457290210",
  "source": "GoogleMaps",
  "reviews": [
   "This was excellent and super classy. The food was unusual and delicious, especially the black cod hot appetizer. Our waiter and the wait staff was responsive and happy to explain the unusual Japanese dishes. He set us up with course after course of delicious appetizers and sushi rolls. It was expensive but well worth it. The whole experience was terrific and we left super satisfied, I tipped 40% I was so pleased with everything. I've done that once before (see my review on House Without a Key) and I hope to return to Hawaii someday just to eat in these two places.",
   "What an amazing experience! The food was incredible and what was even more incredible was our waiter Marcus. He took the time to explain every dish and the flavours of each one. He put together a great tasting menu for us which we enjoyed immensely. Thank you so much for a great evening and experience. We will be back again for sure and highly recommend this place.",
   "They need more options for vegetarians (who also don't eat seafood) besides tofu. I only had the shishito peppers & dessert, which was very good. My boyfriend got a steak dinner which looked really good!",
   "Really enjoyed an amazing dinner here. Each dish was more delicious than the last. The cocktails were excellent and dessert was the tasty cherry on top of it all!",
   "We have been visiting Nubu for years now, and it is definitely the most consistent restaurant in Honolulu. Their Sake Old Fashioned are a must, and feature a clear, hand carved ice cube. Ridiculous!"
  ]
 },
 {
  "name": "Taormina Sicilian Cuisine",
  "address": "227 Lewers St, Honolulu, HI 96815, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e253fe76-9330-11ea-8cdc-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "food",
   "delicious",
   "tour",
   "eat",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12023260373302536552",
  "source": "GoogleMaps",
  "reviews": [
   "Get the lasagna! The Spaghetti Vongole was also really delicious. Our server was very knowledgeable and helped us pick delicious dishes that met our individual taste preferences. Wonderful dining experience. The entire staff was attentive and friendly. Great service. Great food. All you need to bring is great company.",
   "My husband and I had dinner here during one of our nights in Oahu. I had the truffle carbonara and we shared the tour of Italy. Both were delicious and the service was great!",
   "Best vegan pasta I’ve had in a while. Superb service. Thanks Jacko for your detailed attention",
   "Food was amazing!! Their customer service was great. My brother's meal wasn't ready at the same time as ours so they gave him a little mini meal to eat while waiting. Highly recommend to get the carbonara",
   "Very polite. Came in with a party of 5 last minute. Didnt expect to be helped right away, servers, host, and manager were awesome. Thank you so much for making our family dinner so wonderful. Food was excellent, service amazing, couldn't be happier."
  ]
 },
 {
  "name": "Teishoku Restaurant",
  "address": "1620 N School St C, Honolulu, HI 96817, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e2a3092e-9330-11ea-8013-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "eat",
   "food",
   "eat",
   "food",
   "delicious",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=872734460851596938",
  "source": "GoogleMaps",
  "reviews": [
   "Craig K.\n\nThe food is delicious. The staff are friendly. We always order the two choices. During dinner we try a little bit of each other's food. Huge portions. I will be going back.",
   "Amazing food and super friendly customer service. I love the green tea they keep giving you. I ordered the tempura shrimp and oysters that come with miso soup and rice. Delicious! I was not expecting this restaurant to be so good because the location is not great.",
   "I call this place my Little secret hole in the wall?? Great food great prices yummy yummy yummy Asian cuisine. So good can't wait to eat here again",
   "We stoppes by here twice while we were on our honeymoon. Both times the food was absolutely amazing. And I say this after having gone to a menagerie of restaurants here and in many places around the US that specialize in similar cuisines. The prices are great too. When we come back we will definitely come here to eat again.",
   "Debbie K.\n\nTeshoku Resturant is beautiful inside. Nice paintings displayed on the wall. Clean dining area. Cool and comfortable. Customers can enjoy nice relaxing lunch or dinner. Friendly staff. Jason is friendly and kind. The food is delicious. Huge portions too. Fast service. Plenty of parking. I will definitely be going back. I highly recommend Teishoku Restaurant. Give Teishoku Restaurant a try your tummy will be happy you did. 😊\n\nI went back this morning Valentine's Day. My order was for two two choices. I waited extra long time. Another lady was waiting too. The lady brings out an order and just leaves it and walks away. The lady tells me she no tell who's order that leave the order walk away. She went behind the counter looked and said that's my order took it and walked out upset. Me still waiting asked how long more for my order. She tells me they had a lot of take out orders. What upset me is everyone dining in was getting their order fast while I wait. Finally my order ready after an extra long wait. \n\nI don't think I will be going back. I have better things to do than wasting my time waiting."
  ]
 },
 {
  "name": "Do-ne",
  "address": "1614 Kalakaua Ave, Honolulu, HI 96826, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e2f45d4a-9330-11ea-9f8e-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16547905685137376675",
  "source": "GoogleMaps",
  "reviews": [
   "This place is really small with about 8 tables but the food is good! There is parking behind and the waiting is short. Try the seafood set. I loved it!",
   "Great homemade food with quality presentation and nice service, space are limited so be prepare for a bit of wait",
   "So fantastic. Tiny little restaurant.. about 6 tables, but the food is wonderful and very authentic Japanese. It's BYOB so come prepared.",
   "Traditional japanese sets and ala Carte. Very good. Not huge portions but not small and pretentious. Very happy with this place. Maybe seats 24-30 at tops. Reccomend reserving or going after 8. Great food. Really for the price I couldn't have been happier.",
   "An amazing little gem of a hole-in-the-wall type place. Authentic Japanese teshoku; the staff here were so friendly and the food was amazing. Made with tender love and care and offered at an excellent value point. Would visit here everyday if I could have =)! Highly recommend if you're in the area. There are only a few tables inside and a couple chairs to wait at outside. Their opening hours are limited, but definitely worth it. Staff are Japanese and so humble and genuine."
  ]
 }
]