[
 {
  "name": "The Children's Museum of Indianapolis",
  "address": "3000 N Meridian St, Indianapolis, IN 46208, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e3425670-9330-11ea-836a-14b31f159f22.png",
  "tags": [
   "affordable",
   "kids",
   "free",
   "food",
   "kids",
   "family",
   "kids",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13353259518511313258",
  "source": "GoogleMaps",
  "reviews": [
   "We love the Children’s Museum! And I love that it’s always changing to keep our membership worth having.  The outdoor sports section was an amazing add on!  I do wish it was more affordable though.  When we have friends come into town we aren’t always able to go.",
   "We have fun each time we go. Kids love the dinosaur exhibit and pop culture exhibit.  The outdoor sport area looks cool but it closes in the winter so we didn't see it this time.  There is an indoor sports exhibit too.  Good food court with a lot of options.  About 30.00 per adult.  20.00 for kids.  Ample free parking in their connected garage.  Great for all age children.  Easy to get to. Very clean and updated.  Certain exhibits change often.",
   "Overall it’s really nice and updated, I would say the layouts rather strange and kind of maze-like. This is definitely a place for learning and fun, age group is about 5-10 I would say however, any age could enjoy what’s at the children’s museum. They offer a large amount of discounts for example: students or seniors. What I enjoyed most about this recent trip is the new addition of the Greece section. That area is an additional price however it’s offered for a limited time. There is more to come in 2020!",
   "We love the museum. The staff are friendly and helpful. They really seem to have a passion for children. The facilities are clean and there is everything you need to have a successful trip. The Playscape is great for toddlers and even has a small confined area for crawling babies. Some of the exhibits are a little over my kids heads, but the map they pass out has age recommendations too. We love the family bathrooms and room for nursing mother's too. Can't wait to go back!",
   "Great place even for adults! We went with no kids just to scope it out. Did not regret it! Also, they had a nice selection of food in the food court, not just concession food. They even had a salad bar. The China and Egypt exhibits were well done. Go see the planetarium show about how science fiction becomes fact, it was great and free with admission. The Greece exhibit has a lot of neat cultural facts that I didn't know. Very interesting!"
  ]
 },
 {
  "name": "Indianapolis Zoo",
  "address": "1200 W Washington St, Indianapolis, IN 46222, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e389c038-9330-11ea-b380-14b31f159f22.png",
  "tags": [
   "free",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2029097250141254763",
  "source": "GoogleMaps",
  "reviews": [
   "Was surprised by the dolphin show. Was very in-depth and to my knowledge one of the only ones at a zoo. However, the zoo itself was fairly small. A few of the exhibits were closed for renovations and we were in and out in less than 2 hours. For comparison we spent almost 4 hours and didn't see everything at the NC zoo. Surprisingly small for a large town and had to pay for parking on-site.",
   "This is a wonderful zoo. We were lucky enough to have a couple extra hours before our flight out of Indianapolis and went to the zoo, which is about 15 minutes away from the airport.  So glad we did.  It was decorated with millions of lights.  The animals were out and about.  The dolphins are magnificent.  They have WALRUSES!!! Which is super rare. I'd love to go back in the summer and see more. Also,  during the holidays,  there is a Santa and you get a time slot for free when you arrive.  We didn't get to see him because of our flight time constraints.  I'm sure it would have been lovely.  \nThis zoo is a gem.",
   "It was an awesome experience.   Beautifully decorated.   Everyone whom I encountered were exuding the Christmas spirit.  The temperature for this time of the year was awesome and the hot chocolate was great. Great appreciation for all who participated in hanging the lights and setting up the displays. Looking forward to next year.   Merry Christmas.",
   "The zoo itself is nice and spacious. Different little activities for kids and interactions for everyone. Definitely an improvement over the years. However, a few things that stood out about this visit. One, my two year old made a remark a few times about the animals seeming sad (mainly all the the primate varieties and birds). Two, I didn't notice many foraging or entertainment options for many animals. That's kinda sad as an animal owner myself. And three, the macaw cage was SEVERELY lacking in opportunities. Macaws are very intelligent and even though they are in an aviary, there seemed to be many lacking opportunities. At the time of our visit I did not see any captive foraging for ANY BIDS HOUSED. Nor toys or puzzle opportunities. The larger macaws seemed stressed and agitated by the shear number of birds coupled with lack of entertainment and we're picking at each other. Not like bonded grooming but picking at feet and wings. As a bird owner it is hard to explain the disappointment. Overall, wasn't too bad but would definitely recommend more activities for animals l.",
   "Recently went to Christmas at the Zoo. It just so happened to snow that night. The snow made it SO much better. Attractions and activities were nice as well.  Very festive. Would highly recommend on s snow day. Makes the lights shine brighter."
  ]
 },
 {
  "name": "The Escape Room Indianapolis",
  "address": "200 S Meridian St #220, Indianapolis, IN 46225, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e3d2fe28-9330-11ea-bd44-14b31f159f22.png",
  "tags": [
   "family",
   "family",
   "family",
   "art"
  ],
  "link": "https://maps.google.com/?cid=2086428670847264875",
  "source": "GoogleMaps",
  "reviews": [
   "First time escapers had a great time very hard though but fun.",
   "This escape room was very well done. The clues were difficult, and our group was challenged on the intermediate and advanced rooms (we went twice). I loved how the rooms were decorated and the themes. This was a great activity for our multi-generational family over the holidays. Everyone enjoyed it, especially when we managed to escape. I would definitely recommend this place for an hour of fun.",
   "Great way to spend an hour testing your collaboration skills with family, friends or coworkers.  We did the \"Space 2112\" room which I would rate as quite challenging.  Excellent props and staging. Better have a math whiz with you if you get this room.",
   "We do a ton of room escapes so this is just our perspective.  We did the heist few years ago and it has way too many keys and the puzzles weren't our favorite so we wrote this place off. Then we did the art heist and loved it! The puzzles were simple and straightforward but the mechanisms were neat. The game master gave us some great recommendations for future rooms to try for our group. My family has also raved about their fishers location. Looking forward to coming back and doing some of the more complex rooms!",
   "Great time. Coco our advisor did a terrific job!"
  ]
 },
 {
  "name": "Soldiers/Sailors Monument",
  "address": "1 Monument Cir, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e415ac74-9330-11ea-8653-14b31f159f22.png",
  "tags": [
   "art",
   "structure",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=5691308126908914665",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful monument, the water feature is an amazing backdrop for an awesome piece of art.  The roundabout makes it feel like international destination.  Great stop in the middle of a 10 mile run.",
   "Recently had some downtime and decided to check this place out. Didn't actually realize how high this place was until I reached the top. Elevator was busted which is not an issue for me, but I think you'd get more out of it by climbing the stairs anyway. Nice staff at the gift shop and overall a pleasent experience if you've never been there. The attention to detail on the structure itself is worth having a look. Go there when you have some time to enjoy the atmosphere of the city moving around you.",
   "We really enjoyed exploring downtown Indy on foot. This was one of our destinations. Unfortunately, we couldn't enter to climb to the top as it was closed because they were installing Christmas lights. But it was still very enjoyable to observe all the intricate details of this monument from the outside.",
   "Recognized as one of the world’s outstanding monuments. The largest outdoor memorial in the United States to be dedicated to the common soldier. Surrounded by restaurants and businesses and is a great place to relax and observe.",
   "The monument is enormous and beautiful to look at. We climbed to the top and really enjoyed the challenge. The views were good, but not absolutely breathtaking for me. I can’t help but compare these kinds of views to the Columbia center skyview observatory in Seattle and that’s hard to beat. Still really glad we did it, though! \n\nThe staircase gets pretty tight at the top, so it can be a bit crowded, but the elevator wasn’t running which meant everyone was walking up and down, making a bit more congested than it might have been otherwise. The last several flights have space for one person side to side, while the flights below have room for about 2."
  ]
 },
 {
  "name": "White River State Park",
  "address": "801 W Washington St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e46c17c8-9330-11ea-8b4a-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "field"
  ],
  "link": "https://maps.google.com/?cid=11216188692058629079",
  "source": "GoogleMaps",
  "reviews": [
   "No restroom, overrated. We went there from out of town in a late Sunday afternoon and the visitor center was closed so no restroom (and no map to show where the restrooms are). We had to walk to the other end of the canal walk for the restroom. Parking is expensive for a public park.",
   "I haven't been here in several years but enjoyed the time I spent here. The park is beautiful and the canal walk was unexpectedly quiet and peaceful, especially for being in downtown Indianapolis. Its conveniently close to the zoo also. Parking can be an issue so give extra time to find a spot or pay to park which can be a bit pricey.",
   "I always have lots of fun bringing my puppy out for walks here!! It’s very nice and clean and there’s a lot to see",
   "It's beautiful and fun at at any time of year. I love going. It's very accessible to everyone but it can be hard to find parking when there are multiple events going on downtown.",
   "Great place to send an afternoon. Lots to do and see. The museums are nearby and you are only a short distance from Victory Field."
  ]
 },
 {
  "name": "The HandleBar",
  "address": "501 Madison Ave, Indianapolis, IN 46225, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e4b7c712-9330-11ea-bf46-14b31f159f22.png",
  "tags": [
   "tour"
  ],
  "link": "https://maps.google.com/?cid=12494853548950200239",
  "source": "GoogleMaps",
  "reviews": [
   "Great experience for a bachelor's party! They just got bikes that have motor assistance so if you're nervous that it might be too hard they have you covered! You stop at various iconic spots throughout Indianapolis and gain a different perspective of the city.",
   "Had a great time on the HandleBar last weekend!  Kyle was an awesome driver and host, pointing out great places to visit on our stops.  Kyle kept the energy high and the tunes rolling!  Highly recommend HandleBar Indy!",
   "We had soooo much fun on our Handle Bar experience. Lucas, our driver, was fun and engaged. He definitely kept the party going! I would recommend to anyone looking to have some fun with friends and meet some new friends as well. We will be back!",
   "Had a great experience.  First time taking tour . Was a blast . And our driver Chris was great! will suggest to friends. And will definitely be back.",
   "We had a wonderful time doing the HandleBar! It was super rainy and dreary, but they were still game! They even gave us ponchos!! I owe a big thanks to our BarHandler Lucas- great guy.  He made the experience so wonderful! He was fun, patient, and easy going. He pretty much doubled as a photographer as well. Awesome guy!! We had such an awesome time we are already talking about going back to do another one. It was a surprise for my boyfriend and they made it super easy for me to have someone drop off our cooler earlier in the day to make the whole “surprise” seamless. The whole process from purchasing the Handlebar on line, obtaining FAQs, and signing the waiver was super smooth and easy. We were very happy! Thanks guys!"
  ]
 },
 {
  "name": "Indiana State Museum",
  "address": "650 W Washington St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e4fbd512-9330-11ea-94db-14b31f159f22.png",
  "tags": [
   "music",
   "kids",
   "free",
   "learn",
   "kids",
   "history",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7748474600253887888",
  "source": "GoogleMaps",
  "reviews": [
   "If you plan on taking more than one person, buying the membership is worth it! Got to review the opioid exhibit. That was truly amazing, they’ve made the exhibit very nice. Also knowing that it can be emotional for people they’ve made it very big in there. There is lots of room to sit down and lots of different ways to cope. There is music, writing etc. great ideas! You can tell this idea was thought through.",
   "The cafe here at the Museum was a wonderful surprise.  We had a delightful lunch.  Definitely will plan to go hungry on my future visits here.  We did soup and grilled cheese combos (This and That they called it).  My tomato basil soup was awesome, but my daughter’s Chicken Velvet was the best chicken soup I’ve ever tasted.  The grilled cheese had turkey and roasted red pepper on sourdough.  Wonderful lunch.",
   "Great place for children and adults. We have been several times and it never disappoints. Always friendly and helpful staff, very clean and all the displays are in great shape and well kept. Not wore out like other museums. I highly recommend going and taking the kids. If you do the Imax movie, you get free parking in the garage! So totally worth it!",
   "This is a great place to learn about Indiana's history. It caters to kids with hands on exhibits. Great for school groups and events. It's right on the canal which offers lots of activities. They offer fantastic traveling exhibits and have an IMax theater with new releases available. Great place to go.",
   "Very interesting permanent exhibits with regular special exhibits. Parking is easy and rarely very crowded. It's nice to be able to walk out into the canal in nice weather. Museum restaurant it's pricey but the food is very good."
  ]
 },
 {
  "name": "Eagle Creek Park",
  "address": "7840 W 56th St, Indianapolis, IN 46254, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e54a1c42-9330-11ea-9d13-14b31f159f22.png",
  "tags": [
   "nature",
   "family",
   "nature",
   "active",
   "nature",
   "walking",
   "kids",
   "hike",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7714979412648975633",
  "source": "GoogleMaps",
  "reviews": [
   "I love this park!  In all of Indianapolis area you'll not find a better park to enjoy the day with your people at.  Great fishing, Rick's boatyard for dinner after hiking the nicely trimmed trails.  Nature center, Swimming beach in summertime.  If you enjoy knocking around the little white ball, Visit Eagle Creek golf club. 2 Sycamore for the better players and The Pines for you hackers. So plan on a full day and go Rock the Park. This Tony Sullivan See ya next time. Be safe! Always.",
   "This state park turned City park is awesome, packed with animal life, especially birds of many kinds. I haven't found a park around Indianapolis with as wide of a variety of bird species. Trails are long and have some very pretty and calming views. Park pass cost is fairly expensive especially since it only covers that park, but if you live or work near the location, you can easily get your moneys worth in the amount of time you can spend there. There are several extras here such as boats, zip lines, and nature centers to give the place an extra bit of fun for the whole family.",
   "I spent a fall holiday in this amazing preserve. Each day a new point of view. Fall colors, water Birds and tree life were perfect nature reflection. Great photography too. Miles of.accessible trails and beautiful interpretive Museum. I enjoyed miles of hiking walking and jogging trails. In addition the Peace Learning Center located on the facility was a treasure and is doing great work for community programs around the nation. Nature, Community, active lifestyle, and preservation/ conservation is a win.",
   "We love this place! We go as often as possible with our two kids. We primarily hike, but also enjoy the ornithology center and Earth Discovery center. We’ve had birthday parties there (always popular) and many days of homeschool at picnic tables. As our kids get older we look forward to more adventures there!",
   "great trails with a diverse scenery including a vast lake and dense forest areas. fishing spots, benches, and a playground. it was even a rather gloomy and rainy day and I still had a great time! will visit again to walk every trail ❤️"
  ]
 },
 {
  "name": "Indianapolis Motor Speedway",
  "address": "4790 W 16th St, Indianapolis, IN 46222, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e59ca734-9330-11ea-a2f1-14b31f159f22.png",
  "tags": [
   "learn",
   "tour",
   "history",
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=1483409794189434512",
  "source": "GoogleMaps",
  "reviews": [
   "Visiting from out of town with very little exposure to racing in general, I really enjoyed our visit. I loved the tour of the track, hearing about the traditions of the Indy 500, and exploring the museum with all of the history it contains.\n\nIf you enjoy auto racing, or are interested in learning about something new, this would be a fun activity. \n\nWe were there for two hours (including the track tour) and it felt like a good amount of time for someone who knows so little about racing. If you have more knowledge going in, you could easily spend way more time in the museum. There’s so much to read and learn. \n\n4 stars because for me, it was fun, but not an absolute must.",
   "Truly a dream come true!! I have been a life long Indy fan. I showed up Saturday morning right as the museum opened. I did the kiss the bricks tour which included admission into the museum. A lap around the track was memorable. Highly recommend this experience to any racecar fan",
   "A great facility that I was lucky enough to tour this Fall. The most fascinating thing is the \"City\" within the infield - all the activity, buildings, etc., is amazing. We were able to tour the pit lane, luxury boxes, and victory lane - all of which was amazing. It was also great to see the winner of the BC39 midget race displayed next to the Indy 500 and Brickyard 400 winners - that was really special to a dirt track racing fan.",
   "The best time to see the lights on the track was New Year's Eve! Hardly any traffic and drove through without a hassle. The lights were great, but my wife loved being able to drive on the actual track. Granted, it was about 4 mph, but we were there. On the track. Down the straightaway!",
   "Definitely the oldest racetrack you've ever been to. Definitely cool. It's worth it I think to pay for the parking passes to get a good parking spot near the track. Just buy them ahead of time before they jack the prices up!"
  ]
 },
 {
  "name": "Indianapolis Motor Speedway Museum",
  "address": "4750 W 16th St, Indianapolis, IN 46222, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e5e18a0a-9330-11ea-a981-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "walk",
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=4961992855932611328",
  "source": "GoogleMaps",
  "reviews": [
   "Participated in the Kiss the Bricks Tour and it was awesome. The tour is only 30 minutes long but you get to ride the racetrack and hear about the history of it. The museum is beautiful and very informative. Definitely a place you want to take time and check out as a tourist if you ever came to visit the beautiful city.",
   "Throughout the summer and fall, in the parking lot next to the museum, they also have Cars and Coffee! So, you can walk around with a cup of coffee while browsing the cars and talking to their owners. Then, you can head into the museum! It’s great!",
   "Love this place. The staff has always been friendly with my girls. The knowledge and love of the track and it’s history is shown through every interaction. This is a must for any race fan.",
   "A good source of history and old cars that used to race in Indianapolis. Recommend paying the extra money to ride the bus around the track. I wasn't able to see the track in its entirety from the museum though, hence the recommendation to ride the bus.",
   "There is a vibe in the place!\n100+ years of history, loved my visit last year in October.\nThe workmanship in the older cars is amazing.\nA highlight of our trip in the US."
  ]
 },
 {
  "name": "Eiteljorg Museum",
  "address": "500 W Washington St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e6271ee2-9330-11ea-889d-14b31f159f22.png",
  "tags": [
   "art",
   "affordable",
   "kids",
   "art",
   "history",
   "art",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=11100458494543654568",
  "source": "GoogleMaps",
  "reviews": [
   "Jingle Rails is the reason we came but we had a wonderful experience exploring the rest of the museum. They had puzzles and other fun things for the little ones, well and us grown people too.  Definitely a Great way to spend a few hours. We got a year pass so we could enjoy other exhibits throughout the year. Jingle Rails was Amazing.",
   "Amazing exhibit of Native American and wild west paintings and sculptures.  Gift shop has really nice items for sale in all price ranges. Cafe is a good place to take a break. Would definitely go again if I return to Indianapolis!",
   "Eiteljorg is a must see when in Indy. The collection is diverse with an emphasis on Western art, but also interpretive areas with artifacts and artwork of North American Indian cultures and regions. They have excellent contemporary exhibits and a children's exploration area. When possible, parking is validated in their garage. We also had a meal at the cafe. The butternut squash and beet salad was tasty and prices affordable. Loved the southwest influenced interior design.",
   "Was really cool! Went specifically for the Jingle Rails exhibit and love it, worth $15 alone. We also saw the rest of the museum too, less interactive than I thought it be. It's mostly art museum though there are two exhibits on the second floor that are interactive one of them goes through the history and culture of different Native American communities the other is for art that you are allowed to touch(my favorite exhibit). \nOverall it's good for gathering information but I wouldn't suggest you bring your kids, but they might get bored.",
   "One of the best museums in the US for American Indian and West American art. Quite an extensive collection of art on display and they have different special exhibits throughout the year. Jingle Rails during the Christmas season is a favorite. Each year they seem to add something new to the display. This year it was the Indianapolis Motor Speedway. Amazing how it is all made of nature materials. Highly recommend."
  ]
 },
 {
  "name": "Indiana World War Memorial",
  "address": "55 E Michigan St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e66b5412-9330-11ea-85cf-14b31f159f22.png",
  "tags": [
   "walk",
   "learn",
   "free",
   "history",
   "free",
   "history",
   "history",
   "history",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=11844217630128997680",
  "source": "GoogleMaps",
  "reviews": [
   "We absolutely loved our visit to the Indiana world war memorial. \nSo much in fact that we will be bringing our 7 children back to see all the wonders the Museum has to offer. \nTruly is an amazing place to walk through and look at all the history of the men and women from Indiana who have been a part of all the wars. \nReally loved all the info on the USS Indianapolis. It was really cool to see some of the people who went through the days and nights after the sinking. \nAnd it's all free. So go and check it out, learn about Indiana's history in war.  It's worth it. \nThe place was very clean and well done and the staff is very friendly. \nWe will absolutely be back.",
   "Such a gem in downtown Indy. We just walked by, and were like \"this is an impressive building\". Free entry, friendly staff, in mid week there was almost no one there. \n\nHave to start by going to the upstairs memorial - breathtaking\n\nThen go through time in the exhibits, all are authentic and very informative. You can spend hours or just a quick visit, depending how avid you are on history",
   "Excellent museum in a stunning and conveniently located building downtown. The museum itself is very well laid out, with amazing and informative displays covering every conflict from pre-revolutionary times to the present day, with an emphasis on Indiana's involvement and many significant contributions. Definitely an informative, entertaining, and humbling experience. If you have any interest in history, this is a DO NOT MISS experience.",
   "A really fantastic collection of war memorabilia and artifacts...a truly breathtaking shrine and wonderfully peaceful interiors. A MUST SEE when visiting Indy.  The building outside is truly gorgeous... the interiors are equally so. \nA hidden gem for those interested in history and warfare.",
   "A unique treasure hidden in plain sight. This downtown landmark is chock full of historically important and rare exhibits and artifacts. The auditorium is a one of a kind look into a bygone era. Crafted in ways with materials that just aren't available today. Well worth a visit!"
  ]
 },
 {
  "name": "Holliday Park",
  "address": "6363 Spring Mill Rd, Indianapolis, IN 46260, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e6b0c2dc-9330-11ea-9e60-14b31f159f22.png",
  "tags": [
   "family",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2840498003600430211",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful spacious park\n Great trails in a wooded area along with acres of lush lawn . Cool playground. Something for everyone,  including 4 legged furry family members.  It's spread out so every area has it's own purpose,  not jammed into a small amount of land",
   "Clean well landscaped park. Plenty of trails in the woods. I had no idea this park was here till we stumbled upon it",
   "Great location. Fun park for all. Good play areas. Nice parking. Great walk, jog, bike, and dog walk park!",
   "Took my two pit bull puppies and the family here a couple of time this summer. Loved the trail and the paths. Nice place to go if you don't want to be bothered with loose or unattended dogs or children for that matter lol.",
   "My favorite place in the city! Been visiting since childhood and it's always a pleasure. Please go! You will love it!"
  ]
 },
 {
  "name": "Twisted Room Escapes Indianapolis",
  "address": "3145 E Thompson Rd, Indianapolis, IN 46227, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e6fb3862-9330-11ea-bc5e-14b31f159f22.png",
  "tags": [
   "kids",
   "music"
  ],
  "link": "https://maps.google.com/?cid=12231744949815781336",
  "source": "GoogleMaps",
  "reviews": [
   "Came here for my husband's birthday with our kids, age 10 and 7. We had a blast! The kids didnt want to leave. We did the Alice in wonderland room. It was age appropriate but still challenging, even for us adults. This was our first escape room experience so we did have to ask for more clues than I would like to admit. The hints were subtle enough to help you but not too much to take away from the challenge. So this is a great place for beginners and frequent escape room lovers. The staff were understanding and explained everything. \nI booked our slot the same day and had no troubles navigating their website. Customer service was out of this world. I really felt welcomed and comfortable with our visit. I would recommend them to anyone looking to build confidence in your relationships to someone looking to kill time.",
   "Absolutely LOVED this! Our first time and won't be the last! We played the Alice and Wonderland themed room. \n\nOur ages ranged from 11yrs old to 40's, all being able to participate. \n\nThe reviews for this place are all amazing and a huge reason why we went to this escape room.\n\n This is totally worth the money and such a great experience. The details in the the rooms were incredible and the staff were so funny, friendly, and helpful.\n\n I could go on and on about this place!!!! Totally a must on your \"things to-do\" list!😁",
   "This place is amazing! We have done many escape rooms and this is by far our new favorite place to go! The staff is very nice, engaging, and accommodating! The rooms are great! You really feel like you are in the environment of the room! We will be coming back to do every single room they have!",
   "Twisted Room Escapes is one of the best escape rooms in Indianapolis. The staff is very friendly and helpful. The waiting lobby has a lot of fun activities to pass the time. Our group did the submarine room (we heard this is the most difficult room) and it was a perfect blind of challenge, plenty of puzzles for everyone to work on at the same time, and the attention to detail in the room was amazing. Our game moderator was awesome. She did a great job of helping us along when we needed it but also let us figure out most things on our own. We got out with just 17 seconds left! We will definitely be coming back to try all the other rooms.",
   "We did the Submarine room with 4 people and barely made it out in time! So fun and challenging. The staff was amazing & helpful, clues well designed to 'nudge' you without giving it away, and the payoff was my favorite (epic music) and made me feel like a WINNER! Go to Twisted Room if you want to have a great time and stretch your mind!"
  ]
 },
 {
  "name": "Conner Prairie",
  "address": "13400 Allisonville Rd, Fishers, IN 46038, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e73dbf9e-9330-11ea-98f5-14b31f159f22.png",
  "tags": [
   "field",
   "family",
   "walk",
   "field",
   "family",
   "kids",
   "eat",
   "learn",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=17188431193181351407",
  "source": "GoogleMaps",
  "reviews": [
   "I was wowed that the presentations were something like out of Disney World. In order for it to be so realistic feeling, the presentations combine physical props with digital ones that is high quality. You really feel like you’ve traveled back in time. My husband and I had a Great time. He went a lot as a kid, so he was showing me around while also being pleasantly surprised by new additions since he had last been years ago.",
   "Good, educational experience. I have also attended field trips there. They do a good job in the field trips but note that the picnic area isn’t the best. It is still an amazing place and I would suggest for elementary schoolers and family.",
   "Beautiful land, amazing fun to do with the family. We went on my daughters field trip in the fall and it was just gorgeous. Neat to walk through and have fun while learning at the same time. A picturesque day!",
   "Great place to take your kids all year round inside or out they get things inside to see plus in the summertime see how people used to do pioneer age before gas-electric phones are they even invented how they used to do things back then some people still do it that way today and technologies or flop people do not keep the technology they refuse to use it but this is a good place to take your kids all year roundChick-fil-A hours and so he could have a really good place in the good place to eat to",
   "I haven't been here since I was a kid, but I recently saw that they were having a free admission day. My boyfriend, kids, and I had a blast. The kids were super excited to explore and learn. We especially loved Benjamin in the makesmith workshop. He was so helpful with the boys and they loved using all the tools."
  ]
 },
 {
  "name": "Fort Harrison State Park",
  "address": "6000 N Post Rd, Indianapolis, IN 46216, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e786d7e6-9330-11ea-b8d2-14b31f159f22.png",
  "tags": [
   "nature",
   "structure",
   "nature",
   "walk",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=77431062051105701",
  "source": "GoogleMaps",
  "reviews": [
   "One of the most beautiful places in Indianapolis. The park is always a great place to bike and run. There are events going on here pretty regularly as well. If you want a place to get away from the hustle and bustle of Indy daily life and need nature in your life this is your place.",
   "Excellent play structure, reminds my girls of a castle which they love. The spray grounds in the summer time are a nice addition. Usually busy. Parking lot available. I wish there were a few more benches and shady areas. Other wise it is a nice park.",
   "A wonderful place to go for your walks and enjoy nature of all kinds. I was there in March and saw deer at the side of the road.  They have a large playground and open area for all your outdoor activities. There is a great nature center at this park. Check them out sometime soon.",
   "We visited this place in September. Very nice people here, we came for the horse riding experience. As others have pointed out: it IS just basically sitting on a horse while it walks the path. That doesn't diminish from the experience I don't think, because that's what they tell you it is. Don't expect to have freedom with their horses. It isn't your pet.\nWe had lots of fun here, and it was an extremely pleasant day. Kudos to the whole team at this place!",
   "Long trails and a large hill for sledding, limited bird population which was quite surprising for a park of that size. Very large areas throughout to enjoy, nice kids area with a slide built into a hill. Great location for taking your family or for an enjoyable walk, run, or bike."
  ]
 },
 {
  "name": "Garfield Park Conservatory",
  "address": "2505 Conservatory Dr, Indianapolis, IN 46203, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e7cba81c-9330-11ea-a8bf-14b31f159f22.png",
  "tags": [
   "family",
   "cheap",
   "art",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9708597454921351548",
  "source": "GoogleMaps",
  "reviews": [
   "As a wedding photographer, I couldn't recommend Garfield Park Conservatory enough for clients looking for a small intimate ceremony or elopement. My clients planned their wedding quickly from Florida, and the conservatory was quite helpful and responsive to them as they planned long distance in three weeks' time. Garfield Park was even willing to let us come an hour before their ceremony to capture their wedding portraits in the greenhouse, and with the perfect March day outside, we were able to capture some stunning photos outside on their property as well. \n\nThe conservatory provides that beautiful greenery feel, especially useful during the cooler months of the year in Indiana. While the space doesn't accommodate many guests, this couple's family gathered around the space and celebrated when these two became husband and wife. \n\nAgain, hands down this is a great venue for those looking for a small intimate setting for their wedding ceremony.",
   "Beautiful space to spend some time during bad weather. Many beautiful plants, flowers and trees. Couple peaceful waterfalls to sit down for a break. Looking forward to going back and checking out the sunken garden when it’s warmer.",
   "Small but compact. Plants are thriving and in bloom! Gorgeous moss covered waterfall with a lily pad koi pond. Ooo. Seems like it’s be a divine venue for a wedding.",
   "A hidden gem! Cheap admission and a wonderful variety of plants. Take a tropical respite at this beautiful Conservatory. Don't forget to also visit the art center! Definitely my favorite park in Indianapolis!",
   "What a great fun exhibit! The kids and I had a great time trying to find everything on the scavenger hunt. We saw different gnomes everytime we were looking for something."
  ]
 },
 {
  "name": "The Escape Room Fishers",
  "address": "8890 E 116th St #210, Fishers, IN 46038, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e82a1c1a-9330-11ea-adca-14b31f159f22.png",
  "tags": [
   "tour",
   "family",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=17082038567921921479",
  "source": "GoogleMaps",
  "reviews": [
   "A fun and interactive activity. The Titanic room was cool! Every staff member was friendly and welcoming. It's nice to have a parking garage and the place is easy to find. Our tour guide, Mason, was cool and helpful! I would definitely recommend this for families and groups, big or small. Great time!",
   "Tons of fun! Challenging and great for family or team building activity.",
   "We played A Night at the Castle and it was awesome. My group escaped with just a little over a minute left and the way out was a bit of a mad dash. The room has great puzzles but there is a physical aspect that can be a little rough. Our game masters were Sam and Hannah and they were awesome, big shout outs to them for the clues and entertainment before starting.",
   "Matt H. was our guide and this experience was awesome. Totally recommend it!",
   "Really love doing escape room. This time we did a really hard one, didn't feel like there was enough time to since all the puzzles and proceed to the next level. Unfortunately another group got added to our group to full the room to max capacity.. Which was too many people. There were people standing around unable to participate and it was too crowded. Otherwise the rooms are unique and challenges are different. I highly recommend it. Especially with people you know."
  ]
 },
 {
  "name": "Benjamin Harrison Presidential Site",
  "address": "1230 N Delaware St, Indianapolis, IN 46202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e86aa7ac-9330-11ea-a06d-14b31f159f22.png",
  "tags": [
   "tour",
   "family",
   "tour",
   "knowledgeable",
   "family",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=5334214935636953911",
  "source": "GoogleMaps",
  "reviews": [
   "The most Prestigious home in Indiana. Don't miss out of the President Benjamin Harrison home. The story about his ministry, lawyer duties and most important his supportive family which included his artist wife. Don't miss this tour and come back for lawn croquet and garden tour in the summer.",
   "Great guided tour. There's military and veterans discount. 2 adults totaled $11. Tour is about an hour. Mostly original stuff inside the home.",
   "The Benjamin Harrison Presidential House was definitely worth the visit! The reenactors were very convincing, believable and entertaining. I plan to bring my grandchildren back for a visit.",
   "Tire guide was very knowledgeable and spent extra time with us animal all it questions. I never realized what a dynasty the Harrison family was. Benjamin Harrison v signing the declaration of Independence, William Henry Harrison serving as our ninth president (briefly), and of course Benjamin Harrison serving one term between the two Grover Cleveland administrations.",
   "Great informative tour of the home of our 23rd president. Very kind tour guides and staff ! One of my favorite presidential sites I’ve visited."
  ]
 },
 {
  "name": "Garfield Park",
  "address": "2345 Pagoda Dr, Indianapolis, IN 46203, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e8b5baa2-9330-11ea-b68b-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "music",
   "art",
   "brewery"
  ],
  "link": "https://maps.google.com/?cid=12486398403518848280",
  "source": "GoogleMaps",
  "reviews": [
   "I love Garfield park. As a child and even in my teens my brother and others from our neighborhood hung out there on a regular basis. \nI was there on this visit for the spring flower and  bulb show and sale. It was very beautiful. My mother and I was able to purchase some beautiful plants.",
   "Today was a great day in the park. Packed with people. The sound of kids having fun and dogs barking. It was a good for fresh air. Love this park.",
   "Garfield park is normally a secluded place. It's great for time with your significant other or time with family. Due to the little to no interruptions you may have, the only interruption I had was a local asking for directions",
   "Beautiful park. Lots of events happening all the time. We went to a Valentine's Day art event that was teriffic fun. The people were super friendly, and the artist were awesome! We loved the hands on creating theme of the night. There was even live music and a brewery hosted the cash bar. I'd go to another event hosted by them anyday.",
   "A beautiful park with wonderful people. I regularly run through Garfield park and use its trails to get me to places throughout the city by bike. Living near the park feels like a breath of fresh air from typical city living."
  ]
 },
 {
  "name": "Indianapolis Canal Walk",
  "address": "Canal Walk, Indianapolis, IN 46202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e90bca70-9330-11ea-9167-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=17427765122216189111",
  "source": "GoogleMaps",
  "reviews": [
   "I'm from out of town, but this will continue to be a must-visit place whenever I come back! Although it was February, I could tell how alive the canal must become once the weather turns. Loved all the cool sites and things to see!",
   "Great hangout. Very clean, well policed and very relaxing. Good with kids, just keep in mind that there is no barrier between the walkway and the canal.",
   "Gorgeous stretch of walkway... definitely a visit whenever we're in Indianapolis. Walking, running, Pokemon Go are highly recommended.",
   "My girl and I spent the day there. Had a great experience. Great atmosphere with plenty of places to sit without people all in your business. Very relaxing time spent there and will go back when the weather breaks. Parking was not an issue. One thing...do not go there later in the night. Gang kids are everywhere acting like fools. Daytime good, night bad.",
   "Very serene location in the city (though to be fair, I visited this place on Thanksgiving.) Great atmosphere for jogging, walking your dog or simply releasing stress."
  ]
 },
 {
  "name": "Rhythm! Discovery Center",
  "address": "Claypool Court Building, 110 W Washington St A, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e95640e2-9330-11ea-9c58-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=8314424216494202529",
  "source": "GoogleMaps",
  "reviews": [
   "This place was super cool! I highly recommend going early because the kids and I went when it first opened and we had the place to ourselves. There’s a ton of gongs, bells, shakers, and various other instruments for the kids to try out. Tons! There’s also a few areas which are roped off but the employees explain to you that the museum is interactive except for the roped off areas. There’s interactive screens which tell you about the instruments and two awesome studio spaces you can drum on and change the venue with buttons. Love, love, loved it here and highly recommend it.",
   "Love love love this museum! Small but totally worth the visit...from the drum circle to the soundproof jam session rooms and ALL of the interactive exhibits. We are from Chicago and next visit to Indianapolis we will definitely be back. Thank you!",
   "Amazing stop... fully interactive displays.  Perfect for any percussion enthusiast.",
   "I’m a drummer, and if you’ve never beat on any percussion instrument and are just dying to do it, this is the place for you. If not, save your money. They need to get in with the state museum or supplement the experience with something else. BUT, the drum heads and cymbals on the drum sets you can play are ultra cool because they are SO quiet! You could jam on them in an apartment!",
   "Visited Indy so many times and didn't realize this place existed.  I started drumming a couple of years ago, but whether a beginner, expert or someone who never played before in their life, this place is a great way to spend an hour or two.  Pretty much anything you can hit to make a sound (including giant cymbals, wood blocks and more) as well as classic drum kits (and even one made out of Lego) are here. And much of it you can have a.go on!"
  ]
 },
 {
  "name": "Indiana Medical History Museum",
  "address": "3045 W Vermont St, Indianapolis, IN 46222, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e9966d34-9330-11ea-a6bb-14b31f159f22.png",
  "tags": [
   "history",
   "tour",
   "knowledgeable",
   "history",
   "unique",
   "tour",
   "history",
   "knowledgeable",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=4003119055157690440",
  "source": "GoogleMaps",
  "reviews": [
   "Strange, delightful, spooky, humbling. Loved the tale of the rich history. Tours start on the hour for $10 ($5 students with ID)...come a little early and you’ll get to look around at a bunch of human brains. There’s stories about each human. That was the stuff that kinda “hits home” and gave me creepy feels. Loved the medicine bottles! Neat neat neat.",
   "A nice activity for an hour, I recommend this museum for anybody who can stomach it. It's not gross but there are things (like brains, child skeleton, etc) that might not suit everyone. Our guide was nice and I felt she let us explore the rooms with adequate timing. $10 to get in and they have a small parking lot northwest of the building. Small but with enough parking. We walked up to the steps 2 min before the hour and were let in after she unlocked the door. They accept credit card. Very informative tour! I will definitely be coming back with visitors!!",
   "This place was fascinating! Our guide Doug, was so knowledgeable and it was really nice to read the humanizing stories that went along with the specimens. So many neat things to see and beautiful old furniture and history. 10/10 would recommend.",
   "Very interesting tour!!! Would definitely do again to see all the unique items! The ladies conducting the tours and greeting you are amazing and knowledgeable about the history of the museum and able to answer questions and provide a good history lesson all while having a good time! Thank you ladies for a great visit!",
   "This museum has tours that last almost exactly one hour. It is the cheapest museum I have ever been to. With probably the most knowledgeable hosts of any museum I've ever been to. Now they can't answer all of your questions, but if they can't then they usually write it down and find someone who can cuz that's exactly what they did to me when I went here a year ago. I took a friend here just the other day and it was just as awesome of an experience. They've got the stories of the patients, not just the medical descriptions. This place could very easily entertain you for days on end, and it truly saddens me that the tours can only be one hour long. I also recommend going there over the summer because the medical garden is also very interesting. They've got every plant in there labeled with common name, scientific name,"
  ]
 },
 {
  "name": "Central Canal",
  "address": "Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e9f6ee7a-9330-11ea-a7b3-14b31f159f22.png",
  "tags": [
   "art",
   "walk",
   "art"
  ],
  "link": "https://maps.google.com/?cid=17197622835478465806",
  "source": "GoogleMaps",
  "reviews": [
   "A nice place in downtown Indy to take a stroll, bike ride, or paddle boat.  It is safe with a variety of art and architecture to look at.",
   "I like this place, it's quite beautiful, designed based on City Vanice, I guess. Log walk or long paddle boat, or cycling.",
   "Clean and safe path thru downtown Indy.",
   "By far the best hidden gem in greater downtown. Water fountains & falls, bridges of iron & stone, art, architecture, fish, paddle boats, gondola rides, mammoths & war memorials, open green fields, amphitheaters of grass & stone facing wide river bends, walkers and skaters, joggers and bikers.",
   "We finally made it to the last outdoor concert of the season & it was a perfect date night!"
  ]
 },
 {
  "name": "Oldfields–Lilly House & Gardens",
  "address": "4000 N Michigan Rd, Indianapolis, IN 46208, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ea48df38-9330-11ea-b0ab-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "wander",
   "art",
   "history",
   "history",
   "music"
  ],
  "link": "https://maps.google.com/?cid=11688988851448812188",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely worth an afternoon of wandering. The Indianapolis Art Museum is wonderful and the Lily estate is included in that admission. The gardens and grounds are fabulous. The landscape designer was the same man who later designed and developed Central Park in NY. I happened to arrive on a Friday when the Lily house has free tours (2 pm). The house was the country house of the Lily family and it was marvelous to stroll through to see their furnished home with libraries, secret doors, game rooms, and even the garage with a vintage car inside. The gardens took hours for me to wander through. They were setting up on the lawn for a wedding as I left. Beautiful place.",
   "It's a gorgeous area that is a piece of history as much as it is a potential venue. Weddings are popular to have here. The garden is very beautiful and it's a wonderful way to spend the day with someone you care about.",
   "I loved visiting this house, there was so much history.  Hopefully you can visit sometime, you will love it.  Visiting at Christmas was extra special.",
   "I love Oldfields. The museum, Lilly House and gardens are outstanding. Spring time is a good time to visit the gardens.",
   "Their Christmas lights display with coordinating music from The Nutcracker is da bomb.  Actually a very romantic evening.. spectacular."
  ]
 },
 {
  "name": "White River Gardens",
  "address": "1200 W Washington St, Indianapolis, IN 46222, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ea91811c-9330-11ea-b877-14b31f159f22.png",
  "tags": [
   "free",
   "walking",
   "free"
  ],
  "link": "https://maps.google.com/?cid=13185495446165774531",
  "source": "GoogleMaps",
  "reviews": [
   "Gorgeous in the spring and summer.  Free admission with Zoo admission.  This garden is the gem of Indianapolis.  It's not only beautiful and well maintained, they have an indoor butterfly \"garden\" as well.  In the gardens there are nice, picturesque almost private little nooks to rest in, a big beauful space for weddings, fountains, ponds, water lilies, a zillion different flower species and some whimsical animal statuettes.  At first I felt the whimsy was out of place.  The next time I went, I really looked at them and they are fun and one particularly hilarious statuette of 3 ducks walking on the edge of a pond and the middle duck is expounding with his wing, and looks like he wants to push that duck into the water.  This one gave me the biggest laugh!  This place is definitely a must-see in Indianapolis!",
   "Gorgeous gardens. I thourghly enjoyed myself. Took several pictures that friends now use as screen savers on their computer. Also took pictures for artistic muse. Just lovely.",
   "I enjoyed the indoor garden. The outside garden did not look in a great shape. Maybe because it was around Christmas time and some of the plants were dead/in a bad shape!",
   "This is a really nice indoor and outdoor garden. We went after we went to the zoo and it was a nice way to wind down. The butterfly garden is really cool. The outdoor area is really awesome. It feels like an old fashioned British outdoor garden. You get in free with zoo tickets I think.",
   "Nice scenery with green and blue environment in Indy downtown. Good place to exercise and spend an evening. Well maintained. Connected to white river and Indy zoo. Garden looks but antique but clam and quite place to relax. The butterfly arenas are worth to enjoy."
  ]
 },
 {
  "name": "THE VIRGINIA B. FAIRBANKS ART & NATURE PARK: 100 ACRES AT NEWFIELDS",
  "address": "1850 W 38th St, Indianapolis, IN 46228, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/eadae65e-9330-11ea-9e07-14b31f159f22.png",
  "tags": [
   "creative",
   "walk",
   "art",
   "walking",
   "tour",
   "family",
   "kids",
   "tour",
   "family",
   "affordable",
   "walking",
   "walk",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=2152968034357431229",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful grounds for walking. The path is dirt, but easy enough to walk on. Although this winter the conditions dont allow for a full lake loop, I enjoyed what I could.\n\nThe art installations throughout are neat and creative. Come and see for yourself!",
   "Winter Lights were beautiful. Kids did OK on that cold day. Would have been nice to go without kids and tour the buildings more thoroughly, but it was still a great family activity. We'll try to return next year.",
   "Very well done walking tour. Dress warm but you can always stop for hot chocolate. It is an affordable date night, family outing or just a great experiential gift idea.  Could also be considered to be a romantic experience.  \nStart a tradition.  Go.",
   "Very nice collection, helpful staff and solid events and tours.  Well worth regular visits if you live here or one visit if you're a tourist.",
   "This is great place for a nature walk. There was many areas to explore and see. We visited the guest center to cool off in the AC and watch the wildlife from the comfort of indoors, which helped us recharged to keep exploring out in the heat. We really enjoyed the trails. \n\nIf this review was helpful please hit the thumbs up! Thanks!"
  ]
 },
 {
  "name": "The USS Indianapolis National Memorial",
  "address": "Canal Walk, Indianapolis, IN 46202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/eb3366dc-9330-11ea-8113-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6643872601427415552",
  "source": "GoogleMaps",
  "reviews": [
   "It's a beautiful park right off the canal.My girlfriend and I were visiting from San Diego and found it was a wonderful place to stroll through. There is a zoo however it wasn't open when we pass by. Maybe it was a little early in the morning. But the canal and river area are both very beautiful.",
   "These pictures are actually of downtown Indianapolis, Indiana. Includes the gorgeous and beautiful Canal Walk. Include some pictures from the state fair that's held in Indianapolis right outside of Indianapolis, Indiana. The city, and area businesses, along with the entire Indianapolis, Indiana Community have come together and made a beautiful, welcoming, and unique downtown area. They have horse-drawn carriage, to peddling beer bars smiley. :-) :-)",
   "Very nice place to take a long walk or bike ride, beautiful view",
   "Incredibly moving.",
   "Small but important memorial to the last naval vessel lost during WWII. The memorial tells the story of the USS Indianapolis, including its accomplishments prior to its sinking. It's very tasteful, and in a great location near the canal."
  ]
 },
 {
  "name": "Veal's Ice Tree (please note the tree can only be made if we have temperatures below freezing)",
  "address": "6445 Mimosa Ln, Indianapolis, IN 46259, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/eb8b242c-9330-11ea-9eba-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=6334932243849789723",
  "source": "GoogleMaps",
  "reviews": [
   "What a magical place.  So happy the family continues the tradition.  My kids and I loved the tree in all its glory.",
   "This place is absolutely amazing! Very family-friendly and worth the snow and cold. The people are so nice and sweet! I reccomend this place to anyone in indiana looking for a place to have fun and enjoy life the way it is.",
   "One of my favorite things to go see every winter when it goes up! Love it!",
   "Awesome icon of winter in Indiana. A must see. While we were there, the owner was climbing on it moving the hoses to make it bigger.",
   "Admire the dedication this family has to bring something beautiful for millions of people to see every year! Please keep up the tradition as long as you can!! Pretty neat to be Birthday twins with the founder! (photo is my own from 01/2018 tree)"
  ]
 },
 {
  "name": "Go Ape Zipline & Adventure Park",
  "address": "5855 Delong Rd, Indianapolis, IN 46254, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ebca9e34-9330-11ea-98ad-14b31f159f22.png",
  "tags": [
   "family",
   "learn",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7024145656597119636",
  "source": "GoogleMaps",
  "reviews": [
   "Julia was a great instructor! Had such a fun time at Go Ape! Definitely a work out and need some upper body strength at times. You can get through the course without much physical endurance, but can’t be too out of shape. It’s fun being up in the trees. They care a lot about safety, too, and will always be paying attention making sure you’re doing things right! They’re also doing waivers electronically which rocks!",
   "Took my cousin to GoApe as a last adventure of summer right before she starts up school again.  We went on a weekday morning, so it wasn't crowded at all.  Even though it was warm out, it was shady in the trees and they had lots of water available at stations on the ground.  Cabin manager and instructors were very friendly and helpful.  You start out at a lower training site that way you feel safe once in the higher trees.  At the first long zip line she was a bit nervous, but by the end of the course they were her favorite part.  Go Ape is a great way to get outside and try something different.",
   "So much fun! My family went and we had such a great time. The ladies there were so helpful, even setting up a brake line for grandma! Even though it rained they gave us a quick rain check that we can't wait to use!",
   "I got over my fear of heights here. That's why I went. The first course was hard for me but by the time I got to the fifth course, I wanted more! \n\nI brought my son and daughter with me. Both enjoy video games and hisss at the sunlight. So, really, I FORCED my son and daughter to go with me. They ended up having fun too! It was actually nice to be outside and have them put the electronics down. Parents: kids telling you \"no, I don't want to go\" will eventually learn to have fun here by the second course.\n\nTwo birds, one stone. Having the kids outside wins by a long shot but conquering a fear is also awesome.",
   "Wow! This was awesome! Friendly and informative staff.  Clean and we'll run facility.  The training was detailed and I felt safe.  Staff patrol the area to be sure of safety and help with any questions.  If taking kids (only 10 and above!) be sure to check the height requirement as well. Also, I would ask for one of the guides to train the kids separate from the group to be sure they are focused!!!!"
  ]
 },
 {
  "name": "Scottish Rite Cathedral",
  "address": "650 N Meridian St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ec0de906-9330-11ea-b89b-14b31f159f22.png",
  "tags": [
   "history",
   "unique",
   "history"
  ],
  "link": "https://maps.google.com/?cid=16730421814977419456",
  "source": "GoogleMaps",
  "reviews": [
   "A classy place to set the ambiance for our daughter's formal wedding two weeks ago. The gorgeous, giant chandelier in the ballroom, rich wood floors, walls, posts and all the decor made this the most memorable day of her life. The bridal suite and grooms quarters are perfect for getting ready. Having the mezzanine for cocktails took care of them until dinner. \nThe staff was super to work with. Thank you Scottish Rite Cathedral!",
   "This place is so drench in history, not made with a nail! The details are amazing of this building. Easy access and great parking. Love history it's a great place to start!",
   "This place is steeped in history. The entire building is absolutely beautiful. They have a ballroom that is absolutely gorgeous. This place really does downtown Indianapolis Justice. Some of the stained glass in this building is breathtaking. The staff is friendly and polite. They also serve lunch here every day. Certainly a unique place to visit.",
   "The building on the outside was absolutely beautiful. Unfortunately I stop by on the weekend so I was unable to go inside. I am definitely planning to stop back next time Im in town.",
   "I use their monthly parking and love it. Very reasonable rates, excellent security, wonderful staff and beautiful building. They have a tasty cafe inside too."
  ]
 },
 {
  "name": "Pagoda",
  "address": "6th St, Indianapolis, IN 46222, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ec55526e-9330-11ea-ad6f-14b31f159f22.png",
  "tags": [
   "structure",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=9609472314341073900",
  "source": "GoogleMaps",
  "reviews": [
   "Really interesting venue. Came here for a fundraiser and was able to sit in the Pagoda seats. Has a really great view of the track from the terraces.",
   "beautiful glass structure on the inside of the start/finish stretch of the Indianapolis Motor Speedway (IMS)",
   "Wonderful and exciting. Fast cars & beautiful weather",
   "Maybe the best place to watch the race. Air conditioning and a great view of the start and finish line. Come watch the race from every place but you'll find the pagoda as the most comfortable. You can go up on the roof of the Pagoda and see most of the track. Or you can stay in one of the Suites and watch the race on the TV with food and beverage. We had ice cream sandwiches and walking tacos in our suite. Very clean restroom.",
   "Awesome experience."
  ]
 },
 {
  "name": "Simon Skjodt International Orangutan Center",
  "address": "1200 W Washington St, Indianapolis, IN 46222, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ec9baa5e-9330-11ea-9bd6-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=11688509570841486420",
  "source": "GoogleMaps",
  "reviews": [
   "It was exciting watching the babies play while the adults get settled down for a nap.  Orangutans are very intelligent and the caretakers provided alot of information about their care",
   "The orangutans are very playful and are able to come right up to the glass, with plenty of room to move around and interact.",
   "The orangutan seem comfortable and they have plenty of places to go if they want to be alone. I think that is what's most important. They like to show off for young kids sometimes which keeps visitors entertained. Love visiting.",
   "The viewing exhibit is excellent. There are many angles to see the orangutans. You can also see them climbing inside and outside. Great exhibit Indy Zoo!",
   "Our granddaughters loved this place!! They couldn't believe that he wanted to see the security guards arm.. to see her tatoos. My son, held out his arm and the big guy just looked up & down my sons arms at the tattoos. Then, he saw my wrist one and pointed to it, i showed him. Im in awe"
  ]
 },
 {
  "name": "Circle Of Lights",
  "address": "Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ecf8bec0-9330-11ea-9c99-14b31f159f22.png",
  "tags": [
   "walking",
   "family",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=5887766893935773836",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic and stunning...go on a cloudy or misty evening for more dramatic photos and overall experience. Really a wonderful holiday tradition.  A beautiful must see!",
   "We stayed by the circle for the night and had no idea that City of Lights was even a thing. We were pleasantly surprised to be walking around when the light show started. It is very cool.",
   "The best place to bring friends & family & have a good time. Coming here in December is the best time of the year.",
   "So many people but it's enjoyable. A nice tribute to veterans. Various groups singing and dancing on stage",
   "The tree was absolutely stunning, as always! This is a great attraction to take the whole family to see. You can just drive around the circle a couple times or park and walk around it. There is a wonderful place to get hot chocolate and snacks, Starbucks is also right there. Overall wonderful time!"
  ]
 },
 {
  "name": "9/11 Memorial",
  "address": "421 W Ohio St, Indianapolis, IN 46202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ed407706-9330-11ea-8408-14b31f159f22.png",
  "tags": [
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4158853881800554028",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for to remember those who gave life for others. I lost one of my friends on this day in Trade Center One in 2001, so this memorial is a very special place in Indianapolis to me. At this day, they are trying raise additional funds for an extension of this memorial. Go to the website for this memorial for more information if interested. Take time to stop by and see this place. I think you will go away a greater appreciation for 9/11/2001",
   "Unforgettable memories. On great place Canal Walk.",
   "I happened upon this memorial while walking the canal. It is a very well done tribute to 911 and the World Trade Center. The beam that the eagle is on as well as the others are actual beams from the World Trade Center.",
   "I'm a Navy veteran, I was in during Persian Gulf war and seeing this was very emotional for me. Living in Indy and knowing I can go see this whenever I want is wonderful.",
   "Indianapolis was very smart to do this.  To remember why we are America.   Thank you"
  ]
 },
 {
  "name": "The Indianapolis Cultural Trail",
  "address": "132 W Walnut St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ed9eea5a-9330-11ea-a171-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=2157317029156344968",
  "source": "GoogleMaps",
  "reviews": [
   "Thanks to all who are supporting the Cultural Trail. Thanks for helping to beautify Indianapolis and for bringing together all of Downtown's points of interest for visitors and residents.\n\nAnd to all of the crew and staff who maintain and expand the Trail and The Bikes, your efforts are priceless. THANKS❗",
   "Best trail in the Midwest!",
   "Great opportunity to walk",
   "Such an amazing asset for the city",
   "Great streetscapes. Lovely sights. I wish there were signs explaining what buidlings we were looking at."
  ]
 },
 {
  "name": "Zip City Indy",
  "address": "6650 Bluff Rd, Indianapolis, IN 46217, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ee01a42c-9330-11ea-9850-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7868404202714115460",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful Family Place..!\nAll options are great!\nAssociates need a little bit more training on be more friendly...\nJust a few were really helpful with information and attention.\nThey need to take care more about the food area....wasn't really clean and the person that was taking orders was acting as a dummy ( I'm not going to say details).\n about the price it's not too bad but I guess it could be a little bit cheaper.... main thing for families\nthat have more than 2 children .\nAfter all I guess it's a great place!",
   "We had a great  birthday party  here. Busy but not too busy. Well staffed. And the kids used all of the energy they had in only 2 hours.",
   "This is a great place to being your family for fun. They have a wide range of things to do from ziplining to rock climbing. I highly recommend this place for parties and group events.",
   "Good prices and fun times for all. Zip lines, climbing wall, obstacle course, laser tag,and plenty of trampolines for dodge ball, basketball, foam pits, or just general jumping around.   Vending machines are cash only, but there is a snack bar that accepts cards. No special footwear required.  There is a lounge area with couches, chairs, and tvs for parents to hang out while the little ones play.",
   "So much fun! Lots of activities here, and great for kids. But I saw some adults hitting the zip line too, which was cool. Definitely worth checking out!"
  ]
 },
 {
  "name": "The Waterpark",
  "address": "1195 Central Park Dr W, Carmel, IN 46032, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ee49a99c-9330-11ea-a0c9-14b31f159f22.png",
  "tags": [
   "adventurous",
   "music",
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13123830985857034547",
  "source": "GoogleMaps",
  "reviews": [
   "It's summer,  it's warm,  and everyone wants to partake in the great pastime of cooling off. This is one place you can go and enjoy every variety of water park entertainment.  There is the lazy river for the ones who want to relax but stay cool.  There is the water ski for the more adventurous. There are tons of slides to take your pick from. And of course there is the pool.  Life guards are available throughout the center. The concession stand serves up a mean ice cream cone along with other consumable items from hot dogs to pizza and of course items to quench your thirst.  Plenty of seating and lounging chairs.  Cabanas are available to rent and come with a fan,  refrigerator,  and music. People of all ages and backgrounds just enjoying the awesomeness of this nice adventure.",
   "Had a blast! \n\nHighly recommend reserving a cabana in advance and purchasing entry tickets in advance online. Saves time from standing in line to get tickets. The cabana really helped with getting out of the sun and having a place to eat/relax. \n\nThe FloRider was super fun. All of the attractions were great - slides, lazy river, rock climb wall.\n\nThe staff was over the top outstanding and nice. Hats off to all of them. They made the entire experience that much more amazing. Thank you!!!",
   "The water park activities are fun. Love the lazy river. The staff are pleasant and helpful. Several restaurants nearby that serve good food. Overall, will recommend.",
   "My 6yr old twins love this place. Its a fun place to spend a hot summer day.",
   "Great place for kids of all ages!!"
  ]
 },
 {
  "name": "Military Park",
  "address": "601 West New York Street, Indianapolis, IN 46202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ee9817f6-9330-11ea-bbb1-14b31f159f22.png",
  "tags": [
   "delicious",
   "kids",
   "family",
   "food",
   "music",
   "walk",
   "parks",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=10316182161827797464",
  "source": "GoogleMaps",
  "reviews": [
   "LOVED THE IRISH FEST!  High Kings are now one of my FAVS and in my play list!  Food was delicious and I was really impressed with kid's area.  Just an outstanding job!  Loved the good and healthy family feel of the festival.  My youngest loves to dance and I really appreciated she was able to express herself with all of the kids during the concert front stage!",
   "I love when the pride festival is going on just wanna  break out and dance when I hear the club music playing  also they always have cool things to buy. they had best bartenders last year keep it up and imma end up making it a thing  going to the festival for the good booze hot boys and good music hell of a good time",
   "I work all kind of events here! Huge open space, its great.",
   "Great looking canal walk with two good restaurants and museums. Several Bridges with paintings covering the supports. Gondola rides and a military memorial. Though I give 5 stars because I enjoyed the scenery... I'd only give 2 because of the patrons. Inconsiderate people on bikes, scooters, those powered 1 wheel things, and all others will plague your otherwise serene walk. It was designed to be a walking path but you will be hounded by a-holes trying to push through the whole time. My advice is go on a weekday and/or later in the evening to avoid the majority of them. To those of you who use those modes of transportation... You obviously don't understand the way to enjoy these kinds of parks and are ruining it for everyone else.",
   "Ride my Bicycle thru-out the park. Always something going on there, gets your gauge of what happenin' n' downtown Indianapolis."
  ]
 },
 {
  "name": "Holliday Park Nature Center",
  "address": "6363 Spring Mill Rd, Indianapolis, IN 46260, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/eee3ee6c-9330-11ea-a56c-14b31f159f22.png",
  "tags": [
   "hike",
   "nature",
   "parks",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6254310456919754565",
  "source": "GoogleMaps",
  "reviews": [
   "Super modern, bright, and colorful. Really well taken care of. Plenty of stuff to do for a solo adventurer, but best I’ll bet when you bring your kiddo along!",
   "We LOVE Holliday park! They have a lot to offer. We have two young girls and they really enjoy the nature center. There are critters native to Indiana, a bee hive, and fun areas to play in while learning about nature.\n\nWe usually end up going on a little hike each time we go; the trails are easy for little ones (we've done it since they have been two.. easier since three. There are stairs on some trails). Great view of the river and one spot is perfect for splashing around in your feet. \n\nThe playgrounds are great! There are three separate areas next to each other, so you'll be able to find the perfect fit for your kiddos. \n\nGrounds are beautiful. Can you tell I love this park? 😊",
   "Nice parks to spend 2 hours, make sure you do a trail going to the whiteriver. It is a short trail but had a nice scenery.",
   "Great place to bring younger kids indoors out of the rain! My oldest is 6 and he still finds things to do. There are lots of building toys, books and a water area to play at.",
   "Good park close to downtown. Decent amount of parking around park and playground area. Have hiking trails through a valley. Good time to loose yourself near the heart of broad ripple"
  ]
 },
 {
  "name": "Broad Ripple Park",
  "address": "1500 Broad Ripple Ave, Indianapolis, IN 46220, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ef345870-9330-11ea-82ed-14b31f159f22.png",
  "tags": [
   "family",
   "walk",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=2094164053386933266",
  "source": "GoogleMaps",
  "reviews": [
   "Great park! Very dog friendly. If you have a pass for the bark park, your money is well spent. Well stocked with bags for “accidents” and I’d say about 90% of the other owners are great about cleaning up after their pups.\nDay passes are available. Most members will adhere to the policy of not letting non-members in.",
   "Always been there from my childhood when my Mother took me and my siblings to play to now. It is still clean, safe, family friendly. Beautiful huge trees, vista views of the river. You won't be disappointed!",
   "We LOVE broad ripple park. It's a nice to place to walk and we enjoy the wooded trails. The dog park is also a great place to go with our two dogs. We haven't met any overly aggressive dogs at this park.",
   "Small park for kids to play, large dog park and lots of walking area around the white River. There is also a boat ramp there with a decent amount of parking. Nice dock to do some fishing off of.",
   "Pool, park, festivals are commonplace, lots of fun to be had here."
  ]
 },
 {
  "name": "Depew Memorial Fountain",
  "address": "Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ef7420ca-9330-11ea-b7b4-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=7297672446739788421",
  "source": "GoogleMaps",
  "reviews": [
   "Definitely my favorite spot to chill downtown. Such a gorgeous fountain.",
   "@mananhisbestfriend loves this spot... Swims and walks... Follow us!!",
   "A nice spot to read for a while or enjoy some carry out lunch. Plenty of benches and shaded spots. Easy to get to using all of the downtown IndyGo routes.",
   "Pretty & the only water fountain working at the moment. They shut down the others for the season, back on in the spring",
   "My 3 year old just love's water, so we usually start our walks in the downtown area here. A real peaceful place."
  ]
 },
 {
  "name": "Saint John the Evangelist",
  "address": "126 W Georgia St, Indianapolis, IN 46225, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/efd57ad4-9330-11ea-a64b-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=4919439334644198444",
  "source": "GoogleMaps",
  "reviews": [
   "Father Rick gives great homilies and he does well creating a connection to everyday life.  He has done a great job of engaging the young adult community.  It is a great historical and beautiful church.",
   "Gorgeous! Oldest church in Indianapolis. I was only there for a Christmas concert, but beautiful!",
   "Wow 10am mass was filled with children, young adults. 100s  Was a beautiful lift to a visitor who attends an older parish. Dr. Rick delivered a spiritual homily.",
   "A great place for spiritual relaxation. Love its rich history too.",
   "Passing by for a conference and stopped in. They were so kind and welcoming to visitors!"
  ]
 },
 {
  "name": "K1 Speed - Indoor Go Karts, Corporate Event Venue, Team Building Activities",
  "address": "9998 E 121st St, Fishers, IN 46037, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f0346402-9330-11ea-b5dd-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10529404562780392539",
  "source": "GoogleMaps",
  "reviews": [
   "Nice evening with the kids on our first visit. The facility is clean and well maintained. The racing area is not air conditioned, but was not too hot on a warm afternoon. The main area, with comfortable places to sit and relax, is air conditioned. It looked like there are a few rooms to revert for parties or team building exercises. I enjoyed the racing memorabilia and many pictures of past Indy 500 winners. The facility has food, a pool table, air hockey, and a couple video games. \n\nVery fun when it was just me and a few of my kids in the track.",
   "We had a great time here.  Clean, fun environment.  Kids had a blast.  The top speed of the carts is controlled by the staff.  They kept it slow for the first few laps until our kids got the hang of it, then they turned it up a little bit.  I would say this is a real workout for the forearms!  If we’re in the area again we will definitely visit.",
   "Great place and great experience! the building is in great condition and granted, the karts are all electric it is nice to not have the smell of gas burning your nostrils. Still quick little buggies and the prices have cool swag grabs, i got 3 races and a t-shirt for me and my girlfriend for under$120. Got a great memory and a cool shirt",
   "Nice, clean place.  Air conditioned in the main area. Not in the racing area.  They have a pool table, air hockey table, and some video games.  There are areas to sit and hang out and two nice party rooms to rent out.  The whole place is decked out with Indy 500 race deco.  It's pretty cool!",
   "Great place good for beginners since it's soo quiet with electric carts!"
  ]
 },
 {
  "name": "Central Canal",
  "address": "Canal Walk, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f0762840-9330-11ea-9851-14b31f159f22.png",
  "tags": [
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=5902101752644429397",
  "source": "GoogleMaps",
  "reviews": [
   "Always love to walk the canal.  Great place to think, relax, take photos, walk (and if so inclined, bike, jog, paddle boat, kayak, gondola ride, etc.).",
   "Great place to sit and relax",
   "Very cool place and a great still for people traveling through.",
   "Nice place for a walk 👍",
   "Beautiful place"
  ]
 },
 {
  "name": "Kurt Vonnegut Museum and Library",
  "address": "543 Indiana Ave, Indianapolis, IN 46202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f0cbc282-9330-11ea-9f1f-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "library"
  ],
  "link": "https://maps.google.com/?cid=32134460683762205",
  "source": "GoogleMaps",
  "reviews": [
   "If you get a chance to visit and are at all familiar with the works of Vonnegut, I highly recommend a stop to this museum.  It is worth getting a tour from Max if he is available.  We got so much more out of the experience with his first hand knowledge.",
   "What a great experience. You can get a very informative tour with the price of admission. So much is packed in this place I highly recommend it",
   "Small but beautiful and intense little library and museum dedicated to Kurt Vonnegut and modest but fun selection of goods in their gift area for Vonnegut fans",
   "New museum so it’s not totally built-out. Some areas are in-process. Still a very nice museum!  The curator took us around for a good 30 minutes, regailing us with KV stories!  Learned a lot.  Had an enjoyable two hour visit. Bought a few items from their little KV store and took off.",
   "The website for the museum should issue a disclaimer that this really isn't a museum for Vonnegut, but rather an artist-in-resident forum."
  ]
 },
 {
  "name": "Eagle Creek Park Beach",
  "address": "7602 Eagle Beach Dr, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f1202434-9330-11ea-a780-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=15268903497408262705",
  "source": "GoogleMaps",
  "reviews": [
   "Great facility for hosting the NCAA WOMENS NATIONAL ROWING CHAMPIONSHIPS.  Thanks to the dedicated volunteers and staff, this was another great venue!",
   "Pretty small space for swimming and not a lot of sand either. It has a nice park and picnic area right outside the fence and smaller park inside",
   "Family friendly beach on Eagle Creek reservoir.  Has shallow wading area and play features.  Also has changing rooms and cold showers.",
   "Love being outdoors!\nWe went fishing by the beach.",
   "Giving a 1 star review because it is physically impossible to give no stars. Swim area is tiny, goose feces everywhere, there is no sand beach, admission is expensive, everybody must take a swim test, and even after passing said test everyone must wear life vests (including adults). Do not waste your money here. The government cannot run anything properly; spend your money at a private establishment instead."
  ]
 },
 {
  "name": "Museum of Miniature Houses and Other Collections",
  "address": "111 E Main St, Carmel, IN 46032, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f16a9ada-9330-11ea-9c6e-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "tour",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=11852002668171726720",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent place to visit.  This is art in miniture form. Dorothy Stickles work is exceptional. The attention to detail is phenomenal. Worth a visit.",
   "Very cool place if you are into the miniature houses.  Was a bit pricey which is why only 4 stars.",
   "Nice variety of eras and styles of miniature doll houses. The museum is packed full of very detailed items that are worthy of being considered pieces of art.",
   "What a fun place! If you like miniatures or maybe just looking for something different this is the place to go. Very friendly staff and it sits at the beginning of Main Street so you can start your tour there. They have a website with hours and admission prices.",
   "Very nice place. Kids really enjoyed it."
  ]
 },
 {
  "name": "Marott Park",
  "address": "7350 N College Ave, Indianapolis, IN 46240, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f1b18f22-9330-11ea-9b5f-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=259119534714012517",
  "source": "GoogleMaps",
  "reviews": [
   "Went here for a short walk to kill some time before my flight - wish I had had more time to walk more! \nIt was very peaceful - not many people, just a few and most had dogs. The paths are small/narrow so my friend and I walked single file for the most part.  We did have trouble navigating - finding paths that would go through and not be a dead end. Lovely Park, go check it out!",
   "Did not get to stay long. Was pleasantly surprised with the space. Lovely hiking/ walking area.",
   "Marrott is a great little park with water access.  Many dog lovers can be found hiking with their furry friends here.",
   "Nice place for a short run or walk with hills, flat trails, and woods everywhere! Dog friendly, too! The river/creek adds a nice touch, too.",
   "This place is amazing!!! Most everyone has dogs and it is a great place for the dogs to get some energy out and for the family to get some exercise. It is huge and the creek is awesome to go hang out when it's warm!"
  ]
 },
 {
  "name": "Southwestway Park",
  "address": "8400 Mann Rd, Indianapolis, IN 46221, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f2068d52-9330-11ea-bd10-14b31f159f22.png",
  "tags": [
   "parks",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=4758705292241415505",
  "source": "GoogleMaps",
  "reviews": [
   "It's an Indy park. I'd love to see them update a lot of the parks. Was busy this day, but that's to be expected. Still had a great time.",
   "The park is absolutely beautiful, the problem is however, mountain bikers. It's a very popular place for them and although most are respectful, there are a few who ride dangerously, and on paths clearly marked \"no bicycles\". More than once we've walked our small dogs here and have almost been hit by these people. They look at you rudely as they whizz by you like you're the cause of the problem. Absolutely ridiculous.....",
   "Love the place. Great for technically a city park. Also it only seems like there's more to it each time you go.",
   "I was VERY impressed with the trail system here! A gem of a park, fun for many uses.",
   "One of my favorite parks around Indianapolis. Doesn't look like much when you pull up but there's so much to explore once you venture on the winding trails. Not just a flat trail either, lots of changes in elevation and a river running through. It has a sizable playground next to the parking lot. This park is near us and they have a great recycling set up, so we bring our recycling here as well."
  ]
 },
 {
  "name": "Haunted Angelus House",
  "address": "8829 E Washington St, Indianapolis, IN 46219, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f26416d4-9330-11ea-9b7d-14b31f159f22.png",
  "tags": [
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13605947658574381286",
  "source": "GoogleMaps",
  "reviews": [
   "Pay for the fast pass, while they move the line quickly, it was 15 minutes in the fast pass lane.  The actors were good, and they really tried to get some jumps out of you.  The 3D part was pretty neat and very good.  I would recommend for everyone even little kids 10 and above.",
   "The best haunted house I've been to ever and I've been to alot, im 54 years old, and this was the most respected, very well priced, the most scariesty, and 45 mins. of pure fun! Well worth every penny!",
   "We had a great time. Workers were nice and scary.  They kept us entertained . The kids loved the clowns. Props were cool and they loved the 3d that was new this year. We will be back",
   "This is my second year going and it was awesome. The staff were amazing and very aware of situations. My friends and I were being bothered by a guy and his group who were waiting in line behind us and even tried to weasel his way into going in with our group. The hostess noticed it and gave us extra time to go through so guy and his friends wouldn't bother us. I would definitely recommend this place to anyone.",
   "This was by far the best haunted house I have ever been to! Def wear the touch me bracelet. It was detailed and the actors really get into it. Great job!!!!"
  ]
 },
 {
  "name": "Hindu Temple of Central Indiana",
  "address": "3350 N German Church Rd, Indianapolis, IN 46235, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f2a95d4c-9330-11ea-8414-14b31f159f22.png",
  "tags": [
   "cheap",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16876956693732490694",
  "source": "GoogleMaps",
  "reviews": [
   "This is a very beautiful Temple. All of the statues are hand made, inside and outside of the temple. I have never seen so much beautiful pieces of work in my life. Every piece of each statutes inside, outside, on the walls, gods, roof, are hand made by individuals from India. I was told that it a group of individuals who traveled from India and lived in the basement of temple a few years to hand make each piece in the temple. Each piece was made to perfection.  If you are ever invited  to visit this temple, I can promise you will not be disappointed.",
   "Very beautiful, clean and well managed temple. People of all religions, gender and race are welcome. It's usually a quiet place but gets very crowded on certain festive days.\nEven one time visitors would appreciate the architecture and get some insight into Hindu culture.",
   "Huge temple with detailed wood work. The ambience is soothing and engaging. Went there on temple fest the food was fresh, homemade and cheap. Must visit. Plenty of parking space.",
   "Very big temple with good cafeteria facility. Nice place to visit for praying.",
   "I come to this temple from Louisville especially for Lord Shiva. That divine attracts you towards him. \nJai Bholenath"
  ]
 },
 {
  "name": "Indiana Historical Society",
  "address": "450 W Ohio St, Indianapolis, IN 46202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f2ef1952-9330-11ea-ae0d-14b31f159f22.png",
  "tags": [
   "history",
   "knowledgeable",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=8374898248499231727",
  "source": "GoogleMaps",
  "reviews": [
   "Visted to see the You are there series on Madame Walker. but also saw the one on Angel Mounds.   They are fantastic.   The actors that play that play the people could get an academy award.   They stay in character and represent the people they are playing so well.   I really start thinking I am talking to the people.    I did a bit of research on Madame Walker before I went and had some things I was curious about.   In asking the question have to remember they will pretty much only respond to what happened in 1915 and prior.    There are also guides who can help you with questions after the time frame.    Every one of the You Are There series I have seen has been excellent.",
   "I went to see their 92 different themed Christmas trees and really enjoyed myself.  The staff who played the role in the exhibit with the preacher did a great job!  He was pretty versed on religion as well as Indiana history. We were also given a little lesson on how they preserve old Indiana manuscripts-fairly fascinating.",
   "Was a enjoyable experience.  The trees were amazing and so beautiful. Was with a group and a first time for several. Would highly recommend tickets very reasonable. Friendly staff.",
   "Such a fun museum! In addition to a great downtown local along the canal, the exhibits themselves were awesome! I’ve never been to a museum with so much “live” interaction. The concept of time machines to transport you back to a space in time was as much fun for the adults and it was for children. The actors were very knowledgeable on anything you could thing to ask them. The architecture of the building is also very special. It has strong character but immediately, you feel like all ages are welcome and encouraged to “play”.",
   "This place does such an amazing job with really making you feel like you're in the middle of a historical moment with their \"You Are There\" series. They also have a lovely illustration on how conservation is done most effectively. The historical context in exhibits and the curation are top-notch. The programming is great and the staff knowledgeable and friendly."
  ]
 },
 {
  "name": "Indiana Statehouse",
  "address": "200 W Washington St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f34ddb30-9330-11ea-95a6-14b31f159f22.png",
  "tags": [
   "tour",
   "family",
   "history",
   "historic",
   "learn",
   "library",
   "history",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=1167332179754637472",
  "source": "GoogleMaps",
  "reviews": [
   "Highly recommend doing a tour! Are 9 and 11 year old daughters had a great time and learned a lot about the different branches of government in Indiana history. The architecture is absolutely stunning and we got to see where the different laws get passed. Great family experience and the tour guide kept it interesting for our daughters.\n\nIndiana has the longest running Supreme Court building in the country... 130 years",
   "This is another architectural landmark in the USA.  This beautiful building is the Indiana State Capitol or the Statehouse located in the heart of downtown Indianapolis.  This 4 floor building was built in 1888 and houses all executive offices, the Indiana State Senate, the Indiana House of Representatives, and the Indiana State Supreme Court.  \n\nAbout almost 100 years after it was built, the building went through a major renovation in 1986 for the Centennial Celebration two years later in an effort to restoring or recreating the original design.  \"Four acres of plaster walls and ceilings were stripped, painted, and decorated.  1,500 gallons of paint were used. 124,500 square feet of interior marble and limestone were cleaned. 4.25 acres of Indiana limestone were cleaned on the exterior of the building.  31.5 miles of mortar joints were cut and repointed on the exterior limestone. 2,920 two-feet-square pieces of marble floor, approximately 1.1 miles in length, were removed and replaced for the installation of new electrical wiring. 45,000 board feet of white oak were used in woodwork, equivalent to 85 average trees. This included eight sets of white oak monumental entrance doors. 40 original brass chandeliers were restored and 67 were replicated.",
   "Majestic architecture, historic downtown setting.",
   "Happy to have taken the time to stop by here. What better thing to do than to learn about the history of the city you're vacationing in? This was really breath-taking, I'm not surprised there's over thousands of pictures of this pleasantly-aesthetic building. Surprisingly spent most of our time here in their library section where law books as well as anything historic were available for public use. The lady who worked there was so kind as to tell us a bit of history. Interesting fact: Only the chandelier lights on the fourth floor were authentic, while the rest are re-mastered replicates!",
   "I loved this place and they are so nice!!!"
  ]
 },
 {
  "name": "James Whitcomb Riley Museum and Historical Marker",
  "address": "528 Lockerbie St, Indianapolis, IN 46202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f396cb4a-9330-11ea-b800-14b31f159f22.png",
  "tags": [
   "historic",
   "walking",
   "unique",
   "knowledgeable",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=9117141817246917855",
  "source": "GoogleMaps",
  "reviews": [
   "This was the perfect venue for our small wedding (60 guests). We appreciated the incredible customer service, beautiful and historic location, adaptable venue in the carriage house-style Visitor Center, and we even got to make use of the patio and lawn for our guests. The location, in walking distance of the Mass Ave. shopping and entertainment district, is also a plus.",
   "Beautiful quaint museum which has all of its original furnishings still present. This is an unique experience. Most of the bedrooms have their own sinks.  One of the first bathrooms in Indianapolis was installed here with cherrywood copper tub wall to wall carpeting.",
   "Really neat house. Check the walls closely that is NOT wallpaper! Unbelievable workmanship.",
   "These people are here to take care of people, they do a great job. \nThank you so much.",
   "The best Victorian period furnishings and tour guides were very knowledgeable. I will definitely be back !"
  ]
 },
 {
  "name": "Holcomb Gardens",
  "address": "Garden Rd, Indianapolis, IN 46208, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f3e2054c-9330-11ea-b244-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6746364037291504959",
  "source": "GoogleMaps",
  "reviews": [
   "Holcomb Gardens are getting nicer and prettier as the years come along. \n\nThe city just added some very nice new bike and running paths that extend all the way inside Holcomb Gardens.\n\nThe canal tow path is right there also and one of my fellow running pals calls the tow path a runners nirvana.",
   "Lovely place for a walk or to relax.",
   "This is a beautiful gem located on the Butler Campus. It's a great spot for picnics, wedding and other photo ops, dates, and solitude. There are many plants and sculptures to see. Some of the sculptures have quotes and historical information on them. It is a fascinating place to spend some time with yourself, your friends, or your family. If you play any of the Niantic driven roaming games, they have several sites located in the park.",
   "I enjoyed the calm atmosphere. Peaceful place to walk.",
   "I would highly recommend taking a walk and relaxing here"
  ]
 },
 {
  "name": "Eugene and Marilyn Glick Indiana History Center",
  "address": "450 W Ohio St, Indianapolis, IN 46202, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f4318526-9330-11ea-a437-14b31f159f22.png",
  "tags": [
   "historic",
   "kids",
   "history",
   "approachable",
   "history"
  ],
  "link": "https://maps.google.com/?cid=72027638507305840",
  "source": "GoogleMaps",
  "reviews": [
   "Reasonable admittance price, friendly and helpful staff, and a variety of exhibits. The staff provided information on the exhibits before you enter and are more than willing to answer questions. Cool to see the room where they restore old documents.",
   "Not sure what I expected but the museum underwhelmed me. Yet, the women portraying Madam C.J. Walker was outstanding in representing this important historic figure.",
   "A good local history museum with interactive exhibits. Step through the portals into the past and \"meet\" figures from Indiana's history. Great for kids and smaller groups.",
   "Having come from the South before moving to Indiana, I admire the fact that Hoosiers have a great appreciation for history. This place is representative of that. The museum's galleries do change and they uses digital technologies. The staff is pretty friendly and approachable (well...most).  Also, if you're a researcher like me, the archives holds a vast amount of archival materials.",
   "Attending Foster Grandparents Annual Banquet with Tribute to The Temptations"
  ]
 },
 {
  "name": "Landmark for Peace Memorial",
  "address": "1702 Broadway Ave., Indianapolis, IN 46202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f48d611c-9330-11ea-93bf-14b31f159f22.png",
  "tags": [
   "art",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1095015919518976342",
  "source": "GoogleMaps",
  "reviews": [
   "I am proud of the legacy represented by Martin Luther King, Jr. And I am glad to live in a city where even on a frigid cold day people were spontaneously gathering at this memorial in Indianapolis testifying to the power of the greatest dream of all!",
   "A historical landmark in one place that did not erupt after the assination of Dr. Martin Luther King, Jr. due to 1968 Presidential candidate Robert Kennedy's empathic presence and calming words in Indianapolis.",
   "Very historical read reading of what went on there.  Amaying Robert Kennedy gave one of the best speachs ever there.  Very peaceful",
   "Beautiful park with a beautiful piece of art.",
   "The park is a great tribute to two great men.  Visiting reminds us of their values and the their loss.  It's a good place to talk to your kids about civil rights and civility."
  ]
 },
 {
  "name": "Town Run Trail Park",
  "address": "5325 E 96th St, Indianapolis, IN 46240, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f4e98ae4-9330-11ea-89b8-14b31f159f22.png",
  "tags": [
   "hike",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=14477985969793595967",
  "source": "GoogleMaps",
  "reviews": [
   "The park is designed for mountain bikes and is well maintained. I'm a runner and come here because it is the only natural surface trails in or near Carmel. The winding of the trails are annoying at times though I'm sure it's fun for mountain bikers. Thus for runners it's not the most fun. The portion of the park south of I-465 is a beautiful restored prairie. North of I-465 is riparian habitat and full of invasive honeysuckle though in fall a lot of the nettle flowers and captures a certain charm.",
   "Great place to get warmed up.....! The first8 miles ended too soon! I will definitely be back!!",
   "Took my dog for a hike here, trails are very well maintained. This trail is right by the interstate but once you get a few minutes in all you hear are the birds chirping. We went early and only saw a couple cyclist.",
   "For not having many other places to ride, this park is pretty nice.\nSome teenagers decided to modify the trail in a couple spots - but it wasn't anything wild. The maintenance crew will probably fix it, but hey when I was their age we were building pretty elaborate stuff, too.\nIt's nice. Probably gets pretty muddy and they don't want you riding in that, but I understand.",
   "Anything by the White River is great, but this place is a true gem.  I only got to walk a bit of it, but I am bringing my bike to explore some more for sure next time."
  ]
 },
 {
  "name": "Ellenberger Park",
  "address": "5301 East St Clair Street, Indianapolis, IN 46219, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f5336550-9330-11ea-80e2-14b31f159f22.png",
  "tags": [
   "walking",
   "field",
   "food",
   "nature",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6149462055678068278",
  "source": "GoogleMaps",
  "reviews": [
   "This is a wonderful park for all ages. It has multiple playgrounds and a nice walking trail.",
   "All great but the Garden Club ruins the atmosphere by giving the ok to drive all over the park and use it for a parking lot. Food trucks every week under trees and damaging roots! There is a parking lot and Football field meant for high use. Really Rude. Disrespectful to the nature areas and the adjacent neighbors.",
   "Cool park. Could use a bit more playground fun stuff. Decent place for a walk.",
   "I wish there was more to do. But a nice park and the only one in the area.",
   "Normally enjoy going to the park. It's always clean. Well kept. Didn't enjoy it so much today. My daughter's purse was stolen at the park today. We didn't bother calling the police because there was no need to because they'll never find it anyway. Suggest to everyone they not carry a purse with them to the park or anything of value. Was snatched right off the picnic table."
  ]
 },
 {
  "name": "Bluebeard",
  "address": "653 Virginia Ave, Indianapolis, IN 46203, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f57eed8c-9330-11ea-bbea-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "delicious",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10647146825844442598",
  "source": "GoogleMaps",
  "reviews": [
   "I've been here only twice in the past 2 years. I should visit more often when I'm in Indy! Food here is always excellent. Sure, I probably couldn't recite back everything that was in it, but it always meshes well together. Highly recommended!",
   "One of the best dining experiences my wife and I have ever had...each time we go.  Have not had a bad dish, nor a bad cocktail at this establishment.  The atmosphere is busy, but it's a small space that gives you an excellent meal and overall experience.  Thanks for bringing high quality food, drink and service to Indy!",
   "Their crafted cocktails were very delicious we sampled a lot of different ones while there. I had the Reverend Palmer, Buffalo Trace with lemon and angostura. A lovely sweetish version of a Manhattan. So smooth, loved it.\n I picked to eat off of the Savor Menu: Beet Salad, Rigatoni , Buttermilk Bread Pudding.\nMy sister and friend ate the Savor menu with the Salmon. My brother-in-law had the octopus on toast. All of the food was wonderfully crafted the flavors were delicious portion sizes just right. I really enjoyed the ingredients in the beet salad I hope they make that a part of their regular options. It took a really long time for us to get our dessert from the prefix menu. That was the only disappointing part of our experience, having to wait so long for a desert.",
   "Great food. We had wings and a tuna sandwich. The wings were very good but I was skeptical of the tuna sandwich at a strip mall bar but let me tell you, it was EXCELLENT. The bartender was nice and had good customer service skills. It's a fun place with lots of locals. Great place for a rainy evening after we finished shopping.",
   "Great place! Food was great and innovative. Service was very attentive! Definitely a must-go when in Indy."
  ]
 },
 {
  "name": "Tinker Street",
  "address": "402 E 16th St, Indianapolis, IN 46202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f5c62ffa-9330-11ea-a836-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14418622642000098923",
  "source": "GoogleMaps",
  "reviews": [
   "Another Indy Gem!\n\nWhat a great experience. From the select list of local cocktails to an exceptional menu which is served with almost flawless service and attention.\n\nEven though we did not have a reservation, after a decent wait, we were seated with typical charming mid-western hospitality.\n\nThe Pork Belly was truly exceptional. But please don't get this is you are not into very bold, very rich, intense flavors. If you are into this, then this is executed to perfection.\n\nThis is definitely a cozy place with some tight quarters but well worth it. \n\nWill definitely be going back to try other items on the menu.",
   "Excellent place for a variety of fresh food. Delicious seasonal cocktails. The hamburger and pork belly are appropriately portioned and flavorful. Dishes are great for sharing so you can try many things. It is fairly small so make reservations. Wait staff is attentive and welcoming.",
   "Amazing food and service! We especially loved the raw oyster appetizer, pork belly entree, and monkey bread dessert. The mignonette on the oysters was perfectly balanced. The pork belly was crispy, slightly spicy, and full of umami flavor. The monkey bread was buttery and sweet with a cinnamon flavor. Our server was attentive and had several suggestions since it was our first time dining there.\n\nThe only dish we didn’t absolutely love was the chicken and caviar. The hoecake was a bit dry and could’ve used some more sauce. The caviar seemed like an afterthought and the flavor of it was overpowered by the fried chicken. That being said, the fried chicken itself was AMAZING. Crunchy on the outside, moist on the inside...one of the best pieces of fried chicken thighs I’ve had. We’ll definitely be returning!",
   "Had an AMAZING dinner here! Loved the touch of the Tinker Toast to start off the meal. Each dish we had was delicious — we were so sad we couldn’t try dessert, too (had to make a pick up at the airport). The service was great, the food was better, and the ambiance was spot on. Even though we were seated outside, it was covered, adequately heated, and they provided a fleece blanket. Will definitely come back here when I visit again!",
   "Love this place.  Service is always outstanding and the food is consistent and delicious.  I love the fact that you can now make reservations.  The wine list is reasonably priced compared to the lame, chain steakhouses in Indianapolis.  A complimentary shot of sparkling wine before your meal is always a plus."
  ]
 },
 {
  "name": "Harry & Izzy's",
  "address": "153 Illinois St, Indianapolis, IN 46225, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f61f9ac0-9330-11ea-b1bc-14b31f159f22.png",
  "tags": [
   "sampling",
   "food",
   "delicious",
   "kids",
   "eat",
   "food",
   "eat",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=9933615174327344328",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for lunch! Go early so you won't ruin your dinner because you will have to get the shrimp cocktail and plenty of food to follow. Fantastic service and white table cloth tables for lunch. If the sliders are offered it is a great way to get a sampling of multiple tastes on one plate.  The French onion soup tastes like it should when served by a kitchen that has great beef available for the stock. Served in a crock with plenty of crusty topped cheese. Beginning to end a wonderful experience for all your senses.",
   "We love Harry & Izzy's because even though the atmosphere is laid back, the service is still \"high end\" thanks to polite, friendly, capable, uniformed staff.  The location is easy to get to.  Easily find your own parking or use the valet.  And the food is friggin' delicious.  I could eat nothing but the slab bacon appetizer and be perfectly happy.  Harry & Izzy's has become our anniversary tradition every September.  The kids love it just as much as my wife and I do.",
   "An Indianapolis institution.  Try your best to get a meal in here during any trip to the city, and always (always!) start off with a Shrimp cocktail. If you have any eaters who don't enjoy a weighty hunk of beef, the non-steak options here, such as the prime rib pizza, are also great.",
   "Absolutely divine. Cannot wait to go back again. It can get a little loud, but the atmosphere is so eclectic and it makes you feel as if you've gone back in time! The service and staff are so kind and welcoming and extremely helpful when you can't decide what goodness to eat! Absolute treat.",
   "Harry & Izzy's is a wonderful spot. My boyfriend and I brought our families here for them to meet each other and they gave us a private room without evening having to ask. We had the best time and the servers were outstanding. The lunch special steak sliders were delicious. We'll be back."
  ]
 },
 {
  "name": "St. Elmo Steak House",
  "address": "127 Illinois St, Indianapolis, IN 46225, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f66be63e-9330-11ea-aa55-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5530210054281842358",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I had a wonderful experience at St. Elmo’s. We went on a Sunday when they had a special Sunday evening meal. I enjoyed the trout with crab on top and my husband enjoyed the steak. He said they may be the best steak he had tasted! Our server, Calvin, was superb. The food was perfectly flavorful and we both left feeling full. We were both happy with our wine and the wine selection is amazing. We made reservations and enjoyed the ease of coming in with our table ready for us.",
   "Step back in time to an old school high end steak house. The service is amazing. The steaks are fantastic too. But the star is the famous shrimp cocktail with ho.e made sauce. They fresh grind fresh horse radish daily and the kick of heat from the sauce will make you tear up. A must try if you are in Indy!",
   "Very expensive. \n\nSteak was tender but dry and had no flavor. My wife's chicken was very good. \n\nThe steak was not worth the $60 a person in my opinion. Jumbo shrimp and cocktail sauce was good but again $2 per piece of shrimp was too high priced for my taste buds.\n\nNice atmosphere, very clean, quick friendly service, wait staff in tuxedos when we walked in should have been my clue it was going to be way more than I would typically spend.",
   "There are a lot of great steak houses in this world but St. Elmo is definitely one of them. Wonderful food in a wonderful atmosphere served by professionals is always a winning combination. I always get a shrimp cocktail to clean my sinuses before enjoying the veal chop with grilled onions.  Have never had a bad experience or regret over how much I spent which is always a lot!",
   "Good steak house but I've had better. Got the new York strip steak and its not as tender as I'm used to. Just it was still very good and cooked perfectly (I ordered medium). The famous shrimp cocktail is VERY heavy on the horseradish so be ready for that. Ordered the black berry Moscow mule, not enough ginger beer but still pretty good."
  ]
 },
 {
  "name": "Nada",
  "address": "11 W Maryland St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f6b28da4-9330-11ea-adfc-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "food",
   "delicious",
   "family",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17859776714715600177",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I visited Indy for the first time and our hotel recommend Nada but under sold it as just a taco place. I'm glad we went for it! We ordered the chips and salsa trio which includes mild, medium and spicy salsas. I'm not typically a spicy salsa girl but this was one of the best salsas I've ever tried. I'm still trying to figure out if I can replicate it at home. \n\nFor the entrees, I ordered the braised chicken enchiladas. I loved the presentation in the cast iron skillet and the surprise of couscous. It had the right amount of heat and creaminess. My husband orders steak fajitas at every Mexican restaurant we visit. The beef was tender and full of flavor. His only complaint was he wanted more of the poblano peppers and less liquid in the skillet. Although he would have preferred flour tortillas (there were out at 8 pm on a Sunday, totally understandable), the corn tortilla were the perfect size and tasted great.",
   "Nada is a small upbeat downtown Mexican restaurant.  It serves authentic dishes in just the right portion with aesthetic presentation. The ambiance is contemporary  yet has a definite south of the border vibe. The wait staff although young, were efficient and accommodating. We were served promptly and the food was delicious.  Everyone was a fan of the homemade guacamole which we eagerly shared with the freshly made corn tortilla chips. My grandson recommended it, and we all liked it well enough that we plan to return. There is free on the street parking, although you may have to circle the block a time or two. Try it, you will agree, their food is on point!",
   "Food was incredible. Get the pork belly tacos, you won’t regret it. Everything we tried was delicious, including the dessert. Ambiance was lovely- great place for a date, though we went as a family to meet up with an in-town relative. Manager Steve was attentive and kind. Would definitely go again!",
   "Have been here twice and the food has been great both times. Very cool environment, staff is pretty friendly. Pastor tacos are excellent as well as the Asian tacos (forget the name). My wife had a salad that she loved but the plate it came on was way way too small. Very awkward to eat. Otherwise, love this place.",
   "Very pleased with service and meal. I wasn’t quite sure about cuisine but was pleasantly surprised. I had the steak fajita and was the best I’ve ever had. I’m not a fan of beans but theirs was very good. Thank you for a great experience!"
  ]
 },
 {
  "name": "Mama Carolla's",
  "address": "1031 E 54th St, Indianapolis, IN 46220, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f709fb66-9330-11ea-b6e6-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "drink",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12639973270218740638",
  "source": "GoogleMaps",
  "reviews": [
   "// A wonderful local business that needs your support during this time! They are open for carry out 7days a week until 8pm and have A perfect pickup system in place. \n\nThe food is amazing as always. They still offer their full menu AND you can get wine/beer to go! Perfect for if you’re wanting to do a quarantine date night. They wrapped the food so it wouldn’t spill in the car and stayed warm. They do deliver in the Broad Ripple Area as well.",
   "My boyfriend took me here for Valentines dinner. I had never tried this restaurant before and was so excited when I found out we were going here. The waiters were so friendly and checked in on us frequently enough that I never had my drink empty. The wine was delicious and the food was amazing! Definitely will be coming back here for another special occasion.",
   "Really disappointed. We were recommended MC’s multiple times and were so excited to try it. Just got a carry out order of Chicken Lasagna, Buffalo Mozzarella, and eggplant spaghetti(can’t remember the name). None of it tasted good. $54 later and we didn’t finish any of it. Really really bummed out because I was so excited for this after all of the great reviews. Even the salad was watery. Currently eating cereal. I wanted this to be our Italian spot!",
   "There's a reason this place is busy throughout the week. The food is delicious and the place is lovely. It's also much bigger than I thought and it was still packed. Great spot for special occasion dinners. The food does take time though so make sure you get an appetizer so you're not famished by the time your mains arrive.",
   "Was recommended by a friend after searching high and low for some edible Italian food in Indianapolis.  Lo and behold, it does exist!  Most of the other places can't even cook proper spaghetti and Mama Carolla's can compete with the best of them in New York.  They don't take reservations so be prepared to wait, but it is so worth it (and you'll be salivating by the time they seat you, the smells are so good).  I had the manicotti and my dad had the chicken picatta.  I'm always a pasta person, and I wish I'd gotten the chicken, so tender and lemony it was.  And the building itself is so charming and feels like it could be in the Italian countryside if you don't look too closely."
  ]
 },
 {
  "name": "Ruth's Chris Steak House",
  "address": "45 S Illinois St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f74dbb74-9330-11ea-84aa-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10720782273341578346",
  "source": "GoogleMaps",
  "reviews": [
   "Um our waiter saved the night because he was awesome!!!!!!!!!! However I was not really impressed with the steak and lobster... to be honest me and my wife loved the crab cake and bread better than everything else. That's why I thought it was a bad!! Then to not mention we was pushed to a terrible seating and we was not happy but we rolled with it. But I think for $200... I could have went to a better place for better food. But our waiter and his helper helped us stay. I really hate to leave this \nPost but for spending that kind of money I expected better food not mention we wanted porterhouse for 2 and they was out. Come one they should have known.",
   "Amazing experience. From the waiters to the manager who would occasionally check in and the kitchen staff, everything went wonderfully. The Lobster Mac and cheese is awesome and it's so much it feed a table of three. And the cheesecake was amazing as well. All in All 10/10. Can't wait for next time",
   "Lined their pockets with $20 million of taxpayer money intended to bail out small businesses. Shamelessly. Order quarantine takeout from someone who didn’t get that money. And also someone who is steaks aren’t as dry and bland.",
   "Birthday Dinner was outstanding. Kendall, Justice and Victoria took care of us. I would dare say this was the complete experience- not just a meal. Enjoy",
   "Our server Victoria made the night the best it could have been. Three of the four of us that went had never been. She fully explained everything to us and even helped us narrow down what we wanted. The food was AMAZING! The steak was so tender it almost melted in your mouth. The lobster mac and cheese was the die for!! Price was very expressive but well worth the food!(:"
  ]
 },
 {
  "name": "Seasons 52 - Takeout & Delivery Available",
  "address": "8650 Keystone Crossing, Indianapolis, IN 46240, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f798a7d2-9330-11ea-855f-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "free",
   "food",
   "delicious",
   "drink",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=2727870057983804846",
  "source": "GoogleMaps",
  "reviews": [
   "Expanded our culinary bubble by visiting this location for a date night and was pleasantly surprised with the results! I've never heard of Seasons 52 previously and only found it from a Google Maps suggestion. A very nice deal is the menus include \"popular\" item markings and rightfully so, as that's all we ordered and it was delicious. Reservations recommended to avoid sitting on an awkward waiting list.",
   "They got us in for a dinner reservation on Valentine's day for the same night. They stayed open past their usual hours so couples could continue to enjoy themselves. The wait staff and chefs are very knowledgeable about allergies and they have some specific allergy-friendly menus. The management came by at the end and was very receptive to some ideas about allergy free desserts they could carry. The valet was incredibly pleasant and eager, even on a busy night while out in the freezing cold. All around great experience!!!",
   "We had a larger private dining experience at Seasons 52 and they did not disappoint. We were very late but their team was so incredible! Taylor Wright was awesome to work with. She was meticulous and was super helpful in planning everything - from the menu to the invoice - everything was great. We also had 2 amazing servers - Mark and Andy. They were awesome! They took care of us and went above and beyond. They were so kind and pleasant and all the guests had great things to say about the food and the service.\nThank you Taylor, Mark and Andy!\nYou guys are awesome and we will be back!",
   "We had lunch with friends yesterday and we enjoy Seasons 52 so much, the food is delicious and the atmosphere is wonderful but our service was very poor. We had a reservation and were seated on time but did not have anyone come to our table for 15 minutes. There seemed to be adequate staff but no one came to even take drink orders. Our reservation was for 1:00 pm and we didn’t get our food until 2:05. The young lady who was our waitress was very nice but I was very disappointed in the service we received.",
   "Always excellent. Delicious Chilean Sea Bass... soft, moist, sweet... just like it should be. The Split Pea and Kale soup was a wonderful surprise. Thick full soup, great croutons with hint of olive oil flavor... perfect for the cold snowy weather!"
  ]
 },
 {
  "name": "Iozzo's Garden of Italy",
  "address": "946 S Meridian St, Indianapolis, IN 46225, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f7dfc4f0-9330-11ea-b126-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14892974089239230401",
  "source": "GoogleMaps",
  "reviews": [
   "I had such a heart warming experience. The day before my husband and I eloped, he had the set up the perfect spot to propose to me. Everyone was so welcoming and engaged. I absolutely loved the food and service. It was PERFECT. We’ll definitely try making it here once a year, since we’re from out of town. Thank you all for helping me feel like a princess that day! 💖",
   "This place was incredible! I wasn't sure about it based on the unassuming name, but I was very pleasantly surprised. I loved the risotto and my wife was raving over the truffle fettuccine. Pricing and portions were fine, atmosphere was calm and enjoyable. Looked like a decent beer and wine selection. We will definitely be back for a date night.",
   "What a magical place!  Kristin is the best bartender (and if she isn't a manager, she certainly is a leader).  The stuffed mushrooms were divine, and the lasagna lived up to hype.  Try the fried ravioli!  The staff is extremely friendly and they even box up your left overs.  The home made salad dressings are amazing.  Come for dinner, a date, or a special occasion.",
   "Absolutely LOVED this place! The atmosphere was incredible, the place was clean, and the staff were all incredibly friendly. I cannot wait to go back, and that's not even taking into account how delicious the food was. I found myself trying to decide between 3 different entrees, and the waiter (Gregory) suggested the sausage and peppers. The bread that came out was warm and delicious and the salad had the just right amount of dressing. The appetizer came out really quick and was spot on. The entree was so good I could have had it twice! \n\nOverall I had an incredible experience and I would love to return!",
   "Atmosphere was great. We dined in the outdoor area. The service was outstanding.  I really enjoyed the house salad,  the toasted ravioli appetizer, and the miniature cannolis for dessert. I ordered the lasagna for my main entree, but I was not impressed  with it.  Overall it was a nice experience except for the entree."
  ]
 },
 {
  "name": "Delicia",
  "address": "5215 N College Ave, Indianapolis, IN 46220, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f8262040-9330-11ea-8ff7-14b31f159f22.png",
  "tags": [
   "delicious",
   "kids",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11198684589814823770",
  "source": "GoogleMaps",
  "reviews": [
   "Great ambiance and really good service. The guacamole was delicious and the drinks were tasty as well. The brunch is tasty and so is dinner. Great place for groups but definitely a great date place.",
   "One of my favorites in south broad ripple area. It has great food, great drinks, great atmosphere, and great service. I have been here to meet with friends, with kids, and on a date. It is a versatile place. I love the Fire 'n Ice, a spicy cocktail. Overall, a restaurant worth a few extra bucks. The only thing is their limited parking but you can always find street parking in this area.",
   "I’ve been here a couple of times. The food is always tasty. Unfortunately, this last time service wasn’t that great. We sat at the bar and were practically ignored. Every time we needed something we had to wave the bartender down because he hardly checked on us. When he did, he wasn’t very friendly and when he messed up our order, he spent what I felt was too long trying to prove it was our fault instead of just making it better.",
   "Great food. Great drinks. Great atmosphere. Attentive servers. Will definitely be coming back for date night.",
   "Very nice restaurant with friendly staff. Food was good and the restaurant was clean. Our waiter was very attentive and helpful. Great experience"
  ]
 },
 {
  "name": "Café Patachou",
  "address": "225 W Washington St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f86c9f14-9330-11ea-90e7-14b31f159f22.png",
  "tags": [
   "free",
   "eat",
   "food",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16345905522886764450",
  "source": "GoogleMaps",
  "reviews": [
   "Tried this place based on a recommendation. It was decent. I had the chicken salad sandwich. It was good but nothing exceptional. They seem to offer a large variety of vegan and gluten free options which was important to some members of our party. They seemed to enjoy their meal as well.",
   "I absolutely love Cafe Patachou!!! Dee-lish-us!!!!! This is one of my all-time favorite restaurants and one that I suggest often. The amount of food is reasonable for the price, and the quality is top-notch. Their ingredients are obviously high quality and make even the simple menu items taste amazing. It's just simply good! Their omelettes are flavorful and about dang near perfect. Their French toast is heavenly. And their regular cinnamon toast is questionably fantastic......like they have some of secret recipe. Even their little lightly dressed greens are wonderful! And their coffee is some of the best I've had. If I lived closer, I would eat here every day.......for multiple meals. Go out of your way for this place! Totally worth it!",
   "I had the combination half sandwich and half soup.  I opted for the chicken salad sandwich in a croissant and the tomato artichoke soup.  For the side, I chose the chips, which were decent.  My sandwich was quite good on the croissant.  I'm glad I went with it.  My soup was a little on the salty side, but was tasty and very tomatoey, if you know what I mean.  Service was great.  I didn't wait too long for my order to arrive. My waitress was very attentive and friendly.   Also, in terms of the menu, they do have quite a selection to choose from. The normal portion sizes look filling enough as I looked at what other guests around me have ordered.  Overall, my experience was good here.  Worth a try!",
   "My waiter was extremely nice and helpful (Dylan, not sure on the spelling). It has a perfect location of both city viewing and sitting outdoors. I had the Cuban breakfast and it was stellar. I did find out that I could add many things to it and I highly recommend adding another egg and possibly another meat, like bacon or ham. I also consumed the kids French toast meal and that was excellent (especially as a little dessert size for breakfast). The crisp on the edges of the bread was a wonderful touch. My fruit cup consisted of apple, pineapple, strawberry, and orange. The coffee was fresh and delightful. I will definitely be coming back again for at minimum, the breakfast. I can only imagine that lunch would be delectable 💕",
   "The food was amazing, the service was fast didn’t even use all the time at the meter. My girlfriend and I really enjoyed it. The best breakfast your going to get in this area, and bang for your buck. The hot chocolate was A+. We are energized to take on the day. We will be back for sure."
  ]
 },
 {
  "name": "Fogo de Chão Brazilian Steakhouse",
  "address": "117 E Washington St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f8b9fc26-9330-11ea-8812-14b31f159f22.png",
  "tags": [
   "unique",
   "delicious",
   "food",
   "drink",
   "eat",
   "food",
   "free",
   "music"
  ],
  "link": "https://maps.google.com/?cid=7540133964019751775",
  "source": "GoogleMaps",
  "reviews": [
   "This place is simply amazing!  I’d never had anything like it. It starts off with an amazing salad bar, but don’t get too full!  There’s a parade of people marching around with every kind of grilled meat you can think of! It’s never ending. Drinks too!  This is one of the most unique and fun places I’ve ever eaten at!  I think it’s time to come back!",
   "Went for the first time during Devour Indy and it was amazing! Our server Shaun was outstanding and very attentive. The cuts of meat that we got were always cooked to perfection! We unfortunately didn't get to taste all the options that were available, but what we did get was outstanding. The cocktails also very well made! Definitely will be back!",
   "Excellent food and experience.  The salad bar in itself would be a great meal.  So many  healthy items, but the table service with all of the delicious meats was my favorite.  Had reservations for 5 p.m. when they opened for dinner and was seated and eating within 15 minutes. I will definitely return!",
   "Went here for my husband's birthday with friends and mother in law. Had great service the first 20 minutes there and was constantly asked if we had been helped and ordered. Friends showed up 25 minutes late and we were never revisited by the waitress for refills OR to ask our friends what they wanted to order and drink. An employee making drinks at a rolling bar asked us if we wanted a special drink and we said yes and also if our friends could get a water glass at the very least. They were only served the mixed drink and never brought anything else. The chips you flip over for more food were already at the table so they got to eat food but no drinks for them. Zero stars for service but 2 for the food since it actually was great. The steaks were the only  good part of it.  Sides and salsd bar were not seasoned and old.",
   "We went for our anniversary dinner and they gave us a free dessert with happy anniversary written on it. Lovely place for a romantic dinner. \n\nOnly wish the music would have been turned down a bit, so I could hear some of the people bringing the meat around. Still pleased with the overall experience though."
  ]
 },
 {
  "name": "The Capital Grille - Curbside Takeout & Delivery",
  "address": "40 W Washington St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f90598ae-9330-11ea-8c4d-14b31f159f22.png",
  "tags": [
   "creative",
   "performance",
   "walk",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8974377579335597882",
  "source": "GoogleMaps",
  "reviews": [
   "Jordan provided outstanding performance, if not, The Capital Grille may have received only two stars.\n\nThe best serving was the appetizer.  A nicely done sauce but the shrimp and the bread were both over cooked and difficult to cut even with a butter knife.\n\nThe lobster bisque was average at best and lacked flavor.\n\nThe medium rare steak was more rare than medium. The lobster lacked flavor.\n\nThe cream spinach was so overly salted we sent it back.  We were told that the chef agreed that it was over salted and asked if we wanted something else.   We were puzzled that the chef didn’t taste it before it left the kitchen.\n\nThey did have a nice stirring stick that was covered with sugar crystals that was very creative.\n\nThe cream and strawberries were ok.\n\nAt the expense we probably will look elsewhere on our next trip as we were disappointed with the cuisine.  Once again, the service was fantastic but the culinary experience was lacking.",
   "This restaurant is so good. It's definitely pricey however the service from the moment we walked in the door, to when we left was exceptional. The dessert was amazing😍. I suggest to park in the mall garage and save on valet parking, it's just a short walk. My husband and I went here for our anniversary and they set up our table with rose petals. ♥️♥️♥️ It truly made our evening special. Thanks Capitol Grille for making our night perfect.",
   "This place is awesome. My first time visiting. At first glance at prices I thought \"a little pricey\". But portions were large and the food was excellent.  We also loved the Burbon.  We will visit again for sure.  Next time we must save room for dessert.  Also the restaurant was extremely clean and the ambiance was perfect.  Highly recommended!!!",
   "Pricey. Good service and good food. Wide variety of patrons. Dress code varies but majority were nice shirt jeans some men added a blazer but not all. Call for a reservation if you want a booth. Good for date night especially if you add a staycation with attached Conrad Hilton.",
   "This is one of the better Capital Grille’s I’ve been to. Service was outstanding and incredibly attentive. The ahi tuna was prepared to perfection. The soy glazed Brussels sprouts were also exceptional."
  ]
 },
 {
  "name": "Yolk - City Way",
  "address": "220 E South St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f94f249e-9330-11ea-b408-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "knowledgeable",
   "eat",
   "food",
   "eat",
   "food",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=9761618192975899352",
  "source": "GoogleMaps",
  "reviews": [
   "Holy cow — that cinnamon roll French toast! All the sweet breakfast options I’ve tried here are truly amazing. From the nutty monkey cakes to the red velvet French toast, they’re all rich, decadent and delicious. There’s even a featured sweet cake that changes regularly. I also appreciate that you can have real maple syrup (for a charge) which is pretty rare. Sweet breakfasts are clearly their main thing.\n\nYet there’s still plenty of options to enjoy a healthier breakfast here. Any of the scrambles or the HUGE omelets can be made with egg whites. And there’s a great variety of veggies to add in to their dishes. \n\nAgain, they have lots of delicious fresh juices, though they’re a bit pricey. Their regular brewed coffee is not great, though it gets the job done. \n\nWe typically sit at the bar where we like interacting with the staff. Even when the place is very busy, they’re always friendly.",
   "I’ve ordered from Yolk before, usually on the circle, and it is always good quality. However, with the current situation, I am ordering online and the prices are astronomical. To build your own omelet, it’s $18.50! It costs extra to add meat, it cost extra to add cheese, it cost extra to add a side of anything (fruit, potatoes, etc). Is the quality good? Yes. Is it worth spending almost $20 for an omelette? No. I decided to go with cheaper options in the city. First Watch, Wild Eggs, and Metro Diner are cheaper and just as good with more unique options.",
   "I don’t know when I’ve had such a pleasant experience having breakfast! Everyone greeted us as we came in and showered us with attention - this is an unusual experience in Indy where customer service is not a priority. Lots of smiles. An old friend I worked with in the past \nwas our server and he was wonderful: knowledgeable and enthusiastic about the food. When you go, ask for James. \nAnd an excellent menu! Who knew there were so many ways to have breakfast? Both sweet and savory items, all of it beautifully prepared and served. Way too much food to eat in one sitting, you will want a to-go box. Worth every penny.",
   "We ordered carry out this morning. I asked for no mushrooms in my omelette, and there were mushrooms. The entire omelette tasted like citrus which was an odd flavor to have while eating eggs. It was most likely because I also chose fruit on the side. The fruit had mold on most of the grapes. I ordered an Iced chai latte. I’ve tried to order it twice now. It seems as if they do not actually know how or do not the have the ingredients to do this because I have ended up with an Iced coffee both times. \n\nMy recommendation is to order simple here. The food is good enough to eat, but trying to do more than eggs and bacon or just pancakes is too hard.",
   "i came here for my birthday while out of town and I've got to say this place is amazing. the red velvet french toast was the best ive ever had. and our waiter was so good and knowledgeable. definitely going to have to try this back in FL."
  ]
 },
 {
  "name": "OP Italian Indy",
  "address": "10 S West St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f996dc40-9330-11ea-9c4a-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=3351596421774478675",
  "source": "GoogleMaps",
  "reviews": [
   "Great atmosphere, great service, amazing food. Had the tomato braised lamb shank and it was so tender and delicious. My wife had the short rib gnocchi and she said it was absolutely wonderful. 10/10 would recommend for a special night",
   "We were there for their preview night. The new menu items that we tried were phenomenal. The drinks were just as good too!",
   "Such good food here! The chicken Caesar salad I had for lunch was awesome. Chicken was so tender! My coworkers loved the pizza. Went for dinner as well and was not disappointed. The vodka rigatoni was out of this world and my friend enjoyed the spaghetti and clams. Great service too!",
   "Everything is fabulous. I think our table ordered about a dozen different things, and I also think we would order them all again. First courses, mains, desserts—all delicious. The lemon tres leches cake was amazing, the potato tart was a revelation, and the canelones melted in our mouths. The service was friendly and attentive. We look forward to going back!",
   "Love this place— the Burrata is amazing and Colleen gave us the best service! Such a joy to be around and made us want to come back. Highly recommend!"
  ]
 },
 {
  "name": "Milktooth",
  "address": "534 Virginia Ave, Indianapolis, IN 46203, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f9e068a2-9330-11ea-8e8c-14b31f159f22.png",
  "tags": [
   "creative",
   "food",
   "music",
   "free",
   "eat",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11030962376375167288",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for an artisan breakfast, coffee and drinks! Great menu selection with everything from bacon to vegan. Short order cook style and an atmosphere that you'd expect. Up and coming neighborhood out of downtown and worth the visit and supporting places like this! You won't be disappointed.",
   "Generally pretty busy. Expect a wait for weekend brunch. The wait is made easy by a counter where you can order drinks and pastries. The food here is very creative and the atmosphere is pretty darn hip.  It's in a converted mechanics garage. The garage doors with glass panes form the front wall. Cool music playing, excellent vibe from the staff.",
   "I had the sourdough waffle and it was amazing. They put a slice of salted honey butter on top that was to die for. I could eat that butter on anything. I really enjoyed the restaurant and the atmosphere. My girlfriend had a gluten free chocolate dessert that was also very good. I recommend at least checking this place out for the food alone. If I'm in the area again I'll be back.",
   "What can I say about Milktooth besides it is the most exotic food you can find in the city. They constantly have something new, and are almost always sold out of something because of how delicious it is. Highly recommend!",
   "I used to live in Indy and frequented Milktooth because their food is spectacular. I do not exaggerate when I say it's my favorite breakfast place of all time. I recently was back for the holidays and needed to get my fix. They still got it. Their execution on the dishes is always spot on, inventive, and balanced. It is worth the wait if know good food."
  ]
 },
 {
  "name": "Bosphorus Istanbul Cafe",
  "address": "935 S East St, Indianapolis, IN 46225, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fa374dac-9330-11ea-aeec-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "eat",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17925968347466993629",
  "source": "GoogleMaps",
  "reviews": [
   "Small and wonderful little restaurant\n The food is amazing; we loved the Pita here. It was soft and we could finish the whole basket in couple of minutes. \nThey have lots of veggie options. The ambience is also pretty neat and nicely decorated.",
   "We have eaten about every restaurant downtown and this will be our new go to going forward! ABSOLUTELY AMAZING!!!! You will not be disappointed and the sample appetizer is a must have, also add a side of tzatziki sauce that they make fresh. We will be back every chance we get!!! Do not pass up an opportunity to eat here, it is a hidden gem in all of Indianapolis.",
   "I like to go with friends to this place with my warmest recommendations. I  go to this restaurant often. This recommendation is always successful. The the food there is tasty and the stuff is welcoming and cooperative. Every time  we eat in this place we have a pleasant time.  I recommend this place with pleasure.",
   "Wife asked me what I wanted to eat. Any chance I can get I choose Lamb. This time I wanted grilled. She searched and found this place. It was my first time to an Istanbul Cafe. I was skeptical after we walked in because we were asked did we have a reservation. We said no. The young lady looked at her book. It was as if she was trying to decide if she wanted us to eat there. Me recognizing the game my reaction was that we would take out. My attitude is always that people can be how they want to be. It's my choice whether or not I want to be part of it. Anyway after fumbling she found us a table close to the exit so I was able to hear if any others were entering without reservations. There were and there was no hesitation to seat them.\n\nThe waiter came forward he seemed hesitant by the look in his eyes but he was efficient. Got appetizers, came quick. Ordered humus and there were two types of egg plant appetizers we couldn't decide so he offered a half-and-half. That was awesome because he didn't have to do that. What was more awesome was the taste and the amount of dishes. So much that we asked for to go boxes. Didn't want to spoil our appetite. Right when he brought the to go boxes the entrees came. Wife had shrimp casserole and side order of spinach. My dish consisted of three medium done lamb chops with red and green bell peppers along with tomatoes. All grilled and excellent.\n\nTo end, we couldn't finish our entrees so yeah to go box was needed for my wife but I finished mine. So good we ordered entrees for each of us  and one for our son to take home. It all totalled one hundred six dollars for five entrees, two appetizers and water. Do the math. Beer and wine was available. We left a tip as we always do. Amount depends on the service and food. I can say the waiter was smiling when we left.\n\nMoral of the story is don't judge a book by its cover.  Most of us want to leave a deserving tip but because of judgement or what you've heard you give us half-a*?! service. So we give you that type of appreciation.",
   "The food is excellent here. I would recommend reservations on the weekend. Thet didn't really have a host taking done names in the lobby. We just waited in an amorphous line for the next group to be called. Nobody knew how long the wait would be. We ended up waiting for about 26 minutes. Not the worst but definitely confusing. Other than that the food and rest of the experience was top notch. (pictured is the appetizer combo)"
  ]
 },
 {
  "name": "Mimi Blue Meatballs",
  "address": "870 Massachusetts Ave, Indianapolis, IN 46202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fa83d824-9330-11ea-8967-14b31f159f22.png",
  "tags": [
   "cheap",
   "family",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=9081424977953494806",
  "source": "GoogleMaps",
  "reviews": [
   "Never had a bad meal here. Friendly staff that is well versed in the menu & good customer service. I prefer off hours when the crowds aren't so much, but honestly the noise pollution factor isn't the worst here even when they're busier. They manage to be a cozy place in one of the trendiest areas downtown, so chalk another point up for a nice meal. Probably the best turkey meatballs in Indy, too.",
   "I doubt a restaurant with “meatball” in the title is the first thing that comes to mind when you hear “brunch”, but I’d invite you to challenge that assumption and switch up your normal brunch routine with Mimi. \n\nThe pancake balls? Just the right amount of sweet, but not so much you feel guilty. Great to share. \n\nThe biscuits and gravy is a fun nod to their typical meatball cuisine, but with a flaky biscuit and perfectly seasoned breakfast sausage instead. \n\nTop it off with a peach mimosa and cup of coffee and you might just have a new go-to brunch place!",
   "I love this place. On a sunny day, grab a seat on the sidewalk. The bread for the subs is fantastically crunchy and chewy. I usually get the classic meatball with Bolognese. Make sure to get the side salad instead of the fries. Also, note to owners, double the size of the side salad that comes with the sub please :)\n\nThe sliders are either great or good but the buns are always fantastic. They are big for sliders and are definitely splittable if you want to try a few combinations!",
   "Decent food, though the meatballs seem to have shrunk since I have been there several years ago. Our family of 4 left with a $120+ bill including a couple of adult drinks and 3 desserts. Not horribly expensive but it's not too cheap for meatballs either. The food is a bit salty (especially the sauces) so you will feel parched at the end of the night after a dinner here. Atmosphere is warm albeit a little on the noisy end. I'd prefer it quieter.",
   "The meatball flights (I will forever call them that) are delicious! Lots of options to mix and match and the meatballs lived up to this Italian meatball stickler's expectations of how meatballs should be. Great job! Will definitely be back!"
  ]
 },
 {
  "name": "Oakleys Bistro",
  "address": "1464 W 86th St, Indianapolis, IN 46260, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fadad30c-9330-11ea-9403-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "unique",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3171338398952418729",
  "source": "GoogleMaps",
  "reviews": [
   "A great place for special occasions. Had a great birthday meal. Not pictured is the cheese plate we had for appetizer which was fabulous",
   "James Beard Finalist and beating Bobby Flay.  What else does a man need?\nWe celebrated a special occasion here and I would recommend others to do the same.  The atmosphere relaxes you while the food borders some of the best I've had in my life.  We have been here several times now and strive to taste the entire menu.  Indianapolis is lucky to have this gem of a place!",
   "Delicious from start to finish. The food was some of the best I’ve ever tasted, with wonderful and unique flavors and presentation. The service was top notch and the environment is incredible. One of the best spots in the Indianapolis area.",
   "Awesome food. Great service. We ordered a lot of food here and everything tasted good. A little heavy on the salt but overall taste and flavor profile was amazing. If you go there you must order shrimp corn dogs. This restaurant's chef beat Bobby flay with this dish.",
   "The famous shrimp corn dogs were amazing! Loved the flavors and presentation of the food. Great ambiance. Service was excellent."
  ]
 },
 {
  "name": "Conner’s Kitchen + Bar",
  "address": "350 W Maryland St, Indianapolis, IN 46225, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fb1718e4-9330-11ea-b38e-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9702178917564209806",
  "source": "GoogleMaps",
  "reviews": [
   "Such a nice place to eat. Food was delicious. The waitress was super friendly and the atmosphere very nice. I would definitely recommend",
   "Genevieve answered all of our questions and had excellent menu recommendations. The food was flavorful, fast, and very fresh. Any place that asks you how you would like your salmon cooked and then delivers perfectly has a place in my heart! We had the BLT deviled eggs, grilled salmon, and ooey butter cake for dessert\n\nAmbiance was good - could get loud when full but we had a good level of busyness without too much. We did not have drinks but they all looked good and we will be back to try!",
   "I'll tell ya what, we were so impressed by the food, ambiance, and most importantly the courteous and genuinely helpful suggestions by Rachel L. tonight that it was worth our time to come by twice for food and drinks. Both times, Rachel L. was friendly and kind, she really made our experience an unforgettable one. \n\nFirst course of roasted Brussel sprouts was probably the most delectable way that I've ever had them cooked. So tender, so perfect, slightly sweet, punctuated by crunches of nuts. Oh so yummy! Highly recommend the sprouts.",
   "Food was good. Pictured is smoked turkey salad (no onion). Brussels sprouts HAD fried onions on them (not discussed on the menu). I identified my gluten allergy. So they took the sprouts from the table (rather than letting other 3 people eat some) (even though I tried to stop that). They later brought out remake of the sprouts with rest of meal (after appetizers were long gone), and then still charged full price. At the end of the meal,  we had only tried 3 of the sprouts--they were obviously uneaten. Disappointed when restaurants do stuff like that.",
   "Came here to have dinner before an IRT show. Had the BLT Deviled eggs, got portion to share with two people. Had the Cheesy Chicken Enchilada, what a great taste. Server, Genevieve, was amazing with hospitality and dinning recommendation. Would recommend to anyone in the area to give it a try and ask for Genevieve as your server. Thanks for an amazing dinner before the IRT show tonight!"
  ]
 },
 {
  "name": "Rook",
  "address": "501 Virginia Ave #101, Indianapolis, IN 46203, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fb5f32ee-9330-11ea-b475-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "unique",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15278363827865208085",
  "source": "GoogleMaps",
  "reviews": [
   "I always enjoy my time at Rook. The food is well seasoned, thoughtful and delicious. The space itself is always super clean.  They have a  great bar selection, excellent location and unrivaled hip hop/ rap playlist. I recommend the dan dan noodles for dinner or the chicken karrage bowl for lunch.",
   "For what it is, it is great. Solid friendly service. The food is heavy but delicious. The giant pork roast is so good. Even the crazy shake dessert was good. Enjoyed the meal and unique food",
   "Service is great! \n\nWhen it comes to the food and decoration, it just doesn’t have the wow factor I was hoping for. For the price point ($20/ dinner entree), I was hoping for more a fusion of other flavor/aroma/texture/plating  than what I can get at a typical Asian restaurant. It fell short in this area.",
   "Rook is trying, but perhaps a little too hard. The chicken thigh dish had the makings of a great southern and Asian fused dish, but unfortunately it didn’t quite come together. The breading just slipped off. The fried avocado and steamed buns were decent but nothing I’d have to have again, and then finally, the shrimp and toast was just a mix of odd flavors that didn’t mesh well. Additionally, the toast was burnt. Finally, the cocktails were pretty basic for a fusion restaurant.",
   "I was here on a business trip with a colleague and he suggested it. All of our food was very good, our waiter was very personable and offered us suggestions when we told him we were out of town. Our service was good, and the place was clean. If I were back in town I would come again"
  ]
 },
 {
  "name": "High Velocity",
  "address": "10 S West St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fba2ba2e-9330-11ea-bcd6-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16395280122878177801",
  "source": "GoogleMaps",
  "reviews": [
   "4pm Tuesday no wait, service attentive to a fault, very friendly.  Salmon BLT fresh ingredients, lightly seasoned recommend.  Sweet potato fries were crisp, everything top quality.  Pineapple Express great for summer.  Worth the price.",
   "Came here for a light dinner prior to going across the street for an Indians Baseball game. Good food, drinks and service, nice looking clean place that offers two separate bar areas to hang out in and tv’s everywhere.",
   "Great food and great sports atmosphere!  Comfortable seating and open floor.  Tables have adequate space to move around and not bunched up.  Really enjoy the views of town through the windows.  Ordered an order of pretzels and wings as appetizers and beef short rib sandwich and Reuben sandwich with fries as our entrees.  Great food without the pressure of eating fast.  Took in the Pack and Bears game.  I thought prices we're reasonable for a hotel located dining option.",
   "Our Server John F is the man! Very personable person and a joy too be around! Great at his job and he runs circles around the other staff with ease!!! If i could have a server like this every meal id never eat at home again 😂. Oh yeah Food was good too 👍",
   "My husband and I were visiting Indianapolis for a convention and stayed in a hotel adjacent to High Velocity. We walked over using the Skywalk from our hotel which was very convenient. High Velocity seated us quickly and our waiter, John, was one of the friendliest people I have ever met in the food service industry! He gave us food recommendations and was prompt with drink refills; but he also went above and beyond and found us a map of things to do in Indianapolis when we mentioned we were visiting from St. Louis. The food was excellent - worth the higher dollar amount. We shared an appetizer of pretzels with beer cheese. The pretzels were soft and fresh and the cheese had a good flavor. I had the salmon plate and subbed sweat potato fries for the rice. The salmon was some of the best salmon I've ever had; tender and flavorful. The asparagus was cooked perfectly - not overdone or mushy. The sweet potato fries were just the right flavor to go with the salmon. My husband had the chicken tenders plate with fries and he said the chicken was fresh and soft; not over-fried or rubbery. The atmosphere was pleasant, especially for a sports bar. It wasn't overly crowded or loud. There were TVs at booths that you could select your channel and volume, but there were also TVs on the walls and pillars to watch if you were placed at a table that didn't have its own TV. Overall, great experience and we would go again."
  ]
 },
 {
  "name": "Late Harvest Kitchen",
  "address": "8605 River Crossing Blvd, Indianapolis, IN 46240, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fbf82ee8-9330-11ea-8dbc-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "food",
   "knowledgeable",
   "food",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8702657962076628194",
  "source": "GoogleMaps",
  "reviews": [
   "What can I say? Intimate and cozy restaurant and bar. Our waiter was Phenomenal! Knowledgeable about the menu, excited to have us taste the food and always seemed to anticipate our next need. The food was seasoned to perfection and what a unique and delicious menu. This was a special treat. Perfect for date night, Girls night out, Anniversary or Birthday. Trust me, you cant go wrong!!",
   "First class service and food. Had the filet minon which was prepared perfectly. Also had the calamari as an appetizer and veggies and potatoes side dishes. All of the dishes were seasoned and presented well. Our server was very attentive. Great experience and highly recommend!",
   "My favorite is the dessert: sticky toffee pudding !! It's crazy that i'm usually not a dessert person, but this dish melts my taste bud :D. Their pork chop is the best, also complimentary bread is upon request - make sure you ask for that :) small menu but they change it often, so definitely will not get bored here. Laid back service but quality!!!",
   "Amazing food. Chef owned and operated (so I'm told!). Seriously great food. Stop in. You won't be disappointed.",
   "Great food, but a bit pricey hence the 4 vs. 5 stars.  Staff was attentive.  Cocktails were very good, but very pricey. Recommend the blueberry drink."
  ]
 },
 {
  "name": "The Rathskeller",
  "address": "401 E Michigan St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fc42cdde-9330-11ea-be69-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "food",
   "food",
   "walking",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16818672812576174385",
  "source": "GoogleMaps",
  "reviews": [
   "We had an incredible experience here.\n\nFor starters, the pretzel and horseradish mustard were amazing... be aware that the horseradish is VERY intense.\n\nThe stuffed mushrooms were rich and cheesy!\n\nThe potato salad was one of the most flavorful things I've eaten in a long time!\n\nThe bacon wrapped New York strip was... bacon-wrapped - need I say more?!?\n\nAnd the German chocolate cheesecake was mind-boggling delicious.\n\nAdd to this the traditional German atmosphere and you have a place that totally lives up to the hype!",
   "Food is authentic and very good, as is the service. Our German exchange student vouched for the quality and said it was excellent.  You wont leave hungry.  I love this place! Such a unique historical building and location to dine on authentic German cuisine.",
   "Went to watch a couple bands Hot Pockets & Jukebox Luke both were very good! You should catch them anytime they are in town! Was very impressed with the atmosphere, absolutely amazing old building. We've been on the Keto diet but found a great Greek salad on the bar menu & hard liquor with diet coke rounded out the evening! They also a have restaurant with a full menu, food looked good! Parking is the only draw back. All we found was on street parking with meters, but if you circle a time or two someone is always leaving so it doesn't take long to find a spot. Maximum walking distance 1 1/2 to 2 blocks. Well worth the trip!",
   "The Rathskeller biergarten is THE PLACE to be on a weekend night on Mass Ave. The live music goes until 11pm and is always fun.  If you can get there early to claim an outdoor picnic table for your group that is a plus. If you don't have a table, it is still an awesome time.",
   "This is a very nice restaurant. It's really big and sort of underground, but it's no less spectacular and beautiful. Tonight was my first time coming here and they dressed up it for Christmas. Very pretty and romantic. Now, on to the food. Firstly, I strongly warn against the spicy mustard. I thought it was some kind of butter and was very unpleasantly surprised when I tried it with the bread. It made me tear up. Unless you like spicy stuff, then I would strongly advise you to stick with the butter. Other than, the food was very good. They offer both American and German cuisine. I'd recommend going with the German for a truly authentic experience."
  ]
 },
 {
  "name": "India Garden",
  "address": "207 N Delaware St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fc879f4c-9330-11ea-8192-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "family",
   "cheap",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18137497823697008536",
  "source": "GoogleMaps",
  "reviews": [
   "Food is OK by American Indian food standard, and delivery is fast enough. however there's simply not enough meat. I ordered $45 and finished all but still feel like not enough meat, and I actually asked them for more meat with less rice. I'm 150lbs and 2 big macs would be good enough for me so you can imagine how little meat was there. finally no napkin at all. 2 stars for the taste but that's it, sorry.",
   "Ordered from doordash, hardly any meat in the curry and the taste was so sweet it was not able to eat to food. This place has gone down hill very fast. Would not recommend them.",
   "If I could rate zero stars I would purely on the service here. They are extremely rude and talk bad about their customers. My husband caught them talking about him in their language which is unacceptable whenever we are paying them for a service. They should be happy that people pay for their non authentic garbage! There are other Indian restaurants in Indy that better deserve the attention this place gets. Overall, this restaurant is not worth the money, time, nor the poor experience",
   "The menu and service were beyond our expectations. I surely enjoyed the ambience of this spot. First-rate restaurant to take the family out for lunch.",
   "Bad food, rude owners and no free parking. I ordered Navratan Korma and got boiled vegetables with little bit of herbs added to it. Very disgusting and cheap. We also heard the owners trash talk about their customers when we were waiting for our order to take out. There are much better restaurants around. Do yourself some favor and avoid this place. I won’t be returning back here for sure."
  ]
 },
 {
  "name": "Tony's of Indianapolis",
  "address": "110 W Washington St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fcd1f090-9330-11ea-8286-14b31f159f22.png",
  "tags": [
   "learn",
   "family",
   "food",
   "music",
   "food",
   "family",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13515589511527413503",
  "source": "GoogleMaps",
  "reviews": [
   "We chose Tony's for a special birthday treat and we were not let down at all. I've traveled the US and ate at so many steakhouses, but I am simply at a loss for words at how AMAZING the food was. I had an inch thick Ney York Strip that was PERFECT all the way through. Me fiance had the bone in ribeye that was beyond compare! Highly recommend the truffle wedges as a side(which feed 2-4 people). They were crispy, fluffy potato wedges of heaven.  The staff was always ready to help and make sure everything was perfect. Also a special occasion was that the owner, Tony, was there! He personally spoke with every guest and interacted one on one with his staff to make sure there was a flawless execution and presentation.  There were 2 other managers who were also monitoring the atmosphere of the restaurant, the amazing live music, and the customer experience as well. both Tony and the two managers took time to know our names and speak with us momentarily while we ate, and also took time to learn our birthdays and wish my fiance a happy birthday.  Never had such an amazing experience at any restaurant of any kind let alone a steakhouse. Would recommend this to any friends, family or stranger.  Worth every penny!! We will definitely be life long patrons!",
   "This restaurant was recommended to me by a business man who frequents Indianapolis.  It was the best recommendation I have ever received.  Fantastic food.  Fantastic service.  Fantastic decor.   The prices are appropriate for the quality of the restaurant.",
   "After my third time dining at Tony’s I thought I would leave a review. Every time there has been absolutely amazing. Steaks are great and the sweet potatoes are to die for. They truly treat you as family there, and I look forward to dining there again. BEST STEAKHOUSE IN INDIANAPOLIS",
   "This is a true dining experience. The crab cake is out of this world, the braised short ribs will melt in your mouth and the vanilla bean bread pudding is delicious! Our waiter was Peyton and he made the experience truly exceptional. The service is impeccable!!! We've never had this kind of dining experience. We'll be going back!",
   "The staff was amazing very informative. Then there was the food everything from the appetizers to main courses everything had a very savory taste with beautiful presentation! I highly recommend Tony's if your looking for a good mixture of steak and seafood with a very relaxing atmosphere."
  ]
 },
 {
  "name": "Subito",
  "address": "44 Virginia Ave, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fd18e7ae-9330-11ea-a992-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=17444313366160934790",
  "source": "GoogleMaps",
  "reviews": [
   "Subito is a well known secret lunch destination for downtown employees. Small shop with carry-out only. (No dine in) Line usually stretches out the door, but they are New York deli fast. Amazing sandwiches, soups, & salads, cookies. Check their online calendar for daily soup options. Also the only macaroni salad I've ever liked.",
   "Great little \"hole in the wall\" serving outstanding soups and sandwiches. The staff is friendly, the food is outstanding. There are no tables or seats here, it is to go only. At lunch there is a crowd, often out the door, but it doesn't take long to get through the line. Every bowl of soup comes with their amazing fresh baked rolls. Give them a try, you will be back again if you do.",
   "I got the Scottsdale salad and it was AWESOME! Great portion size that kept me full all day! It was so good I forgot to take a picture of it! Oops! This take-out establishment is a real gem!",
   "You might assume that since this place specializes in soups that their sandwiches must be an afterthought. Don't make that mistake. The soups are delicious, but the sandwiches really are the best in town. The Revelo has an amazing combo of creamy, melted cheese, tender pork, and some jalapenos to add a little heat. I'll be back!",
   "Excellent service, all good made in house. Staff is knowledgeable and friendly. Only downside is no where to sit inside"
  ]
 },
 {
  "name": "Meridian Restaurant & Bar",
  "address": "5694 N Meridian St, Indianapolis, IN 46208, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fd649700-9330-11ea-9f89-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5781001094084465707",
  "source": "GoogleMaps",
  "reviews": [
   "Incredible! Food quality exceptional. Service impeccable.  The executive chef came out to check on us. Pricey but one of the few \"fine dining \" I would reccomend.",
   "Nice ambience and very welcoming service. The food was crisp and delicious. Will surely recommend this spot to anyone. Fair prices and big portions. Keep up the great work.",
   "Been here twice, for anniversary and a birthday/ valentine's day. \n\nFood is awesome, honestly not really expensive for how good it is. All the staff are super friendly. Drinks are great. \n\nDefinitely a good place to go for a nice occasion.",
   "We celebrated here for a friends birthday,  and it was delicious. They have a great wine and cocktail list and a unique, exceptional food menu. Everyone loved everything they ordered, but we all especially loved the fried oysters. Our server was also very knowy about everything on the menu. Definitely recommend!",
   "They have the best keokie coffee here. (Very smooth.)  Definitely worth a repeat visit with some dining."
  ]
 },
 {
  "name": "Morton's The Steakhouse",
  "address": "41 E Washington St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fda4867e-9330-11ea-b797-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=6387670141570147134",
  "source": "GoogleMaps",
  "reviews": [
   "Yummy! The mans and I went here for our 3 year anniversary & from start to finish, the service was excellent! I forgot our server's name but he was super nice! Drinks were excellent, the wagyu meatball appetizer was delicious, and the steaks were flavorful and cooked just right. We even got an on the house dessert! The manager came over and made sure we had no problems as well, and we got to take home a personalized menu & a black card picture of us with \"happy anniversary\" on it. By the time we took leftovers home, they gave us a full sized bread loaf instead of the half eaten one we had. Ambiance is great and it was one of the most memorable anniversaries I've ever had. :)",
   "So many good things I can say about our experience here for our 16 year Anniversary. The service was top notch, the food was amazing, it was a great experience all together.  Mark, our server was so very helpful and informative.",
   "5 stars don't even begin to describe how GREAT our whole experience was!! From the beginning, the valet attendants were extremely nice and professional. We were celebrating our 5 year anniversary. We had personalized menus and a picture taken of us to celebrate the occasion!! The food was delicious!! Bacon wrapped scallops and a chopped salad. Bone in  ribeye streak that melted in our mouths! Rack of Lamb, sour cream mashed potatoes and asparagus. We had a complimentary dessert to compete our meal. Morton's hot chocolate cake with vanilla ice cream! The food was so fantastic, but the service was impeccable!! The wonderful people working there are what made the experience unforgettable. They left no stone unturned when it came to taking care of our needs. Our server was perfect! Already planning our next trip back!",
   "We had a gift card so we went for the first time! We happened upon Devour Downtown, so that was nice. Everything was delicious, from the bread to the French Onion soup, Chicken Christopher and Key Lime Pie. My husband said his steak was amazing and cooked perfectly. Rob was a very attentive and accomplished server. This restaurant has a cool old vibe in the basement. Oh, and my Lemom Drop martini was perfect!!",
   "This is the best steakhouse in the city.  Everything was cooked to perfection and the desserts were amazing!  It is very pricey but worth the occasional visit to spoil yourself.  The staff was very good and the chef really cater to my wife's dietary restrictions.  Great place"
  ]
 },
 {
  "name": "Weber Grill Restaurant",
  "address": "10 N Illinois St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fe02fa2e-9330-11ea-8724-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18167586005320846090",
  "source": "GoogleMaps",
  "reviews": [
   "Great location, fantastic facility, excellent service, great portions. Food seems to be hit or miss. We've been there before and had fantastic food. This time, pork chops perfectly cooked medium, but the meat was tough. Beer can chicken over cooked and under seasoned. BBQ meatloaf. Supposed to be smoked. Zero smoke taste, nothing special. Sides were great.",
   "YUM!!  My family loves grilled food, so we made a special trip to the Weber Grill restaurant.  We wanted to try everything on the menu!  It will take a couple of trips for us to accomplish that, but we are up for the challenge.  We loved everything we tried.   Perfectly seasoned and perfectly cooked! I definitely recommend this place - for dinner and dessert!!",
   "Over all was very good. Service was great. Our server Jennifer was great and on top of it. We where in and out in a hour.  Not to bad for a Friday night",
   "It was my first time there and my first date with my partner. The food was amazing. Our New York strip steaks were cooked to perfection. The service was beyond exceptional. Our server Tara  was on point. We never had to ask for anything. I found out it was her first night serving and I was amazed at her knowledge of the menu. Honestly Tara made the experience a perfect 10. We will definitely be back.",
   "This restaurant has really gone downhill. We used to love coming here. Food is still pretty good, although not great, but the service is terrible. Unfortunate."
  ]
 },
 {
  "name": "Nesso",
  "address": "339 S Delaware St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fe50f364-9330-11ea-a139-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tasting",
   "food",
   "delicious",
   "food",
   "food",
   "knowledgeable",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=11896146932104593174",
  "source": "GoogleMaps",
  "reviews": [
   "Had a great time. Lovely looking and tasting food. Our server (Rebecca) was fabulous, friendly, and knowledgeable with great suggestions. Thanks Nesso for a truly wonderful meal.  Meals pictured are the oxtail with pea mousse stuffed pasta, sea bass with braised celery and fava beans, chicken over orzo with black kale, then dessert sour dough donuts with berry compote and drizzled with aged balsamic. Definitely a must go to spot for foodies.",
   "Delicious food!  The oysters on a half shell were amazing.  The bread basket is unexpectedly very tasty.  The olives wrapped in sausage were a nice twist.  The calamari is some of the best I've ever had! Thre scallops and the short rib were absolutely delicious!!! I'll definitely be going back!!",
   "At the first moment  you come to this restaurant  the stuff gives you a great feeling. Very congenial team, it is a kind place to  enjoy with friends or with your date. Excellent  food, experienced  chief cook and stuff, decent  pay and courteous  service. Highly recommended.",
   "Beautiful restaurant, great new interior. Really enjoyed the wine from Italy and the halibut. Was expecting more from the beets and heirloom tomato appetizer as they didn't stand out as anything special. Don't forget to grab the espresso candy on the way out!",
   "Clean Italian dishes elevated into a full experience. Chooses a dish per person but make sure to share and eat communally.  If not pick the scallops. They are perfection. The staff is incredibly knowledgeable and will explain everything on the menu. They are friendly and professional. They are top notch but without seeming pretentious or stuffy."
  ]
 },
 {
  "name": "1913 Restaurant",
  "address": "40 W Jackson Pl, Indianapolis, IN 46225, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fe920a00-9330-11ea-9013-14b31f159f22.png",
  "tags": [
   "food",
   "free",
   "food",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=12869122510896144752",
  "source": "GoogleMaps",
  "reviews": [
   "Food and service are always perfect. Best breakfast buffet anywhere. ",
   "Breakfast buffet and omelette station was good....if it’s open. If the hotel is not busy they don’t bother setting it up. Your only privileged when they are too?",
   "I received a free dinner for 2 package at the 1913 Restaurant for some photography services I provided. Despite my wife and I being one of 3 couples (6 whole people) in the entire restaurant, our food took almost an hour to get to our table after ordering.\n\nHowever, the food was absolutely amazing. We asked the waiter to thank the chef for us, and most of the kitchen staff came out to say hello and collect our thank you in person. It was pretty cool :)",
   "This restaurant is in the Omni Hotel.  The valet, hostess, servers, and manager were very attentive. Four of us met for dinner and had a drink at the bar where a friendly bartender served us drinks before dinner.We then had the arugula and pear salad that was chocked full of candied pecans and toasted pumpkin seeds. Yum!The walnut crusted walleye was served with a harvest rice blend. The dish was very good but could have used alittle more sauce.",
   "Nice restaurant with good farm to table options."
  ]
 },
 {
  "name": "Shoefly Public House",
  "address": "122 E 22nd St, Indianapolis, IN 46202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fed6f69a-9330-11ea-98ab-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "delicious",
   "knowledgeable",
   "food",
   "unique",
   "eat",
   "food",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=2291595702827055268",
  "source": "GoogleMaps",
  "reviews": [
   "The guy in a shirt and a hat is the best. It's a little pricey but good for going there occasionally. The lady that served my table might not be in the mood that day though.",
   "I love the local selection of beers and wine, as well as the locally sourced ingredients. The food was okay. Enjoyed it with black current mead from New Day in Indy. The restaurant itself is really cute inside, with great music and fun decor. This restaurant is somewhat pricey, but you are paying for locally grown and raised goods. Definitely a place to go for more special meals.",
   "Shoefly has become my \"go  to place\" to grab a beer after a long day of work or school. From the beer list to the food menu, Shoefly offers delicious options for anyone's palate.The low key, calming ambiance provides a relaxing experience each time I visit.  The staff is friendly,welcoming and knowledgeable about the items they serve. Overall, I recommend anyone visit Shoefly!",
   "Great Atmosphere and the food is unique. The only knock I have is their Diet Soda is not very good but I’m sure this is just personal preference. I prefer Diet Coke as an option. Love coming here to eat lunch!",
   "So thankful for their grocery menu at affordable prices that feels very safe and clean (employees wearing gloves, employees only in the restaurant, curbside handoff is quick and the food is all fresh and high quality). \n\nTheir menu always has lots of different/unique protein options and there are always different combos and flavors to try!"
  ]
 },
 {
  "name": "Spoke & Steele",
  "address": "123 Illinois St, Indianapolis, IN 46225, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ff1d5fc0-9330-11ea-8e54-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "unique",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1954613996854309128",
  "source": "GoogleMaps",
  "reviews": [
   "I don't normally give 5 stars at any place no matter how good I think it is. But this place has absolutely exceeded my expectations with their food and service. The menu isn't pages long. (Thank goodness). In fact it's short, simple and very direct. The staff is super friendly and very much on point. Not ever have I encountered what many say is to be a \"hidden gem\", but definitely this place is genuinely just that! I'll be raving over this place for YEARS to come. The staff should expect me to become a regular customer on the weekends. Words can not describe the positive vibes I'm feeling after eating here.",
   "Very busy night for them! Made last minute reservations and got seated 1/2 hour late. No problem! Understandable! Great over busy staff.  Food was different and delightful.",
   "Definitely felt out of place however, the customer service was pleasant and they were very polite. The prices are what I would consider once in a blue moon kind of pricing. The atmosphere is very rustic with a classic vibe. Food was on point.",
   "The menu was great, the service was great and the chef delivered one of the courses herself. The food was outstanding. I recommend the shrimp and pork bao. #amazing\nDrinks were wonderfully unique.",
   "Still the best Sauzerac that I've had in Indy. The seasonal cocktail menu they have now is lots of fun. The food is also top notch."
  ]
 },
 {
  "name": "Yard House",
  "address": "15 W Maryland St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ff6217ca-9330-11ea-a4ff-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1896978703671499721",
  "source": "GoogleMaps",
  "reviews": [
   "Just from a burger perspective...not spectacular. It was cooked fine but neither the toppings nor the bun nor the meat were imho worth the higher price tag. Other food might be great and service was definitely awesome!! The cheese curd app was good - all the apps are definitely portioned for 4-5 people.",
   "Just went there for lunch.  Had a fantastic Cobb salad.  Their beer selection is incredible.  They have one of the largest lists of appetizers I have ever seen.  You can have dinner with the appetizers.  If you did you would miss their lobster and steak choices. I will return.",
   "Visited Yard House as a party of four people and reserved our spot through OpenTable. When we arrived we were immediately sat and the hostess staff was super friendly. The atmosphere is like any other Yard House you may visit and can always be a great time! Our food was prepared in a timely fashion and we all enjoyed our meals. We’re glad we chose Yard House for our company dinner outing while in Indy and will visit again if we visit downtown Indy again.",
   "This was one of the few places open late night on a Saturday. I checked out the menu online and was impressed. When I arrived it was a condensed late night menu. I got the Nashville hot chicken. I was disappointed with the price ($16) for chicken and pancakes. I would have like another choice of side dish. But the chicken was good. \n\nThey have a late night happy hour food menu with less expensive options but nothing really looked filling. I also didn’t think there were many healthy options aside from salad. \n\nIf you’re looked for food late night it’s really this or Steak and Shake. Or go during the day to experience the full menu.",
   "This place seems to always get it right. No matter how packed they are the service is always efficient and friendly. I love the beer selection, there is something for everyone. I would give it five stars if there were more menu items that I like. AND they do not have salsa on hand. Crazy! :)"
  ]
 },
 {
  "name": "Buca di Beppo Italian Restaurant",
  "address": "35 N Illinois St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ffaebe28-9330-11ea-b63b-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3312329505219105455",
  "source": "GoogleMaps",
  "reviews": [
   "Had a great time celebrating our friends birthday here! Zoie our server was super nice and helped make sure our night was perfect! The cost was totally worth it with all the food we got and only $13 per person! We had a coupon from online for making a reservation that saved us lots of money. Also, you’ll always order too much food! We knew ahead and ordered the perfect amount!",
   "My boyfriend and I went the day after Valentine’s Day with reservations set. Right when we got checked in we felt as if the hosts and food runners were a tad rude. Our server was great along with the other servers around us. They did happen to accidentally take our entree to another table but they were honest and handled it well. The manager was a very nice guy! Overall, it was a nice first visit! We will definitely be back. The food was phenomenal!",
   "To preface, my wife and I go to Buca quite a bit.  Especially, the downtown Seattle and Las Vegas locations.  \n\nThe meal started out good and our server Christina was helpful and fun to talk to.   \n\nFor an appetizer, the mussels were really good. However, the chopped salad, which is usually great at other locations, was just plain horrible.  When we received it, it looked like it had been sitting in the servers window for a long time and was warm/soggy \n\nWhile waiting for our entree, I got up to use the restroom.  Some of the kitchen staff were in the public areas.  Very unusual.  No hellos or anything even though I said hello.   They gave me the feeling like I was holding them up from going home.   \n\nI got back to the table and we were served the spicy chicken rigatoni.  I know what this is supposed to look like folks, but it didn't look like anything close.  Totally dried out rigatoni, not saucy and there was hardly any chicken.   At this point, we just told our server to box it up and requested our check.  Even though we were still hungry, it was time to leave. \n\nFinally, we received the bill.  My wife was charged $60 for 3 wines that should have been $13 each.  I think they may have charged us for large pours, but we received short ones.  Again, we have been to other locations.\n\n$167 after tip and we had a $25 off coupon.  \nHorrible dining experience.  \n\nI know that this is after lots of great experiences at other locations, but it makes me feel like not going back to Buca period.",
   "Fabulous food. Vegetarian friendly. They even have a vegetarian menu! So rare. Interesting seasonal menu. Portions are quite large. I ordered a single entree and ended up taking part of it home with me. The service was perfect. I was attended to politely and in friendly and helpful manner. Ambience is interesting. I wasn't sure how to describe it. Check out the photos. But it felt warm and welcoming.",
   "Makes you feel like you walked into your Italian grandmother’s house for dinner. Good food. Food is like dinner at home. Different plates serve different amounts of people. You can get lost in there but it is definitely a unique experience."
  ]
 },
 {
  "name": "Charleston's Restaurant",
  "address": "6815 82nd St, Indianapolis, IN 46250, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fff84a74-9330-11ea-bd7b-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8278339600571786564",
  "source": "GoogleMaps",
  "reviews": [
   "We had made reservations in person a week prior for a specific table at 5:00 and a specific waitress.  We had requested a large round table because we had a party of eight. When we arrived, they were not going to give us that table and when they did, we were informed that we had to be done by 7:00. \nWhen we were seated, it was not the waitress we had requested.  This waitress was OK until it was time for the bills.  Even though she confirmed who was with whom, when she returned with the bills 15 minutes later, they were wrong.  \nShe wrote out the orders again, by couple, and added all drinks and said she'd  be  right back.  During the 15 minutes it took her to return, a couple of restaurant staff walked by the table and looked at their watches.  \nWhen she returned we all gave our credit cards and one member of our group asked if they gave a military discount.  She said they did and asked for his ID and said she would adjust his bill. \nAfter another 15 minutes, and a few more looks from staff, a member of our group went to the front to let them know we had been waiting for over half an hour for our bills.  \nWhen the bills were finally brought back, the one who had asked for a military discount, was $5 MORE !   \nWe were pretty irritated by now, and just paid and left.  On the way out, we overheard a staff member say,  \"Yes, they finally left.\" We would have been gone a good half hour earlier if the waitress had gotten the bills correct.  \nWe have enjoyed eating here in the past, at least once a month, but this visit will cause us to rethink our choices.",
   "Had a great time at Charleston's. We arrived during the dinner rush time, and although the parking lot seemed full we were seated immediately. Our server, Tina, was great. She was friendly and took great care of us. The atmosphere and decor are somewhat upscale yet relaxed. Plenty of great options to choose. Our group had the Chicken tortilla soup, chicken enchiladas, and chicken picata. And for dessert we split a slice of key lime pie. Everything was great",
   "Awesome, absolutely divine if you want something mouth-watering served with great care and compassion this is the place to go... Every meal has been prepared with exquisite taste!!",
   "Nice dark woods and cozy booths, plus really good, well made Americana food.  This is my idea of perfect restaurant ambiance.",
   "Classy environment. Menu has decent variety, good food with big portions. Would not recommend the baked beans. Would recommend the pork chops and the hickory burger."
  ]
 },
 {
  "name": "The Eagle Mass Ave",
  "address": "310 Massachusetts Ave, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/003db826-9331-11ea-87d9-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2965933111696538035",
  "source": "GoogleMaps",
  "reviews": [
   "Great spot on Mass Ave for dinner and/or drinks. The fried chicken is very tasty and so are all the sides. The chicken sandwich is a go to! Fun bar scene and large patio is also a plus.",
   "Family style southern cuisine. They have communal seating. Come ready to make friends because this is the spot for it. Double sided bar for double the fun. Can't wait until the patio is open.",
   "My husband and I were first time customers 3 weeks ago.  Sat at the bar and had the pleasure of having a female bartender, I think Kaylee?  Anyway, she was fabulous!  Very attentive even though it was getting busier.  Ordered drinks and food and all was amazing!  Sides and whole chicken are large enough to share.  Great experience..we will be back!!",
   "That was a disappointment: I received a recommendation from a local guy that actually works in cuisine recommendation. We went the first day, an hour wait. The next day, 45 minute wait.... at this point the build up us great.\n\nThe third time we tried we had a seat at the bar. Nice bartender helped us select drinks (pretty common, nothing special), and I ordered the famous fried chicken with spicy honey.... Well, it was a friend chicken. That's it. The honey was just honey and some spice.\n\nI really don't get the hype about this place. I had better fried chicken in most diner and chains in other places",
   "First of all, THANK YOU to Maddie working at the front for genuinely taking the time to find my bracelet that I lost. You are a saint and deserve a raise for going the extra mile for customer care. Also, the food and atmosphere of The Eagle is awesome year round, and highlighted in the summer with the great patio seating. We love bringing people here that haven’t had it before because they always leave so happy and satisfied. Thank you!"
  ]
 },
 {
  "name": "Iaria's Italian Restaurant",
  "address": "317 S College Ave, Indianapolis, IN 46202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/00876b8c-9331-11ea-a79c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11410689867384853521",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic Italian restaurant. We got there right when it opened and it was immediately hoppin'. The service from the second we walked in to paying the bill 10/10 service. Now the food part. The food was wonderful as well. Both the fried mozerella and lasagna were very tasty and came out hot.",
   "Small, but cozy place. Great food and atmosphere, everytime. Marinara sauce with cheesy garlic bread is amazing. So is the tortellini!",
   "Let me start off by saying I’m very disappointed by the food I had today. After my grandma and best friend hyped this place up to I was expecting a lot more quality. I came today to participate in Devour Indy and I wish I didn’t. I ordered the chicken Marsala and the chicken Parmesan which I usually LOVE!! The sauce was too sweet and all of our chicken was tough. I came with 2 other people and they share my same opinion. The establishment was clean and the waitress was great!!! But my food was not a good representation of what I was told it would be!",
   "I made a reservation through this Google page for last night. Google said I had the reservation. When my date and I got to there, they said I didn't have one. I showed them on my phone the reservation I had, and they agreed that it said I did, but didn't offer anything to us. They said the wait would be at least an hour. The manager called today and only offered an insincere apology, and said they only use Yelp for reservations. It did seem like a nice place, but we were not able to experience it. I can't give anything but a 1 star review for this experience.",
   "The food was beyond delicious! Definitely one of the best places for Italian food. I recommend the stuffed ziti with their sauce. My mouth is honestly watering just writing this review! The place is extremely cozy and very family oriented. I can’t wait to go back!"
  ]
 },
 {
  "name": "Cooper's Hawk Winery & Restaurant",
  "address": "3815 E 96th St, Indianapolis, IN 46240, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/00ca68ae-9331-11ea-a6b2-14b31f159f22.png",
  "tags": [
   "family",
   "family",
   "food",
   "free",
   "tasting",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16663609814817938238",
  "source": "GoogleMaps",
  "reviews": [
   "I've been coming to Cooper's for well over 3 years. This location has been consistently exceeding my expectations in service and quality. I appreciate having the convenience of booking a table on open table. Cooper's is great when family or friends come in from out of town as the menu is great for anyone. Love the membership and the perks that follow it. Monthly tastings and bottles in addition to having discounts and rewards!",
   "Such an AMAZING carry out Easter meal! We ordered the ham and short ribs that came complete with Mary's potatoes with gravy, broccoli (perfectly cooked) the freshest and BIGGEST mixed salad, pretzel bread with butter, a WHOLE pie and a bottle of wine - for 200 -- there were five of us and we had enough leftover for full meal for all five us.  The food was wonderfully prepared -- and packaged -- so neatly with ALL serving utensils.  All the heated goods were in containers that easily went from low-temp oven where we kept warm for an hour - to our counter for self-serving.  I was SO impressed and happy with everything.  I would recommend this option whether the restaurant was closed or not!  Although the service at CH is impeccable and I do miss wine tastings. Look forward to being back.  THANK YOU INDIANAPOLIS CREW for putting together a beautiful meal for our family this Easter.",
   "We came here on a Friday night and were seated promptly. Our server was good too, albeit slightly busy. However, we did not enjoy the food. Almost everything was over-seasoned. The soy ginger salmon was too sweet and the short rib risotto was too salty. The fries came lukewarm and were also too salty. My favorite dish of the night was probably the pretzel bread served at the start of the meal. Nice touch to have free wine tasting, though. Hopefully the food quality improves.",
   "Simply the best! Been coming here for four years but Christopher made tonight an extra special experience.  Always on point with the wine (of course), the service, and the food!! Great place to take my aunt and uncle visiting from Mexico for the holiday.  Thanks Cooper’s hawk and Christopher!! 🙌🏼🙌🏼🙏🏼🙏🏼🙌🏼🙌🏼",
   "The best place!!! Went for Valentines Day last night and not only did we have the best food, wine and dessert but our server was incredible. I forget her name but she’s been with the restaurant for 7 years and really knew her stuff! We felt well cared for on one of their busiest days of the year and it is the perfect place for a special celebration dinner! The gnocchi is incredible! Can’t wait to go back!"
  ]
 },
 {
  "name": "Major Restaurant",
  "address": "1150 S Mickley Ave, Indianapolis, IN 46241, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/01135824-9331-11ea-ae1e-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "food",
   "music",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7642506954533015377",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing restaurant with probably some of the best Ethiopian food I have ever had. The ambiance is okay (not my taste), the location is not great, but the food and coffee are excellent. Great place to order large platter with friends or family and try out a variety of dishes. Unlimited Injera (bread), and they will bring out delicious spicy sauces if you ask for it. Courteous and fast servers. My favorite place for Ethiopian food in Indy, and even though it is very far away from my house, I can't stop driving here to get food!",
   "Simply amazing. Had the vegetarian combo plate for four, and every single dish on the plate was killer. The coffee ceremony is a must. The staff were super nice and helpful. The decor is beautiful and the ambiance is very fitting, with Ethiopian & Eritrean music playing over the speakers and frankincense thick in the air. Definitely some of the best Ethiopian food I've ever had.",
   "Good Ethiopian food and prices are reasonable. I got the Beef Sampler.  It was very good. The food had a bit of spicy heat to it but not too much. Very flavorful.",
   "Excellent service. The Major combination plate offers a wonderful variety of flavors.  Will definitely return.",
   "I love this place. When I lived in Indianapolis I ate there a few times every month. Best Ethiopian food I have ever had. And the wait staff takes the time to explain to you what everything is and how it works."
  ]
 },
 {
  "name": "The Library Restaurant & Pub",
  "address": "2610 S Lynhurst Dr, Indianapolis, IN 46241, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0169199e-9331-11ea-85c0-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14945000718691703551",
  "source": "GoogleMaps",
  "reviews": [
   "For a Friday night, it was pretty quiet. Almost sure we brought the median age down about 20 years when we walked in. Went here based on a recommendation from our layover hotel, who also gave a coupon for a free dessert with dinner. Had the Prime Rib Manhattan, Medium Rare. Probably one of the BEST steaks I've ever had. Good marbling, thick, not overcooked, well seasoned. The green beans were nice and soft, not rubbery like some places. Sweet tea was the right amount of sweet without being too overbearing.  Had Lemon Tarts for the dessert. The raspberry drizzle was an excellent contrast. Did not expect to be wowed by food in Indy, but was definitely a nice surprise.",
   "Not far from work and I enjoy trying restaurants other than chains. \nThis place has the best club sandwich in town! Simply awesome! So good I visit several times a month. It’s worth the effort, it you sit at the bar say hi. Enjoy",
   "The decor is a bit off and interesting but the food is definitely good.  The prime rib Manhattan was tasty and the stuffed salmon was light and refreshing.  Be forewarned to get there early because they do sell out of the prime rib.  I would like to come back again during warmer weather and sit out on the patio area they have.",
   "Like the sign says \"Best Prime Rib in Indianapolis.\" (It is herb encrusted and takes 18 hours to prepare.)  They also have great cheesecake. There is no dress code here so business or casual is acceptable. (They have event rooms for proms and other events.)",
   "Ordered food to go from here, that’s what we got for stuffed shrimp (only 6) a thumbnail potato and some ugly cabbage after waiting for 40 mins, charged us $30 and when I wanted to complain, the boy was so rude and start yelling at us. Definitely sure that this place not worth of your time and money to spend."
  ]
 },
 {
  "name": "Maialina Italian Kitchen + Bar",
  "address": "1103 Prospect St, Indianapolis, IN 46203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/01ab2a24-9331-11ea-9d42-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "unique",
   "food",
   "knowledgeable",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=18419034039232471191",
  "source": "GoogleMaps",
  "reviews": [
   "Hits the spot for comfort food especially on those frequent snowy nights. Portions are generous but not overwhelming. They provided fresh grated Parmesan. The pasta is cooked and flavored well. Had the gnocchi it was well season and perfectly cooked. Wait staff professional and friendly.",
   "The pasta and meatballs were superb. The staff was so friendly and accommodating esp. Emily. One of us ordered the Salmon with artichokes, a special order. The cooks were so gracious to accommodate our request with the salmon topped by a delicious helping of grilled artichokes.",
   "The best Italian food I've had since Arthur Street in Brooklyn.  We all shared a little of our dinners so was able to taste many items.  My dish was Sausage and broccolini, a common dish in restaurants on the east coast but you don't see it much in the mid-west.  The kale salad was the most unique.  Every dish was very good.  Very comfortable atmosphere, very friendly and knowledgeable service staff.",
   "I've been wanting to try this place since I've seen it pop up on Instagram, finally had the chance to set up a dinner for my 30th bday. Located in the old smoke house in fountain square it's been redone into a classic/trendy lounge style Italian place.\nOur service was awesome! I love when recommendations are made and dishes are explained.\nI have to say you must get the aperol spritz, it's the house cocktail and it's awesome, light and refreshing and the largest cocktail they offer.\nI'm not typically an appetizer person but we decided to get the bruschetta, but it was a non traditional style with hot honey and ricotta and it was amazing, im going to try and make the dish myself.\nFor the main course I had the vongole, a delicious pasta dish with garlic tomatoes and clams. I also had a delicious white wine blend, and to top the whole night off I had a tiramisu on the house as a birthday treat. Awesome experience I can't wait to go back!",
   "Reminded me of the neighborhood Italian restaurants from the 90's, but in a contemporary space.  Growing up with those meant the menu was full of comfort foods.  Service was very attentive.  Nothing stood out.  All in all a solid choice, but not something to go out of your way for."
  ]
 },
 {
  "name": "Rick's Cafe Boatyard",
  "address": "4050 Dandy Trail, Indianapolis, IN 46254, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/01ea57b0-9331-11ea-abab-14b31f159f22.png",
  "tags": [
   "drink",
   "tasting",
   "food",
   "walk",
   "food",
   "eat",
   "food",
   "family",
   "food",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=8804046046008729406",
  "source": "GoogleMaps",
  "reviews": [
   "We can’t say enough great things about Rick’s Café Boatyard. \nWe decided to have our wedding reception here because of the view onto Eagle Creek, the beautiful grounds, and the pricing for the venue. I had never eaten at the restaurant but my husband assured me that the food is fantastic. When we first contacted them, the events manager, Savannah, was quick to respond with the menu and all the options we would have for our special day. She was super patient and so understanding with all of our questions. Wedding planning can be stressful but Savannah’s cheerfulness just made us feel more comfortable. She’s really a pleasure to work with. There are many different packages for food and drinks that you will find what you’re looking for within in your budget. For our tasting, Savannah and Nathalie made sure we had a perfect experience and even equipped us with a sheet to jot our opinions about each plate- these little details really made a difference for us. We decided to do our own decorations for this event and the staff was very accommodating in creating our vision. Savannah even coordinated with our vendors to make sure everything would arrive on time. On the day of, we received so many compliments about the entire staff. The bartender remembered my name and made sure I never went without a drink. Once the outbreak is over and we can have gatherings again, please consider Rick’s for any event you’re looking to host.",
   "A superb restaurant! This place was recommended because of their great food and its proximity to Eagle Creek airport. (KEYE) We flew in to Eagle Creek and took a 3 minute walk across the street to Rick's. It was Valentine's Day, so they were packed. We had a table next to the big windows with a great view over the water. The seafood was fresh and the wine was good. If you're a pilot, this is a dining fly in must.",
   "I am sorry, but I forgot to take some pictures of the food! It was just so good I had to eat it all quickly! My wife liked the food, my brother liked the food. The atmosphere is nice, the waiters are great. I will come back again with more people and pictures.",
   "My family has enjoyed many years at Rick's. Today, though the service was a bit challenging, we were patient as we knew Rick's holds a standard for their service. I suppose every restaurant has its day because, as we all know well people are unpredictable and you know what a person is dealing it. We are very understanding group. But the minor issues were immediately corrected by the manager, Nick. Thank you Nick,l for upholding the standard in your restraunt. The food is always presented well, and the bottomless mimosas are a nice addition to Brunch. Definitely try the stuffed french toast. It's a signature dish even if the menu doesn't say it! I recommend Rick's for drinks, meals, and ambiance. Will always be one of my favorite places in Indy! ❤",
   "Amazing place to go out with your girl. I had a great experience there. You can even go for lake side walk. And in summers you can sit at outside bar."
  ]
 },
 {
  "name": "The Old Spaghetti Factory",
  "address": "210 S Meridian St, Indianapolis, IN 46225, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/022a1ffe-9331-11ea-acfd-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "family",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4525339902547398679",
  "source": "GoogleMaps",
  "reviews": [
   "Had a great time here! Awesome food and good service! Had a large group and we were in a rush!! The server made sure we got our food in time and that we felt super accommodated! Made it to our meeting on time with room for ice cream! Cool atmosphere and decor, too!",
   "This is a fantastic place. We've been coming here since the 80s. The atmosphere is awesome. The food is great and always served hot. We always go on Sundays for the waiter Juan only works on Sundays. He is an excellent waiter. He has waited on us for years.\nThe kitchen manager is fantastic. Josh keeps everything going.",
   "I'm from Louisville, Ky and we have this restaurant here but even with one in my backyard, I've never eaten here. While in the area we decided to eat here and I was blown away. The waitress, Ashley, was super friendly and helpful. I ordered the lasagna and was really wonderful. The decor is really nice and feels like you're stepping back in time. Highly recommend this establishment.",
   "Awesome spot for friends and family alike. Great atmosphere. Really good food. 5/5 on the food. All entrees are 3 course meals. Soup/salad, entree, ice cream. (Skip the vanilla and go for the local favorite, it's amazing!)\nOh, and there's a train car in the building that you can eat your dinner in... Awesome time tonight at the Old Spaghetti Factory!!",
   "This will be one of my favorites. It was my first time back in a while. The service was good and the food was off the chain."
  ]
 },
 {
  "name": "ATHENS ON 86th",
  "address": "2284 W 86th St West, Indianapolis, IN 46260, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/026f142e-9331-11ea-ac73-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "delicious",
   "delicious",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8393033747720611787",
  "source": "GoogleMaps",
  "reviews": [
   "Apart from spicy feta which was average all the meal was under average. I specifically asked if they were using fresh fish for grouper and our waiter said yes. When I received the meal and told her this wasn't fresh fish, she started with a whole different story. \nTheir daily specials that had seafood kebab, the waiter said that it is a mistake, on the menu it was written Taramosalada that this is one of the most popular appetizer on Greek table, she said they do not have it any more.\nThe octopus that i took was very hard to chew.\nI don't think that i will be back. \nSorry.",
   "Awesome local Greek restaurant! Very diverse menu that can accommodate a wide variety of palates and diets. Enjoyed the vegetarian moussaka with rice and green beans - very delicious and a perfectly sized portion. Atmosphere is great too; well decorated and not too crammed with seating so you have space between tables. Wait staff is friendly and attentive.",
   "As always, delicious food!  A relaxing ambience and very pleasant wait staff.  I always highly recommend Athens on 86th for a fine ding experience.",
   "Authentic and delicious! Stopped in for lunch had the Greek spaghetti and my oh my oh my what a pleasant surprise! Delicious! The bread they brought to the table was warm and buttery goodness I wish I could have it sent home back in Michigan.",
   "We were seated quickly, and our drink order was taken.  Drinks arrived quickly and our food order was taken.  The salads and bread arrived quickly, and were both delicious.  Our entrees arrived at the proper time; after we finished the salad and before we started wondering where the food was.\nThe food.... wow!  I ordered the Taste of Greece, as I like to sample a variety of items at a restaurant I'm visiting for the first time.  Every single item was amazing.  I'm very impressed."
  ]
 },
 {
  "name": "His Place Eatery - Chicken & Waffles, Ribs and Soul Food",
  "address": "6916 E 30th St, Indianapolis, IN 46219, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/02b24434-9331-11ea-9457-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "eat",
   "food",
   "tasting",
   "delicious",
   "delicious",
   "family",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18045772017690532005",
  "source": "GoogleMaps",
  "reviews": [
   "I would eat here every day for the rest of my life if I could. I'd weigh 300 and I'd be broke, but I would be happy. The food is exceptional. I particularly like the smoked meat loaf wrapped in pepper bacon. The rib tips are excellent, as is the country fried steak, as well as the smoked brisket, fried catfish, chicken and waffles, and many more delicious menu items. \n\nToday I had a boneless fried chicken breast smothered in an onion gravy that was sensational. The sides are over the top: my favorites are the creamy mac and cheese and the flavorful cholard greens, but try the bourbon creamed corn, too. \n\nI like the laid back family atmosphere -- many families with little ones, and no one in a hurry to leave. And I especially like that the owner, Chef James, comes around and greets his guests at their tables as time permits.\n\nBy the way, the Banana Pudding is out of this world good -- so smooth and creamy and full of banana slices and vanilla wafers. If you like great soul food, you will absolutely love His Place Eatery!",
   "This place is a foodies dream , I had rib tips with collard greens, and macaroni cheese. The tips were very tender on the sweet side with the spices . The greens , and the macaroni and cheese were wonderful tasting . I ordered a cat fish sandwich to go oh my lord some of the best cat fish I ever had . Wow I’m impressed with the great taste . The staff was super friendly fast service, very clean restaurant. The menu is nice size something for everyone here.",
   "Absolutely delicious!! The restaurant was packed when we arrived and it was worth the wait. The pulled pork is some of the best I've ever had and the creamed corn was perfect! Can't wait to go back and try the chicken and dumplings which they were sold out of when we went.",
   "This is my favorite restaurant in Indianapolis area. I highly recommend this place if you are looking for a home cooked meal or even a catered holiday family meal. The staff is great and the owner is always awesome. He really cares about his customers and even comes out to greet them at the table. He helps wait and clean tables when things are busy and that’s always a great quality to see in upper management . I hope they expand and bring this delicious food to south bend !!!!!",
   "First time at this restaurant ordered food to go. All good signs when you see customers coming in frequently and the delicious aroma in the restaurant.\n\nThe ribs, fried chicken collard greens,mac and cheese  and the peach cobbler were so tasty and delicious. They really know soul food i felt so good after i savored each bite.\n\nBest soul food i had in a long time. Will definitely be back again when im in Indiana.\n\nOnly thing is they need a bigger restaurant to accommodate more people."
  ]
 },
 {
  "name": "Three Carrots City Market",
  "address": "222 E Market St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/02ffdb9e-9331-11ea-9c4b-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=17255748301967595351",
  "source": "GoogleMaps",
  "reviews": [
   "My favorite lunch spot in the city market. All vegan menu with great flavors and great service.  Everything is so fresh and made to order.",
   "The pulled seitan burger here was delicious! I didn't like the seitan high fives as much, but it wasn't bad and the sauce for it was fantastic :) I also really enjoyed the atmosphere of the city market with all the different food vendors, the big open space and open seating with lots of light, and when I went for lunch, there was a chorus performing for the holidays.",
   "A great place to explore the world of vegan/vegetarian dishes. Because it is in the City Market, you can sample the food without committing to anything actual restaurant. The flavors were incredible!",
   "An Indianapolis classic. Excellent food and service, wide array of (comfort food with international influence) dishes and the menu evolves often enough to keep it interesting. Best biscuits and gravy in the city. They're a seitan supplier for other restaurants around Indy and it shows. If you make only one vegan stop in town this is it.",
   "I loved it! Dessert, breakfast, lunch, they have it all! At the cashier was so sweet! The stuff available was decently affordable. I missed it the first time I came here but I'm glad I found it and finally tried them out! Their vegan food is great! I'll be coming back every time I come to Indy! Even my 4yr old loved it here, and we became friends with the cashier too."
  ]
 },
 {
  "name": "Repeal Restaurant",
  "address": "630 Virginia Ave, Indianapolis, IN 46203, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0345eba2-9331-11ea-a541-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "historic",
   "eat",
   "food",
   "drink",
   "knowledgeable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9391931551947396863",
  "source": "GoogleMaps",
  "reviews": [
   "This place was nice and chill. Service was great and food was pretty good too. I asked our server for a recommendation since this was my first time. The brisket tacos were awesome and I really enjoyed the flavors. Looking forward to coming back to explore the rest of the menu.",
   "I had perfect fish and chips.  I don't usually like greens, but I tasted some of my dinner companion's and I would eat greens this delicious all day.  Amidst the list of intriguing cocktails I chose the \"apple pie\" cocktail as my dessert and was richly rewarded.Repeal also has an eclectic, t historic atmosphere.  Despite how delicious dinner was, our server, Carol, was the best part of the evening!  Friendly and charming without being too much in our business.",
   "We had a group of 7 on a Saturday evening. The place is very small and they were busy but they were able to get us a table quickly. The food was very good. We all got different appetizers and dinners. Everyone enjoyed their food and drinks.",
   "We went on a Saturday afternoon and the staff was very friendly and helpful. The space is very welcoming with a great ambiance. The food is fantastic! The bartenders are knowledgeable and know how to make a great drink. Highly recommend the Selfish Hawaiian Nachos! Highly recommend this place! We will be back!",
   "Now for the food. By the time I got my food, the cheese and oil in the Alfredo sauce had started to separate. There wasn't a ton of sauce and the sauce didn't have much of any flavor. It did seem like the cheese was fresh but it would have been nice to have some garlic and salt in the sauce at least. The bread and salad were good."
  ]
 },
 {
  "name": "Aristocrat Pub & Restaurant",
  "address": "5212 N College Ave, Indianapolis, IN 46220, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/039054d8-9331-11ea-97fb-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "eat",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18257469376310580634",
  "source": "GoogleMaps",
  "reviews": [
   "This was another attempt of mine to find as close to authentic wiener schnitzel as I could. I was trying to satisfy a childhood memory of living in Austria and eating schnitzel. I was able to look past it being pork, rather than authentic veal. The first 5 bites were incredible. The closest to authentic I've found yet, but as I continued eating it, I started to get a sweet taste. I realized the cabbage had so much juice in it that it covered the bottom of the plate, tainting the flavor of the schnitzel. This is not what one would expect for a $20+ plate of food. I was just passing through town, and if I lived closer I would consider trying it again. I gave 4 stars still because a different kitchen crew might plate the food a little better.\n\nRegardless of my schnitzel experience, the food was cooked very good. The atmosphere was cozy and comfortable. Prices were a little high, but they weren't out of line considering the area, the atmosphere, and the name of the restaurant itself.",
   "Stopped here for lunch while in the area. This place has your typical pub menu with good prices. We like the food but didn't love it. The tenderloin was absolutely huge. Way to big for a lunch meal. It said tenderloin sandwich but there is no way to eat it like a sandwich. The service was fast and friendly!",
   "They make a good tenderloin, maybe pounded a little to flat for my taste. The kettle chips are pretty good. The cost is a little much for what you get. Parking is the big issue with all the construction and they have a small lot. They have a nice patio out front to eat and a big selection of beers and alcohol.",
   "Today i had lunch with my friend/realtor in the friendly & tasty confines of the aristocrat pub. Kathryn as always proved why she is a # 1 person & server. I have known her since 2005. Alans fish n chips meal must have been good! He was a member of the clean plate club. That made 2 of us. Great atmosphere, excellent food, super staff! Need i say more...",
   "We've been going there since they opened in 1985 so they must be doing something right! Just good ole pub food, among other dinner options. Just like the feel of being there. Usually eat on the bar side door that true pub feel. Very nice servers and hosts."
  ]
 },
 {
  "name": "Black Market",
  "address": "922 Massachusetts Ave, Indianapolis, IN 46202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/03e39190-9331-11ea-9b2d-14b31f159f22.png",
  "tags": [
   "foodie",
   "food",
   "food",
   "knowledgeable",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4902599054755996653",
  "source": "GoogleMaps",
  "reviews": [
   "Really enjoyed this place for our anniversary dinner. Definitely a little on the foodie end but also everything is made from scratch. Rotating menu which I respect. \n\nI had some pasole and it was really really good. Expect to pay up for a scratch kitchen in a prime spot. Worth it for special occasions and I believe they have like $10 tacos so you don’t have to spend a fortune.",
   "Black Market has been reinvigorated by new chef Esteban Rosas, who has transformed the food menu into somthing quite special. The new spring menu is full of bright colors and flavors, the roasted trout is a must try. The Octopus is super tender and perfectly cooked. Don't forget Wednesdays are half price bottles of wine!!!",
   "Black Market has the best ambience of any restaurant I've found. The food is amazing too. I definitely miss their old menu, but they're pulling off the transition to Mexican food incredibly well.",
   "PLEASE GET COFFEE. Dessert is not dessert without a cup of black coffee. Otherwise, great food. Very knowledgeable and accommodating staff. They have a wonderful set up for a larger group.",
   "This place is perfect for a date night or a relaxing evening with a few friends.  The place is cozy so don't bring a party of 10.  This was my second visit.  I swear the first time I was here the menu was more Mediterranean but the website describes the restaurant as Modern Mexican.  Either way the food was delicious and I would recommend this place to anyone."
  ]
 },
 {
  "name": "Iron Skillet Restaurant",
  "address": "2489 W 30th St #2268, Indianapolis, IN 46222, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/04324fcc-9331-11ea-bf38-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "delicious",
   "food",
   "family",
   "food",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5168503340184821967",
  "source": "GoogleMaps",
  "reviews": [
   "I came here with my buddy, who’s a BIG “Little House on the Prairie” fan, so the aura of this restaurant was perfect for him. Going inside of the place felt like a step in time, imagining what a lovely dinner in the 1800’s would be like. Or close. Inside of this old, fancy former farm house was one of the best meals my buddy and I have had. Very charming on the inside. EXCELLENT food. Great waiter. Dinner was an experience. We ate like Kings of the Prairie. Highly recommended.",
   "First time coming here and won't be the last. The restaurant is very nice on the inside. The dinner is served family style. They are best known for their chicken. The meals come with a ton of different sides, bread, salad, main entree, and ice cream for dessert. There is no way of leaving here hungry. By far the best part is the excellent service. We had our 20 month old daughter with us and the staff so good with her. It made for a very enjoyable experience. I highly recommend this place.",
   "The food here is always delicious!  But watch your portions because the food is very rich.  You can get a small glass of tomato juice or creamy onion soup for starters.  (The creamy onion soup is not French onion soup, this is much better)!\nThen if you've ordered ahead for your party, most people get their fabulous fried chicken.  You also get a wedge of lettuce with a delightful vinaigrette, mashed potatoes (lots of butter in it, so yummy, but really rich too), pickled beets, apple butter for the bread, green beans and at the end you get ice cream along with a silver serving set with bowls of syrups to pick from.  Oh, and at the end of the meal they bring everyone these steaming Jasmine-scented damp terrycloth towels to wipe your hands off well.  But it smells so good I can guarantee someone in your group will bury their nose in it for the heavenly scent.  The decor is absolutely beautiful, just be warned the restrooms are upstairs.  The servers are truly the best to make your event a wonderful memory.",
   "Ben going there for over 50 years. Always pleased with food and service. Excellent for the whole family including the younger ones and the older ones. A previous review warned the bathrooms were upstairs. They also have downstairs bathrooms so do not let that be a deterrent. You will be please you went",
   "Fantastic place! One of my favorites. I have been going here since I was a kid. Same great tasting food as always. I wonder what happened to the little gift shop?"
  ]
 },
 {
  "name": "Luciana's Mexican Restaurant and Cantina #2",
  "address": "3716 E 82nd St, Indianapolis, IN 46240, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0476fa10-9331-11ea-ae41-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=551463465020759164",
  "source": "GoogleMaps",
  "reviews": [
   "This was our first time here. We had GREAT service and the food was fantastic. We were in and out in an hour on a Friday night. Highly recommend. As authentic as you can get for being in Indiana. We will definitely be back!",
   "Service was good.  Food was very reasonably priced.  My food was  a little over cooked/dry. Lighting was not flattering, which might be an issue for those of you trying to make a good first impression.  Would go back.",
   "Delicious Mexican food. They give you a lot for a good price. Nice atmosphere and good service. There are also some house specialties.",
   "Exceeded my expectations in customer service. If you love Mexican food this is the place to go. The prices are very fair. 🍹🍗🍖🍢🍡🍦🍨🍧🌽🍅",
   "Always good food. Inexpensive and no long wait. Friendly staff."
  ]
 },
 {
  "name": "LongHorn Steakhouse - Curbside To Go Available",
  "address": "5840 W 86th St, Indianapolis, IN 46278, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/04cd57a8-9331-11ea-846c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "affordable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14639515094852190524",
  "source": "GoogleMaps",
  "reviews": [
   "Everything we had was extremely good. My steak was cooked to perfection enter appetizers was. The best experience I've ever had at a LongHorn steakhouse. You won't be disappointed with this place. Very friendly staff and the food came quick. The environment was very nice. Everyone enjoyed there selves.",
   "Food is always amazing. Steaks cooked to perfection. Great service. My husband and I went on Valentine's Day evening. We knew it would be busy and we would have to wait a little while. We walked in just before it started to get even busier. We waited about 35-40 minutes. Not too bad considering how busy they were. I really thought it was cool that the host held a little boy for the majority of the time that the parents waited  to be seated. You don't see that very often. \nWe had a good-sized table when we were finally seated, unlike some restaurants that have tiny tables for parties of two. \n\nMy husband and I both got cups of loaded baked potato soup, Flo's 8 oz Filet medium-term. Yum. Our waitress Jody was great. We never ran out of drinks, and we was very busy, so that impressed us that she kept up. \n\nThe only reason I gave 4/5 was because I feel they need a larger waiting area. They only have a few small benches, otherwise when they get very busy like tonight, guests are overflowing into the bar area and crowded at the entry. Overall, it was a great experience, though. Great job! We will definitely return! :)",
   "Fantastic spot to eat something when in a hurry. Their service is quick, prices are affordable, excellent vibes. Keep up the good work",
   "Went here for a business meal. Great service and team here. Management went above and beyond to  make sure we were happy due to a slight wait for a server for our table. Will definitely be back because of that!",
   "Nice place and great food. People works there happy and very helpful with requests. Would definitely visit again."
  ]
 },
 {
  "name": "Bakersfield Mass Ave",
  "address": "334 Massachusetts Ave, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0511a292-9331-11ea-9fe2-14b31f159f22.png",
  "tags": [
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4199533111187682157",
  "source": "GoogleMaps",
  "reviews": [
   "I absolutely love the tacos and margaritas! However when I went to order from the site during COVID-19 after they re-opened it says that this location is not excepting mobile orders and I made sure it said Indianapolis mass Avenue. So I called the restaurant and the hostess to answer told me that I cannot place an order over the phone but I had to go online. When I went to call back the line was busy I waited 15 minutes go back again the line was busy I love this restaurant but this was extremely disappointing experience.",
   "AMAZING Tacos. Stopped for lunch and had drinks and tacos. So Delish! We sat in the basement (21 or over). We will definitely go back!",
   "Good food and drinks. Would recommend trying the pineapple margarita. The tacos were flavorful but the portions were much smaller than expected. House made salsa is fresh and delicious and the loaded queso is a good accompaniment to fill you up when the tacos leave you wanting more.",
   "Good tacos and friendly staff! Tacos seemed a little pricey for their size, but they were good. Would highly recommend trying!",
   "Love this spot to split chips/queso and a pitcher of margaritas.  The patio in the back is a fun spot and also has another bar back there.  It also connects with their other restaurant through the patio called \"Krueger's\" which is also very good."
  ]
 },
 {
  "name": "Union 50",
  "address": "620 N East St, Indianapolis, IN 46202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/055dc738-9331-11ea-b4c6-14b31f159f22.png",
  "tags": [
   "delicious",
   "learn",
   "food",
   "music",
   "food",
   "music",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=10495500319357310865",
  "source": "GoogleMaps",
  "reviews": [
   "Ok things I liked: great atmosphere, delicious deserts,good customer service. Things I didn’t like: old scallops,too chewy. Coming to Indianapolis from Atlantic Canada, you learn about seafood freshness. Duck was great, good shrimp and grits (would have been nice if they didn’t have tails).",
   "Absolutely amazing food!! Great atmosphere and live music. Our server Lindsey was super sweet and helped make great selections. My first time here and I'll definitely be back!!",
   "Really nice atmosphere. The staff are incredibly kind and you can meet some really great people sitting around the bar. The live music is always on point and the food is great (although a bit pricey). I had an order of pastrami poutine that hit the spot - it was very salty towards the end though. Definitely one of the top places to dine at if you're looking for an upscale casual vibe.",
   "It was very chill atmosphere. Intimate seating. The bar is absolutely beautiful to look at if you're into the industrial look. It's a little expensive - at least 100 for 2 people , not including dessert or many drinks",
   "Went for my birthday which was on a Tuesday this year. Not crowded at all but not vacant either. Eric the waiter was great. Attentive but not around too much. Enjoyed the shrimp and grits but my dining partner had a room temperature lamb shank. It tasted delicious but needed to be hot coming out of the kitchen.  Will be back."
  ]
 },
 {
  "name": "Dale's Family Restaurant",
  "address": "5209 Thompson Rd, Indianapolis, IN 46237, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/05aa6306-9331-11ea-83a2-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "walking",
   "family",
   "free",
   "tasting",
   "food",
   "free",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=9924995180700934699",
  "source": "GoogleMaps",
  "reviews": [
   "1/25/2020 8:55am\n\nThis place is located in a strip mall with a pot \nholed parking lot. The front decor is inviting. \n\nWalking in the hostess greeted us and sat us in a booth. Decor is water themed, fire hydrants, hoses, and piping. The place is clean. \n\nWaitress greeted us, she was pleasant. \n\nChecked out the buffet (10.99$) but decided to order off the menu. More for your money. \n\nUpdate 12:48p - you will get explosive poo if you eat The biscuit and gravy; the gravy was greasy, the biscuits were good. Temperature was lukewarm. \n\nFrench toast full order came out cold, with cold syrup but it was good. Soft and fluffy. \n\nHash browns are amazing! A must have. \n\nThey are stingy with their napkins... if your sever comes back allowing you to ask - you better ask before or while you’re ordering.\n\nThis is a good place for comfort food! Check them out...",
   "I was here in the morning 1.5 years ago over the weekend and ordered breakfast off the menu rather than the buffet.  I remember good service, large portions, fresh tasting food.  This time I went with family and had the buffet.  The hot food was mediocre.  It was about what you'd find in a nicer free hotel breakfast with sausage, bacon, scrambled eggs, pancakes, french toast sticks, hash browns, sausage and biscuits.   Toppings were strawberry sauce, syrup, honey butter, cheese sauce.  They had a small selection of fresh fruit and cottage cheese.  Missing were toast, bagels, salsa, cream cheese, dispensers  with coffee, juice, grits, oatmeal, cold cereal,  granola, yogurt, nuts, raisins, cheese, cold salami, milk, muffins, donuts, tea (some of these could be bought separate and delivered by waitress if you wanted it).  So in some ways a free hotel breakfast buffet is better than this one.  And the hot food didn't seem that fresh even though we got there 30 min after opening at 8:30am.  Good, place, just not the buffet unless you're not expecting much variety.   The decor is nice.",
   "We had breakfast here not too long ago. The coffee was very very good. Some of the best I've ever had. The biscuits and gravy was great. I ordered , The Emily.. I'm not sure why they named it that. It came with 3 eggs cooked to my preference,and a choice of ham, sausage or bacon. I chose bacon. The bacon was well cooked. They should've named it the Fat Alberta. Pan cakes looked great too. Their skillet meals were also very appealing. Clean restrooms. Nice decor,friendly staff quick service too.  So, if you're the owner, pls treat my grandmother and my aunt to a free meal, since they come in every morning. That would be cool. Oh and by the way, they have a rewards program.. eat 30 meals. Get 1 free. Great 1st impression for me.  Kudos to Dales!!!",
   "I had never even heard of this place. Took a chance and wonderfully surprised! The yeast rolls ate amazing and they have the best green beans ever. Loved the pork chop special. Will definitely be going back!",
   "Steak was ordered well done came medium well had to finish cooking it so it could be eaten ordered a baked potato they sent mashed potatoes. The chicken and dumplings had burnt dumplings and very little chicken. Was not worth the price."
  ]
 },
 {
  "name": "Bazbeaux",
  "address": "329 Massachusetts Ave, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/05f771c8-9331-11ea-a35b-14b31f159f22.png",
  "tags": [
   "food",
   "cheap",
   "family",
   "free",
   "eat",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=14211809174404941410",
  "source": "GoogleMaps",
  "reviews": [
   "The service here was great and so was the food! I ordered the house salad which was huge and 2 different dressings since I couldn't decide. They make all their dressings in house!!! I'm really particular about pizza crust and this was just right! It was not too soft and not too hard. Cozy and relaxed atmosphere. I'd definitely come back if I'm in the area!",
   "One of the best pizza places I've been to. Got the Mediterranean 16\" and large house salad and it was enough for 2 people plus leftover pizza. Cool bar and I like the cozy atmosphere. Service was a bit slow and not too friendly. Salad came out fast and pizza was came out in reasonable time. Good value.",
   "Wow. This a perfect place for hanging with friends and family. The environment is relaxed. The workers are focused on great customer service. I ordered the salad, gluten free pepperoni pizza and Mr. Pibb. I enjoyed watching the pizza making theater happening in the window. The guys preparing the pizzas were having so much fun making the pizzas. I could tell they enjoy what they do as well as each other. Its probably why my pizza tasted so good. There was soft crisp texture to the crust and the sauce was sweet tomato with a hint of peppers. I also love the sliced tomatoes in my salad.  They too were sweet. Also the price was amazing. I was really surprised who cheap my meal was. Wish I could get them 6 or 7 stars!",
   "Place was pretty cozy. You can eat inside or out. First time there and won't be last. Pizza was very good. Staff made Bazbeaux feel you welcomed",
   "I mostly get here for lunch where you walk up and buy by the slice. Each day they sell four different pizzas by the slice. You can also order from the menu if you wish."
  ]
 },
 {
  "name": "Hyde Park Prime Steakhouse",
  "address": "51 N Illinois St, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/063ec9fa-9331-11ea-8790-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2072235294711497572",
  "source": "GoogleMaps",
  "reviews": [
   "Honestly one of the best steakhouses in the city. Service is always excellent and the food is even better. Can never go wrong with a smoked old fashioned and a tomahawk steak.",
   "Came here for the Wagyu Steak, and it is absolutely worth it! I thought it was fun how they had a certificate of authenticity for my steak and how they showed us the steak before it was cooked. Absolutely beautiful inside and the chairs for the tables are really comfortable. We had carrot cake for dessert and frankly we needed more people because the slice was giant! Photos don't do it justice. Make sure you get some coffee with your dessert because it is amazing. The staff is phenomenal and they were extremely helpful with all of our questions!",
   "To start I wish I had more pictures of the other food I had as well, but it was just so good I completely forgot. This was the second time I’ve had wagyu beef and I must say, it never disappoints. For anyone that has never tried it before I highly recommend it.",
   "Went for my boyfriend and I's second anniversary, and our minds were BLOWN! Fabulous food, staff, and ambience! One of the best culinary experiences I've had for sure. We will be back!",
   "The magnificent atmosphere, the cheerful wait staff, and the memorable food were all beyond spectacular! The buttery filet mignon and the succulent lobster tail that melted in your mouth were some of the best I've ever had! We went for our 5 year anniversary and we received a wonderful note from the staff giving us their best wishes as well as a smores dessert that was warm and ooey gooey! May not be a normal date night trip but definitely worth the special occasion trip!"
  ]
 },
 {
  "name": "Hedge Row American Bistro",
  "address": "350 Massachusetts Ave Suite 150, Indianapolis, IN 46204, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/068a2c34-9331-11ea-84fa-14b31f159f22.png",
  "tags": [
   "kids",
   "delicious",
   "unique",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11245312919617022117",
  "source": "GoogleMaps",
  "reviews": [
   "We love going to Hedge Row for Sunday brunch. Their bottomless mimosas are a great deal. The farmers breakfast or the burger are usually my go to order. The staff is always friendly and attentive. Patio is awesome when the weather is nice. Typically we do not have a long wait time for a table which is rare on Mass Ave.",
   "Loved it.\nGreat menu of starters and sides. Actually had an entire meal from that, without trying the main courses. The Brussels sprouts are amazing, and so is the pork skewers.\n\nWill definitely return when back in town",
   "The dishes were flavorful. Good size portion, but definitely not \"a lot\" on any plate. Spicy stuff was actually spicy and not mainstream spicy. Cocktails were pretty good, we had a couple of the signature cocktails and were not disappointed. Service was not the most cheerful but was speedy so I wouldn't complain but others might. Environment is clean, modern yet pretty warm. Overall, definitely a nice location for adult meals. I would not recommend for kids. I don't know if they had a kids menu but the main menu is not very kid friendly items.",
   "Hedge Row is a lively bistro. Food was well prepared and delicious. Vibe is very relaxing, warm, and inviting. While enjoyable and unique, the cocktails could be a greater volume for the price. Service could use a polish—uncomfortably long waits between waitstaff stops and had to flag once or twice. Otherwise great!",
   "This is a nice establishment with a unique restaurant lay out and open kitchen concept.  We enjoyed our food, which you could tell was all made with fresh ingredients.  \n\nWe ordered the hush puppies, which I typically don’t enjoy, but these were phenomenal especially with the syrup on top.  The kale chicken salad was prepared well with tons of great ingredients making it tasty.  Lastly, the chicken sandwich was the least favorite of ours, but it was still good just not great.  However, the fries save this dish because those things are some of the best fries I’ve ever encountered.  \n\nEveryone at the restaurant was friendly and genuine it seemed, besides our server.  She just seem disengaged and in auto pilot.  Honestly that’s the only reason I gave a 4/5.  I’ll still definitely go back because everyone has an off day and the food was incredible!"
  ]
 }
]