[
 {
  "name": "Mississippi Civil Rights Museum",
  "address": "222 North St #2205, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/06d5ca6e-9331-11ea-8ec8-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "history",
   "history",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1264626766470263930",
  "source": "GoogleMaps",
  "reviews": [
   "Everyone living in or visiting Jackson MS needs to see this incredible museum. It’s good to see Mississippi Civil Rights history next to the national history. No one teaches enough about the unsung hero’s of the movement that made important strides and progress over time. Come here to learn and soak it up!",
   "It was an amazing place. Somewhere to really get connected to what has happened in Mississippi. I highly recommend the experience to everyone, all type of people. We must be aware of our history.",
   "Gorgeous museum. There is so much history, physical history, that I was in awe of. This is a very in depth, long term visit so be prepared. It's a deep, emotionally exhausting journey and should be explored at every point. Please go see this museum. It is absolutely moving.",
   "Very powerful. Very well designed.  Brought my kids here (12 & 13 yrs old) during our 2000 mile road trip through several states.  This was, far and above, the most moving civil rights experience we had.",
   "While I am relatively new to the state of Mississippi, I am quite familiar with the history of the struggles people of color have waged (and continue to wage) for equal rights under the law.  My experience at this museum yesterday afternoon was insightful, educational, inspirational, emotional, angering at times and yet powerful beyond words.  There is simply too much there to internalize in a single visit and I will be going back.  The museum directors have done an exceptional job of organizing a phenomenal collection of local Mississippi knowledge, insights and historical artifacts under one roof in a very impressive facility.  It is difficult to understate the centrality of the state of Mississippi to the experience and history of African Americans in this country.\n\nI also look forward to visiting at some point the other museum right next door to better understand the way the curators may have presented any  intersectionalities among the two collections of historical perspectives.\n\nAdditionally, I want to commend the museum staff for being incredibly helpful, friendly and professional.  I stumbled across this museum while out for a Saturday bike ride and since they didn’t have any bike racks on the premises, the security guard was kind enough to allow me to keep my bike in the vestibule while I visited the museum.  (Incidentally, since there are new bike lanes springing up all over downtown Jackson, it appears there is a movement to make the city more bicycle-friendly.  What better way of reinforcing this theme than to have bike racks located at civic institutions all over the city?)\n\nFinally, perhaps my most personal insight from this first visit stems from the recognition that such a museum needed to be created in the first instance—and make no mistake about it, this museum NEEDS to exist.  This reality alone speaks volumes about society’s ongoing ‘three steps forward, two steps back’ approach to progress in fulfilling the original call of the founders for ‘a more perfect union.’\n\nI’m a new fan of this museum and will support it going forward!"
  ]
 },
 {
  "name": "Mississippi Museum of Natural Science",
  "address": "2148 Riverside Dr, Jackson, MS 39202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0724c4d0-9331-11ea-998e-14b31f159f22.png",
  "tags": [
   "unique",
   "nature",
   "tour",
   "knowledgeable",
   "free",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=9206655217532860533",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely scientific museum in the center of Jackson, MS!\nLots of unique specimens and dioramas.  I feel in love with the place when I noticed they had one of the best Passenger Pigeon specimens I've ever seen.  \nGiant ground sloth?  They got one!\nMastadon skull?  Yep.  Got that, too!\nScience and nature lovers will really enjoy this unique place!",
   "Lots of stuff to see out front in their display and aquarium sections.  The behind the seen labs are where the magic is.  I believe they said they had between 2 and 3 million specimens stored on site.  We saw a ton of them and didn't scratch the surface.  Really cool tour.  Thanks to all our MDWFP personnel for all you do to protect and serve our natural resources. Y'all are awesome!",
   "Museum was better than expected. Lots of information about the habitat and wildlife of Mississippi. When my sons and I were there, there was a dinosaur exhibit which was really cool. Live like dinosaurs on the outside with sounds and everything plenty of information and activities (may have to check daily schedule). The Aquarium was tho a few of the exhibits were closed. There was a small gift shop with fair prices.  Also there is a huge playground right outside of the museum area in which you can enjoy once you've paid to enter the park. If its summer months BRING WATER.",
   "Cool aquarium. Lots of free parking. Alligators,turtles, two headed snake and lot of fish. Pretty neat experience only down side not very knowledgeable or interactive staff.",
   "Great place to learn about Mississippi natural resources.  Looking deep into the far reaches of the past to see how Mississippi has come to be and the creatures that once inhabited Mississippi."
  ]
 },
 {
  "name": "Mississippi Children's Museum",
  "address": "2145 Museum Boulevard, Jackson, MS 39202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/07652952-9331-11ea-b651-14b31f159f22.png",
  "tags": [
   "art",
   "music",
   "kids",
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9429186362770771731",
  "source": "GoogleMaps",
  "reviews": [
   "Negatives are: Military discount is only for a specific time frame and the 2nd floor is not accessible for people with strollers easily. \n   I really like the exhibit room and the extra Christmas touches. Perfect for preschool-kindergarten aged. They offer art, music and lots of dramatic play opportunities. The giant Scrabble board is definitely for older children or adults.",
   "So many different things for the kids to enjoy. They can spend a whole day just exploring. Very nice place to take your children.",
   "One of our favourite family spots in the entire state. Extremely well maintained. Worth a visit if you've got kids > 18 months",
   "My kids love coming here. 🤗 so much to do. You get many benefits with being a member! I highly suggest the membership for parents and kids.",
   "Went with my grandchildren and had a blast. The new slide they installed is so much fun. Always have great exhibits and the staff and volunteers really seem to love what they do!!"
  ]
 },
 {
  "name": "Medgar and Myrlie Evers Home National Monument",
  "address": "2332 Margaret W Alexander Dr, Jackson, MS 39213, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/07b94990-9331-11ea-98eb-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "tour",
   "history",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=11963181174064276941",
  "source": "GoogleMaps",
  "reviews": [
   "I've been going to Jackson for over 30 years and finally took the the time to stop by and visit this historical sight. The home is well kept. We actually had one of the neighbors come out and share some of his knowledge about this tragic assassination. He was able to point to the spot that the shot was taken. We didn't get to tour the inside because it was pretty early when we stopped by.",
   "My husband and I enjoyed visiting the home of Medgar and Merlie Evers. This visit was very insightful and educational. I would advise everyone to take their children to see this history.",
   "This is a hidden gem in Jackson. It's small and not too overwhelming like the larger museums. It has a nice timeline wall. They could do better with the room setup. But I loved the place.",
   "Excellent  Historical place to visit.  This is in a neighborhood so be courteous when parking.   Be sure not to block driveways and please do not litter.",
   "Gripping oral history of Medgar Evers' ultimate fate and his impact on the Civil Rights movement. Currently it's ran by Tugaloo College but the Parks department is taking over shortly which means it will never be the same. I'd go as soon as possible to get the full experience, otherwise, there will be a tour from a federal agency that has been gutted financially in recent years."
  ]
 },
 {
  "name": "Mississippi Museum of Art",
  "address": "380 S Lamar St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/07fbf84a-9331-11ea-a847-14b31f159f22.png",
  "tags": [
   "free",
   "art",
   "art",
   "art",
   "history",
   "family",
   "art"
  ],
  "link": "https://maps.google.com/?cid=7875376874147181517",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best museum that we have ever visit.\nPros: The place is pretty nice both from the outside and the inside. They are free so it is so amazing and everyone can come and visit that is so awesome. Let me pay the excise be a “special and there’s many activities that you can do while you are there. \nCons: There’s not a lot of parking space and it is downtown so that may be quite something going on. Because it is free so there’s not many special pictures of arms that you can see.",
   "Yesterday I got to experience an immaculate art exhibit created by Nick Cave and curated by amazing young individuals here in Mississippi. I cannot wait to see what they and the museum has to offer next! This was truly a blessed experience .",
   "The Art Museum is a great place to explore and enjoy exhibits and art work . But I really enjoy the level of service they offer for groups or individuals who choose to rent spaces for special events.\nIt is absolutely awesome and they offer a variety of menus for every occasion. \nThe fees and prices are easy to view on their website. Menu options and request are made after contacting the Museum by phone or email probably.",
   "Came during one of their \"Art and Coffee\" events, and it was very excellent. The staff makes you feel welcome, the speaker was very interactive and informative while also providing great insight to the history and culture of the pieces presented.",
   "I will be returning for more amusement as well as knowledge. My children enjoyed the variety of art. The one on Medgar Evers was my favorite of all. This is an awesome museum to take your family on a beautiful day."
  ]
 },
 {
  "name": "601 Escape Rooms",
  "address": "839 State St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/083ff5e2-9331-11ea-9490-14b31f159f22.png",
  "tags": [
   "creative",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=5623977432783696617",
  "source": "GoogleMaps",
  "reviews": [
   "This was a great place. I went on a school trip here and the room was fun. The hints were good and the puzzles were challenging. I liked the hints and how suddenly stuff went out of our expectations. It was really creative and I really enjoyed this place.",
   "I have done 6 or 7 escape rooms in the past few years. This was one of the good ones. We did the prison escape room (I forget the name), and we were successful. There were only three of us, which I think was a good thing, because the room was very linear. That's not a bad thing, not at all. However, I think that if we had had a larger group there would have been some people standing around waiting for something to happen. For three people, it was perfect though. We really enjoyed ourselves! The girl running the show was VERY polite and VERY friendly. We ended up chatting with her for a while after we escaped. All in all, a very good experience, and worth your time if you like escape rooms!",
   "We had so much fun! I can’t wait to do another one! We booked “prison break” and it was so fun! I took three 12 year olds and they were so excited! They needed a lot of help. We escaped with only 1:14 seconds left! The staff is great and very helpful. My only negative is the location and the parking sucks, but as soon as you walk in it’s great! Great setup! It looks like a real set!",
   "Booked the “Lost Cabin” for my daughter’s 16th birthday! We had so much fun trying to escape! One of the best escape rooms we have been to! Thanks for a great time! We will definitely be back!",
   "No words can describe how much fun this was. I have been bragging on this place since July 12th and it's had such a huge impact on how I view the people I went with. Me and my work family/friends did the \"Prison Break\" room. We all work at a jail so this should  be a breeze we thought.  But oh were we so wrong. It took us working together as a team to escape with just two minutes left. The intensity was at an all time high after thirty minutes had passed. We laughed \"ALOT\", the staff were so helpful as they helped us with the clues. It was so hilarious and serious at the same time. This would be great for team building. Get you the best group of like minded people you know to enjoy the fun with you. Its going to take all of you to win. Very challenging and exciting.  It's worth  every cent...I can't wait until our next visit. I will go anywhere with the group I was with, because I know we will survive anything together. Have fun...♥️."
  ]
 },
 {
  "name": "LeFleur's Bluff State Park",
  "address": "3315 Lakeland Terrace, Jackson, MS 39216, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/089d3c5e-9331-11ea-bb23-14b31f159f22.png",
  "tags": [
   "eat",
   "walk",
   "cheap",
   "walk",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=18333674287180082174",
  "source": "GoogleMaps",
  "reviews": [
   "Traveling to Texas, and found this park a convenient location in Jackson MS. Pulled up to the gate to check in a few minutes after 5. No way to get.  Finally,  someone else leaving the park explained that we had to \"go online\" and pay and they would email the gate code. Very confusing to say the least. Once we managed to get into the park, we got our campsite and it was a mud hole.   The lake looks like a mud hole too.  But, on the bright side,  we're heading to the outlet mall in Jackson to shop. And we hear that there are some really good places to eat nearby.   Maybe it will get better!",
   "Beautiful place to walk and look at our gorgeous forests and rivers. It's not too hard of a walk, and the paths are pretty decently taken care of, even if they're not long. You wont regret coming to see it!",
   "We love it!! Best place ever--they just reopened after flooding so its a little muddy, but cheap laundry, hot water showers, great fishing, good tv & cell coverage- beautiful place right here in Jackson",
   "Very nice place to walk in shade around thr lake and play on the small playground. Would be nice if there were more biking trails as we have small kids and I didn't really want them on the roads, even with 15mph speed limit. Nice boat ramps to Pearl River. $4 entrance with vehicle. $.50 each person if on foot or bike. Can park at the ballpark next door. Quiet in general and a fair number of folks using the pavilions and camping facilities but not overcrowded on a Saturday. It's great to have this place right in Jackson. They also have trails to the museum area which may allow walking access to the bigger playground and picnic areas there. Will check it out next time. Thanks!",
   "Went the last hour before close. Super clean and we had a blast. Great roadtrip stop."
  ]
 },
 {
  "name": "Old Capitol Museum",
  "address": "100 State St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/08e7a5f6-9331-11ea-9b31-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "free",
   "kids",
   "tour",
   "free",
   "history",
   "free",
   "tour",
   "free",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=4781947317424207620",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful museum. Free entry. We all learned a lot about history that you can't just learn in books. The kids really enjoyed it. Gentleman at the beginning was super helpful in guiding us the right direction and they had a wonderful map. He also informed us that we could tour the new Capitol building as well. Great place!",
   "Beautiful and free!  Undergoing repairs to exterior now, don't know what else is planned.  Glad Mississippi is preserving it and the history.",
   "Fantastic that this building has been preserved and is continuously being renovated. Great historical site and free!",
   "Enjoyed the history and the views. Free self guided tour. Awesome museum.",
   "Beautifully restored with helpful docents and plenty of exhibits. Definitely worth carving an hour or two out of your day to explore Mississippi history."
  ]
 },
 {
  "name": "Mississippi Agriculture and Forestry Museum",
  "address": "1150 Lakeland Dr, Jackson, MS 39216, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/092df00c-9331-11ea-bbf6-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "wander",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7687106239260140894",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic for kids. Passionate curators. Lots of hands on activities. Fun family events.",
   "Great place to wander around and see old tractors, buildings, and more. The Fitzgerald collection (medium sized building on the right) was full of arrow heads and great antiques. One of the best buildings in the whole complex.\n\nThey had a cotton gin that is said to be the oldest operating cotton gin in the country. Plus, they have a general store. Drinks were expensive but the guy at the counter was really nice and made sure to tell us about some of the interesting buildings that others typically miss.\n\nOverall a great place to visit",
   "My children and I really enjoyed it. It hasn't changed too much since I first seen it as a little girl.",
   "A pleasant place with a nice display of agricultural tools. Outside there is a recreated village with structures from the 19th and early 20th centuries. There are several large model train exhibits that are of interest.",
   "There's an Auditorium for meetings, outside is large area to visit and see Carnival's, Kraft Show's, Food Show's ect. On the Property there's Restaurant with a Lunch Buffet, a General Store & Museum. This is a Very Good place to take Children on a day trip."
  ]
 },
 {
  "name": "Museum of Mississippi History",
  "address": "222 North St #1206, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/09767f4a-9331-11ea-8d6a-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13312047682092463961",
  "source": "GoogleMaps",
  "reviews": [
   "The Museum of Mississippi History was a great place to visit. There was so many different things to see and experience. Plan to spend more than a couple hours here if you want to see everything. The work and detail put into the exhibits throughout the museum is exceptional.",
   "Very nice museum covering the history of Mississippi. The museum has 2 floor with many different aspects of its history. It begins with the native Americans through the present.  This museum is in the same building as the Civil Rights Museum. There is a free-parking building right next door. There is also a museum store right at the entrance. There is both an elevator and stairs to take you to the second floor. The museum is only a few miles off the interstate so anyone passing through  Jackson should stop by. I would definitely recommend this place to others both young and old.",
   "A Great Presentation of Mississippi History overall. Glad to see a large portion on Native Americans.",
   "Very nice exhibits",
   "Very nice and very informational."
  ]
 },
 {
  "name": "Smith Robertson Museum",
  "address": "528 Bloom St, Jackson, MS 39202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/09ba8d36-9331-11ea-adde-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "family",
   "educate",
   "history",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=17035800391533383954",
  "source": "GoogleMaps",
  "reviews": [
   "So much local history. Loved the pictures!",
   "This is a place Mississippians should definitely visit. It was really detailed and enjoyable. I love learning about MS history especially Black history.",
   "Great place to take the family to find out about African American",
   "This is a place everyone needs to experience! Being a Mississippi native, I can honestly say this was one of the most important discoveries my wife and I made. Full of so much great history and facts.\n\nAny negative reviews are only here to discourage people from learning about the awesome black history that was made in Mississippi.\n\nPlease, educate and appreciate.",
   "Great place to visit. Very educational. Friendly environment.  Kids friendly."
  ]
 },
 {
  "name": "Eudora Welty House & Garden",
  "address": "1109 Pinehurst St, Jackson, MS 39202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0a0db678-9331-11ea-a995-14b31f159f22.png",
  "tags": [
   "learn",
   "tour",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=6036058181286736726",
  "source": "GoogleMaps",
  "reviews": [
   "Worth learning about, could learn most about it by a through reading in the welcome center.   Was interesting looking through the house.  $10 tour fee goes to a good cause.",
   "When visiting Jackson you must visit.",
   "went on a school trip here the staff is very nice",
   "Very interesting piece of literature history.",
   "Great writer, great history. Wonderful staff."
  ]
 },
 {
  "name": "Mississippi Sports Hall of Fame & Museum",
  "address": "1152 Lakeland Dr #4701, Jackson, MS 39216, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0a6eafee-9331-11ea-ac62-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=12981577081743438075",
  "source": "GoogleMaps",
  "reviews": [
   "This was my first stop when I got to Jackson, I'm a huge sports fans and like to enjoy sports museums for states who have them, so this one was a no brainer. When you first open the door you are greeted by an older women and gentlemen, both very nice folks. They have you watch about a 10 minute video on Mississippi sports, very nice short film. At first glance, I was amazed how clean and nice the museum was. As I proceeded to all of the memorabilia, I was expressed on the set up and how much stuff they had on display for all of the different athletes. I highly recommend making this one of your stops when visiting Jackson. You won't be disappointed if you're a sports fan.",
   "This is a fun place to visit. You start your visit with a movie. While entertaining, it is definitely a bit dated now. Clearly over 10 years old and showing its age in my opinion. The staff is super friendly and very enthusiastic about the place. There are many movie clips to watch throughout and you'll see many stars you recognize. The interactive exhibits- namely the one where you can record the call of a big play- are quite fun for everyone.",
   "Went for a birthday party in the community room (I guess that's what it's called). Very nice and roomy!",
   "While I wish it were a bit larger, the exhibits, staff, information, and price are top notch. A great place to spend a day along with the Ag Museum. Events are held here as well. An essential place to visit. 5 Stars!",
   "The facility was very nice and originally would've recieved 5 stars from me. However when I asked about why there wasn't any steve McNair memorabilia. The lady said they a lot it's just not on display because he was murdered, which is why it should be out on display.🙄 also there was  very little in Marcus Dupree & only 1 tiny article on steve McNair both of which were basically tucked away hidden in a closed off section. I feel like peoples personal biases and opinions should not overshadow what these missiapians talents and legacies. I was considering purchasing a lifetime membership but after that talk I was turned off & probably won't return. Which is unfortunate because the facility it very nice"
  ]
 },
 {
  "name": "Governor's Mansion",
  "address": "300 E Capitol St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0ab57d1e-9331-11ea-8acc-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "history",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=4883056150098300874",
  "source": "GoogleMaps",
  "reviews": [
   "Great architecture from the outside. I wish we were able to explore the inside!",
   "Beautiful grounds - enjoyed this lovely nativity scene.  Walk around and get a sense of the rich history.",
   "Very much a sense of depth in history, in that magical way only being starstruck can give you. Being there makes you feel like you somehow own a little piece, that you could belong there.",
   "Beautiful home. Great hostess. Ms. Debra Bryant invited us to walk through the home and allowed us to view all rooms. Pimento and cheese sandwiches were the best. Tuna sandwiches are second to none. Homemade for sure. Chocolate chip cookies, oh my goodness.",
   "Beautifully decorated for Christmas. The Bryants were very gracious."
  ]
 },
 {
  "name": "The Oaks House Museum",
  "address": "823 N Jefferson St, Jackson, MS 39202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0afd0d94-9331-11ea-8f03-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=593316413031382277",
  "source": "GoogleMaps",
  "reviews": [
   "Nice historical house. Pleasant tour guide. Bring cash for fee.",
   "Did not go in but looks great!",
   "Great tour guide. Interesting yo see what it was like so long ago",
   "Great history!",
   "Gardens are a delight."
  ]
 },
 {
  "name": "The Jackson Zoological Park",
  "address": "2918 W Capitol St, Jackson, MS 39209, USA",
  "avg_visitor_review": 3.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0b3e839c-9331-11ea-af0c-14b31f159f22.png",
  "tags": [
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=8412814209785178143",
  "source": "GoogleMaps",
  "reviews": [
   "Disappointing to see a Zoo run down. The girl who took our money was not the 'face of the zoo I was expecting - sullen. As a veteran I was entitled to a cheap entry rate. I didn't ask for it because it was obvious even before we went through the gate the Zoo was run down and that they need the money.\n\nMost of the animals looked depressed. The giraffe walked around in circles while the Asian bear struggled to breathe. Some of the enclosures were so antiquated they were falling apart.\n\nWe came to Jackson Zoo for a quick stop over and to be honest we couldn't wait to leave. I know that's harsh, but the presentation of the zoo has a lot to be desired.\n\nCome on Mississippi you can do better than that! It's clear your city leaders are failing you and with elections coming up demand action to fix your Zoo.",
   "I wish it was more donations rolling in to get the zoo back to its thriving days. It needs some upkeep for sure but the animals are pure joy. I enjoyed seeing the giraffe and I loved that tut the ostrich walks along the wall following you. He's cute. I enjoyed the zoo overall.",
   "The animals aren't doing so good and parts of the park is closed due to insufficient finances.  A lot of things are over grown and broken down. It would be a great idea for them to allow volunteers from churches to help out and clean up things",
   "Pretty nice smaller zoo.  It's apparent that they care for their animals.   Enclosures were clean and the animals looked to be in good health.   Large portions of the zoo were off limits and dilapidated. Entire buildings collapsing right as you come in to zoo.  It's really got a ton of potential, but it's pretty run down.  I'll bet In it's day,  this was a wonderful zoo.",
   "It looked like the zoo was on the upswing when I moved here in 2015. Sadly, when I went last week, it was more dilapidated than ever. The animals seemed depressed and lethargic. Many of them weren’t even in their exhibits. Buildings are falling in. The staff seems unengaged. We really can do better. It’s time for our community to pitch in and overhaul the zoo if we want to keep it."
  ]
 },
 {
  "name": "LeFleur Museum District",
  "address": "1152 Lakeland Dr, Jackson, MS 39216, USA",
  "avg_visitor_review": "",
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0b8fd81c-9331-11ea-b52a-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=13553267822541960103",
  "source": "GoogleMaps",
  "reviews": []
 },
 {
  "name": "Mynelle Gardens Arboretum & Botanical Center",
  "address": "4736 Clinton Blvd, Jackson, MS 39209, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0bd322f6-9331-11ea-b5e5-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=6822318252739596227",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped by to kill some time and was pleasantly surprised at how nice this place is. Very beautiful garden and peaceful to sit or take a stroll. They have food for feeding the fish in the pond with two arch bridges and a pretty fountain. Beautiful areas for events. I give 4 instead of five stars because although so beautiful and peaceful the landscaping is under renovation in some areas. I asked about this and they are owned by the city and lacking funding. With more public support this place has high potential to be a jewel in the rough in this city.",
   "5.00 per person is too much for this small garden. The garden is not very well cared for and needs a lot of work. Same for the house, it was basically used as storage, such a shame too because it's such a beautiful house.",
   "Love this place! Needs some additional funding it seems to restore it to its past glory!but it's still nice",
   "Needs to be Renovated. The up keep is poor. Not alot of visitors. For years I didn't even know what this place was. This was my first visit. I thought it would be a nice place to take pictures. It was okay.",
   "This is the place for a great reception, engagement, baby shower, or wedding! Nothing huge but wow what a view and what a feeling!!"
  ]
 },
 {
  "name": "Cathead Distillery",
  "address": "422 S Farish St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0c36f266-9331-11ea-958d-14b31f159f22.png",
  "tags": [
   "kids",
   "tour",
   "family",
   "tasting",
   "walk",
   "tour",
   "tour",
   "tasting",
   "music",
   "tour",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=5549489394351115662",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice distillery. It's great that it's family friendly and all the games on the tables make it fun for the kids as well as the adults. The tour was good and the tasting was nice. It's a shame that you don't get the souvineer glass like you used to. Good selection of beers as well.",
   "I had read some reviews and wanted to come by and check it out since they allowed pups. Upon arrival we really were taken back by the space as the decor was awesome! We grabbed a beer and found out due to MS laws that they couldn't sell mixed drinks on property but they did have tours where we can taste. So after a short wait until the next tour we had a great walk through with Zack and ended with some tastings. My wife and I enjoyed the vodka and bourbon (we aren't gin fans). After the tour I stopped by the gift shop for a hat and a bottle of bourbon for home since not distributed in Ohio as of yet. If I'm ever back in the area I will def be stopping back by!",
   "All the tasty things are made here. Hoodoo is amazing and vodka is tasty straight",
   "We went the day after Christmas and it was pretty empty, but that didn't stop Taylor from giving us her attention on a personal tour and tasting. The gin is amazing and the vodkas are great too. My bf really liked the bourbon, and we both raved about the chicory liquor. A super cool spot with good booze. Too bad they can't serve drinks there too. I bet the music festival is pretty awesome! #SupportLiveMusic",
   "We came for the yoga. Stayed for the tour and the tasting. Everything was excellent!"
  ]
 },
 {
  "name": "Cathedral of St. Peter",
  "address": "123 N West St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0c7a641c-9331-11ea-a85a-14b31f159f22.png",
  "tags": [
   "tour",
   "organized",
   "historic",
   "wander"
  ],
  "link": "https://maps.google.com/?cid=18271062552911109959",
  "source": "GoogleMaps",
  "reviews": [
   "Best church I have went to it's big and everyone is very helpful",
   "A beautiful Cathedral of the Diocese of Jackson, it is a very beautiful church and very nice tour organized by the Diocesan Archivist.",
   "I loved the ornate beauty and ambience of this church. Very welcoming place of worship.",
   "A church is a church is a church. But I would say this I believe is one of the oldest churches in the city if not the state. It is located in a very historic part of downtown.",
   "I would like to respond to the wedding photographer who “could not do their job” because they were not allowed in the sanctuary during the wedding ceremony. \n\nWeddings are not events purely for the ‘show’. This is a sacrament that Catholics take seriously. In the past when photographers were allowed in during the ceremony, they have been know to stand on the side altars, wander all around the main altar during Mass, or even asked to have the altar removed to allow more room ... all of which is totally disrespectful and does not allow the priest to “do his job.”\n\nThe best pictures are taken prior to the wedding, and believe it or not, some nice photos can be taken ‘through the glass’ on the vestibule doors. I know this for a fact ... because of my own sons wedding.\n\nThe Cathedral is a very beautiful and welcoming church."
  ]
 },
 {
  "name": "Enter/Locked Escape Rooms",
  "address": "6718 Old Canton Rd, Ridgeland, MS 39157, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0ccd1852-9331-11ea-a980-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "family",
   "family",
   "family",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=8297131859657073285",
  "source": "GoogleMaps",
  "reviews": [
   "This was so much fun! We played The Cleaners - it was challenging, but not so hard that we couldn't figure it out. The room was so well built. They did a great job with all the details - very realistic. There's also a major twist in the game, but I don't want to give anything away! The staff was professional and knowledgeable - they knew right when we needed help. This is a great way to spend an hour with friends!",
   "I've done escape rooms in Las Vegas and Los Angeles, and this room was every bit as well produced and run as any I've seen. The puzzles were fun and inventive, the room was laid out very well, and the production values were fantastic. \n\nOur guide Ashton was very friendly and helpful, and ran the room expertly. I'm not from the area, but next time I'm in town visiting I'll definitely suggest Enter/Locked as a great place for a family outing.",
   "My husband and I have played all of the escape rooms at Enter/Locked and they have all been a blast! They're fun, challenging, innovative, and completely original because the owners come up with the rooms themselves.  The staff was super nice and helpful before, during, and after our game, as well.  On this particular visit, we brought some newbie friends to play The Cleaners with us and everyone left so impressed! It's such a great activity to engage in with family &/or friends because it requires attention and teamwork (unlike a movie, etc.).",
   "My first escape room experience was excellent! What a great idea for a Christmas present for the family. Our group of five was perfect for the Murder Motel. The puzzles were pretty challenging for a novice but two in the group had previous escape room experience which was very helpful. We solved in near record time!",
   "...Our church group is scheduled to go in a month. We stopped in to get group pricing and a tour.The owner Pauline was so wonderful and very helpful. She helped us decide what level of challenges would be a fit for our group and gave us a peek at one of the rooms.\nThe facility is extremely modern with a streamlined appeal.computerized signin and convenient secure parking.\nEverything about Escape Room is well planned and thought out.\nThere are different levels of and games within the game.\nThe room we viewed was awesome and the owners skillfully crafted and designed it themselves...they should probably be designing for theme parks or movie sets...it's just that good.\nWe can't wait for our trip. Groups of 10 or greater get the best discounts.\nVisit their website...call them or stop by.it's better to make an appointment for the drop in visit. But the owner is wonderfully nice."
  ]
 },
 {
  "name": "Two Mississippi Museums",
  "address": "222 North St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0d0f2b8a-9331-11ea-8db8-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=674562491752254536",
  "source": "GoogleMaps",
  "reviews": [
   "We just had our daughters wedding at the Two Museums and the venue was perfect.",
   "Visited both museums.  Interesting facts about Mississippi through the years. The Civil Rights museum told a dark history of Mississippi.  It's a must see. Be prepared to spend a few hours taking it all in.",
   "Great history, great staff",
   "I salute the staff on their professionalism, courtesy and knowledge. I especially salute Pam Junior for choosing high caliber staff and volunteers. Everyone must visit...",
   "Visited for a TEDxJXN conference. The facility is beautiful and should make every Mississippian proud to have such a building dedicated to telling our story."
  ]
 },
 {
  "name": "Russell C Davis Planetarium",
  "address": "201 E Pascagoula St, Jackson, MS 39201, USA",
  "avg_visitor_review": 3.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0d64296c-9331-11ea-811f-14b31f159f22.png",
  "tags": [
   "unique",
   "family",
   "field",
   "drink",
   "kids",
   "eat",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9970266858619888851",
  "source": "GoogleMaps",
  "reviews": [
   "You are better off going to a middle school science fair.",
   "Like other reviewers, I have to say this place is in sore need for updating and it's a crying shame that the city doesn't support this adequately. That said, our Grandkid's Spring Break was different from the local schools and we were the only one's there, but the staff treated us royally and turned what could have been an awful experience (because of a car-sick kid) into a fun, unique outing.",
   "My family and I drove several hours on a Saturday to come here. I parked and fed the meter some quarters, but was later told the meters don't need to be fed on weekends, but I can't confirm that. Come prepared with a roll of quarters. I'd rather come back out to a car for $2.00 than to discover it's been towed. \n\nAs with anywhere, be mindful of your surroundings and lock your car doors etc. We did see several drifters and drunks in the area, so just be cautious. I wouldn't leave anything in plain sight inside the car. Put it in the trunk or take it with you. \n\nIf you prefer stairs to elevators like I do, the stairs are located in an outside support \"leg\" of the building. They look like narrow brick columns with doors. Open the door and be prepared to climb to the third floor. My husband found the elevator in the opposite leg across the street from each other. A security guard inside the glass doors of the main building had to radio for staff to come unlock the stairwell for me. They were very kind about it though.\n\nRestrooms are on the 3rd floor, as well as some water fountains in a back hallway. The restrooms are in desperate need of repair and I did not see a baby changing station. I can't confirm if the water fountains even worked, but there is nothing to buy to eat or drink here, so bring your own snacks for children or those with medical needs.  \n\nThere are some mostly empty glass display cases where you'll pay admission fees. Cash only, no credit cards. I didn't see an ATM. $8.00 for adults, $7.00 for seniors, $6.00 for small children, and **that's for each movie you want to see**. There are currently three different films and they last about 40 minutes each. Younger children will likely only care for one of the three at this time. Call ahead and ask questions. \n\nAs far as a planetarium, I was expecting to relax and watch stars for awhile to a different degree than was shown. I have a high school student taking Astronomy and this was the main reason for our visit. \n\nThere is nothing else to do here, but see a few pictures on the wall and sit and wait for the next film to start. There are a few old educational displays that are not plugged in or lit up, an unused popcorn machine and an empty Coca-Cola cooler. There are a few dollar store quality toy items for sale inside the display cases. I would just bring some glow necklaces and bracelets from the dollar store and surprise the kids with them and a Moon Pie or pack of space ice cream when you arrive. \n\nThe best seats for viewing are the back rows. I am sensitive to movement, so there were a few segments in the films that made me feel like the room was spinning around slowly like a carousel or like the entire floor was turning upside down, slowly to the right, but I'm sure not everyone is that sensitive to notice. \n\nSome of the other reviews mention broken seats which we did see. The seat backs are tilted back at an angle but are not recliners. There are arm rests between all the seats, that don't move, so these would not accommodate larger visitors. Think of old, narrow movie theater or auditorium seats. We also found alot of wooden sticks from eaten rock candy lollipops on the floor. My husband said the theater smelled musty to him.\n\nThe staff here is very friendly and can help you find other things to see in the area. Educators can call for field trip packets and information.",
   "The Russel C. Davis Planetarium is one of two planetarium statewide. It is located in downtown Jackson and is dedicated to imparting knowledge about space earth the environment the human body and the sciences in general. For those who don't know the domed ceiling is used as a screen and movies about various subjects are projected there. The movies generally take you to the place described for instance space or inside the human body. If you're in town with kids this may be a fun distraction. If you are local and happen to never have been you definitely should go.",
   "I take my grand children there at least once a year. It is very entertaining and informative."
  ]
 },
 {
  "name": "Winners Circle Park",
  "address": "100 Winners Cir, Flowood, MS 39232, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0da1f7a4-9331-11ea-842f-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "kids",
   "free",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4454325228718501489",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to stretch your legs, play tennis, or let your kids play. \nI discovered this place by accident.  It is a real gem in the middle of the concrete jungle.  It has a sidewalk walking trail which has some various exercise stops along the route. Many tennis courts. Barbecue grill with benches under pavilions that you can reserve.  And it has playgrounds for various ages.  \nParking is good and it has clean rest rooms.  Well maintained. It is a nice break for being in the city.",
   "Great place to hang out, exercise or just play with your kids. A really nice walking trail, amphitheatre, kids play equipment, covered picnic tables, and restrooms. Very well maintained and very popular with the locals. If you need a little free exercise, this is your perfect  destination.",
   "An amazing park, very well kept. And the rubber surface is very forgiving for my overly confident toddler. Can be very busy at times but if you go earlier in the day you can have the place almost to yourself.",
   "We loved this park....   it was clean well kept.  The playground didn't have broken equipment or anything. The kids and ourselves had lots of fun...",
   "Beautiful, clean park with soft surfaces so children don't hurt themselves if they fall while running and playing.  Lots of shaded areas."
  ]
 },
 {
  "name": "Parham Bridges' Park",
  "address": "5055 Old Canton Rd, Jackson, MS 39211, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0de89da8-9331-11ea-acb4-14b31f159f22.png",
  "tags": [
   "walking",
   "family",
   "walking",
   "walk",
   "walk",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=5726913272233391979",
  "source": "GoogleMaps",
  "reviews": [
   "GOD IS GOOD. GOD BLESS. GOD PROVIDES. PHILIPPIANS 4:19.    \"CLEAN and a RELAXING place to be at.\" THANK GOD. TO GOD BE THE GLORY FOR EVER AND EVER AMEN. HALLELUJAH 🙌 PRAISE HIS HOLY NAME.",
   "Nice walking trail. Just be aware and alert of your surroundings. High crime area. If are a female don't go to far on trail by yourself. It looked a bit dicey.",
   "This place a great for family walking as well as individual physical fitness. This location also have outdoor equipment. This has been added since my last visit. Great alternative to joining a gym that you will never have time to visit.",
   "If you need to take a walk and get rid of some anger, this is the perfect place. I've been coming here for years and it's still the same.  The whole track is 1 mile long and it's not boring.",
   "Nice spot for an outside workout, walk, run! One of the nice parks in this area."
  ]
 },
 {
  "name": "International Museum of Muslim Cultures",
  "address": "201 E Pascagoula St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0e3a2a9e-9331-11ea-8d49-14b31f159f22.png",
  "tags": [
   "art",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7526646929936472660",
  "source": "GoogleMaps",
  "reviews": [
   "Such a treat to find this museum, and in Mississippi of all places! Right now they are in the process of slowly moving to a new location.  You can see an exhibit on manuscripts from Timbuktu that date back to the middle ages at one of the MS Museum of art  complex buildings. The new location on Capitol Street is where the introductory exhibits are located. Both spaces are only a few short blocks from each other.",
   "Excellent docents, well researched interpretation and attractive displays. A great museum to visit to learn history that isn't taught in school!",
   "Friendly staff. Very educational. Glad that I visited.",
   "It was wonderful to get together with the ummah today,  it was a privilege to sit amongst such knowledge and wisdom today at our company meeting...All praises and thanks to The Creator!",
   "Very educational museum with exhibits on Islamic Moorish Spain, on Timbuktu, Mali (Africa), and a new exhibit on coexistance and the similarities with Christianity and Judaism... An amazing museum to visit!"
  ]
 },
 {
  "name": "Battlefield Park",
  "address": "953 W Porter St, Jackson, MS 39204, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0e7c63fe-9331-11ea-9af1-14b31f159f22.png",
  "tags": [
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2816181199275003651",
  "source": "GoogleMaps",
  "reviews": [
   "Pleasent and clean. I enjoy having a place like this to retreat from the city environment. I'd love to manage a park like this. The park is well maintained, but as a lover of such areas there are a few things I'd do to improve it. The staff i encountered was a bit rude, but I enjoyed myself.",
   "Beautiful place. Environment was good. View was awesome.",
   "Big n has plenty of stuff for kids to play on. Basketball and baseball. Tennis courts n huge running area.",
   "I love going there we have our familt reunion there every year",
   "Clean park with lots of space and many structures for kids to play"
  ]
 },
 {
  "name": "Flowood Nature Park",
  "address": "4077 Flowood Dr, Flowood, MS 39232, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0ed29a86-9331-11ea-ae78-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "family",
   "walking",
   "kids",
   "nature",
   "walk",
   "family",
   "eat",
   "nature",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=6452044323503789375",
  "source": "GoogleMaps",
  "reviews": [
   "An extension of the kids park. I went for MD walk for my grandson and loved the view ( and the exercise). Only complaint was the bathroom stalls didn't all have tissue ( only 1 did). Park was clean and safe. Recommend checking it out!",
   "Very nice park with a great walking trail. First time here and will revisit soon. Great for photos and walking with your family.",
   "My wife and two of my kids actually drove all the way to Florence to check out the Flowood Nature Park on a Sunday afternoon. It was lovely...like a little Sanctuary in the middle of a sprawling metropolis. Reminded me a little -- A LITTLE -- of St. James park from our trip to the UK last year. Seriously, it's a very nice park and apparently very conducive to dogs (we have four but didn't bring any). Highly recommended.",
   "This park has a very nice nature walk! Has several benches along with multiple roofed picnic tables if you wanted to bring your family to eat or just come with a bite yourself, also has a place to grill! Really is a great park in a good location. I am thankful for all the companies sponsoring this location. Would recommend visiting!",
   "A lovely nature park with beautiful scenery! I enjoy it every time I visit"
  ]
 },
 {
  "name": "Crystal Lake",
  "address": "Flowood Dr, Flowood, MS 39232, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0f1977c0-9331-11ea-b061-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=5128932066529756476",
  "source": "GoogleMaps",
  "reviews": [
   "I love crystal lake. Quiet. Low traffic. Beautiful. Kayaking here is perfect. Flowood PD drives through regularly.",
   "Its a quick fishing spot. Hard fishing to test your skills",
   "This is a good place to kayak and a good place to fish. There are some great views of wildlife, including but not limited to foxes and alligators, here if you know where to look. The parking is great and bathroom facilities are available. There is a fishing pier as well. I have met a lot of friendly people here. Its a great place to get away to for a day.",
   "Nice quiet place. Some pretty good fishing.",
   "I love crystal lake. Quiet. Low traffic. Beautiful. Kayaking here is perfect. Flowood PD drives through regularly."
  ]
 },
 {
  "name": "Manship House Museum",
  "address": "420 E Fortification St, Jackson, MS 39202, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0f7024f6-9331-11ea-9088-14b31f159f22.png",
  "tags": [
   "music"
  ],
  "link": "https://maps.google.com/?cid=6653675116167782727",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent guides. Period music a wonderful touch. Engaging",
   "",
   "",
   "",
   ""
  ]
 },
 {
  "name": "Natchez Trace Multi-Use Trail",
  "address": "Ridgeland, MS 39157, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0fbe86dc-9331-11ea-be37-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=171886103674836111",
  "source": "GoogleMaps",
  "reviews": [
   "The scenery is peaceful.  The trail is paved, so ideal for running and biking.  Very clean.",
   "Nice trail along the natchez trace, section near the reservoir overlook is almost always shaded so its a nice place to walk even in the late morning or afternoon",
   "Historical marker along the highway that actually has a small parking lot.  You could park and actually read the information.  Nice idea.",
   "I take my boys biking and scootering while I rollerblade or run on this paved trail for miles. It is well traveled and safe during the day and there are benches and water fountains along the way. The rice road parking area or reservoir overlook are good places to park. Stop at the craft center! 😊",
   "You have to see this place in person."
  ]
 },
 {
  "name": "Freedom Ridge",
  "address": "253 W School St, Ridgeland, MS 39157, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/100b6e90-9331-11ea-ab2d-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15546985984956168474",
  "source": "GoogleMaps",
  "reviews": [
   "The playground is a lifesaver when you have small children and you still want to be close enough to watch the game!",
   "Great park, huge, lakeside. Shade!",
   "Great Ball Park and up to Date with all your favorite Ball Park needs. Great Staff and Umpires.",
   "Lots of soccer and softball fields. There is a wonderful shaded trail back behind the softball fields with a little pond.",
   "It's a good large playground for kids and adults too. There's a nice pavilion to have meetings, gatherings, reunions, and entertainment."
  ]
 },
 {
  "name": "Brighton Park",
  "address": "S, 530 Brighton Dr, Clinton, MS 39056, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/104f891e-9331-11ea-84d4-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "walking",
   "free",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=5385249844575192240",
  "source": "GoogleMaps",
  "reviews": [
   "So glad to have this facility in Clinton! Excited for the many upgrades the city has planned!",
   "Great place for the kids. Something for all of them",
   "Fin place to take children to play if over 5. 1/2 mile walking trail, does get boring if you want to walk several miles. The area is clean and safe.",
   "Great place to relax, get some exercise, play tennis, frisbee golf. Super clean and free.",
   "Always great to take your kids for a family outing! It's always clean, I put my bike on the bike rack on my truck, pack up snacks and beverages and we enjoy our outdoors time especially around this time of year when it cools down and it's not as hot"
  ]
 },
 {
  "name": "Old Trace Park",
  "address": "Ridgeland, MS 39157, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/10a8f3ee-9331-11ea-818c-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2671602723425758356",
  "source": "GoogleMaps",
  "reviews": [
   "The seagulls are beautiful to watch as they fly over your head and dive for the food that you give them. Gods  creatures can be so beautiful if you know how to appreciate them.",
   "The family and I enjoyed our picnic the tables and seating were clean but I still put down a tablecloth and covered the seats. The view was spectacular, atmosphere was peaceful. This was my second trip there this month, I found a nice clean and safe park for my family.",
   "Relaxing, by the water, picnic tables, walking trails and play park.",
   "One of the most beautiful park I have seen. Don't have enough words to describe it. It has everyyhinh u ask for..from picnic tables to boat ramp.beautiful sunset and windy wavy water....nice place to jog...huge place for kids to play around...dogs park and most importantanty it's clean and safe. Always love coming here...",
   "Had a fun time there. Nice sunny with the views and bugs. Be aware you would have to pay $5 if you try to park in the main entrance. I parked on the side and walked."
  ]
 },
 {
  "name": "Mississippi Petrified Forest",
  "address": "124 Forest Park Rd, Flora, MS 39071, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/10f008dc-9331-11ea-9aa9-14b31f159f22.png",
  "tags": [
   "tour",
   "walk",
   "history",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=12841686542585340926",
  "source": "GoogleMaps",
  "reviews": [
   "We stayed in the campground. I guess they had a lot of rain and we were unable to hook up to the sewer without sinking our camper in the mud. We were not permitted to look for a campsite before registering otherwise we would not have stayed. Because of the condition of the campsite and shower house, we did not pay extra to tour the forest. It was ok for a night or two quick stay but would not recommend it for any longer.",
   "Very nice place! Friendly and helpful employees. The gift shop has so many very beautiful items and gifts. Highly recommended!!",
   "The 1/2 mi trail isn't worth the entrance fee. Do yourself a favor and read a book/use online resource. Gift shop is cool",
   "An interesting piece of natural history. This attraction is privately owned and the owners are dedicated to returning the land to its original state (farming exposed the fossils). Why bother having a museum and nature trail, if you don't want people to see the logs in 50 years? $$$\n\n If you put up a fence around a bunch of petrified logs, charged people money to walk on a trail and look at said logs, and then were unfriendly, you would have copied the business model here. Hate to say it, but this gem is not worth the price of admission.",
   "Went not expecting much but I LOVED it.  The forest is beautiful and the museum and shop are so awesome.  They have the most amazing fossils I've seen in the museum"
  ]
 },
 {
  "name": "Sweet Olive Tour Boat",
  "address": "289 Dyke Rd, Ridgeland, MS 39157, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/114c0624-9331-11ea-8df9-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "free",
   "tour",
   "music",
   "nature",
   "family",
   "music"
  ],
  "link": "https://maps.google.com/?cid=7801552536104704447",
  "source": "GoogleMaps",
  "reviews": [
   "First off this is a very laid back & relaxing boat tour of the Barnett Reservoir. Although it was a hot afternoon in June when we went, surprisingly the boat is open enough to keep you at least comfortable and somewhat cool. The boat has seating with or without tables and there is good music playing. They offer free drinks (either water or soda) while on the tour. The tour is about 1.5hrs. You go about 45 minutes out and then back.There were only 2 other groups on the tour the day we went so it wasn't crowded.  We sat up front and the captain was very nice, and informative. He gave a thorough history lesson about the reservoir and the surrounding areas. I would definitely recommend this tour to anyone in the area especially if you want to relax and learn about the area.",
   "A very nice ride for an hour. very scenic, calm and refreshing.  Jason who owns the boat is very friendly and shared a great deal of knowledge. Must go and have the experience for your self.",
   "The boat ride was pleasant.  However, we were invaded by millions of mosquitoes which made for an unpleasant experience.   This is no fault of Sweet Olive, it's just nature.  Perhaps they can devise a way to keep out the mosquitoes.",
   "I just seen it passed by when fishing on my dad's boat",
   "I invited my friends and family for a cruise on the Sweet Olive in June.  It was so beautiful and relaxing on the Rez that three weeks later two of us returned for a second cruise. The boat is clean and comfortable, the music is nice and Captain Jason is so gracious.  The hospitality is unbeatable. The next time you see the Sweet Olive Boat passing by, just wave to it because I just might be on my THIRD cruise waving back to you.  We loved it!"
  ]
 },
 {
  "name": "Richland Eastside Park",
  "address": "100 Furr Dr, Richland, MS 39218, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1199a036-9331-11ea-9368-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4765243689101338674",
  "source": "GoogleMaps",
  "reviews": [
   "Great Park and well kept. The ONLY issue there is currently is that the Tennis court lights are set to shut off TOO EARLY.   The court sign says they are open until 10:00 PM but the lights shut off around 8:45 PM and you're not able to turn them back on.  It'd be great to be able to play at night when it's cooler especially during the summer months.",
   "Love to take my Grandbabies  there",
   "Nice walking trail, tennis courts, soccer, playground for younger children",
   "Very nice park for children and adults to spend some memories together",
   "Grandchildren love this park"
  ]
 },
 {
  "name": "Pelahatchie Shore Park",
  "address": "Brandon, MS 39047, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/11f0f34a-9331-11ea-aa9b-14b31f159f22.png",
  "tags": [
   "walking",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=18147202386079502903",
  "source": "GoogleMaps",
  "reviews": [
   "Great spot for morning sunrise. There is a disk golf corse, easy walking access to the beach, Kayak launch ramp that is ADA, picnic tables, and plenty of areas for the dogs to play.",
   "Definitely not the best place to fish. However, my husband did catch a bass using a purple worn. There is a perfect area  to \"picnic\" and for small children - the water is only about 3'- 4' deep.",
   "A charming, tranquil little park on the Ross Barnett Reservoir to visit for some reflective relaxation, stop over for a quiet yet scenic snack break on an otherwise hectic workday in order to decompress, or even engage in numerous small-scale activities or leisure exploration. It's not always about the \"size\" or \"popularity\" of any given park, and if you are looking for an easily-accessible rustic surrounding to immerse yourself in, then it's the smaller, less-touristy, less-crowded nature spots which can turn out to be the most magical and rejuvinating.",
   "Fun and challenging disc golf course here. A long 18 holes. The baskets are regularly moved between three different spots on most holes.",
   "We had a great time here!"
  ]
 },
 {
  "name": "Richland Westside Park",
  "address": "160 Brandon Ave, Richland, MS 39218, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/123b1fcc-9331-11ea-bea5-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4708778007762997345",
  "source": "GoogleMaps",
  "reviews": [
   "Great park for 6 and up. Big kids loved it. Not much to do for little ones.",
   "Good place to take kids for a little afternoon fun.",
   "Wonderful city park playground. New, safe, state-of-the-art equipment. Best attraction is the zipline, which my children enjoyed, and maybe we parents did too!",
   "Nice little park in town with great ballfields and even the fire station next door. The kids loved the playground.  Police presence was nice to see.  Thanks, Richland!",
   "The playground is new and my 4 year old granddaughter loves it"
  ]
 },
 {
  "name": "City of Jackson Fire Museum",
  "address": "355 W Woodrow Wilson Ave, Jackson, MS 39213, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/12928a7a-9331-11ea-9b91-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=15339116741028670124",
  "source": "GoogleMaps",
  "reviews": [
   "What a great museum. A real gem inside the city.",
   "I went down the fire pole, it was so much fun!  Hooray!",
   "The students really enjoyed it here!",
   "This is a local fire station that also doubles as a fire safety and fire station history museum. It is open to the public though i do believe the majority of their museum traffic is school related trips. It is a very fun and interesting museum though.",
   "Was not open. No one to ask. Doors locked. No sign at back door."
  ]
 },
 {
  "name": "Cypress Swamp",
  "address": "Natchez Trace Pkwy, Canton, MS 39046, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/12da9010-9331-11ea-9484-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=10939052174106300828",
  "source": "GoogleMaps",
  "reviews": [
   "Very beautiful place, although shorter than I expected. The whole thing could be walked in fifteen minutes, but taking it slow will give you time to traverse and take photos. Great place to walk your dog, kids may enjoy exploring the area. Little fish can be seen swimming in the shallow water, while crickets chirp. Definitely recommend going",
   "Was pretty cool. Short walk around little swamp and the cypress and tupelo trees.  There are mosquitoes so be warned. No other wildlife except a squirrel.  But the next stop up there was an alligator in the river.",
   "Beautiful little side trail. Just remember IT'S A SWAMP. What lives in swamps? SKEETERS! Big black ones. Remember the Skeeter spray!",
   "Quiet little stroll through a beautiful still water area! Best time to go is in cooler months to avoid mosquitos, but if you wanna see the gators, go when it's warmer and later in the day. And be sure you bring plenty of skeeter dope or you'll surely be scratching yourself silly half a mile down the road!! 😂😂😂",
   "Loved visiting this place! The reflection water is wondrous. Be careful not to fall in! I highly recommend coming here!"
  ]
 },
 {
  "name": "Jamie Fowler Boyll Park",
  "address": "1398 Lakeland Dr, Jackson, MS 39216, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1324b8a4-9331-11ea-b22f-14b31f159f22.png",
  "tags": [
   "nature",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9610579208621709170",
  "source": "GoogleMaps",
  "reviews": [
   "The landscape is fantastic. Always neat and clean",
   "Location of WellsFest and other fun events in town. It's a little oasis of nature on the edge of Jackson.",
   "Beautiful!",
   "Very nice place to carry your family",
   "Very outdated.  Needs to be tended too."
  ]
 },
 {
  "name": "King Edwards Apartments",
  "address": "102 N Mill St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/137793fe-9331-11ea-8466-14b31f159f22.png",
  "tags": [
   "walk",
   "parks",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=1439510293254233953",
  "source": "GoogleMaps",
  "reviews": [
   "Good morning,\n\nI am extremely disturbed and offended. I frequent the city of Jackson. This is my second time in less the 45 days of being at your property.\n\nThis morning I came off of the elevator at 3:48am to await my driver. Noticing my driver had not yet arrived I decided to sit in the lobby to wait.  A few minutes later I’m approached by your hotel security guard being asked forcefully “hey, do you have a room here.” I looked at him and sir, don’t bother me.” He said “listen here if you don’t have a room here you can sit in here.”\n\nMind you, I’m sitting in the lobby with $7000 worth of Louis Vuitton luggage on, a $500 Robert graham shirt, $200 jeans and $300 Robert graham shoes. I am obviously no transient vagabond looking for a place to duck out of the cold.\n\nThe security noticed I was not going to accept being harassed without resistance said “I’m just telling you what she told me.” I asked “who is she”, he pointed towards the front. I then said tell her don’t bother me either. He continues to persist that I needed to leave. So I proceed to walk over to where “she was.” She is your night auditor Shonda; who is seated 40 feet from the elevator outside of your business center with her feet kicked up on a chair wrapped in a blanket watching TV. She is 40 feet from the same elevators I had just come off of. Had she not been so consumed in her television show she would have both heard and seen me come off of the elevator. I walked over to her and demanded her name and told her that the way she was seated over there the question should be asked is she a guest or is she working. She proceeded to demonstrate her contempt by jumping up and and grabbing a business card to hand to me.\n\nA white guest came off of the same elevator and was greeted with great kindness. Another white guest walked in off the street  with slippers and a robe on and a coffee mug in hand and was greeted with great kindness. But the black man is harassed, and disrespected.\n\nIt is disgusting that such blatant displays of racism are still apart of the American reality. Especially from one black person to another.\n\nI sent my complaint in, tangent manager responded promising to call me but never did.\n\nIf you’re a person of color this may not be the hotel for you.\n\nSincerely, a disgusted customer",
   "Small apartments for small people. The ceilings are like 4 inches from the floor. But they have a cool kitchen. And clean carpet.",
   "I currently live in the King Edwards.   I have the small one bedroom on the 12th floor I rented without visiting first due to being from out of town.  First of all the personnel Danielle M was so helpful with the application, questions etc.  Security guard, Parks was helpful ! .  I met Molly last week.   Molly is nothing but pure energy, delight .   She is a resource for things to do or where to go in Jackson.   She definitely knows what is going on downtown in the community and around the area.   The apartments are very nice.   I wish that they kept the stairways cleaner and the trash swept up outside.   I have noticed taking the stairs that the janitor or the repairman have left equipment, trash on the stairwells in between floors.   I love the rooftop and the little pool.   The workout room is nice along with community room.   The whole floor is quiet!    They have apartments on the 9, 10, 11, and 12th floor.  You do have to pay for your electric and internet .  Also parking is 75.00 dollars a month for covered in the garage but it’s worth it!!   You have keyed entry so your secure.  I love it.  Mailbox is downstairs.",
   "Beautiful lobby, but the rooms were rather small, plus you has to pay for parking",
   "These are the apartments located in the mixed usage King Edward Hotel. This hotel is a historic Jackson hotel which has been remodeled and repurposed to become a useful part of the community again."
  ]
 },
 {
  "name": "Dr. Reed B. Hogan, MD",
  "address": "2510 Lakeland Dr, Flowood, MS 39232, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/13ce1dd0-9331-11ea-8f53-14b31f159f22.png",
  "tags": [
   "performance"
  ],
  "link": "https://maps.google.com/?cid=2437736957107199869",
  "source": "GoogleMaps",
  "reviews": [
   "The procedure was easy. I did not experience any discomfort or pain. I would recommend others to just do it, you won't regret having it done. The staff is very professional and pleasant.  Thanks for treating me well!",
   "What impressed me more than anything was the fact that my doctor remembered exactly something that I said during our last meeting three months ago.  I realize that there has to have been a large number of patients seen by this doctor since then.  What the doctor remembered proved to me that I was truly being listened to and cared for.",
   "ONE EXCELLENT AND ALMOST NO AREAS WHERE I HAVE ANY PROBLEMS. Waiting in the waiting room  was the only area. \nThe other areas as waiting and changing out into gown and the entire rest of the areas were performance by nothing very polite professions. I had no entirely no places where people were nothing bit polite and profession treatment\n Sirs and mam's I was totally impressed in the whole process. Thank you for great process of my treatment at gi associates on 12/16/19",
   "Thank you Dr. Hogan, this was my 2nd colonoscopy with you. All went well both times. I appreciate your expertise. Everyone treated me so nice and they were all so kind. Keep up the good work!",
   "Nice facility. Very nice personnel from the check-in desk to the procedure room and every step in between.  Dr. Hogan has performed various GI procedures for me over the years. He is always very professional, very caring, and is never rushed. He is thorough in his questions before any procedure and makes sure you understand the results afterwards. He genuinely cares about the health of his patients."
  ]
 },
 {
  "name": "Fountainhead - J. Willis Hughes",
  "address": "306 Glenway Dr, Jackson, MS 39216, USA",
  "avg_visitor_review": 2.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1409c04a-9331-11ea-b87b-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=7997222935361727753",
  "source": "GoogleMaps",
  "reviews": [
   "",
   "",
   "",
   ""
  ]
 },
 {
  "name": "Vicksburg National Military Park",
  "address": "3201 Clay St, Vicksburg, MS 39183, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1465ed4c-9331-11ea-a34c-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "walking",
   "free",
   "history",
   "walk",
   "family",
   "history",
   "tour",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=5161370848257889155",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I take or grandchildren there.  They love this place.  They get lots of exercise and history lessons, as well as high quality together time.  Also an awesome place to walk in the evening.  If you time it just right and begin walking back to your car just before dusk, you will see numerous deer.  Bucks of all sizes hang together then does of all sizes hang together.  Sometimes they’re intermingled.  But to easily see 35 is putting a conservative number on it.  If you love wildlife, it’s definitely a place to go walk.",
   "What an experience!! There is so much to see, You will need a good 4 to 5 hours at least. So many monuments and history here. It really is so cool having history preserved and explained so well. Start off in the visitor center and catch the quick free movie on Vicksburg,  then drive through the park.",
   "Great, fascinating National Military Park. Wonderful movie with lots of great background for those like me whose school education covered the Civil War in its entirety in about a week.\n\nVolunteers Roger and Connie are wonderful. Roger knows a ton about the Military history and enthusiastically shares it in the depth appropriate to his audience. Connie knows the military but also the stories of area residents and the human history of living through such a lengthy siege. \n\nRoads are well marked with markers explaining troop positions and strategies. One of the best parts, though, is all the monuments donated by states, societies, and families to commemorate their troops, family members, and contributions to this battle. Some monuments were very ornate and impressive. Others were of a simpler design but equally impressive in their quiet, subdued way. \n\nBlue signs mark the Union positions and red mark the Confederates. History is always interpreted by the winner, so the slant is more Union, but it is nice to see the story of the Confederacy included in a factual, respectful way!\n\nI wish I had more time to walk the trails and see more of the areas on foot, as a soldier did over 150 years ago. (It's an amazing difference to see it from the ground on foot rather than your car. The roads are built to provide a higher vantage point. Trust me:  get out and walk around.)",
   "I liked starting the experience with the video in the Visitor's Center. It helped a lot with giving a full overview so that I could appreciate the driving tour through the park better. So I would recommend starting there.\n\nI also recommend visiting the Cairo Museum. I found seeing the boat especially interesting.",
   "An outstanding place to visit. The somber atmosphere will cause deep contemplation and gratitude for soldiers on both sides of the war. A really enriching place to visit. The entrance for vehicles closes early, but it's a beautiful place for an evening or early morning walk. The park hosts events periodically for patriotic events. They also do somewhat of a live reenactment complete with cannon fire."
  ]
 },
 {
  "name": "USS Cairo Museum",
  "address": "3201 Clay St, Vicksburg, MS 39183, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/14b2ae06-9331-11ea-8cda-14b31f159f22.png",
  "tags": [
   "tour",
   "family",
   "kids",
   "history",
   "unique",
   "walk",
   "knowledgeable",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9056374622201284418",
  "source": "GoogleMaps",
  "reviews": [
   "What an amazing National Park, spent the day here with my Jr. Ranger and my family, could have spent a week wandering this entire park. Such an amazingly thought out Park, the monuments and drivable tour was a perfect experience for everyone. Its mindblowing that so many had to lose their life over such a simple solution to the end of slavery, a very powerful experience for sure and a great place to road school your kids!",
   "A piece of history that most will never see. The museum, itself, is small but the Cairo remains are truly impressive. I highly recommend.",
   "The restoration and presentation of this civil war battleship is spectacular from bow to stern. The ship is beautiful in itself, but the architecture of the museum and the exhibits in it are unique and informative also.",
   "Any visit to Vicksburg national military Park should include a walk around one of the amazing ironclads that were in service turn the civil war. The national Park service has done a great job in restoring this sunken ironclad that was one of the vessels so important to the union victory at Vicksburg.  Being able to walk through it and around it was very impactful, and gave me the sense of what it was like to be a sailor on the vessel...",
   "Great artifacts, great layout, and knowledgeable staff on site. The history of the ship is so interesting. Take your time while you're here and ask the guides a lot of questions. They're glad to talk about the battles, the ship's history, and it's preservation."
  ]
 },
 {
  "name": "Bill Vance Park",
  "address": "120 Golden Estates Dr, Brandon, MS 39042, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/15065376-9331-11ea-9ebf-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4467302646118703541",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome park",
   "Great place to walk or run and great for the kiddos felt so safe!!",
   "How do u know I was even there?  Anyway  I love it.  I'm there  almost every day . Don't  tell anyone, but with my dog. Reminds me of paradise. No I wasn't  there. I'm old, but I'm not Adam.",
   "Nice quiet place to walk or jog.  Playground equipment for the kids and picnic tables.   No water or restrooms keeps it from five stars.",
   "Peaceful clean"
  ]
 },
 {
  "name": "Roosevelt State Park",
  "address": "2149 MS-13, Morton, MS 39117, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1551b6d8-9331-11ea-80e4-14b31f159f22.png",
  "tags": [
   "family",
   "parks",
   "nature",
   "parks",
   "kids",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=4509204994088493338",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful trails! There's a great family of beavers that live on the back end of Shadow Lake and they have an amazing set of tunnels going into their dams. We stayed in the cabins and will be back to enjoy the views again in June! Thank you so much for the wonderful time and the clean cabin. I haven't been able to just relax with my husband in SO long and we definitely needed this. Support your parks!",
   "This Park is Really Nice have so many amenities that you will not believe can find on a Forest Park the list is so big let see they have 6 Natural Trails, Huge Lake named Shadow Lake, have 109 sites for RV Camping, Primitive Camping Area, 4 Pavilions, Like 13 Cabins, They Have a Motel with many room's and all have windows to the lake, Boat Ramp, many Bathhouse all around the Park, they have a Water Slide and Pool, Fishing, Disc Golf, Playground, Alfreda Harris Lodge, Livingston Performing Arts Center, Ballfield & Tenis Court, Conference Room, Video Games, Pool Tables and many other things that I will not finish if continue so if have the Time Come and Visit also the Observation Tower outside on the Hill if is close ask and they opened for you. Enjoy and Love the Nature.",
   "The lake and scenery are beautiful, but the park is desperately in need of TLC. We were disappointed to see the lookout tower closed, vandalism in several places, worn out structures and fallen trees everywhere. It looks like they are operating on a tiny budget and what was once a magnificent resort-type retreat in now dilapidated and sad. The tennis court is overgrown, wood rot is noticable on many buildings. Canoe rentals have been discontinued, our cabin was very small, had no blankets (in mid-January), was missing toilet paper and a coffee pot when we arrived, but the office staff quickly brought a small coffee pot and toilet paper after we called to let them know (we didn't mention the blankets because we brought our own). The cleaning lady and the lady at the front desk were very friendly and helpful, but you can sense that they know the condition of the park has decreased from its former glory. Our cabin (#11) was tiny, but located right on the water. The room with two beds was smaller than a typical hotel room. The bath and kitchen also very tiny. There was a good size screened in front porch and huge screened in back porch (some wood rot made it feel unsafe in spots). Unfortunately, because the temps were so cold we spent very little time on the porches.  The cost to rent the cabin was $80 a night, but we've spent less for much nicer accomodations at other Mississippi State Parks. There is also a 2 night minimum for cabin rentals here, making this experience too expensive for a return visit.",
   "We pulled our camper in here and stayed for one night on a long trip from Tennessee back to Texas. This campground is so beautiful. We woke up to an amazing view in the woods and on the banks of the lake. It is quiet, peaceful, serene and just makes you enjoy camping. Sites are spacious. Clean bathhouse.\n\nAlso, pleasantly surprised to discover a little playground right behind our campsite. The kids loved it in the morning as we were packing up. They had a huge water slide too. We didn’t get a chance to use it but it looked awesome.\n\nWe could have stayed at this campground a couple of days if time would have allowed. \n\nEasily accessible off of I-20.\n\nVery friendly staff with southern hospitality.",
   "It has a nice lake to fish, swim, boat, or water ski in. It also has a swimming pool and a water slide if you don't want to swim in the lake. The staff was very nice. The cabin we stayed in (#11) has  screened-in front and back porches with picnic tables it has a bar-b-q pit outside. It sleeps 4 but has not been updated in a long time if I had to guess I would say the 70s. The beds were not that comfortable. There is no table in the cabin so you have to go outside on the porch to eat. I like eating outside so that didn't bother me.There is a refrigerator, stove, coffee pot, and microwave, but no toaster. If you plan on cooking you will need to bring your own pots, pans, ect. They is two very small pots, one frying pan, one big serving plate, spoon, fork, and spatula. plastic plates, cups, bowls and silverware for 4 and that it."
  ]
 },
 {
  "name": "The Manship Wood Fired Kitchen",
  "address": "1200 N State St #100, Jackson, MS 39202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/159cde92-9331-11ea-85fd-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "knowledgeable",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6608677868499527654",
  "source": "GoogleMaps",
  "reviews": [
   "Probably one of my favorite places to go in Jackson.  The bar is incredible.  It actually took my breath away when I first walked in, because it's just that stunning with it's floor to ceiling assortment of wines and liquors. That and the fact that the smell coming from the kitchen was divine - I was hooked before I even sat down to eat!  THEN I ate.....no matter what you try here , I promise - it will be incredible! The steaks, fish, pizza....you cannot go wrong. Oh, and their ranch dressing is drinkable. Seriously.",
   "The place was a little loud, this was first time  I was there when there was a lot of people. The food was excellent, I had a fire grilled whole red snapper which was very well seasoned and was enough for two people. My salad was large and very good also.  While Manship has a large wine selection they charge a premium price and then some.  Some wine by the glass were as much or more than the bottle price at other top restaurants. Service this night was a little slow and we had trouble flagging down the server for water.",
   "Food was very rich and wonderfully flavored. The wait staff was excellent, polite, and knowledgeable. This place is beautifully decorated with attention to detail. The tuna dip was so flavorful, and my fiance and I loved the short rib ragu, fennel lasagna, and the Spanish home fries.",
   "The pizza was good except for the basil being baked in the pie. It should go on top when the pie is taken out of the hob, it was nearly burnt. The Cesar salad was very good. It was covered in plenty of dressing. Most places barely put dressing on the salad. There was no hint of fish in the dressing, another plus. There is no salt or pepper available for customers at the table. I asked for black pepper and was given way more than needed in a little pot (see picture). Cut bread and olive oil with red and black peppers is served at the beginning. It was good too. I ordered the Smoked Gouda Grits which was good. The grits seemed to have yellow corn in them like polenta. The seats were dirty when we got to the table and had to be cleaned. We never could order anything to drink except for water. All in all it was a good meal.",
   "I really wish I could.have rated this higher. The atmosphere was great, as were the staff and our server. The flavor profiles for the food were a bit off. The complementary focaccia bread and oil were good, but oil needs to be served in a shallower dish so seasoning at bottom can be tasted. Crab beignets (crab cake balls) while full of crabmeat, lacked seasoning. The color slaw could use a bit of sweetness. The grilled chicken on my ceasar salad, while it was flavorful, the texture was off, slightly rubbery. The best parts were the sweet tea and the triple chocolate (white, milk, and dark) mouse. I would go back for drinks and dessert."
  ]
 },
 {
  "name": "Lower Mississippi River Museum",
  "address": "910 Washington St, Vicksburg, MS 39183, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/15e77c94-9331-11ea-9487-14b31f159f22.png",
  "tags": [
   "tour",
   "kids",
   "family",
   "tour",
   "field",
   "history",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13133377332519412923",
  "source": "GoogleMaps",
  "reviews": [
   "This place was fantastic. The staff was very helpful. It was pouring rain when we came in and they offered us paper towels to dry off with and gave us directions to start the tour. Lots of interactive items in the building .learned alot but the real fun was going on to the ship it was self guided and was incredible to see from the pilot house all the way down to the engine room with tons of facts along the way!",
   "I think this Museum is supposed to be geared towards kids, but as an engineer I loved it! I spent a lot of time here with family looking at the power of water and everything the corps of engineers has done to engineer the power of the river. A really fun place to stop by if you are visiting Vicksburg.",
   "A great way to get a glimpse of the Corps of Engineers mission on the Mississippi River and tour a large Corps vessel from pilot house to engine room.",
   "So much history presented really well. And we loved the boat! Would be great for school trips or a home school field trip.",
   "We have visited this museum EVERY year for the last five years.  It is full of history, and even with a four year old, the tour is very manageable on your own without a guided tour.  Great place to visit."
  ]
 },
 {
  "name": "Dr. Rhett Hobgood, Shoulder and Elbow Orthopedic Surgeon - Sports Medicine",
  "address": "1325 E Fortification St, Jackson, MS 39202, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=15637688810144373807",
  "source": "GoogleMaps",
  "reviews": [
   "I love how he explained things so that I could understand what I was going through. He was very sensitive to my feelings about my pain and was willing to do what it took to help me feel better.",
   "Dr. Rhett Hobgood @ Mississippi Sports Medicine and his staff are fantastic. The environment is nice and comfortable. Dr. Hobgood is great at explaining his diagnosis and surgical procedure. I highly recommend Dr Rhett Hobgood and staff at Ms Sports Medicine you can't go wrong . He's very courteous. They all were . Facilities are very sanitary.",
   "I was very pleased with the atmosphere. The doctor was extremely professional as well as attentive. I am very happy we chose this doctor and facility.",
   "All I’ve heard from people is how bad shoulder surgery is to repair my rotator   The entire experience with Dr Hobgood has been a pleasant one. Never had to wait longer than 5 min to go back & maybe another 5 to get seen.  The initial surgery went well & proper expectations set   I would rec him & facility to anyone.",
   "The atmosphere was very pleasant and the staff had very good personalities. Thanks for taking the time to assist me."
  ]
 },
 {
  "name": "Vicksburg Riverfront Murals",
  "address": "1201-1299 Levee St, Vicksburg, MS 39180, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/162f5b1c-9331-11ea-adf9-14b31f159f22.png",
  "tags": [
   "history",
   "walk",
   "tour",
   "family",
   "history",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=12946958424869661473",
  "source": "GoogleMaps",
  "reviews": [
   "Novel way to beautify the rather unattractive flood gates. Each gate is painted with Vicksburg history and an informational plaque.  Most of my pics are cropped, making it hard to realize, the murals are like 10 feet high by 20 ft long!! Worth a visit.",
   "Very nice murals along the levee, and a park/playground as well! If you go on the other side of the levee you can go right down to the water. There’s also a spot on the wall that marks how high the river has flooded at different times historically. Driving through old downtown Vicksburg to get here is an experience too.",
   "It was so interesting to see and read about Vicksburg back in the day. The murals were awesome! If you get a chance to go, it's worth the drive and the walk!",
   "It was pretty fun! I went with some family from Canada and we loved the history lesson the tour guide told us about the murals!",
   "Very nice historic location"
  ]
 },
 {
  "name": "Lake Lincoln State Park",
  "address": "2573 Sunset Rd NE, Wesson, MS 39191, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/167f449c-9331-11ea-af22-14b31f159f22.png",
  "tags": [
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=15664415669296334305",
  "source": "GoogleMaps",
  "reviews": [
   "Went overnight tent camping here with my son. We had a great time, the beach is very nice, the primitive sites could have used some seclusion but were well equipped. The hiking trail was quite disappointing a quarter of it passed through parking lots, not what you might expect from a nature/hiking trail at a state park",
   "Beautiful. Very quiet. So many options of things to do. We stayed in the cottages.",
   "We have another day to explore but so far it's great! Highly recommend the waterfront sites.",
   "Not fancy, clean, friendly staff.  Extra effort whenwe checked inaround 8 pm.  Knowledgeable re local interests.  Mostly permanent campers, but we liked it.",
   "Always enjoy fishing swimming and camping primitive or cabins... nice quiet place."
  ]
 },
 {
  "name": "Saltine Restaurant",
  "address": "622 Duling Ave, Jackson, MS 39216, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/16da7006-9331-11ea-9fbd-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "foodie",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3175772528889790007",
  "source": "GoogleMaps",
  "reviews": [
   "What an amazing restaurant! First time to Jackson and I was blown away by how delicious the food was. I ordered the Comeback Chicken Sandwich and my girlfriend had the catfish and chips. Both were outstanding! It has an interesting vibe and feels like you’re sitting in what used to be an old college lecture hall. We’ll definitely be coming back the next time we are in Jackson.",
   "Absolutely delicious! And the service was excellent! Very personable! 100% recommend. We went for brunch and loved it. A little pricey- but worth it.",
   "On a recent trip to Mississippi, I went out with my Jackson food crew. I was their guest that night and luckily I ended up at one of Jackson’s finest establishments, Saltine restaurant. Saltine is a widely known Creole and seafood local hotspot in a very modern, trendy but still a touch rustic setting. My foodie friends were veterans of the Jackson food scene, so I sat back and let them order !!",
   "Great food, great service, and an excellent happy hour menu. We were seated with a group of ten within a few minutes and all of the food came out hot and delicious! Would definitely go back if in Jackson again!",
   "This place has some of the best seafood I've ever had in my life. The wood-fired Biloxi snapper, oyster sampler, shrimp boil, grits and hot chicken are AMAZING. Definitely making a trip to Jackson just for Saltines!"
  ]
 },
 {
  "name": "Dr. Mark A. Runnels, MD",
  "address": "501 Marshall St #301, Jackson, MS 39202, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/172e855a-9331-11ea-92d0-14b31f159f22.png",
  "tags": [
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=15944458105804468393",
  "source": "GoogleMaps",
  "reviews": [
   "The experience was quite a delight.  The nurse was very nice and kept me entertained while she took my vitals.  Then the lady who did my ultrasound was just as nice and gentle. She made sure I was not too uncomfortable during the process.   Lastly,  Dr Runnels was just as nice as his staff.  He asked question and told me what to do to try and remedy why I kept experiencing my problem.  The entire experience, I must say, was a pleasant one.",
   "My appt. was a t 2:00pm but I wasn't seen until 3:00pm.  I arrived at 1:45pm. I am a very punctual person & I don't like to wait long periods of time.  Dr. Runnels though was very considerate, knowledgeable, and \"LISTENED\" to what I had to say, very important!  He is a very pleasant Dr. to talk to.",
   "Dr Mark Runnels is my doctor. He is very thorough in his examination and questions concerning my health condition. He always suggests what is my best options and explains in layman’s terms so I am well informed.",
   "After going to one of the Merit hospitals Emergency Rooms while trying to give birth to a kidney stone, I was told to follow up with a urologist in FOUR days if it wasn’t any better. I was trying to pass a kidney stone that would not pass! Not sure how many of you have tried to pass a kidney stone but waiting FOUR days was not an option.  I then went to the Baptist ER and in a matter of a few hours Dr Runnels had completely taken care of the problem. Any future issues with kidney stones will be treated by Dr Runnels. Very professional, concerned and a pleasure to work with. Thank you Dr Runnels for all that you did",
   "Results- untimely  \nDid not care about my pain. \nCan't read report. Could not identify spot in cat scan after 2 scans. Could not deduct how frightened he made me. Just plain didn't care. I do not want him to be my doctor ever. I do not want him to touch me."
  ]
 },
 {
  "name": "McRaven Tour Home",
  "address": "1445 Harrison St, Vicksburg, MS 39180, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1766fbdc-9331-11ea-a23d-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "history",
   "knowledgeable",
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=213359299791637751",
  "source": "GoogleMaps",
  "reviews": [
   "This is the best tour I've been on. I certainly recommend this to anyone from Vicksburg as the history of McRaven is specific to the history and founding of Vicksburg, Mississippi. The tour guide, John, was exceptional! At night you can take a ghost tour rather than the historical tour that's offered in the daytime. The daytime rate to tour is $15.00 per person. It is well worth the cost. Thank you McRaven and staff. It's a memory and experience I will forever remember.",
   "We visited during a small reenactment. My little one was able to light the cannon! We only toured the grounds, not the home. The staff we talked with was informative & gracious. I thought the wrought iron gate was interesting for its uniqueness.8",
   "My daughter & I tremendously enjoy history & learned a lot. It was fascinating & a must see in my opinion. These gems are rare & I’m thrilled someone cares enough to try & keep these old homes up. Fascinating & I would have paid more to see it.",
   "This was a wonderful experience! Our tour guide Daniel was extremely knowledgeable about the property and was also very helpful. This tour is well worth seeing!",
   "First toured McRaven about 15 or 20 years ago. Just took the tour again yesterday.  Loved it! We live in Vicksburg, so when we have guests with limited time we have a hard time deciding which of the many attractions to show. Now McRaven will definitely be a main attraction! It is a historical gem."
  ]
 },
 {
  "name": "Dr. James A. Underwood, MD",
  "address": "2510 Lakeland Dr, Flowood, MS 39232, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/17ad53b4-9331-11ea-9a84-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=1863993572545154898",
  "source": "GoogleMaps",
  "reviews": [
   "Staff was very professional, available and knowledgeable about the entire procedure.  They certainly wanted to make sure you were comfortable and safe.  Dr. Underwood was open in what was going to take place during the procedure and detailed about results.  All together a great experience for a rather dreaded procedure!",
   "Everyone very courteous. Move you through the process very expeditiously. Had a 9:45 appt and asked to come 30 minutes earlier. Got there at 9:04 was immediately received in, was complete and on my way home at 10:48 .Very short waiting time between processing in, filing out a short form, verifying information,,having vitals checked, waiting to see  doctor, seeing doctor and scheduling  next appt.",
   "My experience last week was extraordinary from the moment of scheduling to the time I drove away. Dr. Underwood and the staff at GI are the kind of people who demonstrated compassion and treated me as if they knew me personally. Not only their kindness but the fact that I did not have to wait for the diagnosis to arrive in the mail days or even weeks later is a godsend. I am impressed and so very grateful!! God bless you all.",
   "Great staff, quick, professional process. Everything explained up front, all questions answered. Comfortable environment .",
   "Friendly staff. Nurse Practitioner Upchurch was very thorough explaining to me what to expect for my impending procedure. She addressed me with a smile and made me very comfortable. Even when setting up my appointment the lady that assisted me was awesome 👏🏽!! Wish I could remember her name. We talked about her daughter being in the service and me being a veteran. Hands down GI Associates clinic has the best staff ever!! Even the lady that greets you as soon as you walk in the building was great. Wish other clinics could pattern their customer experience with GI Associates!! Good Job 👍🏾!!"
  ]
 },
 {
  "name": "The Old Depot Museum",
  "address": "1010 Levee St, Vicksburg, MS 39183, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/17e658ae-9331-11ea-b0ca-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "knowledgeable",
   "free",
   "knowledgeable",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=17858881174205757381",
  "source": "GoogleMaps",
  "reviews": [
   "The kids loved the Old Depot Museum.  The displays of model trains and detailed models of ships, buildings, and battlefields were amazing.  Definitely put this museum on your family To Visit list if you're in the Vicksburg area!",
   "Very friendly staff! Knowledgeable as well!! They've got some cool little set ups to check out.  It's about five bucks to see the museum.  Free for military.  The gift shop has some great gifts that are way cheaper than some of the same gifts at the national park.  So if you're going to do some gift shopping, this is a good place to get some cool stuff.",
   "This is a very cool place. The scale models inside are amazing and there is a scale model of the battle for Vicksburg that was so helpful in understanding the battle placements. Curators are really nice.",
   "Absolutely loved this museum. Unbelievable diorama of the Siege of Vicksburg. There is a world-class collection of river boats of every kind imaginable. The artist/model maker was there when we visited and was amazing to talk to.\n\nTrains of all scales are in one area of the museum. Children of all ages are mesmerized just taking it all in. Great job!!\n\nFinally, enough cannot be said about the docents and knowledgeable staff. Don't miss the one-of-a-kind museum.",
   "This place is a GEM.  The two lady docents that work there are knowledgeable and friendly. You can’t go wrong by coming here. You’ll get a real insight into life in Vicksburg before, during and after the Civil War. Model trains, paddle boats, blockade runners and a movie that will give you insight into the civilian experience in the Civil War in Vicksburg. Great gift shop too"
  ]
 },
 {
  "name": "Jackson Thyroid & Endocrine Clinic PLLC",
  "address": "971 Lakeland Dr #353, Jackson, MS 39216, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10391966739363986631",
  "source": "GoogleMaps",
  "reviews": [
   "Great experience. Dr. Sistrunk is a great doctor. He took time to go over my history and my diagnosis. He showed me my images and labs and explained what they meant. He explained to my diagnosis to me and how he came up with the diagnosis. The staff was very professional, nice and helpful. I would highly recommend Jackson Thyroid and Endocrine to anyone with thyroid issues.",
   "Great experience! Friendly staff. Dr. Sistrunk is very thorough. He takes his time and explains it all.",
   "Received excellent care. Dr. Sistrunk spent over an hour with me explaining things and answering my questions. He was also extremely thorough and went all the way back to the records from my initial diagnosis of thyroid disease. The staff is friendly and efficient as well. The wait was not long either.",
   "I have never experienced a doctor like Sistrunk!! He takes his time going over your medical records with you. He spent over an hour in the exam room with me explaining everything. He’s by far the best endocrinologist I’ve met. He do have nurses but I noticed he like to do hands on with his patients so he’ll know exactly what is going on. I have already started recommending him to family and friends. 😊",
   "Always a pleasure to see Dr Sistrunk. He’s thorough, extremely competent & wonderfully kind."
  ]
 },
 {
  "name": "BABALU® - Jackson",
  "address": "622 Duling Ave, Jackson, MS 39216, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1832d882-9331-11ea-bdc1-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "delicious",
   "kids",
   "food",
   "kids",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12217953486909325525",
  "source": "GoogleMaps",
  "reviews": [
   "Such a fantastic Jackson restaurant! The margaritas and food are delicious!  I am a huge fan of this place because it's family friendly, but also a great option for date night!  Also - brunch is SO GOOD.  My favorite marg is the Notorious PINK one - hands down my favorite in the city. They have a great happy hour, excellent service and a fun atmosphere.  Also - the guacamole is a great meal by itself!  :)",
   "This place was absolutely amazing. Ordering the guacamole was an experience on its own. They make it fresh right in front of you and it is absolutely delicious. I would also recommend the Mexican street corn. Like heaven in your mouth. We ordered 4 tacos, all great, a kids burger, two margaritas and a sangria. Our bill was 74. Given the quality of the food this was a great price. Also super kid friendly. The place was loud so kids are not a problem. I loved the decor as well. If it wasn't so hot in the afternoon we would have eaten outside. So far this has been my favorite restaurant while visiting Jackson.",
   "AMAZING Food and Service. We have three kids and our waiter, Kevin, was exceptional! We tried several things from there menu and were not disappointed!!!  Plus, the kids meal are super impressive (which is really rare).  We drove about 15mins out of the way for this place and it was totally worth it. Highly recommend!",
   "The burgers are good. Tacos not worth the money. Definitely would recommend eating in. Never order take out. If to go is needed do green ghost",
   "Arrived in Jackson in time for lunch - downtown area was deserted but here it was crowded. I guess this is where everyone goes on Sunday. Service was great even with the number of people dining I did not have to wait more than a few minutes for a table for one. The menu is full of interesting items and I had a very difficult time picking. I went with the Cuban sandwich and coffee. Both were excellent - the sandwich was a good as those I have had made by Cubans in Key West. Each table is given chips and a melted cheese dip. Thanks goodness I had not ordered more food because that dip was the best. I ate all of it."
  ]
 },
 {
  "name": "Char Restaurant",
  "address": "4500 Interstate 55 North Frontage Rd, Jackson, MS 39211, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1880a064-9331-11ea-8fa0-14b31f159f22.png",
  "tags": [
   "family",
   "eat",
   "food",
   "delicious",
   "food",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2999356581101558467",
  "source": "GoogleMaps",
  "reviews": [
   "Have now been to Char 4 times, twice around Christmas time 2017 and twice around Christmas 2019.  Experiences have always been great. Staff is very attentive, without being solicitous. Service is quick and professional. Drinks are well mixed. Nice wine list; limited, but good section of beer. Great appetizers and salads; except seafood should be off the menu if it has been frozen or refrozen. Steaks are excellent, but, not great. Nice decadent deserts.",
   "Always great food and service.Waiting area isn't very big. Love the new larger back area addition. \nDownside they always run out of crab claws!! Triple your order please. My twins love them, it's hard to tell a 6 year old after they've ordered those little suckers sorry babies they are all gone ☹😂. Would you like something else? ??? Of course not they are six! I'm 40 and about to cry over them being gone. Great place to eat with family and friends.",
   "The ambiance is always nice and this time was no exception. Our server was beyond courteous and conversational but not overly. The food was delicious (I had the pan seared redfish); so much so I wanted more. The menu never disappoints whether I'm dining for lunch or dinner.",
   "We tried this place for the first time last night. Went with my dad for a nice dinner and Char did not disappoint! Fried green tomatoes were so so but the red fish with broccoli was amazing. Pecan pie with vanilla stole the show. Will definitely be back here soon. The whole fare is pricey but I liked the restaurant and food so wouldn't mind paying. Can't believe we didn't try Char earlier!",
   "This first time we ate at this restaurant. A bit pricy but we deserved all the pampering we received. Jessica was our server, she was fantastic, refilled our drinks. We went around brunch time. We ordered steak( Cooked to perfection} & redfish she suggested a different sauce than what was on the menu. My friend was well satisfied. So much food had to get a to-go box. Surprised us with a free hot pecan pie with ice cream! We will go again for a special occasion!"
  ]
 },
 {
  "name": "The Pig & Pint",
  "address": "3139 N State St, Jackson, MS 39216, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/18ce9266-9331-11ea-9b8b-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "creative",
   "family",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1476363693019893403",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to meet friends. The outdoor tables have a good view! Sometimes the view is a highway but this is in a charming neighborhood with plenty of activity. I had thought I would eat responsibly but I saw an order of nachos go by and impulsively ordered them. They are delicious and well worth the calories! Big enough to share too. The ribs are awesome. Get the dry rub and add the sauce!! The pork rinds are done just right. The white chocolate bread pudding is a must.",
   "Great food. Helpful staff. We had a large party of 8 and they were patient with us. Brisket was very juicy. Tacos were good. Ribs were great. Wings we got dry with sauce on the side. Beer was great, tons to choose from. Place was very laid back, and family friendly. Bathroom was cute with the poop plunger and the power mixer paddle as the toilet paper holder. Very creative! Would definitely recommend.",
   "As soon as I opened the car door, the scent of smoked meat hit me, fair amount of parking and outdoor seating. I ordered takeout, half rack ribs/wet and a pound of pork. The rib flavor was incredible, great balance of chipotle and garlic with good bark. It was rather fatty like it hadn't rendered the fat enough. The pulled pork was spot on.",
   "One week I was craving BBQ so I decided to try y'all out. I will say its not bad but if you like an oven broiled/wood chips flavor. The meat was coated heavily in pepper and spices and BBQ sauce but it didn't pack a char grilled taste. I would give it an A for tenderness but overall taste I will definitely say the sides make up for that. Baked beans and Mac and cheese were on point.",
   "Great place to meet friends. The outdoor tables have a good view! Sometimes the view is a highway but this is in a charming neighborhood with plenty of activity. I had thought I would eat responsibly but I saw an order of nachos go by and impulsively ordered them. They are delicious and well worth the calories! Big enough to share too. Great selection for entrees and sides. Minimal inside dining. Bench type tables for outside dining in the shade of outside roof. Love their bbq sauces on the table. Really love the Carolina style (yellow) sauce. My favorite is the brisket and pulled pork tacos. Sometimes the food is not warm enough. Other than that it’s great."
  ]
 },
 {
  "name": "BRAVO! Italian Restaurant & Bar",
  "address": "4500 I-55 N, Highland Village, Suite 244, Jackson, MS 39211, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1917d0c0-9331-11ea-9f7b-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "delicious",
   "food",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=12903352755869736820",
  "source": "GoogleMaps",
  "reviews": [
   "My friend and I frequently eat at Bravo because we enjoy the varied selection of dishes. We particularly like the pasta and pizza, but we have never had a bad meal . Also, we routinely dine at Bravo with a group of friends before attending plays at New Stage. We can count on having delicious meals with a great selection of wines and tempting desserts. The staff always makes sure we are served with time to get to the play.",
   "We celebrated my sister's 60th birthday here (one of my favorite local restaurants) and it was her 1st time dining here. She fell in love from the moment she entered. The atmosphere, excellent customer service, the manager checking in on us and cracking a few good jokes and making sure we were having a good time all contributed to this being an amazing day for her. They always strive to make every moment special and I've never had a bad service experience here. I don't know how they continue to hire such wonderful staff but they should offer a training course to some of the other restaurants around here! If you're visiting Jackson, MS I definitely recommend you try this restaurant! It's a local favorite. Thanks Bravo team for making this evening for my sister one to remember.",
   "My husband and I visited Bravo for our Anniversary. We enjoyed the atmosphere. Our server was great. The food was delicious and fulfilling. However, the only thing that bothered us was that the gentleman that sprinkled cheese on the entrees that were being served did not wear gloves. He did this with his bare hands. This is not sanitary. After seeing this, we opted for no cheese or garnish on our dish. Bravo, please change this serving policy. Overall, everything else was great.",
   "My friend and I frequently eat at Bravo because we enjoy the varied selection of dishes. We particularly like the pasta and pizza, but we have never had a bad meal . Also, we routinely dine at Bravo with a group of friends before attending plays at New Stage. We can count on having delicious meals with a great selection of wines and tempting desserts. The staff always makes sure we are served with time to get to the play.",
   "One of the places I love visiting. I had the brie appetizer, lasagna and salad. The service was great and so is the management team."
  ]
 },
 {
  "name": "Aladdin Mediterranean Grill",
  "address": "730 Lakeland Dr, Jackson, MS 39216, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/19630aac-9331-11ea-a94d-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food",
   "affordable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8725646421850492030",
  "source": "GoogleMaps",
  "reviews": [
   "A nice treat at a great price. \nWe were really impressed with the atmosphere and the friendly service.  \nI wasn't really sure what to order and the waiter gave me a great suggestion to combine the sauteed vegetables with gyro!  Great idea! \nThe parking is a little scary but it is well worth it.",
   "On a 16 hr road trip with several kids we looked up this place 4 hrs before Jackson. Made a reservation and from the moment I walked in they made us feel like home. \n\nOrder their family platter with 2 orders of lamb chops. Extra humus and tea.\n\nThis was our early dinner before heading to TX. \n\nThanks for feeding us and letting us take over the entire corner. The lady who took our order and managed to keep track of all the dishes was simply AWESOME !!!",
   "Authentic Mediterranean food! My gyro sandwich was exceptional. The iced tea was cold and minty. The food is very affordable the the portions are substantial.\n\nIf you are tired of ordinary chain restaurants, this place is one of a kind, comfortable and inviting. We are glad we decided to try Aladdin's.",
   "Great Mediterranean food in Jackson, MS.\nThey got a good variety of entrees. Chicken Lula was our favourite during our visit. We friends visited this place on the way back from our camping trip. We were 14, the waitresses rearranged the table for us to accommodate all 14 in a single table. Will definitely visit again if I am in Jackson again. Keep doing the wonderful work guys. I have added some photos to show how the ambience of the restaurant is. Hope this is helpful for future visitors",
   "I had the Vegetarian Platter, and it was amazing.  The falafel was crispy, and the hummus had a surprisingly strong lemon bite. Portion sizes are generous. I had to make sure I saved room for baklava. Service was friendly and reasonably fast considering how crowded they were."
  ]
 },
 {
  "name": "Walker's Drive In",
  "address": "3016 N State St, Jackson, MS 39216, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/19a8514a-9331-11ea-a3e9-14b31f159f22.png",
  "tags": [
   "art",
   "eat",
   "food",
   "tasting",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4632901034132292018",
  "source": "GoogleMaps",
  "reviews": [
   "While driving through Jackson, we needed food and a place to stay. We read some reviews for this and decided to go. It was a great experience overall: service, drinks, food! I think we may have been a bit under dressed than some of the others, but that didn't seem to be a problem. I am so glad we decided to go here! After weeks of rain, the clouds parted and I met a friend at Walkers Drive In. First of all it is not a Drive In, it is a sit and eat, in or our, Art Deco Style chic but easy Restaurant that is always almost full of diners who, like me come back over and over again.",
   "Excellent food and service.  The red fish with lump crab was amazing!  Wonderful flavors cooked right.  The red snapper with mushrooms and capers was also a real treat.  Alex was a pleasure to deal with and provided excellent, friendly service while answering questions and making suggestions.  Then to top it all off we delighted in the Mississippi peach fried pie, dusted with cinnamon and sugar served with a vanilla bean ice cream and white chocolate sauce. It was absolute heaven.  Crisp and clean flavor. Not overly sweet or oily tasting. Sheer perfection.  You cannot go wrong dining at Walker’s Drive-In.",
   "Excellent service, fresh and delicious food! The veal and lobster kathy was unforgettable! Definitely the best upscale restaurant in Jackson.",
   "We had to wait just a few minutes for our table for two, but it was well worth the wait. The main dining room is very small and sometimes you have to almost turn sideways to negotiate a table, but again well worth it. The food was out of this world. We had a wonderful wedge salad with a \"to die for\" filet served over a cheddar mash wth asparagus. The beef was almost tender enough to cut without a knife and the potatoes had a wonderful flavor. For desert I had some sort of decadent chocolate cake with vanilla ice cream while my companion had a grapefruit \"tart\" desert. We both agreed that our dining experience at Walker's was one of if not the best dining experience in a long time.",
   "This is hands-down the best restaurant in Jackson.  And honestly, it’s reasonably priced too.  Try the sea bass if you’re a fish lover!"
  ]
 },
 {
  "name": "Parlor Market",
  "address": "115 W Capitol St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/19efbac2-9331-11ea-9f41-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7535690061508375289",
  "source": "GoogleMaps",
  "reviews": [
   "Have come here about 8 times since 2017. At that point, there was not much in the downtown Jackson area at night; now the place is much busier....great news for Jackson. Never have had a bad pasta; all made in-house. We had a triple fin white fish that was amazing just before Christmas. Despite the risotto being a bit overpowering for the fish, the fish was one of the best white fish we have ever had in our international travels. I come here for business at least once a month and make sure to come back to visit every 3-4 months.",
   "Wow! What a great experience we had in hosting our son's rehearsal dinner with Parlor Market. It was held in their gorgeous private room, 'Albert's', a few doors down from the restaurant. From the start, we had superb communication with great listening--making our event what we wanted (not what they wanted). I love how they manage to 'yes' and are customer driven. The food was exquisite. The service was impeccable. I can not rave enough about the attention to detail in food preparation/presentation, graciously kind service and an overall level of excellence in hospitality. Thank you Parlor Market for making our evening so very special! We especially thank chefs Joe and Robert and our incredible team of Taylor, David, Jennifer, Mackenzie, Vince and Matti. You were all superb and we loved working with you.",
   "I have never minded paying for food, but every single item at parlor market is over priced by about 30%. Its not that any of the food or service is bad, its just that it is hard to justify buying their 38 dollar steak, when you know its not as good as other steaks you have had at that price range. same for the pasta (shrimp scampi), hangar steak (which is their signature, and is simply not great). I have now eaten there 3 separate times, and thought the exact same thing each time - I could do better.",
   "Have come here about 8 times since 2017. At that point, there was not much in the downtown Jackson area at night; now the place is much busier....great news for Jackson. Never have had a bad pasta; all made in-house. We had a triple fin white fish that was amazing just before Christmas. Despite the risotto being a bit overpowering for the fish, the fish was one of the best white fish we have ever had in our international travels. I come here for business at least once a month and make sure to come back to visit every 3-4 months.",
   "Fantastic meal with great service by Lloyd. Enjoyed the Caesar salad , grouper special with lobster risotto and carrot cake special with house made ice cream. Among our top meals anywhere anytime."
  ]
 },
 {
  "name": "Keifer's Restaurant",
  "address": "120 N Congress St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1a3b7586-9331-11ea-a293-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=3935161153823901737",
  "source": "GoogleMaps",
  "reviews": [
   "Speedy service, even with a fairly long line and call in orders, and everyone was friendly on the line, too. Great tzatziki sauce. Wasn't sure what cottage fries were (basically imagine a potato sliced like bread and then fried), but they were pretty good and servings are perfect for lunch portions. Gyro was very good, and wrapped up to keep me from becoming a mess, which I really appreciated. Quick, friendly, and kept level heads even when a customer was complicating their order.",
   "Genuinely friendly staff and a very fair amount of food. Potatoes seemed under-seasoned, but that's a small gripe.super fast lunch too. Seems like a great choice for someone working downtown.",
   "My vegetarian friend and I were hungry after a morning of sight-seeing - and this place was on our meanderings, trying to find a place for lunch. I saw what I thought was a place with veggie burgers BUT it wasn't. When the woman behind the counter saw my slightly disappointed face, she remedied the \"problem\" and made me (and my friend) a FANTASTIC improvised \"burger\" of piled high sauteed mushrooms, peppers, onions, fresh tomato slices and a yummy sauce on a big wrap. My friend and I were in HEAVEN. And the way the potato was prepped was a first-time for us both - and I wish I could remember the name the place had given it.",
   "Great local joint. Our family's favorite burger hands down. I've tried several items form the menu and none have disappointed. Good prices and quick service make it a no brainier. Only downside is parking downtown 😕",
   "One of the best Gyros I've eve had! Owner suggested to add mozzarella cheese and man it was good! See ya next time!"
  ]
 },
 {
  "name": "Scrooge's Fine Foods & Drink",
  "address": "5829 Ridgewood Rd, Jackson, MS 39211, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1a86d688-9331-11ea-8b62-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=15667816189858156016",
  "source": "GoogleMaps",
  "reviews": [
   "We had the fried pickles (huge serving) and the fried green tomatoes as appetizers. Both were good. The pickles were definitely dill. We also had the oyster PoBoy and the crab cakes. The bread with the PoBoy was too soft. I prefer a little crispiness in such a sandwich. The crab cakes we're quite good, little or no filler. The waiter was very much on the ball, kept drinks refilled, etc. The food was prepared quickly and served very hot. We would definitely eat there again.",
   "Loved it! The service was excellent! The people was so nice and generous there. The food! I had  Redbeans and Rice. It was delicious, seasoned perfectly, and ready at a timely fashion. I highly recommend this place and will be come back soon. Thank You!",
   "A group of 12 of us were passing through Ridgeland on our way to New Orleans. I called ahead and asked if they could accommodate our group. We arrived 15 minutes later and we were greeted by someone that seemed to be either the owner or a manager. He welcomed us and thanked us for coming. He showed us to a table for 12 that was nicely arranged. Devon was our waiter for the evening. He was very nice and very witty. He answered our many questions and offered his favorites as suggestions. The food was excellent. I didn't ask everyone in our group, but everyone I did ask was completely happy with the food they had and the experience. You should give this place a try.",
   "This was my 1st time being here. The food and service was awesome. Great and delicious burger and fries. The waiter Andrew was right on point, very friendly and fast. I would highly recommend this place and I will be back sometime soon!",
   "It's a great place for family and friends the atmosphere was cozy everyone is soooooo friendly"
  ]
 },
 {
  "name": "Drago's Seafood Restaurant - Jackson",
  "address": "1005 E County Line Rd, Jackson, MS 39211, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1acc5a0a-9331-11ea-bef7-14b31f159f22.png",
  "tags": [
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14585788644171724666",
  "source": "GoogleMaps",
  "reviews": [
   "Had lunch here yesterday and this place has gone to he!!. My husband and I both had the seared tuna salad. I had maybe 5 slices of tuna and 1 was the tip of the steak, just a speck. The color was an off purple. My husband's wasn't much better. The oysters were tiny, we ordered a dozen but they gave us 18 to make up for it. Our waiter was super friendly but the woman who seated us never smiled the whole time we were there. It was raining and she escorted us through a patch of carpet with 1/2 an inch of water to splash through because the roof was leaking. I was so looking forward to the delicious salad I had there 2 years ago but that was not to be. $57 + a $10 tip We won't be back.",
   "Celebrated my birthday here and tried the charbroiled oysters and I must say they were amazing!!! The atmosphere  was very pleasant and the restaurant crew were all very helpful.  Our waiter Michael was the BEST!!! He was very attentive to us and also made sure our drinks were steadily refilled.  I would recommend Drago's and plan on coming back soon!!! Thank you for making my birthday celebration a success!!!",
   "The restaurant is really nice. Our waiter was absolutely great. We had the Gator bites, which were super yummy. The Seafood Pasta and BBQ Shrimp PO-Boy were both great as well. It IS pricey, but our portions on everything were huge! Definitely left full!",
   "We stayed at the Hilton while traveling through the area and the front desk highly recommended them. The charbroiled oysters were awesome. My husband got the boneless short ribs and they were amazing as well, so tender and flavorful. I got the lobster and it was good. A little on the small side, but good. The service was great as well and the prices were fair for what you got. We would recommend them and will be back if in the area.",
   "Went on a Sunday afternoon when it wasn't busy.  Are waiter was very attentive.  The food was excellent, and was able to relax and enjoy myself. I would recommend to anyone looking for a good pasta dish or seafood.  It's a little pricey, but it's worth it."
  ]
 },
 {
  "name": "Lou's Full-Serv",
  "address": "904B E Fortification St, Jackson, MS 39202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1b394064-9331-11ea-91a3-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15664425973010643086",
  "source": "GoogleMaps",
  "reviews": [
   "This place is somewhat of a hidden gem. The hamburger itself was not the standard burger joint frozen thin one. It was thick about a quarter inch or more. I had a choice of side. I got the onion rings. These were outstanding too. Not frozen ones that I cannot stand. They have a different evening menu but I think it looks good. I intend to go back and try the sword fish steak",
   "Seeking an alternative to the usual suspects when visiting Jackson over night, I was told to check out Lou's. Located in a gentrified 1960's shopping center on Fortification, Lou's turned out to be a delightful spot for dinner. It was a chilly night and their comfort food took care of its business. Braised Short Ribs and a proper Pittsburgh Rare Beef steak found happy homes..........oh, my scotch was fair enough and the service was professional too.",
   "Every dish we ordered was Very tasty!  Yes it is kind of pricey for what you get, but it was absolutely delicious.   Cut the tails off your shrimp and grits.  Red fish was done perfectly and I’m a picky fish eater.  Short ribs were a nice tasty hunk of meat.  And the kids steak was good. 7 year old thought it was a little spicy. (Maybe pepper). Lol",
   "Absolutely amazing. I got the brisket sandwich but oh goodness was it outstanding! Side if onion rings were divine but to top it all off..... \n\nI don't like bread pudding. At all. But their bread pudding is something I was convinced to try and I was NOT disappointed. I may have eaten too much of it because it was so good!",
   "Yeah, sex is good. But have you had the bread pudding at Lou's? We went Monday and Friday and had two very different experiences. The place was dead Monday and we had extremely attentive service. And since it was our first visit the server gave us stellar recommendations (the teres major was the most perfect medium rare beef I've ever had). Friday was much busier but we still got high quality service. Expensive by Mississippi standards but really great grub. Homemade ice cream, all kinds of fresh goodness. Great cocktails, big selection of bottled beers, no taps."
  ]
 },
 {
  "name": "Bully's Soul Food Restaurant",
  "address": "3118 Livingston Rd #6103, Jackson, MS 39213, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1b7eade8-9331-11ea-a9fa-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "kids",
   "family",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6041524288965969948",
  "source": "GoogleMaps",
  "reviews": [
   "This place is like taking a step back in time...literally. The outside is very unassuming and the inside reminds me of my great great grandmother's house. Parking is extremely limited. The atmosphere is very pleasant and the employees are quite friendly and welcoming. The decor is very much of times past. Each of the tables are old dining room tables with assorted chairs. The tables clothes all have doilies as place settings. It's wonderful!",
   "Absolutely love Bully's. I recommend every item. Just keep going till you try em all. Delicious, good sized portions and super friendly staff. 100% southern hospitality and comfort food.",
   "Our family was driving through Jackson Mississippi on vacation and I saw this place on TripAdvisor. Always up for an adventure, we went out of the way and are so glad we did! Open since 1982, this family-owned business is definitely worth a visit. Bully himself popped out of the kitchen to welcome us, and the service was super friendly and helpful. We had lunch specials and everyone was super pleased, adults and kids alike. Our favorites were the greens, cornbread, turkey necks, fried chicken, fried green tomatoes, and peach cobbler. DO NOT MISS THE COBBLER!",
   "Food is great so I'm giving it 5 stars. However, if you are from out of state as we were, understand that this is a hole in the wall, the wait for the food will be long, and it will be served on cafeteria style plates; look past that. They put their foot in that food and it is a must if you're in town so you can get that real soul food deliciousness. Definitely check it out.",
   "Such sweet and friendly people with AMAZING food.  My husband was just as happy with his lunch as I was with mine. Everything was DELICIOUS!!"
  ]
 },
 {
  "name": "Rooster's",
  "address": "2906 N State St #104, Jackson, MS 39216, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1bcdde4c-9331-11ea-b563-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "delicious",
   "eat",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12894777758868156935",
  "source": "GoogleMaps",
  "reviews": [
   "The place is in a corner of an inside mall/building. The burgers and fries are great, and the onion rings are some of the best I have eaten (not greasy). We were in a hurry, and although not fast food, it was quicker than most. The chicken is great too. Stopped for lunch- it was sunny, clean, fast, friendly.... and the best chicken sandwich and grilled chicken on salads in a long time. Mac and cheese was decent (not to die for- but a good solid side). Would definitely eat here again. It got busy at noon- we were just a few min ahead of the crowd.",
   "The fried chicken was spot on. I had the fried chicken club and my wife the hot hot fried chicken sandwich. Both were delicious. The only reason I don’t give this place the 5 stars is the curly fries. I love curly fries but these were a bit greasy and lacked some flavor.",
   "The food was delicious . My husband and myself both ordered hamburger steak with 2 sides.  It's the best hamburger steak I have eaten in years.  The atmosphere was great. They had my kind of music playing.  The late 70's and 80's Rock and roll music.  It was so relaxing to sit down and have a great meal.  I will be going back to eat here again.  We were at the University hospital and when I finished up with everything I turned my maps on and asked where a nice close restaurant was to eat at. And it pulled up Roosters.",
   "It's not easy to leave a place like this..and not be absolutely stuffed. 8oz perfectly cooked patty. Huge helping of home cooked fries, and cold crisp cole slaw. I'm in heaven. Make this a bucket list stop. Probably the best burger in Jackson..period.",
   "Food was hot. Service was fast but front of house staff was a little rough around the edges and boisterous. Creole Chop steak was a great lunch choice. Red beans and rice was ok. Generous portions."
  ]
 },
 {
  "name": "The Iron Horse Grill",
  "address": "320 W Pearl St, Jackson, MS 39203, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1c279f2c-9331-11ea-a79a-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "unique",
   "kids",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=14808064323793752565",
  "source": "GoogleMaps",
  "reviews": [
   "We stopped for lunch while in the area on the recommendation of the guys at the Hawkins Jet Center. We were very pleased. The service was amazing. I forget the ladies name who served us, but she was getting married soon. She was amazing and on top of everything. We never wanted for anything. The chips they bring were awesome, love the flavor of the spices that they put on them and the salsa was really good too, without being too hot. My husband ordered the ribs and was very pleased with them. The atmosphere is really nice and love all of the woodwork in the place. Would recommend to anyone and when we are in the area we will come back.",
   "I've eaten here a few times, but had never been with a large group for a work function until recently. I wasn't sure how it would go over, but it turned out to be great time. The food was excellent, and the staff was wonderful. We had our function upstairs and had plenty of room even with having over 100 people. The only complaint we heard was that the parking was limited. But with a group our size, it would have been better to do more carpooling.",
   "Wasn't sure what to expect but received great service and delicious food. Other's kids were there having a great time. The stage is beautiful, would love to go back and see a good show. And so many unique things inside to see. Worth a visit or more.",
   "Apparently, I wasn‘t expecting a longer break during my Greyhound travel (1 hour). So I was just seeing this grill when we were driving by and I decided to quickly go in there and check what they have and if I can take it with me. At the end, it was just SO good I did so! I just wish there was more time to discover the grill itself a bit longer... I ordered a small cup of chili together with the Iron House Salad (with blue-cheese dressing) for taking out. While waiting, I grabbed the chance to step into the ‚museum‘ they have on the 1st floor. Even that was quite fun and experiencing, too.",
   "Great Food! Decor is overall awesome! Perfect if you love live music! They have weekly lunch specials that are great! If you want a to come in and rock out or just have a few drinks combined with great food, this is your place!"
  ]
 },
 {
  "name": "Keifer's",
  "address": "710 Poplar Blvd, Jackson, MS 39202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1c78cdde-9331-11ea-8bde-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16313051711520943960",
  "source": "GoogleMaps",
  "reviews": [
   "The waiter recommended the beef and cheese gyro. It's much similar to a Philly cheese steak. It's really good and I added mushrooms. The pita moz is my go to appetizer. You guys should try it. I like to try a different dish on each visit. Great Greek food. Although, Lunch time was busy the waiter made us feel as if we were his only patrons. A wrap and fries is too much for one person",
   "I liked Keifer’s.  Good food.  Reasonably priced.  And I love a menu that has instructions!  I’d definitely go again.  Pictured below are the cottage potatoes and a veggie sandwich with mozzarella (sorry I already took a bite).",
   "Great people!!   we came in at closing. We were in a hurry working on the ambulance. Had a ride ahead of us. Didn't think we could eat there but they came at us quick.  They were busy but still friendly &   they made fresh hot food and we had a great meal and on our way in no time.  I Wished i lived closer. That was my 2nd Met. Food and it was awesome!!!! Thanks y'all!!!👏👏👏👏",
   "Great Greek food. Although, Lunch time was busy the waiter made us feel as if we were his only patrons. A wrap and fries is too much for one person",
   "The waiter recommended the beef and cheese gyro. It's much similar to a Philly cheese steak. It's really good and I added mushrooms. The pita moz is my go to appetizer. You guys should try it. I like to try a different dish on each visit...."
  ]
 },
 {
  "name": "Crawdad Hole",
  "address": "1150 Lakeland Dr, Jackson, MS 39216, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1cc5c600-9331-11ea-aba7-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "music",
   "tasting",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17551330364194650608",
  "source": "GoogleMaps",
  "reviews": [
   "I visited here with a group for a wedding. The bride and groom are locals and visit often. The crawfish and shrimp were both delicious. Suggest getting sausage with the crawfish as well. Great laid back atmosphere. There is an indoor section with A/C as well as outdoor seating with fans for the heat. A must see in Jackson.",
   "This is not the place to eat and be CUTE.  Probably shouldn't wear your \"Sunday- go-to-meeting clothes\"  to the Crawdad Hole..... cause you cant eat a boiled crawfish with a fork..\n😁😁😁 I like the atmosphere, laid back environment..  Old school music, good food.... fantastic",
   "Bring in your own beer for $3\nCrawfish are good tasting usually pretty big but do run smaller certain times of the year. Fair price per pound and they also have live music sometimes. Would recommend.",
   "These guys and girls are the best! Enjoy more and more every time we go. The manager is the coolest he makes everyone feel welcome every time!",
   "Food was great! The owner and the staff were friendly.  We would highly recommend this restaurant. It was the best crab and shrimp boil! !"
  ]
 },
 {
  "name": "1908 Provisions",
  "address": "734 Fairview St, Jackson, MS 39202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1d10b210-9331-11ea-ac6e-14b31f159f22.png",
  "tags": [
   "library",
   "food",
   "food",
   "music",
   "eat",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16320374320916321906",
  "source": "GoogleMaps",
  "reviews": [
   "We were tired after driving all day, so was nice to have a restaurant and bar right in the hotel as an option. The Library Lounge (separate review) is right next to the restaurant, and also serves small plates. When we moved to the restaurant, we were the only ones in there, and it stayed that way through our entire meal. Granted, it was a little early, but that was surprising. The decor is nice enough and the place is spotless. We were surprised at how slow it was getting our food, especially since we were the only ones in there. However, the food was quite good.",
   "Beautiful restaurant. But the execution just wasn't there. The music was piped in. The service while polite was, let' say, not prompt. The food was fine but should have been better, e.g. no rare prime rib. Deserts were wonderful.",
   "I was not impressed with the food or the service. We were a group of thirteen with a 7 PM reservation.  We were seated promptly, and basically had the restaurant to ourselves. We had to ask for water — and had to keep asking, as no one was paying attention.  It took a good half hour before the waiter took our entree orders. Our waiter disappeared so often, we joked that perhaps he was also the chef...  Entrees were served at 8:50 PM. My pasta with shrimp was inedible due to the heavy use of spice (and I like spicy food).  Others in the group reported cold soup.  I would not eat there again.",
   "Some of my girl friends and I came for their Sunday brunch. It's in a very cute white building that looks like the Fresh Princes house. There's a live piano player and a nice waiting area with a fire place. The Sunday buffet was $20/person. This rating is just for their brunch, not regular restaurant hours and menu items.\n\nOnly thing I really liked was the etouffee and salmon, everything else was just okay. I'd rather spend more on one good plate of food off of their menu.\n\nThere's a waffle and omelet station, but isn't much for you choose from to put in your omelet or waffle...\n\nIt's a nice white table cloth restaurant, I'd like to come back and try some of their menu items.",
   "It is a beautiful place. We went to a Bourbon event.  The food was served family style.  There was a lot of things to try.  My favorite was the salad and the desserts especially the chocolate pot de cream."
  ]
 },
 {
  "name": "Estelle Wine Bar & Bistro",
  "address": "407 S Congress St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1d6c452e-9331-11ea-be2e-14b31f159f22.png",
  "tags": [
   "walking",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16558848939072810532",
  "source": "GoogleMaps",
  "reviews": [
   "We visited here mainly because it was within walking distance of our hotel and it was a good find! We both had pizza (sausage and roasted chicken(, which were yummy, we shared a salad as a starter and it was plenty big for two and had a nice bottle of wine as well. Prices are reasonable, service is good overall and it's nice to have this type of restaurant downtown.",
   "Outstanding food and wait staff!! We had the duck sausage meat and cheese tray salmon deviled eggs and fried chicken!!! Could not have been better served by these folks. The deviled eggs were one grain of salt away from a perfect bite of food",
   "I've been to Estelle multiple times and typically I enjoy my experience but today not so much. I attempted to call and place an order and I kept getting the voice mail. \nI drove over and it shouldn't take over 35 Minutes to get 2 desserts and after waiting all of that time for that order It looks like it was just sloppily put in the container.\n(Pics Attached)\nPresentation meant nothing today. \nI'm so disappointed in this establishment.",
   "Lovely atmosphere and elegant feel to the space the waitresses are quite efficient however the prices are a bit high but not too much so.",
   "Went there  with a couple of friends and we had a twenty minutes  wait to be seated which that was fine. The waitress and greeter was nice and friendly. When it came to the time to order our food the wait time was supposed to be 15 minutes  but turned out to be about 45 minutes. On my order I order two meals well one never came out and after waiting on my other meal to come it was cold when they brought it out. I never received the second order. I asked the waitress to just cancelled  it. On the order that I did recieved it was not cooked like I asked them to cook my steak I asked for med well. Well it was over well it was burned but I ate it cause I was hungry. I will not be returning  no time soon."
  ]
 },
 {
  "name": "Surin of Thailand",
  "address": "Exp. Director, 3000 Old Canton Rd, Jackson, MS 39216, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1db0f45a-9331-11ea-9b7d-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "drink",
   "unique",
   "delicious",
   "food",
   "delicious",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16647607984794764503",
  "source": "GoogleMaps",
  "reviews": [
   "Duck curry is reasonably priced and filling.  It is spicy and sweet with a nice portion of meat.  The fried calamari is disappointing.  I like the tempura batter but there is more batter than calamari.  Sauce tasted like corn syrup not the sweet heat it usually has.  The beef salad was good but did add some heat with the house chili sauce.",
   "I was blown away by how good the food was here. I don't live in the area and was visiting a friend who suggested Surin. We both had the roasted duck curry and it was incredibly flavorful and the perfect level of spice. I would definitely go back if in the area!",
   "Hip, upscale Thai joint in the heart of Findren. I've had many dishes here and everything has been okay to very good, nothing that was bad. I wouldn't call most of the dishes here authentic Thai, but it has its own unique spin, which is delicious and you can't find anywhere else.\n\nIt's clean, great for large groups. They have a big drink menu as well, definitely a good place to bring your friends, have a few drinks and talk the night away.",
   "Delicious food in a clean and stylish setting!  Our waitress was super-knowledgeable about the menu and checked on us frequently.  The potstickers made for a tasty appetizer and my \"Spicy Beef Noodles\" were just about as hot as I could handle! Definitely coming back here!",
   "Friendly staff and delicious food. Husband loves the coconut soup with tofu. The kids love it too! I wouldn't say it's extremely authentic Thai, but it's great."
  ]
 },
 {
  "name": "Mayflower Cafe",
  "address": "123 W Capitol St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1dfddb4c-9331-11ea-b24a-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "historic",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=3776473810703980647",
  "source": "GoogleMaps",
  "reviews": [
   "Always had great grilled gulf fish here previously, but wasn’t too hungry the last visit and had the plate lunch with grilled catfish and 2 vegetables and homemade roll. Unbelievable quality and taste. Included small salad with their famous comeback dressing. Peach cobbler was &1.00 extra and very good. Staff efficient and very friendly. This place covers the waterfront on selection and quality.",
   "One of the best seafood places on my list. Delicious food and fantastic services.",
   "Enjoyed a good lunch here on a visit to Jackson. Sounds like they’ve been around for over 80 years. Grilled chicken salad was tasty and associate had their Tuesday special. Historic location served the Beatles and other special guests in the day. There’s a reason the mayflower has been open so long. Reason is it’s amazing! Retro atmosphere great service incredible food. Redfish was some of the best I’ve had. Use the great rolls to sop up the flavor from the plate. Definitely a place to revisit.",
   "We happened into the Mayflower on a quiet night.  In every sense like dropping back a few decades, including the decor and the friendly, gracious staff.  The salad was small and simple, as I remember their being when I was young, but the secret house dressing was wonderful.  We had stuffed flounder and the fancy trout, and we could not have enjoyed them more.  One of the most enjoyable restaurant experiences I have had in recent memory.",
   "Iron Chef Cat Coral said she always eats here when she's in town, so this place gotta be good. The fried pork chop is nicely seasoned and fried. Stuffed crab was a little small, but probably because it's a lunch portion. Steak was cooked perfectly medium rare. Gumbo was good. I need to come back for their liver and onions, one of my favorite things to eat!"
  ]
 },
 {
  "name": "Gumbo Girl",
  "address": "900 E County Line Rd Suite 107, Ridgeland, MS 39157, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1e4a531c-9331-11ea-b03b-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14499895000034807842",
  "source": "GoogleMaps",
  "reviews": [
   "The decor on the outside and the inside is very beautiful. It was my first time eating at the restaurant and I almost walked out. This place is only opened on Thursday thru Saturday. Since I went on a Saturday night,  they were out of basically half the menu. I still decided to stay and order something and I was glad that I did. I had the fish tacos  and my husband had the red beans and rice. We also had a brownie for dessert. All the food was full of flavor and spicy. The red beans and rice was good but too spicy for my liking. It was my first time trying fish taco but I was very impressed. They were so good with the mild sauce. It was like a sea garden full of flavor. Next time I'll go on a Thursday so I can try more items from the menu",
   "Came here on my husband's birthday. I had the red beans and rice (excellent with full flavor and generous portions), and he had the shrimp tacos (tons of shrimp and good flavor). We didn't wait very long at all.\n\nDon't let the location scare you off (next to a gas station)! The atmosphere is cozy and intimate, service is nice, and the food is great. Not a lot of options on the menu and it's a little pricey, but overall good value for money!",
   "The surf and turf gumbo with shrimp, chicken and sausage is outstanding. It may seem a little expensive but this isn't a thin, watery gumbo with a few ingredients for flavoring. This is a thick, rich gumbo with a lot of ingredients. Expensive to make, great to eat. It was a little hot for the tastes of our eleven year old. Friendly owners and staff provided great service and explanations of the menu. Pleasant to dine in and very well packaged to go orders.",
   "Their house gumbo is the absolute best gumbo I've ever had! I'll add that the house gumbo comes with a kick so be prepared! The staff were attentive and my group never had to ask for refills. The wait time was around 5-10 minutes for the house gumbo and I know for sure that I will be back! The prices were pretty good, around $21 for my meal, and I believe that it was worth every penny! I can't wait to tell the rest of my coworkers and friends about this place!",
   "Delightfully impressed!  The food was as good as the service... EXCELLENT!  As an authentic Cajun from south Louisiana, the food here is very authentic and delicious. Places around here try to be a Cajun restaurant, but often fall short. Gumbo Girl nailed it!  It’s nice to see a place that puts quality over getting your food fast..."
  ]
 },
 {
  "name": "Crazy Cat Eat Up",
  "address": "1491 Canton Mart Rd, Jackson, MS 39211, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1e95bed8-9331-11ea-9599-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=10483785751895317612",
  "source": "GoogleMaps",
  "reviews": [
   "Catfish and meatloaf are amazing. Quiche and salad are a staple and outstanding.",
   "I've been there three times for lunch and every visit has been great. I've had their pimento cheese app, great, and the turkey and brie and ham sandwich both were terrific but will have to save the turkey is my favorite. The only dessert I've tried was the blueberry cobbler which I will definitely get again. I would not hesitate to go again.",
   "Have yet to have lunch here but dinner is amazing. I'd consider dinner here one of the best fine dining experiences in Jackson, comparable to Walker's, Char, and 1908 Provisions from a quality perspective, but more laid back. BYOB! Stop by Briarwood Mart Wine & Spirits (100 yards away) before you head there and let them know you are going to Crazy Cat for your 10% discount on a bottle of wine.",
   "Casual but high quality and reasonable prices.",
   "Amazing food, all locally sourced and so fresh every time!"
  ]
 },
 {
  "name": "Basil's Fondren",
  "address": "2914 N State St, Jackson, MS 39216, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1edbde92-9331-11ea-8a8c-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "eat",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=18238249475931711420",
  "source": "GoogleMaps",
  "reviews": [
   "It’s worth the fight for a parking space to enjoy an Elvis Panini. Peanut butter, bananas, and peanuts on warm panini bread are a delight! It’s unusual enough to be delicious! The employees at Basil's are super nice and always try to please. You have to eat in the hallway after ordering, as the restaurant is a walk-up. If it’s a nice day, you can sit outside. The only problem with eating here is the parking situation.....very limited!",
   "Got the Ham and Salami panini. Bread perfectly pressed and crunchy. Ham and Salami juicy and paired well with the aoli.  Service with a smile.",
   "One of my favorite restaurants in Jackson, every single thing I've had from there is amazing, and I've tried a lot of it. Best pizzas, sandwiches, soup, and chocolate chip cookies in town!",
   "The food here is always so fresh! Great staff and so friendly. This is our favorite place to eat.",
   "Basil's is an excellent spot to get soups, salads and sandwiches. It is vegetarian friendly. I have not personally been to the location but I have had it for take out. I ordered the veggie panini  which is made on delicious foccacia bread. Was filled with cheese, Roma tomatoes, olive salad and pesto mayo. I have also tried their cesar salad and tomato basil soup which is very tasty. Great cookies for those that have a sweet tooth. Recommend checking this place out."
  ]
 },
 {
  "name": "Shiro Cafe & Restaurant - Ethiopian cuisine",
  "address": "125 S Congress St ste 106, Jackson, MS 39202, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1f2e73fa-9331-11ea-a5e0-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "unique",
   "food",
   "delicious",
   "walk",
   "delicious",
   "unique",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1788357133950001812",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped in for lunch here the other day and was really glad I did. In this hidden Jackson gem, you get amazing flavors, spices and seasoning all on one plate. You have a variety of choices you can choose from and the staff is friendly and helpful in helping you decide. I got the beef over rice with the cabbage and chick peas. Everything was cooked wonderfully and definitely made a happy plate at the end. If you’re in this part of town and want some great food, this is worth the trip.",
   "The food at Shiro's is so delicious, and incredibly authentic, and honestly you cannot beat the price. $12 plus tip got me a huge lunch platter of injera, beef, beets, lentils, and cabbage. They design the food with the idea of portability in mind too, I could have easily taken my lunch to go and had a lovely little picnic anywhere downtown. I love Ethiopian cuisine, and Shiro's was excellent. Their variety of flavors blended together beautifully to make every bite unique, but still delicious. Stop in for lunch and enjoy!",
   "Delicious. Small place in the middle of a building. It is not a sit-down restaurant, so you just walk up to the counter, look at what is there, order, and have it handed to you. They have you pay when you are done. Make sure you try their bread.\n\nSuper cool that this place even exists in Mississippi.",
   "The food at Shiro's is so delicious, and incredibly authentic, and honestly you cannot beat the price. $12 plus tip got me a huge lunch platter of injera, beef, beets, lentils, and cabbage. They design the food with the idea of portability in mind too, I could have easily taken my lunch to go and had a lovely little picnic anywhere downtown. I love Ethiopian cuisine, and Shiro's was excellent. Their variety of flavors blended together beautifully to make every bite unique, but still delicious. Stop in for lunch and enjoy!",
   "Delicious food, great service. Small hole in the wall place. Absolutely worth a visit, will be going back again soon."
  ]
 },
 {
  "name": "Sakura Bana",
  "address": "4800, I-55, Jackson, MS 39211, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1f753e88-9331-11ea-bbf7-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=14610208603049151527",
  "source": "GoogleMaps",
  "reviews": [
   "This is the only “true” Japanese restaurant in the Jackson area (and the only Zagat-rated Japanese restaurant in town) started and run for 30 years by immigrants from Japan. The volcano roll is awesome.",
   "Great food, good service and decent location, will return again",
   "We eat sushi all over the world. Sushi must be fresh and varied to be exceptional. Sakura Bana is owned and run by a Japanese family that knows and lives sushi. The choices and prices are very special. Service is good, parking adequate, ambiance is excellent. This restaurant has something for everyone in a family. The alcohol selection is appropriate and reasonably priced. Uni, toro, anagi, anago, etc are some of the treasures found.",
   "Nice presentation, awesome customer service, very reasonably priced. Downfall is they don't give you complimentary soup or salad like other sushi places. Our server asked if we'd like soup and salad so we said yes, little did we know that we'd be charged for it. Overall still a good experience, we'll definitely be back.",
   "The best sushi restaurant in town! Everything is fantastic here, with attentive staff (Jane, Lauren, Renzo, Austin, Millie, Ariel, Skylar) ! I believe they're still the ONLY Japanese owned restaurant in the whole Jackson metro!"
  ]
 },
 {
  "name": "Sugar's Place",
  "address": "168 E Griffith St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1fba6964-9331-11ea-8ac2-14b31f159f22.png",
  "tags": [
   "kids",
   "cheap",
   "food",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12322904976824987118",
  "source": "GoogleMaps",
  "reviews": [
   "Guy Fieri needs to make a visit this place is awesome! We came for breakfast and left FULL. We had the Sugars full breakfast grits bacon eggs and toast. The kids had waffles. My friend, being from up North exclaimed these are the best grits I've ever had. This coming from a \"Yankee\" I would have to say if I lived in the area it would definitely be a go to place. Wish we were going to be in town and have lunch here. All I can say is if you are here you need to stop, and Guy you need to stop in!!",
   "The 4.5+ rating is deceiving unfortunately. Our food was made to order, but the chicken on the biscuit tasted like a frozen patty that had been heated in the microwave, and the waffle is exactly the kind you get at a cheap cafeteria, bland, tough and disappointing. The chicken tenders with my waffle were tasty, but unfortunately not quite enough to counter the lackluster waffle. For as much as they charge for their food, it should taste freshly mixed and made, not freshly pulled from the freezer.",
   "After eating chicken tenders here, I cannot eat chicken tenders anywhere else because nothing else will be as tender and juicy as the ones made at Sugar's.  Their fries are also home made and some of the best I've ever tasted!  Seriously, Sugar's is one of the best places to eat for breakfast and lunch!  They put the \"soul\" in Soul Food!",
   "Best soul food I’ve ever had. Ordered the chicken and waffles as well as the fried catfish, shrimp, and fries. Fried chicken batter was light, waffles were perfect, syrup was light and sweet. Fried catfish literally melted in my mouth, and even the fries were excellent. Stopped on our way to CO, but I’d stop in Jackson again just for Sugar’s!",
   "Had the pleasure of eating lunch from here.  When I say the food is absolutely incredible.  The flavors and taste was fresh and amazing.  The kool -aid is in a star class all by itself.  The owner was so nice☺️ I give this place more than 5+ stars!!!"
  ]
 },
 {
  "name": "Edo | Japanese Restaurant",
  "address": "5834 Ridgewood Rd suite c, Jackson, MS 39211, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/20018558-9331-11ea-ba3c-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1763308467193976805",
  "source": "GoogleMaps",
  "reviews": [
   "This place is a great hidden gem. The restaurant is very clean and the service is outstanding. I have enjoyed sushi at many restaurants over the years and this place is one of my favorites. Had lunch at Edo based upon many recommendations! Lunch was reasonably priced and all items were very fresh and the presentation was awesome: simple and colorful! The Seaweed & Squid salads were fantastic! Will eat here again!",
   "Great customer service and awesome food. This is one of the best Japanese restaurant in Jackson metro area. I think it's a bit inexpensive as well when compared to similar restaurants. Don't let outside fool you it's a low key hidden gem. Must visit.\nOwner should try to upgrade outside appearance a bit to match service and food.",
   "Only our second time to try Edo, once for lunch and dinner. The fried snapper app was great, our sushi was very good. The staff was friendly with relaxed and efficient service, very enjoyable.",
   "I ordered the hibachi shrimp lunch special. The price was reasonable and food was delicious. It came with miso soup, salad, and the food pictured below. My lunch partner got 4 sushi rolls and loved them all. I think I just found a new lunch stop.",
   "As always the food wad great and the staff very friendly and helpful. A great place to dine."
  ]
 },
 {
  "name": "Elvie's",
  "address": "809 Manship St, Jackson, MS 39202, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/204fcf2e-9331-11ea-9337-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "delicious",
   "unique",
   "walk",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13135967300482145175",
  "source": "GoogleMaps",
  "reviews": [
   "Best meal in town...just incredible!!  Such a unique menu.  Amazing food, drinks, atmosphere.  Truly a special place...a “must visit” in the Jackson culinary scene!",
   "From the moment you walk in the door you feel like you are the most important person in the room. The atmosphere is unique and welcoming. The wait staff is very friendly and attentive. Every member of the staff is involved in making sure you are taken care of. The beverage selection is varied and upscale. The appetizers are delicious and uniquely displayed. The entrees are well presented and beyond expectation. The deserts are a necessity. They too are beautifully displayed, unique, and delicious. I was there for dinner, but others told me I must come back for breakfast and lunch, which I plan on doing.",
   "Breakfast was phenomenal! We tried the Duck Fat Hash-browns' and my husband got the Eggs Benedict.   The flavor was layered perfectly and the presentation was so thoughtful. The staff was on top of everything from keeping our cups of coffee and water full to answering all of our questions. The atmosphere in there is charming, made us feel like we stepped into a classy NOLA style place from the 30's. Cody and Hunter and their team have put together the most lovely little Jackson restaurant that I know will quickly become a staple. Can't wait until we get to try it out for dinner!",
   "Nailed it! This will quickly become one of the \"it\" restaurants in Jackson. Great atmosphere, great food and cocktails are thoughtful and fun. When I go out to eat I don't want something I could have cooked at home. Mission accomplished! Food is sophisticated and tasty.",
   "Incredible place! We loved sitting at the bar. The staff is incredible and the food is amazing. Call ahead, they are sure to stay busy!"
  ]
 },
 {
  "name": "Barrelhouse",
  "address": "3009 N State St, Jackson, MS 39216, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/20a52a4c-9331-11ea-a7b3-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "eat",
   "food",
   "music",
   "food",
   "food",
   "foodie"
  ],
  "link": "https://maps.google.com/?cid=13990242044826691226",
  "source": "GoogleMaps",
  "reviews": [
   "I had wonderfully prepared catfish. Nice and crispy. Not greasy at all. Located in the Fondren District this is a wonderful place to eat and then shop. I did not pick the best for sides. I chose the mac and cheese and pimento and cheese grits. The fried okra was wonderful! Cute atmosphere and area to sit outside! The food was good here! We had meatball subs, buffalo cauliflower and mussels/fries. All were delicious! The prices are reasonable considering the quality of food. Would come back if we were locals! Thank you for the wonderful service as well!",
   "Tuna Nachos and the Cheese plate. 2 things you should eat before you leave this earth.\nThe nachos are crispy, savory, lots of great textures...the seaweed and sesame seeds my be my favorite parts. The Barrel House margarita is amazing too!",
   "I went with a large group for a birthday party on a Friday night. The food here was amazing, everyone was very pleased with their order. It's got a great atmosphere, friendly wait staff and our bartender Wes was awesome! We didn't even realize there would be live music, which was a bit loud, but the band was great.",
   "Great atmosphere. Great food other than the fact that it’s a bit salty in general. Service could be on a bit slow side at busy hour. Otherwise, come on over!",
   "We had a fun small foodie meet tonight for First Thursday. Although it was busy during first Thursday, our food came out fast and hot!\n\nI ordered the beef meatballs with parmesan cream sauce, the meatballs were moist, well seasoned and loved that it was slightly fried on the outside. Now listen here, this dish is only $5 during 4pm to 6pm social hour! That's a steal! Try all of them! 🤣\n\nThe won ton tuna nachos were great, nachos wasn't oily at all and the seaweed salad was great on it. It was a pretty light dish for nachos. Duck fried wings were crispy, I wanted a tad more seasoning, but the fry on it was 👌. \n\nWe all ready enjoyed our food. The service was amazing! Food came out quick, pretty nice place for food and drinks.\n\nFood: 4.7\nService: 5\nAtmosphere: 5"
  ]
 },
 {
  "name": "Sal & Mookie's New York Pizza & Ice Cream Joint - Jackson",
  "address": "565 Taylor St, Jackson, MS 39216, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/20f237d8-9331-11ea-acff-14b31f159f22.png",
  "tags": [
   "walk",
   "delicious",
   "food",
   "delicious",
   "kids",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9063465284473325908",
  "source": "GoogleMaps",
  "reviews": [
   "Hey All went to Sal & Mookie's from the walk in it was awesome  very friendly  stuff  the restaurant is very clean great  Atmosphere Our  waitress  is very outgoing  and made sure we had drinks  and our meal was outstanding. We had pizza we created by adding chicken ,green olives ,smoked bacon, mozzarella cheese it was out of this world  awesome and then we had dessert. I had a butterfinger crunch Vanilla Ice cream in  Butterscotch topping my wife had  pecan  square with the ice cream and whipped topping.  At Sal &Mookis'e there is a lot of great choices  and I know We will be back very  soon . And cant wait til they open the mew Sal &Mookie's in Madison  Thanks for a great meal.",
   "Best service ever! Haven't been here since i was a kid and I'm so glad i came back! My son's order took a while to come out and they were very very gracious about getting it right. My waitress Megan was very nice and so was the manager im surprised at the great customer service because nowadays its barely any! I will surely recommend over and over again!",
   "We had a really good experience. Our server knew the menu, had good suggestions. The food was really good. I had the Philly cheese steak and it was delicious. We also tried dessert.",
   "Stayed in jackson overnight on our way to destin. Such a cool and fun atmosphere! Kids can watch pizza making, and all of the staff are very kid friendly. Food served quickly and was delicious. Ice cream parlor in the restaurant was fun too! It is not off the main road so you have to know where you are going to find it but there is plenty of parking and worth finding! My family loved this restaurant. Cannot say enough about them.",
   "Service was great. The pizza was greasy but good. Ice cream was very good!"
  ]
 },
 {
  "name": "Hal & Mal's",
  "address": "200 Commerce St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/21488364-9331-11ea-96d7-14b31f159f22.png",
  "tags": [
   "food",
   "art",
   "music",
   "delicious",
   "food",
   "music",
   "drink",
   "eat",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=7476711706384232063",
  "source": "GoogleMaps",
  "reviews": [
   "Great good and beer. The service was great.y bartender was Chris and he was the nicest. I was solo travelling and we talked for a long time. He provided loads of great recommendations. \nI would go back for the food and great staff.\n\nThere was also live jazz band playing on that Wednesday",
   "Looking for a great place to pop in and have lunch in downtown Jackson? This is your place! I could hardly concentrate on the menu due to all the eye candy memorabilia surrounding me! Art, music, photos, and neon lights behind the bar made our visit fantastic. We were in town for the Mississippi Arts Commission arts conference and wanted to have lunch nearby the capital.... we finally decided on catfish poboys and GIGANTIC onion rings....heaven! Before leaving I went to the restroom to wash my hands and discovered cool hand painted stalls,etc! We had the perfect lunch and our server was super nice. Highly recommend ⭐️⭐️⭐️⭐️⭐️",
   "Dine Against Darkness was enlightening and the dining in total darkness in the back of Hal and Mal's  added so much to the strength of the message. And the dark 3 course meal was delicious.",
   "Great food, wonderful service, and in the evenings usually a nice little band or duo playing live music.  I highly recommend it.",
   "Good food and great decor. Friendly and attentive staff. Many local beers to choose from but the tap down for maintenance. Still a great place to eat, drink, while enjoying live music."
  ]
 },
 {
  "name": "Sherria’s Chicken Coop 2Go",
  "address": "1505 University Blvd Suite G Suite G, Jackson, MS 39204, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/218e0154-9331-11ea-ba91-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "delicious",
   "eat",
   "food",
   "delicious",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=11514372234114974790",
  "source": "GoogleMaps",
  "reviews": [
   "This was the best smoked chicken and baked beans I’ve ever had that chicken will make you slap your mother and your Grandma. The Olive Branch Chicken Coop has delicious food that is consistently good. Usually I bring the wings home, but one time I ate there and I started to notice how badly the restaurant was kept up. It is uncomfortably hot and you will smell like fried food when you leave due to poor ventilation (this is normal for small restaurants that fry their food - not picking on this place). I was the only one who sat there and ate. I think the 2 guys working there were embarrassed b/c they started cleaning around me.",
   "This was delicious.  I enjoyed every drop.",
   "The Olive Branch Chicken Coop has delicious food that is consistently good. Usually I bring the wings home, but one time I ate there and I started to notice how badly the restaurant was kept up. It is uncomfortably hot and you will smell like fried food when you leave due to poor ventilation (this is normal for small restaurants that fry their food - not picking on this place). I was the only one who sat there and ate. I think the 2 guys working there were embarrassed b/c they started cleaning around me. They are so used to everyone picking up their food to take home that when I sat down to eat, they became a little uncomfortable. Anyway, the only reason I didn't give them 5 stars is because of the state of the restaurant - the food is worth 5 stars.",
   "As always I need my nap now.",
   "Great food at affordable prices. The strawberry cake is so delicious!"
  ]
 },
 {
  "name": "The Pizza Shack",
  "address": "925 E Fortification St, Jackson, MS 39202, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/21db9d1c-9331-11ea-9ffa-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=9625258582863440300",
  "source": "GoogleMaps",
  "reviews": [
   "Downtown on Fortification Street is mostly a “take away” location. Second location in Madison, MS off I-55 North. In a small strip mall. Never eaten at Downtown location. Pizza is good. Crust is good. Serves ice cream and a few sandwiches. Pizza joints are notorious for bad service. Not the Madison location. Pizza is like BBQ. Served different in all regions of the USA. Pizza Shack has really thick crust and piled high toppings. Sauce is good. But the paper papers need to end. Nothing special about the dining area. Small patio is good. All pizzas are unique. Local favorite.",
   "The food is great. It's filling and they pile the food onto the pizza as well as everything else is decked down with the ingredients. They are opening a new pizza shack in pearl, MS. On hwy 80 by the harbor freight.",
   "Pizza is good. Crust is good. Serves ice cream and a few sandwiches. Pizza joints are notorious for bad service. Not the Madison location. Pizza is like BBQ. Served different in all regions of the USA. Pizza Shack has really thick crust and piled high toppings. Sauce is good. But the paper papers need to end. Nothing special about the dining area. Small patio is good. All pizzas are unique. Local favorite.",
   "Really tasty! I had the Italian cowboy and it was delightful. Crust was thin and crispy?",
   "I specifically asked that my supreme pizza be \"burnt\" as I like a well done pizza....it was not.  And the chicken wings were not cooked thoroughly either.  The only highlight was the cheese sticks.  Also, they sell Pepsi products....I prefer coke."
  ]
 },
 {
  "name": "Country Fisherman",
  "address": "3110 US-80, Jackson, MS 39204, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/221d8834-9331-11ea-9beb-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3338013759886350733",
  "source": "GoogleMaps",
  "reviews": [
   "I absolutely love this place. When my hosts brought me here for the first time, I fell in love. Super busy!!! The staff is very attentive and the food tastes soooo good! Great southern cuisines that I grew up with. No complaints here. We drove around looking for someplace to eat lunch and found this gem of a place. It was a buffet which had several types of food, chicken, fish, BBQ and so much more. The waitress was excellent and very friendly.",
   "Had the catfish it’s great, chicken was good, was hoping for green beans and soup beans and mash potatoes but they didn’t have any of that. Service was 5 stars for sure! Super nice people here!",
   "I have eaten here I know for over 20 years and have always pushed anyone I knew to go but no more... partially now because I am vegan, my tastes have changed a bit but the last 3 times I've been here the food has NOT been good. It's not properly seasoned and it's always over cooked. And the fillings for the deserts have a metallic taste. Maybe at some point if my stomach is forgiving I will give them another try. When or if that time comes, I hope the food and my opinion will be better.🤮👎",
   "Food was delicious.  Worth the cost.",
   "My group of 35 had planned to stop at national chain buffet restaurant. We called ahead for service. When we arrived we found out that it would be and extended wait for a group of hungry individuals. We decided to leave. We went to another national country store/restaurant. Another extended wait. Two ladies were standing near the entrance. I asked them for a recommendation of a buffet restaurant for a large group. They both quickly agreed on the Country Fisherman on Highway 80 in Jackson (MS). We got back on our bus, I called ahead and told them we were 15 minutes away and wanted to know if they could accommodate us. The receptionist immediately told us yes they could."
  ]
 },
 {
  "name": "Thai Time Thai and Sushi Restaurant",
  "address": "1405 Old Square Rd, Jackson, MS 39211, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2271eb46-9331-11ea-98d5-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "cheap",
   "affordable",
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=17188506221335184287",
  "source": "GoogleMaps",
  "reviews": [
   "Posted on behalf of Ms. Banks, who does not have a google account.— “Yesterday at Thai Time Thai and Sushi Restaurant, I had a very disturbing experience that was very unprofessional, unsettling, disheartening and embarrassing to say the least. After purchasing three to-go orders and one to-go buffet around lunch-time, as I frequently do, (spending over $40). As I waited for my to-go entrees after already paying and fixing the to-go buffet plate, an employee—both a man and woman, approached me mentioning something about the buffet.  I did not clearly understand exactly what they were saying at first, but the lady then said that someone from the kitchen said that I put something in my mouth while at the buffet. Appalled at this accusation, I immediately, calmly told her that did not occur, in fact, I had chewing gum in my mouth at the time! Yes, she apologized, but the damage had already been done. It makes me wonder that if I had been a different person, or looked a different way would I have been approached, accused and humiliated in such a manner. I have decided that I will not patronize a business that thinks so little of me, to think that I have not the least of manners and would stand at a public buffet at a restaurant and put food into my mouth. I started to request a refund, but I had already decided that it would be the last penny that they would ever get from me.  It is so unfortunate that this type of establishment is even present in our city of Jackson, MS”",
   "Buffet is small, but everything was flavorful and delicious, cheap and affordable too! If you want a Thai buffet, definitely give this place a try.",
   "Possibly the best Thai food in Jackson. My coworkers and I always visit here when ever we visit Jackson. You honestly can't go wrong with anything on the menu. A personal favorite of mine is the Crunchy Chicken! Thai Time was fantastic! We shared the vegi egg rolls and Boom Boom Shrimp, that tastes a lot like Bonefish's shrimp. Delicious. Also, the Yellow Curry Chicken was fantastic. My six-year old nephew loved it and he's a picky eater. He ate some just after coming from hibachi, which he loves. That's how great this place is. The server was great and management too. My favorite Thai restaurant in the South so far.",
   "We drove there from Memphis, TN as part of a road trip.  We have visited Thai restaurants in Nashville, TN and Little Rock, AR already.  I have never been to Jackson so it’s time for a road trip.  We ordered shrimp Pad Thai, shrimp basil fried rice, som tum, grilled chicken, sticky rice and one more basil fried rice to go.  We didn’t order any dessert just two drinks.  The bill came to $83 with tip.  The food was not bad but the price was too high.  I didn’t like the way they cooked the basil fried rice neither.  The portion of the food for this price tags only lasted for two meals, I thought that was outrageous.  The Thai waitress knew us from a Thai restaurant in Springfield, MO and she made a rude comment in the kitchen about me and my husband by thinking that I could not hear her.  I do not appreciate that.  I will not return to this place again.  I rather visit PF chang in Memphis which costs less and has better food than going back to this place.",
   "Look, I am a steak and potato guy, but this restaurant is great.  A little help, but I picked the fried rice and shrimp-#1 for spice level. Delicious!!!! A gem that is hidden and the service was great...clean too."
  ]
 },
 {
  "name": "Dave's Triple B Restaurant",
  "address": "970 High St, Jackson, MS 39202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/22b81b1a-9331-11ea-971e-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=614887224719020034",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic food. High quality meat and wholesome food. Never a disappointment! Always good eatin'!",
   "Absolutely amazing food and friendly staff. Truly great Big Rhonda Challenge. Can’t wait to try it!",
   "The herbs, seasoning, the ratio of fat used in the meatloaf was perfect, not one dry bite! I've never been a fan of bbq sauce on my meatloaf or bbq sauce at all, so I'm glad to see that it's more of a tomato base sauce, more sweet than tangy. My green beans were fine, not much taste, same with the mac n cheese. The cheese had a slightly grainy nutty texture, which I find to be strangely addictive! I love my mac n cheese that way, not too much taste, not overwhelming in cheese, just nicely coated. The meatloaf has a lot of taste, so I thought pairing it with the green beans and mac n cheese kept it the star of the dish.",
   "Stupid good burger. Maybe the best burger on Earth. Limited hours, but quick service. We walked through the door at 12:30 and had our food at our table by 12:40. The restaurant doesn't look like much from the outside, but inside it's clean and modern. Eat a Wagyu burger with Swiss and mushrooms when you're ready to change your life.",
   "Excellent food, beautifully plated!\n\nThe building may look like it used to when it was that cafeteria-style BBQ place, but the menu and \"vibe\" are much better. I definitely like the changes!\n\nThe meatloaf \"Blue-plate special\" looked as beautiful as the pictures on this website and it tasted even better than it looked. We also tried the Wagyu beef and a sandwich. All were delicious."
  ]
 },
 {
  "name": "Aplos Simple Medierranean",
  "address": "4500 Interstate 55 North, Suite 174, Jackson, MS 39211, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/230502ac-9331-11ea-91b0-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16419033634387933457",
  "source": "GoogleMaps",
  "reviews": [
   "Love this place..Don't know why I didn't know about it sooner..The wings are different and delicious.. Rotisserie chicken is some of the best around.    The Rotisserie special is a great deal and fulfilling.. Juicy all the way through.. Greek fries are awesome.. pizzas  are  awesome...dishes are put together nicely with their own special touch...Great food...Headed back to try out the salads.. Definitely worth the stop if u love Mediterranean..",
   "Alpos is the bomb and pet friendly. Excellent service.  When the kitchen backs up, they stop taking orders. Not a problem here. It's worth the wait. Sit on the patio or visit the area shops until they start taking orders again. Usually last for about 10 minutes.",
   "You get great Mediterranean food here. I little pricey but wasn't disappointed. My daughter said the hummus was the best she has ever tasted. The Gyro pizza is also recommended. Friendly staff made the whole experience memorable, wish we could afford to eat there every week!",
   "Love this place so much!  The Greek wings and creamy feta dipping sauce is AMAZING. The wine and beer selection is great, too.  The fact that it has a bright and airy atmosphere INSIDE along with an option to eat on the cheerful terrace with the Highland Village fountains makes it a fantastic place to eat all year round.  They also have a killer happy hour! Frose all around!",
   "Beautiful location for a casual date night. Really wanted to try the frosè but they were out! The sweet waiter had me try something else! That was so kind of him!  So got the frozen blood orange drink.......it was divine. I got the lamb wrap filled with tender juicy lamb and fresh vegetables on a pita bread. My husband tried the chicken pizza and was good too. Great staff, cute location, delicious food, and divine drinks. We both had a good time together. Definitely going back!"
  ]
 },
 {
  "name": "Crechale's",
  "address": "3107 US-80, Jackson, MS 39204, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2350d8e6-9331-11ea-951f-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1594453678793242782",
  "source": "GoogleMaps",
  "reviews": [
   "We ate Valentine's dinner at Crechale's. Fortunately, little has changed. Still USDA Prime steaks and fresh seafood, fried or broiled. We love the broiled scallops in a white wine butter sauce. I add a little fresh lemon and it is seafood heaven. If you want to have a selection of seafood, the seafood platter is available broiled or fried. The steaks are basically plain grilled prime steaks. Prime steaks are well marbled and need little seasoning beyond salt and pepper and maybe a little butter. There are other restaurants for marinated choice steaks and elaborate sauces and toppings. Our eleven year old said that the scallops were delicious.",
   "Fresh flounder,  5 star service,  Bob on deck.",
   "Had not been here since the 1990's so I was back in town for a wedding & thought I'd give it a try. Still so GOOD! Nothing had changed since I was there. Same jukebox with the same great country music, same curtains, & the best part was the same great food. Staff very attentive for sure. I had the scallops. Couldn't believe they gave me twelve!! Had double salad rather than a baked potato with the wonderful comeback sauce. Could just about drink it through a straw. Love it!! Next time, I won't wait so long to go back!!!",
   "grew up in Jackson and I first started eating there in the middle 70's.I have since moved to Nashville but when I came home for Christmas I made a special point to dine there again because I had such fond memories of it in the past. I was delighted to see that nothing had changed a bit since the 70's and I doubt since 1956. It is such an iconic example of a business model that was done right and continues to be done right. It is Saturday night and I have no doubt there is a line forming outside their door as I type this",
   "Old school food and atmosphere. Don't go here expecting a light meal or vegetarian options. Go here for a birthday and get the onion rings. "
  ]
 },
 {
  "name": "Fred's Soul Food Restaurant",
  "address": "930 Palmyra St, Jackson, MS 39203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/23953534-9331-11ea-9f4e-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11367836818993876043",
  "source": "GoogleMaps",
  "reviews": [
   "I had business venture in the area. Found some time for breakfast and did a review on top breakfasts. Thanks for some quick research and I ended up here. Wow what a delight. Lots of choices personally I ate the fried chicken, sausage and eggs. On my way out 4 cooks were sitting for coffee and chit chat. All very much like what I would define as grandma's. Now I know why the food was soo good. Cant beat the price and the hospitality. Many Thanks to the staff!",
   "Pancakes..better than McDonald's..similar to taste of dairy queen pancakes..Salmon patties.....no onions, no peppers..must be bought ..cant prepared in-house. Great customer service thou!",
   "Recent changes have made it more difficult to use Google maps. I prefer user friendly apps. I have found another app I prefer to use",
   "I travel constantly over 25+ years several different Countries and half the United States. I found this place Bullys while pasding thru Westside Jackson Mississippi. Wow reeaaaly goood food. They have very good homestyle/southern style cooking, with several vegetables for sides. I highly recommend. This is a 'must' place to visit. Also they have Extremely sweeeet lemonade and tea (some people may understand what we call 'southern sweet' or 'ghetto sweet', so be cautious...its so good and sweet that you maybe could pour it on your pancakes !",
   "I love that homestyle type of breakfast that Fred's offers!! Always fast n friendly great place for a good meal,will definitely be returning"
  ]
 },
 {
  "name": "Pearls Southern Cooking",
  "address": "3505 Terry Rd, Jackson, MS 39212, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/23da06a6-9331-11ea-8d0b-14b31f159f22.png",
  "tags": [
   "family",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5630907811732977614",
  "source": "GoogleMaps",
  "reviews": [
   "If you're looking for southern soul foods, this is the place to go. The catfish and fried chicken are top notch and the green beans were so good, my friend had to go back for seconds (which she never does). The sweet tea tasted like summer and the entire staff was friendly and welcoming. I felt right at home.",
   "The meals there started out good, after a while I noticed everything was heavily seasoned with SUGAR. I stopped purchasing take out from the buffet. I really did take a liking to her meats but when I asked for a special order and not the buffet it seems like it upset her. She rolled her eyes and was not polite at all. I have a family of 4 so I expect to pay hefty for what we enjoy but if its a bother, I will not return. Plus word of mouth goes a long way.",
   "A little unknown place over on McDowell road Jackson Mississippi, wonderful food, good customer service, the place is due for some sprucing up, that will certainly make it more inviting. Sure would love to see that happen! The food is delicious 👌",
   "Not much to choose from and the drinks are only water sweet and non sweet tea",
   "The best southern cooking i have had. Truckers there is parking . Come on down. Lunch buffet  with some great sweet tea 10 and change.. I marked it on my saved spots .. not fancy but the food is a 11 out of 10."
  ]
 },
 {
  "name": "Farish Street Fish House",
  "address": "526 N Farish St, Jackson, MS 39202, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/241f4d14-9331-11ea-a15c-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10424767357585636069",
  "source": "GoogleMaps",
  "reviews": [
   "Friendly owner and staff.\nVery clean.\nTasty food.\nA must try if you are in the downtown area.",
   "Delicious fresh food. Great customer service.",
   "Great place great food.  I had the philly cheese steak I'll coming back.",
   "This is an excellent place 2 purchase fish chicken or Shrimp every thing was excellent",
   "He'd the catfish and the philly.  Pretty good."
  ]
 },
 {
  "name": "Cultivation Food Hall",
  "address": "1200 Eastover Dr #125, Jackson, MS 39211, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/247b01c8-9331-11ea-82ea-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "delicious",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8266469688781477550",
  "source": "GoogleMaps",
  "reviews": [
   "The Poke bowls are AMAZING! The tiramisu at the deli was the best I've had! My mom loved her bagel sandwich from the deli. Love this place. I'm going come all the time!",
   "I was stoked to check this place out after seeing it on Instagram (@cultivationjxn). It surpassed expectations. The interiors were completely up to date and provided such a positive communal space for eating that had adequate seating selections for different size groups, making 8 people feel as comfortable as 2. There was a dining area separate of the main hall and was quieter if you wanted a calmer meal, but I recommend enjoying the atmosphere of where the vendors are. \n\nThe choices of style of meal were superb and varied, not just BETWEEN vendors, but in vendors themselves. Each of the sub-shops had a great selection of menu items related to their “theme” but they were quite varied, bringing truth to the food hall’s name...every item felt cultivated. \n\nAside from the wonderful food, there was a coffee shop serving fantastic brews, and a bar fully stocked with both alcohol and friendly staff. \n\nPRICE: TALK ABOUT WORTH IT. None of the food was in the least bit expensive or overpriced. I was actually quite shocked by how accessible the items here are, given the chic look of the establishment, but the quality is great and the service follows suit. Both still and sparkling water are available on tap (with actual glasses) for free, and empty plates are stocked aplenty around the joint for splitting or sharing meal items with others. \n\nAbsolutely nothing but positive reviews on this place and everything it presents. Can’t wait to go back and try other items!",
   "It was amazing. We ate at Local Honey and ordered the Avocado Toast. It was delicious and definitely recommend it! Check the pictures!",
   "Great atmosphere, full of food counters with an eclectic selection of food styles to choose from. Pictured is a NY Lox \"sandwich\"from Ariella's NY Deli. It's an everything bagel with Nova Lox (salmon that's been cured and smoked and is thinly sliced when served), with tomato, red onion, capers and a \"schmear\" (thin layer) of cream cheese.\nIn NYC this would be known as a bagel all the way....\nI will suggest to them, when I go again, that they toast the bagel, or at least offer it as an option... Bagels in NY are always offered to be toasted and are usually served that way.\nWill edit post shortly with other pictures.",
   "I like the idea of the food hall. It's essentially a food court on a higher scale. For a family with different tastes this is a nice option. We tried three different restaurants on our visit.  All three were very good. The crepes seemed to be everyone's favorite. It was not too crowded, especially for a Saturday night. Overall good experience, nice staff."
  ]
 },
 {
  "name": "Steve's",
  "address": "125 S Congress St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/24d53038-9331-11ea-b55c-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1117141644110237158",
  "source": "GoogleMaps",
  "reviews": [
   "Get the lemon iced tea cake! So yummy.  Also, the guy who prepares the food seems super into his work,  which makes things even more interesting here. Quick preparation.  Nice menu of fresh eats.  Salads are freshly made. Go, try it. Cute spot.",
   "Great food. The bread was to die for, a very unique taste!",
   "Steve’s is just what you want for lunch...delicious soups, sandwiches, and lunch specials with great cookies too!",
   "Absolute best lunch in Downtown Jackson",
   "Wàs and still is a great lunch spot good food"
  ]
 },
 {
  "name": "Godfrey's",
  "address": "2460 Terry Rd, Jackson, MS 39204, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/25228f12-9331-11ea-90d5-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13616177623886328780",
  "source": "GoogleMaps",
  "reviews": [
   "wait time might be a while but AMAZING food, and SO worth the value. call ahead! highly recommend the Rum & Bourbon wings",
   "The food was great. The service was great. The atmosphere is great.  No complaints. The chef even came and introduced himself.  I highly recommend the coconut shrimp, the sticky ribs, and the jerk chicken rolls!! It was all DELICIOUS!!",
   "This restaurant came up as a recommended choice. It was absolutely delightful. The atmosphere was calming, the service was good but the food was GREAT! I’ve never eaten authentic Caribbean food but this has to be it!!! Will be back for curry chicken since it’s only available Monday/Wednesday. Thanks guys for the experience.",
   "Went here for lunch with my mom one day. So glad we did. The food is out-of-this-world good. I'm thinking about when is my next off day so I can go again! They give big lunch portions! My mom enjoyed the Jerk \"Sticky\" Ribs with collard greens, yams and sweet cornbread. I had the Bourbon and Rum Wings with a side of mixed lime beans and okra. You have to try this restaurant if you ever get the chance!!! You will not be disappointed!!!",
   "Great Staff! Very flavorful food. I will be going again. The jerk chicken was great! Nice little atmosphere. Sort of pricey but I think the food is worth it."
  ]
 },
 {
  "name": "Margaritas | Mexican Restaurant",
  "address": "1625 E County Line Rd #120, Jackson, MS 39211, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/256a9380-9331-11ea-9550-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "food",
   "family",
   "walking",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9674905234041110105",
  "source": "GoogleMaps",
  "reviews": [
   "Margaritas is home away from home. The staff is so kind. You're greeted with a smile as soon as you walk in the door. The food and margaritas are superb. The service is top notch. Best around town. They are always consistent. You won't be disappointed!",
   "My spouse and I truly enjoyed ourselves this afternoon. We had a great waitress by the name of Mrs. Phine. She assured we had everything we needed and was very considerate. The food was great and the drinks 🍸 was the 💣... Definitely coming back ... Great Job...",
   "I came to Margarita’s with my family today- the day after Christmas. I told the waiter to use a gift card ($25) first then use my debit card. I opened the gift card at the table. The waiter asked: “Are sure you got money?” I said excuse me. The waiter said: “Your card going to decline.” I asked for the manager. He said the manager is busy. I told him I didn’t care. I waited for the manager to come to the table. I expressed to the Manager that I felt a way for the waiter to say that before taking my payment. The manager stated he would talk to the waiter. I said can you at least take gratuity off of my ticket. The manager did; however, when I was walking out the manager tells me you not the only one who card declines. MY CARD NEVER DECLINED!!!  The manager said this in front of other customers. I told them that I would report it. I do not know what the waiter to ask me if I had money just because I wanted to use a gift card. I will never go back",
   "We have been going to margaritas for over 20 years. And for all those 20 years, the food has been excellent. The service is excellent. This is hands down one of the best Mexican restaurants around. Make sure to get the queso with your chips and try the fajitas!",
   "While the food is good the only exceptional service that I receive begins and ends at the hostess station. On another occasion as I made my order to go, hoping to escape the dine in \"service\", it still happens. Dealing with someone that will make it very obvious that they do not want to be there. I guess at the time, as the order was not for me, I did sympathize. As for the bar far be it from me to question the actual margaritas there. I do, however, find them lacking in the preparation of other mixed drinks. Well... in all honesty I've never had their margaritas anyway. For example the barkeep prepared me a gin and tonic... with seltzer water. Once again though the food is delicious"
  ]
 },
 {
  "name": "Spice Avenue",
  "address": "4711 Hwy 55 N, Jackson, MS 39206, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/25b9ec3a-9331-11ea-a2af-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3004576791596943816",
  "source": "GoogleMaps",
  "reviews": [
   "This place is so good. Lunch buffet is around $12. Definitely worth it. They bring out hot fresh bread, charred to perfection. The lunch buffet has an assortment of fresh veggies with a variety of curry dishes and grilled meats. Selection varies daily but the goat vindilu (sp?) and butter chicken are my favorites. Service is great and waiters are attentive. At lunch, I can easily get in and out of this place in 20 minutes. Usually no wait to be seated.",
   "I ordered for LAMB Birani, they served with cold rice and rice was  cooked long before. The guy was telling me that they just cooked rice, a professional lier. He doesn’t know I eat rice every day 2-3 times last 27 years. When I give rice in mouth, I do understand when rice was cooked. \n\nHowever, the food was horrible in test, I didn’t eat and enjoy the food.",
   "The biryani was definitely fake, this place is not authentic at all. Barely had a selection, and I definitely would not recommend to people who enjoy real Indian food. The food had zero flavor.",
   "Pretty good vegetarian options for the lunch buffet here, but for meat there was only a couple chicken and one fish dish. Less options than some of the other Indian places in Jackson. Service people were nice.",
   "I absolutely will return. Great food, Great atmosphere and exceptional service."
  ]
 },
 {
  "name": "The Farmer's Table",
  "address": "929 High St, Jackson, MS 39202, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/25ff59f0-9331-11ea-bd1b-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "creative",
   "food",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8742159093426932281",
  "source": "GoogleMaps",
  "reviews": [
   "What a fun little \"bistro\"! Perfect for a Saturday morning nosh. Hidden just inside the Farmer's Market there are tables in the lobby and a few in the bistro. Food was freshly prepared, tasty and served in human sized amounts. Excellent coffee. Recommend the Full Southern Breakfast and the Breakfast Burrito.",
   "Seems to be more of a catering joint or more lively when the entire farmer's market is open. Absolutely dead when we went and the rest of the market was closed which makes for an intimidating and cofusing walk-in. Employees were prepping for other days and 2 of the 3 tables in the tiny space were taken up by them. Absolutely not a restaurant you can sit to enjoy breakfast at. It was like eating a breakfast burrito in someone's office. Food was okay.",
   "This is a hidden gem for the locals working downtown, but it is also just off Hwy 55. The food is fresh and the vegetables are Southern but creative. For lunch, they have two or more choices for entrees, but it is so hard to choose from the delicious sides, I often just have a vegetable plate. As for crime, Jackson has it, but the downtown area is well patrolled and I have no problem going here by my senior self.",
   "What can I say, they have the best grits and that bacon... delicious!\n Food 5 \nService 5\nAtmosphere 5",
   "I don’t write reviews; but, this place left such an overwhelmingly sour taste in my mouth, it was hard to taste the cooking. $32 for a bitter middle aged woman who can’t take responsibility for her own simple error behind the line. Been in service industry for several years and have never treated a customer with such attitude and poor social demeanor over what can be easily fixed. Time for a career change to “the owner”"
  ]
 },
 {
  "name": "El Centro Grill",
  "address": "318 State St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2643dd12-9331-11ea-bcea-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food",
   "music",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12233898038840692858",
  "source": "GoogleMaps",
  "reviews": [
   "Wow Man, this place is great, I went there for Lunch and was immediately greeted and seated. The place had a hip and rustic vibe to it, which I really liked, The owner was very friendly and asked where I am originally from and placed an Indian flag at my table, which was such a nice gesture.\nFood was served fast and tasted great, I was a nice experience I will definitely be returning soon. Will recommend to anyone looking for Mexican food in Jackson Downtown",
   "You absolutely must try the Chicken Jalisico. After a long day, this was the rich hearty Mexican dish that I was craving. The place was a little empty for a Saturday night but that was certainly not a reflection of the quality of the food. The entire table was extremely satisfied with our orders. Service was prompt and the staff very friendly.",
   "Good food   great service and the first \nI tried a hookah (sp) pipe ! It was fun",
   "Went here on lunch and it was absolutely amazing! Our food was delicious and the staff were as friendly as could be. They even tried to teach us how to use some instruments but we’re just terrible at music. Loved the experience, loved the food, 10/10 would recommend and come back again!",
   "This restaurant was an excellent example of southern hospitality! The food was flavorful and absolutely delicious. The service was prompt. By far one of the best atmospheres (great photo opportunity)."
  ]
 },
 {
  "name": "Piccadilly",
  "address": "4800, #1, I-55 n, Jackson, MS 39211, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/268c5800-9331-11ea-8c32-14b31f159f22.png",
  "tags": [
   "drink",
   "tour",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3354155682814652177",
  "source": "GoogleMaps",
  "reviews": [
   "We stopped for lunch at Piccadilly, our first time and unfortunately, our last, because we were on a bus tour and live on the West Coast. The selection was outstanding. I ordered the fish almondine. The portion was huge, covered the whole plate. The price was $9.99 and included two sides, and a wonderful selection of breads plus drink. If I lived closer, this would be one of my favorite places. Tasty, fresh and reasonably priced.",
   "Breakfast was much better this time.  The staff was very helpful & friendly.  Would have given 5 stars, but if you're 45 minutes from closing, don't say you won't be making anything else.",
   "I sent my friends to this restaurant with my highest recommendations. I visit this restaurant often. I get very good feedback from my friends. The the cooking is appetizing and the crew is generous and cooperative. always when we go to this place we enjoy a splendid time.  warmly recommended.",
   "If you like Southern \"comfort food,\" then you'll probably like this cafeteria-style dining experience. The serving line and dining room have recently been remodeled, with new tables and chairs. Some partitions were removed, giving the room a more open feeling. Serving-line staff now wear white tunics, giving then a more upscale look. There is a room which can be reserved for private gatherings. Previously, it was defined by accordian partitions. Now, it is entirely glass enclosed. I like the seafood gumbo!",
   "Baltimore approves! Shout out to the sweet manager Mary and her pleasant, hardworking staff; Jackie, Romeo, Stephanie, Ted etc. Thank you for my experience. This is definitely my go to when I visit again. I rarely do breakfast or buffets for that matter but, I would make an exception here. The welcoming, the food, the meet and greets to make sure you have everything you need; this is definitely an experience and gem here Mississippi. Everything is fresh (fruits and veggies) you have your made to orders (omelets, pancakes, French toast and waffles), or your classic continental breakfast (,cereals, muffins and yogurts) all in all there's something here for everyone. I will be trying the lunch next visit. I highly recommend!"
  ]
 },
 {
  "name": "Bonsai Japanese Steak House",
  "address": "1925 Lakeland Dr, Jackson, MS 39216, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/26ce914c-9331-11ea-bf89-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "family",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=8069048128345586604",
  "source": "GoogleMaps",
  "reviews": [
   "We had another perfect and flawless visit. Parking spots are a little tight for large vehicles and that was the only downside of the entire visit. We sat in the sushi area and ordered from the Hibachi grill. Food was prepared flawlessly and cooked to perfection. We were quickly seated and had no complaints about the food or staff. my Tea glass was kept full and they were very attentive.",
   "Bonsai has and will always be the best place for sushi and hibachi. They knocked it out of the park tonight. Service was on point and the food was delicious. Cannot say enough good things. Good check them out",
   "The food was excellent. We were there on lunch, so there wasn't much of a Hibachi show, which is normal for those crowded times. We also waited 20 minutes for each beverage refill, the waiter would simply disappear. Will be back for the food, hope the service gets better. Family and I had a great visit. Staff was very helpful and attentive. We sat in the booth area and ordered from the habatchi grill. Food was very good and just as we ordered. This is our favorite Japanese Steak house..",
   "Hey All had a very nice dinner  at Bonsai Japanese restaurant  A new experience  For Me and wow it was  awesome  Great Meal.",
   "Fun lunch!  Delicious hibachi chicken and rice. Water and tea stayed full and had leftovers for dinner."
  ]
 },
 {
  "name": "Fine & Dandy",
  "address": "100 District Blvd E, Jackson, MS 39211, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2717a888-9331-11ea-8d19-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "unique",
   "kids",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10309411385656593703",
  "source": "GoogleMaps",
  "reviews": [
   "One word: OBSESSED!\n\nHands down, my new favorite of all favorite spots in Jackson, MS. Fine & Dandy has stolen my heart, and I'll never be the same! The views, the decor, the Golden Hour menu, the service w/southern hospitality, and my Lord-- the food is amazing!\n\nHubs and I stopped for lunch, tried as much as we could possibly stomach, and loved it all. The Purist & Grandma Chick are manna from heaven! The meats are cooked to perfection and the fries are legit. I wanted more (softer, maybe some sweet or sourdough action) from the buns they serve, but I can deal. Not a deal breaker at all.\n\nThe also love the attention to detail here. It's as if nothing-- absolutely nothing was an afterthought, down to the check presentation, staff uniforms, and restroom wallpaper. (I love that ish)\n\nHats off to the chef & design team! I'm #FangirlingHARD and super impressed!",
   "The menu is a limited but the quality of the food is excellent. The burgers are succulent, fresh and a perfect portion. The cocktails and milkshakes are excellent. I highly recommend the hot toddy - got rid of my cold which was an added bonus The tater tots with white truffle and trout caviar are interesting but the dill is overpowering. The katsu burger whilst different could pack a bigger punch",
   "We had a great ‘date night’ at this restaurant.  The food was delicious, service was courteous,  and the menu was the best one I have ever read.   We tried a new beer, and some wine though they specialize in far more complicated mixes.  We tried the baked cheese appetizer ....  yum!   the chicken and wafflez (like no other!).  And the dinner special which was a snapper plate.  All dishes had very unique flavor and served on dandy china plates.  We were pleased to spend our evening here.  \nThe atmosphere inside is hip and spaced close together.  We chose to sit outside on the  porch where there are outdoor couches with short tables which  provide a quieter experience where private conversations could be had in any weather.  These couches are also great for families with kids - Plenty of room for movement.  \nIf you like this review, tap the thumbs up.",
   "I was pleased to have the District at Eastover develop in the last few years as it is just a short car ride away from my home. One thing that sets them apart from the other restaurants in this area is service! I have always been very pleased with each and every one of the people who have served me during my many visits to this wonderful establishment. Now to the food.... (and drinks). When it comes to appetizers, you really cannot go wrong: Dad Bod tots, regular tots, Fries (it is served with Mayo, so if that's not your thing, ask for ketchup), and the pimento cheese is fantastic.",
   "Food was basic after hours type food. Everything we had was good but did have rather long ticket times, especially considering it wasn't busy. Server was very mediocre - more like an order taker at a fast food joint. Atmosphere was very pleasant. Not too loud, not too quiet. This was my first time there and would most likely visit again next time in the Jackson area."
  ]
 },
 {
  "name": "Broad Street Baking Company & Cafe",
  "address": "4465 I-55 N Suite #101 Banner Hall, Jackson, MS 39206, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/27777bec-9331-11ea-915c-14b31f159f22.png",
  "tags": [
   "free",
   "independent",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16390404454736031876",
  "source": "GoogleMaps",
  "reviews": [
   "My first time here and I will be coming back with friends !  Gluten free options and I ordered something not realizing it might contain gluten, the server informed me of the possibility and offered to let me order another side.  Wonderful customer service.  Everything tasted so fresh and original.  Loved the chicken wrap.  Loaded with chicken and black beans.   \nThe tea fresh and awesome coffee. Plenty of room for seating.  Area was clean.  The tables were constantly being cleaned up as soon as someone left.    Bakery products look delish !",
   "We have loved to stop at this bakery and independent book store for many years as we pass through Jackson, Mississippi. Yummy fresh baked goods, breads, cookies, pastries, sandwiches, soups. We had the grilled cheese Panini and avocado toast. We bought cheese cake, bread, cookies to go home. It’s always worth a stop and a great place to catch up on work and take a break. Spacious, light and bright. My friend is an avid reader and he loves the bookstore upstairs and says there are all kinds of things he never sees elsewhere.",
   "We decided to stop here while driving through Jackson for breakfast. The service was fast, staff was very kind, welcoming, and helpful. The food was amazing!! I had a breakfast quiche, which I've never seen served before. They also had a great selection of desserts and coffee. It's a great place if you like books. Lemuria,  cozy bookstore, is on the second floor! Would absolutely come back again.",
   "Stopped here for the bookstore nearby, found myself lured to this restaurant (by the wonderful smells). With the amazing displays of baked goods and delicious food I will definitely want to come back. The staff were super friendly and my food was ready within minutes!",
   "I was invited here for my birthday, and I loved it. I never knew it existed. Haha. I saw it a few days later rolling through I-55, and I was like wow that looks like a bank from the old days. I got the po boy catfish with Gumbo soup. It's a very wonderful place and the people are lively. Thank you Broad Street for a cool birthday lunch."
  ]
 },
 {
  "name": "Basil's Downtown",
  "address": "120 N Congress St, Jackson, MS 39201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/27cb4174-9331-11ea-b3e9-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "eat",
   "food",
   "delicious",
   "hospitable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11078568687569389263",
  "source": "GoogleMaps",
  "reviews": [
   "I highly recommend this jewel. I ordered the crabcake  salad with comeback sauce, ranch and the champagne vinaigrette. It was strongly suggested by an employee, along with the champagne vinaigrette. It did not disappoint. Huge serving enough for 2 days. Crabcakes warm and flavorful, the croutons were so large I thought they were grilled  chicken bits. Staff friendly and knowledgeable about what they are serving. Restaurant clean. Parking a bit of a challenge. Major let down. The restaurant downtown closes at 2:30 on weekdays. Not open on the weekends. Enjoy!",
   "Food was freshly prepared, service was great and staff was friendly, some of the options in the menu were not available, that made us a bit disappointed but besides that other things were great, will visit again",
   "We were in Downtown Jackson, Mississippi today riding around and looking for somewhere to eat that we had never been to, well Basil's Downtown was where we ended up, and I am glad we did... We didn't read the hours on the door when we walked in,  we  just went in and walked up to the counter, well it turns out they close at 2 p.m. and it was 1:55 when we walked in. We  honestly would have went somewhere else if we had known it was their closing time, but no one at the counter mentioned it, and they patiently answered all of our questions about items on the menu until we made up our minds.\n   I ended up ordering the daily special, which was a Prime Rib Sandwich with Gravy for dipping, and I also ordered a cup of their Corn & Crab Chowder. When my meal arrived at our table a little while later, of course the 1st thing I tried was the Corn & Crab Chowder, and there was no disappointment there, as it was really good,  so of course I moved on to my sandwich, which I immediately dunked in the gravy, now this is where things all of the sudden had a WOW factor, as the gravy was by and far the star of the show, with the hint of wine not only being an unexpected surprise, but also making it one of the best gravies that I have ever had in a restaurant. I cannot lie, I liked the gravy so much that after finishing  my sandwich and seeing that there was still 1/2 a bowl of gravy left, I just grabbed my soup spoon and finished it off like it was a soup.... Not only was the food great here, the service was too, as we were not rushed, nor made to feel like we were inconveniencing the staff, and actually it was the exact opposite, as they were not only attentive, but also very friendly... I may not be in Jackson very often, but Basil's will now be one of my goto restaurants when I am...",
   "The veggie sandwich on focaccia is excellent!",
   "Delicious food friendly and hospitable service"
  ]
 },
 {
  "name": "Twin Peaks Restaurant",
  "address": "6010 Interstate 55 North Frontage Rd, Jackson, MS 39211, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2827b9cc-9331-11ea-abcd-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15559516217137640712",
  "source": "GoogleMaps",
  "reviews": [
   "I eat lunch here quite a bit. My favorite appetizer is the 6 piece boneless wings with the spicy thai chili seasoning with ranch dressing and fries. They have a limited menu but this is by far my favorite dish. The beer here is probably the coldest in Jackson and prices are very reasonable. The wait staff are on point and eager to serve. I couldn't afford a trip to the beach this summer so bikini week at Twin Peaks has been a little blessing. Praise the Lord and pass the cold beer",
   "Service was good but not spectacular. They were busy at the time so that could of had something to do with it. Saints game was on so that was cool. Lots of loud fans however which I get. Food was good. Had the pot roast which was very filling and felt home made.",
   "My girlfriend and I decided to come to Twin Peaks for the first time and we left with a 5 star experience. We sat at the bar and we could not help but to acknowledge how much the blonde bartender was passionate about making sure the guest, including ourselves, were took care of and left happy. We asked for her name when we were tabbing out and she told us her name was Shell. She asked if everything was okay and we told her we wanted her to know how we very appreciative of her making sure we left happy. We want to give these 5 stars to her and let her know we will be coming regularly because of the experience she gave us.",
   "Kristi is the best bartender I have ever got the pleasure of having make my drinks.  The service and skill that she provides is unmatched.   Sierra and Kristi make a great team. They will keep you with a smile on your face the whole time you're there.  I highly recommend going to see them!!!",
   "Atmosphere was nice but they lost my order and I had to wait almost an hour and a half for my food.."
  ]
 },
 {
  "name": "Sankofa Kitchen Of Jackson",
  "address": "911 Palmyra St, Jackson, MS 39203, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/286d8738-9331-11ea-8e4b-14b31f159f22.png",
  "tags": [
   "history",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3588223435769513066",
  "source": "GoogleMaps",
  "reviews": [
   "We ordered confitduck wings, brisket hand pies and a small veggie pizza and every dish was outstanding. Their Bourbon collection is the best we’ve ever seen, and the wine list was varied and interesting. One of the owners stopped by our table and told us a bit of the restaurant’s history, which was a nice bonus. A lovely meal and evening! We stopped here for Sunday brunch and the chicken and waffles were excellent. Although it was crowded the service was fast and friendly.",
   "Great friendly atmosphere!  Authentic Southern Traditional and Caribbean cuisine!",
   "Got my usual order of double rice&beans and plantains.  My rice order was CLEARLY not a double order and the plantains were black, like they had been reheated several times.  They would typically give me this order in a carry out container but this time, it was in 3 separate containers.  This alone wasn't an issue so I asked if my order could be bagged.  I was simply handed a bag.  The entire experience today was not good.",
   "Great customer service and AWESOME food!!",
   "Great place very nice employees delicious food."
  ]
 },
 {
  "name": "Picante's Grill",
  "address": "960 N State St, Jackson, MS 39202, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/28ca446e-9331-11ea-a205-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "food",
   "food",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18401004924377571724",
  "source": "GoogleMaps",
  "reviews": [
   "Great food, inexpensive, the owner and employee s come you feel like family. When ever your at a place where the owner comes out talk and will set down with like he grew up with up. This place is a keeper and yes you find some healthy thing on the menu 😉😁😁 thanks for being awesome business 👍👍 😊",
   "This place is my favorite Mexican restaurant in the area.  I've been here many times and the food always tastes the same, delicious. The eating area is always clean and the bathrooms are generally clean as well. My food has always been ready in under 10 mins.  My only complaint is the service. The best waitress is Gerardo. The  service from other servers is not always the best. After they bring your plate, they don't come back to your table. Always request to sit in Gerardo's section.",
   "The fajitas picante was the best. It arrived with chorizo, shrimp, steak, and chicken. It was wonderful. More than enough to fill one person up.I love their salsa. It tasted very fresh and I love the amount of lime in it. My favorite. And the best, was is the paprika on the table. Everyone should put it on everything.",
   "Food is served quickly and is a good price.  Service is good.  Would be nice if there was a little better parking.",
   "It's a shame when a restaurant has good food, but customer service ruins your experience. Came here to meet with some sorority sisters after a funeral. And was given not the best customer service. Server was very short, and would just walk off while you were talking to her. Our food came out at all kind of crazy times, no napkins were given although asked many times.  I honestly don't think I would return here."
  ]
 },
 {
  "name": "Zoe's Restaurant",
  "address": "5350 N State St, Jackson, MS 39206, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/290e7b24-9331-11ea-b349-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17472998360183843013",
  "source": "GoogleMaps",
  "reviews": [
   "I have waited 2 hours for my food. The first and the last time going there, never again. The food was not good and plus my food was cold. I have never waited for my food for that long. I have ordered a grilled chicken salad and they put way too much bacon on it. It was too much..",
   "Some of the best food around with many different options.",
   "Yes Ma'am Pam honey! I enjoyed the service, quality, and quantity of my food andexperience! I felt like Whitney Houston after my first taste. I have nothing!!! Keep up the great work! God bless‼",
   "Man!!!! Everything on the menu is AWESOME!! Brought my sil and she fell in love!!!",
   "Easily one of the best and most underrated spots in Jackson. The food was great and the service was even better!!! I'd spend money with them any day."
  ]
 },
 {
  "name": "Piccadilly Restaurants",
  "address": "350 W Woodrow Wilson Ave, Jackson, MS 39213, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/295c7480-9331-11ea-8c80-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "tour",
   "food",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11065909463825565429",
  "source": "GoogleMaps",
  "reviews": [
   "We love to go to the location in Jackson, MS, on I-55 frontage road. Jackie Wiggins seems to always be there to greet us with a smile and give us extraordinary service. We are happy to go there just to see Jackie. She knows what we want when we arrive, and get our omelets going. It is just a pleasure to enjoy the wonderful food and our visit with Jackie. She makes our experiences special!",
   "The Food was delicious and filling! Excellent Management, cooks, and serving/wait staff! I brought our Senior citizens to Jackson, MS for a Cultural Arts tour. We were treated like royalty by Mrs. Kisha at this Piccadilly!",
   "Never ate at a Piccadilly before. The. Choices are overwhelming. Good thing is you have to go past all of the offerings before you get your tray. We hit this right at rush time so there was a line but it went quickly. Some of the food could have been warmer. Just had the vegetables for lunch. Broccoli and lima beans but both were good. Lots of choices.",
   "The pork loin was fork tender, not greasy at all. The food servers were polite & helpful as was the cashier. The young man working the dining carried my tray (I had bags & jackets over my arms). He  appeared to be working the entire dining room by himself. He had a cheerful countenance & did his job well even as stretched as he appeared to be.",
   "A great family environment. The children also enjoy the food and fellowship here😋"
  ]
 }
]