[
 {
  "name": "Missouri State Penitentiary",
  "address": "115 Lafayette St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/29a72f78-9331-11ea-9617-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "tour",
   "tour",
   "history",
   "walking",
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=13648314763188517857",
  "source": "GoogleMaps",
  "reviews": [
   "Nine friends and I booked a 5-hour photography tour. I knew it was going to be cool but it exceeded all of my expectations. Our guide, Larry, actually used to work at the facility and share so many personal stories with us. There were certain areas that had some tornado damage so we were unable to tour then but even then we didn’t run out of locations in the five hours. Our guide was also patient with us photographing high and low every 3 feet too. If you enjoy history of a different kind and abandoned places it will be an exceptional visit for you too.",
   "Awesome tour, tour guides are previous guards, warden. They have first hand knowledge of this place. Too scared to do the overnight ghost tour, so I went during the day. It was even a little scary during daylight. Very cool place, and prices very reasonable to tour.",
   "Tour was very informative about the history of this facility.  You have the opportunity to see where the inmates lived and about some well known people who resided there. There is a lot of walking so where comfortable shoes.",
   "We took the two hour tour (cold and damp in November so bring a hat and dress warmly) led by a former employee of many years. He had also studied well and knew so many interesting facts. This place is absolutely fascinating and huge. From his descriptions, I could totally imagine what it would have been like to be there back in the day. Great job.",
   "Larry and Kathy were great Tour guides! Very informative and entertaining!  Had a great time."
  ]
 },
 {
  "name": "Missouri State Capitol",
  "address": "201 W Capitol Ave, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2a0d4494-9331-11ea-9e6f-14b31f159f22.png",
  "tags": [
   "tour",
   "historic",
   "history",
   "tour",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=14062949815225110283",
  "source": "GoogleMaps",
  "reviews": [
   "Jefferson City has a nice downtown area mixing historic and modern buildings. The state capitol is worth a visit, not necessarily as a destination stop, but certainly for an hour or two break if you're passing through; or, as we did, make Jefferson City a stop for the night when traveling I-70 (it's only about 30 miles south of Columbia). Our highlights are the Thomas Hart Benton paintings in the House Lounge and several of the lunettes on the second floor (the tour guide pointed out the best ones). We also enjoyed exhibits on Missouri natural history.",
   "I would definitely recommend taking a tour of the capital of the state of Missouri great art structures to be seen great place to take photographs lots of local venues Restaurant shopping in Jefferson City can make it worth the trip depending where you live Grounds of the capital or beautifully kept I recommend fall of the year early spring after they implanted all the flowers. A great One day road trip for residence and a beautiful place to stop for anyone passing through the state.",
   "Even though had a 2 year old with our group it was interesting I also think that she was the youngest to visit the Capitol",
   "Very pretty building, even if construction prevents you from seeing the outside.",
   "Historical Art Work and Artifacts inside our beautiful Capitol. (Under construction 2020 currently in March)."
  ]
 },
 {
  "name": "Jefferson Landing State Historic Site",
  "address": "100 Jefferson St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2a523b42-9331-11ea-8de0-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "historic",
   "family",
   "wander",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=3450947467263133751",
  "source": "GoogleMaps",
  "reviews": [
   "Great historic site. The decor, enviroment and overall feel of this place was spot on. My children and I loved it. Entertaining and educational. The staff were very helpful and knowledgeable. Overall very family friendly and a great experience!",
   "Such history! The volunteers who wait patiently for adventurers to wander inside spring to life and share their knowledge and love of Missouri history in interesting ways. It’s really a great little piece of history in Jeff City.",
   "Sweet Chipotle BBQ at the landing. With wooden Shafers. Brisket and pork was amazing.",
   "Best place for homecoming pictures...👍",
   "Wonderful history here. Flat Stanley agreed."
  ]
 },
 {
  "name": "Museum of Missouri Military History",
  "address": "2405 Logistics Rd, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2aa4ef52-9331-11ea-8993-14b31f159f22.png",
  "tags": [
   "historic",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11212225968242878845",
  "source": "GoogleMaps",
  "reviews": [
   "It's all very well done. Interesting items everywhere you turn and the curators had answers for just about every question. \nIn all fairness, I brought a group a elementary school students to the museum. :)",
   "Plenty of historical mementos of past and future Missourians in the military who have contributed and some laid their lives for the nation.  Small museum but very nicely laid out with nice displays inside and outside of the museum.  Come and check it out!",
   "Great displays and enjoyed being able to see the planes and equipment up close.",
   "It was so awesome to see the historic pictures and the planes jets and equipment !",
   "A wonderful museum to visit with so many displays and information on how Missourians have  participated in US military conflicts over the last 160 years. A MUST see for your family"
  ]
 },
 {
  "name": "Lewis and Clark Monument",
  "address": "101 W Capitol Ave, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2aee364a-9331-11ea-9959-14b31f159f22.png",
  "tags": [
   "nature",
   "history",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12798332697374036600",
  "source": "GoogleMaps",
  "reviews": [
   "Under construction but really nice area. Weather was perfect so added to the scenery.",
   "Few things that relaxes me.  Is nature.  Totally amazing.",
   "Much hard work went in to making this monument a huge success, job well done Janet M and crew. Hopefully we can get the entire country to stop and enjoy the history....",
   "This was a fun and interesting monument to visit. And FREE!!!",
   "Nice quiet place for a stop & a bit of history."
  ]
 },
 {
  "name": "Binder Park",
  "address": "5840 Rainbow Dr, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2b3e6da2-9331-11ea-8e0f-14b31f159f22.png",
  "tags": [
   "kids",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=10106031368605326604",
  "source": "GoogleMaps",
  "reviews": [
   "Cool, well marked bike trails through the woods.  Different levels of riding, good for kids and adults.  A lot of spider webs in the early morning though!",
   "It was really nice to get out with my 🐕 and he enjoyed it . Lots of people out enjoying weather and the Lake 🌞",
   "Beautiful day at the park to do some geocaching.  Unfortunately, we couldn't find 2 of the 6 we looked for, nor had others so they probably need to be serviced but there are tons there!",
   "Nice size lake, great for fishing, hosts a renaissance festival in August I think, good nature trails but must watch little ones as they could easily fall into the lake, not for elderly who need cane or walker (the trails, that is, they are not paved, lots of roots and rocks sticking up),  nice pavilion for get-togethers, floating dock to fish from, very pretty, camping area",
   "Come play disc golf! Two 18 hole courses that are fair challenging. All kinds of space and woods for walks or runs, or enjoy fishing or relaxing by the water. 150 acre impoundedment."
  ]
 },
 {
  "name": "Jefferson City Memorial Park",
  "address": "111 Memorial Park Dr, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2b95652c-9331-11ea-ae1d-14b31f159f22.png",
  "tags": [
   "walking",
   "kids",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6469198514327520952",
  "source": "GoogleMaps",
  "reviews": [
   "This is a nice park. They have a great walking path and plenty of covered picnic tables. The play ground area has the padded floor and there is a basketball court as well as a pavilion that can be rented.",
   "Good path/sidewalk around the perimeter, pavilion with kitchen, restrooms and mini/pavilions with one table and grill each. Lots of foilage, two playgrounds. Something for everyone here.",
   "It's a nice park Well kept & seems to be safe.Its a nice place to walk(with or w/o a dog) & also includes a nice play area for kids.The shelter can accommodate a fairly large crowd for get togethers as well.",
   "The kids had so much fun at this park! It is so beautiful! I wish our city had something this big and spaced out. There are a few playgrounds, a nice walking trail, lots of places for several families to BBQ. It is really a nice park! Towards the back of the park, there is a water park with huge slides! Jefferson City you truly are blessed!",
   "Very nice, clean park. Nice playground and a nice place to go on a walk."
  ]
 },
 {
  "name": "Ellis-Porter Park",
  "address": "1425 Riverside Dr, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2bf350a2-9331-11ea-97a7-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=151410445639303084",
  "source": "GoogleMaps",
  "reviews": [
   "Really nice park. Has swimming pool, basketball court, and playground. Had a nice view of the river as well.",
   "Good experience of Amphitheatre movies",
   "Perfect little park close to my daughter's school. The pool is nice with a good area for younger children. Also a nice little walking path.",
   "Lots of space, multiple play grounds and pool in the summer",
   "A nice view of the river, clean bathrooms, clean grounds, a working water fountain, and awesome pool, and amphitheatre."
  ]
 },
 {
  "name": "McKay Park",
  "address": "1700 Southridge Dr, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2c4210c8-9331-11ea-b2c7-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "kids",
   "structure",
   "kids",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=5554692688583038485",
  "source": "GoogleMaps",
  "reviews": [
   "Always a treat to visit McKay Park.  It is a wonderful natural setting with the most user friendly features.  The paved walk trail around the lake always has people of all ages walking/jogging through the pleasant scenery.  An updated large playground always has the giggles and laughter of children playing.  Today a unique surprise as a RC control operator was flying his \"seaplane\" on the glassy afternoon lake surface....and finally my main pursuit of happiness there today was the call of the Lake's most recently stocked Rainbow Trout...and my call was answered many times over catching and releasing several of these beauties.  Describing this experience as a \"little bit of heaven on earth\" might be a bit of a stretch...but after I left today I felt again that it is....!   Highly recommended.😍😍😍",
   "The playground in this park is first rate, with a structure for little kids and another bigger structure for older kids. The bigger structure is tall, almost two stories. There are several different climbing options, and two slides in the bigger structure. Plus there are a couple of sets of swings. The lake is at least an acre. The sidewalks and lawn are nice all around the lake.",
   "Trout fishing, dog walking, kids playground, 3 parking areas. There is a nice picnic area by the \"lake\" or rather pond and down the hill nice area to play soccer or other lawn sports.",
   "Today was a very nice day and much needed fresh air. My nephews definitely enjoyed themselves.",
   "Always a nice place to walk our dog. Just have to steer clear of droppings on the path left by the resident geese. 😊"
  ]
 },
 {
  "name": "Clark's Hill/ Norton State Historic Site",
  "address": "8838, 1816 Osage Hickory St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2c9da41a-9331-11ea-b3ec-14b31f159f22.png",
  "tags": [
   "hike",
   "historic",
   "history",
   "walking",
   "hike",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=10179397251332824068",
  "source": "GoogleMaps",
  "reviews": [
   "An historic walking trail, with signs denoting the Lewis and Clark history abounding! There are several burial mounds located on the crest of the hills, with markers explaining their significance and history. The end of the trail features a gorgeous deck overlooking a large bluff, with miles of forest below. A definite must for anyone looking for an invigorating hike with a fantastic view if history!",
   "It was a nice quiet hike. Kinda cold for January but I don't believe that you could see awesome veiw during spring or summer. I'm glad that no one has trashed it out yet",
   "Beautiful trail with an amazing reward at the end, minus the 5ft black snake curled up sun bathing on the trail.",
   "Way off the beaten path! A fantastic Central Missouri historical trail",
   "Pretty cool place, but very secluded. At the end of the trail is a lookout that faces east. The trail is fairly easy to walk and there are a few decent views of the MO River."
  ]
 },
 {
  "name": "North Jefferson City Recreation Area",
  "address": "927 4th St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2d01ce34-9331-11ea-90bc-14b31f159f22.png",
  "tags": [
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16311570937795950559",
  "source": "GoogleMaps",
  "reviews": [
   "It was nice. I liked that the water fountain at the pavilion also had a spout to fill water bottles. The playground appeared to be well kept.",
   "Great area with lots of functional space and buildings. Easy to find and navigate. Well run festival for the Solar Eclipse in 2017.",
   "Great place for sporting events and hanging out with your family",
   "Nicely separated rooms, well kept, and easily accessible",
   "The park is pretty small, but I heard no complaints from my kids: 7, 5, and 2. The older ones made it an obstacle course and the 2 year old did swings."
  ]
 },
 {
  "name": "Hough Park",
  "address": "Ivan Rd, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2d5cbfc0-9331-11ea-98c2-14b31f159f22.png",
  "tags": [
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=15252786459193984670",
  "source": "GoogleMaps",
  "reviews": [
   "Waitress was really attentive, clean tables. I just didn't care for my main course. Have eaten there before and liked it.",
   "I love this place. I'll try to go here a few times a week. I fish here alone. Sometimes my kids will come with me, but not very often. Just a nice peaceful Park that feels like it gets you out of the city even though it's right in town.",
   "It deserves 4 stars but I was shocked how nice the course  was it has a really cool layout and the green are solid so I gave it 5 stars I m going to play today",
   "This golf course is in much better shape then I remember 10 years ago. For a public course, you can't beat the price and track. Greens run great.",
   "Great local spot tucked away in between the rear of a golf course and a family friendly subdivision"
  ]
 },
 {
  "name": "McClung Park",
  "address": "931 McClung Park Dr, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2da194ec-9331-11ea-a709-14b31f159f22.png",
  "tags": [
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=14977229047226346818",
  "source": "GoogleMaps",
  "reviews": [
   "My littlest one (almost 2yo) has a bit of trouble navigating some of the obstacles in this playground.  But the older kids enjoy it.  We found on our last trip there's an area with a large long table that could be great for crafting, and a large fire pit.  Requires permit to use, however.",
   "Scenic little park.  Good view of Capitol rotunda and surrounding city.  Wooded trail and newer child playground with padded flooring.",
   "I had never been here until last week for a friends wedding and it was perfect. The park has lots of space for activities and hosting a weddings. The pavillion is large and there was a serving area below the pavilion that couldn't be better!",
   "Been to to events using the main event hall and it is great. Play grounds to send the kids to play and always clean.",
   "Spacious,family friendly play ground and parking is plentiful. Kitchen, rest rooms and chairs if you need them. Located across Lincoln's Stadium ...BUT there is a huge curved hill at the entrance of the park."
  ]
 },
 {
  "name": "Jefferson City Museum of Modern Art",
  "address": "220 E High St a, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2df66bb6-9331-11ea-8481-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=10751569894537082854",
  "source": "GoogleMaps",
  "reviews": [
   "If you have any interest in your own culture or that of others, or would like a more in depth view of some of the struggles and hardships that helped shape today's America, this place is a must stop and see on your next venture.   You can call and schedule free private tours for groups of any size. Chris, our tour guide, was very sweet and insightful as she educated us (me, husband, and 3 kids age 3, 10 & 13) on the featured artists and the message they portray in their work.",
   "Very cool place. Currently have to have an appointment to get in, but well worth it.",
   "A small but very nice.",
   "Lots of history here..",
   ""
  ]
 },
 {
  "name": "Cole County Historical Museum",
  "address": "109 Madison St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2e3af04a-9331-11ea-b6f6-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "knowledgeable",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=9491648240832889107",
  "source": "GoogleMaps",
  "reviews": [
   "Great docents and many things to see.",
   "Wonderful artifacts and knowledgeable toyrguudes.",
   "Great museum and guided tour. Our guide was very knowledgeable. Loved it!",
   "Beautiful area to stop and take pics",
   "Small but interesting"
  ]
 },
 {
  "name": "Jefferson Landing Historic",
  "address": "100 Jefferson St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2e9cad30-9331-11ea-b47a-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=17343801609849476783",
  "source": "GoogleMaps",
  "reviews": [
   "Kind and helpful staff.",
   "Very informative and I learned a lot from there.",
   "Fountain of Centaurs was operating. Very nice area between state capital and railroad.  Area was clean and no riff raff ",
   "The museum is cool, but there isn't a whole lot to see. ",
   "Great to gaze over the Missouri river. "
  ]
 },
 {
  "name": "National Churchill Museum",
  "address": "501 Westminster Ave, Fulton, MO 65251, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2ef1ab40-9331-11ea-88ce-14b31f159f22.png",
  "tags": [
   "history",
   "art",
   "history",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=1727802591143960423",
  "source": "GoogleMaps",
  "reviews": [
   "I loved the way this museum is setup at the church. A lot of resources have been dedicated to this speech and I'm glad to see it. It's impressive that the entire church was able to be imported all the way from London. Only suggestion I would have is that I'd like to see the gym where the speech was held tied into the museum a little bit more. Everything else was great. Thanks.",
   "History at it's finest. Standing wgere Churchill did in front of a piece of the Berlin wall amazing.",
   "A great day trip from the Kansas City area. So much amazing and interesting history in Fulton!\nThe museum below the church provides so much information. It was very well done.\nThe church is magnificent and the story of how it came to Fulton is anything but boring.\nThe art created by Churchill's granddaughter from 8 sections of the Berlin Wall is moving and a beautiful way for her to honor her grandfather.",
   "We have been to the Imperial War Museum and Churchill War Rooms museum in London.. We drove through Fulton just to see this museum, too.. I didn't know what to expect but we were VERY impressed!! One of the better museums we have visited, well done and informative.  If you are remotely interested in Churchill - highly recommended!",
   "The Winston Churchill Museum was very informative. This Museum was executed very tastefully. The artifacts were organized & original. I would recommend 2 to 3 hours for touring. Please take your family's to view, it was outstanding..."
  ]
 },
 {
  "name": "Rock Bridge Memorial State Park",
  "address": "5901 South Highway 163, Columbia, MO 65203, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2f3cf5a6-9331-11ea-95d2-14b31f159f22.png",
  "tags": [
   "history",
   "walk",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=1926399871927926414",
  "source": "GoogleMaps",
  "reviews": [
   "I love hiking here. Just a cool piece of Missouri history. Allegedly? The Devils Ice Box got its name because it was sort of a speak easy type place in the past. Local folk would come here on Summers evenings to play cards, etc. to escape the Missouri heat. \nOriginal owners donated the land to the state, to prevent development.",
   "This is a nice little state park just outside of Columbia, Missouri.  The Rock Bridge and Devil's Icebox are part of a collapsed cave system.  There is a wooden half mile trail that takes you to both and is very easy to walk along.  There are a few overlooks to stop at along the way with displays that explain the geological processes taking place and the wildlife (bats, trogolobites) inside the cave.",
   "Rockbridge is a great park with many trails of varying length and difficulties. None are too strenuous though so don't fret! They are generally pretty good about blazing the trails well but there are some spots where things get mixed up. The scenery is beautiful!",
   "Great place to hike. Dog friendly. Beautiful. Options for the many levels of hiking from beginning to moderate. My only complaints are that there are a Ton of stairs, some loose boards, and it is very slick when wet.",
   "I always have a good time at RBSP. I take my dog out every once in a while to home the sinkhole trail. It can be a bit muddy if there's been any rain, but if that's the case the devil's icebox trail is mostly boarded walkway, so there's always somewhere to go. Glad we have such a pretty park to visit nearby."
  ]
 },
 {
  "name": "Align Chiropractic Clinic",
  "address": "3306 Emerald Ln A, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2f92ae00-9331-11ea-bde3-14b31f159f22.png",
  "tags": [
   "educate",
   "knowledgeable",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=7414106444533502316",
  "source": "GoogleMaps",
  "reviews": [
   "Dr. Johns and his crew are always friendly! They get you in an and out quickly but they also take the time to listen to you! They are also very reasonably priced!",
   "Dr. Johns and his staff are amazing. They take the time to educate you and answer any questions you may have and you never getting the feel that they are rushing to get to the next patient.",
   "After enduring 5 years of chronic pain and going to many doctors I felt very hopeless. Since finding Dr. John I have learned that he is affordable, compassionate, & knowledgeable. He is prob one of the nicest Dr's you will ever meet. He never makes you feel rushed. He puts all your anxieties to ease. He has the best office staff ever. Love those girls! ❤  I feel like I'm on the mend. Jefferson City has a Gem. I can't say enough about his office.",
   "EXCELLENT STAFF AND EXPLANATION OF CHIROPRACTIC CARE, FIRST TREATMENT APPOINTMENT  AND I FEEL 100% BETTER.",
   "The best caring group you’ll ever find.   They are the greatest!   Helping me so much and I know that if you’ll give them a try they’ll help you too!"
  ]
 },
 {
  "name": "Painted Rock Conservation Area",
  "address": "Westphalia, MO 65085, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2fe1b162-9331-11ea-9a3e-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=16987227624728814912",
  "source": "GoogleMaps",
  "reviews": [
   "camped out, despite the rain cold weather and the fish not biting at the lake, I had a wonderful time with a very very dear friend. We did catch some fish in the river and a nice Buzz as well.",
   "This is a nice park for hiking, camping, and fishing. The trails are easy and good for any age or fitness level. The views are awesome. The camping is nice. There are three entrances to the park, so preplanning is necessary.",
   "Excellent walking trail with beautiful overlooks of the Osage River.  Very peaceful and quiet and a good workout as well.\n     If you can't walk down hills or up inclines, you may not want to tackle this walk as it is a little rocky in areas and can be slick when wet and challenging in the heat.",
   "1.6 mile trail, two viewpoints of the Osage, took my GF and I about 1 hour to hike the trail with our dogs.  Great scenery and absolutely beautiful!! I'm 65 with bad knees. Trail is kinda rugged but I made it with ease. Several benches along the trail to rest on. Great hike!!!",
   "Good place for hiking."
  ]
 },
 {
  "name": "Stark Caverns",
  "address": "125 Cave Dr, Eldon, MO 65026, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/302e3e82-9331-11ea-93ac-14b31f159f22.png",
  "tags": [
   "tour",
   "family",
   "kids",
   "nature",
   "knowledgeable",
   "tour",
   "affordable",
   "knowledgeable",
   "tour",
   "tour",
   "history",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=10960696223013072885",
  "source": "GoogleMaps",
  "reviews": [
   "Went by today with our 2 young boys on vacation.  Had a great time, it was just our family on the 12 noon tour, which was kinda cool to get a personalized tour.  Thanks to Lee our tour guide for taking us through the 4 level cave!  Many great features that we got to see close up.  Our 6 & 8 boys were very focused and like it.  Lee \"played\" well to the kids.  Warm inside the cave.  Had as nice gift shop with souvenirs and nature books for kids etc.  Cool clothing options.  They were getting ready for a really cool Valentine's event on the cave which may be why when we first showed up the door was locked and we didn't see anyone at first.  But then someone came to help us, that would be the only negative of the experience.  Keep in mind their tours are 10, 12, 2 and 4 each day.",
   "Wow!!!! Paula is an AMAZING guide! She knows her stuff and is super friendly and helpful. Staff appeared knowledgeable and professional and the caverns are beautiful! I suggest spending a little more money for the Black Light Tour. We had an amazing experience and will definitely be back!!! (Also, the gift shop prices are appropriate and affordable). Love it!!!!!!!!",
   "This was so much fun! I did the black light cave tour and the woman that was our tour guide was absolutely AMAZING. She was very knowledgeable and taught us about the caves, mineral deposits, how the formations are made and even taught us about luminescence. Very cool experience. If you have a chance to go, I highly recommend getting on her tour. Great experience!",
   "This Cavern is super cool with 4 shelves to explore lots of Beauty and history a must-see for cave lovers! Tour guides are awesome very informative friendly and considerate.",
   "I just went to Stark Caverns after seeing all the positive reviews online, this place is phenomenal. It’s worth noting that I got there an hour before the first tour and would’ve missed it due to my flight, but Paula (the tour guide) was able to bring me, so a huge thank you for that... The caves themselves are absolutely amazing, so many millions of years of geologic history, you’ll see countless different types of formations. It’s just absolutely intriguing, especially to hear all the history of the cave intermixed with the geologic aspects on the tour. They’ve also done a magnificent job of lighting the caves In a way that blends in without detracting from their natural beauty. I’ve been in several different game systems at this point, and each has their own flavor and character, Stark Caverns is an absolute must see whether it’s your first time or you’re a seasoned caver... One last note, there are actual ancient physical human remains on display that were found in the cave and interred respectfully, adding a level of gravity to the experience that you won’t get anywhere else. Thank you guys for an amazing tour!"
  ]
 },
 {
  "name": "Stephens Lake Park",
  "address": "2001 E Broadway, Columbia, MO 65201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/307a89d8-9331-11ea-aed2-14b31f159f22.png",
  "tags": [
   "nature",
   "walk",
   "free",
   "family",
   "art",
   "parks",
   "walking",
   "field",
   "family",
   "walking",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=12180302834487909996",
  "source": "GoogleMaps",
  "reviews": [
   "Really wonderful large park in the middle of Columbia, bringing nature to the city. Has lots of small pavilions around and multiple playgrounds, plus lots of empty space great for small gatherings or other outside activities.",
   "Well designed park with something for everyone. Free swimming and splash  fountain in the  summer. It's a great place to walk or jog.",
   "A Park that rivals other City Parks in similar sized communities.  Having a Memorial Bench and Heritage Tree in this Park makes it extra special for me and my family to visit from time to time.  The Lake is large, clear and defines the heart of the space.  With an interior paved walking path around the perimeter of the Lake, as well as a longer paved walking and running trail the Park gives persons options for leisure walking and exercise / fitness pursuits.   An amphitheater provides outdoor concerts and a venue for special annual events such as Roots-N-Blues-N-BBQ in the Fall.   The Park is also home to the Annual Art in the Park event and a perfect backdrop for patrons of the arts to enjoy viewing the creations of artists from around the United States.   A Splash-Park is also another feature of Stephens Lake Park and one very suitable for children.",
   "Beautiful park! Nice walking trail and plenty of field to host family outings",
   "A very open and beautiful park with docks and walkways on the lake, a playground, small waterfalls and plenty of benches to sit down and relax to just enjoy nature. The bathrooms could certainly use more care, but this is the only issue I have with this park. It's a wonderful place for a picnic, gathering, or just a place to get away and relax."
  ]
 },
 {
  "name": "Shelter Gardens",
  "address": "1817 W Broadway, Columbia, MO 65218, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/30d6dae8-9331-11ea-a537-14b31f159f22.png",
  "tags": [
   "walk",
   "wander",
   "walk",
   "family",
   "walk",
   "family",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=14566387565574689331",
  "source": "GoogleMaps",
  "reviews": [
   "A rare and beautiful example of a formal garden with plant varieties in abundance.  It is evident that the Shelter Insurance Company has invested time, money, and thoughtful planning in this oasis of a park on the edge of Columbia.  With the corporate buildings nearby, and a large apartment complex bordering one side of the gardens, it is still quiet, peaceful, and serene.  A place where one can go to walk, be alone, be quiet in an otherwise noisy world.  Time set aside in Shelter Gardens to think, pray, meditate, wander aimlessly, or spread a blanket and lay underneath a canopy of clouds is time well spent.  A true treasure of Columbia, Missouri and not to be missed at any season of the year.",
   "Great place to go with family or by yourself. Covered shelter available and paved path to walk on. Especially beautiful in spring or fall. A favorite for my family.",
   "Peaceful, well-maintained Park with paved pathways winding around the 5 acre property. Enjoy multiple water features & waterfall with coy pond. I liked that all of the vegetation & tree variations were labeled. All 5 senses go to work & I can imagine how this place must look fully bloomed on a sunny day (cloudy morning today). There's also an old schoolhouse you can walk into, sit down or leave your mark on the chalkboards. Love this place!",
   "Great place to spend time with family but some area were not properly maintained and there were street dogs everywhere.",
   "Beautiful and tranquil, the perfect place to just walk or sit, and put your mind at ease.... or have a picnic! This gorgeous outdoor area also offers an educational benefit to botany students, or any green thumb enthusiast, as all the trees and shrubs are labeled. Another plus to this already free-to-public outdoor area is that it makes a great photo op for any occasion, complete with stone pathways, fountains, flowers, evergreens, a gazebo and even and old school house!  Doggy mess bag/drop off stations are  available at the entry to help maintain the garden's cleanliness."
  ]
 },
 {
  "name": "Runge Nature Center",
  "address": "330 Commerce Dr, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/311a26e8-9331-11ea-ae84-14b31f159f22.png",
  "tags": [
   "hike",
   "nature",
   "learn",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=11374527689421084322",
  "source": "GoogleMaps",
  "reviews": [
   "What a gem! This center is absolutely beautiful, and has so much to offer. It makes learning about our surroundings fun for people of all ages. Worth a visit if you’re in the area!",
   "Such a beautiful place to hike and enjoy nature. There are creeks, trails and so much wildlife. There is also a center that the public can go inside and find many facts about the wildlife around the area.",
   "Excellent opportunity to learn more about Missouri presented here.",
   "This was a great place to visit. The staff there was so friendly and knowledgeable.  The trails were clear, the exhibits and displays were fun and informative.",
   "One of our favorite places to go, wonderful activities inside. Amazing wildlife to interact with, beautiful trails."
  ]
 },
 {
  "name": "Grindstone Nature Area",
  "address": "2011 Old 63 S, Columbia, MO 65201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/319ebd78-9331-11ea-84e5-14b31f159f22.png",
  "tags": [
   "drink",
   "nature",
   "walk",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=4229769157408183860",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome park, has leash and off leash areas. Clean restrooms and a water fountain you can actually drink from. Lots of shade and nature trails tucked away along the main path. Also, great for biking too. HIGHLY RECOMMEND!",
   "Phenomenal local hiking trail. Great overhead tree coverage to share the trail. Well maintained walkways. Great immediately next to trail is trimmed down to reduce insects, especially ticks. Off leash area.",
   "Beautiful little spot, used it a couple times now as a pit stop when driving through Columbia. Really pretty and seems like it's connected to a trail network",
   "A beautiful stroll along the Grindstone Creek is a must to calm body, mind and spirit.  A very well-paved path, amply wide, meanders along the Creek where birds are in abundance.  Nestled in the niche valley houses and automobiles are not visible to the carefree walk through Nature.",
   "An overlooked trail in COMO. More curves than MKT but gives more scenic look. From rivers to meadows to woods to open clearings. Flat but some slight inclines. Connects to MKT as well. Great hiking areas and spaces for dogs off leash."
  ]
 },
 {
  "name": "Supplement Superstore",
  "address": "1922 Missouri Blvd a, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3219e408-9331-11ea-b483-14b31f159f22.png",
  "tags": [
   "free",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=13719007949901469955",
  "source": "GoogleMaps",
  "reviews": [
   "I called the Jefferson City store yesterday and told them what I wanted. I asked for some tips and if they would do curbside pickup because of this whole virus thing! They are doing that, but they offered me free delivery! I was like well heck yes! They took my information and i got my items delivered to me within 20minutes. They were friendly, fast and efficient! Also you can’t beat the prices! They were much cheaper than online! Thank you guys!!! I really appreciate it!",
   "I was super nervous to make a supplement purchase because it can be big financially. I called Gavin at Supplement Superstores. He was incredibly helpful answering all of my questions, and he gave me the most information  possible about the products in question. WONDERFUL customer service and WONDERFUL products.",
   "I went in and as soon as I walked in i was greeted and asked if i could use any help. She helped me pick up so protein powder for what I need. I have a lot of allergies and she knew right away what i should use.  And at the end she told me about a place I can meet up with others and work out since I am a single mom and don't have a lot of time on my hands. SO overall great experience.",
   "Started on a new journey last night at the Supplement Superstore.  What a wonderful experience.  Gavin was very knowledgeable & assisted me in understanding the mechanics of the system in nutrition & exercise.  Thank you, Gavin!\n\nI highly recommend Supplement Superstore.  You could not ask for better assistance in regard to supplements, diet, nutrition, & exercise.",
   "I have visited the JC Supplement Superstore a couple of times in the last 2 months and Gavin has been there both times to help me out.  Even though I knew exactly what I wanted, he visited with me and helped me find everything I needed.  He was very pleasant, upbeat, and positive.  He also asked me if I had any questions or was interested in trying anything new.  I definitely always enjoy my time while I am there.  I love the products as well."
  ]
 },
 {
  "name": "Auto World Museum",
  "address": "200 Peacock Dr, Fulton, MO 65251, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/32ae4ee4-9331-11ea-87bf-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=4684525967568969223",
  "source": "GoogleMaps",
  "reviews": [
   "Cool place, lots of cars, friendly.",
   "Auto World Museum is absolutely Terrific. Alit of mint condition vintage cars. Who would think there were \"all\" those cars inside this building in Fulton, MO. A gotta stop and view if interested \nIn Top Rate Vintage Cars *****",
   "If you like history and antique automobiles this is it. A must see.  Worth the trip.",
   "It's good for Callaway county and my dear sweet Granny \"Peggy Hawkins Thomas\" is in a old time down town blown up picture!! 🥰",
   "Nice collection of about 80 cars. There's neat backdrops so the cars look like they're in the right time period. Lots to see and read about the cars, and some rare cars we hadn't seen before. A bit small but packed full of cars. There's a solar car, a DeLorean, an electric Renault, a Cord, and a whole lot more."
  ]
 },
 {
  "name": "Museum of Art and Archaeology",
  "address": "115 Business Loop 70 W, Columbia, MO 65211, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3309b58a-9331-11ea-87af-14b31f159f22.png",
  "tags": [
   "free",
   "art",
   "history",
   "free",
   "free",
   "free"
  ],
  "link": "https://maps.google.com/?cid=3943651520248555210",
  "source": "GoogleMaps",
  "reviews": [
   "This is not a stand-alone museum, but rather a series of galleries in a university building. Nonetheless, there is a good range of art and artifacts to check out. While there are few iconic works, the antiquities collection is extensive and nicely curated. Objects are well-labeled, but the European and American galleries lack introductory level labels. I also hope that there are numbers to help match objects to labels in the antiquities galleries, as it isn't always easy to figure out the pictorial guides.\n\nI don't know why this place is separate from the downtown and campus areas of Columbia, but I think it is worth a little extra effort to come here when you are in town. Admission is free, and the staff are very helpful. Last but not least, be sure to pay a visit to the Museum of Anthropology next door. Who would have thought that it is home to \"one of the largest and most comprehensive [archery collections] in the world\"? Not to mention that local archaeology and history are presented there as well.",
   "Parking and entrance is free. Exhibits are split between the first and second floor. This was moved from the main campus when their building was being renovated. It is in an old cancer research building and renamed Mizzou campus north. The first exhibit and the largest is to the right as you enter the main doors under the covered drop off entrance.  The gift shop is in front of you to the left and the elevator is just past the gift shop. The stairs are also just to the left as you come in. When you come out of the elevator turn left to go to the exhibits. Coming out of the stairs it is a slight left then right.  I mention all of this since it isn't obvious unless someone is there to assist you as you come in. The exhibits are wonderful. Most seem to be permanent installations with a few that cycle in and out. The north campus location is nice since you don't have to fight campus traffic or pay for parking. It is close to I-70 and could be a quick stop while driving through town.",
   "Awesome place to visit and is free!!! Donations are welcome and well-deserved. A lot of work is clearly put into the upkeep. Very nice exhibits.",
   "Small free University Museum.  Some pretty cool items in the collection,  well curated,  and the right price.  Worth checking out if you find yourself in the COMO area.",
   "A pleasant little find in Columbia. Relatively small but some great pieces."
  ]
 },
 {
  "name": "Miner Mike's Inc",
  "address": "4515 Osage Beach Pkwy, Osage Beach, MO 65065, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/337bd88a-9331-11ea-9977-14b31f159f22.png",
  "tags": [
   "parks",
   "kids",
   "family",
   "affordable",
   "kids",
   "family",
   "free"
  ],
  "link": "https://maps.google.com/?cid=16731112493628128492",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing place to visit! Of the many attractions and amusement parks that we have been too, minor Mike's remains a top favorite! The staff Is quick to service, super friendly, and everything there is very reasonably priced. We travel two hours to enjoy this little gem because we feel it's well worth it. Highly recommend if you have never been.",
   "Nice place for kids to escape from the heat. Fun for all ages. Go-karts were a family favorite. The maze entertained the kids for hours. The games were affordable, however a few were not working the day we visited. The train ride was also not operational due to track maintenance.",
   "Absolutely a kid favorite place.  The kids maze is HUGE! All of the ride lines are extremely short, and most of the time you get directly on. The go-karts are FAST! Trouble with arcade games, the staff usually fix immediately.  The pizza is very good and priced accordingly as well.",
   "A truly great place for the whole family to have a great time with many options for entertainment",
   "The place was nice. My son enjoyed playing in their maze indoor playground. Some of the arcade machines were not working though. The Jurassic Park arcade game was very exciting to play with. The go kart was good too since they have a good space to run the kart around. \nThe prizes were all right. I really appreciate one of the staff who gave my son a free small toy since I did not redeem the tickets he won from the arcade coz I was planning to get more tickets for a better toy. He saw my son looking at the prizes and he gave him something small but really touched my heart and made my little boy smile. Great to see you have a staff who is sensitive and has a big heart. I did not get his name but I hope the management will notice that kind of person."
  ]
 },
 {
  "name": "Francis Quadrangle",
  "address": "410 S 6th St, Columbia, MO 65211, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/33e066fa-9331-11ea-8ebe-14b31f159f22.png",
  "tags": [
   "historic",
   "walk",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=4128902443792124481",
  "source": "GoogleMaps",
  "reviews": [
   "One of the most beautiful university scenes ANYWHERE in the world. A classic. Be sure to check out one of the newer features, the bronze Thomas Jefferson, along with his original obelisk-shaped grave-marker, on the East side of the quadrangle.",
   "It gives a historic vibe, with a glimpse of both the past (older pillars) and present (Jesse Hall). A good fresh place to chill out.",
   "One of the most pristine places of Mizzou! The green and the architecture is always pleasure to eyes.",
   "Always a nice place up take a walk.",
   "Great place to be. Love the tradition and the historic value. May be the most photographic place in the campus."
  ]
 },
 {
  "name": "Lake of the Ozarks State Park",
  "address": "0170, 403 MO-134, Kaiser, MO 65047, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/343d2d24-9331-11ea-ab79-14b31f159f22.png",
  "tags": [
   "free"
  ],
  "link": "https://maps.google.com/?cid=14862194599507814393",
  "source": "GoogleMaps",
  "reviews": [
   "We went down during the off season, but a beautiful weekend. We stayed at the campground, which was pretty much empty, and did some fishing. This is a beautiful area. We will definitely be back. Five stars for sure!",
   "Beautiful area to sit and relax. We saw plenty of wild life, did some trails, and explored a bit.  We built fires just about every night.  The cabin we stayed in was adorable, had a small kitchen, dining and living area with a loft bedroom. Be sure to bring more than enough of your essentials. We stayed in cabins that provided the basics but if we hadn’t brought our own we would have run out.",
   "We arrived at the campground with a new trailer and were pleasantly surprised to find flat pads, great hookups and very clean bathrooms and showers.  The sites are well maintained and litter free.  Hosts are very courteous,  friendly and helpful.  Swimming beach was also really nice and empty given we arrived after labor day.  Highly recommend camping here.  Good value for the sites.",
   "Great place to camp.  We went in winter and the park was very well maintained.   The camping sites all had great views of the lake!",
   "Many quiet private coves with no houses or bars.  Photo shows party cove which is not representative of touring by boat or anchoring to swim."
  ]
 },
 {
  "name": "Eagle Bluffs Overlook",
  "address": "Katy Trail, Columbia, MO 65203, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/349d365a-9331-11ea-a83b-14b31f159f22.png",
  "tags": [
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7688354610767513903",
  "source": "GoogleMaps",
  "reviews": [
   "Nice walking path from the parking area to the lookout.  Fantastic views",
   "Beautiful view! Don't follow Google's directions though, you can't get here by road. Park by Eagle Bluffs at the Katy trail and bike over on the trail.",
   "A must stop if you are biking the Katy trail. The climb is steep, but not tremendously hard or dangerous. If you do the climb, you are rewarded with a spectacular view of the Missouri River valley.",
   "The climb is pretty easy and short with a beautiful view at the top.",
   "The difficulty of the trail depends on which entrance you come from. If you are coming from the Katy trail (~6 mile round trip from McBaine), be prepared for a steep uphill climb. If you are coming from Warren School Road, it is a very pleasant, easy walk. The view is fantastic and well worth the trip from either direction. \n\nIt's best to visit this spot in the late fall, winter, and early spring, as it can be a tick haven the rest of the year (the reason why I've rated this trail 4/5 stars). I have also seen the occasional wasp and yellow jacket, so beware! \n\nGood place to have a quick picnic as long as you visit when the bugs aren't too bad."
  ]
 },
 {
  "name": "Cosmo-Bethel Park",
  "address": "4500 Bethel St, Columbia, MO 65203, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/350ac58c-9331-11ea-8737-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "kids",
   "walk",
   "kids",
   "parks",
   "hike",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=16704613297900113503",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for kids of all ages theres playing areas, picnic areas, trails to walk waters to fish in.",
   "The playground is excellent. That's not why we were there but I would definitely take my kid there. We were there to watch the sunset and discovered that there was a beautiful pond with a paved path all the way around. It was lovely to sit and watch the sunset, and we would have stayed longer if I had remembered the bug spray.",
   "Love the park and it's contours. My kids and  I enjoy it a lot.",
   "Columbia Missouri boast several fantastic city parks and this is certainly one of them. Beautiful views on the easy hike around the pond. The path is paved so eventhough it had been raining our walk was pleasant and not muddy.  The kids were enjoying the large playground as we devoured our dessert in one of the shelters on the grounds.",
   "Plenty of kid spaces as well as walking path around the lake. Shelters have bbq pits and there is a nice sand area for volleyball. Main downside is distance to restrooms and the usual metal Park toilets"
  ]
 },
 {
  "name": "Ha Ha Tonka State Park",
  "address": "1491 Missouri D, Camdenton, MO 65020, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3565b6f8-9331-11ea-a0f4-14b31f159f22.png",
  "tags": [
   "hike",
   "free",
   "kids",
   "free",
   "hike",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=14617865057319654376",
  "source": "GoogleMaps",
  "reviews": [
   "We started our 2 1/2 hour road trip in Alba, MO and ended up here at the amazing Ha Ha Tonka State Park. I originally only cared about seeing the castle remains, but found the Natural Bridge absolutely stunning. Unfortunately rain was on the way and my ankle was not cooperating. We only got to see a tiny bit of this EPIC park and now i plan to come back soon and be prepared with backpacks, snacks and proper hiking attire. It's so huge, one of the trails will take over 6 hours to hike! I can't wait to mark that off my bucket list! Best of all, FREE!",
   "Yesterday was a great day to visit this amazing natural wonder. And we were extra blessed, to find that the waterfall over the backside of the Natural Bridge was flowing due to the recent rain. I highly recommend this park for anyone waiting to take in Nature's Beauty, but if you can catch it after a rain and catch that waterfall, it was just breathtaking. Also, we had the chance to visit with a couple of the park rangers that were super nice.",
   "A beautiful state park that is part of what the Lake of the Ozarks is known for! Go see a burnt down castle, check out a serene natural spring, hike a collection of different trails, climb hundreds of merciless steps, i love it all! They also have covered areas for eating lunch and some with playgrounds for teh kids. If you want some more thorough and interesting information on the park visit  the visitors center located at the entrance of the park. Worth a trip, good FREE all day fun!",
   "This area is beautiful and there is so much to see. The staff was very nice and helpful as well. Definitely plan on spending an hour or two here.",
   "Awesome place to walk and sight see. Things like this.. NaTuRaL undisturbed beauty are abundant in Missouri . Come see Us here and we'll live up to the famed name and \"Show you what the Show-Me State is all about . \""
  ]
 },
 {
  "name": "Jacob's Cave",
  "address": "23114 Hwy Tt, Versailles, MO 65084, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/35d9d734-9331-11ea-81c2-14b31f159f22.png",
  "tags": [
   "tour",
   "learn",
   "knowledgeable",
   "tour",
   "kids",
   "active",
   "unique",
   "family",
   "history",
   "tour",
   "tour",
   "family",
   "knowledgeable",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=15861837907881255881",
  "source": "GoogleMaps",
  "reviews": [
   "The cave was very cool. I didn't give it 5 stars because the tour guide seemed a little less than happy to be there and the souvenir shop didn't have much stuff that was actually from the cave or made locally, which was disappointing. But seeing it was a neat experience. It was definitely chilly and I would recommend a sweater but you could make it without. I wore sandals and I was fine but the floor is a bit wet and there is dripping water so I would recommend tennis shoes. Definitely interesting and a fun memory.",
   "Very knowledgeable staff and an awesome tour. Lots to learn and see. My kids loved it, and so did we.",
   "I had the good fortune to stumble upon Jacob’s Cave on a Google search ahead of a trip to Missouri. I got there right when they opened so I was able to get a one on one tour with a young woman whose family owns and operates the cave. Even though the cave is millions of years old, it is very much an active system, with an incredible diversity of geologic structures being created right before your very eyes, with water snaking its way through every nook and cranny of the cave system, almost giving the illusion that the system itself is alive. I’ve been in several different caves at this point across Missouri and Kentucky and this one was one of the most fascinating, due to the completely unique combination of various formations. The tour itself was interesting and engaging the whole time, with the guide knowing all about the history of the cave, the geology that created it, and various other observations that made it a unique and rewarding experience all around. If you’re remotely near this part of Missouri, I highly suggest you drop by and take the tour, you won’t be disappointed.",
   "This was a great experience with my family.  Our tour guide made it especially fun and interesting. We went during spring break, which I understand to be kind of the off season; so no wait and a private tour for the five of us. Remember to bring your phone or camera in to take pics and video clips.",
   "A cool place with all kinds of neat features to tour! There was a nice path to follow into the cave, it was close to 1/2 a mile deep into the rock, & the guide was very knowledgeable while providing a fun tour"
  ]
 },
 {
  "name": "Bothwell Lodge State Historic Site",
  "address": "19349 Bothwell State Park Rd, Sedalia, MO 65301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3673a8ac-9331-11ea-82c4-14b31f159f22.png",
  "tags": [
   "unique",
   "tour",
   "history",
   "tour",
   "historic",
   "parks",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=4647091238244955067",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing historical location! Our tour guide Amanda was incredibly informative and we'll versed in the history and artifacts in the estate! Beautiful area with lots of unique facts about the original owner/builder/local philanthropist! We would definitely like to take the tour again!\n\nFYI, the tour has over 200 stairs and no AC, so be prepared.",
   "Incredible view. Restrooms. Trails. Watch for ticks. Informational. Interesting!",
   "There's not a whole lot to do in Sedalia, so make sure you visit this sensationally preserved historic home. Only $4 for a tour to help Missouri State Parks stay beautiful. Emma was a great tour guide. Fun, informative, worth it. \n(Also, pretty sure Mr. Bothwell was actually Bruce Wayne.)",
   "When I moved here, I thought this was a mansion nestled in the side of a hill. I wanted to live there. \nBut it's a beautiful place to have picnics and walks, and even run the trails. \nI've take many photos here also. This place makes a beautiful backdrop for portraits and senior pictures. \nIt's gorgeous in Fall.",
   "Very good your guide.  Everything is very well maintained!  Would have loved to tour the grounds, but it was raining!"
  ]
 },
 {
  "name": "Finger Lakes State Park",
  "address": "1505 Peabody Rd, Columbia, MO 65202, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/36c9cdc2-9331-11ea-b71f-14b31f159f22.png",
  "tags": [
   "history",
   "parks",
   "nature",
   "organized",
   "walk",
   "nature",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=2817961110898202361",
  "source": "GoogleMaps",
  "reviews": [
   "While this is a beautiful area, the park is really not for me, as I visit state parks to commune with nature, and this is one of Missouri's two state parks which allow ATVs. I don't want to hear the roar of those engines as they whiz past me! If you don't mind the noise, the park does have a lot to offer,, such as a campground (with a playground), and opportunities for a variety of other activities, including boating (electric motors only), canoeing, kayaking, swimming, fishing, picnicking, hiking, mountain biking, and metal detecting.\nThe park has an interesting history, as the area was once known as Peabody Coal Company's Mark Twain Mine (1964- 1967). The company donated the land to the State in 1974, for use as a park. We really enjoyed the scenery, the noise, not so much.",
   "There's more to do than riding off-road vehicles. Canoe ($25/day) and kayak ($15.90@2hr) rentals, mountain bike trails, swimming, and beautiful picnic sites. Stayed in early September through the week with only one other camper here. A couple off road vehicles were at the park but not heard from at camp site 16. The park attractions are a distance apart, camp sites are large, clean bathrooms and showers and an organized and helpful park office. I've been to most Missouri state park campgrounds and this modern, well-maintained park has to be one of my favorites.",
   "I grew up going to finger lakes and Rocky Fork! There's just about anything outside you want to do here. This is a great place for camping Motocross fishing they have a firing range at Rocky Fork. And there's times when I actually go out here and do nothing more than just walk off into the woods and have some peaceful time to myself and the best part is it's really not that far out of the city so I don't have to travel long distances to go out and enjoy nature without having a whole mess of people around me destroying but I'm trying to enjoy!",
   "One of my favorite State Parks. One of the few State Park where you can ride ATV'S. The park has quite a few trails to ride and explore. The park has a very nice shooting range with a dedicated pigeon shooting area. Also has a lake though it's fairly small and the swimming beach isn't much. Things to know $5 per person to ride if you're a Missouri resident.  You need a helmet and a flag on the bike. No passengers unless your bike is designed for one. Area does have a loading/unloading dock.",
   "The state takes 5 star care of the park. It’s a great resource. I give it 4 stars because sometimes idiots go out there and have no idea of gun safety. We leave then. We don’t use the make or the 4 wheel park."
  ]
 },
 {
  "name": "Bridal Cave",
  "address": "526 Bridal Cave Rd, Camdenton, MO 65020, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/371a7b86-9331-11ea-8272-14b31f159f22.png",
  "tags": [
   "unique",
   "tour",
   "kids",
   "unique",
   "tour",
   "tour",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=4259003155910921205",
  "source": "GoogleMaps",
  "reviews": [
   "The tour was short :( there were a couple of nice photo moments, it was not where they take your picture once you first enter the cave :/ I enjoyed natural bridge caverns in Texas better but each cave is unique. It's good to go onto it once. I personally enjoyed sleucing for the gems the 30$ bag is the better option...we split it between 3 kids and got prettier gems compared to the emerald bag which was 13$.",
   "On December 21st, 2019, my mom got married in Bridal Cave. It was a gorgeous and unique wedding, and how often can you say that you attended a wedding in a cave? The staff there were super friendly and helpful, informative, professional, and the shop was a really cool place to buy jewelry and trinkets that will always remind us of that day. Not to mention how gorgeous the cave is.",
   "Bridal cave is an amazing attraction offering a neat tour experience and beautiful cave draperies.  There are a couple places that you have to be able to get through that are a bit tight, but overall it’s definitely worth it!  Also the scenic overlooks around the property are spectacular!",
   "Awesome, awesome tour. If you go, make sure you have Beth as your guide!! She makes this an awesome experience!!",
   "Such a beautiful place to go and see. You will learn so much information about the cave and cave systems in general. The store is full of great quality items and everything is reasonably priced as well. This is a place that everyone of all ages can enjoy and will always remember."
  ]
 },
 {
  "name": "Centennial Park",
  "address": "1400 E 16th St, Sedalia, MO 65301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3768e9f4-9331-11ea-943b-14b31f159f22.png",
  "tags": [
   "family",
   "pets",
   "walking",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3003840964766991346",
  "source": "GoogleMaps",
  "reviews": [
   "The park was clean, toys are in good shape. New construction was in progress.  Lots of benches for seating.  Nice shelter for picnics. Adequate parking. Busy day at the park, however it was not crowded. Pleasant park to visit with children of varying ages.",
   "First time to this pool in Sedalia. Enjoyed how much room there is for swimmers to swim interrupted. Could use some more shading and seating for guests. Thank you to the pool staff for making our day great! ✌😁",
   "Excellent family fun. Plenty of playgrounds, alot of open spaces and picnic tables.  Nice size pool with slides.",
   "Baseball, tee ball, and softball fields. basket ball court. Paved walking trails,  lot of grass and shade. Even a creek running through with their own covered bridge. plenty of play ground equipment, with the major bonus of being wheel chair or stroller accessible. Several bathrooms, drinking fountains, and many shelters. They also provide bags for little bins for those people who forget to bring along a sack to clean up after their pets. Every summer one of the biggest draws is the pool with the water slide, only maybe 5ft deep it's made for the smaller children/families the teens usually end up across town at liberty. They also have a lift to help people with disabilities in and out of the pool.",
   "This is the park I grew up going to. Glad to see the recent improvements to the lighting and shelters, but disappointed that the new shelters dont have charcoal grills like the old ones did. They were very handy for family events and birthday parties."
  ]
 },
 {
  "name": "Daum Museum of Contemporary Art",
  "address": "3201 W 16th St, Sedalia, MO 65301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/37efce26-9331-11ea-ac6f-14b31f159f22.png",
  "tags": [
   "art",
   "free",
   "art",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=16430040482261745988",
  "source": "GoogleMaps",
  "reviews": [
   "I was taking classes when the Daum Museum was added. All of my art classes were in the building they added it to. \nBeautiful museum and I try to visit when a new artist's work is on display.",
   "Free concert with the Kay Brothers full house",
   "Very interesting art. Not traditional but tastefully done.  Very relaxing experience.",
   "Always a beautiful display of art!!  I am so glad we have such an amazing place here in Sedalia ,MO",
   "Small, fantastic collection of modern art."
  ]
 },
 {
  "name": "Pikes Camp Access",
  "address": "Westphalia, MO 65085, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/383dc748-9331-11ea-9710-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=8478740970570437450",
  "source": "GoogleMaps",
  "reviews": [
   "It's a place my hubby and I go to build a fire, roast hotdogs and toast marshmallows. We enjoy the outdoors and being together. its peaceful and quiet AND NOT ONCE HAVE WE BEEN HARASSED! Its just a peaceful\nplace.",
   "One of the best boat ramps/camp site in these parts",
   "Nice peaceful place along the Osage River",
   "Great place to put in, yet the river is down this time of year. Don't expect to go more than a mile in either direction unless you have a jon boat or jet boat. Primitive camping about 6 spots.",
   "Excellent place for camping !"
  ]
 },
 {
  "name": "Lazer Force Lazer Tag",
  "address": "5473 Osage Beach Pkwy, Osage Beach, MO 65065, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/38a42a88-9331-11ea-9f3a-14b31f159f22.png",
  "tags": [
   "creative",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=12572091917855253816",
  "source": "GoogleMaps",
  "reviews": [
   "It's like we walked into the movie, Wreck It Ralph! Nostalgia and FUN for our whole family! Clean, helpful and lots of game options for many levels of skill or age!!! If you come for the laser tag, 20 minutes was plenty for our family! The laser tag arena is a really creative and thought out maze. We had a great time!",
   "I have loved this place for years. The arcade is great, the prizes are so cool and seem very well priced compared to other arcade places. The Lazer tag is the best part, every time I'm at the lake you will most definitely see me here. Great for large and small groups, even 1v1 matches. The vests at well taken care of and register hits very nicely. And the staff is so kind and helpful as well.",
   "Amazing place to go! Fun for everyone! Perfect for teen groups and perfect for parties!",
   "A lot of fun.. very reasonably priced, and a BIG play area (they have a very large downstairs game area.  Played with my kids here and we all had a blast!  They also have extremely detailed printouts at the end that tell you EVERYTHING about your game play.  Well worth the visit and will definitely come back again!",
   "Great place for young and older children. Friendly staff and lots of fun had."
  ]
 },
 {
  "name": "Genesis Laser & Vein",
  "address": "2511 W Edgewood Dr, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/38fa12fe-9331-11ea-897b-14b31f159f22.png",
  "tags": [
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=10290095096839670287",
  "source": "GoogleMaps",
  "reviews": [
   "I've been going here for over 2 years and have seen great improvement in my legs.  I don't have  the restlessness or cramping like  I  used to. My legs feel  and look better. Vein disease runs in my family so I'm doing what I need to do to keep my legs healthy.  I pay an insurance co-pay, but insurance pays for the treatments.",
   "Dr Prasad treated my veins and it was life changing. There was such a heavy feeling in my legs I had trouble doing everything.  I did whatever I could to avoid walking. Since treatment I have so much energy and I have my life back. I am catching up on all of the things I couldn’t do before. Thank you to Dr Prasad and your amazing staff!  Everyone is so thoughtful and friendly.",
   "I’ve had a wonderful experience with every appointment thus far! From consult to post op visits. Dr. Prasad does a great job of explaining procedures, before, during and what to expect after. Very thorough! Stephanie, took control of my most recent visit, and she did an amazing job! Thanks for always being helpful and enjoyable!",
   "Since beginning treatment at Genesis, my energy is improved, heaviness and pain have subsided, and I know Dr Prasad and staff will continue to monitor and tweak if necessarily",
   "The doctor and the staff at JCMG vein center is wonderful, competent and friendly.  I have been having my veins treated and I  wore shorts this year for the first time in 30 years.  They also removed an unsightly blue spot on my lip and various moles.  My daughter also had her veins treated and they look so much better.   I cant recommend them more highly.  The doctor is so nice and considerate.  And fresh coffee!  The know how to handle insurance issues, and medicare pays for most of the treatment."
  ]
 },
 {
  "name": "Boathenge",
  "address": "Columbia, MO 65203, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/39b3ed8c-9331-11ea-bfff-14b31f159f22.png",
  "tags": [
   "free",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=16214059082267286181",
  "source": "GoogleMaps",
  "reviews": [
   "A very interesting attraction,  I am still not sure if you are actually allowed on the property as the entrance is marked as private property. You can access it from the Katy Trail, which in itself worth visiting. A bit creepy, but I feel it added positively to the experience.",
   "If you are biking the Katy trail be sure to stop. Fun place to grab some pictures and enjoy the unusual display...",
   "Locals love this place.",
   "The drive in was rough gravel, and the boats are on private property so you can't get close to them without trespassing, but 10/10, best free doggo escort in the land.",
   "A pretty spot by the river, great for those who need to break up their road trip with a little walk. Plus there were good dogs."
  ]
 },
 {
  "name": "Woodridge Park",
  "address": "3532 Berrywood Dr, Columbia, MO 65201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3a265eb0-9331-11ea-a88d-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=3750169797453004536",
  "source": "GoogleMaps",
  "reviews": [
   "Such a neat park. The area is quiet, the playground is in great shape and there is a variety of things to play on. We really enjoyed the slide that has all the little rolling bars along with that round swing.",
   "I went with my grandkids. They started to play but, then came the rain. So, would like to go again when it is not raining.",
   "The new play area is really nice. It's in a great area; clean, safe and very close to the new Columbia trail system. My 6 yr old loves spending time there.",
   "Good park in Mountain View, Calfornia for children.",
   "Love this park. Its fenced in and is partly shaded"
  ]
 },
 {
  "name": "Ha Ha Tonka Castle Ruins",
  "address": "Natural Bridge Rd, Camdenton, MO 65020, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3a84d2b6-9331-11ea-9728-14b31f159f22.png",
  "tags": [
   "walking",
   "hike",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2440268505885249791",
  "source": "GoogleMaps",
  "reviews": [
   "The Castle ruins are easy to get to. Very limited parking. Wear good hiking shoes and bring a walking staff. There are hundred of steps to climb and it is a steep climb on the stairs. But a very beautiful place to visit.",
   "I love to go hiking and finally had the opportunity to explore this beautiful property. We went on one of the last warm days of the year so the trails were pretty busy but still a very pleasurable experience. The castle is immaculate and the remains are beautiful. This is a hike you could make last an hour or two and spend the night with their six mile trail with a campsite. Those steps are not for the weak. They were a challenge but worth every step. I will definitely be back soon to explore more!!",
   "Lot to enjoy..ruins of castle in good shape..then stone water tower  to photo...and can take the steps down hillside to enjoy the spring fed stream into lake. Great scenery pictures .",
   "Very cool history behind this place. \nWish you could enter the ruins, but I get it. \nGot to rule for the masses...\nOverlooking the head waters of the the Lake of the Ozarks, bunch of cool history, the man, the time it took to build. \nIf you are into geeking out on Americana, and who we once were? Must see.",
   "Super cool park with amazing views! You can't go in the ruins, but it's neat to see the castle. But what really makes this park amazing is their trails! Even the short ones are well worth the trip"
  ]
 },
 {
  "name": "The Peach Tree Farm",
  "address": "24863 MO-98, Boonville, MO 65233, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3aebf924-9331-11ea-9ae8-14b31f159f22.png",
  "tags": [
   "unique",
   "kids",
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5944512821047523599",
  "source": "GoogleMaps",
  "reviews": [
   "Loved our visit here. Very unique experience. Enjoyed picking pumpkins and gourds straight off the vine. They also have lots of different animals to see and some to pet. Prices are reasonable. I seriously wanted one of the really big pumpkins but settled for a picture instead. Great place to take kids. Worth the trip.",
   "Cute little maze and a hayride. Had some pumpkins to buy and some goats and a few other animals to feed. Not much else tho. But had some nice picture taking spots. No food or drinks sold there.",
   "We went to Peachtree farm house on weekend right before a week of Halloween. The farm was pretty small, it may be great for infants with parents but no-go for group of adults or friends together. The installations are small, very few animals, hay ride was kind of short and lame, may be better for kids. The maze was only for kids, they must expand the attractions and install attractions for adults and teenagers.",
   "Great place, good things to do..highly recommend..",
   "Pretty neat little place. Definitely worth the $6. Great for small children and enough things to keep the parents entertained for a while as well. Don't forget to save some of your feed for the goats in the back"
  ]
 },
 {
  "name": "Meramec Caverns",
  "address": "1135 Hwy W, Sullivan, MO 63080, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3b5542b4-9331-11ea-af97-14b31f159f22.png",
  "tags": [
   "unique",
   "family",
   "tour",
   "tour",
   "tour",
   "field",
   "tour",
   "food",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=8323867633937805622",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing tour, shop, set-up, caves, everything overall. The biggest perk is for those traveling with a furry, four legged family members. The have large, outdoor, dog kennels that you can use. You'll put a deposit down on a padlock with key, that you'll use to put your pooch in, while you're on the cave tour. Take a water bowl and water in case it's hot. The tour is unique and is both educational and entertaining. Highly recommend, you won't be disappointed!",
   "Awesome Tour with great tour guide. Beautiful gift shop. A lovely area to visit with many attractions for families. Would love to return in the summer! Thank you!",
   "Cool place!  Awesome views on the river. Nice gift shop! Zip line over the river, take a cave tour, canoe the river. On site camp grounds or a small hotel all in one location.",
   "Beautiful place to visit .it's a guide tour and if you go in big group like 15 people or above you will get some discounts tickets . Beautiful light and sound show and a mother in law's tongue 😜too. Fall they do science exhibits best for school field trips. If few places I felt it is good for Wedding photo shoots too. Other activities are there around this place. Camping area,boating,zipline etc. Restrooms are clean and beautiful staff is helpful. Food area is also available.",
   "Very beautiful cavern. Very pricey and tourist orientated. Tours were good and informative. Our tour guide Conner was very funny and nice."
  ]
 },
 {
  "name": "Prison Brews",
  "address": "305 Ash St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3bac3c6c-9331-11ea-8cd6-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4343021146384350681",
  "source": "GoogleMaps",
  "reviews": [
   "I really wanted to like this place. The atmosphere was great. Cool concept and cool building. The service was average at best. The food we had was below average. The drinks were good although. Seems to be parking on the street, fun place to come. Just hope for a better food and service experience next time!",
   "The beer was okay... we attempted to try new beer twice however we kept getting the same beer we previously ordered. The pizza could have been great however it was literally cheese with bbq sauce and barely any chicken. The onion rings were great and the atmosphere was cool. All together this place has potential but needs some work.",
   "Was anxious to try this place.  Have heard good things and tried to go a couple times before but it was too busy to get in.  Went today (Sunday) and got right in for lunch early (around 11am).  The place was not busy at all.  Drinks and food order right away and then we waited....around an hour and 15 minutes for sandwiches and fries.  I ordered a reuben and I attached a photo below.  Everything on the plate was cold.  There was one piece of corned beef on the sandwich.  Toward the side where it looks like more the one piece it was folded to fit on the sandwich.  Servers were completely unapologetic about the wait.  In fact I am not sure who our server was because it looked like they kept trading off.  All that being said we won't be back.",
   "Absolutely awesome meal!  We had the cheese and bread appetizer.  To be clear, it's cube cheese (pepper jack, cheddar and swiss).  It was so good, I took the leftovers home.  Additionally, we ordered the grilled chicken and bacon sandwich and ruben, both with fries.  We would order both again!  They even have great sweet tea!  I highly recommend visiting Prison Brews in Jeff City.  The only downside is parking, but I'm not taking away from the rating for something the business can't control.",
   "This was a very busy day for these guys but they hung in there and powered through. Great teamwork, great team outlook. Over alll it’s was awesome."
  ]
 },
 {
  "name": "Mecca Farm",
  "address": "Roach, MO 65787, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3c0ef634-9331-11ea-9b4e-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16154838666143954509",
  "source": "GoogleMaps",
  "reviews": [
   "We LOVE MECCA Pumpkin Patch! We go every year! Love the crafts u can make (Scarecrow & Fall signs) and their photo opp this year! There is something fun for every age and man or woman!",
   "What a fun day of activities. The weather was great. You have to go.Thanks Clay",
   "GREAT FAMILY FUN!!!!!  We all really enjoyed ourselves!  We will teturn!",
   "My family had a ton of fun there.Lots of thimgs to do for the kids. Not over priced like a lot of places like these. Clay, Melissa and their kids are super good people. This is a must see.",
   "Kids really have a good time. There is stuff for the grownups to do also."
  ]
 },
 {
  "name": "Central Dairy",
  "address": "610 Madison St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3c71d72c-9331-11ea-a546-14b31f159f22.png",
  "tags": [
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=13213814130550311336",
  "source": "GoogleMaps",
  "reviews": [
   "Came here with my troop after visiting the capital building. Everybody enjoyed the ice cream and everyone had a great time. It was a little slow but probaly because we had a lot of people go there. The ice cream is good for the price. They have a large selection of flavors. Would recommend.",
   "Smooth running machine with the crowd. Ice cream is well worth the wait. Friendly service!",
   "Always good and so very many flavors it's hard to choose! Central Dairy ice cream parlor has been in town for as long as I can remember. They are practically a historical establishment. Friendly employees, Booth type seating with some benches outside, and an available bathroom. It is a local favorite and many people come for miles to visit, so be prepared to wait in line during their busy times.",
   "Love this ice cream shop. Best tasting ice cream ever. Get there early for the best variety of selections!",
   "Always packed every time we visit but the employees move the line fast. Husband and I got one \"scoop\" in a dish each at $2 a scoop. I got Extreme Extreme Moose Tracks, him Tiger Tracks. It's always so good and made in house. They prefer cash, so bring it if you can. Keeps their costs and prices low by avoiding card fees."
  ]
 },
 {
  "name": "Big Joel's Safari Petting Zoo & Educational Park",
  "address": "13187 State Hwy M, Wright City, MO 63390, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3cc3a0ac-9331-11ea-b7eb-14b31f159f22.png",
  "tags": [
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=5924319651355743479",
  "source": "GoogleMaps",
  "reviews": [
   "This is such a fun place. My 2 1/2 year daughter and my 6 year old niece both love this place! They have a lot of different animals and the kids think it’s really cool to feed them. There is a cool little playground area in the middle of the park. Staff was very polite, prices reasonable. Park and the restrooms were both very nice and clean. It’s perfect size for younger kids that can’t run around the bigger zoos all day. Always a good time and worth the drive to check it out!",
   "Their petting zoo was at St. Louis Six Flags for Christmas in the Park. This was hands down one of the best petting zoos I have seen. The animals were clean, healthy, docile and happy! They are well taken care of and would recommend then in a heartbeat.",
   "So much fun! I loved seeing the animals in just some dude's backyard. It made it more special because you know he must REALLY love those animals! Also, it's super fun to feed the animals. Let's not forget that even the fancy St. Louis zoo could not keep their bird feeding aviary open for more than a couple months!",
   "Kiddo loves it and prices are super reasonable. Staff is engaged and friendly. Wish it was closer to home but not their problem lol.",
   "I love the close encounters wt the animals my 9 yr old and my husband and myself had a blast feeding them a fun lil family rd trip"
  ]
 },
 {
  "name": "St. James Winery",
  "address": "540 State Rte B, St James, MO 65559, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3d35758a-9331-11ea-95e3-14b31f159f22.png",
  "tags": [
   "winery",
   "knowledgeable",
   "winery",
   "tour",
   "history",
   "tasting",
   "tasting",
   "art"
  ],
  "link": "https://maps.google.com/?cid=7583960572543022735",
  "source": "GoogleMaps",
  "reviews": [
   "They have a great selection of Missouri wines and the process are very reasonable. The people are very knowledgeable and can help you find a wine that you would like. They also will let you sample their wines so you can make sure you like what you are planning on purchasing. They offer 28 different varieties on an everyday basis and then they also have seasonal wines that they offer on a limited basis. They also offer tours of the winery as well, which is informative and a fun experience. It is worth the trip and I look forward to coming back for their seasonal offerings. \n\nAlso, they have a wine club that is only quarterly and had a good discount on other purchases as well. You don't have to come to join, you can sign up online, but I recommend coming for the experience and to taste their selection.",
   "Had a wonderful time at the Winery today. I wanted to take my wife here for date night & it did not disappoint. When we first arrived, we were nicely greeted by Sherry. I asked about the tour & Sherry said that she was available to take us on it. She did a great job explaining the history of the winery & their wines. After we were done with the tour, Sherry served as our server and provided us with some great samples that we chose. By the end of the night, we ended up buying 7 bottles & we couldn't be happier. Thank you Sherry for being such a great host. We will definitely come back to the winery when we need more wine.",
   "Always a great stopping place to enjoy wine while on route to Joplin or to St Louis. Lovely store and wine tasting station. Restful and enjoyable...try it!",
   "Beautiful and professional atmosphere with a friendly staff ready to help. Wine tasting before you buy. Lots of other homemade and local products to buy.",
   "To me St. James makes the best wines anywhere. I love a sweet wine and they have it perfected. We lived in California were I found it very difficult to find a sweet wine anywhere.  We also lived in Virginia were they make some pretty good sweet wines. St. James has mastered the art of sweet wine making. I also suggest joining their wine club to get great discounts on wine shipped directly to my home."
  ]
 },
 {
  "name": "Jolly Mon Indoor Water Park",
  "address": "480 Tan Tara Estate, Osage Beach, MO 65065, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3d9a522c-9331-11ea-b7c5-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=8800555022919635673",
  "source": "GoogleMaps",
  "reviews": [
   "Best inside water park! Has everything you dreamed of! Not expensive either!",
   "This place was fun! BUT so overpriced! For 4 people not staying in a hotel it costs 100 dollars. There was a hot tub, play thing for the kids, a small lazy river, 2 slides, a concession stand, and a VERY small pool with some baskets. I just feel like there needs to be more things to do. Maybe some more slides, baby pool for the toddlers, floaty rental, etc. I just wish I could have had more fun there. But some positivity in the review, the 2 water slides were very fun. 1 body slide and 1 raft slide. And another thing... if you want to watch your child and not swim or participate, you have to pay $5! Very disappointed with the results of today but, I gave 2 stars because of the slides and a few fun times and memories I had at the beginning.",
   "Loved this place",
   "$17 for hotel guests to swim, $5 for observers.  Cafe on site.  No lifeguards on duty for the lazy river which gets kind of chaotic with people jumping and running in the river area.   Water slides are great.",
   "My grown daughter fell the second day we were there, the area where she fell was terrible slick.  I told the manager, who wasn't old enough to manage that responsibility she had fallen.  He never asked if she needed medical care or that he was even concerned that she fell!  The fall broke both knees open, no bandaids were offered, she could no longer swim due to an open wound.  The Kid Manager didn't care!  We won't be back!"
  ]
 },
 {
  "name": "Meramec State Park",
  "address": "115 Meramec Park Drive, Sullivan, MO 63080, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3df51c9a-9331-11ea-9440-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=9870860993783713905",
  "source": "GoogleMaps",
  "reviews": [
   "Another treasure in Missouri.\nThis park offers canoeing, caving, hiking and camping.\nThe cabins looked nice and cozy.\nThere are plenty of picnic areas, as well.\nYou will not be disappointed.",
   "We were just about the only ones staying in the cabin area of the park.  So quiet and peaceful. Very relaxing.  Excellent hiking trails. Cabin was great.  Even got to keep our dog in the cabin. Ready to go back again.",
   "Beautiful state park! There was more to do than what locals made it seem to be. Most of the caves are closed to help support the local bat population. The rest are only open for March to October, which was kind of crummy since it was such a beautiful November weekend.",
   "So open and beautiful! The river was right there so lots of river fun. The deer could care less that you are there so animal watching was amazing. I'm glad my friend and I went in the middle of the week because i can see it getting crowded on weekends",
   "Canoe trip 5 miles down the Meramec river. Wonder filles day. Has the best time,  hadn't floated in over 40 years!"
  ]
 },
 {
  "name": "TitleMax Title Secured Loans",
  "address": "1001 Missouri Blvd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3e4eb9b4-9331-11ea-b93d-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=7198172855664872175",
  "source": "GoogleMaps",
  "reviews": [
   "DO NOT UNDER ANY CIRCUMSTANCES USE TITLE MAX. If you get behind in your payments they WILL TAKE YOUR CAR. I was in constant contact with them and had a date set to get my account current. I was finally getting caught up. The night before the date we had agreed on they took my car. I contacted them the next to to get my car and they wanted double what I owed to get my car back. I was $280 behind and they wanted an additional $400 for an unnecessary tow. I had been in their office 3 days before to verify the day I was coming in to get caught up and to offer to leave the car there if neccessary. The company that took my car will not respond to my messages and will not return my personal property. Including my house key, my work keys, my license plates and a bunch of personal papers including my bank info and birth certificate. They prey on the desperate and will not work with you if you get behind.",
   "Hey I Just Got My Title Handled Perfect By The Best New Employer Richard. Thank You So Much For Being A First Timer You Where Awesome. Hope To Do Buisness With You In The Future",
   "Did a great job! Explained everything good!",
   "TitleMax on Missouri Blvd in Jefferson City MO is GREAT!!!! They only have one major issue......they go through too many store managers!!!! Mari is the bomb!!! Amazing customer service the best best personality EVER why are they not promoting her?????? She has been for for the 3 years I’ve been going!!! She’s obviously staying unlike the rest!!! Come Titlemax get it together it’s frustating sitting there watching your new managers constantly struggle and Mari always having to help her “superiors” because they don’t have a clue!!! Promote her already!!!!! Love you Mari!!!!",
   "Jay was great. Helped me out when needed. Highly recommended. Go see him."
  ]
 },
 {
  "name": "Big Surf Waterpark",
  "address": "954 State Highway Y, Linn Creek, MO 65052, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3e9e6080-9331-11ea-8f36-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food",
   "parks",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3070415415612634537",
  "source": "GoogleMaps",
  "reviews": [
   "Fun water park, decent concessions. The staff was friendly and safe. The children’s pool and activities are amazing, kids are sure to have a blast. Even a few good water slides for the adults to have some fun in the sun.",
   "We love this place. I have literally been taking my sons here for 20+ years. They keep it looking fresh.",
   "A small but well run water park, Big Surf continues to have one of the best wave pools within two hours of central Missouri. Though it's rides tend to be a little more relaxed / smaller than the larger parks, the lines tend to be shorter and go quickly, the food options are good for a small park, and the food prices tend to be a bit more reasonable. \nThere are five main slides, with one being fairly intense / a sharp drop at the beginning, ranging to more mild slides (not including a lazy river). Three of the main slides don't need a tube and three do. \nThe Space Bowl is probably the best non-inner tube ride, though it's easy to get stuck at the beginning due to the initial lack of incline. The last drop / space bowl portion is the fun part.\nThe cliff-like tube ride (I forgot the formal name, some call it \"the banana\") is definitely the most intense ride in the park, with a steep drop of about three stories.\nWorth making a day out of with friends, family, or a youth group. Been twice. Good experience both times now.",
   "Overall, the park was great. The kids had fun. Cabanas are nice but don't offer any real privacy.  Food was overpriced and mediocre, but honestly, the kids loved it.  I just wish there was a few adult options.  \n\nPark and water was clean. Staff were super courteous and helpful.  Going back in a few weeks. Totally a hit.",
   "Always a pleasure to visit. This is the only water park that has staff to enforce the rules, which make it a pleasure to visit each year."
  ]
 },
 {
  "name": "Six Flags St. Louis",
  "address": "4900 Six Flags Rd, Eureka, MO 63025, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3ee9255c-9331-11ea-99c4-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "walk",
   "eat",
   "food",
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=5151260256273025059",
  "source": "GoogleMaps",
  "reviews": [
   "First time going here and had a pretty fun experience. Hall of Justice is such a well done ride and my friends and I had so much fun. Pandemonium was a great ride, along with Mine Train. The ice cream is severed in such big portions that my friend and I had to share. Great place to hang out!",
   "I just stayed at the hotel and I was amazing. the only reason I give it 4 stars is on the toilet there were pee stances on the part for sitting. and I think that the bathroom of a hotel is what needs to be the cleanest. Just my opinion.",
   "Amazing fun for anyone. Great food galore, but can be fairly pricey if you don't have a dining pass. Kind employees, as well as many very charming ones who play characters in events. Many shops filled with touristy things from snow globes to postcards. All rides are extremely fun, but lines can be extremely long depending on what day you come, with Saturdays being extreme in warmer weather. If you come during the summer, the water park is also extremely fun with really fun rides. Tickets aren't too cheap, but you can buy a season pass for not too much more than a ticket. If you plan on going more than twice a year, you should buy a season pass or membership; otherwise, you're good to just go for a ticket. Along with the season pass, the dining pass is a must have. The website goes into better details on the different versions.",
   "This is a very nice facility.  Most of the staff is friendly, and there are a wide variety of things to do around the park.  I just wish there was more shade for when there was hot days but it's not a big concern considering you can just walk in to many of the different places that you can eat.  Speaking of the eateries the food is good everywhere that I have went to eat.  Overall, it is always a fun experience.",
   "Great park. Good rides. Water park is decent. The workers are very friendly every time I visit. Memberships are cheap with great benefits. Season passes can be very cheap when you catch a sale."
  ]
 },
 {
  "name": "Gracie Barra Jefferson City Brazilian Jiu Jitsu & Self Defense",
  "address": "1850 State Hwy C Suite A, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3f4c546c-9331-11ea-98f0-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "free",
   "art",
   "family",
   "family",
   "family",
   "learn",
   "family"
  ],
  "link": "https://maps.google.com/?cid=5940539047267153306",
  "source": "GoogleMaps",
  "reviews": [
   "I've been training at Gracie Barra in O'Fallon, Missouri for over a year now and decided to drop in unannounced to the Jefferson City location. So my review is based on my experience for the one class. There were about 10 people total including myself that showed up for the noon class. So it wasn't overly crowded and i was welcomed right away by all the students. Everyone i met treated me like family! I was really impressed with Coach Kirsten and how detail oriented her instruction was.. She really knows her Jiu Jitsu! The gym itself has a nice lay out, none of the equipment was torn up, the mats felt brand new! A very clean facility and very professional! I plan to train here again, next time I'm in the area!",
   "Gracie Barra Jefferson City is the place to go if you’re looking for a family friendly environment and high level BJJ instructors. Drop by for a free trial class and I’m sure you will fall in love for the gentle art. Amazing self defense program for women’s and anti-bullying for kids.",
   "As a former wrestler from MANY years ago, I’ve missed the brotherhood and family of working hard together to get better on and off the mats. This place more than fills that void. This is my home away from home, and these people are my family.",
   "This has quickly become a very special place to our family. The staff is absolutely phenomenal! Each class is engaging and has value. If you're on the fence about doing it or having a child try it, give it a shot! You owe yourself the opportunity to experience how professional and great this place is!!!",
   "Best school I've ever been at! Great family atmosphere. Awesome coaches and training partners. Get in shape and learn valuable skills all while having fun."
  ]
 },
 {
  "name": "Stone Hill Winery",
  "address": "1110 Stone Hill Hwy, Hermann, MO 65041, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3faff866-9331-11ea-ae63-14b31f159f22.png",
  "tags": [
   "winery",
   "sampling",
   "unique",
   "food",
   "historic",
   "tasting",
   "history",
   "free",
   "winery",
   "drink",
   "tour",
   "tour",
   "tasting",
   "knowledgeable",
   "historic",
   "tasting",
   "winery",
   "tour",
   "tour",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=13155920076958588634",
  "source": "GoogleMaps",
  "reviews": [
   "There are many beautiful views from this winery. It has a charming atmosphere. The store is full of great gift ideas and fun favorites for wine lovers. You can purchase any of their wines from the store as well. We had fun sampling all of the wines from a list and discovered some new favorites! The cellar tours and samples do have a cut off time, so plan accordingly. You can dine here and listen to live entertainment.",
   "I don't drink wine but I brought my husband here for some wine tasting and dinner. He loved the wines so much that we brought home 6 bottles! We took the free tour through the cellars and it was very interesting and informative. Jani (I hope I got that right) was our guide and I really enjoyed the history she shared with us, it was the best wine tour we have ever had. The cellars were amazing! Then we went into the barn for dinner and it did NOT disappoint! You can sit in a horse stall and order authentic German food here. The staff were friendly and kept our glasses full. The food came out pretty quickly and tasted great! We have lived in 8 states, been to 48 states, and visited several wineries. This by far was the most unique, beautiful, and historic winery so far. Everything was excellent and we absolutely loved our afternoon spent here. Will definitely be back for sure!",
   "Tour was great, but after a long weekend already I opted out of the wine tasting. I look forward to it next time. However I did hear a lot of praise for the wine from other visitors. Hope to make a trip back very soon!",
   "Stone Hill Winery and Vintage Restaurant sits atop a hill overlooking the historic town of Hermann, MO. Of all the wineries in Hermann, Stone Hill offers the most inspiring views. Take the tour and see the caverns built generations ago where barrels of wine are aged. The staff is very friendly and knowledgeable and will proudly talk about the awards taken by Stone Hill’s wines at state and national competitions. We bought a bottle of 2013 Norton and enjoyed it outside at one of the many picnic tables around the grounds. There are two large tasting rooms, and despite two tour buses full of visitors on hand, we were able to belly up for a tasting without waiting. There is a restaurant on site but we did not try it. You can definitely plan to spend a whole afternoon or evening here.",
   "This place is a must see in Hermann! The tour is excellent and the tasting rooms were very quaint. The wines are really good! Selection is excellent. Property and view is amazing"
  ]
 },
 {
  "name": "The Grand Cafe",
  "address": "107 E High St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4003e50c-9331-11ea-8951-14b31f159f22.png",
  "tags": [
   "delicious",
   "learn",
   "delicious",
   "unique",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15384230133366283465",
  "source": "GoogleMaps",
  "reviews": [
   "The Grand Cafe is a eclectic place for casual dining in the heart of the Capitol City, Jefferson City, Missouri.  The menu offered a good array of options from which to choose.  I ordered the BLT Wrap with the House Fries.  My partner ordered the Cubano Panini with the House Fries.  Both of us felt the fries were okay, but not warm enough to taste and lacked a crispness and saltiness one might expect of a higher quality French Fry.   The service was exceptionally good, and yet we did not learn the Server’s name until we saw it on the check.\n\nI ordered the Gooey Butter Chocolate Brownie with a side scoop of vanilla ice cream.  It was not only beautifully plated and presented, but delicious AND expensive.  Be certain you inquire about the prices of desserts BEFORE you order as mine was as much as what I ordered for lunch.   It was ample, but not of such quality that warranted the price.  \n\nOverall, this is a good, casual dining location in the State Capitol.  Seating was comfortable, and the dining area clean.   They may want to consider refinishing the metal ceiling as while it is distressed painting, it may appear to some dining customers to be peeling paint.\n\nParking on Saturday was not bad, but go early.",
   "ENJOY\nWe came in and were greeted immediately. I love that everyone is pleasant and happy we are here. Smiles are nice. This is an upscale dining experience for sure. Prices are a little extravagant but you're also paying for class an ambience as well. Every once in a while we deserve to splurge. \nWe had the Cobb salad and the southwest panini w/chips\nThey were very delicious! \nOur service was excellent!\nI would definitely return",
   "One of the top restaurants in Jefferson City, this is the place to go if you have visitors to impress. Great location in the heart of downtown. They have unique dining options and a great cozy atmosphere. Full service bar and outdoor dining is also offered. Highly recommended!",
   "The Grand was probably our first love in Jeff City! From business meetings to date nights, we usually will always end up at the Grand for some portion of the night. The specials are always extra delicious and the jalapeño margarita from Kevin is a must try. \n\n",
   "Food is delicious. Craft cocktails. Service wasn't bad but not the best I've ever had. Otherwise, would've given 5 stars. Iced coffee cocktail pictured. Highly recommend beet salad. Cuban panini was really good."
  ]
 },
 {
  "name": "Madison's Cafe",
  "address": "216 Madison St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4071e94a-9331-11ea-98af-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "eat",
   "family",
   "eat",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2533057496267100085",
  "source": "GoogleMaps",
  "reviews": [
   "The best restaurant I’ve ever eaten that was right here. The food is so delicious and it doesn’t matter what you order because everything is made so freshly some from scratch and it’s just an amazing place to go. The staff members that work there are so nice and polite and kind and you can actually have a real conversation with them. To me Madison‘s is a more family bond restaurant. Some of staff that works there has worked there for years even some of them have been there for decades. Madison Cafe is a miniature Raniand Italian restaurant and it’s the best one in town. So if you’ve never been there I would highly recommend you going there and I guarantee you once you’ve been there you will definitely become a regular customer.\n I personally love the fettuccine Alfredo with angel hair pasta that I actually Request them to make it that way for me and they do and it’s no problem no extra charge.. \nI would highly recommend this restaurant to everyone!!!! Believe me it’s worth it!!!!\nIf you want to go out for a romantic night go there.\nIf you just want to go out and have a few drinks and some appetizers with girlfriends or work buddies are just friends go there.\nNo matter what just go there you’re gonna love it as much as I do❤️",
   "Authentic. Upscale but won't break the bank either.  I recommend making a reservation if you plan to eat after 6 pm.",
   "Italian-themed restaurant in downtown Jefferson City offers various meat and pasta dishes, as well as fish-based & some vegetarian options. Service was excellent! The atmosphere was warm & friendly. Food was pretty good, although I thought some of it was a bit salty. (Then again, I don't consume a lot of salt.) Lots of street parking, easy to find. The restaurant space is accessible for most folks, though the front door looks a bit tricky. Family friendly. The bread baskets = carb crack, and arguably the best thing I consumed. I dipped mine in the parmesan garlic olive oil side. I would definitely eat there again.\n\nAdditionally: I was there for a work event. It's a great venue for working dinners & group presentations.",
   "She put a group of 4 on the list before is and we were there first. Then they seated them and another group of 4 that came in after them we were still waiting the NBA couple cam they were put on the list and you guessed it WE WERE STILL NOT SEATED AFTER 20 MIN AND BEFORE WE WE BY PASSED FOR A FOURTH TIME WE\n LEFT.  I SURE HOPE ROB READS THIS.they dint deserve even 1 star after the way we were treated tonight VELMA",
   "I tell all my friends and family who live in other states and come to visit me here in Jefferson City that Madison’s is a Jefferson City tradition. The attentive and hard working staff help to accentuate the delicious food. \n\nFrom the delicious salads and Appetizers to the succulent and romantic Châteaubriand for two. The food here is a conversation that will be had by families for years to come."
  ]
 },
 {
  "name": "Sweet Smoke BBQ",
  "address": "127 E High St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/40c5c2e2-9331-11ea-867b-14b31f159f22.png",
  "tags": [
   "delicious",
   "kids",
   "eat",
   "food",
   "food",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=5385961297437890433",
  "source": "GoogleMaps",
  "reviews": [
   "We LOVE Sweet Smoke and always have a hard time deciding what to order, even our kids eat their whole tray. It’s amazing how quickly you can order and receive your super fresh food even over their very busy lunch hours. So delicious!\n\n",
   "Decent barbecue and friendly staff. The parking was nice (mall parking lot).  The restaurant was clean with plenty of seating.  The price was fair for the amount of food you get.  Overall I would recommend this place to anyone wanting good bbq",
   "For a local barbecue place it was pretty good. The staff was friendly and plenty of parking by the mall.  Once we ordered the food came out in about 10 minutes.  Overall the food was good and not overly smoked. The sweet KC barbecue sauce was pretty legit. My overall experience was pretty good and I would recommend anyone to visit",
   "What a gem! Our first time was great.\nOld fashioned stand in line and staff brings it to your table. Clean, big portions, a sauce for all tastes, Family friendly AND... What a welcome surprise...a pretty comprehensive bar.\nWe'll go again.\nThey've got it right!!!",
   "Absolutely excellent. The burnt ends (at lunch, usually gone by not long after 11:30am) and the slop sandwich definitely rise to the top for me. My wife loves the pulled pork nachos. Top side is definitely the pit beans. A must try. A note on the jalapeno cheese grits, these are usually a favorite for me at most places that have them. Here, I found them to be too liquidy, and not quite what I wanted on the flavor profile either, but still fine. \n\nAll around, this is in my top 10 all-time BBQ places for sure. Maybe not top 5, but definitely top 10. Absolutely the best anywhere between KC and STL for sure. Always worth a stop. Great beers on tap too, and a cool atmosphere. Plus, and this is important on workday lunches, they are quick! Very fantastic, keep up the great work, y'all!"
  ]
 },
 {
  "name": "Arris' Pizza",
  "address": "117 W High St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/41287c94-9331-11ea-8f2b-14b31f159f22.png",
  "tags": [
   "eat",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8441968291005463670",
  "source": "GoogleMaps",
  "reviews": [
   "Great restaurant with awesome pizza and gyros! It's our favorite place to stop when we go through Jefferson City. They've got some Greek decor and murals that are neat. The salad bar is very good with some great choices on it. Staff was attentive and helpful.",
   "Very informal restaurant right across from the State Capitol. Very convenient for us after touring Jefferson City, but I I wouldn't go out of my way to eat there. It has Greek-style salads and sandwiches; pizza and pasta. I had the Greek salad, which was very good. My wife had pizza, which was OK, not great; it lacked enough sauce and the thin crust was tough.",
   "Second time I've eaten here. Pizza is very good. Nice atmosphere. Feels like a family diner. This time I had the meatball sandwich along with the salad bar. Also very good. If I had any negatives it would be the salad bar shuts down a little early. There is a small bar off to the side of the dining room which is also kind of small. I can see where this place could get crowded. A Greek flair with a menu that offers something for everyone.",
   "Wow. I needed a nice place like this. Great food. Literally such a wonderful crispy pizza. I got the gyro meat on it which was a nice touch.",
   "Gyros, pizza and all were awesome!! We got seated right away and wait staff was nice. I even bought something for my mom who is not fond of gyros but she liked it! Think I'll be bringing her there someday!"
  ]
 },
 {
  "name": "West Main Pizza",
  "address": "1931 W Main St, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/41825cc6-9331-11ea-ae51-14b31f159f22.png",
  "tags": [
   "free",
   "drink",
   "cheap",
   "food",
   "music",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3099909382058914537",
  "source": "GoogleMaps",
  "reviews": [
   "*Friends with gluten intolerance* you can have the cauliflower crust pizza, gluten free cheesey bread sticks and even a gluten free dessert pizza! This place is great. Very casual with a small bar in the back.",
   "I enjoyed the pepperoni and banana pepper pizza I had here.  The crust had a nice crispiness, and the toppings were good.  Order at the counter, and the staff brings the pizza to you when it's ready.  I sat in the bar section; while I had iced tea, it looked like a good place to have a drink. I would go back when in Jefferson City and in the mood for pizza.",
   "Great pizza every visit. Price is well within range, of not cheap, for the quality of food. Often live music entertainment. Full bar, great salads, breadsticks, pizza!",
   "Loved it. Delicious food. Best sub sandwich I've found. Great service.",
   "Great food and very nice place. We are from out of town and just happen across the place glad we did too."
  ]
 },
 {
  "name": "Towne Grill",
  "address": "315 Jefferson St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/41cfbbb6-9331-11ea-8815-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6714957628106248801",
  "source": "GoogleMaps",
  "reviews": [
   "Great breakfast! It’s a little place and they are busy! Worth the wait if you have to wait for a table to open up. Food is great, portions are huge. Get a cinnamon roll before they sell out! If you like philly cheese steaks, you have to get their omelet. It’s sooo good!",
   "Nice little town restaurant. I love the look of this place. Good food, good prices and nice waitresses.",
   "Everything I get is always good, it’s always clean there. And they have a nice staff.",
   "Gloria and Jason our server was fabulous! We always go here for a good deal and great food! I was especially happy to bring team Rubicon for breakfast! Thank you Gloria!",
   "This place is great. It's one of Jefferson City's best. Do yourself a favor and get breakfast here or stop in for lunch."
  ]
 },
 {
  "name": "Ecco Lounge",
  "address": "703 Jefferson St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4233d506-9331-11ea-a27f-14b31f159f22.png",
  "tags": [
   "food",
   "kids",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2430906710373486607",
  "source": "GoogleMaps",
  "reviews": [
   "Small place, great food! Several things are homemade, not just frozen off a truck. Service was quick and friendly. I had the pork tenderloin sandwich and it was very good! Definitely go for the waffle fries. If we are ever back in the area, we will return!",
   "We did a huge pick up order. All items were correct except for one set of salad dressing. \n\nOh my goodness! The best burger I have had in a very long time. Burger was juicy, perfectly seasoned, lots of mushroom and Swiss. My siblings were all pretty happy with their food, as well. My daughter.did not like her kids burger. We tried it after she refused to eat it. Very bland, absolutely no seasoning, and I couldn't blame her for no wanting to eat it. \n\nOverall, will definitely be back the next time we are in Jeff City. We might request some seasoning for the kids burger, though!",
   "Every thing is fresh and cooked from scratch. You can taste the difference. Bar food yes, but like you have never had before!!",
   "Very nice environment. Friendly staff and good beers on tap. I was not very thrilled with my food though. Potatoes were overcooked and my chicken was bland, but maybe I was there on a bad night. Presentation was also great.",
   "If your wait staff suggests just a  1/2 orders of onion rings pay attention. Large portions,  and tasty."
  ]
 },
 {
  "name": "Domenico's Italian Restaurant",
  "address": "3702 W Truman Blvd # 225, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/428e2a34-9331-11ea-85c6-14b31f159f22.png",
  "tags": [
   "walk",
   "drink",
   "family",
   "food",
   "food",
   "food",
   "tasting",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4082280602455807896",
  "source": "GoogleMaps",
  "reviews": [
   "I've lived in the Jefferson City area most of my adult life, now. I have made it my home. Even so, I've only eaten at Domenico's twice. It isn't a formal experience, but it feels like it should be.  \nThe food is just that good!\nWhen you first walk in, you're in a very relaxed room. There's a bar, with a TV at each end, but last night the bartender's family was there for dinner,   and he's got the cutest little two year old!\nMy friend ordered the cheese tortellini with vegetables, I ordered the chicken Alexander, and we ordered baked goat cheese for an appetizer. We both stuck with water to drink.\nI have NEVER had bad food from Domenico's. My chicken Alexander was a breast piece perfectly cooked, served in a creamy white wine sauce, and under broccoli, mushrooms, onions, and peppers. The baked goat cheese was served with crisp, crusty bread. It was baked in a bowl of marinara sauce. \nLike I said, I have NEVER had bad food food from Domenico's Italian Restaurant.",
   "Really enjoyed this location. The food was excellent. WHERE'S THE OPTION FOR A 6TH STAR? Anyway. Very prompt, courteous and respectful staff. Glad we saw this restaurant. I would recommend  this location for a more enjoyable dining experience. Your restaurant has a great vibe and format. Keep up the good work!!",
   "We were in area for conference..Excellent food we ordered oysters baked crab cakes steak veal. It was excellent. Best food in Jeff city huge menu..we came from Kansas City will make trip for dinner with group...can’t wait to return.. !!!! Must try. R from KC",
   "The first thing I noticed was the restaurant was hard to see from the main road. It was situated at the back of a retail strip mall. The set-up was nice. The restroom was magnificent. It was extremely clean and it smelled wonderful. The entire front of the restaurant was clean!\n\nI ordered seafood ravioli. It was warm, rich, and exquisite. I also had a side order of vegetables. They were seasoned, crisp, and succulent. My colleague had the King Crab and she truly enjoyed it. My only concern was our server. She could have been more attentive .",
   "Food, service, atmosphere, mostly top-notch! We had a positive experience and I would definitely eat here again. It was a little pricey and the side of broccoli I had was a little off tasting, but that could have totally been a fluke. If you are in town or nearby I recommend making a stop and trying the place out for yourself. Next time I pay a visit I’ll try a few other menu items and see if I need to award that fifth star. Lastly, the drinks we ordered were pretty strong so that was another plus."
  ]
 },
 {
  "name": "Das Stein Haus",
  "address": "1436 Southridge Dr, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/42e2a25c-9331-11ea-bd8c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=486778597035437246",
  "source": "GoogleMaps",
  "reviews": [
   "Great local restaurant. Can be cozy or crazy. Tonight was great, not hurried, food was perfect.  And bananas fosters for a great finish to the evening",
   "From the moment  you come to that restaurant  the personel give you a good feeling. Very comfortable team, it is a friendly place to hang out with buddies or with your date. enjoyable  food, qualified  chef, decent  price and generous  service. Warmly recommended.",
   "This is amazing, homemade food! The potatoes tasted just like my grandma's. It choked me up a little bit. You don't find food this good anywhere, anymore.",
   "Had dinner there Christmas Eve with my family. It is a small and privately owned establishment. Food and service were excellent. However, I did notice the ladies bathroom is in need of renovation. The bathroom functioned fine, just needs some new wallpaper or paint.",
   "A very pleasant place to have a date night.\n\nMy favorite thing about this restaurant is its vintage authenticity.  It just feels like the kind of place that's been around for decades and the food improves with each decade.\n\nThis is the most authentic German food in the area and maybe even more so than places in Hermann, MO.  It's about the experience and the owner/cook makes sure of that from beginning of meal to end.\n\nMy wife and I have enjoyed everything we've tried here so far.\n\nMust try desserts are the Bananas Foster and the Cherry Jubilee."
  ]
 },
 {
  "name": "Hunan Restaurant",
  "address": "1416 Missouri Blvd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/434bdd08-9331-11ea-8b12-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=405898120982384037",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious food and service. Quite popular, so you may have to wait. Totally worth it!",
   "Great lunch menu and prices. Food is always very good and super fresh.",
   "I actually like their dishes and customer service, excellent area next to my house. The employees are always super friendly. I highly recommend this place.",
   "Good food, service, and prices. Quaint establishment with a charming Oriental theme.",
   "I dine on Chinese dishes most of my life and have learned to cook many Chinese dishes as well.  The soups here are terribly disappointing and ridiculously priced for less than a cup.  Menu said $1.75 but got charged for $2.50.  I guess that's very telling already for the rest of the pricing reviews too.  Sizzling beef was good though, and served with scallions.  Im also glad they served free hot tea as this is a true Chinese restaurant tradition."
  ]
 },
 {
  "name": "Colton's Steak House & Grill",
  "address": "2415 Missouri Blvd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/43b95a5c-9331-11ea-8feb-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14123583887108766799",
  "source": "GoogleMaps",
  "reviews": [
   "The trail potatoes. Potato skins are my favorite. I ask for too many sauces but they are always happy to get whatever I need. Prices are great. Drinks are great. Staff is great, always have a positive smile when when their really busy..",
   "Great restaurant! Excellent service, a very pleasant waitress, delicious food. Loved it!",
   "This place is always packed, but it moves fast, so not a lot of waiting. We ate at the bar our last go, and the bar tender (forgot his name) was awesome as a server!  He took all 4 of our orders and one with special instructions- without writing it down, and nailed it! Food was good as usual. Watched a couple different games on the TVs but usually sit in a booth which are comfortable.",
   "Omg, if we could give 10 stars we would!! On our date night, tonight Friday March 8, 2019 & our server Brandy rocks!! She did her thing... she was very very polite, observant, very respectful, got our meals right & out in excellent timing. She spoke clear, great attitude & with a smile!!  WE WILL BE BACK AGAIN!!!! 🤗🤗🤗🤗🤗\n🌟🌟🌟🌟🌟🌟🌟🌟 🌟🌟❤❤❤❤❤",
   "Food was fantastic, steak was cooked great, wait staff was very attentive. The manager even came over and talked to us. Very Very great"
  ]
 },
 {
  "name": "Bandana's Bar-B-Q and Catering",
  "address": "2336 Missouri Blvd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4413035c-9331-11ea-9e5b-14b31f159f22.png",
  "tags": [
   "kids",
   "tasting",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11418246054540140466",
  "source": "GoogleMaps",
  "reviews": [
   "Always great service! Great price on kids meals and they tend to get about as much food as an adult plate so there’s always leftovers for the next day’s lunch. Great tasting food! Our favorite is the lunch chicken plate with baked beans! Food is served fast and is always hot, never have I been served a plate that has been sitting in the back forever getting cold.",
   "Best rib I've ever had.   Great portions at a very reasonable price.  Smoked Turkey was great as well. Service was outstanding as well",
   "My go to every time I am in Jefferson City, MO. For a small town this location has superior customer service and the food orders are processed at a fast pace. Very friendly and efficient. I highly recommend this location. Ribs are to die for and the bread, my goodness the bread whoa.... it’s just too delicious for words.",
   "My favorite BBQ place in all of America...yes I have eaten ALOT of BBQ",
   "Had the smoked turkey dinner it was great!!!would have loved to try out mora things but im passing thru but would definitely pass by again to try something new,the only thing was they do not have much variety of beer selections which is why i rate this 4stars but the staff is great always checking on you nothing bad to say."
  ]
 },
 {
  "name": "O'Donoghue's Steaks and Sea Food",
  "address": "900 E High St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/446df4cc-9331-11ea-809a-14b31f159f22.png",
  "tags": [
   "food",
   "free",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12132470485613020404",
  "source": "GoogleMaps",
  "reviews": [
   "The hand-breaded shrimp were very good and substantial in size--the batter was a bit darker than I like. My only other issue is that the salad had too many stems, but was otherwise good; the homemade Thousand Island was very good.If you orders dessert, the brownie with ice cream is a good choice. Service was a tad slow, but efficient and friendly.",
   "All I can say about this place is that it's AMAZING!!!",
   "This was a meal that will not soon be forgotten.  It was our first visit and I'm positive it will turn out to be the first of many.  The food was absolutely sublime.  The service was professional, attentive, and friendly.  The decor was classy and the atmosphere was intimate.  I very highly recommend that you make a point of giving O'Donoghue's a try.  You will not regret it.",
   "Went with a large group. Gratuity was not inclined which was nice. The food was awesome. They had good gluten free options",
   "Great service and fantastic food."
  ]
 },
 {
  "name": "Alexandros",
  "address": "2125 Missouri Blvd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/44b7a86e-9331-11ea-a377-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3100501715208259990",
  "source": "GoogleMaps",
  "reviews": [
   "The service this evening was outstanding! Our server was very knowledgeable and very patient with questions about the menu. She was very attentive to our needs.  My New Orleans shrimp pasta was delicious, very flavorful but not spicy. My husband's steak was cooked to perfection. We haven't been here in a number of years but will definitely be back very soon!",
   "Best Prime Rib & Kansas City Strip Steak in town!\n\nGood Caesar salad and good sides.\n\nDelicious Creme Brulee dessert.\n\nNice restaurant atmosphere.\n\nCan accommodate large groups or a nice dinner date for party of two.\n\nHelpful and friendly service.",
   "Prime rib w Alexandros topping is Amazing here!! Service is great, wonderful place to come and dine...",
   "Outstanding! Great food and amazing service by Janelle! Will definitely be back. Highly recommend for anyone who appreciates exceptional food!",
   "A high-class Place, good for celebration such as birthdays and graduations, but also great just for impressing a date. The food is excellent, and if anything is not right they will make it right for you. The wait staff is well trained and you never have to wait for someone to fill your glass. The atmosphere is excellent. If you like lobster tail they have a wonderful fried lobster tail that will make your mouth orgasm"
  ]
 },
 {
  "name": "Love Sushi",
  "address": "2201 Missouri Blvd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/45175a46-9331-11ea-8834-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "family",
   "music"
  ],
  "link": "https://maps.google.com/?cid=10220288658437586845",
  "source": "GoogleMaps",
  "reviews": [
   "The sushi is great for the midwest. Having had Korean sushi for many years the quality definitely  isn't  as great. But again, great for somewhere so far from any oceans.",
   "Went for Valentine's dinner.   Very crowded,  but staff handled well.   Food was absolutely delicious!  Waiter was extremely courteous, did a great job.",
   "Excellent, as always! We really enjoy eating here. Great atmosphere and staff! If there is a better sushi restaurant in the area I have not heard of it. I had the Jefferson City roll and the King Salmon roll. Definitely give this place a try!",
   "It was my first time here and I enjoyed it. I had the Oh My plate recommended to me by a family member, and wasn't told that it arrived in flames. Spectacular! And tasty! Helpful and friendly staff. I enjoy Asian cuisine and was not disappointed.",
   "Korean music videos on the TV. Friendly staff. Flaming rolls. Takoyaki and Korean menu items. \n\nBirthday song includes lasers and a hat."
  ]
 },
 {
  "name": "La Chica Loca",
  "address": "306 E High St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/456fde80-9331-11ea-8b67-14b31f159f22.png",
  "tags": [
   "delicious",
   "art",
   "food",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2695443462324454819",
  "source": "GoogleMaps",
  "reviews": [
   "Been here twice and each time the food has been amazing.  Delicious chicken and waffles, and the surf (minus the turf) burrito of the week was almost to die for (almost as I live to tell the tale!)  ;)  The restaurant is new and chic.  My partner was thoroughly impressed with the plywood flooring.  There is local art adorning the walls, some of which you can purchase if you are interested.  Always clean!!!!  One cannot say that about every eatery anywhere.  Always a seat available, even when they're busy, and the service is top notch and quick.  If you have not visited you are missing out on one of JC's newest and best eateries in town!",
   "Food was fantastic. Owner is awesome. The chili was one of the best I have ever had. Spicy, flavorful and filling.",
   "This is the best breakfast (and they’re open through lunch too) in Jefferson City! Flavor perfection. Awesome variety of breakfast burritos or bowls. Your taste buds will thank you!\nMy favorite is the house made chicken chorizo.",
   "Freaking amazing. Pretty unique restaurant idea. Started out as a restaurant until it collapsed, turned into a food truck until a tornado took it out, now is a cute little spot downtown. \n\nThe green chili one is phenomenal. No matter what skip the salsa and go with the aioli on it. \n\nOwners are incredibly nice and super passionate about  their craft as well. \n\nThey do a few lunch specials and I hope they get more once they get settled in! \n\nGood stuff.",
   "Really good burritos and amazing variety.  I've had 5 different burritos so far, and have yet to be disappointed.  My favorite so far is the chicken chorizo burrito.  Make sure you get the spicy aioli - it's really good."
  ]
 },
 {
  "name": "Nick's Family Restaurant",
  "address": "1507 E McCarty St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/45c6436e-9331-11ea-bec2-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=3149051037586806372",
  "source": "GoogleMaps",
  "reviews": [
   "Fun and nostalgic restaurant experience inside the Jefferson City airport building.\n\nGood fish sandwich and good slaw and fantastic green beans.  Good fish and shrimp plate.\n\nService is good but maybe under staffed for the lunch rush.",
   "First visit to this recommended eatery.  Arrived at 5pm on a Friday and was given our choice of seating.  Very friendly and informative staff guided us through the options on the menu.  Very informal and unpretentious.  We had the best feast of the week here and portions will not make you asking for more but if you did you would pleasantly accommodated.  Will be returning anytime we are looking to dine in Jefferson City. By the time we left there was a wait for a table.",
   "Very fast, and friendly. Great service all the way around!",
   "You go to Nick's for that heavenly fried chicken. The sides are just ok, but that chicken is on point. If you like fried chicken then you'll like Nick's.",
   "Very good fried chicken and green beans.  The slaw was mostly vinegar which I don’t like but the other guy did."
  ]
 },
 {
  "name": "Dragon Kitchen",
  "address": "2219 Missouri Blvd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4621f9f6-9331-11ea-a420-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "drink",
   "food",
   "delicious",
   "family",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6961465981687441022",
  "source": "GoogleMaps",
  "reviews": [
   "This place is awesome! They have a really good selection of food, and every time I have been here it has been hot and fresh. The staff is always very friendly and accommodating, also very attentive. I have yet to have a bad experience and I've been here dozens of times in the last few months. Five stars, and thank you!",
   "Great variety of food! And looked very clean! Staff was also very friendly and was not too crowded so you can enjoy a good meal without too many people around. Pricing was reasonable.",
   "We have been eating here for 20 years. Food is very good, always fresh and service is great. It is a buffet, but they have a menu for a la cart. No matter how busy they are you will have a minimal wait. I highly recommend.",
   "I happened to go at the right time - shortly after 6pm. Food was fresh and there was plenty of it. The food was good. However, the service was lacking. They seemed eager to refill water but not soda. The drinks with all the ice barely hold 8oz of beverage. Their dinner theater was relatively \"amateur,\" as small children kept running in and out of the kitchen, who knows I guess they could have been on break. Worse yet, one of the urchins had a drink cup bigger than mine. I took pity on him though, for his was empty and I assume it was his playtime/break after all.",
   "Very friendly greeters and waiters, the food was hot and fresh, delicious and tasty array of choices to eat. Fresh vegetables grilled and baked and fried protein to meet the needs of even the pickiest eaters. My family and I would definitely patronize this establishment over and over again. One of the most friendliest cleanest and tastiest Chinese restaurants in town."
  ]
 },
 {
  "name": "LongHorn Steakhouse",
  "address": "3545 Missouri Blvd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/468275b4-9331-11ea-858d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "knowledgeable",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13818567182084064147",
  "source": "GoogleMaps",
  "reviews": [
   "The overall experience was ok. Three points because the presentation and the waiter were not good. You can know what I mean by presentation by looking at the stakes in the picture; That’s how plates were served. \n\nThe t-bone was ordered medium-rare, but it was well-done.. both orders were a little bit over cooked. \n\nAfter bringing the check and signing it, the waiter took it before we leave. That’s rude and definitely not professional. The norm is not to collect the signed receipt until after the customer leaves.",
   "Service was excellent. We had an exceptional waitress. That food was delicious and the presentation was perfect. Our table had everything from steaks to seafood.  Everyone enjoyed their supper with no compliments.  Drinks were refreshed without having to ask. Our waitress timing fro our salads, food and drinks were excellent.  Excellent service for a chain restaurant.  I would recommend this establishment and patronize the steakhouse again.",
   "The food was great .... The appetisers and the entrees were both delicious,with ample variety of side options. Our server was very good and attentive. Little high on the cost parameter but if budget is not a thing for you then go in for good food and drinks.",
   "We arrived at 2:00 pm and we’re seated right away, even though the place was busy. Our waiter, Will, was EXTREMELY personable, knowledgeable, and friendly! I told my daughter he should do commercials for them, since he was so enthusiastic about his job! Wonderful service = wonderful tip! Great food!",
   "Very good place to eat. Fun atmosphere!! Everyone nice & friendly. Food was exellent!! Will go back every chance I get. Love this place!!!"
  ]
 },
 {
  "name": "LOVE2NOURISH",
  "address": "700 E High St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/46e11094-9331-11ea-a5eb-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "drink",
   "free",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1667949191352282320",
  "source": "GoogleMaps",
  "reviews": [
   "Wow! I’ve been want to try this place for a while and I’m so glad I did. It’s quick and delicious! I walked in, grabbed a meal and was back at my office in 10 minutes. Usually you think of healthy meals as bland but this is bursting with flavor. I’m excited to go back.",
   "Always a wonderful experience, I got to try the new citrus coconut amazeballs. They are wonderful.",
   "I have several food allergies, and suffer from Celiac Disease. Finding healthy options beyond the grocery store is a trial for me. But Love2Nourish has a HUGE variety of really good meals that I can eat without worry! Thank you so much, Laurel, for all the hard work you do in providing such great cuisine!",
   "Great locally sourced food. The owners have been very helpful during the recent tornado relief, providing free food and drink to those affected and volunteering their time to restoring the city. Great people who deserve your business.",
   "I have had many great meals at the restaurant; however, this review is geared more towards their meal prep and my fantastic interactions with Laurel. In Jeff City, there is a void for healthy/clean eating. Love 2 Nourish changed the game for me in a dramatic way. Their food is always delicious with great portion sizes, reasonably priced, and so convenient. They deliver the meals straight to your door.\n\nLaurel is honestly a saint and provides the best service. Every email I ever send is responded to personally. They always go above and beyond and I am extremely impressed with the company overall with Laurel as the main representative that I've worked with."
  ]
 },
 {
  "name": "Lutz's BBQ",
  "address": "3505 Missouri Blvd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4737e368-9331-11ea-9313-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1863505311558060117",
  "source": "GoogleMaps",
  "reviews": [
   "I had their 1/2 porksteak basket with jalapeno homemade chips for $8.25.\n\nThe meat was smoked, tender and scrumptious!  Their homemade chips are delicious and you get a choice of 12 seasonings.  I had jalapeno and it was not real hot/spicy.\n\nThe food is great.  You order at the counter and pay.  They call your name when your food is ready.\n\nThis is smokin' delicious BBC.  Straight 5 star in my humble opinion ! !",
   "My company was hired to assist a couple with coordinating their wedding day last weekend, and I had the most pleasant experience working with the team from Lutz's. The communication leading up to the wedding was top notch; Kala was incredibly upbeat and helpful. It made both me and the bride feel incredibly confident that the end product would be stellar. On the day of the wedding, the Lutz's team was welcoming, helpful, and flexible. I thoroughly enjoyed their energy, and it was great to have them enhance the guest experience. Oh, did I mention that the food was tasty? Thank you all for everything; looking forward to working future weddings with you!",
   "Decent enough BBQ, quick, fairly priced.",
   "When is the last time you ate bbq at a gas station? This place is always hopping over the lunch hour, so get here early. I recommend the burt ends sandwich and the homemade potato chips. Throw a little creamy coleslaw on that sandwich and you’ve got yourself a winner- pickles and onions on the side. Nothing fancy here, just great food.",
   "Food was great. We got the pulled pork sandwich and the burnt ends sandwich meal with baked beans and fries. It was $21.35 all together. The lady that took our order was very nice and super helpful. The food came pretty darn quick for a BBQ place even though they were packed. It was a bit pricey though as we got the 1/3 sandwiches and not the 1/2. All in all a.good place for some good food we will be back. 😃"
  ]
 },
 {
  "name": "The Pizza Company",
  "address": "1508 E McCarty St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/47963064-9331-11ea-9969-14b31f159f22.png",
  "tags": [
   "eat",
   "family",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=9380338649117830463",
  "source": "GoogleMaps",
  "reviews": [
   "Was one of my favorite places to eat until it switched owners. Staff can be very rude on phone and in person. They can lack professionalism. Was very disappointed with my experiences lately and has cost The Pizza Company my business. Super sad :(",
   "Great crust, bunch of toppings, Coca-Cola, Coke, cool people, video games & pool table downstairs, will go back very soon! YUM!",
   "We had our family Thanksgiving here,  20 to 25 people.  4 of us found hair in the pizza and salad.  When we told the waitress her reply was \"really? What color was the hair?\".  Went to pay and no apology,  comp or anything. Never going back.",
   "Ever have really good day old cold pizza? This pizza company has accomplished just that! So imagine how great it is when it comes out hot.",
   "This place is a local favorite, the busiest time to stop in is around lunch, but I would still say that is the time to go if you like buffet pizza.  Grab a table, get a plate and drink, and pay at the register when you are finished.  Pretty much self serve during lunch. The only challenge you might have is navigating the lines between the waves of people getting in line for fresh pizza as it comes up.   They have changed the layout of the dinning area a little to accommodate more people so finding a table seems to be a little easier.  If you have large groups give them a call, they might be able to work you into a private area down stairs."
  ]
 },
 {
  "name": "Oscar's Classic Diner",
  "address": "2118 Schotthill Woods Dr, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/488dd9d8-9331-11ea-b085-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "family",
   "free",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4814643635129027460",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing onion rings! Great service and delicious dinner style food. Cant go wrong with any item on the menu. Definitley a frequent spot for my wife and me.",
   "It was good as always.  We had breakfast.  We ordered the Biscuits & Gravy Deluxe and Ham & Cheese Omelette. Both were good and large portions. Even had extra to take home.",
   "We have enjoyed the great service and food many times. Whole family is able to find something to eat. Gluten free menu includes cake! Very impressed with their ability to please my family's diverse needs. McKenzie was an excellent waitress. She took care of our needs perfectly!",
   "Food was excellent! Their made on-site potato chips are like packaged chips but not greasy or salty. Be sure to get them a try. Arrived at noon Saturday and got seated immediately 👍",
   "Came in on a busy Saturday night and was seated immediately. The server came over in perfect time taking our order and drinks. Food came in less than ten minutes. Best restaurant I’ve been too."
  ]
 },
 {
  "name": "Arris' Bistro & Liquid Lounge",
  "address": "409 W Miller St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/48e3152e-9331-11ea-bab5-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13036054883147705609",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful atmosphere with indoor seating and outdoor patio seating.\n\nMust try fries and ranch dipping sauce.\n\nTasty Caesar Salad. \n\nExceptional Mediterranean Wrap.\n\nWonderful Tuscan Alfredo Panini.\n\nSome of the best desserts in Jefferson City.  The Strawberry Float Cake has been my favorite so far. \n\nExcellent cocktails.\n\nGreat service. \n\nNice location right off the highway.",
   "I have not ate there yet...from what I have seen the setting is causal, the customers are all enjoying ample amounts of their lunches. It looks quite delicious. The restrooms are very clean major bonus. The desserts OMGosh!!! They are to die for. I swear I gained 10#s just from looking at them. The staff is very friendly and helpful.",
   "The food is good.  Needs up date-refresh for decor.  More  training  for staff with new technology for payments.  Staff is nice, but need more staff to handle customers. Give dessert menus.",
   "I've stopped by here a handful of times on my way through Jefferson City, always well worth it.\n\nNice selection of beers on tap, huge assortment of delicious food from the well-known Arris's family tradition, and a large beautiful desert case with homemade truffles to pop in a go box for the road!\n\nStop by here for a wonderful lunch or a fantastic dinner, you will not be disappointed!",
   "All our food was great, but I think I just had the best Caesar Salad ever!! It was so good! The lasagna was really tasty, too. I didn't get a dessert, but they looked superb!"
  ]
 },
 {
  "name": "Fuji Japanese Steak House & Sushi Bar",
  "address": "3600 Country Club Dr Ste 512, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/493072f8-9331-11ea-bb26-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "kids",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14362500498447475356",
  "source": "GoogleMaps",
  "reviews": [
   "West Coast transplant and this is probably the closest thing to Edible Sushi that reminds me of a Real Sushi restaurant in the Entirety of Missouri.\nGreat Place if you actually know what Sushi should be and how to eat it!!\n\nPS - Would really appreciate Uni on the menu !!!!!",
   "Nice service and tasty food. \n\nWe enjoyed the dining experience in the restaurant section.\n\nI recommend the sashimi salad and special sushi roll with mango.",
   "The sushi was good. I didn't much care for one of the rolls (it had mango on top) but overall they were great. The presentation of our dish was beautiful! I loved the ambient lighting and general atmosphere of the place. Our server was very attentive and our drinks never went dry. The prices were reasonable, competitive with other sushi restaurants. I really would like to try their hibachi next time.",
   "I’ve been here before but this was my first time with my kids. Had a blast. Even though two of my four kids are scaredy-cats, the chef got them interested and out from under the table. \nThe food was delicious and service was fabulous!",
   "The atmosphere is neat and the food is good. It’s a pretty typical hibachi grill. A little pricey."
  ]
 },
 {
  "name": "Chick-fil-A",
  "address": "3407 Missouri Blvd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4983c44a-9331-11ea-94d6-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=129268753952888532",
  "source": "GoogleMaps",
  "reviews": [
   "I don’t know what changed since they first opened....  I wasn’t a fan then, but I’ve been there a half a dozen times since then and it’s been wonderful.  The Spicy Chicken Deluxe will make you talk to yourself.  👍🏻👍🏻👍🏻",
   "I've been to this location several times since moving to town.. they seem to have way bigger breakfast burritos than the location in independence, mo. Best fast food customer service around.. aaaaand great food",
   "Best sandwich I've ever had, definitely lives up to the hype.",
   "The Best chicken sandwiches  in town. Always fresh. I have been a couple of times and the ice cream machine was broke each time.  They should keep  it fixed because their ice cream is awesome.",
   "Love Chick-fil-a! Consistently the best run restaurants no matter where you go!  Best chicken ever!"
  ]
 },
 {
  "name": "Theo's Midtown",
  "address": "620 W McCarty St, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/49c2c922-9331-11ea-a245-14b31f159f22.png",
  "tags": [
   "walking",
   "food",
   "eat",
   "food",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5851914014595299848",
  "source": "GoogleMaps",
  "reviews": [
   "Flavorful to the full! Easy walking distance from our hotel! Friendly wait staff. Many menu options for all tastes and GF options too! The bar and bar menu looked enticing! The atmosphere was fun and elegant. Will return soon!!",
   "Great food and atmosphere.  Really glad we stopped here for lunch.  The service was fantastic.  I had a gyro and my friend the Cuban and we both loved our meal.",
   "Excellent! Love this place. Their customer service and food is always amazing. Great vibe! We brought our national, regional and state officers for Zeta Phi Beta Sorority, Inc. there two weeks ago to dine and now they are addicted and will only eat here when they come in town for meetings. So once again we are here today. Thanks for providing a great dining experience every time.",
   "I guess we lucked out that it wasn't crowded on a Friday night. Great service, and they have hooks under the table for a purse! (#thelittlethings) \nWe tried the Mad Rooster pizza and it was pretty good. It's not what we'd usually get but it's quite spicy. The crust actually reminds me of a breakfast pizza crust and the garlic cream sauce was delicious. The wine was so good but overpriced. I can buy it here locally for the price they'd charge for two small glasses.",
   "This is a great place to go for lunch. The food was fresh and delicious. The service was excellent and very friendly."
  ]
 },
 {
  "name": "MOD Pizza",
  "address": "1709 Missouri Blvd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4a27e036-9331-11ea-add2-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "music"
  ],
  "link": "https://maps.google.com/?cid=12565000092895662851",
  "source": "GoogleMaps",
  "reviews": [
   "Today was good. I did an online order and it was ready when they said it would be and everything was correct.  The pizza was very good, thin and crispy with all the toppings I wanted. My salad was fresh and I love that I can get whatever vegetables I want in it. I gave 4 stars because I've been there before and had a couple of issues with burnt pizza and incorrect orders.",
   "1st time I have tried the cauliflower crust. And 1st time I have ever been able to build my own without a large upcharge.\nBEST PIZZA EVER!!!\nEven had roasted garlic pieces!!!!",
   "Love this place. Always great service. Fast and delicious. Every time I come in, they are freindly and fast. Never had a bad experience here.",
   "It was my first time, and it was a success.  Design your own pizza, who doesn't love that?  There were lots of toppings from which to chose.  The staff was helpful and the place was clean. The price was good.  I would come back.",
   "I love MOD pizza. It is refreshing to be able to design your own special pizza without paying extra for toppings. Always delicious and the staff are always friendly and helpful. The only reason this restaurant does not get 5 ⭐️rating is the volume of the music they play. Another new restaurant where the music is so loud you can’t carry on a conversation. ( Must be for people who just want to play on their phones.) We usually get ours to go for just this reason. But the pizza is great!"
  ]
 },
 {
  "name": "Manuel's Taqueria",
  "address": "2403 Missouri Blvd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4a79b82e-9331-11ea-b369-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11809991544575630277",
  "source": "GoogleMaps",
  "reviews": [
   "The tacos tasted great!  Prices are very reasonable.  I would have given 5 stars but the restroom definitely needed help especially at opening time.",
   "Coming from a Hispanic, this is hands down the best place in Jeff City to get authentic Mexican food. The menu has a great variety of food and drinks to chose from, and the serving sizes are very generous. You won't be disappointed!",
   "Now talk about soft tacos, you have to order some from this ace. You may need help with one as they are extralarge indeed and yummy",
   "Great food and friendly staff the prices are pretty decent for the amount of food you get. Authentic Mexican not the same as what you're used to around here.",
   "This place has great authentic Mexican food and I highly recommend anyone to try it. The serving sizes are also very large. Even the quesadillas are impressively filling."
  ]
 },
 {
  "name": "The Water Tower Bar & Grill",
  "address": "458 Rock Hill Rd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4acabeae-9331-11ea-85e1-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=9216713758636212625",
  "source": "GoogleMaps",
  "reviews": [
   "Good food. Never crazy crowded. We like to play pool and shuffleboard. Threw darts the last time we were there, too. Menu has grown since they opened. Pub food, nothing fancy. But the skirt burger is fun! Tenderloin is huge! Thursday night is trivia... I think they are still trying to grow a following for this as there were only 3 teams, but the questions were a very good mix and it was a lot of fun. I hope they continue to do that. Definitely one of our \"go to\" spots in Jeff City!",
   "The food was delicious! The place is nice, but nothing fancy. The menu is limited but still a decent selection. Definitely worth checking out.",
   "The staff is super friendly here. The drinks came out quick and we had a great time playing pool here. The food was tasty too.",
   "Great place, good atmosphere. Wonderful place to throw darts. Sidenote, they don't have a very good alternative menu. No keto/Gluten free options that I saw on the menu.",
   "Open seating bar and grill with a solid burger. Macrobrew selection with a small craft selection in cans, plus large liquor offering. Mature crowd, friendly staff. Great place to grab a beer, burger, and conversation. 2 pool tables and shuffleboard, plus live bands on occasion."
  ]
 },
 {
  "name": "Paddy Malone's Pub",
  "address": "700 W Main St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4b2eb0b6-9331-11ea-ad9b-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5600253084704547534",
  "source": "GoogleMaps",
  "reviews": [
   "Always love coming here on out traditional Thursday nights! Black and Bleu burger is the best in town and possibly the state! Mike takes great care of us and Tom cooks one hell of a meal. You'd never know you feel more at home than you when you do here!",
   "Great Irish Pub restaurant with indoor seating at tables, booths, or bar, & outdoor seating at covered deck. \n\nGood menu with ginormous portions of food.  The pork loin sandwich was ridiculous and delicious.  The cheese steak sandwich was amazing.  The Magner’s hard cider was tasty.\n\nCan’t find food like this anywhere else in town.\n\nFriendly service.\n\nSeems like it’s always busy, but we got immediate seating.\n\nStreet parking in front or along side street.",
   "Food is phenomenal. The cheese steak soup is some of the best soup I’ve ever had. Burgers are amazing! Chips and cheese are soooooo good and big enough to share. Guinness beer is one of the best pours you’ll find in the US. Chicken strips are handed-breaded. Be prepared for a wait and less that stellar service - but it is *so* worth it.",
   "Stopped in to get a sandwich and a beer, we certainly were not disappointed! The portebella mushrooms were outstanding ! The O rings looked delicious although we did not try them. Enjoyed their beer selections and the atmosphere of the establishment! Will definitely go back!",
   "I like this place. They have among the best food. If you show up for a drink. Make sure you have an empty belly. Order some food for and your Friend. The Irish way😋"
  ]
 },
 {
  "name": "JQ's On High",
  "address": "911 E High St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4b8f0d98-9331-11ea-96d0-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "tasting",
   "art",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9147551115762050059",
  "source": "GoogleMaps",
  "reviews": [
   "I called in for food to go last week. Presentation was great and the store was clean as always. These guys are awesome! Keep up the good work. The Hellz Bella Burger Add bacon is my all time favorite. No Actual meat(other than bacon) Its AMAZING! \nThanks again!",
   "Jeff City is sooooo lucky to have JQ’s, never a bad experience. Everything is so fresh and the quaint atmosphere just adds to the whole experience. It helps with the lunch staff just knows your order. We LOVE JQ’s!\n\n",
   "I'm surprised I've never eaten here before, and if anyone has told me about it, I must not have been listening.  A simple menu where the attention to detail is placed on the flavor and preparation of the food.  The staff member that took our order was very helpful and courteous.  Even though this night was rather slow and there were plenty of available seats, we opted to sit next door at The Mission where they had open mic night going on. They walked our order right over and delivered it to our table.  That's pretty cool.  \n\nWe ordered the burger and the fish tacos. The burger was good sized, placed on a toasted bun with onions, lettuce, tomatoes and pickles. I also had them add jalapenos.  There was a sauce added on the underside which was flavorful but didnt dominate the taste of the burger.  It was cooked evenly through and the burger itself had good taste and wasn't dried out or overly greasy. \n\nThe fish tacos had a good amount of fish and the tastes and texture worked out great.  Nothing seemed over cooked or lacking seasoning. \n\nIf your like supporting your local businesses and like your food cooked to order, you should deffinitly try it.",
   "This is a great burger joint and more! I have enjoyed talking with the owners as much as having their burgers too! I want to try everything on the menu at least once but it's hard to move past those big, juicy, wonderful tasting chopped brisket works of art!",
   "Food was great especially the baked beans. They were an upcharge though. My grandson  took me there he loves the burgers. They were pricey but well worth it. Staff was awesome.  Will go again for sure"
  ]
 },
 {
  "name": "Daisy Delight Restaurant",
  "address": "2715 E McCarty St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4be5f088-9331-11ea-b93c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=15477783597296114161",
  "source": "GoogleMaps",
  "reviews": [
   "This place is ok. I'm guessing the high stars are because it's a local dive and there's really not much else around to choose from. It's exactly what you think it is, greasy diner food. Burgers, chili fries, nachos, mozzarella sticks, etc. It wasn't bad but I won't be going back. Drive another 5 minutes towards Jefferson City and you'll have several far better options to choose from.",
   "Amazing service friendly atmosphere great for any occasion.   I love this place!!",
   "really quaint cozy authentic Americana dinner feeling. very nostalgic, the food was outstanding and portions were beyond fair👍🏼",
   "Nice, old fashioned place. Best of all it is the only place I know of in the area with lactose free ice cream!",
   "I enjoyed their fried mushrooms. They also have a working Ms Pacman arcade game!!"
  ]
 },
 {
  "name": "J Vietnamese Cafe",
  "address": "1406 Missouri Blvd ste c, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4c398f30-9331-11ea-86c0-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "unique",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=618944270766085408",
  "source": "GoogleMaps",
  "reviews": [
   "Always fantastic food and service. The shrimp Curry was great today.",
   "This is my favorite place to eat.  I absolutely love the Pho.  It's way more than I can eat, but it's impossible to stop myself.",
   "Unique, well crafted presentation.  Everything I've ordered here has been excellent in both flavor and presentation.  I really enjoy the boba tea, it's like a sweet smoothie with speed bumps.",
   "Great, food, atmosphere and service!",
   "So glad we found this place! We moved here from Washington state a few years back and hadn't found a place for Pho because we live in a smaller town here in MO.  We've found it now! Service was perfect, food was delicious, and atmosphere was inviting.  Really enjoyed it and will for sure go back when we are in Jeff city!"
  ]
 },
 {
  "name": "Kate & Ally's Ny Pizzeria",
  "address": "1418 Missouri Blvd A, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4c9fb862-9331-11ea-83bd-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13113352373739379395",
  "source": "GoogleMaps",
  "reviews": [
   "Local go-to for pizza 🍕. They have a great lunch special with a huge slice of pizza and a salad. Even with a soda it’s less than you spend at a fast food place.  Fantastic pizza!",
   "Got a med supreme St.Louis style, it was my fault I forgot to say no to provalone cheese and not a big fan of large green pepper, no sub unless you pay 1.85 more, now I wish I would have, crust was spot on and sauce was very good, sausage good flavor,",
   "I had this place a while ago and the pizza and design was amazing I also really like the salad’s  and wings keep up the great work!",
   "excellent place to dine in and enjoy some great food especially the Chicago style deep dish pizza. We are from Chicago and we rate it 9 out of 10 Stars with its only comparison is actually in Chicago....❤❤❤❤❤. Petite dish pizza was so good that we ate one there and ordered an additional one chest to take home........",
   "Best pizza I've ever had... And I only tried the New York style pepperoni, the other pizzas my friends ordered look amazing and they were all pleased as well! Kind and generous owner, saw her compassion first hand with a \"down on their luck\" local."
  ]
 },
 {
  "name": "Sabaai-Sabaai Thai Cuisine",
  "address": "219 Madison St #3229, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4cedc53e-9331-11ea-b83b-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5917637953377481996",
  "source": "GoogleMaps",
  "reviews": [
   "I have grown up eating a lot of Thai food, so I am particular that it be authentic... I was a little skeptical at first of this restaurant, but I have now decided that it is the best Thai food that I've tried, outside of Thailand. The customer service was great, and the prices were good. I will definitely be going back again, and again!",
   "I had a shrimp Pad See U and kaeng panamg curry. The food is very authentic and yummy! The price is reasonable and the staffs were kind and welcoming. I would def stop by here again. Those who are looking for some authentic flavor would love the place!",
   "I don't understand where they got their good reviews...\n\nTwice I've ordered from them, to be delivered,  and both times the entree was bland, lacking in flavor and desperately needing salt. Both times my drink had been spilled a bit inside the bag. Who puts the drinks in the bag, and why? Both times our appetizers were wrapped with paper towels, which gets soggy and becomes glued to the pot stickers, dumplings or whatever. Unless   I'm desperate for Thai, I dont think I'll buy from them again.",
   "Tried shrimp pad Thai, beef pad won sen, and chicken yellow curry....along with shrimp dumplings. Honestly didn’t like any of it and would not recommend this restaurant. Ordered a take out order and it took over 35 min to prepare. Had high hopes based on other reviews but was very disappointed. We did not finish a single dish. \n\nFood was bland and of poor quality. Wanted to love it but it was awful.",
   "6 STARS!! Amazing authentic Thai food with the best service in Jefferson City. Highly recommend!"
  ]
 },
 {
  "name": "Veit's Pub & Grill",
  "address": "2314 Lorenzo Greene Dr, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4d3a014c-9331-11ea-b2e8-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14117632691784223628",
  "source": "GoogleMaps",
  "reviews": [
   "Exceptionally good comfort foods!\n\nGreat menu choices and a lunchtime buffet that is full of great home style cookin’.\n\nThey also have a bar. \n\nHelpful and friendly service.\n\nRestaurant / sports bar atmosphere with TVs mounted at various locations around the room tuned-in to the game. \n\nPass the time with friends at outdoor seating areas with beanbag games.",
   "Wow! Easter family dinner was outstanding! A man at Missouri Native Plants Nursery recommended Veit's mentioning the catfish. It was delicious. Great patio with small stream next to it. Our server was fairly new but she took care of us. You should eat here if you are in the Jefferson City area.",
   "We went to Veit's for the first time a couple of weeks ago. Although the buffet was almost ending, all their food was hot and fresh! Definitely about to be a regular there.",
   "What Great food. Plenty of good food. Great off the menu. Great off the Food Bar. Spacious for large Groups. Timely arrival if Hot Food. Friendly Servers",
   "I have only been there for lunch and went 3 times.  Food is okay.  But the lunch buffet is exactly the same every day.  Be nice if they changed it up a bit.  I would definitely go more often."
  ]
 },
 {
  "name": "Pancheros Mexican Grill",
  "address": "2208 Missouri Blvd #100, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4d8c8874-9331-11ea-b3d3-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "affordable",
   "free"
  ],
  "link": "https://maps.google.com/?cid=6254868585844636103",
  "source": "GoogleMaps",
  "reviews": [
   "Always fast and fresh. Even the tortillas are fresh pressed and cooked there in front of you. And I have never seen a more beautifully wrapped burrito in my life.",
   "Freshly made tortillas, good quality toppings, and decent prices. Feels healthier than fast food, taste better too.",
   "Everything is nice and neat and clean. The staff is very helpful. Everything is made Fairly fresh and it's extremely delicious. options are limited but by just adding or subtracting some of the dishes you can make a great combination. Even my children who are very fussy eaters love this place. Everything is very affordable and you will leave full. This is a great place for those who are on a limited budget because you can make one meal into two if you have to.",
   "I was given a free burrito and chips card and decided to use it today for lunch. I went in and had no idea how to order since I have never been there. They were very nice and helpful. I told them what meat and told them to just make something yummy. That burrito was huge first off. Second it was absolutely amazing. I suggest everyone give them a try. You wont be disappointed.",
   "The staff here is amazing! Very friendly and helpful."
  ]
 },
 {
  "name": "El Espolon",
  "address": "450 Rock Hill Rd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4fae5e1e-9331-11ea-be37-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13044620160712478869",
  "source": "GoogleMaps",
  "reviews": [
   "The food was good. The service was ok.  The server hardly came to our table.",
   "Looks really good. A little off the beaten path. Bought gift cards where the manager was accommodating and didn't mind I was asking for 35 individual cards. They have a separate bar area. Once lunch crowd where I overheard best place in town. If you've not been there, this is a must visit to try it out for yourself",
   "We went Friday night and had a bad experience. We waited a hour and a half . Still no food. We just walked out and they chased after us to pay for my soda. I am sorry but if I sit there that long with no explanation I am not paying for anything. We will not be going back. I just called and was going to give them a chance to make it right but he acted like it was my fault. So if this is they way they treat there guests then I will definitely not be returning.",
   "First time visit. I'm giving 2 stars only due to their lack of consideration toward customers health. \nWhile dining, they proceeded in sweeping floors within very close proximity of customers tables. I'm confident that state health department laws and regulations would consider this a health violation. Have they no knowledge of the dust and airborne pathogens they cause to be stirred and distributed. \nFood, service, quality and quantities were proportionate, with the food being tasteful and fresh, just hope they review customer reviews and make the necessary changes toward customers safety.",
   "Honestly some of the best Mexican Food I've had in a while! Visiting from out of town, and tried to find anywhere that was open, 4th place we tried and we are so glad we stopped here!!\nFast, friendly service, delicious chips and salsa, and the food was hot and so so good! Would definitely return and recommend!!"
  ]
 },
 {
  "name": "Bones Restaurant and Lounge",
  "address": "210 Commercial Ave, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4ffc0726-9331-11ea-9d13-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6045977216342353933",
  "source": "GoogleMaps",
  "reviews": [
   "When I first walked in I had a really low standards the atmosphere was of a really older crowd the carpet and decor is aged. However, once we were sit down I listen to the music being played on the piano by an older man which was amazing he did a fantastic job our server was super nice and the food was absolutely amazing!! This place is absolutely one of those don’t judge a book by its cover!!",
   "Delicious food, great service!",
   "We had a class reunion there. Food was outstanding.  The best German pot roast I've ever eaten.  Atmosphere was perfect for our group of 50people.  Staff was attentive and friendly.  Loved it.",
   "My grandparents Jennie and Russell Hill were regulars here many years ago. I love the food and good company!",
   "We were in the banquet room. Very nice. Lots of seating. Everything seemed clean and staff was nice."
  ]
 },
 {
  "name": "El Jimador Mexican Restaurant",
  "address": "1410 Missouri Blvd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5053b008-9331-11ea-9b58-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=572352214848090046",
  "source": "GoogleMaps",
  "reviews": [
   "Just as good as I remember from nearly 20 years ago. A great place to eat while you're in town with fast and friendly service. I'm glad to see this place is still going strong. Keep up the great work.",
   "Great service and food!  Really cool pottery drinking glasses, $7!",
   "The food was good. Very quick but our waiter came to our table once after our food came out. We needed drinks and he was no where to be found. Also it was my Birthday and my husband told the hostess that it was my birthday and they didn't do anything. I didn't mind that so much but he was upset because she said they would. He even had us sit there a little longer after we were done eating. The food I would go back for... the service would make me try another place.",
   "Really good, well seasoned Mexican food. A nice selection of salsas at their salsa bar.",
   "Awesome food!!! ... me and my family moved from Fresno California ware it's real Mexican food and this place makes me feel like home! ... HIGHLY RECOMMENDED!!!!!"
  ]
 },
 {
  "name": "El Espolon",
  "address": "915 Eastland Dr E, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/50a7c924-9331-11ea-8aa8-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17976311756987695939",
  "source": "GoogleMaps",
  "reviews": [
   "It doesn’t matter how many times I go here, it’s the same dismissive attitude and horrible customer service. The waiters are usually pleasant, it’s the managers. Literally asked a questions about the menu before placing my phone order. The man huffed blurted out the answer then placed me on hold to take another order. I know because he didn’t even put the phone on mute. It’s sad that this small community can’t get good consistent customer service. And when concerns about food you ARE PAYING for are brought to managements attentions. They just look at you. Don’t say I apologize, I will speak with blank. Or we will fix for next time. You get nothing but a blank look. And I’ve gotten FOOD POISONING twice from this place. I swore I wouldn’t eat here again. It’s been a year and I thought Let me try it one more time and BOOM Still no change. I hope they read these and do take into consideration peoples feeling because talking to them doesn’t work.",
   "Nice restaurant with friendly and attentive staff. The chips are hot and fresh",
   "Ordered take out of a chicken taco salad and got 20%salad and 80% sour cream when I called to see if I could just get it replaced with chicken nachos something my 2 year old brother could assemble correctly they would not replace it nor help in anyway, and the icing on the cake was I’ve been sitting on the toilet for the past hour think I have food poisoning. Also another time I told a waiter to have a good one and got called a pendeho what ever that means will not return",
   "We went to dinner here on a Saturday night. Place was pretty crowded but still got seated quickly. The waitress got our drink order then. We ordered a short while later then waited an hour for food. When the food came out it was cold. On top of that they forgot to bring my brother in law's food. It was another 15 minutes before we could flag the manager over. They finally bright his food out. It was cold as well.  I do not recommend this place and we will never go back.",
   "Big menu. Great food and service. Place is huge. You could fit half of Jeff City in here."
  ]
 },
 {
  "name": "Sawadee Thai Cuisine",
  "address": "103 E High St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/510d30a2-9331-11ea-95aa-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6652751222034545456",
  "source": "GoogleMaps",
  "reviews": [
   "Nice price！Nice steak！Will definitely come again！！",
   "5 stars from me is a rarity.  But this place deserves it.  Big flavors.  Great tastes.  And they make it to your level of spice.  Can't wait to go there again!",
   "This is by far the best Thai restaurant that I have been to; outside of Thailand! I grew up eating a lot of Thai food, so I love it when I find some that's authentic.",
   "This place is always overlooked and it deserves better! Tiny little restaurant with amazing food and quick service! Definitely try the Thai Tea!",
   "What a delight to the pallet!  A very nicely crisp salmon on top of al dente vegetables with a spicy red curry and white rice.  \n\nThe building seems like it was built in an alleyway but don't let the location fool you.  Very clean restroom and amazing service while I was here.\n\nEverything on the menu looked awesome but the people around me platters looked even better.  I would definitely come back for more.  Ps. Great Price!"
  ]
 },
 {
  "name": "Spectators",
  "address": "232 E High St, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5157a340-9331-11ea-bbe6-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "music",
   "drink",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=6093953827269413751",
  "source": "GoogleMaps",
  "reviews": [
   "I went to this establishment for the first time on Jan 17 2020.  My main reason was to play their bar bingo which by the way is free to play.  It is called extreme bingo.  You have a chance to win a 52 inch TV or $100 gift card.  They even had a game you could win $3000.  All for free.  So I had a some food from there kitchen which I would give 5 stars for.  The staff will get 5 stars plus.  Very friendly and always a step ahead of what I wanted.  Very friendly.  Plenty of seating.  Very wonderful experience.  Now I have a regular Thursday activity.  Nothing but good things to say.  Very nice place and staff.",
   "Just look at the pics, tiny burger, child-size order of fries, made no better by lunch time bartending waitress. \nBlaring music in a empty lunch time place to run you out and keep it empty.\nI'll bet it's fine for evening drinkers, bad lunch experience.",
   "There's a reason they have the best bartender in town... No really. They literally have the #1 voted bartender, Faith. Want a drink and a great service? Pull a seat downtown with Faith or Pat tell em I sent you. Seriously, tell em. They'll get a kick out of it!",
   "Nice atmosphere and good bands but the service is HORRIBLE.  You have to wait forever to get food and drinks. Not sure if they have waitresses anymore. In past visits they would come to the tables for you to order stuff, now they ignore you until you go to the bar and wait forever for them to serve you.",
   "There was multiple music playing. \nThe bathrooms were clean.\nService was good.\nFood was okay. \nMultiple pool tables down stairs and a bar. No bartender, though."
  ]
 },
 {
  "name": "Ria's Restaurant & Lounge",
  "address": "3550 W Edgewood Dr #6955, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/51b4bc68-9331-11ea-8403-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "unique",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=2796188784329903165",
  "source": "GoogleMaps",
  "reviews": [
   "The food there is really good, the service is friendly. And if you like lasagna, you will love their's! Also the atmosphere is nice. There are TVs in the bar area but they have never been overly loud, which we appreciate while also catching up on scores. A good experience.",
   "I had only done Ria's lunch buffet and hadn't done it for a couple years because buffet food never sets well with me.  I was pleasantly surprised with our Saturday evening visit!!  The servers were pleasant and attentive but most importantly, our food was wonderful.  Everything was fresh and hot!  Will definitely be going back.",
   "Food was excellent. \nMenu offers a great selection from salad, meats, seafood, pasta and pizza. Wonderful server! Very attentive and happily answered all of our menu related questions.\nSecond time we have eaten @ Ria's and it was equally as good as the first time.",
   "There lunch buffet is very good and priced just right @10.68. Very clean and friendly staff.",
   "I got the gyro sandwich, which was was good. However, for $9 I didn't feel like it was worth it. The others in my party said the food was good or so-so, with one person saying their salad was way too salty. The service was very slow, and the waiter wasn't very friendly. And the atmosphere left much to be desired; it didn't feel like they had personalized the restaurant much with artwork or unique music. Overall, I wouldn't be absolutely opposed to going back to Ria's, but I wouldn't seek it out either."
  ]
 },
 {
  "name": "Dudley's",
  "address": "5525 Bus 50 W, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/52128c80-9331-11ea-b9c3-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7225210895347020055",
  "source": "GoogleMaps",
  "reviews": [
   "Food was good but took FOREVER can't do on a real lunch break",
   "Great breakfast dinner",
   "All ways a great place to eat the severce is grate",
   "Always fast and cheerful service and always good food. Will continue to dine here.",
   "Good food, friendly staff"
  ]
 },
 {
  "name": "Red Lobster",
  "address": "3519 Country Club Dr, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/52b7dbb6-9331-11ea-a954-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9667994315563512569",
  "source": "GoogleMaps",
  "reviews": [
   "We got a to-go order and it was overcooked and NOT hot when got it home (we don't live far away). Our salad was warmer than the pasta. The portion is small for the price, for the take out. Sorry but you all need to work a bit on ALL people that spend money at your restaurant. Even fast food serves hotter food then what we got. Dining in is better but really disappointed about the take out.",
   "Miracle was the best server we've had in a long time! She was personal, motivated to make sure we had the best night and took care of our every need. She is the definition of \"Customer Service.\" If you go to this Red Lobster, request for her to be your server...if you have to wait, do it!",
   "My husband and I and I arrived  here yesterday for three course meal. At first it was a little awkward as we were waiting and nobody was upfront. As we waited for a little bit somebody to finally come and then we settled. Our server was absolutely awesome he was funny and absolutely the best our soup was hot and delicious both of our main courses and desserts were really good!!!!  I would Highly recommend this place.",
   "Went there for lunch today. Hadn't been for awhile because service had gone downhill for a bit, but is back up to par now. Our waiter was Ernie today and he was on point with everything. Ernie, you are awesome! Food was out just in time and excellent.",
   "We had the best customer service! Tabitha made sure we always had full drinks and reloaded our biscuits throughout the dinner! Not a single negative thing to say about the service or the food! You got to try the new shrimp rangoons were great!"
  ]
 },
 {
  "name": "Zesto Drive-In",
  "address": "1730 Jefferson St, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/53190ee4-9331-11ea-97a7-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4301715201929958594",
  "source": "GoogleMaps",
  "reviews": [
   "Food here is very good, our order was quickly prepared, and the staff was very friendly.",
   "Good local owned BBQ & Ice cream. One of the few places that you still get butterscotch.  Nothing fancy, but that's what makes it a better place in the summertime for a cold dessert w/a relaxed atmosphere, but that all depends on the crowd there.",
   "The very best diner. Went there and food was great and staff are very welcoming.",
   "Not a bad place to go if you looking for a nice non chain food joint. This place was the bee's knees about 15 years ago, but new places came along and its changed. They still have good soft serve ice cream though. Service is pretty good for young high school kids. 4 stars cause they are still around and a Jefferson city legend when you here about this place. Stop on in and have a bite.\n\nYour Trustworthy Critic",
   "Just excellent Auto body shop. \nVery pleasant management."
  ]
 },
 {
  "name": "Freddy's Frozen Custard & Steakburgers",
  "address": "2103 Missouri Blvd #4718, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/53878d80-9331-11ea-bfab-14b31f159f22.png",
  "tags": [
   "unique",
   "free",
   "food",
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=1078349637374358846",
  "source": "GoogleMaps",
  "reviews": [
   "It was a cool place, with a unique atmosphere designed to make you want to come back, options unique to Freddy's not commonly found elsewhere. I got a chicken sandwich with French fries, it was pretty good although I heard the onion rings were better. I reccomend it.",
   "My baby, wife and I stopped in to have lunch today and the restaurant was very busy. When I redeemed my free meal coupon I received from Veterans day the young lady upgraded my meal. Excellent customer service all around, our food came out fast and hot, 5 stars all the way! Keep up the good work!!",
   "Pretty good burgers and fries. I like the spicy fry sauce. This used to be my go to spot for fried dill pickles, but sadly they quit having them so I don’t go as often now.",
   "First time going. Ordered the chocolate shake and it was pretty delicious. Freddie's is a little pricey in my opinion. The restaurant appeared clean and there wasn't much if a wait.",
   "Fantastic burgers!!! The frozen custard concretes live up to the reputation. I love the fries. Cooked just right however overseasoned just a tad. Not to the point they're inedible though. Still delicious."
  ]
 },
 {
  "name": "Culver's",
  "address": "1920 Jefferson St, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/53ea9562-9331-11ea-89c5-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17089797162514836928",
  "source": "GoogleMaps",
  "reviews": [
   "Always have a great time. Food is very fresh. Ice cream is also very good. Building temperature was a bit cold, being January.",
   "One of my favorite places to eat in Jefferson City Missouri. Food is consistently great and service is even better! Owners are extremely friendly and Hands-On. The restaurant is always clean and well-kept, Landscaping is gorgeous. Can't say enough about how much I would recommend this restaurant to anyone!",
   "Got Ice Cream only. Will return to try a sandwich. They were very quick in the drive through and the lady at the window was very nice.",
   "The food was good yes, but the service was aweful. The lady at the window was very rude and the lady that brought us our food out we asked for ketchup and she said there's some in the bag and we said no there's not and she just walked off. We sat there for five minutes waiting for her to come back with ketchup and she never did so we had to go back through the drive through. Good food but we won't be going back.",
   "I had the mushroom swiss burger and it was excellent! The service was fast and friendly and the food was delicious!"
  ]
 },
 {
  "name": "Chipotle Mexican Grill",
  "address": "1400 Missouri Blvd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5437a414-9331-11ea-af0f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16464369418172811319",
  "source": "GoogleMaps",
  "reviews": [
   "Best food ever! The staff is super friendly and so fun to joke with while watching them prepare your food to perfection.",
   "First time here.. You go down the line and the workers serve you, Subway style but with Mexican food. So good and you get a lot. Was so hungry I forgot to get pictures but it was all good, especially the chicken. The seasoning was great, I would call it mild and robust not spicy :-)",
   "My favorite part about going into a Chipotle is that no matter if the line is long or short, the time it takes to get your food is always reasonable. With that being said, the only way this is achieved is if everyone cohesively works as one unit. This specific Chipotle needs improvement in this area.",
   "Burritos are great! Only issue is the amount of chips you get is pathetic. I got 13 total chips in my bag. For 2 people, this is a joke.",
   "I love chipotles food but terrible staff every time I visit this location in the evenings.  Tonight I was trying to place a to go order and online only let's you pay with a card. So I called and the guy was very rude and kept telling me I needed to download the app, which also only let's you pay with a card. I was just trying to get dinner with some cash. I completely understand if that's not possible right now but lose the attitude. I was originally going to just place the order with my card if that was what was needed but I'm not doing it now."
  ]
 },
 {
  "name": "Lee's Famous Recipe Chicken",
  "address": "1550 Missouri Blvd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/548d97f8-9331-11ea-bbea-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=193172879692940835",
  "source": "GoogleMaps",
  "reviews": [
   "Super friendly! Quick and good. Manager checked on us to make sure everything was good. And watched him help a lady bring her food to her table. Top notch place.",
   "It almost always fresh at this location if you go into the store, instead of the drive-thru!😉",
   "As I have come to expect from our local Lee's Famous Recipe Chicken, the Jefferson City location was great. The food was fresh and delicious. The service was prompt and friendly.  Unlike so many fast food restaurants I have eaten at, the tables were spotless. The location is easy to find and access.",
   "Was there at 1100am today, service great as always, but my chicken tasted like day old chicken  was dry and only warm not hot. Mine was crispy, my wife ordered famous, was dry,warm, and smelled like fish. Was our favorite chicken place.",
   "I enjoy Lees Children. The service is always nice and the food is good. Parking can be a little tricky but not bad.  Lee’s chicken is not the typical greasy chicken you get from other places.  It has a good flavor and nice crispy skin."
  ]
 },
 {
  "name": "Las Palmas Taquiera",
  "address": "510 Ellis Blvd suite f, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/54ed0746-9331-11ea-8e9b-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "hospitable",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4841006590507910655",
  "source": "GoogleMaps",
  "reviews": [
   "A cute, little Mexican restaurant. The owner was so friendly and polite. The food was delicious! I got the chicken fajitas. Usually chicken gets dried out in this dish but it was so juicy. Highly recommend trying this place out. You won’t be disappointed.",
   "The food was excellent and very authentic. The owners were incredibly friendly and personable. Highly recommended!",
   "The owners were extremely attentive, hospitable, and accommodating. The food was delicious, too! Jefferson City needed some authentic Mexican food!",
   "The food was good and very fresh. The owner was awesome. He even had a mango salsa that my wife and I tried. The place was very clean and neat. Prices wise was very reasonable. We will definitely go back",
   "If you want authentic Mexican food here in Jefferson City...THIS IS THE PLACE!!!"
  ]
 },
 {
  "name": "Sawaddee Thai Cuisine",
  "address": "2215 Missouri Blvd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/554f3b54-9331-11ea-a0ef-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "kids",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=16619616179447780988",
  "source": "GoogleMaps",
  "reviews": [
   "I’m am surprised at the relatively high rating for this restaurant. Coming from the west coast where great Thai food abounds, I can tell you this isn’t it. Hugely disappointed every time I have gone in there. I’ve finally given up.",
   "The food is delicious!!! \nThere is a wide selection.\nThe service was excellent. The waitress was very helpful and answered all of our questions.\nThe food was serviced hot and fast. \nIt you like Thai, this is a must stop in Jefferson City.",
   "They just reopened after a few weeks being closed.  I did not think this was near as good as the downtown location.  Had high hopes.  I ordered the sweet and sour chicken for lunch.  Very little chicken and I wanted a mild spice (4) but got one that was closer to a 7 or 8 instead.",
   "Freaking awesome. The food portions are a little conservative,  but flavor is amazing and the service is quick and kind. Reminded me of being at my grandma's!",
   "This is the place to go to when you want to treat your belly and your tongue to the best hottest food in town. You can get from zero to a hundred and heat intensity index, even at 0 the food is just spectacular. It is Affordable, family-friendly, and the kids will actually really like it. It has a wonderful assortment of appetizers that are simply to die for.  I recommend the potstickers, and my favorite is the jasmine rice with your choice of tofu, chicken, beef, or pork. You can also make a combination of two meats for your meal. They have yet to get my order wrong in all the many years that I've been going to both of their locations in Jefferson City."
  ]
 },
 {
  "name": "Big Whiskey's American Restaurant & Bar - Jefferson City",
  "address": "627 W McCarty St #1a, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/55af841e-9331-11ea-a1d3-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "free",
   "drink",
   "kids",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15916538459771598004",
  "source": "GoogleMaps",
  "reviews": [
   "I was hoping for a bit more from Big Whiskey. There wasn't anything wrong with it, but there certainly wasn't anything to get excited about either. It seems to be pretty popular as the wait was around 45 minutes and it took a while to get our meals, but the food didn't deliver for what I was expecting. \n\nI got the turkey burger and it was pretty boring. Others I've had that have been much better have used some pepper jack, Cajun spices, or guacamole to give it some life, but that definitely  wasn't the case here. \n\nMy daughter's mini shrimp were pretty decent. My other daughter got pasta with alfredo, but the noodles were drowned in sauce and she didn't like it much. My wife seemed to like her salmon pretty well.\n\nI'll give it another shot and try something different, but I'll temper my expectations next time.",
   "We (2 couples) had a good time at Big Whiskeys this past weekend during their Grand Opening. The FOOD and DRINKS were GREAT‼😊 They have a huge drink menu, they were running a special on $5 margaritas, which were very good! Their Whiskey Flights are an awesome way to try out several types of whiskey without spending a fortune. The men both tried the Bourbon Flight, it was a pretty cool presentation, picture attached.  Our waitress was very attentive,  even while they were extremely busy. The manager even visited our table to see how everything was and we told him it was great and how much we liked the place.\n\nFor those of you with families wondering about taking the kiddos, they are family friendly, they have TV screens everywhere, the KIDS have their own menu and they even eat FREE on TUESDAY NIGHT'S❗  \n\nMy friend and I went to the restroom as we were leaving and we were quite surprised. It was very CLEAN, even at midnight, especially after a very busy night. The only suggestion I have on this whole review, is for them to move the paper towel dispenser to the wall by the door. It is just a little awkward where its positioned right now.\n\nI like reading reviews, but I very rarely write one. Since Big Whiskey's is new in town, I felt a review was very important, whether it was GOOD😀 or bad, just to let other people know. We felt that everything went very smoothly Saturday night and we think Big Whiskey's will be a HUGE HIT in Jefferson City, MO.💕\n\nPS. For those late-night people out there, they're open from 12- 2 a.m.",
   "Absolutely the most welcoming experience during such trying times. Restauranat was limited to no more than 10 people, yet they let us wait with drinks in hand for available seating. We’d been driving for 450 miles so what a relief. \nSteak was perfect IPA awesome, service super friendly. \nThank you for your hospitality!\nDwight",
   "Really good food. Staff was friendly. Our server was there any time we needed something but wasn't hovering which is nice. The food was tasty. I had the nachos (it's labeled as an appetizer) and a brownie for desert. To be honest I didn't need the brownie because I was stuffed from the nachos. Thankfully when you get the brownie you can request more spoons so you can share! Overall a good experience and no one left hungry. It's a little on the pricey side and if I were a cook there I would season more while I'm cooking but like I said overall it was a win in my book.",
   "I only gave a 4 because the food was pretty good but not exceptional. Our service was great, though! They don't do reservations but they do offer \"call ahead seating\" which basically puts you in a queue and they text you when your table is ready, which worked well for us. Fun place overall and definitely would recommend/return."
  ]
 },
 {
  "name": "The Tigers Den",
  "address": "719 Jefferson St, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/56034e2e-9331-11ea-89c0-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "music",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2722736873455322019",
  "source": "GoogleMaps",
  "reviews": [
   "The pizza was good. The nachos were nothing special. The place seemed overpriced for the food they serve.",
   "Clean space, nice music and great food!  Our order came out in a very timely manner and the food was seasoned to perfection.  The owner was very friendly and welcoming.  My family and I will be back.",
   "Its ok cost alot for the amount of food u get enough to keep orderingsmall amounts for money but its ok",
   "Pretty good food. Great staff",
   "Best Jamaican food in town"
  ]
 },
 {
  "name": "Dairy Queen Grill & Chill",
  "address": "2114 Missouri Blvd, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/565f5126-9331-11ea-bd3f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "kids",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15492104554954017391",
  "source": "GoogleMaps",
  "reviews": [
   "My niece and I had chili dogs, onion rings and  chocolate milk shakes...the food was warm and delicious. The lady who took our order and brought our food was welcoming and warm like a country restaurant. I wish that I got her name, she totally deserves recognition! She is definitely a keeper!",
   "Use the App. Great deals.",
   "I asked twice for a breaded chicken ranch sandwich I didn't want the grilled chicken he said yes they had it I was waiting in line out in the lobby area and they bring me my food. not on a tray and not in a bag I just bring me the two sandwiches I ordered one of them being wrong there's a grilled chicken instead of breaded chicken and not even a to-go bag there are a bunch of kids just playing in there basically I understand it's Friday night and kids get worked up and and get a bunch of them together but somebody needs to get a grip on that crew for real. The cooks we're talking about it being a Japanese fish sandwich whatever that meant just very unprofessional",
   "Great ice cream, of course. It is a lot pricier than it used to be, but the food is still good! ",
   "I was not pleased with the drive-through service about 4pm yesterday.  The person taking and giving the order seemed to care less.  The food was just shoved out the window without the server saying one word to me.  I got home the fries were cold from being not cooked properly and the burger was old."
  ]
 },
 {
  "name": "Texas Roadhouse",
  "address": "3104 S Ten Mile Dr, Jefferson City, MO 65109, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/56b3d92e-9331-11ea-838e-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "delicious",
   "free",
   "unique",
   "food",
   "music",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8218147997768735391",
  "source": "GoogleMaps",
  "reviews": [
   "We had great service and great food! Our hostess was talking to us all the way to our seat, and was so friendly! Then we met our waiter, Will, who was SO enthusiastic and friendly! Even though it was 2 pm on a Saturday it was very busy, but Will was constantly coming by our table to ask how everything was, and to clear plates! I told my daughter that he should do commercials for the restaurant, because he was so knowledgeable about each and every item on the menu! Great service = a great tip! We’ll definitely be back!",
   "Surprisingly good!\n\nI really enjoyed the prime rib.\n\nGreat sides. \n\nDelicious free dinner rolls and bucket of peanuts.\n\nFriendly service. \n\nComfortable seating and pleasant atmosphere. \n\nCan accommodate large groups. \n\nGenerous size waiting area. \n\nThere’s also a bar.\n\nConvenient location. \n\nPlenty of parking.",
   "I have heard wait times can be more than a little on the long side. When I arrived the waiting area was packed. As a party of two the hostess suggested we try the bar if we didn't want to wait for a table.\nWe were seated at the bar and greeted by Jess who has such a warm and bubbly personality she either really loves her job or may need professional help.\nDrinks were prompt and proper. She provided options most other bar tenders don't consider. Refills were spot on. Our bread was delivered quickly, the following courses were delivered exactly when needed.\nI had the Road Kill. The only thing I can say about this dish is that if it was any more tender I would have needed a spoon.\nUntil today I thought Ruby Tuesday had the best steak in town. Sorry Ruby's, your steaks are great but despite the valiant effort you have been dethroned.\nJudging by the others seated around me my experience was not unique. Several steaks were ordered. One gentleman remarked that his baked potato was the best he had ever had.\nAt the end of my meal I was stuffed to the point I thought a crane would be required to remove me.\nPricing is comparable to other steak houses in the area.\nMy advice to make the experience better would be to lower the volume in the restaurant 20% and open for lunch on weekdays. Otherwise, bravo.\nNow, if you will excuse me I need a nap.",
   "First, we had the best server I have ever had anywhere, hands down, Will.  He was very friendly and checked on us just the right amount of times.  This man deserves a raise/promotion.  The food was really good.  The music was a little loud to talk (we had a large group) but we dealt with that.  William received a large tip for his awesome service.....Texas Roadhouse, you better keep this one on staff.)",
   "Great atmosphere, awesome service and fantastic food. I will advise to get there as soon as the doors open (4pm) Monday through Friday (11am) Saturday and Sunday as the place fills up fast but well worth the money and wait. Our server was extremely friendly as was everyone else who worked there, we were greeted by every employee we came in contact with on our way to be seated and also everyone said bye and gave a good night on our way out. It was an awesome place to have a family dinner"
  ]
 },
 {
  "name": "New China",
  "address": "905 Eastland Dr, Jefferson City, MO 65101, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5718b59c-9331-11ea-afb9-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "music",
   "food",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15430014228739649635",
  "source": "GoogleMaps",
  "reviews": [
   "The food here is remarkably good, and the lunch specials are very cheap: a big portion of main dish, fried rice, and an egg roll for under $6. I really like the Orange Chicken, and always get the fried rice St. Louis style (just ask, no extra charge). The buffet is good too for its relatively small size. Be prepared for a really odd mix of music they play... it run the gamut from heavy metal to Enya. 🙄",
   "Food has a funky aftertaste, food overcooked, barely a selection. This would not pass as a 4 star restaurant anywhere and as a visitor to this city I am sorely disappointed in what passes for a 4 star. This place is a 2 star at best. The food is awful, and there's absolutely no service . 10/10 don't recommend, don't waste your time or money. Better off going to Subway, at least you might be happy with the results.",
   "My fiancé and I decided to eat here on a whim. As soon as we walked in, the atmosphere was really cold and dark. The cashier was extremely rude and impatient and acted as if he didn't want to be there. Not a good first impression. Then we walked into what looked like a banquet hall with booth seats just smushed together all over it with horrendous lighting... instead we opted for one of the smaller tables by the buffet. The food wasn't awful but it wasn't fantastic either. We both ordered the sesame chicken combo with crab rangoons. Not bad, but you could tell that it wasn't cooked with care. We probably won't be going back.",
   "Food was not impressive at all. Will not return",
   "Cold food, told this was all they were making at 12:37, rude cashier, small amounts of food to choose from, dirty floors, dirty tables, bathroom is very Grimmie and not enough for a $11.00 buffet for lunch??? I don't think l will be back!?"
  ]
 }
]