[
 {
  "name": "Mendenhall Glacier Visitor Center",
  "address": "6000 Glacier Spur Rd, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/57773528-9331-11ea-85d6-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=1364429193881011916",
  "source": "GoogleMaps",
  "reviews": [
   "Very informative visitors center with excellent views of the glacier.  Videos showing melting of the glacier over the years and other glacier info.  Specimens of local wildlife on display.  Nice little gift shop.  Clean restrooms.  Well-informed rangers give short presentations and answer questions. Completely disabled accessible,  with captioned videos,  and an elevator from the lower level.  Highly recommended!",
   "Go see it while it's still there! Climate change is destroying this glacier. The staff and viewing areas are really amazing. They provide telescopes and knowledge about the area. They also have videos and interactive displays. If you hike the area you'll be able to see all the places the glacier used to be, and you can take really nice shots all around the area. They have live salmon spawning in the area, and other wildlife. It's very untouched by man. Very wonderful experience.",
   "Get ready for crowds! It’s a great starting point to find out more about the park and local trails.  The rangers were helpful. The gift shop was small, but adequate. \n\nIf you are trying to get your Junior Ranger badge make sure you download the Agents of Discovery Badge app first.",
   "Beautiful site, informative ranger, and well maintained.  I enjoyed our brief stop here at the visitors center after walking out to Nugget Falls and getting a closer view of the glacier. I recommend stopping at the visitors center before the hike, however it was nice to stop in and warm up afterward.",
   "Very nice trails and guest center. I found the map of how the glacier has receded and formed new bodies of water and the salmon birth/death route exhibit the most fascinating. Highly recommend going there if you're in the area. Lots of small plane flights to see from the sky too closer in town, but we didn't do that."
  ]
 },
 {
  "name": "Alaska Zipline Adventures",
  "address": "76 Egan Dr UNIT 100, Juneau, AK 99801, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/57e2e602-9331-11ea-a210-14b31f159f22.png",
  "tags": [
   "walk",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=6648845768540759093",
  "source": "GoogleMaps",
  "reviews": [
   "Are zip line guides Julian and Hannah were great and very professional. they were also friendly and very safety conscious. we had a member of our group who is extremely nervous and they were able to work with him so that everyone had a great time.",
   "It's a fun experience. The guides were wonderful.\nI just imagined it will be more time zipping....\nIt was 4 ziplines and one bridge to walk.\nThe thing was that each zipline lasted about 10 seconds.... and waiting was very long time.\nI expected to be more time in the air...\nI guess that for people that it is their first time it will not be dissapointing as for me.",
   "I loved every minute. Guides were fantastic. Andrew was phenomenal. I want you to know I accidentally dropped my phone in the van on way back to ship and as I was frantically looking for it in my backpack at the drop off here he comes in the van. He came back to bring me my phone. Thank you Andrew. I will never forget you.",
   "This excursion was amazing!!  Julianne and Andrew were so much fun!  Knowledgeable, funny, and nothing but smiles!!",
   "This was the highlight of our Alaskan cruise!  Best zipline experience we've had.  Incredible views and great staff."
  ]
 },
 {
  "name": "Alaska State Museum",
  "address": "395 Whittier St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/585d51d0-9331-11ea-b321-14b31f159f22.png",
  "tags": [
   "unique",
   "history",
   "history",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=3685768648498809745",
  "source": "GoogleMaps",
  "reviews": [
   "Very elegant display in the rugged setting of Juneau.  The history on display is unique to the natives of Alaska and additionally introduces the fishing industry and how it has revolutionized salmon processing in the port communities.  I included some snaps of the lovely gift shop as well.",
   "I'm from Juneau and really impressed with the new Museum. It's really great to have to teach people about the state, it's indigenous peoples and history. Strongly recommend a visit.",
   "A beautiful place to learn about the last frontier.",
   "One of the best state history museums I've ever seen...and I'm a certified historian.",
   "Many good artifacts"
  ]
 },
 {
  "name": "Glacier Gardens Rainforest Adventure",
  "address": "7600 Glacier Hwy, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/58cb164c-9331-11ea-8276-14b31f159f22.png",
  "tags": [
   "walk",
   "tour",
   "unique",
   "knowledgeable",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=1726611403407061256",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful gardens and tour but the only downside is they don't give you time to take photos along the way on the tour. They take you through the park in a covered, open on the sides \"stretch golf cart\" type of vehicle, but they don't tell you that it's just to give you an initial overview of the property, and not meant to be a photo opp tour. At the end of the tour, we were told we had all day to take photos and walk the grounds but it's a long way and very steep. I guess it would have been fine if we would have planned our time accordingly and knew to make a day trip of hiking out of it, but we didn't know this ahead of time. Otherwise, great tour and gardens.",
   "Simply beautiful with stunning views of the harbor. \n\nUpside down trees with planted flowers are unique and you can tell that the owner, Steve, puts his heart and soul into the property. It must be contagious because all of the staff seem excited to be there, it truly shoes.",
   "Fabulous place to visit. Rainforest, botanical gardens and views. Excellent guides with knowledgeable and passionate narration. And to top it all - an eagle's nest with two nearly mature young. Like I said - fabulous!!",
   "Nice facility. Had a tram ride through the rainforest. Stopped at an observation platform 500+ feet above sea level. Saw several eagles. The \"upside down\" trees were very interesting. Beautiful showcase of the forest. Visitor center has a small gift shop and offers drinks and snacks for sale. There are tables and chairs available in a covered area.",
   "The story behind this garden is what makes it amazing.  The owner is also the gardener and creator of everything you see. His heart is everywhere you look as you tour this beautiful garden.  There were also Eagle chicks just born in a nest on his site. He has developed a true haven and natural habitat for the plants and animals."
  ]
 },
 {
  "name": "Tongass National Forest",
  "address": "Juneau, AK, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/592cb4f8-9331-11ea-b28b-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=9379582080267153963",
  "source": "GoogleMaps",
  "reviews": [
   "All I can say is that you wont be disappointed, terrific flora and fauna and fantastic views. Dont miss it as it is very convenient to Tacoma and probably one of the great local and tourist spots in WA state.",
   "Such a beautiful place. Such a shame that our President just signed a paper allowing his rich friends to cut it down. Please take a stand and call your Congressman.",
   "Peaceful and stunning. We took the cable car into the lower regions and used leg power to ascend. This was summer 2019 and weather was warm and welcoming. We stalked an eagle and got up close and personal. Beautiful area.",
   "Wonderful walk through the forest.  Peaceful definitely a place you should visit at least once in your life.",
   "This place is special to my heart. It’s purely gods country no doubt in my mind. Respect it and keep it clean. The most sacred place on earth. It’s the last quiet place on the planet. Everything feels alive within."
  ]
 },
 {
  "name": "National Shrine of St. Therese",
  "address": "21425 Glacier Hwy, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/599ba20c-9331-11ea-8a84-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=2683886745619494545",
  "source": "GoogleMaps",
  "reviews": [
   "Marvelous location! Constructed in 1938, this somewhat isolated peaceful chapel / shrine commemorates Saint Theresa. It is located outside Juneau with easy access from the Main road. There are cabins of various sizes to rent on the compound for family or groups to rent. Absolutely amazing scenery!",
   "The cabins are incredible, peaceful and cozy.  Everything is very well taken care of.  It's a great place to get away from it all for a few days.",
   "So spiritual, so beautiful, view is one of the best, and the community built labyrinth was lovely.",
   "Beautiful place! Kind of creepy, and has a weird feel to the inside of it, but still a must see for Juneau. I go to the Shrine often.",
   "Absolutely beautiful place to visit.  Plan to stay a while, there is lots to see and enjoy.  The church is small but very charming.  The lookout is amazing.  A great place to whale watch at the right time.  The whole environment is peaceful and inviting.  Highly recommended!"
  ]
 },
 {
  "name": "Juneau-Douglas City Museum",
  "address": "114 W 4th St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/59f31140-9331-11ea-a264-14b31f159f22.png",
  "tags": [
   "history",
   "knowledgeable",
   "family",
   "art"
  ],
  "link": "https://maps.google.com/?cid=13946863849189608512",
  "source": "GoogleMaps",
  "reviews": [
   "Small but interesting. Went after the summer season so white empty and things the chat with the staff a little... Very warm and enjoyed chatting.\nEnjoyed the interactive opportunities for children.",
   "Wonderful little museum. We found pictures of our ancestors that attended Douglas High school. They brought up annuals from storage for us to look through.",
   "Cute small museum way up on the hill. Not a Nessesary attraction but cute and fun.",
   "Small museum with history of the city. If you have time to spare, it's worth the trip. Otherwise, I would rather visit the Capitol building next door",
   "Quaint and highly educational City Tours Tuesdays, Wednesdays, and Thursdays from 1:30-3:00 P.M. (May-September). Friendly, knowledgeable staff. Small, well curated museum. Great for the whole family. Trendy gift shop with interesting local art, books, and gifts."
  ]
 },
 {
  "name": "Point Bridget State Park",
  "address": "Juneau, AK 99801, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5a60744a-9331-11ea-bb56-14b31f159f22.png",
  "tags": [
   "walking",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=8308007664569825079",
  "source": "GoogleMaps",
  "reviews": [
   "Great hike/walk. It was easy, and really nice!",
   "Beautiful Mendenhall Glacier. Also visited Nugget Falls. Very nice walking trails and gorgeous views.",
   "Point Bridget State Park was created in 1988 as a gorgeous \"state park for the state capital.\" There are year-round trails for hiking and cross country skiing, as well as fishing and boating opportunities. Three public-use cabins are available for rent, one of which (Blue Mussel Beach Cabin) affords breathtaking views of Berners Bay, where marine birds, whales, seals, and Steller's sea lions abound. Not to be missed!!!",
   "It's absolutely gorgeous on the trail and getting to the beach side is worth the hike the view is amazing",
   "Good hiking spot, trails were improved last summer."
  ]
 },
 {
  "name": "Juneau's Best Tours",
  "address": "230 S Franklin St #906, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5add31dc-9331-11ea-a8bb-14b31f159f22.png",
  "tags": [
   "delicious",
   "tour",
   "food",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=15408090713996072990",
  "source": "GoogleMaps",
  "reviews": [
   "This was an awesome trip.  The float plane tour was informative and interesting and not as loud as u would think but was very hot.  The food was delicious  and the people nice.  Definitely worth the money and time.  The black  ears was an unexpected  bonus.  We saw 3 ranging in size.",
   "Who does not love a glacier?",
   "Awesome glacier and waterfall. Take time to hike it if you can. Hike is well marked and easy to follow.",
   "This was a great stop during our cruise.",
   "Great stop"
  ]
 },
 {
  "name": "Last Chance Mining Museum",
  "address": "1001 Basin Rd, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5ba8bfbe-9331-11ea-a28d-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "kids",
   "walk",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=2898756723364087391",
  "source": "GoogleMaps",
  "reviews": [
   "Preserved bit of history. A long but beautiful walk from town if you are up to it. You get a good picture of what it was like for the miners.",
   "This was a fun little last minute adventure we took. The kids loved it!  The views alone are worth it",
   "Quick walk through an old mining building with artifacts.  $5 tix per person, but justifiable since it goes to a good cause.",
   "Different. Don't bring toddlers- too many safety issues. Not a handicap friendly location. More for able bodied adults.",
   "Historic mine.  You can pan for gold like the old prospectors did during the Alaskan gold rush"
  ]
 },
 {
  "name": "Eagle Beach",
  "address": "Juneau, AK 99801, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5c176088-9331-11ea-849b-14b31f159f22.png",
  "tags": [
   "free",
   "walking",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=14386075104028307561",
  "source": "GoogleMaps",
  "reviews": [
   "First time to Eagle Beach during the winter (really my first time to Juneau at all) and we had a blast. It was beautiful during sunset and enjoyed playing with pieces of ice washed up on shore. It was like I was a kid again!",
   "Great location for a quick getaway from the busy city life. About 35min from downtown offering  solitude and gorgeous views with covered picnic areas, grills and public restrooms. Bring water and firewood and something to throw on the grill and you will have a fantastic time camping for free or just spend your day in the last frontier.",
   "Beautiful beach for a picnic or walking. Excellent wildlife viewing. Ample parking and everything was clean. An easy drive from downtown. Eagles and bears are very frequent sightings here.",
   "Beautiful day for a dig walk at Eagle Beach.",
   "Very quiet walk, enjoyed. Did not see many eagles"
  ]
 },
 {
  "name": "Aj Mine Gasteneau Mill Tours",
  "address": "500 Sheep Creek Mine Rd, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5c711980-9331-11ea-aada-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=4352226991343849551",
  "source": "GoogleMaps",
  "reviews": [
   "This place has history and adventure to share with everybody. The people that share there experiences were the workers from that mine. Is been talked that they want to invest on it to re-open it and continue exploiting it. The owner of the place is the one that you can find on the souvenir shop. Get some souvenirs and enjoy the tour.!",
   "This is an amazing tour! The underground portion shows how gold was mined in the 1800s, how technology improved the process in 1930, and again in 1980. The above ground portion showed methods used to remove gold from the ore, and gave us a chance to pan for gold.",
   "It was fun to see how gold was mined years ago. Worth the time spent!",
   "Great experience en great guides that explained their daily life in the mine.",
   "Came here while in town on a cruise ship in Juneau and had a great time.  Fun little mine tour.  At the end they teach you to pan for gold from the tailings from the mine and you get to keep the gold! I got like 10 flecks and was stoked on it!"
  ]
 },
 {
  "name": "Wings Airways & the Taku Glacier Lodge",
  "address": "2 Marine Way #175, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5ce0a45e-9331-11ea-bfe0-14b31f159f22.png",
  "tags": [
   "delicious",
   "hike",
   "eat",
   "food",
   "walk",
   "tour",
   "food",
   "nature",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=10990242134610053375",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing excursion out of Juneau! Combine the seaplane with the lodge at the glacier and it’s hard to surpass this travel experience! Thanks to Bruce our skillful and friendly pilot and the staff at Taku Lodge. The scenery of the flight is a must of any Alaska trip. The remoteness, scenery and food at the lodge were amazing. The lodge staff prepared salmon on an open grill (afterwards a juvenile bear climbed in the fire pit to eat salmon flavored sand) which was delicious along with rice, beans, slaw and amazing bread and the best ginger cookies I’ve ever had. They offer a full but limited bar as well, a fun gift shop and a short guided hike to a water fall. The staff at the lodge were so friendly, thank you for a great experience and kudos to the chef! Sit down in a chair there and enjoy the view and fresh air:)",
   "Second visit there. I love it here. Very peaceful when the planes have left. Staff are awesome. Scenery is gorgeous. If you’re lucky the bears will come out for photos. I highly recommend this place.",
   "Best excursion of the trip! Starting out with the sea plane over and the tour of the glaciers to the incredible food and having it cooked fresh on an open fire to the nature walk around the property; worth every penny and then some!",
   "This was by far the best excursion I took! The flight over the glaciers was awesome, they are incredibly beautiful, and their expanse has to be seen to be fully appreciated. Taku Lodge is lovely, and the meal was fabulous. The bear, Lois, who came to clean up the grill, was one of the high points. The walk afterwards is recommended but bug spray is a must!! The mosquitos are HUGE and swarm in numbers beyond belief. The grounds are very scenic, and the staff both at the lodge, and at Wings, is terrific. I HIGHLY recommend!",
   "Our pilot's name was Bruce. He made us feel safe and showed us so many beautiful sites. He was the nicest man, and if we ever get the chance to fly with Wings Airways again, we would request Bruce as our pilot. He pointed out many different points of interest to make sure we would see them and get pictures of them. We are so grateful for the opportunity we had and that Bruce was our pilot."
  ]
 },
 {
  "name": "Capitol Building",
  "address": "120 4th St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5d363eb6-9331-11ea-a543-14b31f159f22.png",
  "tags": [
   "tour",
   "art",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=3044098133364785636",
  "source": "GoogleMaps",
  "reviews": [
   "This is the Alaska Capital Building in all its Glory. More recent renovations added some phenomenal art work. It really is a museum in many respects. There is a lot of Alaska history on the walls and they do tours on Monday through Friday during normal business hours\n. I had the opportunity to tour the building with my Boy Scouts recently. It was a phenomenal tour the was very interesting and educational. A must visit!",
   "There was not a tour guide nor was there a self guided tour pamphlet that we could find. This makes it harder to understand exactly what is what there and why things are they way they are. I have toured several other state capitol buildings so I understood a bit more. It was interesting to see the difference in Alaska's capitol building versus other states. This could be a quick stop or a long tour after 2 floors things start to look similar. You can look online to see if the are in session during your visit. Definitely worth a quick visit though!",
   "The Capitol is such a beautiful place!!! It's one of my favorite places to visit in Alaska.",
   "The building was great. I saw Senate Lyman F. Hoffman.",
   "This place is usually open to the public and is a fun stop while here on a cruise."
  ]
 },
 {
  "name": "Saint Nicholas Russian Orthodox Church",
  "address": "326 5th Street Stairs, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5da22012-9331-11ea-8cab-14b31f159f22.png",
  "tags": [
   "walk",
   "tour",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=3601572368564209454",
  "source": "GoogleMaps",
  "reviews": [
   "Worth a quick walk up the hill and only a (almost flat) block from the capitol building. Interesting architecture, they have tours 12-5 Monday to Saturday as long as they have volunteers to tour the inside but still worth a look at the outside even if you can't get there during tour hours. Volunteer that we met was super nice!",
   "Nice little church with unusual architecture. Worth having a look during a visit to Juneau. If you are lucy and can get a look inside, make sure you do it with some sensitivity to those who may members of the community there.",
   "This church is so aesthetically pleasing that I've decided to convert to Russian Orthodox, effective immediately.",
   "Very nice little church, over 100 years old. They have a nice little memorial for the interned citizens of Alaska from the second world war.",
   "If you have the time, it is worth the walk up the hill. Very pretty church. They were closed by the time we arrived but still was very pretty."
  ]
 },
 {
  "name": "Eaglecrest Ski Area",
  "address": "3000 Fish Creek Rd, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5df65aba-9331-11ea-9609-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=12122449719610948238",
  "source": "GoogleMaps",
  "reviews": [
   "Love that they are doing what they can with little or no snow before Christmas . The new bar has a beautiful wooden counter and bar lady is nice . Also the have a new lift called black bear .",
   "Runs were groomed and well marked, friendly chairlift staff and lesson instructors. Kids had a blast!",
   "Best ski resort in the USA. For more detail, honestly with the limited resources given, and weird snow patterns in SE Alaska, Eaglecrest offers world class terrain that's right under a freaking lift, and so much more within crazy easy hiking and skinning range!",
   "I didn't ski here, but I did do the zip line course and it was a blast.  The 2 guides working with our group were fun and entertaining while also making sure that safety was 100% in mind.",
   "Amazing ski area"
  ]
 },
 {
  "name": "Mendenhall Wetlands State Game Refuge",
  "address": "Juneau, AK 99801, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5e4abcc0-9331-11ea-9ab0-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=11652217955602782061",
  "source": "GoogleMaps",
  "reviews": [
   "Mendenhall Wetlands is definitely a beautiful place to see. Recommend taking bug repellent with you in the summertime.",
   "Well-managed excellent trails. Spectacular views and lots of wildlife. Black bears feeding on salmon, numerous bald eagles, large porcupines lush green girls and flowers.",
   "Gorgeous sunrise... the mountains lit up beautifully!!",
   "Beautiful place open to the public.  You can see all types of birds.  A lot of eagles in this area. Bring a camera",
   "Easy walking trail with beautiful views of glaciers and mountains. My two year old enjoyed the plane and helicopter fly overs."
  ]
 },
 {
  "name": "Treadwell Mine Historic Trail Walking Tour",
  "address": "Treadwell Trail, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5eafe850-9331-11ea-8a13-14b31f159f22.png",
  "tags": [
   "historic",
   "walk",
   "walk",
   "hike",
   "walk",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1477263914162229029",
  "source": "GoogleMaps",
  "reviews": [
   "Easy trail with access to Sandy Beach.  Live the historic plaques, wish there were more!  Many good spots to read - bring a book!",
   "Located just over the bridge from Juneau on Douglas Island, the trail follows the shore just inside the tree line. Wide mostly gentle walk path commemorates the once large gold mining industry. There are points of interest along the way where the miners onced worked and played. There is also a beach area where you can watch various ships, including cruise liners coming and going from Juneau.",
   "While we did not actually do the trail, we did walk up to the entrance of one of the abandoned none shaft entrances. As you walk towards it the temperature drops and you can feel the rush of cold mountain air got you as you advance. Hopefully I'll be able to go back and hike the trail, but there were many locals there saying it's a very nice trail walk.",
   "Very Interesting History and a peaceful walk. Highly recommend to anyone. Easy trail for young and old alike.",
   "It's very well done, making a maintained feature out of a bunch of ruins that could have been otherwise forgotten."
  ]
 },
 {
  "name": "Patsy Ann Statue",
  "address": "Harbor Way, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5f15ae3e-9331-11ea-ae98-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=10560144563931075634",
  "source": "GoogleMaps",
  "reviews": [
   "A must stop in Juneau for any dog lover is to pay homage to Patsy Ann, she was and continues to be the \"Official Greeter of Juneau\". While deaf from birth, Patsy Ann had the ability to 'hear' steamship whistles and never failed to greet a ship. Patsy Ann died in 1942 but her presence is still here in this statue. Visitors are encouraged to \"greet her and touch her and in leaving, carry with you the blessings of friendship through your life's journey.\" Thanks Patsy Ann!",
   "The statue commemorates the local dog, Patsy Ann. The story goes that she was a local dog that preferred to roam around the town, than be at home with her owner. She became a welcome and popular fixture around the city. \n\nPatsy Ann had the ability to know when the steamship was about to arrive, running down to the dock to wait long before anyone else knew a ship was coming. \n\nThis statue sits next to the cruise ships, so  you should pass it to or from the ship. Her nose shows signs of rubbing, so giver her a pat when you go past.",
   "Friendly  visual history of one of juneau's favorite citizens",
   "Kewl story",
   "A surreal and serene place for photography. If you're lucky, you get Orcas and Humpbacks swim closeby."
  ]
 },
 {
  "name": "Liquid Alaska Tours",
  "address": "212 Admiral Way #4, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5f93df90-9331-11ea-ae02-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "hike",
   "knowledgeable",
   "tour",
   "walking",
   "walk",
   "tour",
   "walking",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=5399857194681036402",
  "source": "GoogleMaps",
  "reviews": [
   "Ryan and Spencer were very knowledgeable, professional and really fun tour guides. They were full of facts about the lake and glacier and also shared many funny jokes on the canoe to and from the glacier. This really helped us forget we were paddling 2.5 miles one way. Being able to hike on the glacier is a once in a lifetime experience, well worth every penny. Will recommend this to everyone I know travelling to Juneau.",
   "Absolutely terrific experience, on a group canoe adventure on Mendenhall Lake.  I don’t usually warm up to guided excursions but these guys did everything right.  Quality gear, awesome included snacks, great equipment and very personable, prompt and trustworthy staff!",
   "The excursion I went on was canoeing to and then walking on the Mendenhall Glacier in Juneau, Alaska. Our tour was led by Ryan and Grant in the first week of June, who were both very knowledgeable and funny. Ryan, in particular, has a fun-loving spirit that was infectious. They kept saying how perfect a day we were having in terms of temperature, weather, and wind. And it was certainly great. On the hour-long, single large canoe ride over there were great views of Nugget Falls and Thunder Mountain. The guides had lots of information about the local wildlife, other trips/hikes, the timeline of the retreat of the glacier, and other notable tidbits.\n\nGetting in and out of the canoe was easy and the tour provided absolutely everything you'd need or want. Anyone who is not in bad shape would be able to do this tour fairly easily. There is walking with some elevation involved.\n\nWe walked up to the glacier over a rocky moraine and put the crampons on. I had no issues whatsoever with slipping with these on. Saw all the notable features that were accessible that day, the glacier changes constantly. But just being up there and on it, seeing the vastness out before you was worth it on its own.\n\nGrant was nice enough to get me a bottle full of glacier run-off water which I still have (thanks to checked luggage). I hope Ryan has upgraded his own glacier water's container by now. To cap things off, on the boat ride back, we got an extended close-up view of the porcupine that lives on an outcropping of land. My first one I've seen in the wild. Finished up with some hot cocoa back at the van. Great day.",
   "Excellent experience! Our guides Casey and Joey were friendly and knowledgable. The canoe trips out and back went quickly, and our guides did a nice job pointing out noteworthy wildlife and geographic features. \n\nOnce we reached Mendenhall Glacier, they gave us a super-helpful safety briefing showing us how to properly walk on the ice. \n\nOur guides gave us plenty of time to savor walking onto the glacier as well as exploring an ice cave. We had much more time on the ice than on a helicopter tour.\n\nAll in all, it was a wonderful experience and we highly recommend it to anyone wanting to see a glacier up close.",
   "The tour was incredible. Ben and Grant were wonderful guides, very well informed, pleasant and patient. We canoed to the glacier and walked out on it. The views were spectacular and one of a kind and we had hot drinks waiting for us after. I would definitely recommend this tour company, great value for the price."
  ]
 },
 {
  "name": "West Glacier Trailhead",
  "address": "Skaters Cabin Rd, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5fe42290-9331-11ea-9d3c-14b31f159f22.png",
  "tags": [
   "hike",
   "walking",
   "hike",
   "hike",
   "walking",
   "hike",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=14196447721025830837",
  "source": "GoogleMaps",
  "reviews": [
   "Really fun hike. Be careful going off trail. Avoid scrambling up the side of the glacier when you get close. It gets pretty dangerous. As well as walking on melting ice. Amazing views and decent caves",
   "Sign says it's maintained. Well it is up to a certain point then it becomes a 5.10 wall climb . Just kidding but It's not an easy hike if you want to make it all the way to the end of it.  About 40 minutes from the trail head you will have fantastic view of the glacier the mountains Mendenhall Lake and the valley . You might also see some beautiful vibrant colored blue birds. Just do it",
   "AMAZING TRAIL. Take the outlook trail when the trail splits. Make sure you snap a picture of the map! It is a somewhat difficult hike. I would say not the best hike to do in the rain.",
   "Great views! Great place! Must go here, total bucket list item. Walking on a glacier is surreal!!",
   "A great moderate to strenuous hike especiallyduringthe winter months...lots of climbing walking, glasading on ice. There are 3 places that have a rope attached to a tree to assist with the hike.  Trails are maintained for about 3 miles...after that highly suggest downloading the url that is provided at one of the stops along the trail.  Remember to bring your ice tracks, gaiters and hiking poles...will make the hike easier."
  ]
 },
 {
  "name": "Shrine of Saint Therese",
  "address": "21425 Glacier Hwy, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/60566c90-9331-11ea-97bd-14b31f159f22.png",
  "tags": [
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=8216044508208870330",
  "source": "GoogleMaps",
  "reviews": [
   "AMAZING! This place is so humbling, centering, peaceful, and spiritual. If someone is struggling with a relationship with God, this is the place to find yourself and your relationship with God; surrounded by the beauty He created. The chapel is beautiful, the stations of the cross are simple, and the location is humbling and creates an environment to become one with your spirituality.",
   "Parking lot number on is next to the cabins and church. It's a beautiful walk and just mesmerizing. I almost didn't make it due to schedule and I am so thankful that I did. Absolutely amazing.",
   "So beautiful. So peaceful. You can really feel God's presence.",
   "Beautiful,  serene...wonderful place to rejuvenate the mind and soul",
   "Peaceful place off the beaten tourist path. Tribute to the patron saint of Alaska and Russia. The stone church overlooks a bay where whales can be spotted. We didn't see any during our time there but still worth the visit. Free parking. Donations are encouraged."
  ]
 },
 {
  "name": "Steep Creek",
  "address": "Glacier Spur Rd, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/60d5af18-9331-11ea-9e14-14b31f159f22.png",
  "tags": [
   "walk",
   "free",
   "walk",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=6627463788084044944",
  "source": "GoogleMaps",
  "reviews": [
   "Steep Creek is an elevated walkway area where you can view bears in their natural habitat where both the humans and the bares can rest assured of not directly coming into contact.\nHalf the trail is closed during the weeks of the Salmon Run (Mid July - August).\nFor best chances of seeing a bear, go during the salmon runs, around 6am or after 7pm, when the cruise ship crowds die down.  Walk very quietly to not startle them away.",
   "Wooden walkway adjacent to the parking lot for Mendenhall. Not to be overlooked or missed especially during Salmon season where you can see fish and bears. It's like you hiked quite a bit to get to a spot of respite when it's just beside your car. Plaques explain everything you need to know. Free.",
   "To walk under the glacier is wonderful experience.  This glacier is the only one that is close to a city.",
   "One of the best experiences in Alaska! It's nature at its best!",
   "Got to see a couple of bears at sundown!"
  ]
 },
 {
  "name": "Cope Park",
  "address": "Cope Park Rd, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/61299bae-9331-11ea-956f-14b31f159f22.png",
  "tags": [
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=1758791035384255521",
  "source": "GoogleMaps",
  "reviews": [
   "Great place with a playground and access to a stream. Good place to let small children off a cruise burn off some energy since it’s only a 10-15 minute walk from the port.",
   "Wonderful sights, good for exercise.",
   "Great place for my dog to play with other dogs. Easy to get to. Usually extra toys laying around and people are chill so the dogs are chill. Pretty area, up to date. Lots of parking. Neat  double fence system so you can get in with your dog and the other dogs don't run out. Or if your dog wants a second to sniff the other dogs before they all start mobbing the gate and playing around.",
   "Incredibly beautiful park I. Downtown Juneau. play ground trails running River straight from the snow pack.",
   "I love this park, however, seems like there's stalkers that like to hang out here. Caught one parked directly behind my car that sped away when they saw me walking back to my car."
  ]
 },
 {
  "name": "Savikko Park",
  "address": "101 Savikko Rd, Douglas, AK 99824, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/61879a62-9331-11ea-abd9-14b31f159f22.png",
  "tags": [
   "hike",
   "history",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=3850870098119881265",
  "source": "GoogleMaps",
  "reviews": [
   "Fun! We had no idea this place was here. (We're fresh off the ferry!) Great little hike with fun finds.",
   "Really nice kid and dog friendly beach, the waterline is very long and shallow so you can wade in and there's historical treadwell mine trails just a few feet into the forest. There's also the famous treadwell pumphouse that local artists and photographers have captured and displayed all over town.",
   "WOW!  Lots of history on this beach and way scenic and windy. Take your camera, a warm coat, hat gloves and Dido too!  It's a doggies off leash paradise!",
   "This was such a nice place to have an outdoor gathering after our wedding ceremony and reception.  We rented a shelter and had a fire and such a great time.  Unfortunately, you have to vacate the premises by 10PM, but we were able to move the fire to the beach and the festivities continued.",
   "Know as sandy beach dog friendly and a great place for enjoying the summer day. Walk along the path and discover the old abandoned mine building's.."
  ]
 },
 {
  "name": "Alaska State Capitol",
  "address": "120 4th St, Juneau, AK 99801, USA",
  "avg_visitor_review": 3.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/620d4564-9331-11ea-ab10-14b31f159f22.png",
  "tags": [
   "tour",
   "knowledgeable",
   "free",
   "art"
  ],
  "link": "https://maps.google.com/?cid=16245751141505312900",
  "source": "GoogleMaps",
  "reviews": [
   "I had a awesome experience touring around the captial building.it is tourist friendly and filled with a lot of information.",
   "Since the epicenter was very close, less than 10 miles away from my house, the ferocity of this earthquake was considerable, and severe enough to cause major infrastructure damage to local roads and bridges. You've probably seen a few of these pictures on the national news.\n \nThe event was quite scary, by far the biggest and most frightening earthquake I've ever experienced. The entire house rumbled and shook as if a freight train was running right through the living room. Being early morning on the last day of November, it was still dark outside, and the power went out almost immediately.",
   "Great tour but did not see a SINGLE celeb. False advertising!",
   "Interesting state capitol.",
   "Free one hour tours offered by knowledgeable guide.  Compared to other Capitols, not as impressive, but nice. Cool photos and art in hallways."
  ]
 },
 {
  "name": "Twin Lakes",
  "address": "4431-4499 Glacier Hwy, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/629b5910-9331-11ea-a094-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "walk",
   "kids",
   "family",
   "pets"
  ],
  "link": "https://maps.google.com/?cid=3438065428818542795",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for the entire family to have fun and relax. It's also wonderful for handi•capable people to participate in activities. The big downside is that there isn't enough available parking.",
   "Twin Lakes is a great place to take the kids. There are a lot of activities, such as swimming, playing frisbee, fishing, and the playground. It's a great get away from TV, and cell phones.",
   "Excellent castle playground....my 6 year old son loves it...cool location...good paved pathways with plenty of room",
   "There is plenty to do.. Fishing, boating, playground not just for kids but adults as well.. It has parking for the disabled, little paths around the lake to walk your pets, place to have a picnic with family or friends.. Restrooms & portable restrooms... It's a place to unwind.. Lay in the grassy Knowles.. Get a chance to check it out.. \"GO FOR IT\"!!!",
   "Wonderful place."
  ]
 },
 {
  "name": "Eagle Beach State Recreation Area",
  "address": "The Tongass National Forest, 28955 Glacier Hwy, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/62fa20b4-9331-11ea-af31-14b31f159f22.png",
  "tags": [
   "kids",
   "nature",
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=9226952001960119726",
  "source": "GoogleMaps",
  "reviews": [
   "With beautiful, untouched, vista views how could Eagle Beach not receive a 5 star rating? Picnic Areas, Trails, Beach-Front with  Sand and typically not crowded with traffic (people, vehicle, or otherwise). Great place to bird watch, look for animal tracks, simply sit and enjoy nature, or watch your kids play with sand/beach toys. Photo opportunities abound!",
   "Spent the night out there with some of my friends, had a great time, even in the rain,  highly recommend if you get the chance",
   "Berry Patch Cabin - nice open space, well maintained, beautiful views!",
   "Rented a car. Coming off cruise ship. Beautiful scenery, muddy.",
   "What a great place to stay! The cabins here are cheap, clean, and comfortable. Bring kerosene to power the stoves! Highly recommend."
  ]
 },
 {
  "name": "Wickersham State Historic Site",
  "address": "213 7th St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/636f02dc-9331-11ea-b965-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "historic",
   "knowledgeable",
   "history",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=14094556538243807976",
  "source": "GoogleMaps",
  "reviews": [
   "Interesting old home of a key historical figure. Not a lot to see inside, but knowledgeable docent was very welcoming.",
   "Fun historic house tour. Well worth the climb up the stairs.",
   "The site keeper was excellent, so knowledgeable, personable & helpful! Loved the home & history!",
   "Worth the walk. Don't miss this place!",
   "Nice historical site"
  ]
 },
 {
  "name": "Chilkat State Park",
  "address": "Haines, AK 99827, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/63c9584a-9331-11ea-ab33-14b31f159f22.png",
  "tags": [
   "hike"
  ],
  "link": "https://maps.google.com/?cid=3906432435845576955",
  "source": "GoogleMaps",
  "reviews": [
   "Hike to Moose Meadows is easy, through forest to Rocky cove, round trip is 1.5 hours.",
   "Nice park, great hosts and super clean bathrooms! The only thing I would say is an awful lot of people drive thru the campground (fast)! Beautiful place 😎",
   "Best kept campground near Haines! Clean and well kept sites, clean bathrooms. Sites are mostly pull through with some back in. Road can be a bit rough but I had no problems at all with my 27' RV. Nice hikes and forested area nearby. Boat launch nearby and some good swimming if you don't mind some colder water. I was surprised but the water had very little salt from the ocean.  Campground hosts were friendly and welcoming...I am looking forward to returning next year!",
   "Great hikes. Beautiful!",
   "Love the scenery.  Beautiful place to visit."
  ]
 },
 {
  "name": "Alaska Shore Excursions",
  "address": "212 Admiral Way #5, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/64307e9e-9331-11ea-a74a-14b31f159f22.png",
  "tags": [
   "nature",
   "history"
  ],
  "link": "https://maps.google.com/?cid=981925977853978521",
  "source": "GoogleMaps",
  "reviews": [
   "What a wonderful time!! Great ATV's!! The rain forest is beautiful & it couldn't have been better weather!! It was so fun to meet so many nice people and to see the glacier.. then the extra special \"Extras\" that are in nature that we were blessed to see also... being able to see a whale in the water on our way back, all the sea lions & their babies, & the eagles!! Loved hearing all the historical & educational tidbits of the area, learning about the different types of rocks & stones in the area... it was an all over a great time!! Thank-you!! WE HIGHLY Recommend this Excursion!! ",
   "Top 5 experiences of my life. I cried out of joy seeing the beauty in the sky! This is a must do! We were met at the port, took an easy drive over, got suited up and instructions, flew to the glacier and had the most amazing experience with the dogs and the people at the camp.  The staff is amazing, friendly, and professional.  It was brilliant!",
   "My photo says it all. In Juneau, Captain Sarah and Naturalist Katie put us on the humpbacks almost immediately. There was lots of spouting and we saw some tail fins. Within 15 minutes, we saw a humpback breach. That was followed up by a simultaneous breach by a mother humpback and her calf...then about six more breaches. By far, this has become my favorite vacation experience of all time. \n\nThe Skagway mushing camp was also incredible. That staff was friendly and we got the most out of our day. I loved this excursion more than I expected.\n\nAlaska Shore Excursions is reasonably priced and delivers on a first rate experience. I recommend this company to anyone visiting the ports they operate in.",
   "Fantastic!!  We had so much fun and the helicopter/dog sledding ride on Herbert Glacier was definitely the best part of our trip.  We loved everyone at the Coastal Helicopters base as well as the Dog Sled Camp.  Names that come to mind are Owen (Gig 'em, Owen!) at Coastal Helicopters and James, our Musher at the Dog Camp.",
   "We had a blast! My 38-year-old down syndrome niece  especially loved petting the dogs and the puppies.  Our shuttle driver was very informative even though he was feeling under the weather. The lady musher was good but  we would’ve loved to ride  much longer. Had fun  going over the bridge and listening to the History of the race.  It was wonderful that I booked two excursions with this company and they honor the $50 discount another company was going to give me. Thank you for a memorable experience."
  ]
 },
 {
  "name": "JUNEAU FOOD TOURS",
  "address": "2 Marine Way #203, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/64995162-9331-11ea-b07f-14b31f159f22.png",
  "tags": [
   "tour",
   "food",
   "walking",
   "tour",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=755827191801556466",
  "source": "GoogleMaps",
  "reviews": [
   "This is MUST. If you are stopping in Juneau put this tour at the top of your agenda. Amazing food, for an reasonable price. We stopped at many local locations to get samples of their top selling meals. Along the way the guide gave information about Juneau. We highly recommend this tour! Bring good shoes and layer up. Not too much walking but the weather is very unpredictable and you do spend some time outside!",
   "While on excursion in Juneau, I went on the Juneau Food Tour with my family.   Charlie was our tour guide and it is truly a must do if you go to Juneau!   The tour shows a true array of the options in Juneau and Charlie was great explaining everything about Juneau.  Highly recommend this excursion to anyone!",
   "",
   "",
   ""
  ]
 },
 {
  "name": "White Pass & Yukon Route Railroad",
  "address": "201 2nd Ave, Skagway, AK 99840, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/65155fcc-9331-11ea-93c1-14b31f159f22.png",
  "tags": [
   "delicious",
   "tour",
   "food",
   "tour",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10958213556590599152",
  "source": "GoogleMaps",
  "reviews": [
   "A Skagway must do! It’s expensive but worth it for 3 hours of beautiful scenery. The best views are outside standing against the railing. At some points you can almost touch the mountain! \nBefore heading out, the person narrating the train ride will ask you to be courteous of others wanting to take pictures outside...just be prepared a bunch of people with cameras won’t listen and will literally stand in the same spot the whole time. Don’t be shy, ask them to let you through.",
   "This Train ride is absolutely a must ride while visiting Alaska. The heights and views are magnificent.  If you dare brave go outside between the trains.  It's so exciting. Thank you for such a fabulous experience...",
   "We opted to ride in the luxury car with unlimited food and drinks. There was no one under 21 years old allowed to ride in the car. It was worth the price paid. Breathtaking views with a tour guide to answer our questions. There was only seating for 14, so it was not crowded at all. The appetizer style food was delicious with a selection of beer, wine, and soda.\n\nA great selection of gift items in the store at the stop in town.",
   "The reviews here I am sure speak for themselves.  If I could stress one thing:\n\nIf you are on the fence about taking this tour as part of your cruise excursions, TAKE THIS EXCURSION.  \n\nMyself and three buddies cruised through Alaska on Celebrity in May of 2019 and this excursion was easily everyone’s favorite and probably the highlight of the entire vacation.\n\nThe scenery is just as fantastic as you would expect.  The guides are great.  I have uploaded some of our pics from the day.\n\nAnd if you are anything like me, you know there is nothing as awesome as a train.",
   "We came on a beautiful day and really enjoyed the ride up and back. \n\nPick the left side to get the best valley view on the way up (I think that it is a little longer time-wise since the train is slower going uphill) and side-of-the-mountain going down. You are not allowed to exit the train (there are no stops) or move from car-to-car once it starts moving. Our car was full, so no moving to other seats for us.\n\nIt is worth making it out to the outside platforms at least once. Our car had a platform hog who just stood there the entire trip and wouldn't share, but there is a platform on each end of the car. \n\nThere are no food options, but bottled water is provided. Each car has one restroom, which nobody seems to know how to use--it takes 3 pumps to purge your poo, please. \n\nInformative guides makes announcements throughout the trip to point out sites of special interest. Recommended."
  ]
 },
 {
  "name": "Icy Strait Point",
  "address": "108 Cannery Rd, Hoonah, AK 99829, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/657a14fe-9331-11ea-ad7f-14b31f159f22.png",
  "tags": [
   "drink",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=9631176011783739715",
  "source": "GoogleMaps",
  "reviews": [
   "We visited Icy Straight while on an Alaskan cruise. We had so much fun riding the zip line. On the bus ride up the mountain we saw a few bears. The bus driver was so nice to stop and let us take pictures. It was such a beautiful place and the views are amazing!",
   "We stopped here as part of our Alaska cruise in May 2019. Our itinerary included the Ziprider and whale watching tour. Neither disappointed us. We had a great time. It is a 45 minute bus ride to the top of the mountain.  It only takes 60 seconds or so to get to the bottom. What a blast! The whale watching tour was great as well. Stop in the lodge and get a drink. I believe the one called \"the zipper\" comes with a  shot glass. The weather was perfect for us. I hope we can return again.",
   "Tourist trap. Get to the next town over. There's some great restaurants and culture over there. And better tours. Local guides over there are rad.",
   "Beautiful location! We went on the zip line here & LOVED it! Everyone was super nice. Only issue is there isn't much to do beyond shopping & the zip line. But the surrounding area is just gorgeous to sit & take in 😘",
   "If you like to enjoy your own company like me then never miss a change to visit this place..."
  ]
 },
 {
  "name": "Mount Roberts Tramway",
  "address": "490 S Franklin St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/65d1ddfe-9331-11ea-bd5f-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15354244568965903164",
  "source": "GoogleMaps",
  "reviews": [
   "This tramway was an ultimate with a spectacular view of mountains and beaches. As we head up or head down in tram, we can hear audio that tells us all about the view around. Heading up and then trek towards the tip of the hill in between enjoying the snow around is fun.",
   "Short but fun tramway ride up the mountain. Price seemed a little steep, but I read reviews saying the views were incredible and absolutely worth it. Unfortunately, we rode it in the morning so the fog had not burned off yet. However, we still had an amazing few of the town up until about halfway; then, once we passed through the fog, we had an incredible view of the mountain range from above the fog-line. We still found it very worth the price; however, we wished we had known ahead of time that the ticket is good for all day. Had we known, we would have factored in more time in our afternoon to ride it again once the fog had cleared. Even so, I definitely recommend.",
   "Simple walk-up ticket purchase at the terminal. Helpful and friendly staff. Ticket is good all day for unlimited trips. Facilities up top offer panoramic views from the terminal bridge and two additional city-facing observation points that are about a 5 minute hike up a trail with moderate grade. Well worth the small investment of effort. Additional trails are available for more commited hikers.  A basic restaurant with scenic views and a modest menu offers refreshment, as well as a small walk-up coffee bar serving fresh local brew.  Completely worth the $35 fare and easily one of the best activity experiences to enjoy within the town of Juneau.",
   "This thing was cool. People complaining about $35 bucks for a once in a life time experience need to chill. Plus you get a discount for AAA. The views on top were phenomenal. I would do it again and be better prepared to hike all the way to the top!",
   "Friendly and kind staff.  LOVED the opportunity to be able to see a live bald eagle up close and take pictures.  It's nice to know she is loved and taken care of.  The views are spectacular, but the food is expensive and just modified fast food, except for the crab.  Lovely walk through the woods on a well marked trail.  Great for all ages!  So many say it is too expensive but I don't agree.  They have to keep the tram serviced all winter when not operating and summer when up and running.  It is run on electricity.  If you plan right and take plenty of time to walk the trails, see the native film (only 20 minutes long) and truly appreciate the beauty of the mountain, it is money well spent.  There are native made gifts in the shop, some which you cannot find elsewhere.  A smart shopper will ask questions and know what you're buying.  We had a great time."
  ]
 },
 {
  "name": "Red Dog Saloon",
  "address": "278 S Franklin St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/661de824-9331-11ea-9764-14b31f159f22.png",
  "tags": [
   "family",
   "eat",
   "food",
   "delicious",
   "food",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7576558346096278066",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome vibe. Excellent staff. Very inviting for the whole family (although we did eat early before any bar crowd). We got to write our name on the wall to commemorate our first visit and we'll see how many years we can go there to see it. Excellent food BTW.",
   "What a cool spot in Juneau! Juneau has the pioneer charm that I would expect to find when visiting a place known as the last frontier. Visiting this saloon is the cherry on top of the whipped cream if you're looking for the pioneer nostalgia like I was. There are historical memorabilia hanging on the walls, flags on the roof rafters from visitors from all over the globe and writing on the walls from hundreds of patrons throughout the years. Bear skins, taxadermy moose heads, giant halibut and mountain goats are also decorating the walls. Oh, snap! I forgot to mention, the beer is cold and local, the food is delicious, and the service was great! Kristen was our bartender and brought a warmth that was missing from Juneau in the middle of January! Awesome job!",
   "Quite an exciting place with old world charm.  Had a great piano player,  friendly people, and of course, in scenic Alaska.  My girlfriend was really impressed by the place.  Good thing Russia sold it to the US, or us Canadians would have a common border with Russia......can you even imagine that.....??",
   "Good little piece of history in the midst of a politically corrupt town. But at least the beer is good, the atmosphere is comfortable and warm. And on rare occasions theres good scenery.",
   "$10 for just 4 sad looking chicken strips form the freezer, it was $11.99 when I went there i'm ashamed, the best thing was the tap water"
  ]
 },
 {
  "name": "Above and Beyond Alaska (ABAK) Wilderness Adventures",
  "address": "2767 Sherwood Ln, Juneau, AK 99801, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6687b68a-9331-11ea-a67d-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "kids",
   "knowledgeable",
   "hike",
   "walk",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=10345463696888678072",
  "source": "GoogleMaps",
  "reviews": [
   "I went on an ice climbing/hiking trip with Jacque and Jacob. They were both knowledge and very helpful. They have a clear passion for guiding and sharing the park and glacier.  I felt very safe even while ice climbing for the first time.  I'd highly recommend the glacier/ice climb trip for anyone looking for an adventure.",
   "AMAZING experience with ABAK! My boyfriend and I did the Mendenhall Canoe Paddle and Glacier Trek with Jacques and Mike who were extremely knowledgeable, helpful and accommodating with our group. The views were simply incredible and the staff made it so much fun! 5 stars simply isn’t enough to rate this unforgettable experience! If you’re in decent enough shape to make this trek, don’t pass on this opportunity! I’d go back in a heartbeat!",
   "Great cruise ship excursion experience. Bo and Ben did an amazing job showing our kids and ourselves the glacier in a safe, professional and fun way. If you're physically fit enough, I highly recommend this excursion.",
   "Went canoeing and hiking up Mendenhall Glacier with two guides.  Hands down, this was the best thing I did while in Alaska.  The guides were very knowledgeable and clearly had a safety first attitude.  The paddle across the lake was easy since we had 13 people in a canoe working together to get us there.  The short hike to and trek on the glacier was amazing.  The glacier is gorgeous. We had time to get down into a small crevasse and check out the beautiful blue water at the bottom.  I hope to come back to Juneau one day and have a longer (half day) adventure on the glacier with the guides!",
   "We did a private guided hike to the Mendenhall Glacier and it was the highlight of our trip. It’s the excursion we were most looking forward to and it by far exceeded our expectations. Our guide Daniel was amazing. The whole process what amazing. They were attentive to questions from the booking process to the actual event itself. The views are breathtaking and worth the challenging hike.  We enjoyed the challenge of the hike and along with the best workout, we got to see and walk on the beautiful glacier. The pictures don’t do it justice. Thanks Daniel for the highlight of our trip."
  ]
 },
 {
  "name": "Bear Creek Outfitters",
  "address": "8991 Yandukin Dr, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/66f0c6ca-9331-11ea-83f5-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=15638145210605841150",
  "source": "GoogleMaps",
  "reviews": [
   "Great guide and amazing fishing. Even if I didn't catch anything (but I did) it was well worth every penny.",
   "They canceled my trip after suiting up. Thank you for being safe and not putting us in a position where we couldn’t return safety or were at risk landing. I really hope to be back for a trip out with you.",
   "Booked a trip two months before my trip to Alaska. Forty minutes before I was to meet my guide I got a phone call cancelling my trip. I should of gotten a call the night before so I would have time to try to make new plans. I called and spoke to the owner. All I got was BS excuses. I'm in the same business in Florida. I would never ever treat a customer the way I was treated. Find another company...",
   "Great guides, good fishing and awesome fly  in float plane trip!",
   "Had a fantastic fishing trip with these guys. Excellent friendly guiding service."
  ]
 },
 {
  "name": "Juneau Tours",
  "address": "76 Egan Dr STE 300, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/67510ba4-9331-11ea-95be-14b31f159f22.png",
  "tags": [
   "tour",
   "knowledgeable",
   "tour",
   "tour",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=15622047400954594745",
  "source": "GoogleMaps",
  "reviews": [
   "First of all, Juneau Tours went above & beyond in accommodating us on this tour! Our ship excursion was cancelled that morning & Juneau Tours managed to work us in very last minute. The office faculty so so very friendly & nice. Then we boarded the boat...! Boat was very clean & comfortable. Captain Kara, Danielle & Dave also so very friendly & fun! You could tell they had respect & passion for the whales. We felt as if we knew & understood the whales personally as Danielle shared her whale facts with us. Then of course, \"Flame\" the whale we saw that day, put on a spectacular show for us all! What an experience this was! This tour was truly one of our best! Made our whole trip! I WILL definitely use this agency again when visiting Juneau!",
   "Excellent tour - I highly recommend this operator! The boat had a warm, comfortable cabin that offered very good viewing access. You could also view from outside the cabin and go up top where there were multiple areas from which to observe all the gorgeous scenery and of course whales!! We saw several whales and most of the sitings were close to our boat. Kudos to Capt. Dan for maneuvering close enough but not so close as to stress the whales. Our naturalists for the tour were Danielle and Sam - both were very enthusiastic, energetic and knowledgeable.  They were constantly checking with all of the guests to answer questions and help spot all of the wildlife! They were fabulous.  It was a very rainy day but they made it fun and completely worth the trip! The whole experience was well coordinated and required little effort on our part. Thank you!",
   "We had the best time on this tour! They keep the groups small, so you’re not crowded together on one of those bigger boats. Chris, Amber and Jason did a fantastic job of finding the whales and teaching us several things about them. The boat is also well maintained and kept very clean. I would highly recommend booking with Juneau Whale Watch!",
   "Dave Danielle and Brendan were so personal and the captain is a great whale whisperer. He got us amazingly close to a couple of whales. Great info on the way out and back to shore. Even got to see some cute sea lions! ",
   "Danielle, Maddie, and Captain Dan are passionate, knowledgeable, and responsible about wildlife."
  ]
 },
 {
  "name": "Klondike Gold Rush National Historical Park Visitor Center",
  "address": "291 Broadway, Skagway, AK 99840, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/67bcba0c-9331-11ea-b2c4-14b31f159f22.png",
  "tags": [
   "history",
   "learn",
   "parks",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=2242214847921207232",
  "source": "GoogleMaps",
  "reviews": [
   "Loved the history! Both the place and all the info told by the historians  was a spine tingling adventure I added to my book of life. A chapter full of adventure.",
   "The area of Skagway has several National Parks locations that are part of the one park.  Be sure to explore beyond the first building to get the full experience.  I suggest doing the junior ranger programs to learn the most about the park.",
   "Excellent spot to visit and enjoy when you get a chance to check out Alaska. Knowing some things about the region helps you appreciate it just that much more. We've been twice and we're going back again soon. If you have the opportunity to visit... TAKE IT!",
   "Friendly informative staff. Interesting things to read throughout.  Ladies bathroom had a lengthy line, smelled of urine and were tight corridors. There are four stalls though and in an emergency it served its purpose.",
   "What a great place to learn about the area"
  ]
 },
 {
  "name": "Glacier Bay National Park and Preserve",
  "address": "Alaska, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/682330f8-9331-11ea-9106-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=16326574390281387360",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic Glacier viewing here. Multiple glaciers to see also.  Mane seals and Bald Eagles too.     If Glacier Bay National Park is on your bucket list,  then be sure to see it. You won't be disappointed.",
   "A bucket list experience for sure. Absolutely a must see before they disappear, which is a sad reality. One of the most breathtaking experiences is to hear the Glaciers crackle and shift. Truly something everyone should experience",
   "The beautiful place to go around & see big glacier melting down to the sea,see the big blue ice in this place.many ice small group of ice burg fotting around and flotting around the sea.\nThe beautiful weather with chilling air makes you to feel the beauty of mother earth.you will just love this place of sea, water,air , glaciers, mountain.\nJust one of the most most most beautiful place to see of life time moment",
   "Visited here during a cruise, an absolutely stunning location with such fresh air to breathe, if you haven't visited it's a must without a doubt one of the must stunning places I have ever witnessed!",
   "Alaska was not my first choice for vacation,   only because when I vacation I like warm and sunny. But I must say I had a wonderful time. The beauty was breathtaking! Glacier Bay was my favorite,  you can not miss this opportunity if you are visiting!"
  ]
 },
 {
  "name": "Tracy’s King Crab Shack",
  "address": "432 S Franklin St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6884a774-9331-11ea-ba40-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2130754094144547576",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely a must try! It's worth every bite! Although it is delicious, it's very filling! One King Crab leg was too much for just me, but I powered through! The service was great and it was interesting being able to see them cooking the food outside.",
   "Highly visible landmark eating establishment within sight of the ship. This restuarant remains Ed busy as Alaskan tourists expect great seafood dishes. They were not disappointed by either quality nor quantity. It's an amazingly fun place.\nThe staff can handle the business in an efficient friendly manner. As with all things Alaskan, this is visual dining. Highly recommend Tracy's King Crab Shack.",
   "Went for a really amazing concert/dance, Collette Costa band incredible performers, super fun. Tons of people. Staff was really nice, thoroughly enjoyed myself. Also been there for their food which is out of this world!",
   "HUGE! The crabs are HUGE! You gotta get to Tracy's when you go to Juneau! Bling Blinky of TEXAS Shout Out: Cracking Good Crab Legs!!",
   "Awesome place. Visited with my family during our cruise to Alaska. Crab cakes were so good, we ended up ordering few extra orders to take back on the ship with us. \nThe best chowder I have ever had, will definitely be back for more next time we visit Juneau."
  ]
 },
 {
  "name": "DIPAC Macaulay Salmon Hatchery",
  "address": "2697 Channel Dr, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/68dbacc6-9331-11ea-acbd-14b31f159f22.png",
  "tags": [
   "walk",
   "learn",
   "history",
   "tour",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=1322290103779699099",
  "source": "GoogleMaps",
  "reviews": [
   "Serene, nice quiet location. Good to have a walk, enjoy a few drinks and the fresh seafood and learn about the history.",
   "Very nice stop on our excursion. We learned a lot about salmon life. Very interesting.  We saw many bald eagles in the area as well.",
   "This is a fun, quick stop to see the salmon. It's worth the time. There is a paid tour, but you can see tons of fish just along the shore. Have fun!",
   "AWESOME!!  so exciting to see all the King Salmon coming back \"home\" (we are here in September)   It really is a great place to learn about Salmon .. WE HIGHLY RECOMMEND!  and seals were cute too .. albeit they were having a snack😮",
   "Amazing place to visit!! Could watch the salmon all day."
  ]
 },
 {
  "name": "Gastineau Guiding Company",
  "address": "1330 Eastaugh Way #2, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6939058a-9331-11ea-913b-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "walk",
   "tour",
   "active",
   "knowledgeable",
   "tour",
   "knowledgeable",
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=7921954859360580944",
  "source": "GoogleMaps",
  "reviews": [
   "Great tour. We got to see a bunch of whales and even some killer whales on our boat ride. The glacier trail are very easy and nice. Dirk and Lisa are very knowledgeable making the your fun and educational.",
   "We did the photo Safari tour - a combination of a short first walk to see the glacier, and a whale watching tour. \nOur guide, Mark, was great - informative and funny. And our whale watching tour with Captain Kelly was a great success with many humpbacks really close up (they kept coming towards us!).",
   "This tour exceeded all of our expectations. Our tour guide was Britney, and she was fantastic - funny, knowledgeable, entertaining and informative. Our Captain was Captain Mac - and he was also fantastic and really knew where and how to find the whales and how to get the best photographs of them. He consistently positioned the boat to afford us the best lighting and backgrounds to photograph whales. Plus, he knew the local whales well, where to find them, and which ones would likely be the most active and interesting to watch and photograph.\n\nWe came to Alaska to see whales, and this tour delivers! They guarantee you will see whales on their tour, and we saw MANY, including a mother and calf. This was an educational, exciting, comfortable and thoroughly enjoyable experience. We cannot thank them enough to recommend them highly enough!\n\nI am including some photos with this review taken from my husband's iPhone. In other words, these are not even the good photos that we took on our DSLR. You will get fantastic opportunities for pictures on this tour. Don't hesitate - JUST GO!",
   "My wife and I had an absolutely wonderful time as Shannon, Adam K., & Captain Fred lead us through whale watching and a small bit of hiking. They were all very knowledgeable and taught us so much, we had an excellent time. I would highly recommend doing a tour with them!",
   "Wow!!!  I'm completely hooked on whales and studying them now.  The things we learned on the boat and what we saw just can't be duplicated on one of those bigger boats.  Personal service- she took the time to get to know is and at least our names.  I got to pull in and throw out a crab pod. Lol. It was tiny but still!!!  I felt such a connection with the whales.  Not completely sure I would have on a bigger vessel. We saw a sea otter the guide had only seen twice the previous year. Her personal stories were great and tired everything together.  \n\nYou will NOT regret booking a tour with this company.\n\nWe loved Captain Todd and Richelle, our guide.  Thanks, y'all!  \n7/11/19"
  ]
 },
 {
  "name": "Alaska 360",
  "address": "Klondike Hwy, Skagway, AK 99840, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/69885e80-9331-11ea-8420-14b31f159f22.png",
  "tags": [
   "tour",
   "food",
   "learn",
   "knowledgeable",
   "tour",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3915468774180614845",
  "source": "GoogleMaps",
  "reviews": [
   "We loved the tour and Goldie was fanominal.  One of the best days of or cruise.  The food was excellent and the the best was the root beer float to top it all off.",
   "What a great place to learn about dog sledding. Everyone was very knowledgeable about the sport of dog sledding. A great hands on experience for young and old!",
   "Not as advertised! BS staged/fake panning, and didn't tour anything real. The sled dogs were cool, of course, but a be ititarod chamber... Only 2 stars because the puppies and sled dogs!",
   "Small place but very interesting. People are dressed nicely in period costume. We tried the gold panning, the assayer office is so beautifully done.",
   "Interesting place, but is kissing the final touch, food is great, highly suggested the ribs. Perfect for families."
  ]
 },
 {
  "name": "Amalga Distillery",
  "address": "134 N Franklin St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/69e53dae-9331-11ea-9fb3-14b31f159f22.png",
  "tags": [
   "drink",
   "tasting",
   "unique",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=13081147107049994254",
  "source": "GoogleMaps",
  "reviews": [
   "I am not a gin drinker and enjoyed this place. However, as a non gin drinker my other half did have to finish my beverage. He however really liked this gin. The bar was a little hot inside though and and could use some fans or something so there is air circulation.",
   "There is so much to love about Amalga Distillery, from their wonderful drinks to their kind staff to the way they foster community within our little town. In particular, my loved ones and I enjoy stopping into Amalga for Blood Mary Sundays. I love that they incorporate local and foraged ingredients in their beverages. Furthermore, the events they hold on site (like Maker's Markets or artist nights) provide opportunities for local creatives to connect with the community. Amalga makes our city so much cooler and tight knit, and I'm so glad they're here!",
   "Quirky little 2 drink limit bar that's  legally a tasting distillery. Nice gin cocktails.  Popular with locals. Gets noisy. Closes early.",
   "This new distillery is amazing. If you like Gin, then you have to go here. Design is unique, great vibes and friendly staff. They have a variety of different drinks to go with their different flavors of Gin.",
   "This place was awesome! It was just drinks and you could do a tasting. There was a lot of room to hang out then end tables facing the street. We just happened upon it and would’ve spent a lot more time here. I would highly recommend it if you’re here in town"
  ]
 },
 {
  "name": "Kootznoowoo Wilderness",
  "address": "Angoon, AK 99820, USA",
  "avg_visitor_review": "",
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=6659973076756775242",
  "source": "GoogleMaps",
  "reviews": []
 },
 {
  "name": "The Rookery Cafe",
  "address": "111 Seward St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6a3d21da-9331-11ea-9c15-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=13007161187043948931",
  "source": "GoogleMaps",
  "reviews": [
   "Nice spot in town. Came on a whim off of the cruise ship. Food comes out in a timely manner and is pretty tasty. Good portion of avocado with the eggs benedict, too!! The potatoes that came with the dish we're perfectly crispy on the outside and soft on the inside.\n\nIf I come back, I'll be sure to try their baked goods.",
   "Delicious and great portion size. Loved the ambience and staff were so friendly. Highly recommend.",
   "Great coffee and breakfast with a funky, friendly vibe. Counter service, but food delivered to your table. Crowded and buzzy, mostly locals. They have a nice selection of pastries, along with cooked breakfasts - try the smoked salmon benedict.",
   "I go there every morning for my coffee.  Love the cool vibe and friendly people.  Always see someone I know.  A great place to start the day.",
   "Cute little cafe, my mocha was delicious! I ordered the eggs Benedict, they were good but not the best I’ve ever had. The hollandaise sauce was a little different and it was kinda cold when I got it. Big portions, though."
  ]
 },
 {
  "name": "Glacier Muffler-Mechanical Inc",
  "address": "2450 Industrial Blvd UNIT A, Juneau, AK 99801, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=10916956101820841585",
  "source": "GoogleMaps",
  "reviews": [
   "Great service and great people to work with! Hard to find no nonsense straight shooters like these guys.",
   "Great mechanics. Family like, honest.",
   "They do what they can to get your car fixed",
   "My neighbor recommended this place to us. I'm very happy he did, not only did they get me in quickly, they were professional, courteous and got it fixed fast. They actually recommended NOT needing more done right now because other things were sound. Who does that??? Super fair price! We will take ALL our vehicles here and recommend to others!",
   "We have a fleet of 8 commercial high use vehicles that Terry and the team have helped us maintain for over a decade and we couldn't recommend them highly enough. Honest, straight forward, and never nickle and dimes. Stuff goes wrong, but we trust them to always be realistic and provide us all the options to have top notch safe vehicles on the road. Thank you Glacier Muffler Team!"
  ]
 },
 {
  "name": "Sitka National Historical Park",
  "address": "103 Monastery St, Sitka, AK 99835, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6aa080f4-9331-11ea-8c62-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "walk",
   "walk",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=5392006896022536534",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely walk through woods. The totem poles are fascinating and beautiful. We were there at the beginning of August so saw salmon going upstream and spawning.",
   "Absolutely beautiful! It was so green and quiet.  We spent hours walking around the woods and along the paths. Definitely a must see!",
   "Just amazing. We were there during the salmon run. The totem poles were great and the trail walk was superb.",
   "I'm posting this review over a year after visiting and I still can vividly remember this place. Can't wait to go back",
   "Very cool place!  We were lucky in choosing the right tour which included this stop, but to be fair our guide really made it come alive.  However, the abundance of plant and forest was mind blowing.  The trails were in fantastic shape.  Easy to walk.  Wide enough to accommodate at least 4 adults shoulder to shoulder.  Several benches placed frequently throughout the trails we were on which helped those of us who needed a break every so often.  The totems were in good shape as well which gave us gawkers even more to appreciate."
  ]
 },
 {
  "name": "Alaska Raptor Center",
  "address": "1000 Raptor Way, Sitka, AK 99835, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6b01d592-9331-11ea-80f5-14b31f159f22.png",
  "tags": [
   "tour",
   "learn",
   "knowledgeable",
   "educate",
   "learn",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=2339206465434596245",
  "source": "GoogleMaps",
  "reviews": [
   "It was amazing to get up close to all the eagles and owls. We learned so much about them and their rehabilitation process. We found this place almost by accident and are extremely glad we went.",
   "Great place but sadly only had 30 minutes on my guided tour so we didn't get to see much I would suggest at least hour minimum. Staff was eager to share their knowledge. Spirit the Bald Eagle was very impressive .",
   "A must see.  Sure, you've seen raptors at zoo's, but this place is different.  You feel their mission to rescue some of God's creatures.  The guide was knowledgeable and friendly.  He took the time to educate as well as showing appreciation for our desire to learn more.",
   "Very cool place, focus on education for patrons, and saving amazing aviary creatures for rerelease if possible! Give yourself some extra time here, there is tons to see and learn. I even picked a Salmon Berry to try!",
   "Love that they are rehabbing these bald eagles and others! Have  beautiful walking trails. We also saw wild bald eagles in this area. We found it all very interesting!!"
  ]
 },
 {
  "name": "Eldred Rock Lighthouse",
  "address": "Alaska, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6b5f605c-9331-11ea-a1ef-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=7030110033504596277",
  "source": "GoogleMaps",
  "reviews": [
   "A cool lighthouse to pass by on the ship! It was constructed in 1905 and turned automated in 1973. This is the oldest remaining lighthouse in Alaska.",
   "Passed through on a cruise ship right at sunset in a late August date to capture this beautiful picture.",
   "Davidson Glacier, in the background, is no longer visible from this location. This photo is from 1982.",
   "",
   ""
  ]
 },
 {
  "name": "Cathedral of the Nativity of the Blessed Virgin Mary",
  "address": "416 5th St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6bace462-9331-11ea-8779-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=10673281581838512730",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful small special cathedral. Peaceful and prayerful.",
   "A very beautiful cathedral...",
   "Praise God.\nAfter 11AM mass there was a mini lunch.",
   "Pleasant church. Great staff. I really connected to this place. Welcoming and friendly. ",
   "Great church family."
  ]
 },
 {
  "name": "Frenchie's Floral Studio",
  "address": "1200 Glacier Ave #102, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6c10886c-9331-11ea-bcdf-14b31f159f22.png",
  "tags": [
   "unique",
   "walk",
   "art",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=12629797203065648227",
  "source": "GoogleMaps",
  "reviews": [
   "I love Frenchie’s Floral! Last year on Mother’s Day I received the most exquisite flower arrangement of my entire life! Their creations are unique and artful. I purchase my succulents there as well. They offer single plants and little groupings that look amazing year round. I am able to incorporate their curated vessels for both flowers and plants into my own decor. The gorgeous, boutique style store is fun to visit- it always lifts my spirits!",
   "I have used Frenchie's Floral Studio personally, and for my business for several years. I love this business! They offer a variety of services, including floral arrangement deliveries which is amazing for my busy schedule. I also love that they have a variety of prices available on floral arrangements- so I can always find something that fits my budget (whether it is a small gift bouquet or a show-stopping center piece).  You can call ahead and place an order OR just walk in! The staff is always super helpful and responsive and the arrangements are truly works of art.  I love working with Frenchies.",
   "I was so pleased to do business with Frenchie's Floral Studio! The customer service representative on the phone was so helpful and cheerful. I saw pictures of the bouquet  they sent to my sister in Juneau, AK and it was more beautiful than I could have ever imagined! Frenchie's not only made my sister’s day, but  they made mine- all the way from Virginia! Thank you so much!",
   "Melissa is an energetic breath of fresh air. \nShe was very helpful in making my selection.  \nThe arrangement was delivered on the requested day and I received an email giving confirmation.   The recipient sent me a photo of an absolutely beautiful  floral arrangement.  She was delighted! \nWell done Frenchie's Floral Studio!!!",
   "I picked up flowers for Valentine's day. The store was lovely and I was very impressed when I learned that the store uses local floral sources. I also love that the store encourages people to reuse vases rather than buying new ones. Excellent customer service and assisted me in a timely manner. It was overall a very friendly environment. I loved that they mixed and matched flowers and customized my bouquet. It came out truly beautiful and unique."
  ]
 },
 {
  "name": "Unplugged Adventure",
  "address": "549 S Franklin St, Juneau, AK 99801, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6c7993a2-9331-11ea-8608-14b31f159f22.png",
  "tags": [
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=8350024173068472447",
  "source": "GoogleMaps",
  "reviews": [
   "This is by far the best way to see Juneau! The guys who run the place were extremely helpful.  The jeeps are all brand new and are beautiful. Jeeps come with an iPad with built-in GPS and a electronic tour guide to explain all the sites. We were able to see nearly every main “site” Juneau has to offer. Keep up the great work unplugged adventure!",
   "Great overall experience. Would do it again without hesitation.",
   "I highly recommend renting a Jeep from Unplugged Adventures. If you like designing your own adventure without buses and crowds, you will love seeing Juneau by Jeep. Given the cost of a bus ticket or a cruise excursion,  it is very cost effective as well. There's even an iPad with a pre-installed narrated tour. It was one of the many highlights of our Alaskan adventure. Thanks for helping us make amazing memories! Here's just a few of the sight seen from our little red Jeep ...",
   "100% this is a must do when visiting Juneau! The staff was super friendly,  and accommodating. Pricing was not bad. Jeep was clean and ready to roll. GPS navigation was spot on. An amazing experience overall. Would totally do again!",
   "What a wonderful way to explore Juneau. Freestyle, laid back and on your own. So happy we stumbled on to this. Thanks for making this stop unforgettable!"
  ]
 },
 {
  "name": "Gold Creek Salmon Bake",
  "address": "1061 Salmon Creek Ln, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6cee009c-9331-11ea-930c-14b31f159f22.png",
  "tags": [
   "delicious",
   "walk",
   "eat",
   "eat",
   "sampling",
   "food",
   "nature",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=12690140394458456665",
  "source": "GoogleMaps",
  "reviews": [
   "A terrific experience! Outdoor venue with plenty of seating - grilling salmon and a buffet of all you can eat on top of that!  Great for families! Walk way back in the woods to the waterfalls and see the old mining equipment from the Gold Rush Days! Be sure to get a great souvenir - a t-shirt or magnet! Bling Blinky of TEXAS Shout Out: I am sitting here in Texas wishing I had a bite of that flamed grilled salmon! DELICIOUS!! Gotta get back to Gold Creek and EAT!! LOVED IT",
   "The salmon was very tasty, but the sweet sauce they put over it was amazing. The area is protected and quaint. As you eat, you sit in protected tents, enjoying the outdoors but staying dry. The staff are very friendly and helpful. Highly recommend this salmon bake.",
   "Great way to see life style and nature with the experience of eating outdoors with the beauty of nature around you and the cutural food of the region. I was there when it was warm and not in winter. From Louisiana, enjoyed the beauty of the land, sampling foods of another culture and appreciating the ways of life in different parts of our world.",
   "The salmon was amazing! We went here as part of an excursion and it was a really cool place.",
   "This was a fun excursion and a chance to eat fresh salmon."
  ]
 },
 {
  "name": "Fortress of the Bear",
  "address": "4639 Sawmill Creek Rd, Sitka, AK 99835, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6d578a62-9331-11ea-af37-14b31f159f22.png",
  "tags": [
   "pets"
  ],
  "link": "https://maps.google.com/?cid=14134752308069305680",
  "source": "GoogleMaps",
  "reviews": [
   "Great educational facility and tourist attraction. The bears live good lives here that they would never have gotten to lead otherwise. Natural habitat, feeding and wellbeing is at the heart of what these guys do. I hope this place continues to flourish and develop over the next few years.",
   "Great place to visit! Great education spot about bears. The bears seem happy and healthy. A new visitors center is being constructed and will certainly enhance viewing and learning opportunities. Plan on spending 30 to 60 minutes.",
   "They are currently working on updating and expanding the visitors center. But the staff was very informative and friendly. The bears where all out and in view they seemed happy. A pair even frolicked for us. Great visit",
   "Amazing! I could spend all day there watching the bears and learning more. Chris was great offering to educational tidbits and information on volunteering. I'm hoping to be back next summer to volunteer here.",
   "Go to the zoo. Save your money. They don't rehabilitate bears but rather rescue them and raise them as pets. Come pay to see my dogs. You will help me raise them and get more out of it. Know what I mean?"
  ]
 },
 {
  "name": "Chilkat Bald Eagle Preserve",
  "address": "Haines Hwy, Haines, AK 99827, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6daed234-9331-11ea-b548-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1660565747703470816",
  "source": "GoogleMaps",
  "reviews": [
   "Took the float river trip through here in September. Saw tons of bald eagles. Really pretty area and a great excursion.",
   "If you love eagles you will love this place.",
   "Amazing opportunity to see these beautiful creatures like never before",
   "Fun and safe adventure with access to view many bald eagles and get some great photos. Guides were knowledgeable. Food and drinks were average.",
   "Wonderful place to go and beautiful landscape with all sorts of wildlife"
  ]
 },
 {
  "name": "Sealaska Heritage Institute",
  "address": "105 S Seward St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6e0f9030-9331-11ea-9761-14b31f159f22.png",
  "tags": [
   "walk",
   "art",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=10103354388118686322",
  "source": "GoogleMaps",
  "reviews": [
   "The people are lovely to talk to and so proud. Beautiful gifts, jewelry and books. They have a great walk through museum.",
   "Cute place to visit, small but very informative",
   "Very interesting, and interactive screens to play with. Learned a lot.",
   "Incredible place, beautiful art work and souvenirs for sale, all Alaskan made",
   "Beautiful local carvings and artwork.  Knowledgeable docents."
  ]
 },
 {
  "name": "The Local Guy Charters & Sightseeing",
  "address": "11957 Glacier Hwy, Juneau, AK 99801, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6e648e36-9331-11ea-81df-14b31f159f22.png",
  "tags": [
   "learn",
   "tour",
   "history",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=11716515928373977882",
  "source": "GoogleMaps",
  "reviews": [
   "Adam and his crew are great!  Very low-key but serious about getting us to good fishing spots.  Highly recommend them!  We had a great day fishing, then they helped us drop off our fish for processing to be shipped back to TN.  Best boat charter experience ever.",
   "Incredibly fantastic trip!  Captain Adam rocks it! We left at 8:00 and by 10:00 had caught our Halibut limit and both were extremely nice sized. We then headed to salmon waters where we had just as much fun catching salmon. We opted to head back in with enough time to catch some quality whale watching which turned out to be spectacular! Local Guy Charter works hard and strives to tailor the trip to your desires. This was our anniversary and Captain Adam made it special. He knows his fishing areas, and works hard to make sure you land em. Most highly recommend this outfit. When we come back, it’s Local Guy Charter for us. Thank you Captain Adam!",
   "What an awesome trip!!  We caught our limit and when we returned to our cruise ship, we discovered that those who had taken the fishing charters that were offered on the ship, caught nothing!!  The ship would have charged us 4 times more and we would have experienced less!! Captain Adam and his deck hands (Samantha and Marcus) were wonderful with our autistic son and made sure that he had an amazing trip.  He took the time to visit seals, feed bald eagles, and learn about glaciers. As an educator myself, I know that Adam is the perfect teacher with his knowledge and enthusiasm.  I give him an A+!  I am also an amateur photographer and Adam took us places to get stunning photos! The afternoon on the Legacy was the highlight of our entire cruise!",
   "Adam is amazing!  We found him online and loved our day with him so much that we canceled the tour we had scheduled for the next day and went out with him again.  He is easy to talk to and is very knowledgable about the history of the area.  I have highly recommended his charter to all my friends who are traveling to that area.  You won't really experience this beautiful area until you book with him!!",
   "IF YOU ARE LOOKING TO GET RIPPED OFF, TAKEN ADVANTAGE OF, and SWINDLED this is NOT the company for you. If you are looking for a knowledgeable guide who can put you on the fish, a captain who understands the time constraints dictated by cruise lines, AND the ability to get you back to ship in the unlikely event of boat trouble, Captain Adam is the guy of your wildest dreams and fantasies. Captain Adam and Deckhand Chris gave our group of 4 the best fishing trip imaginable. Not only did everyone catch multiple fish, but we saw orca whales, glaciers, and a sea otter. When we return to Juneau, this is our “go-to” guy!"
  ]
 },
 {
  "name": "Zerelda's Bistro",
  "address": "9351 Glacier Hwy, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6eb5949a-9331-11ea-8a97-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1018400370291430686",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food!!!! Love it love it love it. Wish i could go more its pricey. Great customer service. Amazing pastries. Wish they had more vegetarian options.",
   "Must, absolutely MUST stop for lunch or supper. We probably bombarded them with a party of 11 people and it didn't even phase them. If it did no one would have noticed by the out going and upbeat attitude of the staff. I got a cheddar burger and it was by far the best I have ever had....that is saying a lot!  Keep up with what you are doing because it works.",
   "Very loud place. If that doesn't bother you, perfect! If it does, you may not like dining here. It's also tiny, tables are cramped, seating (naturally, since its a small place) is strange as you seat yourself but there aren't enough tables usually, and you may end up sitting at the end of a table with random people you don't know just to snag a seat, and it was just uncomfortable for me.  The food was good, so that was the redeeming quality despite all the discomfort. I still don't think I'll eat here that often though. If they ever move to a bigger spot I'll reconsider.",
   "Delicious food in a great environment! A comfortable friendly place, with a good value, yummy selection of food (including incredible pastries!)",
   "Great selection of wholesome food. Best Burger I've had in a long time."
  ]
 },
 {
  "name": "V's Cellar Door",
  "address": "222 Seward St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6f14cbf8-9331-11ea-a6a5-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "unique",
   "food",
   "delicious",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7141269537895140958",
  "source": "GoogleMaps",
  "reviews": [
   "I haven’t even paid the bill yet but it’s so good I had let people know! This is hands down the best restaurant I’ve eaten while visiting Juneau! The food was reasonably price and service was awesome. Go, eat and enjoy.",
   "I wasn’t sure what to expect, but was very impressed with the food.  We had the fusion burrito with seared ahi and the taco sampler.  Great combination of flavors.  Would highly recommend.",
   "The food was so good that I came back several times during my trip. Everybody is friendly and the cozy urban vibe is very welcoming. Unique - but tasty - food that you won't find anywhere else.",
   "This place has food that was amazing. Everything I tried was delicious. Service was excellent.",
   "Always feel like family when here! Food is great, and they are willing to help you find the dish that fits your taste! Even the salads are delicious."
  ]
 },
 {
  "name": "Deckhand Dave's Fish Tacos",
  "address": "139 S Franklin St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6f678476-9331-11ea-a78f-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8433081132382976641",
  "source": "GoogleMaps",
  "reviews": [
   "Great fish tacos! And I’m from fish taco Capital - San Diego! This is a food truck. Can’t decide? Get the combo of battered halibut, blackened rockfish, & battered sockeye salmon. Yum! Also had the   halibut fish cake for appetizer. Goes great w the nearby Alaskan lager. Outdoors food court, communal seating.",
   "Everything was delicious. Magical tacos, great service, great beer. Don't stop anywhere else, go straight here!!! Were from florida and can safely say best fish tacos anywhere!",
   "Trash bear was fantastic! Blackened cod over tasty fries covered in spicy sauce with cilantro... Yum",
   "Delicious fish tacos! Get the sampler if you're not sure which type of fish taco to indulge. Good local craft beer selection, friendly service. Dog friendly since all of the seating is outdoors. Tourists and locals love this place alike.",
   "Tacos were good! We are from California and fish tacos are normally fairly large for one serving and these ones were, from our perspective, rather small servings for the price we paid. That being said, though, the quality was good and very fresh fish. They have seats in the open and under cover. This was nice since it was especially hot while we were there!! Location is good and next to a lot of other food truck/tent type places right next to the cruise ships docks."
  ]
 },
 {
  "name": "Seong's Sushi Bar",
  "address": "740 W 9th St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6fd234f0-9331-11ea-9547-14b31f159f22.png",
  "tags": [
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2298384948732346452",
  "source": "GoogleMaps",
  "reviews": [
   "This has been a fairly regular stop for me now that I work downtown. Never have been disappointed.",
   "Best Mongolian beef I've ever had.\nSushi is best in town, hands down.",
   "My to go box was basically all white rice. So lame and super expensive. This happens all the time, all the Asian restaurants pile on the white rice, but skimp on the main dish. $14.95 for white rice, should have gone to Costco and bought my own bag.",
   "Its not a bad place to eat compared to the other asian orientated restaurants in Juneau. HOWEVER, you MUST be VERY SPECIFIC with your orders due to the fact there are many of the same recipes with different names, ESPECIALLY with the sushi menu AND Lunch \"specials\" where YOU MUST SAY its for lunch special you want, otherwise you'll be charged the more expensive version of the meals. They do wonders with their quality meat and amazing combination of flavors that don't ruin the rest the meal and they DO serve plenty of meat in the meals... if you decide on the SPECIFIC meal that has it. Most the time the 'different' meals are based on how much ingredients they add and just on how you pronounce the name (in english or in its native tongue) which will end up with a 20 dollar difference in paying per patron. Which if it comes to delivery, Little Tokyo with Asiana Gardens as back up, take out Seongs for the on the go local here in Juneau. LASTLY, THEY DO NOT DELIVER AND THEY WILL ONLY REMEMBER YOU IF YOU SKIP OUT ON A PICK UP and not a month straight up picking up the same 7 dollar meal with 5 dollar soda charged AND a 5 dollar tip. Good food, expedient service, first 5 minutes is friendly. Most you can ask for in a Tourism town based restaurant.",
   "Best sushi in town!! Pricey but very good"
  ]
 },
 {
  "name": "McGivney's Sports Bar & Grill Downtown",
  "address": "51 Egan Dr #1708, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/70231448-9331-11ea-ae81-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "food",
   "tour",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4545964382616112955",
  "source": "GoogleMaps",
  "reviews": [
   "Great breakfast,  very nice atmosphere,  we ate there breakfast and some din er great pasta dish and pancakes. Much better food that sandpiper cafe.",
   "My daughter go here a couple times a year for some Mother/Daughter time and every time the food is amazing, our server is fantastic, and our food comes out very quickly!",
   "I'd give this place 3.5 stars if I could, so I rounded up to be fair.  I typically get wings when I eat here with friends from work. It's not my type of restaurant, but it has a good social atmosphere. I feel like the menu is a bit lackluster, but also I LOVE their pretzel sticks with beer cheese appetizer. If you want bar food, this is the place to go. As an aside, my 12-year-old loves their pizza.",
   "Solid bar food downtown. Good chicken fried steak for breakfast and doing well with their fish and chips too. Watchout Hangar",
   "Came here as part of Princess Cruise Juneau Food Tour. Had a nice piece of a pork shank that was very good."
  ]
 },
 {
  "name": "TK Maguire's",
  "address": "375 Whittier St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/708c01ae-9331-11ea-b128-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=546549993775008088",
  "source": "GoogleMaps",
  "reviews": [
   "I have eaten at this establishment on a few occasions. Their buffet brunch is amazing and you leave just absolutely stuffed of a huge variety of food. They have a separate dinning room where people can rent it for parties. I had my work party there and it was amazing service. Susan was a great bartender. Highly reccomend them for any occasion.",
   "We ordered the Tex mex & Golden Pan skillets(pictured) , big portions like dinner size portions. We Probably should have shared one, everything was hot and the coffee was good. Server was chill I'd recommend this place.",
   "I recently had the Mexican buffet  and was very disappointed.  The rice was crunchy, the beans were unrecognizable, there were no chopped lettuce onions, tomatoes to garnish.  No salsa or chips or cheese. Just sour cream, sliced tomatoes and some green stuff in a bowl.  the other food items were also unidentifiable.  I recognized the chicken thighs and ate that.  If you set out a buffet you have to make sure the items are attended to.  Add salsa to the rice to keep it moist, put signs out to tell what each item is and have garnishes available.  Very disappointed.  Your regular menu is good. but the buffets are not.  Even the breakfast buffet was a let down when it was available.",
   "Food was really good. Our server Susan was very friendly and helped us with finding our way about town. Will definitely be back next time in Alaska.",
   "I've been coming here for their Sunday Brunch buffet off and on for a while.  I've noticed that they're ratching down on the quality of what they serve, staff turnover.  The last visit, they dialed down on their dessert offerings with danish and chocolates instead of more pies and cakes.\n\nOn the month of your birthday, they'll offer you a meal up to $25, but check."
  ]
 },
 {
  "name": "gonZo CULT AK",
  "address": "11806 Glacier Hwy #1f, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/70e2fccc-9331-11ea-963e-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "art",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2997335647335786443",
  "source": "GoogleMaps",
  "reviews": [
   "Going to breakfast at Gonzo with my partner is one of my favorite Sunday morning rituals. Their baristas are talented and the food is out of this world. I love what Aims, the owner, has done to offer Juneau with unique, flavorful waffle combinations. There are also a slew of vegetarian and vegan options on the menu, a rarity in this little town. \n\nDon't mind what others have said about poor customer service. The staff has always been helpful and kind, and though this is one of the many places in town where you have to grab your own water and bus your own table, the prices on the menu reflect that so that you never feel like you're paying for sit-down service. Keep on keeping on, Gonzo friends!",
   "My favorite dish is the Carnivores Unite. Sausage and bacon cooked into the waffle with homemade gravy to top it off. I tell everyone they have to try this place when they’re in Juneau.",
   "This is my favorite place to go to for breakfast. The atmosphere is great, art music...much like my own home :) The food is great too. The biscuits are amazing.",
   "Best breakfast during my trip to Juneau! Got the Cat’s Meow AND Spam Mail 🤤🤤",
   "It is located close to the airport. I asked the rental car agent for a good breakfast restaurant and she told us about this place. It is nice cozy place, food looks pretty, tastes ok."
  ]
 },
 {
  "name": "The Salmon Spot",
  "address": "210 Admiral Way, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/714aa9ae-9331-11ea-b13a-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7377019692835683591",
  "source": "GoogleMaps",
  "reviews": [
   "It really is just a spot! In a place smaller than a container but barely bigger than a Ford F250 these girls whip up a limited set of ground salmon dishes from fish that were likely in the ocean just the day before.\n\nWhile super fresh an oh so tasty, I would have asked for my salmon burger without the cheese - my taste buds prefer their fish without cheese, hence my virgin tuna melts sans cheddar...\nThe baby salmon cakes are highly recommended, the burger fantastic (grab a heap of napkins from the stash under the umbrellas, you'll thank me later), the chowder ok, skip the make-it-yourself soft serve as twirling the perfect scoop is a lot harder than it looks and the ice cream softer than you want it - lick fast.",
   "Delicious, simple and easy!  There is a reason why the line stretched down the block but was well worth the wait.  \n\nIf only they could add some more seating on the patio!",
   "This place is wonderful. Great prices, excellent product. We tried one of everything. Everything was very good. The salmon burger was very flavorful and tender. The salmon patties are the perfect size and come with an amazing sauce, and the chowder tastes great and is probably perfect for a chilly day. The owners are friendly and local. I highly recommend the burger!",
   "Salmon cake was super delicious. Highly recommend!",
   "There salmon burgers are very good. And, for Juneau, it is pretty reasonably priced."
  ]
 },
 {
  "name": "Donna's Restaurant",
  "address": "9131 Glacier Hwy, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/71afdddc-9331-11ea-88bf-14b31f159f22.png",
  "tags": [
   "tour",
   "family",
   "eat",
   "eat",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10719654771583237304",
  "source": "GoogleMaps",
  "reviews": [
   "I've only ever had items from their breakfast menu, but they were all fantastic. The meals themselves are fairly reasonably priced ($9), although a piece of pie is, like, 6 bucks!  In any case, they're definitely worth checking out.",
   "I stopped here before my helicopter glacier tour for a quick bite and was so pleasantly surprised. I wasn’t expecting much, as I was in for a quick bite, but I ordered “donnas special” and was in for a real treat. The rain deer sausage is LIFE! Definitely stop by if you are visiting town 🙌🏻🙌🏻",
   "You want quality service, friendly smile, someone to make you feel like your family... Well let Donna's staff and customer service make you feel that way...! From biscuits and gravy to French dip sandwiches... Top it off with the best milkshakes in all of juneau... We love it.. At least once a week we make it our priority to gather the whole family and head down there to eat there homemade pies with a scoop of ice cream.. The dinner menu is phenomenal.. The way the meals are served it's just excellent.. If you want good home cooking bring the whole family to enjoy the moment... You will not be disappointed...",
   "Ate here this morning. In town celebrating my birthday. Hands down the best steak and eggs breakfast I've ever had. Couldn't eat it all but I tried! Lol. Food was great, service was great. Not far from my airbnb and on the bus line. I'm going back to try the pancakes before I leave town.",
   "Good food and really good desserts. Pretty fair prices, especially for the desserts and how much they give you. Would definitely recommend this as a place to go and eat."
  ]
 },
 {
  "name": "The Wild Alaskan",
  "address": "5346 Commercial Blvd, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/72146ecc-9331-11ea-af08-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3946734442783883002",
  "source": "GoogleMaps",
  "reviews": [
   "Halibut sliders & Fries. Amazing!",
   "I thought the halibut tacos were delicious. I recommend them. The service was very good, and the workstation for preparing the food was very clean. That means a lot to me. I will be a return customer. Very satisfied.",
   "Great food and friendly owner - you can't go wrong getting a meal here!",
   "The Wild Alaskan is as wild as it gets! MUST stop in Juneau alongside the Alaskan Brewing Company. He was excited as we ordered our food and that excitement transfered over to the food. Amazing burgers and halibut like nowhere else. It's not a trip to Juneau without visiting The Wild Alaskan.",
   "Got the halibut sliders and fries but the pieces on the sliders were so small and thin  I could barely taste the fish. More bread than fish for $14"
  ]
 },
 {
  "name": "McGivney's Sports Bar & Grill",
  "address": "9105 Mendenhall Mall Rd, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/726a932c-9331-11ea-b3fa-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=272742438321020796",
  "source": "GoogleMaps",
  "reviews": [
   "Decent burgers, service can be slow. \nRange of appetizers. \nI've been here several times the food is good not excellent but good.\nService is often slow so, if your in a hurry this is not the place.\nCasual atmosphere, good food, variety of drinks. Pricing a basic burger and fries is 15. A monster double decker is 27$",
   "Amazing customer service, nice atmosphere, beautiful women and amazing drinks. Just stay away from the steak.....",
   "This place was amazing!  Hubby Ordered the Everything Burger - the meat was super fresh and the bacon was as to die for. I got the Shepard’s Pie and it tasted very homemade. Will definitely go back.",
   "Great atmosphere delish steak sandwich and bisque. Amazing service and I highly recommend it to everyone.",
   "McGivney's in the valley is better in some ways than the one downtown.  I like the atmosphere at this location better.  The kitchen closes 22:00 so it's not a late night place for food.  The Sandbar serves food late night.  The food and service is decent.  Karaoke on Thursdays starting at 21:00.  Weekday happy hours 15:00-17:00 for a ten percent discount on appetizers.  Sometimes their food has too much pepper like their meatball soup."
  ]
 },
 {
  "name": "The Island Pub",
  "address": "1102 2nd St, Douglas, AK 99824, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/72d451ca-9331-11ea-b7e8-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5986178292203056039",
  "source": "GoogleMaps",
  "reviews": [
   "Some of the best pizza I've ever had.  I've have only have a few items off their menu but they were all absolutely delicious.  Island Pub has a lively and high energy atmosphere.  It's a bit pricey and it does take them a while to bring you your food but it's worth the wait!  Recommended",
   "I really enjoyed the Island Pub. The Salmon dip was good and I thoroughly enjoyed the pizza. That grilled flavor in the pizza was amazing. Also, some interesting toppings are available for you to customize your pizza or try something new.",
   "If you're looking for a spectacular night out then this is the place. The food is always amazing and so fresh. This is where you want to go for one of a kind pizza (not to mention make-it-your-own). The bar is always busy and has a great drinking menu. Add in there an amazing view and you'll want to stay all night long. If you're looking for something lighter then head to the appetizer menu!",
   "This absolutely has to be one of the best places in Juneau. It is a gem off the beaten path and surrounded by many trails, beaches and various things to do while on Douglas Island. The staff were phenomenal; attentive, friendly, courteous, kind, cheerful and a real pleasure to be around. The restaurant itself was beautiful inside and out, very pleasing astetically, and immaculately maintained. And now for the food. Everything on the menu looked amazing but it was unfortunate the inability to try it all. The wings were fantastic and the steak sandwich was.as.well. Their pizzas and toppings had me wishing I could somehow make more room. I will definitely be hanging out there with every visit to Juneau!!!",
   "One of the best restaurants in Juneau if not the best. They rotate their beers on tap and always have something different. Pizzas #1 on the menu but everything is rather tasty. I’d recommend the salmon spread as appetizer and Perniola pizza (spelling?). Good service nice atmosphere good people. The newer Mikes Place for all you older Juneau locals"
  ]
 },
 {
  "name": "Pel'meni",
  "address": "2 Marine Way, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/73378230-9331-11ea-8de3-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=17854882284906126506",
  "source": "GoogleMaps",
  "reviews": [
   "I stop by here almost every time I am in Juneau. Very small place with hip feel and the best pelmeni I had anywhere including during my trip to Russia. Open late night after midnight is obviously huge plus.",
   "2am food or an afternoon snack. Pel meni is delicious at any time of day. 🌙",
   "what an interesting vibe, this place. They have a wall full of records and are always playing oldies. The food was really good. I never really experienced Russian dumplings, but that was really really good.",
   "Place is loud. If that doesn't bother you, perfect! If it does, you might not like dining in here. It's also small and not suited for large crowds of people. The food is decent and doesn't cost a lot of $$$.",
   "Delicious dumplings! Only two things on the menu: potato or meat, makes it easy to order.  Make sure to add some of the house hot sauce."
  ]
 },
 {
  "name": "In Bocca al Lupo",
  "address": "120 2nd St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/738d452e-9331-11ea-bbd0-14b31f159f22.png",
  "tags": [
   "creative",
   "food",
   "food",
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10260031407758961251",
  "source": "GoogleMaps",
  "reviews": [
   "Lupo is my go-to restaurant for date nights with my fiance, girls nights with my friends, and for special dinners with loved ones visiting from out of town. The menu is a combination of super flavorful dishes that meld innovation with tradition. If I can, I try to order from the specials menu, as these are usually a nod to the most seasonal ingredients and creative dishes. I'm grateful that the Lupo team creates incredible food while also keeping the atmosphere of the restaurant relaxed and down to earth. Thanks for keeping us full and well fed, friends!",
   "A must see when in Juneau. Hey cruise ship people get off that boat and go in town, away from the crowds to this super amazing restaurant making everything from their own cured meats, fresh mozzarella and scratch made dough. The wines are good, service super friendly and they even have a cute little patio. The deli is right beside to hook up on great to go stuff. Get anything with the local basil. It packs a punch. \nPlease follow @joannasable on instagram for more food and travel fun.",
   "wow! They provide a really great dinner experience for us. We weren't sure what to expect, but by looking at the menu we knew it was going to be good. When we got there was even better than we could have expected. Such a family atmosphere, great wine, great food, and a really nice staff. We really enjoyed ourselves.",
   "I felt like everything was there to make for a great experience. Great atmosphere, quality food and wine. They weren't very busy, yet the service was only so so. I rarely mention this kind of thing, but it was worth pointing out.",
   "Not particularly impressed for lunch. Had the meatballs and they were very dense. Flavor was fine but nothing to write home about. Had to ask several times for salt and pepper. I've heard dinner is great but I didn't find anything special about the small lunch menu or food."
  ]
 },
 {
  "name": "Pier 49",
  "address": "406 S Franklin St Suite 102, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/73dfbefa-9331-11ea-9e5a-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "tour",
   "food",
   "food",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=9166874868767222319",
  "source": "GoogleMaps",
  "reviews": [
   "This is a solid alternative to Tracy’s Crab Shack if the lines over there are turning you off.  You can get great Alaskan King Crab Legs, crab claws, soup and non seafood offerings. They also have mixed drinks and Alaskan beer.  They also have plenty of outside seating with a nice harbor (cruise ship) view.  Prices are high, but you are in Alaska and that is to be expected so be prepared.  Service was good and the food was served quickly and hot!",
   "Great food, view and staff! King crab legs were so fresh, better than ones we had on a crab boat tour! Salmon wrap and buffalo burger were delicious as well. Staff was great and drinks were as well. The views from deck are beautiful and our boys enjoyed playing cornhole while waiting.",
   "There are space heaters here to ward off the brisk Alaska air as well as a covered outdoor patio with plentiful seating.  The food came fast and hot.  I felt like the prices were reasonable and the staff was friendly as well.",
   "Really enjoyed it. Our bus driver was a chief and he shared great stories. The movie was very interesting. Totems were beautiful. Sitka is a pretty town. Friendly people.",
   "I ordered their salmon burger, Juneau Glow( a ginger beer drink) and Bear Creek Strawberry Rhubarb(a wine). \n\n-I don't like that neither the person preparing the meal or the person taking my order could describe what flavor components were  on  the burger and instead just tried to describe what salmon taste like. Saying that it's a \"fishy fish\". I think anyone ordering salmon knows what it taste like. I'm trying to know what  the burger will taste like after you put whatever you're going to on it. But they couldn't understand that for whatever reason. The cook even had a  confused look on her face, which I couldn't understand. I think it would be very odd if no one has ever come here wanting to know what's on or in their meal. But I decided to give it a try anyway since I had a taste for salmon.\n\n-I felt that the salmon wasn't seasoned and that a lot more of the spread( whatever that may have been) should have been used on it.\n\n-The beans were really good and very well seasoned. So it's a bit shocking that the salmon wasn't.\n\n-The Juneau glow was one of the best drinks I've ever had in my life. I'm not a big drinker, I don't like regular beer and I don't like straight alcohol. I always go for a mixed drink and I was just saying earlier that day I want to find some ginger beer. So I was really happy when I saw this on the menu! It consists of lemon juice, blackberries, rose vodka and Ketel One Botanical grapefruit.\n\n-The strawberry rhubarb wine was a little bit too sweet for my taste. (Not their fault)\n\nI'd come back, I'd just try something else."
  ]
 },
 {
  "name": "Kitchen of Thai Curries",
  "address": "224 Seward St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/74619994-9331-11ea-b109-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "unique",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6628174324026229887",
  "source": "GoogleMaps",
  "reviews": [
   "Fabulous find. Quality Thai food at low to moderate prices. Favoured by locals. Friendly, fast service. Highly recommended.",
   "My absolute favorite in downtown Juneau! Friendly, fast, delicious, and reliably excellent food and service. Great price for the amount of food they give you- I get 2-3 meals out of a full size curry.",
   "Really unique setup and decor. Nice prices and good portions. I ordered the green curry shrimp.My only complaint is that they were skimpy with the shrimp. I only had three in my curry. 😒 The staff are also very friendly and polite.",
   "In Juneau it's hard to find good service and bang for your buck when it comes to food. \n\nThis was my first time stepping in and I was amazed by the prices and the servings. I got a large chicken yellow curry plate for 9 dollars and something and got more food then I could eat. I had to take some home.\n\nCurry was incredible, serving size was shocking,  staff so accommodating, nice and polite.\n\nI am a new regular.",
   "Tasty selection of curries at a fair price. Large portions that are easy to split and take to-go. Options for everybody, including vegetarian and vegan."
  ]
 },
 {
  "name": "Suwanna Thai Cafe",
  "address": "8800 Glacier Hwy #100, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/74d78d34-9331-11ea-b383-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11266638648483131820",
  "source": "GoogleMaps",
  "reviews": [
   "Nice little Tai spot. Great place if you want to pick up for take home or to go. Wouldn't dine in seating is very limited.",
   "Great service, great prices, great food!! The only thing is stay away from is the spring rolls - not as good as the other meals/appetizers on the menu",
   "Staff are friendly and the business is always clean. I can't complain about anything, its Thai(ish) food in Juneau.",
   "I like the curry, but our group got split up and I had to wait to eat due to social pressure. Food was fast for me at least.",
   "Friendly quick service, even when you come in 5 minutes before close! Love their summer rolls, super filling and very good."
  ]
 },
 {
  "name": "Pucker Wilson's",
  "address": "311 Whittier St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/753df24a-9331-11ea-8a1f-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16014044111389742952",
  "source": "GoogleMaps",
  "reviews": [
   "Best burger and fries in Juneau. Can get pretty busy in the summer, best to get there a bit before the noon rush. They frequently have great specials (brisket philly cheese steak, pulled pork poutine, chicken gyro, etc). However my favorite is the Husky Dawson (burger with onion rings and bacon) and the 3-way fries (french fries, sweet potato fries, and fried brussels sprouts). Enough to feed 2 people. Friendly service. The owner is great and very personable. Prices are a little high, but worth it for the taste and quality of food.",
   "Great food! Cowboy Sundae is wonderful! Short walk from the cruise ship docks.",
   "Burger is good, fries not, sitting outside might be alright when it's not raining, but we live in a temperate rain forest where it rains almost every day.",
   "Without question the best burger in Juneau. Deserves six stars.",
   "Delicious food, good pricing and fast service."
  ]
 },
 {
  "name": "Four Plates Cocina Peruana",
  "address": "10002 Glacier Hwy, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7598f5ae-9331-11ea-9c41-14b31f159f22.png",
  "tags": [
   "delicious",
   "walk",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15368801635075766848",
  "source": "GoogleMaps",
  "reviews": [
   "The chicken stew plate was good!",
   "We had a two hour layover in Juneau so we thought to walk somewhere for lunch. Took about ten minutes to walk there but was worth it. The bacon empanada was phenomenal. I assume it's a new item because it wasn't on the menu but it probably will be soon.  I also had the chicken stew thing and that was so flavorful and delicious. Definitely going there again next time I fly through.",
   "Four plates has 4 main dishes on the menu, we ordered the first, a savory and simple chicken potato stew, served with rice. Everything was a huge portion, the staff were friendly and happy to answer questions. The dish was well seasoned, but didn’t have the intense flavors/spice of Mexican food, the potatoes and chicken were tender. We also had a Caesar salad (huge amount of salad) and a churro for dessert, all of which I would recommend.  I had no expectations and left very full and happy!",
   "The service was amazing, and the food was unexpectedly delicious. The bacon empanada is to die for! I didn't experience anything here I didn't like. Perfect! Exactly what I want when I dine in.",
   "Food is so flavorful! Two words BACON-EMPANADAS 😁"
  ]
 },
 {
  "name": "Canton Asian Bistro",
  "address": "8585 Old Dairy Rd #105, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/75fea0d0-9331-11ea-b087-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "walking",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11541992193743484410",
  "source": "GoogleMaps",
  "reviews": [
   "If I lived in Juneau , I would happily go broke eating here every week. The staff is amazingly friendly and engaging and the atmosphere is wonderfully comfortable. A fusion of all things Asian, and uniquely Alaskan. The saki is good, sashimi is terrific. Tuna, salmon, snapper . Each with its own flavor and texture. This is a gem of a restaurant.",
   "The sushi is really good. The only time I had a Chinese combination it wasn’t good. The sauce was way too sweet and tasted store bought. Its expensive for the sushi you get and customer service is a hit or miss.",
   "ALOT of food was served, however we did not even eat half of what we were served because it wasn't very good. It was missing the flavor and spice that you typically get with a good Asian restaurant at this price point.",
   "THIS IS very very good Chinese and their food could be in any big city!!! & we are from a big city in lower 48 .. we tried their California roll as appetizer .. it was very fresh & very good as well..I feel lucky to have this NICE restaurant in Juneau while we are here!!!!!!  AND ..Service was excellent!!  thank you all from the front walking in (hostess is so sweet) to the kitchen!  🥠🥟🥡 thumbs up!",
   "This restaurant has a nice atmosphere and the staff is very friendly and helpful. The food is to die for and comes out in a very timely manner. A-1 traditional asian meals."
  ]
 },
 {
  "name": "Juneau Pizza",
  "address": "9342 Glacier Hwy, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/76608180-9331-11ea-a90f-14b31f159f22.png",
  "tags": [
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=12510735951322170178",
  "source": "GoogleMaps",
  "reviews": [
   "Very good pizza and service. The food did not take long at all.",
   "Best pizza in the valley. A bit higher in price but so worth the extra cost. Highly recommended.",
   "It would be nice if the hours posted online were the actual store hours.  I have shown up twice to find that the restaurant isn't actually open even though the business hours online say it is.",
   "Best pizza in Juneau. Owner operator chef serves a top quality pie with generous slices and sizes. \nFamily style meals in a modest setting.",
   "The best pizza in town homemade Juneau pizza made by Marine Brown and Laura Sheldon"
  ]
 },
 {
  "name": "El Sombrero",
  "address": "157 S Franklin St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/775fad5e-9331-11ea-ac71-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6571379327820465046",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent local Mexican joint. You don't go for the ambiance... You go for the huge servings and excellent food. Food is made to order fresh, customizable and amazing. Staff is friendly and fun. Price is good given the sizes. Salsa is some of the best we've had. Highly recommend.",
   "Best Mexican food in Alaska and most probably north of Mexico!!! The last time I ate here was in 2006 and now in 2019 the food tastes the same :AWESOME!! Excellent service by staff! A happy place. And not expensive. I highly recommend this restaurant if you are ever in Juneau, Alaska. The last place you'd expect great Mexican food!",
   "A wonderful service excellent food. Took real good care of us.",
   "This is a great, quaint little Mexican restaurant I go to every time I go to Juneau. It's easy to walk to, has great service, and delicious food! I just wish their salsa was spicier.",
   "My favorite restaurant ever. I will always get the #16 The Burrito Especial ♥️"
  ]
 },
 {
  "name": "La Salsa Mexican Food",
  "address": "8745 Glacier Hwy #32a, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/77b9db90-9331-11ea-ad83-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "family",
   "eat",
   "food",
   "eat",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=17509264862923578790",
  "source": "GoogleMaps",
  "reviews": [
   "This food is great! Best Mexican in town without a doubt!\n\nBest hot sauce ever too!\n\nThe folks that run it are super cool n nice too",
   "Best mexican food in town, great prices and great service ",
   "This family run restaurant is second to none! They serve quality authentic Mexican cuisine at reasonable prices. The food is delicious and plentiful! I eat here whenever possible!",
   "My favorite place to eat Mexican food in cheer now I love the super burrito and nachos and chicken wings",
   "Surprisingly delicious. They also have a great red chilli sauce thumbs up!"
  ]
 },
 {
  "name": "Alaskan Crepe Escape",
  "address": "356 S Franklin St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7814d9a4-9331-11ea-8006-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7518705161823511113",
  "source": "GoogleMaps",
  "reviews": [
   "I really liked the smoked salmon crepe. Plenty of filling in a soft and slightly sweet crepe with crispy edges. And it’s $2 off after 5 pm!",
   "Absolutely amazing!! Fantastic customer service and the smoked salmon crepe is insanely delicious. Will definitely return. Highly recommend them.",
   "I stop here every time I'm in Juneau. These crepes pack so much flavor and taste it's just amazing. Either you choose sweet or savory, you won't go wrong. Prices are a bit higher but it's worth every cent. Plus the service is fast and the girls are beyond nice and sweet.",
   "Ooomyygoooshhh. Where have you been all my life....This was SOOOOO FREAKIIIIIINNNN GOOD!😋 I got the Gastineau( Which is a smoked salmon dip, topped with smoked salmon, red onions, spinach and cheese.) and it smells so freakin DELICIOUS! And it taste as good as it smells! I WOULD DEFINITELY RECOMMEND and REPURCHASE!  I'm sooo stuffed right now.😊",
   "I only tried the Gastineau crepe which includes smoked salmon, spinach, and cream cheese and I would definitely go back for more if I ever visit Juneau again.  It was very filling and they don't skimp on the salmon!"
  ]
 },
 {
  "name": "Saffron Indian Comfort Cuisine",
  "address": "112 N Franklin St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7870b57a-9331-11ea-ac94-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "food",
   "delicious",
   "economical",
   "food",
   "free",
   "food",
   "music",
   "kids",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16903648800484835824",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome food and drinks at Juneau, Quality Indian foods, Delicious Atmosphere with Free Wi-Fi....",
   "Delicious fare, excellent price. Probably the most economical meal I've had in Alaska. Convenient distance from hotels and downtown. Stellar customer service. Group of four ordered a variety of foods from the menu and all were pleased with the quality and taste of the food.",
   "Very authentic cuisine. Friendly service and excellent food. Fair prices. Nice decor and music. Free WiFi. Great place for a date.",
   "Good restaurant and great service. \nView is amazing and they do offer Buffet as well as a-la-carte service.\nVery easily accessible and staff is friendly strategically located in busy official area so the clientele are very decent and you can enjoy quite meals.",
   "One of my favorite restaurants in Juneau, true comfort food. The prices are about average or a little below average for this community. The food is really good, some items from the menu are better than others, I really like the paneer. The food is seasoned, as Indian food should be, but it's not too spicy for the kids. We order 3 small dishes to split between a family of four and leave with leftovers."
  ]
 },
 {
  "name": "Asiana Gardens",
  "address": "9116 Mendenhall Mall Rd, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/78d1bc9a-9331-11ea-ad9c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6953661049756675110",
  "source": "GoogleMaps",
  "reviews": [
   "I visited Asiana Gardens for my first time this memorial day and had a wonderful experience! My server Kim(?) was very sweet and attentive. She suggest a wine and and a plate and I was happy with both! Thank you!",
   "They misheard my to-go order and prepared the wrong menu item (probably my fault). They corrected it on the spot with no extra charge.  Excellent service and food. Great restaurant with great staff.",
   "Staff very helpful, variety of food. Food came out fast and was good. Have a special birthday song for all yo hear.",
   "Good food and pretty good customer service. Their lunch bowls are my favorite and they are a good deal.",
   "great restaurant if you want lunch or dinner, with great prices , not very pricey."
  ]
 },
 {
  "name": "Tracy's King Crab Shack 2",
  "address": "300 Whittier St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/79281a40-9331-11ea-9e94-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7713513863015779768",
  "source": "GoogleMaps",
  "reviews": [
   "Great for tourist, not locals.   Come here for lunch if you want to spend $$$.\nNice atmosphere, eat outside, inside tent is hot AF though.  Military discount ( but not applied).  \nI recommend the crab bisque ($10), a roll, and an Alaksa Amber beer.  Nice, sweaty view.",
   "The crab legs were wonderful. The bottle prices on wine we're reasonable. It's costly, but it's an experience.",
   "Loved every bite of this establishment. Fresh food, large quantities with excellent service. Mini crab cakes were excellent along with the humongous crab legs. The crab bisque was to die for, bountiful chunks of crab fills every cup.",
   "What a great place to get some delicious king crab.  Not nearly as busy as their other location. Plenty of seats, good looking location a little out of the way but worth the walk.",
   "Excellent, giant King Crab legs.  Walk to the one on the edge of Juneau....much more scenic than the one downtown."
  ]
 },
 {
  "name": "Valley Restaurant",
  "address": "9320 Glacier Hwy, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/798e0d74-9331-11ea-867b-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3275991287761775896",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to eat, friendly staff, quick eats and generous portions.   Thanks valley restaurant for having great food for our short stay in Juneau.  Your restaurant will be on my list to visit my next trip to Juneau.",
   "Amazing teriyaki chicken with a fried rice substitute. I like my meat saucy and they did not disappoint. also my girlfriend Hannah says ‘good atmosphere’",
   "We ate breakfast here.  We got the breakfast garbage plate which was big enough for two people.  Think breakfast skillet.  We enjoyed it; I'd order it again.  The place isn't fancy, but it's got local look and feel.  No experience with lunch or dinner choices.",
   "My husband & I have eaten here numerous times in the past 3 weeks & I seriously think that their FRIED RICE (I've had pork & shrimp) is the best I've EVER had!!  My husband gets the ham & cheese or bacon & cheese omelets & he said awesome as well!!  Their hashbrowns are outstanding in taste..I know because I eat his!! The service from the ladies in this place is VERY good as well .. very attentive .. like the review above me says .. it's a homey kinda lil town place but if you are looking for a reasonable $ meal (hello Juneau 😳) this is your place!! i highly recommend!! yum",
   "Good food reasonably priced"
  ]
 },
 {
  "name": "Grumpy's Delicatessen",
  "address": "175 S Franklin St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/79ea8bb8-9331-11ea-94fd-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1004808158321033425",
  "source": "GoogleMaps",
  "reviews": [
   "One of my favorite things about Grumpys is the website name. Next favorite would have to be the chicken bacon ranch wrap.",
   "Friendly service, nice selection of a variety of food, and well lit and pretty decor.  Prices are higher than a dive dinner, but the ingredient quality, particularly for the smoothies and juices, is as good as you're going to find commercially in Juneau.  Oh, and tasty!",
   "Solid sandwich option downtown with seating",
   "Love this place and how the owners are there taking care of their customers! Thank Andy and Jamie for being SO awesome!",
   "Grumpy's is amazing. Get the Andy's Pastrami with horseradish and pickles. Also, their juices & smoothies are the best in town. Great location, quick service, friendly people, wonderful food -- what's not to love?"
  ]
 },
 {
  "name": "Poki Poki",
  "address": "172 S Franklin St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7a4a8658-9331-11ea-959f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7873879239218044153",
  "source": "GoogleMaps",
  "reviews": [
   "Great poki, quiet spot.",
   "Came here in the afternoon during the summer. Place was dead. Ordered a pokebowl. Nothing fancy. Half the fish was frozen. For a place by the water can they not get fresh fish? That's really important when serving raw fish. \n\nOtherwise the place was clean, and staff friendly.",
   "The food is aways fresh, the employees are super friendly, and I always feel good after eating there. The prices are good for how much you get. Definitely recommend",
   "I love the food and love the service. Always friendly and personable.",
   "Amazing food and excellent service."
  ]
 },
 {
  "name": "Devil's Club Brewing Company",
  "address": "100 N Franklin St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7aaff7d8-9331-11ea-b5e9-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "brewery",
   "knowledgeable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16572796311108016503",
  "source": "GoogleMaps",
  "reviews": [
   "As someone who travels most of the year for work, I am always interested in local beer culture when visiting. Found this downtown microbrewery on a snowy Sunday when in Juneau for work. Small food menu, but the pretzel with beer cheese and bbq pork sliders were both tasty. Staff was very friendly and the vibe was warm despite the frigid temps outside. I am not sure how it is when the cruise ship mobs are in town, but on a quiet, snowy Sunday, it was a great find after a 10 hour travel day!",
   "Good company can be enjoyed with good beer in this renovated theater turned brewery. They mostly serve beer, but there is also food to purchase. \nI believe Devil’s Club is quickly outgrowing their current space as there are often many people at all times, but that’s also a testament to their local popularity. 🍻",
   "There is an unexpected treat for beer lovers in Juneau and it’s The Devil’s Brewing Co. on Franklin St. \n\nThe Devil’s Brewing Co. is a 21st century brew pub with a polite staff, who is highly educated about beer. With gleaming blond wood surfaces, the pub’s industrial feel and gender indifferent bathrooms make this Brewing Co. feel plucked right out of a big city. \n\nCheck out the board for the names of the beers on offer. Or for an even better description ask the staff. You will be treated to a surprisingly knowledgeable and descriptive account of each variety. \n\nMake certain to include a stop at The Devil’s Club Brewing Co. as a part of your Juneau excursion. \n\nTheBillo313",
   "Came in off a cruise ship. Very impressed by their selection of beers and food. Pretzel and beer cheese is amazing! Area has lots of seating and can be a quick stop on your day in Juneau. Highly recommend!",
   "I liked all of their beers and the food we had was great! Get the pretzel and beer cheese, the chips and salsa, and the popcorn. But really everything is good here. The problem is it gets hot in here. Was 77 outside. They have fans to help move the air but on a summer day in Juneau it didnt feel like enough."
  ]
 },
 {
  "name": "Little Tokyo Juneau",
  "address": "140 Seward St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7b1780c6-9331-11ea-a3bd-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17530105137901118887",
  "source": "GoogleMaps",
  "reviews": [
   "Little Tokyo always has good food, plus the tea and soup is always hot. 🍵 🍣 🥢",
   "The service was overly pushy and gave us little to no time to find out what we wanted. Also the sushi was very middle of the road, not bad but nothing spectacular.",
   "Fairly good sushi. Haven't been to any other Japanese restaurants in Juneau but they seem to have decent food. Not far from the cruise ships.",
   "Best place for sushi",
   "The Las Vegas Sushi Roll is absolutely phenominal."
  ]
 },
 {
  "name": "Lemon Tree Café",
  "address": "230 2nd St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7b7ee402-9331-11ea-b49f-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "family",
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=568171349351789799",
  "source": "GoogleMaps",
  "reviews": [
   "This is probably my number one food spot in Juneau. Food is excellent, service is friendly, and food comes out quick, hot, and fresh. Favorites include the old friend noodle soup, chicken steam buns, and cold noodle salad. Only cons are that the seating is very limited (get there early for lunch) and the cafe is insufferably hot. Cannot recommend enough.",
   "I am so glad I found this place.  I ordered the spicy beef noodle soup, curry chicken, and shrimp dumplings.  They were all amazing and was given a steam bbq bun as a compliment.  I will definitely come here again when I visit Juneau.  It’s a small little restaurant right in downtown Juneau and parking was a little hard but I found a paid to park just up the street.  The waitress was super sweet.  You order up at the counter, grab your own drink from the cooler and the food is brought to your table.  I want to try the Beef Stew Rice and the Bun Cha next time I am here.",
   "Great family run restaurant. I had the Old Friend Noodle soup. It was spicy and loaded with meat, tofu and noodles. I’m looking forward to going back and trying something else.",
   "Nice traditional portions, good flavor and (But not as flavorful as others I've had.)  cheap. I ordered the tofu noodle bowl.",
   "Love this place! It is my favorite place to go on dates with my grandson."
  ]
 },
 {
  "name": "Mar y Sol Mexican Food",
  "address": "617 W Willoughby Ave, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7c153122-9331-11ea-b5cb-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16695074252830294515",
  "source": "GoogleMaps",
  "reviews": [
   "My first time eating from here and all I think about is the money I've wasted cooking when I could have spent it here. Im writing this as I eat my tacos because they are amazing and deserved a 5star rating immediately. They are delicious and cooked perfectly. Everything from the onions to the lime and green salsa this is exactly what I was wanting. Thank you. I will definitely come back.",
   "What they offered was alright, but I love a good Al Pastor, a marinated succulent pork when not overcooked, not on their menu, or a tasty sopa, a Mexican soup, not on their menu.\n\nThe quality is good, but in this catagory, I would like to taste a great, tasty Al Pastor burrito.",
   "Amazingly delicious and authentically Mexican food! You will not go wrong with any dish that you choose! Absolute favorite. I recommend this establishment to everyone!",
   "Love their authentic street taco fare. I wish we had even more options like from back home, like Tripe, etc. Their lengua is great though!",
   "This place is absolutely immaculate! The ambiance was next level. I felt like a was in a mexican romance novel with my boyfriend. The wait responed non verbal dinning cues like sticking the menus out to the side and noticed as soon as we finished out water. THEY HAVE A HOMEMADE SAUCE BAR. GO NOW ITS THE BEST!"
  ]
 },
 {
  "name": "Bernadette's Fast Food",
  "address": "225 Front St STE 101, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7c6ec310-9331-11ea-b416-14b31f159f22.png",
  "tags": [
   "free",
   "eat",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17413191432346007227",
  "source": "GoogleMaps",
  "reviews": [
   "Bbq and dinuguan is the best you can eat in Bernadette's Fast Food. Amazingly located in Juneau Alaska. Thanks to cruise ship and because of pinoy seaman crew members who missed so much eating pinoy dishes the only place I go since before is this fast food. They have a satellite food stall by the park where most Filipino crew members are lining up to have their popular bbq combo either shanghai with dinuguan even with papaitan. Even foreign nationals or American are curious to have the bbq as the smoke smells all over the place. They also sometimes have free donuts or desserts that make you surprise. Wifi is also available and other filipino dishes are also served. Please come visit Them!",
   "Love the ethnic cuisine, diversity, smells and flavors best place ever to eat \" spicy squid \"*****",
   "Indonesian and Philippines food good for them and tasty cuisine",
   "Very good restaurant",
   "Hella good"
  ]
 },
 {
  "name": "Douglas Cafe",
  "address": "916 3rd St, Douglas, AK 99824, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7cbd33d8-9331-11ea-91b3-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11481256411726466156",
  "source": "GoogleMaps",
  "reviews": [
   "Pricey for a burger joint diner but food and service was awesome and quick",
   "Good times with friends and the people there treat you like family!! 😊",
   "Amazing breakfast. Their special skillet is well worth trying out and while I had never heard of a breakfast version of fried rice it was awesome. Service was very personable too.",
   "Cozy place with great food and pleasant service.",
   "Great staff, delicious food, quant setting. "
  ]
 },
 {
  "name": "Korea Garden",
  "address": "124 Front St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7d1c6b06-9331-11ea-b079-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16704993963048409631",
  "source": "GoogleMaps",
  "reviews": [
   "I'm on a plant base diet and found something on the menu for me to eat. I had the vegetables over white rice which was amazing!",
   "Their meatball pho was very good and tasty.\n\nThe chef/cook doesn't have the basic cooking skills mastered: cooking protein.  The shrimp in their tempura was overcooked, rubbery.  To add insult to injury, they served the rubbery, overcooked tempura with sweet and sour sauce instead of a tempura dipping sauce.  How unauthentic and a disgraceful to Japanese cuisine.\n\nThe same people also own Asians Garden in the valley, and Little Tokyo also downtown a short distance away.  The same low bar - overcooked protein, pork in the katsu.  If you have no connotation, ignorant, or just don't care, come over and dine at this inferior establishment in ignorant bliss.",
   "I am loving it. Nice Sushi. Friendly staff. I love the fortune cookies. The food is nice. Nice place to have a friendly meet. Sushi is the best!!!! Must try when you are in Juneau.",
   "The location is easy to find. The food are so delicious but my favourite are the meatball. The owner are friendly. And they have a strong wifi as well.",
   "Excellent! Had the Bento box with Bulgogi, tempura shrimp, deep fried pot stickers, japcha, salad and steamed rice. Hit the spot for my Asian cravings. Fast service and polite server! So happy I went there 😊"
  ]
 },
 {
  "name": "Raven Cafe",
  "address": "395 Whittier St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7d795850-9331-11ea-83f8-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5922959623024035610",
  "source": "GoogleMaps",
  "reviews": [
   "Good spicy pork adobo. Pretty fast to serve too.",
   "After visiting for an event at APK aka Alaska State Museum, the Raven Cafe is inside the museum building.  Ordered a pork (or chicken) adobo burrito mild, comes with sour cream, garlic rice.  Delicious, tasty, moist, succulent pork, not overcooked.  And a mocha coffee.  A burrito with a Filipino taste, great place too go, share a meal with a friend or loved one.",
   "We had a great barbecue sandwich and drinks! A very nice couple runs the cafe, supplying good food and friendly smiles. We were pleasantly surprised by the food and friendliness.",
   "Great food! Nice people!",
   "Awesome food and excellent service!"
  ]
 },
 {
  "name": "Chan's Thai Kitchen",
  "address": "11820 Glacier Hwy, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7de10894-9331-11ea-a1d3-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "family",
   "eat",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12343976354963158092",
  "source": "GoogleMaps",
  "reviews": [
   "While it may not look like a 5 star restaurant, the food is AMAZING and their Thai ice tea is the best in all of Juneau",
   "Great Thai food made to order. Best in Juneau! Try the spring rolls. Since everything is made to order can get backed up, but your patience is rewarded with great food!",
   "Great food, great prices, huge portions !",
   "Good service and amazing portions. You could have several meals from one order which makes it a good value. The food isn't amazing but it's good enough. Plus you can eat looking out at the views of Alaska which is something in itself. I think if a family was hungry after whale watching or fishing this would be a great place to grab a quick bite.",
   "Best Thai food in Alaska!!! I don't let family leave Juneau without going to Chan's at least once. The chicken satay with added spice is my favorite."
  ]
 },
 {
  "name": "El Zarape",
  "address": "1961 Anka St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7e3bd30a-9331-11ea-bc0c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1445025466528745077",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome food. My smothered burrito was big enough for two meals! And tasted great!  Just what I needed today. A new favorite place. Thanks!",
   "This is the best Mexican food I have had in the state of Alaksa. They are not going to win a decor award, but the best places never do. They could serve their food anywhere and it would speak for itself, it's just that good. Very authentic and homemade flavor!",
   "Very good authentic food. Super nice folks. The view outside was incredible.",
   "Best authentic Mexican food in town. They have awesome customer service and warm environment. If I had a complaint it would be the parking situation but that's all I could say negatively about it.",
   "That hot sauce went deliciously with my enchiladas. Good portion size for lunch or dinner."
  ]
 },
 {
  "name": "The Hot Bite",
  "address": "11445 Auke Bay Harbor Rd, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7e969ea4-9331-11ea-8613-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8940887134410523831",
  "source": "GoogleMaps",
  "reviews": [
   "Local restaurant located in the marina.  Burgers are good milkshakes of all flavors . Outside seating to watch the boats come in.\n Two young eagles on the dock.",
   "I was disappointed in every aspect of this establishment. The restrooms were atrocious, the service was sub par, the burger was mediocre. They were out of several items. The food was overpriced for the quality.",
   "The quality of food has dropped the last couple of years. I'd only stop in if I was craving a milkshake, but everything is too overpriced for me to be a regular. Plus, they're only open during the summer. It would be great to have a good burger option in the university campus area.",
   "Best place in southeast AK for burgers and shakes.",
   "Always renowned and authentic.  Classic burgers and fries with real milkshakes. Old fashioned style and service."
  ]
 },
 {
  "name": "Bowl of Pho",
  "address": "9121 Glacier Hwy, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7f07d734-9331-11ea-92f9-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12642755692494246509",
  "source": "GoogleMaps",
  "reviews": [
   "This place is so good! Like 10/10 would recommend. The food was not only delicious but also presented very well. I forgot to take pictures before we started because it looked so good!",
   "Dishes weren’t clean, server was talking on his phone while taking our order, didn’t even bother to count our change correctly, AND offered to bribe us with a discount if we left a good review. Table was sticky, sauces on the table were left open and had dried remnants from previous uses, server didn’t come back to check on us once and we had to ask for the check. The only thing good about this place were the rabbits on the tv. Food was okay but definitely not worth the trip.",
   "Friendly and timely service. Food was delicious, great flavors. Nice addition to the juneau food scene",
   "Really good pho! Wish they had more vegetarian options",
   "Great customer service and food was wonderful."
  ]
 },
 {
  "name": "The Udder Culture featuring Aurora Sweets",
  "address": "9105 Mendenhall Mall Rd # 146, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7f5a7f92-9331-11ea-a7ba-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2023749830472414352",
  "source": "GoogleMaps",
  "reviews": [
   "I had a fluke a couple minutes ago with Door Dash where over an hour had gone by and my order hadn't even been received yet. I called the restaurant directly and the sweet woman over the phone was nice enough to take my order for me, discounted an item after the side dish I wanted was no longer available, and offered to deliver it to me after they closed for the day so I still got my food. I was so happy with the service, I had to give them a review. Thanks for helping extending help to us locals at such a trying time in our world!",
   "Udder Culture best deal is their half a sandwich and a cup of soup daily special.  You may order generally any two meats, two cheeses, exception of bacon, a refill on your cup of soup until they run out, so to get the best possibility, come by 13:00 as their soups run out.  They have shrimp croissant on Wednesdays and Fridays.  They have nonfat or lowfat frozen yogurt.  Baked potato is available.",
   "My sandwich could have been better, but the service was nice. I like the updated decor and food options. I was afraid the Udder Culture vibe would be lost with the new owners, but it's pretty much stayed the same. Except the milkshakes aren't the same.",
   "So I have to start by saying this review is over 20 years in the making. I moved to Juneau in 1993 and sometime there after I had the creamy split pea soup and it changed my life. I, literally, to this day remark about that split pea soup. No split pea soup has ever compared to it. I am reviewing the cafe from when I knew it. But reading reviews it sounds like its the same. Kudos to you guys! I've traveled the world now and can say I STILL have not had a better split pea soup.",
   "Smashing! Great Food and Excellent Customer Service. I'll definitely make it a point to come back again. Highly recommended."
  ]
 },
 {
  "name": "Juno Froyo",
  "address": "8585 Old Dairy Rd #103, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7fbaef66-9331-11ea-90b8-14b31f159f22.png",
  "tags": [
   "kids",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=2283640584071104749",
  "source": "GoogleMaps",
  "reviews": [
   "I am not a huge fan of frozen yogurt. I did get a custard option, however it wasn't great. On the other hand, the toppings selection is without compare. So many choices for what to add to your sweet treat. Great place to take the kids!",
   "Nice place w/a decent selection of flavors. Very clean on the inside, and cashiers are usually cheerful.",
   "Delicious ice cream & frozen yogurt with chill atmosphere and friendly staff.",
   "Great staff/owner. Obviously, good frogurt!",
   "Great variety of flavors and toppings, friendly service. It really hit the spot!"
  ]
 },
 {
  "name": "Timberline Bar & Grill Atop Mount Roberts",
  "address": "3M0000MSU010, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/803cc9ee-9331-11ea-9817-14b31f159f22.png",
  "tags": [
   "free",
   "nature",
   "walking",
   "theatre",
   "tour",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6372639171654457934",
  "source": "GoogleMaps",
  "reviews": [
   "A lovely little nature centre atop Mount Roberts, great for short tours and day trips. The walking trails are very interesting and we even got to see a porcupine. Our tour guide Lars was very helpful and made the tour incredibly entertaining. The theatre has a short film the plays for free and the gift shop is better than most. The spiced apple cider was great and we even got to try some of the local jams and teas.",
   "Hidden gem ! Really great food and lots to explore! Definitely recommend this place but plan to bring an empty stomach!",
   "It was very wooded place and worth going up there for wide open view.",
   "Interesting place. Allow extra time to get back as the return line is longer at lunch time.  Views from the restaurant are limited and service can be slow. Nice film and intro about the native tribes. We did not have time to check out the trails, wishes we did. This is owned by the natives / locals so they need your support.",
   "Loved it! Beautiful views! Halibut fish and chips was excellent and blueberry pie!"
  ]
 },
 {
  "name": "The Grind Coffee",
  "address": "5461 Shaune Dr, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/80965bc0-9331-11ea-b384-14b31f159f22.png",
  "tags": [
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=11680847793304739205",
  "source": "GoogleMaps",
  "reviews": [
   "Thank you ladies for an excellent cup of coffee! Hot or iced, both delicious :)",
   "Good service and great coffee",
   "Best coffeee amazing staff",
   "Honest and friendly",
   "Best coffee in Juneau!"
  ]
 },
 {
  "name": "Subway",
  "address": "8777 Glacier Hwy, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/81023d64-9331-11ea-9c86-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7689968381242021167",
  "source": "GoogleMaps",
  "reviews": [
   "Hmmm, where to start: the employees are sometimes rude depending on who you catch on a given day/time, the food makes me sick for some reason, and overall, I wouldn't recommend this Subway. The downtown Subway seems to be a smidgen better than this one as far as quality of food and customer service.",
   "these folks should get an award!! Hands down the best service i have EVER had at any subway and just about any restaurant.  the line out the door took 5 minutes to check out w food in hand. and it was perfect.",
   "The redhead With the mustache was very nice and very helpful",
   "2 days in a row using the app to order. Mistake. Sub last night was ordered with 2x veggies came light. So today upon ordering a wrap I asked at pickup if the 2x veggies was given and told I dont know and we cant open to check. No surprise light veggies and no cheese. Last time using this location. Surprised at the lack of training.",
   "Staff was great"
  ]
 },
 {
  "name": "Buoy Deck",
  "address": "345 Egan Dr, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/818eed6e-9331-11ea-a419-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "cheap",
   "kids",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13004458984743228189",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome place to hang out and enjoy a beverage. I didn't try the food, the view is great and the bartender was awesome.",
   "note: Military ID required or civilian can be accompanied by military personnel\n\nGreat food, five rotating Alaskan Brewing drafts and five other drafts, nice view of the Gastineau Channel, darts, pool tables, shuffleboard, and foosball.",
   "Love this low-key bar. Great cheap eats, great cheap beers. Great on weekdays to bring your kids since its so slow. I love this bar.",
   "Great beer, great food, and the friendliest staff I've encountered so far in Juneau!",
   "Good food, well priced drinks and a cute staff."
  ]
 },
 {
  "name": "The Hangar On The Wharf",
  "address": "2 Marine Way Ste 106, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/81e9698c-9331-11ea-aa06-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "delicious",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11282324149351877967",
  "source": "GoogleMaps",
  "reviews": [
   "I HIGHLY recommend this restaurant.  Wow, what a fantastic dinner and introduction to fresh, Alaskan seafood.  Honestly, I was served the best Fish n Chips I've ever had, hands down.  \n\nMy son had some incredible, sweet and creamy oysters on the half shell, and coconut shrimp which was crispy and delicious.  My other son who is not a seafood fan, enjoyed a grass fed, organic burger, every last bite.  \n\nIt can be a little busy with 5 cruise ships in port in this tiny town of Juneau, Alaska's capitol city, but the staff work together like a well oiled machine and to ensure your meal is timely, hot, fresh and delicious.",
   "Appears as just another cruise ship shakedown restaurant but our experience was way better.  Lovely fresh fish and views.  Plenty of gluten free options.  Fast service.  Views.  Good for children.  Has highchairs.",
   "Great service. Delicious food. Perfect for the end of the night treat. Thank you so much Hanger staff! Great job all around.",
   "Without exception, the best halibut chowder, for that matter any chowder, we've ever had anywhere in the world. No exaggeration. Service was great. View of the water and ships accentuated a wonderful family dining experience.",
   "Soup is hot, beer nice and cold. Great selection, easygoing staff, lots of seating, great view. Nice to see the action in the kitchen. Bar menu and regular menu. Good specials. Always parking. Historical building."
  ]
 },
 {
  "name": "Twisted Fish Company Alaskan Grill",
  "address": "550 S Franklin St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/823cb9de-9331-11ea-bb27-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "tour",
   "delicious",
   "food",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6762552573929095279",
  "source": "GoogleMaps",
  "reviews": [
   "My brothers and I had a great time dining outside at the Twisted Fish! The staff was very friendly and helpful. We loved the waiter she laughed and joked with everyone at our table. She made our experience delightful.",
   "What a wonderful experience.  The food was plentiful and ferociously delicious and the service (despite being crammed from ships entering port) was spot on!   Get the full pound of crab legs so you don't leave wanting more!!!",
   "We had a quick stop in Juneau before a helicopter tour and it being my first time on a helicopter and not sure if I’d make it back in one piece, we decided on Twisted Fish for lunch beforehand in case it ended up being our last meal. It was delicious! I love a lemon butter caper sauce and the chef prepared it with halibut by request and it did not disappoint. After conquering my fear of getting on a helicopter (and safely landing), we decided to go back the same night for dinner. This time we celebrated with Alaskan king crab, cocktails and dessert. OMG the crab was amazing!! It’s definitely on the pricey side compared to back home but it was so worth it. Highly recommend getting the crab.",
   "Food 5/5 service 2/5 The food was very good and the portions were very large. We shared an appetizer and an entree. The crab and artichoke dip was amazing the baguette was soft and perfectly toasted. The halibut burger was very fresh and super delicious! The service was mediocre, the patio was not that busy but we didn't get our waters refilled and our food was delivered with out cutlery.",
   "A must dine experience in Juneau! For the view and the menu!  Grilled fresh Alaskan catch cannot be beat! Bling Blinky of TEXAS ?Shout Out: Right off of the ship walk on over on the cruise ship docks and take a seat! Loved it!"
  ]
 },
 {
  "name": "Forno Rosso",
  "address": "356 S Franklin St, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/82a9d3ec-9331-11ea-ac63-14b31f159f22.png",
  "tags": [
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5390664278068953766",
  "source": "GoogleMaps",
  "reviews": [
   "We ate at Forno Rosso for lunch in Juneau Alaska while there on a cruise ship stop. The pizza was incredibly delicious. They use the freshest ingredients (vegetables and/or meats), all locally sourced. Pizzas are cooked in a wood-burning oven and the flavors are delectable. A must visit place for a bite when in Juneau. We will definitely return.",
   "Amazing pizza! Go here and get the crab or reindeer pizza, they are incredible. \n\nIts actually a food truck on the other side of the road from where this shows.",
   "Soggy pizza.",
   "Hey that's pretty good"
  ]
 },
 {
  "name": "Devils Hideaway",
  "address": "11806 Glacier Hwy, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/830f9af4-9331-11ea-aa57-14b31f159f22.png",
  "tags": [
   "food",
   "history",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8389492162065760810",
  "source": "GoogleMaps",
  "reviews": [
   "Great dive bar restaurant combo that has pretty good burgers and fried halibut. Great prices for Alaska and a terrific view. Pool darts and corn hole. The bar is Squirez and the food service is Devil's Hideaway....two separate places. Great bartenders.",
   "GREAT GOOD and drinks. I was visiting for a week from California. My buddy from Juneau's Hidden History said it was the best burger and wings place in town. And boy was he right!!! I requested that we go back another 2 more times to get the \"3Bs\" burger! Sooo good!",
   "Great cheeseburgers!  Halibut or shrimp baskets recommended too.",
   "Food's good. Good music. Nice view.",
   "Cozy little locals place with Killer food and View of Auke Bay Marina.  Try the Triple B burger, Bourbon BBQ sauce, Bacon, Avacado, Blue Cheese Burger with their special Tots!  This is a cozy bar atmosphere with a side grill, a great casual place. Ignore the Anti 5-Star reviews and come as you are for some Great Eats & Enjoy the VIEW!"
  ]
 },
 {
  "name": "Northern Cuisine",
  "address": "9400 Glacier Hwy, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/840ebc0c-9331-11ea-a521-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=8089212498745944255",
  "source": "GoogleMaps",
  "reviews": [
   "Best new breakfast place in Juneau.  Very clean and neat kitchen and staff prompt service.  I ordered chicken fried steak it was hands down the best I've had in Juneau.  The steak was cooked perfectly with a crunch and the country gravy with sliced smoked sausage took it over the top.  Hash browns were crunchy eggs over easy toast and coffee  were perfect hot and delicious...",
   "Breakfast and lunch served from 0600 to 1400, dinner served Sunday through Thursday from 1700-2100, Friday and Saturday 1700-2200.  Alcohol purchases are charged on a separate credit card charge only for the reason the Frontier Suites Hotel holds the beer and wine license.\n\nEnter the restaurant through the Frontier Suites lobby immediately to your left.  Check to see what their white board specials are upon entering.  One of the white board specials is pork liempo never heard of before, pork belly that's succulent.  It came with pancit, rice, and supposedly lumpia which didn't come and I didn't noticed until later reviewing my photographs.  There was chicken breast meat in the pancit that was overcooked, dry.  The white rice was nice and fluffy though brown rice is healthier.",
   "It was good I'll definitely go back!",
   "Wonderful service, quick and delicious.",
   ""
  ]
 },
 {
  "name": "Costco Food Court",
  "address": "5225 Commercial Blvd, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [
   "food",
   "drink",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9801635367424919427",
  "source": "GoogleMaps",
  "reviews": [
   "Unhealthy food except the salad, tables to stand by or sit outside while consuming your food.  Hot dog and soda for a great price.",
   "The customer service is spot on but it often takes 10-15 minutes to get to the front of the line. Way too long for a lunch break. \n\nIf management could hire additional staff, adapt the new computer ordering system (like anchorage), or did another way to save time it would be well appreciated.",
   "Costco food court has the best prices on hot dogs in town. Dollar fifty plus a soft drink can't beat it.",
   "Very good food.",
   "The food is great for what you pay. It's a small food court, way smaller than what you would find in other stores down south."
  ]
 },
 {
  "name": "Sacred Grounds",
  "address": "320 Willoughby Ave, Juneau, AK 99801, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/847916e6-9331-11ea-b65d-14b31f159f22.png",
  "tags": [
   "eat",
   "walk",
   "drink",
   "drink",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=13451953473747792690",
  "source": "GoogleMaps",
  "reviews": [
   "Great coffee and I like the discount for bringing your own cup.  If you forget it, they do use biodegradable cups.   I wonder if they will start composting soon???",
   "Best coffee I have had in Juneau. Friendly service.",
   "I came in at 7:00 to get coffee and a breakfast sandwich. I was told the cook wouldn't be there for a half hour. I ordered a coffee and waited. After a half hour I ordered a sandwich and sat down and waited. After 15 minutes I came back to ask what happened to the sandwich. It was sitting on the shelf getting cold. No one called me to pick it up nor did they deliver it to me. No apology. No compensation. Worst of all, they already got their tip as you have to add a tip when you pay up front. The coffee was okay. The sandwich was tasty (would have been nicer to eat it fresh) so I'll give two stars. They really need to improve customer experience. I won't be back.",
   "Customer service and drink consistency could use a bit of work, but overall the place has a nice vibe to it.\nIt would be much better if you could get the staff to open their doors on time. I counted 8 people walk away the other morning because the girl working inside didn't unlock the front door. Finally, Melissa, another employee who was on crutches at the time, went over and opened the door and started greeting the people waiting...half an hour after the shop was supposed to be open. \nIt could be a fluke, but it seems pretty bad to me when someone on crutches, that's not even scheduled to be working that day, has to hobble over and struggle to do your job for you. Nice Job Melissa! Hire more people like her!",
   "I am an educator, producer, and entrepreneur. I have a BFA, MS, and numerous credentials. My boyfriend and I walked into this coffee shop to buy something to drink and use WiFi as we are on a cruise and were walking around Juneau checking out the sites. As my boyfriend was still using the wifi I accidentally drifted off to sleep. A police officer came up to us, demanded if we had bought something and told us we could not lounge or sleep. I apologized to him in that it was an accident. He was very rude and I would hate to think his approach was because we were people of color. We were the only people of color in the shop. We do not look homeless at all. Pretty cool shop, but the obvious disrespect and possible racism we just experienced is unacceptable. Please advise when making your decision to visit this establishment."
  ]
 },
 {
  "name": "Manila Bay Cafe",
  "address": "310 S Franklin St STE 300, Juneau, AK 99801, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8563ecc2-9331-11ea-9009-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=11998518780865835717",
  "source": "GoogleMaps",
  "reviews": [
   "😁 The most popular diner among Filipino crews in any cruise ship while at this port of call.",
   "Boba drinks are not a slush or worth 5.00. I was disappointed",
   "Great boba slushes, A+ burgers, got to eat in a tent",
   "I walked up and tried to decide what I wanted. I got a dumpling with meat in it and it was delicious, but I was appalled at the price, I also received a Thai tea and if you've had Thai tea around Juneau AK you know good Thai tea and this tea was just gross, and so not worth the price. Lastly and sadly I love lumpia and this was the most pitiful lumpia as the vegetables outweighed the meat. It comes with 2 for 3$ and some change took a bite and was disappointed to find no meat at all and what little bits of ground beef I hardly had. Would not recommend eating here.",
   "Great burger"
  ]
 }
]