[
 {
  "name": "Potter Park Zoo",
  "address": "1301 S Pennsylvania Ave, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/85e419be-9331-11ea-9ca0-14b31f159f22.png",
  "tags": [
   "affordable",
   "family",
   "unique",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2854223862299392029",
  "source": "GoogleMaps",
  "reviews": [
   "This place is wonderful! Located in a beautiful area right on the river trail. Admission is very affordable and we had a blast even though some of the animals were inside for the winter.",
   "Perfect little zoo day! My son picked Potter Zoo for his birthday outing. He Spent the day exploring animals and riding the train with family and friends. He explored the gift shop and managed to con us into ice cream mid afternoon. He loved the petting area and the horse ride! (Which made for the best photos) He enjoyed watching the monkeys and even rolling down the entrance hill. Would definitely recommend for littles!",
   "We had the good fortune to visit this nice little Zoo last weekend.\n\nAs a lifetime animal lover, I generally prefer smaller zoos. Although they don't have as much as larger zoos, you can usually get closer to the animals.\n\nThis zoo is set in a beautiful wooded area. There's plenty of parking and even on a Saturday afternoon, it was never crowded, which is a great selling point.\n\nOur favorite exhibit was the Tamarinds. Small white topped monkeys with some babies. Adorable, although I didn't get any pictures of them.\n\nThe otter was a lot of fun too, swimming back and forth to the delight of us all. The lions, although napping through the heat of the day were beautiful. The rhinoceros is a very majestic creature. \n\nExceptionally pleasant day visiting such a nice zoo.",
   "A hidden gem of the Lansing area, amazing large zoo with lots of unique and exciting animals! Great location for a date",
   "Small family friendly zoo with some big animals. There a great selection of animals from amphibians to tigers a great place. We went for the lights in December awesome experience."
  ]
 },
 {
  "name": "Michigan History Center",
  "address": "702 W Kalamazoo St, Lansing, MI 48915, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/86460fe8-9331-11ea-8ccd-14b31f159f22.png",
  "tags": [
   "organized",
   "history",
   "free"
  ],
  "link": "https://maps.google.com/?cid=2200327346752173592",
  "source": "GoogleMaps",
  "reviews": [
   "This place was very educational, very clean and contained a ton of information and items. My only issue, if I had to be picky would be navigating all the floors. Not all elevators took you to all floors, and we didn't see any signs directing us to a different elevator for the other content. We missed the top floor because the elevator we were at didn't seem to take us there and we didn't know where the other one was. I have a knee injury and the stairs weren't an option that day. Small signs might be useful to navigate. I didn't notice any if there were any. Gift store was also really well put together. Thank you for having us!!",
   "MHC is well organized!  I have lived in Michigan all my life and there is plenty of history I do not know about. AMAZING!!! It is for ALL ages!!!",
   "This is a true gem in the Lansing area.  I have grown up going to this museum as often as I could and I still go whenever I get a chance.  Every time I visit I see something new.  Whether it's an ever changing special exhibit or just letting the permanent displays take you back in time to when Michigan was number one in all the land, this place has something for everyone.  Please take a trip if you have never been or if you have go back.  It's well worth any drive you have to make and it's free!",
   "I always have a blast... I have been going there since I was really little. And now I have brought all of children there, youngest love and she's only 3 years old.",
   "Love this place! The secret life of Michigan objects is a must see! I also love the Union Hall exhibit!"
  ]
 },
 {
  "name": "Hawk Island Park",
  "address": "1601 E Cavanaugh Rd, Lansing, MI 48910, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/869827f6-9331-11ea-b2d1-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "kids",
   "parks",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13120098112427773396",
  "source": "GoogleMaps",
  "reviews": [
   "If it’s a fresh snow be prepared to wait, definitely worth it though. They give you a group number and when they call your number you get 2 hours on the hill. Bring cards/games for the wait, they have picnic tables inside and it’s heated. No walking up the hill they have a motorized lift!! SO FUN!!",
   "One of the beautiful place to walk in summer. Quiet place and has lot of trails to walk and bike. Kids have play area. Adults can play volleyball and barbecues. Good play for picnics in summer. During winter you can find tube sliding.",
   "Beautiful area for a simple stroll around the lake and in the forest as well as for its summer and winter activities. There is something for everyone here, from the swimming /splash park for the little ones in the summer to the tube rides on the snow in the winter, complete with a dog park and covered picnic tables. Plenty of parking and the regular entry fee for Lansing's parks, 3$ for Ingham county residents.",
   "Had a great time at Hawk Island! Had to wait in the lodge for roughly 2 hours, so be prepared for that. But when its your turn, you get 2 hours of unlimited sledding, and tubes are included. Will be going back again next year!",
   "It's definitely a typical township park worth to try if you are nearby. Free if you're biking but some fees apply coming by car. Splash Park and wooden playground are well built and kept. You  an bring your own food but concessions are available. With exception of the beach, there are plenty of shaded areas but not so many trees. You can rent a kayak or bring your own too."
  ]
 },
 {
  "name": "R.E. Olds Transportation Museum",
  "address": "240 Museum Dr, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/86f2a41a-9331-11ea-aa59-14b31f159f22.png",
  "tags": [
   "family",
   "history",
   "walk",
   "tour",
   "family",
   "walking",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8070689363209473308",
  "source": "GoogleMaps",
  "reviews": [
   "Fun museum in Michigan! My wife and I came by mid day during the week to check out the cars here. Definitely a place to spend an hour or two.",
   "Great place. Really shows the history of the family and the auto industry. Beautiful cars and other antiques. Certainly worth stopping in and checking it out.",
   "Very cute, quiet little museum,  i had no idea even existed! It was a wonderful experience.",
   "Stopped here on our visit to Lansing. $15 for the family (four of us) for us to tour the museum. Mr R. E. Olds meets you as you walk in (well this statue does). Several models on display and the boys enjoyed walking about looking at the cars and at least a couple of trucks as well.  We went on a Saturday late morning/early afternoon and there wasn't too many people here.",
   "A great place to learn about some of Lansings history. Also learned a lot about RE Olds who is a fascinating person"
  ]
 },
 {
  "name": "Michigan Princess Riverboat",
  "address": "Grand River Park, Lansing, MI 48917, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/874bc0d8-9331-11ea-9c9d-14b31f159f22.png",
  "tags": [
   "history",
   "food",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=12488697964624862925",
  "source": "GoogleMaps",
  "reviews": [
   "Great experience with wedding on boat and travel through the river. Smooth operation.\nCould have been a little more discrete in service.\nWonderful lighting- also 1/4 of the lights did not light up properly. Kind of drove me crazy for a little bit.",
   "What a lovely boat in Lansing! I went on the summer brews cruise and it was fantastic. A great way to spend a Michigan summer evening.",
   "It was the most amazing thing I have ever done.  It was special to me because of my escort & the amazing Captain ( owner). I felt like I was in heaven. Would love to go again",
   "So enjoyable! The food was awesome! A Thanksgiving Feast was served with all the trimmings. The Captain gave us a wonderful history about the Riverboat. And the view was beautiful!",
   "Fun afternoon on Grand river in Lansing. Go every year with bus tour groups. Good meal, friendly staff. Going to their Detroit boat this summer"
  ]
 },
 {
  "name": "Impression 5 Science Center",
  "address": "200 Museum Dr, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/87a3cd7e-9331-11ea-83a8-14b31f159f22.png",
  "tags": [
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6486480815922181659",
  "source": "GoogleMaps",
  "reviews": [
   "Really awesome place for kids and adults. This place doesn't seem very big upon entering but when you go upstairs it's huge! There are so many fun activities you can literally spend a whole day here and still probably not get to everything. Definitely would go back if I'm in the area again.",
   "A great place to explore and discover. There are lots of hands-on demonstrations and activities for kids to try out, each offering a fun and intuitive introduction to a scientific concept.\n\nI don't know that the features rotate or get updated often, so it's not likely a place to return to frequently. But I highly recommend it to anyone who hasn't been before.\n\nA downside to many locations in this area is that lunch options can be sparse on the weekends.",
   "Took two 5 year old boys here for a few hours. They LOVED it!!! Their votes on most fun stations: paper air plane throwing machine, playing with water, and the catapult throwing. The admission fee is not unreasonable and it was not too busy so they were able to play with everything.",
   "From the bubbles, to the teeth, to the water room. There is something for all ages and stages. The hands on learning is amazing. Dont forget to pop into the gift shop and get some souvenirs. These Crazy Aaron's thinking putty is super fun for all ages and comes in hundreds of colors, varieties, and sizes. You cant lose by supporting an outstanding company like Crazy Aaron's after a fun filled day at Impressions 5.",
   "My 6 year old son just had a blast with his school trip. They keep the place clean and neat for sure and making the slime was terrific. The instructor had incredible patience with the class. Props to him. Great time. Definitely planning to go again!"
  ]
 },
 {
  "name": "Fenner Nature Center",
  "address": "2020 E Mt Hope Ave, Lansing, MI 48910, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/87f2a912-9331-11ea-bbe7-14b31f159f22.png",
  "tags": [
   "hike",
   "family",
   "adventurous",
   "nature",
   "walk",
   "walk",
   "field",
   "family",
   "kids",
   "nature",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=17712668010189192847",
  "source": "GoogleMaps",
  "reviews": [
   "My family loves to hike the trails at Fenner! I appreciate that there’s paved trails that are perfect for shorter hikes with less stable walkers, as well as dirt trails if you want to get more adventurous. We also enjoy the festivals and never miss the maple syrup festival.",
   "A nice variety of trails and Nature Center. The trails go through several different types of habitats were different Wildlife can be spotted.",
   "Early Morning Snow Burst during the walk. Took the longest Route to enjoy the serenity. Seen several deer watching us.",
   "I love this Center for many reasons. Besides being a treasure in our city. It's a little slice of a Woods in the middle of the city. They also have an Apple Butter Festival. Which I love. Hey have docents there that when I bring my students on a field trip they have many activities to help each age level. The Apple Butter Festival is for family and individuals. Which is a must-do. I also love the maple syrup Festival. You must come and walk amongst the trees. Go to the observation room and look at the birds being fed with all of the different bird feeders. See the lovely bees buzzing and an actual window into the hive is quite an attraction for young and old. They also have feathers and different species to show to the visitors.",
   "Wonderful park with a Savannah and well kept walkways. You can get in a good hike here. There are a number of trails. Fishing piers too. Plus a nature center building with things for kids."
  ]
 },
 {
  "name": "Crego Park",
  "address": "1600 Fidelity Road,, Lansing, MI 48910, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/885773ca-9331-11ea-888d-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=18032935250323305040",
  "source": "GoogleMaps",
  "reviews": [
   "I'm SO glad this is again open to the public.  I wasn't in Lansing when it closed, but I hear there was an environmental reason that it had to be closed maybe 25 years ago. Now? It's this wonderful freshwater lake stocked with fish with an accessible kayak launch and a challenging trail around it. Bring your camera! If the light is just right, the trees on the far side of the lake are mirrored in the water and it's just lovely! Try accessing Crego Park from the River Trail, too! The back way in is much more scenic.",
   "Nice park!! Short walk to old coal railway station. Awesome to see something like that up close!!",
   "I come here for early morning bike rides all the time. It's a beautiful spot to watch the sunrise and enjoy nature",
   "Beautiful scenery and well taken care of path ways(minus along some of the pond area). Nice dock for setting kayaks or canoes in(wheel chair accessible), well kept pier.",
   "Nice lake. Great for kids to fish. Kayakers were in and out. Overall, good place to picnic and have some family time."
  ]
 },
 {
  "name": "Adado Riverfront Park",
  "address": "201 E Shiawassee St, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/88affcde-9331-11ea-9562-14b31f159f22.png",
  "tags": [
   "parks",
   "nature",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=8665506236294501145",
  "source": "GoogleMaps",
  "reviews": [
   "I love all Lansing parks, we are blessed to be surrounded by so much nature. Visually and mentally stimulating. I ride bikes thought the parks in the summer, very relaxing",
   "Nice walk next to the river.  1.5 mile walk around. It's well maintained with a handicap john.  The trail is well kept with the path half asphalt and the other side more woodsy feel.",
   "Along the river trail. Nice large open area for frisbee or kite flying.",
   "Showcase of downtown Lansing with big event center, farmers market, Lug nuts stadium featuring both baseball and socker.      New beach popular with those enjoy outdoor 🌞 fun.  A few parts of our downtown area.",
   "Flashy, money consuming, but pleasant, and it sets the mood because all I can see is a place where you visit for a luxury vacation without the Hassel of travel plus expenses. I would prefer the same look in my backyard without the Grand River."
  ]
 },
 {
  "name": "Michigan 4-H Children's Garden",
  "address": "1066 Bogue St, East Lansing, MI 48823, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8919e274-9331-11ea-af49-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "learn",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10180207691017773073",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place. Peaceful and fun. Very child friendly",
   "What a hidden gem! A tiny hedge maze, an ampitheater, a story walk, lots of cool plants including one that smells like popcorn, a beautiful bride under a weeping willow ... \nAnd the details are all there. For example at first you just notice the colorful crayon shaped posts on the fence. Upon closer inspection, you'll see that the name of each crayon is a flower that matches the color. And then you'll notice that the same flower is planted at the base of each respective post. \nThroughout the garden there are well tended details like that which really elevate the experience. This isn't a cheaply thrown-together thing. This is well thought out and cared for, and it shows.",
   "Very cool place for the local kids.  So many learning opportunities.  The staff here are so very nice and patient.",
   "This park is awesome, so many thing kids get to learn during visiting here.",
   "I have never been here before and didn't even know it existed! Found it by accident while looking for the butterfly house at MSU. Wow! I could post a bazillion pictures, but I won't 😉 We  were there in late August. More butterflies than I've ever seen in one place! And hummingbirds were everywhere! It was great!"
  ]
 },
 {
  "name": "W.J. Beal Botanical Garden",
  "address": "W Circle Dr, East Lansing, MI 48824, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/897e1552-9331-11ea-bd77-14b31f159f22.png",
  "tags": [
   "nature",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=8104928898366409588",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of the Oldest Botanical gardens in the United States. A living classroom of nature, many different species of plant life.",
   "If you're interested in plants you can grow in Michigan, what their uses and their histories, this is a great place to visit. Beautiful grounds, lots of information and friendly and interactive volunteers.",
   "Beautiful and peaceful setting on the MSU campus. Plan to return in a few weeks to see what else has bloomed!!  Great selection of perennials and edible plants.",
   "A beautiful place to walk through-family and kid friendly.",
   "Quite place. Nice atmosphere. If your a plant and flower hobbyist you'll like this place."
  ]
 },
 {
  "name": "Abrams Planetarium",
  "address": "755 Science Rd, East Lansing, MI 48824, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/89e45bc0-9331-11ea-84ad-14b31f159f22.png",
  "tags": [
   "cheap",
   "family",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5816591551071138516",
  "source": "GoogleMaps",
  "reviews": [
   "The Abrams Planetarium is a great planetarium located at Michigan State University. It's small, but there is still enough to see and do. They have different shows and exhibits going on periodically. I have seen some interesting exhibits there including comets, planets, etc. They have the Imax type shows where they screen the film on the ceiling in the auditorium. It's really cool. There is a gift shop too. Definitely make a stop at the planetarium sometime!",
   "Cheap and interesting displays, which can be fun with friends or family.  Some nights they have special shows which can be really fun. \n\nAlso the home of the moist towelette museum.",
   "Family Fun. Loved the show.",
   "We will definitely be going back! Great for adults and kids and better than 3D! See what is in our night sky.  Great end show tribute to MSU with fireworks could not be happier and for a reasonable price.  Thanks for a wonderful afternoon 😍",
   "Do you still have the Moist Towelette Museum there?"
  ]
 },
 {
  "name": "Eli and Edythe Broad Art Museum at Michigan State University",
  "address": "547 E Circle Dr, East Lansing, MI 48824, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8a2de5cc-9331-11ea-830c-14b31f159f22.png",
  "tags": [
   "art",
   "creative",
   "free",
   "art",
   "kids",
   "art",
   "history",
   "active",
   "art"
  ],
  "link": "https://maps.google.com/?cid=4075254326052915342",
  "source": "GoogleMaps",
  "reviews": [
   "It's art, ok? You just wouldn't get it. \nThis enormous modern architectural eye sore is placed right in the middle of old campus completely ruining the aesthetic of its surroundings. \nConveniently placed next to the RCAH (Residential College for Air Heads) it is home to a revolving exhibit of modern art masterpieces like a lone chair placed in the middle of an empty room. \nThis is the sort of building I would only wish upon my most detested enemy.",
   "Beautiful building with thoughtfully designed and very creative architecture. Admission is free. There are several smaller galleries that appear to change out art on a regular basis. We spent about an hour here. After the art museum we went to the MSU Dairy Store (in Anthony Hall) to get ice cream. These places made for a nice excursion with two teenagers.",
   "We overcame the lack of exterior beauty hoping for something good inside, but were utterly disappointed. A small and uninteresting temporary exhibit, stairs going up displaying a \"mature content\" sign. I inquired and was told there is NO permanent collection. Best  they could do for us was to point to a glass window through which we could glimpse at the archived items. I wonder about alumni wanting to revisit the classic works from the old museum of their college days. In other college towns we have lived. we enjoyed taking kids and company to look at art and history from each state, along with interesting perdocidcal special exhibits. Utterly disappointed.",
   "Great spot to take a break and clear your mind and a v nice Starbucks location to work from if you’re in this area of campus.",
   "Nice University universal art museum with indie feel. Be sure to check out the active maker space across the street."
  ]
 },
 {
  "name": "MSU Horticulture Gardens",
  "address": "1066 Bogue St, East Lansing, MI 48824, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8a8be77e-9331-11ea-918d-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=1459493969125511278",
  "source": "GoogleMaps",
  "reviews": [
   "It's a wonderful garden ❤️ I loved the place too❤️ I want to go back to her again😍",
   "I went to the annual orchid show. It was spectacular, as usual. Here is the orchid I purchased.",
   "Beautiful and well kept, has amazing flowers and our guide was amazing. Went for a school thing.",
   "Went to the Greater Lansing Orchid show.  It was a wonderful time",
   "A very nice horticulture garden. A must visit place if you are visiting Michigan State University and love flowers."
  ]
 },
 {
  "name": "Remembrance Memorial",
  "address": "100 N Grand Ave, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8b1c32ca-9331-11ea-9452-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=13314207920512671809",
  "source": "GoogleMaps",
  "reviews": [
   "Sad part of history but the brave us soldiers and ect did a good job.. Peaceful next to the river with so much pain seeing those people fall to their doom.. I use to smoke down by there and the river",
   "Even after all these years, its still nice to remember.",
   "Great little 9/11 memorial piece in a nice park",
   "Convenient and quiet alternative to CATA CTC.",
   ""
  ]
 },
 {
  "name": "Grand Woods Park",
  "address": "Grand Woods Park Dr, Lansing, MI 48906, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8b9ab200-9331-11ea-b197-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=15644143096865848926",
  "source": "GoogleMaps",
  "reviews": [
   "Nice park with some open spaces and pavilions. Most trails are not paved. Disc golf course was nice, although could be better marked.",
   "We took a nice Fall stroll through the park. I was surprised to find how large it was and how well mapped out ! The disc golf course is well marked and looks like lots of fun ! The views are wonderful with a trail along the river and also a large pond . Pavilions are available for rent and playground equipment is maintained . The only disappointment is that there is no bathroom facility. It is always locked. Cross country runners often use the trails and dog walkers are frequently seen . So put on your walking shoes and get out there !",
   "Nice big park. Moderately maintained. Many disc golfers there everytime I have been. There is an RC car track here. Picnic tables and gazebos are in good condition.",
   "Pretty good disc golf course",
   "Great disc golf course and awesome scenery....bring your shorts because lots of water shots and I refuse to leave a disc behind..in fact found a few diggin for mine will be back soon"
  ]
 },
 {
  "name": "Durant Park",
  "address": "700 N Capitol Ave, Lansing, MI 48906, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8c050d0a-9331-11ea-abb2-14b31f159f22.png",
  "tags": [
   "walking",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=7926803565768582902",
  "source": "GoogleMaps",
  "reviews": [
   "A very quiet park in the middle of the city. While this park is pretty well attended with children, families and seniors walking, its well.maintained and has a very nice flower area.  It Was a nice place to just sit , relax , talk and play a game. Most enjoyable time",
   "The park is a lovely escape for anybody who is a nature lover.",
   "The colorful Adirondack chairs you can place for your preference, beauty, mature trees, uncrowded, clean ...\nThe swings are perfect!! Wide enough, high enough for this bike riding granny to remember being a kid and make a good summer 2019 memory in Lansing",
   "I'm glad that it is well maintained and hope that it remains for many,many years to come.",
   "Very nice place in the summertime plenty of trees around to shade you very comfortable in the springtime and very comfortable in the very cold in the winter time"
  ]
 },
 {
  "name": "Michigan State Capitol",
  "address": "100 N Capitol Ave, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8c5dba5e-9331-11ea-af78-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "tour",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1636195100584881612",
  "source": "GoogleMaps",
  "reviews": [
   "Super wonderful place I recommend every citizen in Michigan to go see it. no matter how much I describe it you gotta see it by your eyes. wonderful historical building and the work was done is amazing. My photos can tell a small part.",
   "I enjoyed a self guided tour of the Michigan State Capitol building yesterday and cannot wait to go back!! This building is a treasure within Lansing that should be seen by everyone! It is free to tour and an incredible experience in itself!! The pictures will not do this building justice!! Go see it as soon as you can!!!",
   "Almost a personal tour on the day we visited.  We were here collecting another stamp for the boys passports (all State capitals). We arrived just before the tour started and were the only ones when it started (late afternoon on a Friday). \nAlways like the tours as you get more info and history about the capital and state. For instance, it's easy to b forget that Michigan was once on a border with an enemy (war of 1812) and the capital was Detroit at that time and had been captured. \nWe had a good time moving about the capital building and learning as we moved along.",
   "A wonderful place to watch  how laws are made and society is ran. Also a goldmine for Michigan History,  which we all love.",
   "In my opinion, the most beautiful building in Lansing. When I arrived the whole city seemed dead. Cool stop if you are passingg through, but i would not make Lansing a getaway place for the weekend"
  ]
 },
 {
  "name": "Frances Park",
  "address": "Lansing, MI 48911, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8cfdcc7a-9331-11ea-a42e-14b31f159f22.png",
  "tags": [
   "free",
   "walk",
   "kids",
   "music",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=13130942054279551071",
  "source": "GoogleMaps",
  "reviews": [
   "Beautifully landscaped and well-maintained public gardens.  Nice overlook of the Grand River.  Clean, safe.  Free parking.  A great place for a leisurely stroll.",
   "We visited this place as a recommendation for Senior pictures for our son. I have to say, THIS PLACE IS AMAZING!!! It's absolutely beautiful and very well kept. There are many different backdrops that you can use for pictures of any occasion.  While we were there, there was a couple getting engagement pictures taken and also Homecoming pictures for a group of students. I highly recommend this park!!",
   "It's a well kept place. Great for a nice walk.\nThere were kids playing, an event with nice music. A couple taking pictures.\nWhat a great gift left for the community",
   "Paved walking trail, beautiful gardens, huge expanse of open lawn, large enclosed events building, clean restrooms, large playground. Rose gardens would be a great spot for a wedding, or just take a leisurely walk. These are only a few of the the highlights of this Lansing gem.",
   "A beautiful, we maintained area. Especially the Rose garden."
  ]
 },
 {
  "name": "Granger Meadows Park",
  "address": "1745 Granger Meadows Ln, Lansing, MI 48906, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8d5aa8c0-9331-11ea-a7f8-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15713844292267089497",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of our favorite places to speed in the winter. Good times!",
   "This is my second time here really enjoy it peace and quiet sitting underneath a nice shade tree relaxing taking it all in listening to the birds...\nBut I do smell a little trash when the wind blows from the Granger dump not far from here..",
   "This park is great. The path around it is perfect for walking/running and has climbs and descents. The basketball courts and jungle gym offer hours of fun. The area would be ideal for celebrations too! I look forward to going back again very soon!",
   "Snow hill was fun...",
   "It's a good park, with trails and play equipment, pavilions for parties and gatherings. My kids love coming here."
  ]
 },
 {
  "name": "Scott Woods Park",
  "address": "2605 Clifton Ave, Lansing, MI 48910, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8ddc0e28-9331-11ea-bb98-14b31f159f22.png",
  "tags": [
   "free",
   "structure",
   "walk",
   "walk",
   "walk",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=14417552276337308843",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful woods, flora, waterways,  and serene walkways.",
   "A small park that allows access to the Lansing River Trail and Hawk Island. Free to park but the lot is small. There is play structure and small swing set (1 infant swing 1 standard swing). 4 stars only because there are sometimes bees or similar around the play structure which is not to say that surprises me at an outdoor park but it does limit my ability to let my child play there at times / fyi be prepared. I met some nice people on the trail that showed me this jack in the pulpit last night. There were also some may apples a bit farther in but I did not want disturb the area around them to get a photo.",
   "It's a great walk if you make time for it. McGuire park, hawk island, and Scott's wood are all next to each other.",
   "Nice place to walk or bike. Trails lead into hawk island as well if you want a longer walk. Small parking lot, small pavillion and a playground at the entrance to the trails.",
   "If you want to get in touch with nature this is one of the places in Lansing you can enjoy a good walk"
  ]
 },
 {
  "name": "Meridian Historical Village",
  "address": "5151 Marsh Rd, Okemos, MI 48864, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8e50c986-9331-11ea-bb0f-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "field",
   "historic",
   "free",
   "walk",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=4629167251680698556",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great place to take a walk back in time (literally!) and see some local history. The Meridian Historical Village is very scenic and a nice place to think. Consider bringing your camera, even if the insides of the buildings are closed to the public, there’s still much that may catch your eye. Check out their pond and gazebo by the water, too!",
   "I went with my son for his school field trip,  Meridian Historical Village is a amazing historic of the people lived during 1850s and toll road people. My son and I have a wonderful time in the perfect weather, each building have an amazing story to share. Only public restroom at old school during operation hour, wheelchairs accessible and no free wifi. Great place for walk and there's picnic tables.",
   "You step back in time when you enter the village. And the docette are very knowledgeable.",
   "Nice evening stroll, clean park",
   "Absolutely gorgeous. I was here for a wedding and loved it. I will definitely be going back."
  ]
 },
 {
  "name": "Moores Park",
  "address": "Lansing, MI 48910, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8eb753b6-9331-11ea-a0c0-14b31f159f22.png",
  "tags": [
   "walk",
   "parks",
   "walk",
   "walk",
   "kids",
   "family",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=16307549508759923547",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best parks in Lansing.  Large, lots of different attractions to offer including a labyrinth, soccer and basketball courts, fishing, swimming pool, picnic benches, bathrooms, trails for hiking and biking, and natural beauty.  If you cross the bridge and walk past the river it takes you to the heart of REO Town, and the trails connect you to the Lansing River Trail.",
   "Big green space, fun places to walk and cool things to photograph. Adjacent parking.",
   "Relaxing place to unwind .fish or just enjoy the river walk",
   "Its def a nice park 2 take the kids, they have alil 4 everyone in the family:) Along the water so just beautiful 2 look at even! Definitely a nice place 2 check out with the family!",
   "There pool is a hidden gem of Lansing. Rough neighborhood, great historic pool."
  ]
 },
 {
  "name": "Anderson Nature Park",
  "address": "3301-, 3377 Wardell Rd, Lansing, MI 48917, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8f109786-9331-11ea-a11d-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=15145683012589665391",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful lake. Dirt trails. Bike trail. Great time.",
   "Had a great time walking around great trails... wanna cone back with a bike.. looks like alot of fun",
   "Went there and walked the bike trails! It was super nice! Also a good place to look for morel mushrooms! At one part there is a very small sand beach!",
   "Very woodsy area with dense foliage. Caters to mountain biking and hiking.  It has many steep hills and no pavement. Prepare for a work  out if you go here and bring your own water. There are no facilities here. However,  I spied an park office on Old Lansing Rd as I left the park. I am not sure whether the office had regular hours or staffing.",
   "Pretty,quiet little park. 6 miles of trails for your hiking, running, biking needs:)"
  ]
 },
 {
  "name": "John M. Patriarche Park",
  "address": "960 Alton Street, East Lansing, MI 48823, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8f78f658-9331-11ea-b75e-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "structure"
  ],
  "link": "https://maps.google.com/?cid=1249022291627973023",
  "source": "GoogleMaps",
  "reviews": [
   "A good time for kids of all ages. See the pictures. Playground, baseball fields, picnic tables, grills, necessary room facilities. They could probably use more parking, but for the most part it seems adequate. We are thankful for Patriarche Park in Metro Lansing",
   "Great park with a big play structure for kids and a ton of open area. Also a great place for parties.",
   "Great place to take the youngsters on the first really nice day since winter set-in.",
   "Nice park! Many public restrooms,plenty of picnic areas, and dog friendly!",
   "Very nice park.  Lots of space and activity area.  Playground, ball fields"
  ]
 },
 {
  "name": "St. Thomas Aquinas Church",
  "address": "955 Alton Rd, East Lansing, MI 48823, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8fe4149e-9331-11ea-9565-14b31f159f22.png",
  "tags": [
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=341414084997877657",
  "source": "GoogleMaps",
  "reviews": [
   "A really heart felt homily by the priest. Even the parishoners were very kind as well. I feel like I can make this Catholic Church as my home church.",
   "St. Thomas is a combined Parish with St. John Church and Student Center which is a 1 block walk from Michigan State University Campus with Worship Services many times throughout the week at both locations. Also available at both locations are many opportunities to gather with others at meals, retreats and studies that help your faith to grow. All of these, at either location are for people of all ages; College students, residents, children, and families. St. Thomas is located 1 mile from campus with an abundance of free parking and garden areas for your enjoyment.",
   "One of the Most Beautiful Churches in the Midwest. I grew up in East Lansing & went to St.Thomas Aquinas School too!",
   "Very welcoming and a traditional feel to the Catholic experience.",
   "What a beautiful church and attended a very nice Service of Rememberence mass."
  ]
 },
 {
  "name": "Harris Nature Center",
  "address": "3998 Van Atta Rd, Okemos, MI 48864, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/905ceec0-9331-11ea-a393-14b31f159f22.png",
  "tags": [
   "walk",
   "free",
   "nature",
   "walk",
   "walk",
   "walk",
   "nature",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7832483403674862434",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful, clean, well-maintained nature area with nice selection of short to moderate-length trails.  Most are easy with few very moderate hills, one stairway to lower river walk.  facilities for family-oriented nature activities.  Free parking.",
   "We love this place!!! It's a great place just to take a walk & they have really great recurring events there like moon light walks and stories by the fire. Our favorite local place. ♡",
   "Very nice walk in the woods along the Red Cedar River.",
   "One of the best nature centers in the area.. Very serene have loads of activities for all ages.. I went during the winter for howl at the moon walk with my puppy  which they have once a month or every fri not sure for $10.. N I also attended the winter festival thr end of january which was fun as well there were sleds hot chocolatr, bon fires on top of all that I still need to try their sledding classes and cross country ski classes nxt winter@!!!!  Overall a fun place for all ages,  & all seasons@@@@!!!",
   "Great fun for kids of all ages... The hiking trails in the woods are very nice."
  ]
 },
 {
  "name": "Lake Lansing Park South",
  "address": "1621 Pike St, Haslett, MI 48840, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/90bdac46-9331-11ea-a01d-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=3348495719664039125",
  "source": "GoogleMaps",
  "reviews": [
   "Nice public park and beach area. Concessions and paddle boat rentals are available in the summer months. There are three bars/ restaurants right across the street,  two have roof top patios that serve food and drinks. There is a fee for parking that is minimal.",
   "Beautiful and clean park. Great place to listen to music in the park on Fridays during summer months.",
   "This park used to be so fun, however, in recent years it has really been neglected. The beach area is still nice, and so is the grass area. The climber for the kids keeps them occupied for a bit, but the big wheeler track needs a ton of attention. The first time we found the track there were very few big wheelers to use, almost all were broken. I brought my son back with his own and he rode for a while, but quickly, other kids wanted turns. Although I believe in turns, it took long enough that it was time enough where we had to leave and had trouble getting the big wheeler back. The next two years we went back and it's worse and worse,  there is carnage of broken big wheelers and tricycles all over. I wish something could be done because this is the only track I know of in this community.",
   "Summertime fun in the sun and Friday night concerts all season long.  Life guarded beach with the lake offering some good fishing.  Fun to be had by all.",
   "Our favorite swimming place in the summer! With a big playground nearby, lots of space on the lawn and surveillance of the swimming areas."
  ]
 },
 {
  "name": "Cristo Rey Church",
  "address": "201 W Miller Rd, Lansing, MI 48911, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/911ce39e-9331-11ea-9675-14b31f159f22.png",
  "tags": [
   "music"
  ],
  "link": "https://maps.google.com/?cid=6790164647572282107",
  "source": "GoogleMaps",
  "reviews": [
   "This is an amazing Parish!  Excellent liturgy, multicultural, and traditional.",
   "This is our Place of fellowship/worship every Sunday at noon for their bilingual mass",
   "Beautiful church with a bi-lingual priest. Service is nice and the congregation's friendly.",
   "Clean. Nice facility. Friendly",
   "Great food...Great Music..\nGreat Merchandise. Everything well priced. I was at the weekend festival on Saturday night. My attendance was unexpected but I plan to return for the 2020 Cristo Rey Fiesta."
  ]
 },
 {
  "name": "Hawk Meadow Park",
  "address": "6160 Delta River Dr, Lansing, MI 48906, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9179f81c-9331-11ea-9759-14b31f159f22.png",
  "tags": [
   "free",
   "walk",
   "kids",
   "walking",
   "walk",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=5393987521177363015",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful community park in convenient semi-rural location.  Well-maintained trails with maps, directional posts, and benches placed throughout.  Dogs are permitted and everyone obeys the rule that all dogs must be leashed. No crowds, but enough use to ensure that people feel safe.  Free parking. Convenient restroom building.",
   "Peaceful place to walk. Most people clean up after their dogs. Just the right size with nice scenery. Great place to take the kids to.",
   "Great walking trail with plenty of shade. Beautiful location and just the right length.",
   "Lovely place to walk, and the lake is my favorite spot to stop for a break and enjoy nature.",
   "A pretty little park with lots of well maintained trails for biking or hiking."
  ]
 },
 {
  "name": "Washington Park",
  "address": "2700 S Washington Ave, Lansing, MI 48910, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/92560092-9331-11ea-a5de-14b31f159f22.png",
  "tags": [
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=6036190736604470305",
  "source": "GoogleMaps",
  "reviews": [
   "Washington Park is a pretty nice park has suitable parking\" a Pavilion for shelter from the sun and rain. Children's play area which appears safe and more importantly a His and Hers public restroom that isn't padlock you can actually use it. Peaceful place.",
   "I drove home a way I don't normally go and passed by Washington Park. It looked like it was big so I reminded myself to take my 2.5 year old on a nice day. When we finally got the chance to go I was not disappointed. There are four play structures, one for little infants, one for toddlers 2-5, and two for 2-5&5-12. And a giant fake rock to climb on! They have grills, a pavilion, and tons of bench seating. There is a huge grass lot with tons of open space I saw some people taking their dogs out to run around. Lots of parking. My only downside is trash laying around because it could use a couple more garbage cans. I can't believe how quiet this park is though, maybe it's because it's a little hidden, but I think it's really a gem.",
   "Spacious and a lot to do with the kids if you bring activities",
   "Pokemon go is awesome negative comments are going to happen.. but at least they have a game that get people walking and or outside.",
   "My son loves it. Adults can have fun also!"
  ]
 },
 {
  "name": "Hartrick Park",
  "address": "3685 Hulett Rd, Okemos, MI 48864, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/92eb3c48-9331-11ea-bcee-14b31f159f22.png",
  "tags": [
   "walk",
   "parks",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=16882705073114162706",
  "source": "GoogleMaps",
  "reviews": [
   "Fun little park. Has a nice wooded path with other paths to walk your dog. Has 2 baseball diamonds and a pavilion with Mple parking.",
   "A nice park. It has a lot of parking spots and spacious play areas as well as a large play set and two baseball diamonds",
   "The Pavilion, Bathrooms, Playground and Trails are all very nice, and well maintained.  The baseball diamonds however are covered in 2 grit sand paper, are not raked and level (large holes in front of pitchers mounds and at the bags) and are a hazard to everyone that uses them. Very disappointed in the quality of materials used here. I would avoid this place for your Baseball/Softball games & practices unless you like treating road-rash type injuries and washing rocks out of your skin and everywhere else.",
   "Well-kept like ALL Meridian Two parks. Very visitor- & pet-friendly",
   "Great place to play soccer, base ball, cricket and other outdoor sports and also have slide and stuff for kids and a nice walking trail"
  ]
 },
 {
  "name": "Nancy Moore Park",
  "address": "1960 Gaylord C Smith Ct, East Lansing, MI 48823, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/933f4fdc-9331-11ea-b0f7-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=6051899831451629950",
  "source": "GoogleMaps",
  "reviews": [
   "Loved the park and the trails. Many facilities and playgrounds.",
   "This is such a wonderful park. The addition of the fenced in small dog park is wonderful. There is a membership cost. The office is there on the left when you turn in. The volleyball, baseball and soccer fields are well maintained and usually always in use. The are also lots of paved and unpaved paths through some beautiful scenery.",
   "Love the small dog park here! Super cute. I wish people would clean up after their dogs though; there was a lot of poo everywhere.",
   "Lots of trails to walk...walk your dog or ride bikes. Beatiful place to go !!! Has baseball fields...playground...volleyball...picnic areas. They have small dogpark. Just not open yet. Hopefully soon !!!!",
   "Great running trails"
  ]
 },
 {
  "name": "Fitzgerald Park",
  "address": "100 Fitzgerald Park Dr, Grand Ledge, MI 48837, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9395d47a-9331-11ea-9a6f-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "walking",
   "kids",
   "family",
   "structure",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=11288416681417301960",
  "source": "GoogleMaps",
  "reviews": [
   "One of the most beautiful places in the area.  I've been going to \"the Ledges\" since 1968.  You could climb the ledges up until\n The early 1980's.  Due to erosion we had stop the climbing and just walk the trails.",
   "Great place to go for some adventure and to play in nature. Great place to take photos and great things to fo here. Never a dull scenery or moment.",
   "A beautiful park with easy access for residents of Grand Ledge, Lansing, and surrounding communities. There is a very small fee for those who live outside the county.  Park is clean, spacious, and well maintained, with activities for all ages.  Walking paths offer many scenic views.  The paths are wide, well maintained, well marked, and generally safe.  Park includes clean restroom building.  Plenty of parking.",
   "Great place to roam around and have plenty of space to run. There is playground equipment for the kids as well as disc golf. They have a merry-go-round in the playground which can be tough to find now. Lots of swings, slides and places to climb. Separate structure for toddlers. Great place to gather with a group as well with pavilions and grills. Huge park - great place to spend a day!\n\nMy family has been here for work parties, groups of friends and just two of us. Something for everyone.",
   "Beautiful place to walk or play disc golf. I prefer this park in the off season due to its popularity."
  ]
 },
 {
  "name": "Lewis Landscape Arboretum",
  "address": "East Lansing, MI 48823, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/93ee2fd2-9331-11ea-83b2-14b31f159f22.png",
  "tags": [
   "nature",
   "family",
   "free"
  ],
  "link": "https://maps.google.com/?cid=9708874297432256409",
  "source": "GoogleMaps",
  "reviews": [
   "A beautiful paradise amidst the city! We visited when the peonies were in full bloom (mid-June) and it was stunning. We were amazed at the number of peonies and there were bridal parties taking pictures everywhere. We also walked one of the trails and enjoyed the lush beauty. There are a few main trails, but also many smaller offshoot trails that were fun to explore. I would definitely visit here again if I am ever in Ann Arbor.",
   "It's a beautiful place nice for relaxing and enjoying the nature. I love it",
   "This place is fantastic! Awesome scenery and most things are labeled. Venue is open to the public and is great for family outings and picnics, too! Unfortunately, this is a pet free park (which totally makes sense), but it's definitely worth a visit, for sure!\nI loved the scenery! Great job to the staff, students, and volunteers!",
   "This has grown a lot, beautiful place for senior pictures!",
   "Delightful.  Surprising number of flowers in bloom for early November."
  ]
 },
 {
  "name": "Nokomis Cultural Heritage Center",
  "address": "5153 Marsh Rd, Okemos, MI 48864, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/944b6982-9331-11ea-bfea-14b31f159f22.png",
  "tags": [
   "history",
   "knowledgeable",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=2967056231571284052",
  "source": "GoogleMaps",
  "reviews": [
   "Very cool place lots of Indian culture there.",
   "This is a wonderful place to visit, especially if you have little ones. They have elaborate exhibits that show the history of Native Americans. The staff is friendly and well informed. They have limited drop by hours, but during summer break this is a wonderful place to visit. Also, they have several events throughout the year that are worth keeping tabs on. Beautiful experience.",
   "Great place, very knowledgeable staff and instructors",
   "It's a good place to learn about Native American cultures.",
   "Wonderful people!"
  ]
 },
 {
  "name": "Ferguson Park",
  "address": "4540 Okemos Rd, Okemos, MI 48864, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/949f5698-9331-11ea-8c52-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2939064043781054737",
  "source": "GoogleMaps",
  "reviews": [
   "Good spot for kids to play and enjoy small river",
   "Nice park! With a play area. Hidden behind some trees, right next to the road.",
   "Georgia my little Maltipoo loves it.",
   "Took my Dachshund here! It was awesome! 😆",
   "Nice park for a quick walk and a few minutes for the kids to play. In the spring there's usually flooding but other times are ok. The river has some nice fishing spots from shore. Didn't see any hiking trails. With the Spring floods and available space being somewhat limited, I give this rating. But it is a nice place to visit to break up your day."
  ]
 },
 {
  "name": "Michigan Orthopedic Center: Charles J. Taunt Jr, DO",
  "address": "2815 S Pennsylvania Ave # 204, Lansing, MI 48910, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [
   "active"
  ],
  "link": "https://maps.google.com/?cid=5477496970481411138",
  "source": "GoogleMaps",
  "reviews": [
   "I was blown away by the level of care provided by Dr. Taunt and his office. I had a full knee replacement and he was wonderful. So far I’m 2 weeks post surgery and the level of care remains. Any and all questions have been answered promptly and the day of surgery, he personally came to check on me before and after multiple times. MULTIPLE TIMES! I’ve never had a doctor do that !!! I would highly recommend !!! I’ll be back for my other knee soon :)",
   "I had a partial knee replacement elsewhere and had pain for years.  I went to see Dr. Taunt and he said it should be replaced “when I was ready”.  He wanted me to decide when it was time.  I was totally impressed and sold on him again as I had seen him before.  Finally I couldn’t stand it anymore and went back and was scheduled for surgery 11/5/19.  Because of his brilliantly made “Health Loop”’that sent you messages and reminded you each day what to do (start exercising before surgery, when to stop your supplements, etc.) I was lead each day with what to do before the surgery.  It was so informative and even had a one minute video of a knee replacement....very simply showing the knee bones and what would be done.  It took all my fears away and I looked forward to my next day’s Health Loop every day!  It was truly amazing and continued for almost a month after surgery asking great questions so he knew how your progress was going.  I would never go anywhere else when it’s time for my left knee.  He is an amazing doctor!! He would be my number one recommendation for a knee replacement!",
   "Outstanding pre surgery infection prevention. Knee replacement is healing quickly and feels great. Doctor and his staff used a communication portal daily and any questions are responded to quickly. Came highly recommended by other medical professionals and did not disappoint.",
   "I am a Surgical Nurse of 24 years, Dr Charles J. Taunt Jr, DO  is the surgeon I recommend.  He continues to  always look for  ways to improve his outcomes for his patients. He is the Best! He has given me a new beautiful  Right Total Knee replacement October 2019. My experience  has been amazing and I am very pleased with my out come. He also gave my husband Bilateral  Total Knee replacements in 2016 and 2017.  We are both very active and very grateful that we have such a talented Orthopedic Surgeon.",
   "The expertise and compassionate care of Dr. Taunt and his team were exceptional.  It made all the difference in the world with my total hip replacement, something I was very nervous going into.  The GetWell Loop portal, so they can check in with you and you with them every day, is a bonus!"
  ]
 },
 {
  "name": "Michigan Women's Historical Center & Hall of Fame",
  "address": "105 W Allegan St, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/950ee2e4-9331-11ea-a774-14b31f159f22.png",
  "tags": [
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12114542013522440852",
  "source": "GoogleMaps",
  "reviews": [
   "Great place, very interesting, and fun for kids",
   "I found this very enlightening and interesting. I was surprised at the number of important women who accomplished so much but have gone mostly unrecognized. My only suggestion would be to add some audio recordings that people could listen to as they viewed each woman... because the audio experience is such a valuable learning tool.",
   "I went here years ago and found it very interesting. ",
   "Women showcasing our history, supporting local agencies, causes, and community.",
   ""
  ]
 },
 {
  "name": "Sleepy Hollow State Park",
  "address": "7835 E Price Rd, Laingsburg, MI 48848, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/956d367e-9331-11ea-9f28-14b31f159f22.png",
  "tags": [
   "hike",
   "nature",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=9186401911758476808",
  "source": "GoogleMaps",
  "reviews": [
   "The trails are amazing, you can hike for miles and be surrounded by nature every step. It's a great place to camp, hike, bike and even ride horses. It's one of my favorite places to create memories.",
   "This is a large state park that seems intended primarily for camping, boating, and horseback riding. There are several trails with sporadic trail markers provided. The sole reason for my visit was to explore trails on foot, hoping to admire wildflowers, observe (wild) animal habitats, and take some photos. The trail markers at this very rural park play a critical role in keeping horses off of pedestrian trails. There was ample evidence (💩) to suggest that the trail signs are not always successful in doing so. While this park has a lot to offer, I prefer other great parks in Michigan for their natural landscapes and scenic interest.",
   "Great place to spend the day. The fishing was great, swimming was fun. They have geocaches in a few places of the park. There is frisbee golf course which was mostly shaded. The park is open until 10pm. The restrooms are clean and there was ample parking. They also have a dog beach.",
   "A nice campground conveniently located off exit 105 on Interstate 69. Clean bath houses and generally nice campsites. Spaces 1-100 will be closed through July 31st due to an electrical upgrade.\n\nThe downside is the dump as there's only 2 positions to dump for 228 campsites. Be ready to wait!",
   "It's a Friday afternoon and it's almost like I've got the lake to myself the water is beautiful sky is robust with big fluffy white clouds and I can't wait to get my pole in the water I'm going fishing"
  ]
 },
 {
  "name": "Lincoln Brick Park",
  "address": "13991 Tallman Rd, Grand Ledge, MI 48837, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/95d4e92c-9331-11ea-95a8-14b31f159f22.png",
  "tags": [
   "walk",
   "historic",
   "walking",
   "walking",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=17583385192670457739",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place because you rarely see anyone else there. So don't visit, you'll just make me take a star away from this review!",
   "Cant wait to go back and spend more time. Historic . This was a happenstance I was just looking for a place to walk my dogs while driving to the east part of state. A great stop  going back to explore.",
   "Great park with great trails. \n\n-The Heron Hollow trail offers the best view of the beautiful green swimming pond and 300 million year old ledges. Great place for pictures. There are some steep hills though, so wear good shoes. The pond has a small beach area, but not much shoreline that is able to be utilized. \n\n-The Beachnut Trail offers historical explanations of the place with a few remnants of what used to be. Has a pretty tall bridge with a high view of the woods around you.   \n\n-Deer Run trail is a favorite. Walking through the woods with the Grand River flowing right beside you. Great private place to take the dog for a dip. \n\n-Prairie Loop is the most mellow of the trails being made up of grass. \n\n-Tallman Trails seems to be the least traveled and is my favorite. Great views of the pond and Grand River. Plus a view of the dam. On this trial you can access trails not displayed on the map. If you dare to take them you’ll find some interesting rocks and a cute waterfall.",
   "Great park. Lots to see here. Mostly good for walking trails, but you can see a river, lake, cliff, and grassy fields. Well worth visiting at least once.",
   "Great spot, quiet, good for walking.  Wear boots in the wetter months.  Small playground for kids."
  ]
 },
 {
  "name": "Lake Lansing Park North",
  "address": "6260 E Lake Dr, Haslett, MI 48840, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/962c2eee-9331-11ea-83e8-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "unique",
   "family",
   "nature",
   "historic",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=6446133238399805854",
  "source": "GoogleMaps",
  "reviews": [
   "Clean, well-maintained park with array of activities, sports fields, grills, picnic shelters, walking trails, boat launch, adequate parking, restrooms, and modest entry fee.",
   "Very serendipitous experience after visiting family living near the lake, went for a walk and then this park came into view! We walked in during April (nothing growing just yet, lots of loud frogs), and initially we thought it was a nice small park with parking, grills, and gazebos... Only to find a few available trails to walk! It was a nice experience, well-maintained, and some unique sights/animals. May occasionally spot a white-tailed deer! 🦌 \n\nVery secluded/foresty/nature trail when compared to the open lakeside area of the South Park. If you want a nice quiet nature walk, come here! Highly recommended.",
   "Great place to get outdoors! Bring cash because you might have to pay an entrance fee. $3 for residents, $5 for non-residents as of 3/2/2020.",
   "Beautiful place, love taking my dog here for walks. But, filled with invasive species (autumn olive, Japanese barberry to name a couple). Hoping parks will initiate a program to bring this plot of land back to its natural historic forest!",
   "The best top secret in the Lansing Area...\nWhat a gem..."
  ]
 },
 {
  "name": "Lansing Parks & Recreation",
  "address": "200 N Foster Ave, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9683d98c-9331-11ea-8301-14b31f159f22.png",
  "tags": [
   "kids",
   "pets",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=7100821614175172012",
  "source": "GoogleMaps",
  "reviews": [
   "BEWARE! Teachers at \"Homeschool Days at Foster\" are malicious. Gossiping about your kids being your backs, including confidential information. Untrained staff provides subpar instruction to kids and usually have no clue how to manage kids, particularly quirky ones. Programming is what you would expect from a city that doesn't invest dollars into facilities nor communities. Teachers and staff do not communicate effectively to parents.",
   "Great park but they won't let you bury your pets there so don't even try.",
   "Belly dance classes with Garnett are amazing!  The opportunity to learn with a professional who has performed and taught all over the United States is priceless! Lots of fun too!",
   "Clean building, friendly and helpful staff.",
   "The TV show is pretty good"
  ]
 },
 {
  "name": "Trager Park",
  "address": "1316 S Pennsylvania Ave, Lansing, MI 48910, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/96dd2d7a-9331-11ea-b7a9-14b31f159f22.png",
  "tags": [
   "parks"
  ],
  "link": "https://maps.google.com/?cid=10297423643481804854",
  "source": "GoogleMaps",
  "reviews": [
   "Nice little park next to the Red Cedar River along the Lansing River Trail.  No pavilion or playground, it is across Pennsylvania Avenue from Ingham County's Potter Park and Zoo.",
   "Amazing spot for pictures, and relaxing times",
   "Quiet and serene. Nice spot for a Geocache!",
   "Great city resourse",
   "We need mor parks"
  ]
 },
 {
  "name": "Bharatiya Temple",
  "address": "955 Haslett Rd, Haslett, MI 48840, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/972a63a8-9331-11ea-8cdf-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=15497077205253290689",
  "source": "GoogleMaps",
  "reviews": [
   "VERY PEACEFUL VERY ACTIVE....PEACEFUL ENV'T BEAUTIFUL TEMPLE...HAVE  A LOT OF NICE EVENTS AND ACTIVITIES GOING ON ALL THE TIME..WOULD HIGHLY RECOMMEND!!!",
   "Well established temple.. all Pooja done by request. All festival time we can meet our Indian community people.",
   "Not really qualified to judge this location as I'm a guest. Very welcoming even though as a Westerner. Fun Diwali festival!",
   "Very peaceful vibrant and lots of nice activities n events!!!",
   "Nice to see a Hindu temple in a place like East Lansing. Though not huge it still looks good."
  ]
 },
 {
  "name": "Sam’s Physical Therapy, P.C",
  "address": "1515 Lake Lansing Rd, Lansing, MI 48912, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [
   "knowledgeable",
   "knowledgeable",
   "practical",
   "family"
  ],
  "link": "https://maps.google.com/?cid=8755730724133667580",
  "source": "GoogleMaps",
  "reviews": [
   "Sam is by far the best physical therapist I have ever worked with, and with three ruptured discs in my back, I have had a lot of therapy! Sam is extremely knowledgeable about his profession and takes pride in being able to help his patients get back mobility in whatever extremity needs work, and range of motion. He ensures you are completing the exercises correctly by modeling the exercises and then watching as you complete them to safeguard against injury. He explains how the exercise will benefit your body, and what areas it will strengthen. Lately, Sam has had some assistants working with him, and he is a wonderful mentor as well. He explains to them how he works with his patients, and has his assistants explain to him what they would do by engaging them in open ended questions. Lastly, Sam does this all with a sense of humor! When you have to have therapy, you might as well enjoy it, and I have had the opportunity to laugh a few times over his sense of humor!",
   "My mother and I have been to several physical therapists for knee and shoulder issues. Sam by far is the most caring, thoughtful, and knowledgeable person who helps you with encouraging words and explanations how different exercises help your situation. He is kind,respectful, patient and listens to your concerns. Best in town.",
   "Sam has a wonderful bedside manner. He challenged me to stretch myself to get the most out of my new knee. I so appreciated how Sam took time to explain the benefits of each therapeutic exercise to me and gave me practical activities that I do from home or work. \n\nI would highly recommend Sam to anyone seeking therapy!",
   "Sam was VERY professional at his work for my injury towards my shoulder. He's very flexible, kind minded and the best physical therapy I've had from anyone. I'd definitely recommend to everyone who needs therapy. Blessings to you and your family, THANK YOU SAM!",
   "I came to Sam with an injury from work. He was absolutely amazing. He worked with my needs! He didnt have his own agenda of how I should heal. He changed up his plans for the day, based on how I felt day to day. He still pushed me to work hard, and praised me when I met goals. I will be coming back to Sam if I ever need therapy again. \nAnd if you read this Sam, thank you and thank you to your staff."
  ]
 },
 {
  "name": "African World Museum and Resource Center",
  "address": "1136 Shepard St, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/978380f4-9331-11ea-8e49-14b31f159f22.png",
  "tags": [
   "learn",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=2593807571989259645",
  "source": "GoogleMaps",
  "reviews": [
   "Lansing based All Around The African World  Museum & Resource Center, is a Union of the diaspora . A place for the community to learn and explore.\n\nEducational opportunities and tour by Dr. W Davis a MSU Grad and founding Father. Lots of knowledge and fun a must fir all.",
   "Super cool African Festival Last Summer!",
   "Awesome",
   "",
   ""
  ]
 },
 {
  "name": "Cooley Law School Stadium",
  "address": "505 E Michigan Ave, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/97d809ec-9331-11ea-bbc4-14b31f159f22.png",
  "tags": [
   "family",
   "field",
   "kids",
   "food",
   "cheap",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1802336473979748939",
  "source": "GoogleMaps",
  "reviews": [
   "Randomly drove by and saw the Holiday Lights decided to stop and I'm glad we did! My boys aged 9, 7, & 5 enjoyed the stadium all lit up and the train ride. There was much more to do but we just enjoyed the lights. Thank you to all that helped put this on. I used to drive around with my family looking at Christmas lights, but it's not the same for my boys it's always hard to find homes decorated. So, thank you Cooley Law Stadium! ☃️❄🎄",
   "Always love seeing the lugnuts play here even if they dont win. Always have great field games for the fans to play. I got on the field and did the inflatable race and even made it fun for the other players by bringing them the barrel to give them a chance to win. Then did a front flip at the finish line.",
   "Nice stadium, graphic signs are clear.  Food is outrageously expensive ($8.00 a square slice). Drinks were no better. Very friendly staff.  Box office lady was super nice and patient with us.  I had planned to bring everything I needed for the baby but couldn't bring anything...  No strollers in the stands ladies and gentlemen. Ticket taker was delightful and greeted everyone individually and still kept the line moving. Good experience hope to go again when the kids better understand it.",
   "Great spot on a summer evening for Class A baseball Lugnuts. Inexpensive tickets, good cheap food & beer nights. Take the entire family!!!!!",
   "Great games and good customer service didn't get an answer we ran out of anything."
  ]
 },
 {
  "name": "Rotary Steam Clock",
  "address": "100 N Grand Ave, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/98401b4a-9331-11ea-afa1-14b31f159f22.png",
  "tags": [
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9790363893642849502",
  "source": "GoogleMaps",
  "reviews": [
   "This is a beautiful piece of Michigan History!  One of the many free places to visit in Michigan’s Capital!",
   "So cool!",
   "I didn't know it was there. I have probably walked by it 100 times in the last year.",
   "",
   ""
  ]
 },
 {
  "name": "Owosso Curwood Castle",
  "address": "224 Curwood Castle Dr, Owosso, MI 48867, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/98d2e95a-9331-11ea-a4df-14b31f159f22.png",
  "tags": [
   "learn",
   "tour",
   "walking",
   "history",
   "walk",
   "art"
  ],
  "link": "https://maps.google.com/?cid=8673310418653049865",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to learn about the wildlife author  Oliver Curwood. A very interesting building. You wouldn’t expect to see a “castle” in a small Midwest town. The local organization has done a great job keeping it up and informative. Worth the $5.",
   "Great place to relax and take a leisurely strol. River, small falls, stone piller walking bridge all add to the things to see. Very old log homes and building are available to tour on some days. OH yes a Castle in the center of Michigan right along the river, Camelot maybe... You decide and make your own adventure stories.",
   "So much history in one little place. If you get the chance to go here...do. make sure you play around with the acoustics at the top of the tower too. So neat and surreal. Loved the movie in the lower level, and the set up was very nice and easy to follow. Would definitely go again.",
   "Very beautiful main room, not much else to the place. The staff woman was very friendly. The adjacent park is beautiful and very nice for taking a stroll.",
   "This was a really cool place. I had never heard of Mr. Curwood or his story's previous to visiting his castle. Was looking for something to do around our area and decided to check this out, man was I happy. There is not a ton to see in the castle but what you do see is filled with information on this guy's life and the numerous books he wrote that influenced over 200 movies.  Make sure you walk around the grounds and take the short walk to see where he actually lived as well. The art museum nextdoor is also worth a visit."
  ]
 },
 {
  "name": "Kids 'N' Stuff Children's Museum",
  "address": "301 S Superior St, Albion, MI 49224, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/99317f3a-9331-11ea-bfe2-14b31f159f22.png",
  "tags": [
   "creative",
   "family",
   "kids",
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13048039743715287405",
  "source": "GoogleMaps",
  "reviews": [
   "Took my 4 year old there while I was in the area visiting family. Loved it! Very clean, lots of great options for creative and pretend play. Definitely bring spare clothes if your kid likes the water table. Their waterproof aprons do eventually absorb water.",
   "It is definitely a great place to take younger children! Our five year old had a wonderful time!",
   "You can play make believe with full size equipment. You can put on an impromptu concert with bang pipes and xylophones. You can play blocks, dinosaurs, and build a fort. I love this place (I'm an old man) and I love to take my kids and grand kids there. I hope they stay for decades more.",
   "Wonderful exploratory play and learning museum for children. Great experience for kids and families. Wonderful staff who are very kind and helpful. A great variety of areas and experience. Definitely recommend anyone going to it for fun and I plan to return with my family.",
   "Whenever we're heading anywhere in Michigan, my 4 year old has to come to Kids 'N' Stuff. Michigan is now officially the Kids 'N' Stuff State. \n\nThere are so many options for any kid to enjoy themselves, if only for an hour while passing through. Adults can have fun, too!\n\nIf you're in the area I can't recommend this place enough, your kids/grandkids/nieces/nephews, etc. will love it."
  ]
 },
 {
  "name": "Castaway Play Cafe",
  "address": "1800 N Burkhart Rd, Howell, MI 48855, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9991a0e8-9331-11ea-a86f-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "kids",
   "food",
   "affordable",
   "free",
   "structure"
  ],
  "link": "https://maps.google.com/?cid=10595364740390197721",
  "source": "GoogleMaps",
  "reviews": [
   "I took my 1 year old son here a few times this past month. We've never been to a \"play place\" before so it was a completely new experience for us. We stay for about 2 hours and have lunch there. the food was good. it wasn't too busy for us so it was great for our first time. I love the fact that I could go in the play scape with him. Total I spend less than $20. my only grief would be that there is only a hand dryer in the family bathroom. I dont mind using it as it it's a good one, but my son didnt like it and freaked out and started crying. Otherwise the place is always clean and the staff is friendly.",
   "I was so thrilled with this place. Great prices, clean facility, and most importantly, a friendly caring staff. I've been to other indoor play places closer to me where the staff spends more time gossiping than working. Not here! Staff is on it and gently enforces rules, which made me super happy. The games were affordable, between .25 and 2.00. The food was a little on the pricey side, but! They had good size portions and the food was super tasty. My five year old had a blast and is begging to go back. My one year old enjoyed having a toddler area where she couldn't get trampled by big kids. I guess maybe it'd be cool to have one other bounce castle for smaller kids, but I'm not complaining.",
   "Absolutely the worst display of hospitality I've ever experienced. We called in the morning to get hours they were open. After being given information, we drove 30 min through the snow for my autistic sons birthday. When we got there and paid, we were kicked out after 20 minutes, so they could close and setup for a party...as if they needed to set up the 4 story play structure. Absolutely not happy paying $40/he to let my son have his birthday activity ruined.\n\nUpdate...the manager apologized and offered free passes for a return.",
   "Love taking my grandkiddos here. We spend lots of play time making memories and eating pizza!  Reasonable rates and clean atmosphere",
   "Very clean, great prices, and plenty to keep 7, 5 and 3 year old busy."
  ]
 },
 {
  "name": "Capital Bank Tower",
  "address": "124 W Allegan St, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/99da9146-9331-11ea-a692-14b31f159f22.png",
  "tags": [
   "tour"
  ],
  "link": "https://maps.google.com/?cid=8448485034434580520",
  "source": "GoogleMaps",
  "reviews": [
   "This is such a amazing beautiful place, to the glass floor to looking up to the top of the capital is beyond words can describe. The executive offices are wow super nice. Must go to place for a tour if you havent already. But beware there is a glass floor in case of people affraid of them!",
   "I worked here in the late 70s, used to party on the roof. The view was amazing!",
   "One of the outstanding architecture in Downtown Lansing",
   "",
   ""
  ]
 },
 {
  "name": "Boulder Ridge Wild Animal Park",
  "address": "8313 Pratt Lake Ave SE, Alto, MI 49302, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9a3709c6-9331-11ea-8191-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "kids",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=12454691369447366303",
  "source": "GoogleMaps",
  "reviews": [
   "We came here for an all bldg outing and were not disappointed!   We went on the tour and the staff got a vehicle that could accommodate us all,  wheelchair spaces as well.   There was a long line but they did not rush or make us feel as though we were a burden.   It was great!   We ate lunch at the picnic area just outside the attraction,  and after walked through the park.   It was very cool!   We found another picnic area much larger and off the main path,  wishing we had eaten there...  We bought some lettuce and carrots for the camel's and giraffe's.  It was time for us to head back before we got all the way through,  but saw most of it. Maybe another time,  worth every penny.   I wish we could get a business membership!   If I were an animal,  I believe I would be very happy here💕",
   "Seeing all of the animals was super awesome and you can tell they are well taken care of.  The staff is all friendly and my favorite part was how close you can get to the kangaroo. However, feeding a giraffe is a close second. It’s really a self led safari, which my boyfriend and I prefer. Don’t miss out on going on the free safari ride around the bigger sections of the park. The staff make it enjoyable and you see how huge the park actually is. Definitely would come back!",
   "What an amazing place!  My son asked me to give a review because he wanted to support this park.  The staff are very friendly and informed.  One of the workers gave us great insight into the uniqueness of the animals.  One of kangaroos would let me pet it and then it tried to box me.  The staff informed that it is an aggressive female but is very friendly.  That was helpful to know. : )\n\nAlso, the Animal Encounter is worth it!  We were able to see up close three different animals and pet them.  There was a 1-year old in our group and it was so funny to see how the baby reacted to the fox, kangaroo and lizard.",
   "While it is fairly obvious to me, they are just a beginning \"zoo\", others there seemed to be impressed. Most displays are pretty small and not well \"decorated\". You are able to get fairly close to most small animals so you are able to look closely at the animals. Will I take my soon to be born great grandchild there in a couple years? You bet. I will also try to take he/she to much larger zoos when he/she is older so animals can be seen in more natural settings. No I don't know the gender of my grandchild to be born in October, and my granddaughter is being very tight lipped about it. Works for me. I like surprises.",
   "Love the zoo. You can tell the animals are happy and well taken care of. Even the ones you cannot touch are social, playing with the kids from the windows. The zoo smells clean, and not like animals and the store is fun and affordable for the most part. We will definitely be attending future events again."
  ]
 },
 {
  "name": "Motz Park",
  "address": "4630 N Dewitt Rd, St Johns, MI 48879, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9a94e01c-9331-11ea-b8eb-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=3132682008460371781",
  "source": "GoogleMaps",
  "reviews": [
   "I love taking my dogs to the animal friendly side! On the other side is a person only swimming pond with nice beach and grills in addition to picnic tables. No recreation pass required. But parking fills up quick when it's hot out. Good fishing on both sides. Trails around the ponds on both sides.",
   "What a beautiful clean Park and prestine Waters very impressed",
   "A great party. Nice and clean.",
   "Nice location beautiful area",
   "Great fishing caught 25. One day"
  ]
 },
 {
  "name": "Chateau Aeronautique Winery",
  "address": "1849 Rives Eaton Rd, Jackson, MI 49201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9aee9ac6-9331-11ea-a965-14b31f159f22.png",
  "tags": [
   "tour",
   "tasting",
   "tasting",
   "delicious",
   "knowledgeable",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=9347929772857349950",
  "source": "GoogleMaps",
  "reviews": [
   "Really enjoyed the beer flight! Wines were good too. Nice location, friendly staff in the tasting area. We got an amazing tour from the owner and some great stories.",
   "The tasting staff was very helpful and the wine and beer was very good.",
   "So nice! Great staff and the owner gave a tour of his personal wine cellar and the airplane hanger! Everything was delicious and I felt comfortable asking questions. The staff was also very knowledgeable! A great stop for anyone who likes wine! They just opened a second location in Irish Hills that I can't wait to try!",
   "Had no idea what this about as it wasn't on the radar. But now totally an advocate as blew me away. Highly recommend!",
   "Decent beer and wine. Excellent atmosphere and service."
  ]
 },
 {
  "name": "Woldumar Nature Center",
  "address": "5739 Old Lansing Rd, Lansing, MI 48917, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9b46cb9e-9331-11ea-900f-14b31f159f22.png",
  "tags": [
   "nature",
   "nature",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=13014979882505779585",
  "source": "GoogleMaps",
  "reviews": [
   "Such I nice place to go for nature walks, or even runs. I like to take pictures every now and then. I usually spot deer out wandering in the morning. It's pretty neat seeing the place change with the seasons. Lots to see!",
   "Finally got a chance to visit this place. Very happy I did. Lovley forest and aesthetically pleasing views every which way you turn. Will definitely be returning.",
   "My best friend got maried here yesterday. Wonderful helpful staff and gorgous.",
   "Great trails winter or any season!!!!",
   "Great walking trails.  My wife grew up in a house next to the nature center, so we went walking here often...and then had our wedding here.  We were the first wedding here back in 2006 and it sounds like they have then here all the time now :-)"
  ]
 },
 {
  "name": "ALT Printing Co.",
  "address": "1139 S Washington Ave, Lansing, MI 48910, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9b9dee00-9331-11ea-83b5-14b31f159f22.png",
  "tags": [
   "unique",
   "art"
  ],
  "link": "https://maps.google.com/?cid=12661123132648682442",
  "source": "GoogleMaps",
  "reviews": [
   "Attended a great workshop. Owners taught the class and kept it light and fun! Would definitely attend another workshop and they have a lot of very unique prints.",
   "I had a great time attending their \"Ladies Night\" screen printing class! The owners were very fun and knew a lot about the process. They even helped me remake something after I messed it up!",
   "Great class.  A bunch of fun.  Will be returning for more with more friends!",
   "Fun, fantastic place run by talented people!",
   "I went here for the first time with my mom tonight for a workshop and had an amazing experience. We made beautiful Lansing-themed shirts and postcards. Tony & Kristen are super friendly and easygoing (and were super patient with me and my sloth-like pace of doing art). I encourage anyone to check out their shop and to attend a workshop.... You won't regret it!!"
  ]
 },
 {
  "name": "Ella Sharp Museum",
  "address": "3225 Fourth St, Jackson, MI 49203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9c081f4c-9331-11ea-b582-14b31f159f22.png",
  "tags": [
   "history",
   "historic",
   "art"
  ],
  "link": "https://maps.google.com/?cid=4925783079061795065",
  "source": "GoogleMaps",
  "reviews": [
   "A great place and full of history. Took my son here when he was little and had a great time",
   "Beautiful grounds, plenty of trails and activities. Beautiful museum.",
   "Great place for a wedding.  Good staff fantastic location.",
   "This is a very nice small Museum. I really enjoyed the wildlife art area and clock display. The historic buildings are nice too, but tours of the insides are only given at a few specific times.",
   "I had my wedding reception at the Granary. The staff were fantastic, the museum was open to my guests which they loved, and they made sure our space was very well taken care of. Chelsea Melin was absolutely amazing and accommodated everything I needed for the day. They were even able to bring in my husbands favorite beer which he thoroughly enjoyed. Hands down the absolute best place to host an event. Thank you for everything."
  ]
 },
 {
  "name": "Waterloo State Recreation Area",
  "address": "16345 McClure Rd, Chelsea, MI 48118, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9c6c8d78-9331-11ea-80ef-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7889020765361589345",
  "source": "GoogleMaps",
  "reviews": [
   "Came here on a warmer February weekend. The road to the main area is all dirt. Wash your car after if it’s wet! Ha,ha. But the trails seemed properly marked and there were bathroom facilities open on the premises. I’ll be visiting again when it’s warmer and less icy.",
   "Place is beautiful in the winter and spring. Not many people during this tyme. Easy to explore places and have solitude. I love this place.",
   "A wild place to hike, there are several trails you can walk. You can walk along with the lake or in the woods. Remember to have a hiking shoes, trails are cover with leaves, you never know what’s under beneath",
   "First blue sky in weeks. Needed to walk on some ice. What a beautiful part of the country. Very rolling and winding with mature woodlands. Therapy the natural way.",
   "DTE is the best Moran's biking trails in lower Michigan.. So beautiful and lots of water to enjoy 😊"
  ]
 },
 {
  "name": "The Creole Burger Bar & Southern Kitchen",
  "address": "1218 Turner Rd, Lansing, MI 48906, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9cd7abb6-9331-11ea-a1d0-14b31f159f22.png",
  "tags": [
   "food",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=17015286411316047815",
  "source": "GoogleMaps",
  "reviews": [
   "We went here for Sunday brunch on a sunny day and decided to sit outside. For drinks we started with Mimosas and Cajun lemonade. The mimosas were the best I've ever had and was refreshing. For food, we ordered a Breakfast bowl and a Trust me quiche with a Side of potato casserole and cheddar grits. I specially liked the casserole and the bowl. The service was friendly but a tad bit slow. But we weren't complaining about that since we very looking for a lazy brunch anyways. Overall, I would definitely come back and try their Lunch menu and their glorious mimosas.",
   "So good! If I had a car this would definitely be my go to bar and restaurant. Love they’re vintage eclectic vibe. If you’re feeling like trying something unique and tasty try their fries and dessert. Also their burgers are super good. If you just want a bar and hang out they have a separate section just for that, so they have the best of both worlds. This just made me hungry so I’m gonna stop writing this review.",
   "We originally intended to go to the place next door but it was closed on Monday. Wound up here and I wasn't disappointed. What a cool little \"hole in the wall\" joint. Service was great, shrimp and grits were fantastic. I'd definitely recommend going.",
   "Such a cool place with very nice workers. The Trust Us option was a hit with my husband. I got the mac n cheese with onions and sausage. We will definitely be coming back soon.",
   "Highly recommend! Had Shrimp and Grits with Andouille Sausage and eggs.  So good.  They even make their own hot sauce.  Along with a steaming french press pot and fresh cream.  My server Shannon was great.  Friendly, patient and great recommendations Above and beyond!  Thank you"
  ]
 },
 {
  "name": "Deluca's Restaurant",
  "address": "2006 W Willow St, Lansing, MI 48917, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9d2f1b38-9331-11ea-be7a-14b31f159f22.png",
  "tags": [
   "food",
   "tasting",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=9379691622333140939",
  "source": "GoogleMaps",
  "reviews": [
   "Deluca's is fabulous Italian food and the house wines are great. They are locally famous for their pizza but the pasta dishes are excellent as well. If you are lactose intolerant don't even pull in the parking lot, because they put LOTS of cheese on. Great people serving great food, that is Deluca's!!!",
   "This place has time of choices in ours menu. I enjoyed it more than most Italian restaurants. It's really nicely decorated, feels like a very classy place. The pieces are very fair. The service was good and friendly. The bathrooms are kept nicely cleaned. I was very impressed with the ambiance, seems like a great place for a romantic date.",
   "Hands down Deluca's is the best pizza in Lansing. The toppings are all the real deal, not out of a can. I've been eating their pizza for 32 years and the recipe hasn't changed for good reason. I can't speak so much for the other Italian entree's there, although, people I know enjoy everything on the menu. As long as I live in Lansing I'll continue to enjoy their great pizza!",
   "Living in TX & craving Deluca's. Promised myself this treat once I came home for a visit. Ordered the vegetarian pizza. It was good but not the GREAT tasting pizza that I remember. And they didn't add the broccoli which I didn't realize until after I left. Wasn't that impressed with my desert of choice either (cannoli.) But server Mary 15 was absolutely AWESOME! Very sweet woman!",
   "This is one the best pizza we have had. We did take out very friendly on the phone and in person. The pizza took about 40 minutes but for the heftyness it is understandable. We order a deep dish meat and a deep dish cheese.very filling hot, fresh and delicious . Would recommend."
  ]
 },
 {
  "name": "Meat BBQ",
  "address": "1224 Turner Rd, Lansing, MI 48906, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9d83f1a8-9331-11ea-9067-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1030890493335350286",
  "source": "GoogleMaps",
  "reviews": [
   "I got a pulled pork sandwich, my boyfriend got a burger, and we shared the disco fries with my brother and his girlfriend. I was surprised by the disco fries, they were amazing! The pulled pork sandwich I asked for with jalapenos, and it was amazing! My boyfriend's burger was really good as well. As for my brother and his girlfriend, they got mac and cheese with brisket on top. The whole experience was great, and the price was totally reasonable. I am totally coming here again soon!",
   "We happened to be in the Lansing area today and I googled \"good places to eat\". \nThis place popped up and instantly had my attention due to brisket.\nI have honestly not had brisket this good since I lived in Texas.\nI live about 1.5 hours away, but I will forsure be a regular at this place now.\nAMAZING FOOD!! Customer service was great too. Very nice staff.",
   "Best restaurant in the capital area. We go all the time. The sauces are some of the best I've ever had. The best part, their prices are almost unbelievable low for the amount and type of food you get. It's unreal. The only \"down\" side is the wait. Be prepared to wait when you eat there. The wait is almost always between 30-90 minutes. Also, if this is your first time going, when you enter and there's a huge mass of people, just push your way through to the little desk and get your name on the list. It's not really a line, so just get through and get on the list.",
   "Incredible food. Absolutely amazing. Local meat, excellent flavors.\n\nAnd yet the poor rating. Why?\n\nBecause they can't keep food in stock.\n\nThere's zero excuse to pop in on a Saturday at 7pm and they're out of food for the night. And this is constant. Often it doesn't matter how early you get there if it's a bit after they've opened. Out of food.\n\nThe only time you can go is the middle of the week at five or six. Any time after that and God forbid a weekend, you're screwed.\n\nI understand it's difficult to keep the fresh meat, but maybe figure out how to before you open a new dining room you apparently can't serve.",
   "Great service, great food. I cannot recommend the spicy creamed corn enough."
  ]
 },
 {
  "name": "Good Truckin' Diner",
  "address": "1107 S Washington Ave, Lansing, MI 48910, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9dc973ca-9331-11ea-90cd-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "unique",
   "free",
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1399945962373426986",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of the best places in Lansing to eat! The food is always great, the rotating daily menu means there's always something new to try, and the variety is excellent. \n\nThe only thing to be aware of is that it is small in there, so if you're trying to go on the weekend be prepared to wait, especially if you have more than one person and it's winter time. It's worth it though, and nowhere near the levels of trying to get into Golden Harvest.",
   "Very cool little place with a great menu! I love their specials! You have to try any of their breakfast tacos. Soooo good! Just plan on having a wait for a table if you go during a peak time. Small place with limited seating but it's well worth it! Service is great too! Love this place!!",
   "Tiny little diner with unique food options. You will definitely have to wait especially on a weekend morning. There is indoor and outdoor dining.  They have an extensive menu for breakfast and a large and cool street taco combinations.  When I went they had a gluten free daily special of a banana waffle with coconut cream. They were nice and customized it for me with toppings from another menu item. How could you not add bourbon banana fosters to it? \nTheir servings are large and filling and they have some really fun sandwich options and I drooled over the loaded fries. \nEverything is made from scratch and cooked right in front of you. \nWhen I return to Michigan this is definitely going to be one of my first places to hit for a sandwich to go and hit the river trail. \nOne of the tastiest places I've ever been and a hidden gem.",
   "Adventuresome collage of characters creating a culinary cornucopia of comfort. I had the Big Country omelette which was lish shush, although I had to wait a sec for the cheddar to soften up a bit. The Kids are trying here. Can't deduct a half star, for i was lil' chill. Freddie Mercury and Queen were my musical companions, and i enjoyed this quirky cove.",
   "I love this place. I have had almost every taco. My favorite is the jerk chicken. But, all are good."
  ]
 },
 {
  "name": "The Cosmos",
  "address": "1200 N Larch St, Lansing, MI 48906, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9e18331a-9331-11ea-9fa5-14b31f159f22.png",
  "tags": [
   "delicious",
   "creative",
   "unique",
   "delicious",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=6939639580450765441",
  "source": "GoogleMaps",
  "reviews": [
   "We are in town for a wedding and I am glad we found this place. I would recommend sitting on the patio. The buffalo cauliflower dip came with pita chips and was delicious. Both the Marge and the Black Truffle chicken pizzas were good.",
   "Great selection of craft beers and wines.  Wood fired pizzas that are creative with unique ingredients. We tried the \"Trust us\" pizza (new each day) and weren't disappointed.  Lighthearted space themed decor.  The dining room isn't very large so get there early.",
   "We come here every Thursday for the pizza and beer. We are always pleased! The trust us options are generally delicious and worth the surprise (also available in vegetarian and vegan)!  Sometimes there is a wait, and it is first come first serve - but it’s worth it!",
   "The food here is great but I did not feel it was as great as everyone talked about. My roommate and I ordered the Trust Us and The Spaceball. I think my issues were that I am used to regular boring pizza and that’s what I was expecting. The service was fantastic, and everyone was super nice. The drinks were amazing but expensive. Apparently, Guy visited there, and Cosmos was on his show which is super cool for the greater Lansing area!",
   "Had a wonderful time with Family. Pizza was wonderful. Friendly staff and a fun atmosphere.  A must visit!"
  ]
 },
 {
  "name": "Naing Myanmar Family Restaurant",
  "address": "3308 S Cedar St #3, Lansing, MI 48910, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9e7aecc6-9331-11ea-adc7-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "delicious",
   "family",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17206072385506777667",
  "source": "GoogleMaps",
  "reviews": [
   "Every dish was unique and delicious. And wonderful service with a smile.",
   "Very delicious food. Very friendly and hard working family. The place looks a little run down on the outside but very nice and clean on the inside.",
   "Firstly, this place is authentic and you can taste the fresh ingredients. You may wait a little but for your food, but freshly cooked food is top quality. \nThe food is excellent, just the right amount of spice. You grab a menu and seat yourself and a server will come take your order. It's a welcoming environment. I would definitely recommend this place, you won't be disappointed!",
   "If there’s anything Lansing has that Chicago doesn’t it’s AMAZING Burmese food! I’ve been wishing for great Burmese food in the Midwest for years, and this place is it. I had the Burmese fried rice and vermicelli Burmese soup, and both were outstanding. Hot, fresh, flavorful — all you can ask for from an authentic family-owned restaurant. Ssooo good. Definitely coming back on my next visit to Lansing.",
   "The hospitality, the service, the cleanliness all top notch.  The food is good, very tasty, but the location leaves a lot to be desired.  You get a large amount food for the cost.  Certainly worth the price."
  ]
 },
 {
  "name": "Capital Prime",
  "address": "2324 Showtime Dr, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9ec6753a-9331-11ea-a121-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16097796785206237519",
  "source": "GoogleMaps",
  "reviews": [
   "Went for Thanksgiving Day Buffet. Was sadly disappointed. Green Bean casserole- green beans were way way too crunchy! The Dressing/Stuffing - the carrots were crunchy!! Not even cooked. Foods were warm to cold and then when trying the Apple crisp for dessert, they couldn't even bother to cook that long enough for the apples to cook all the way through as they were crunchy too. Just a very crunchy meal today. Not what I expected when paying almost $150 for a descent Holiday meal out.  Very disappointed for such a high end restaurant.",
   "Service was great but honestly....For the price, if you can handle a grill or a cast iron pan you're 100% better off making a steak at home or honestly just going somewhere more middle of the road cost wise. It didnt feel romantic or private. Just not what I expected for a steak over $100(there are cheaper options)",
   "Recently ate dinner to celebrate our anniversary. They were very accommodating, including a table card, flowers and complementary champagne. The appetizer, entree and dessert were all very nicely prepared and tasted delicious. Our waiter Andy was the perfect combination of professional and personal. Upscale, yet casual environment. Nice selection of wine, alcohol and mixed drinks.",
   "This is a high end restaurant, with clean and neat contemporary decor and white linen table cloths.  It’s got a sizable menu and a series of beef selections that will keep you full for a week.  I ordered a couple of Old Fashions before dinner that were mixed well and included the Luxardo cherries and large single ice cubes that demonstrate a more sophisticated bar.  The drink portions were a bit light.\n\nThere’s nothing better than having a hot bowl of French Onion Soup, but I’ve tasted better.  There was a strong sage flavor that needed to be dialed back.  The steaks tasted pretty good and were quality cuts of meat.\n\nThe main dining area was a bit chopped up because of the floor plan, but they have a neat bar area with dining seating as an option too.  If there was a down side, it was the price.  We had a party of four, soups and salads, but no appetizers, no desserts and only two alcoholic beverages between us and the bill was nearly $250.  \n\nCapital Prime is a nice restaurant for a work function to entertain clients, but it’s not a place you’d go often on your own because of the price.",
   "Excellent customer service, delicious food! If you’ve got $$ to spend & want a delicious meal, this is the place. The quality of the seafood is amazing 😋 I didn’t take any pics because I ate it too fast."
  ]
 },
 {
  "name": "Mitchell's Fish Market",
  "address": "2975 Preyde Blvd, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9f07ee8c-9331-11ea-9701-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3122323225964810854",
  "source": "GoogleMaps",
  "reviews": [
   "The oysters are to die for. They are so yummy, 🤤 I ate like 3 dozen of them last night. The prices are a little high though, I bought the Americana dish and there was mostly potatoes on the dish, which I didnt appreciate, so that is why I took off 1 star. The sauce was good though. And my husband and son like their dish. The waiter Zach was great, very professional, he represents the company well. I encourage you to try it. You wont be disappointed!!",
   "Our favorite for coworkers holiday luncheon every year, foods are always delicious and satisfied. Check in early that's I could hear coworkers and not much when busy. I have swordfish dish and it was very good. Usually I get fish & chips is my personal favorite dish.",
   "Amazing scallops!  The waiter was knowledgeable and friendly.  The manager brought a couple of the different types of oysters for us to try.",
   "Went here on an early Saturday evening.  There were seven of us. Waitress was very attentive and helpful with menu choices.  She asked everyone at the table their name and remember each and everyone as long as we were there. Everybody was happy with their main course selections.  I also ordered a shrimp and andoullie sausage shareable plate which was very ordinary and unremarkable. Overall though a great dining experience.",
   "We ordered a large carry out order for our family and to deliver to another family. The pick up line was long and these people were clearly busting their tails to fulfill our orders safely. And it was delicious! Thank you!"
  ]
 },
 {
  "name": "Golden Harvest Restaurant",
  "address": "1625 Turner Rd, Lansing, MI 48906, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9f5c776e-9331-11ea-9600-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food",
   "unique",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=10216988428973279591",
  "source": "GoogleMaps",
  "reviews": [
   "Wow this place did not match the hype. I’ve lived in the area for a few years and have heard good things from various groups about Golden Harvest. Which is surprising considering the expectation that the customer has to stand outside until they’re allowed to come in. To be fair, if you’re solo or in a group of 2 you probably won’t have the experience of a group of 3+. We waited outside for 50 minutes in 35 degree weather. After being sat for 20 minutes we mentioned to our server that we were ready to order to which he replied “oh well actually how this is works is you place your order when I’m ready to take your order” while he overfilled my coffee without an apology or cleaning it up. After our order was submitted we waited an hour and 45 minutes to receive our food. We watched 4 groups who sat after us eat and pay before we received our food. 10 minutes before our order was brought out we asked if it was almost ready since no employees had approached our table to acknowledge the wait, the same server replied “the food takes a minute, this isn’t McDonald’s... we tell people an hour outside and then an hour inside” once the food was brought to the table we were bombarded with questions of hospitality that most restaurants, even McDonald’s, would’ve given during our nearly 2 hr inside wait for food. I could see this place being enjoyable if you’re treated like a valued customer, but unfortunately it seems hit or miss. Having a short staff creates problems with fast turn around obviously, but to avoid a table because you don’t value their time is a choice of attitude. I’ve only given a few reviews in my life and it’s usually when the service is abnormal. Maybe others will have better luck or experiences. This was easily the worst and only “three hour” dining experience I’ve had in years.",
   "You can have uniqueness without being literally dusty and dirty. I understand there is supposed to be a rustic old garage type feel, that’s cool, but still clean it. Also, not everyone wants to have to sit with a complete stranger at a very small table of four just because of your lack of seating. I bumped elbows with someone my entire meal. The food, itself, was good. Not bad, not great. The staff was in no way attentive, and only visited my table once within the hour wait I had after ordering. This is not including the hour wait outside just to get in, hoping to receive this “experience” that has been raved about, that I was still, at this point, excited about, until I walked in the door. All of the bad definitely outweighed the one “good” (the food. Not bad, not great). Based off your name and the good reviews that you do have, don’t get too humble to take criticism. No one is above their customers feedback. Treat your customers better, at the least.",
   "Don't get me wrong, Golden Harvest is very good. I'm just not sure it's \"wait in line for an hour after arriving an hour before opening on a weekday in the winter\" good. I did really enjoy it the few times I've managed to go, but I'm just not dedicated enough for it with any regularity.",
   "I don’t usually post reviews but this was the worst I’ve ever been treated by staff members at a restaurant anywhere.. not only did it take 2.5 hours for breakfast food (eggs) to arrive for our table of four, one staff member told us he would not apologize for the delay because “he doesn’t apologize to anyone for anything.” When we told the cashier we weren’t thrilled about the treatment and wait she told us “we should have played uno while we waited.” It’s really a shame because the food is good but it’s not worth being treated this way.",
   "Food was great. Service is terrible all around, place is a lil run down, expensive for what they offer.\nMost of the fans or employees even of this place are also toxic to any bit of critique someone has to say just because they don't agree with the hype or experience they do. \n\nMusic is cool and the signs and other stuff around the place are unique.\nThis place could be a lot better then what it is by simple improvements."
  ]
 },
 {
  "name": "Pablo's Old Town Mexican Restaurant",
  "address": "311 E Grand River Ave, Lansing, MI 48906, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9fe68006-9331-11ea-be88-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "eat",
   "food",
   "food",
   "cheap",
   "eat",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=15688205100091186327",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful place. Food was delicious. Bathrooms are clean. If you're lucky Jackson and Lansing Railroad has been running near by on Friday for the first time in decades. I hope to see them some day. Seeing a train in old town has been a dream since I moved to Lansing 15 years ago. I plan to visit again to try out more of their menu.",
   "Food is good. Although  I eat better before in a different place. But this one is still one of the good Mexican restaurant. Like it",
   "I called to place an order, phone rang 20 times and I hung up. I drove there and walked in and the employee didn't care that no one picked up. I started to order food and the phone rang and she picked it up. That's annoying. Also was not allowed to use more than one $5 coupon from restaurant.com (supposed to be able to use $5 with each $10 spent) even though my bill was $43. Got home with the food and they had packed the soup sideways so a lot of it leaked. Food was fine, but the rest of this experience was poor",
   "We went to this area of Lansing to eat at another restaurant. The wait was to long for us at that place, so we walked around a bit. We're from out of town, and not familiar with the local places. Luckily we walked by this Pablo's, and decided to try it. We were not disappointed. The food was simple, but the flavors were amazing! Perfectly seasoned asada, and the best refried beans I've ever had! The prices were surprisingly cheap for the quality of the food, and we were served super fast. Top notch authentic Mexican food.",
   "Always really good! This place never disappoints!! One of the best places to eat in town!!!\n\nIn pic is beef caldo with the side of rice mixed in with it! My favorite to get with chips & salsa."
  ]
 },
 {
  "name": "Bowdies Chophouse",
  "address": "320 E Michigan Ave, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a03cdd5a-9331-11ea-bc38-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=615346467524560784",
  "source": "GoogleMaps",
  "reviews": [
   "Love this place! The steaks are without equal. They've ruined so many other places where I used to eat steak because of how incredibly tasty they are. Service is impeccable. The staff here truly make you feel at home and everything is served fresh with a smile. It has a great laid back vibe to it.",
   "Always fantastic food with great service. The folks here are very accommodating when possible and will be happy to make suggestions for menu items or alcohol. Never a bad meal here!",
   "Everything was done exactly as it should have been. \n\nOur waiter was very friendly, our drinks were good, my steak was cooked perfectly, and everything was brought out at the right pace. \n\nThe ambiance was lovely. \n\nWould definitely come again.",
   "There is only one word that explains the true definition of an exquisite experience...... PERFECTION!",
   "Amazing food.  Best steak ever!! Great table service !! . HOWEVER  ambiance could use some improvements! Edison bulbs mixed with blue light LEDs ,  Drop ceilings  bathrooms need details cleaned (edges and crevices ) the layout for bathrooms and traffic of people, waiter and waitress staff bringing food /walking flow is awfully cramped and awkward. Back steps are slippery.  Just some thoughts for a high end steakhouse."
  ]
 },
 {
  "name": "Dagwood's Tavern & Grill",
  "address": "2803 E Kalamazoo St, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a09ce424-9331-11ea-bac2-14b31f159f22.png",
  "tags": [
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5442699486609948268",
  "source": "GoogleMaps",
  "reviews": [
   "The beer selection was nice. My dag burger was very delicious. And the service was good. I'm glad that someone recommended the place to me while I was passing through Lansing.",
   "Great prices!  Good service! Our three apps were tasty. Burger was also good but the buns were ice cold.",
   "my brother and I make it a point to go here any time we're around and they NEVER disappoint. plus they make the BEST burger ever. they don't skimp on the onion, which to me makes them number one. onions rule.",
   "Best place in town for a working class happy hour. It's okay if your work clothes are dirty. \nI love their olive burgers and their fries. You can always get a craft beer on draft too.",
   "Great local bar. Good food, friendly staff. Owners Marjie and Mark have done a great job with this establishment! You need to see for yourself."
  ]
 },
 {
  "name": "Texas Roadhouse",
  "address": "280 E Edgewood Blvd, Lansing, MI 48911, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a0e22a9a-9331-11ea-a223-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16389157930400960733",
  "source": "GoogleMaps",
  "reviews": [
   "Wanted to order something  I haven't  been able to get in the last  month. I ordered and pulled up and was really impressed.  I felt like I was pulling  up to a drive In restaurant.  They had the parking  lot all  set up and a  wait  staff  ready  to serve. Taking  orders or bringing  the  order out. Food was awesome  and so recommended  going to see them❤",
   "Had lunch with my co workers.  My steak was delicious.  Thanks  Mark Jenks for the lunch you're the best supervisor any one could work for",
   "This is not a high end steak restaurant but it does serve the finest steaks in the area. It’s a family friendly atmosphere with great food and drinks. Great for birthdays or just a regular weeknight out. I’ve been here more times than I can count and have not been disappointed yet.  I Usually get a steak but their burgers are amazing too.",
   "My blue cheese salad w perfectly cooked steak on top was the bomb. Please, less salt in the mash potatoes, and those would get 5 stars, as well. Also appreciated honest description of green beans when my friend asked so she could choose a fresh veggie option she desired.  I wasn't informed first couple times I'd went there, and expected fresh green beans with bacon.",
   "Food was good & service was great as usual. Ordered the salmon salad @ $13. Only gripe was that the cherry tomatoes were severely overripe & mushy. However, I do appreciate that they don't water down their dressings like a lot of restaurants. The mango margarita is soooo good, especially with the extra boost of either 1800 or Patron."
  ]
 },
 {
  "name": "Zeus' Coney Island",
  "address": "6525 S Pennsylvania Ave, Lansing, MI 48911, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a11e019e-9331-11ea-9a63-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "drink",
   "food",
   "walking",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9744165491986123433",
  "source": "GoogleMaps",
  "reviews": [
   "We love coming here for breakfast/lunch!! And both times we've been here, the service from Ashley is great! She is so much fun and brings a smile to everyone. There is nothing greater than someone who thoroughly enjoys what they do. The food is great - I always get the Athena's choice breakfast with french toast (it is the best!!)",
   "My first time in Lansing and I’ve been here two days in a row so far. I’ll probably be back again before I fly home. The service, food, and prices are great. The portions are big enough I can make two meals out of one. The restaurant has been busy both times I’ve been in yet it didn’t negatively impact the service at all. If you’re in Lansing and you’re hungry, you won’t go wrong choosing Zeus’ Coney Island.",
   "Our Waitress Sydney was awesome that is why I gave them a 3. If it wasn't for her it would be much lower score. We had a table of eight people. The food was ok. The reason I wont be back is one of the other servers. \n\nThe credit card machine wasn't working very fast so there was a line to check out. The hostess was doing a great job trying to move things along. Apparently we were in the way of one of the other waitresses. A tall older lady with her hair in a tight pony tail kept referring to us as,\n\nThose F@%king people!\n\nI think she realized she was not invisible when she saw me staring right at her. She only made the reference twice but she did it in front of friends 4 year old both times. Not cool",
   "After reading google reviews I decided to give this place a try, and was not disappointed at all!\nEven at 3pm they were still somewhat busy, usually a good sign. The entryway is crowded and basically nonexistent, walking in the door puts you basically at the counter where customers pay their bill and several were doing so at the time I arrived. Once seated our server, Ashley, was quick to greet us with a smile. I had the traditional gyro, made it a combo with fries and a soft drink. Asked to have my fries made with chili and cheese, was even given the option of shredded or cheese sauce. My company for lunch ordered a grilled chicken sandwich without mayo or a side. Total was a very moderate $16, outstanding value! Food came out in a timely manner and there is nothing I would change about it at all. They have a wide variety of menu items, breakfast all day and fair prices. The dining room was clean and well kept, I will most definitely return!",
   "Great food , I had the hearty breakfast platter,  it was delicious,  the restaurant is very clean and the service was great, they kept my cup filled with bottomless coffee and the staff is very friendly and helpful, I enjoyed my eating experience at Zeus's coney Island,  looking forward to returning soon. 👍🙂"
  ]
 },
 {
  "name": "BRAVO",
  "address": "2970 Centre Blvd, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a17df1a8-9331-11ea-b4a0-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8680952238697333693",
  "source": "GoogleMaps",
  "reviews": [
   "I used to work at Bravo in the Grand Rapids area and I extremely disappointed with how the owners treated our staff. I always thought highly of everyone and loved the food and experience I got and even gave to the customers. The store was open for 4 years and the owner showed that their values do not align with their actions, ESPECIALLY during a crisis. They didn’t even last a week. While I love the food and support all staff, I would suggest you think before supporting the Food First corporation.",
   "They use Open Table for walk up seating. Seated quickly. Waitstaff courteous and friendly. Appetizers and food prepared and delivered timely. All tasted very good. Desserts were very good as well.",
   "The food is delicious, the service is very good. The lobster bisque is good. The meatball appetizer was really good and a nice addition. Crispy was nice with a mild heat to the sauce. The grilled salmon cooked correct but left a little something to be desired. The Cesar salad is what it is. Not my favorite calamari. Creme brulee is solid and the cheesecake looks amazing. Deep-fried ravioli is awesome but my favorite was the meatballs.",
   "First time at Bravo and I would definitely come back. Nice staff and great food! I got the Pasta Bravo. The complimentary bread was perfect as it had just come out the oven piping hot and the olive oil sauce it comes with was delicious!",
   "Have enjoyed this location and Ann Arbor a few times. Varied menu of traditional Italian fare. Have yet to be disappointed. Good value for what you get. Service has always been top notch, too."
  ]
 },
 {
  "name": "Grand Traverse Pie Company",
  "address": "200 S Washington Square, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a1d0579c-9331-11ea-91d6-14b31f159f22.png",
  "tags": [
   "comforting",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1700071515412207884",
  "source": "GoogleMaps",
  "reviews": [
   "It doesn't get any better. A great place for a quick lunch,  or a gift apple pie to go, to give to a loved one. Lansing has great character as a city, and the Traverse Pie company adds to that overall great place to live or  visit feeling. I reccomend the pot pie.",
   "Warm and comforting just like the food they serve. I had the Tex-Mex salad which was colorful and satisfying.  Some items can be pricey (a slice of pie is five bucks). I have only been in the afternoon. My guess is that the breakfast and lunch rushes are bonkers. Give it a shot. Peace.",
   "I absolutely love coming to grand traverse pie company. I'm at the one on the corner of Allegan and Washington. There pie is simply marvelous in every way imaginable. I am writing this about the service which has truly impressed me. That's why this is one of my happy places I enjoy coming to when life has before times more difficult than usual just to be able to enjoy the wonderful atmosphere service, and food. I give grand traverse pie company 5 stars and 2 thumbs up in all categories.😁",
   "Delicious and filling food. Crowded but also lots of space to sit. Food comes out relatively quickly, and I was able to have my lunch in less than 30 minutes. Pie is delicious, and their pot pies have a satisfying savoryness to it without being too buttery. Salad is just salad. I would recommend, especially at their prices.",
   "I wish they would Have  lemon meringue pie all the time. You have to special order it. I tried the apple dumpling. Did not like that it was  cold. Needed to be warmed up more. They did do that without complaint. Nice service."
  ]
 },
 {
  "name": "Fidler's on the Grand",
  "address": "4805 N Grand River Ave, Lansing, MI 48906, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a213f074-9331-11ea-a964-14b31f159f22.png",
  "tags": [
   "cheap",
   "family",
   "food",
   "food",
   "delicious",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17593379825225593692",
  "source": "GoogleMaps",
  "reviews": [
   "Had only driven by this place before and today decided to give it a try, 100% worth it. The phone and pick up service was quick and very friendly! Prices are cheap for the quality and quantity of food. Not to mention the cinnamon rolls were some of the best my family has had!",
   "First time at this popular brunch spot.  Seating method is a bit odd, this place is too small for the business it gets.  Great for the owners but the dining experience suffers.  The food prices were great, wait was extensive and was disappointed that my sandwich came out soggy on one side like it was waiting and fries were limp and not hot.  I don't mind the wait as long as the food is right.  Smoked brisket is not what I consider smoked, more like braised.  (Photo of fries and brisket) A little too much icing on cinnamon roll for my taste, ratio was off because they are quite thin.  The buttermilk biscuit looked great.  Would maybe go back to try.  Definitely not the worst but not the best place in Lansing for brunch. Games while you wait.  The service was great and owners appeared to be friendly and loved...had the food been great, it would have gotten 5 stars.",
   "Excellent restaurant!  The staff is friendly and the food was even better.  I had the Gorgonzola Burger and it was delicious! Everything was fresh, like you can tell they use homemade patties and not factory/frozen.  \n   The restaurant is small and doesn't appear to be much from the outside, but don't let that fool you!  It's well worth the visit.",
   "Visited my folks in Lansing over Father's Day & we had to go to this new breakfast place. Woke up at 8 a.m. to get there early and for good reason! Arrived to a jam packed parking lot and line starting to creep out the first door! \n\nThere's no sitting and trying to figure out what to eat. Hop in line, eye up the menu, order when it's your turn, grab you order number, your beverage *(Fresh Brewed Bigby Coffee)* and take your seat. \n\nFood followed shortly and was well worth the short wait! Reasonably priced and well portioned, we did the Santa Fe Breakfast Bowl w/chorizo, the American Breakfast Omelet (Mom loved the fried potatoes), and the Breakfast tacos (which is a breakfast first for me). Everything was well presented, super tasty, and filling. \n\nWe also ordered 4 cinnamon rolls to go. I'll let you about those later, but we heard they're a must! \n\nSupport local, support often. Enjoy!!!",
   "This place is a true hidden gem. Our food was ready on time, phenomenal service, and incredible food. The menu is eclectic but classic. I would suggest this restaurant to anyone looking for a great, out of your ordinary, complete breakfast. I have not had the lunch items but I am extremely excited to try. 100% satisfied!!!!"
  ]
 },
 {
  "name": "Saddleback BBQ",
  "address": "1147 S Washington Ave, Lansing, MI 48910, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a264a8ac-9331-11ea-bc4d-14b31f159f22.png",
  "tags": [
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16079195624919106129",
  "source": "GoogleMaps",
  "reviews": [
   "I've been to all the BBQ places in the Lansing area and Saddleback stands above them all. The service is impeccable, very friendly staff. The BBQ ribs and brisket are smoked just right along with the seasonings/rub. Took my daughter's there today and we had a fantastic time sitting outside in the sun. Also I should add, the bathroom is modern and super clean. Something I can be picky about when reviewing a restaurant. I recommend to all who are looking for good BBQ at a fair price.",
   "I had the brisket, greens, and beans. My sister had the chicken tacos, and Mac the and cheese. Nothing was 'good'. The greens had extremely fatty  chunks of 'meat', the beans tasted like chili beans in disguise as baked beans. We could not eat them. The sauce containers were small and half of them weren't even filled up half way. The brisket was the best part hands down. We ordered online obviously, considering.",
   "Love the bbq. Always fresh and quick service. Highly recommend the corn cake and pickles too! \nI like this place more than the other popular local place.",
   "Loving that Saddleback is still open for takeout during this quarantine. We have ordered a few times and have been extremely happy with every meal! Brisket tacos are fire!",
   "If I could offer 10 stars, I would.  This amazing place donated a mountain of amazing barbecue to frontline caregivers at sparrow hospital. \n Thank you so much, the food was incredible!!"
  ]
 },
 {
  "name": "P.F. Chang's",
  "address": "2425 Lake Lansing Rd, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a2b44f80-9331-11ea-8c8e-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14445350771140384261",
  "source": "GoogleMaps",
  "reviews": [
   "Have not been here for quite a long time. New menu changes are very nice. Excellent appetizers. Recommend lettuce wraps. Entrees nicely done and very tasty. Reasonably priced considering the quality of food. Greeter and waiter were very cheerful and attentive. Dining area clean and warmly inviting.",
   "We had a mini reunion here with my high school friends. The staff is commendable, it was so nice of them to help me get the reservation despite some challenges. And their food was equally delicious of course. Their lettuce wraps is a must try! I will definitely keep coming back.",
   "Loved the sweet and sour chicken. A good balance of sweet and sour. Ginger was also a nice flavor in the dish. Our server was great. He made sure our drinks were kept filled and any thing we needed was taken care of.",
   "Party of five. Seated quickly. Very nice atmosphere. Great service. Food was good, but very expensive.",
   "I don’t intend to speak in hyperbole here, but the food honestly tasted like a less flavorful Panda Express for 3x the cost. Panda Express is legitimately serving better food than this PF Chang’s location. Also, even though we went on a really busy day, the service was surprisingly bad. Our server seemed like a nice kid but was way in over his head...and reeked of body odor. We were not happy, especially after coming to a PF Chang’s for the first time in many years and having nothing but fond memories in the past. \n\nThe dessert with the coconut ice cream and fried wontons though, was divine. It is still one of my favorite desserts of all time. This is the only reason this review is getting 2 stars. That and the undeniably beautiful interior and lively ambiance. However, when the food sucks, nothing else really matters."
  ]
 },
 {
  "name": "State Room Restaurant",
  "address": "219 S Harrison Rd, East Lansing, MI 48824, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a3057d0a-9331-11ea-9f28-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "creative",
   "learn",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7717158259117939003",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful decoration and atmosphere. The food was great. The service was amazing. Food was neatly presenting! They should have something specials for the graduates!",
   "My date and I experienced the State Rooms sunday brunch buffet this weekend, it was fantastic, the salmon with chardonnay sauce was my favourite. Our waiter was excellent along with our host. I would recommend making a reservation and to note that one can reserve a more private dinning room similar to a conference room. They served Paramount brand coffee, we purchased a pound of from the restaurant before we left. I recommend the State room for a more upscale brunch option.",
   "First time going, it's difficult to find the restaurant from the parking garage. Have to actively look around to find your way there. \n\nIt was a pleasant experience being served by students learning. You could tell they were still learning, but they cared about their work. It seemed a bit empty for a weekend night in there, but still comfortable. \n\n I wouldn't recommend ordering the hen though, there no thrills to it and chicken is better. But I would prefer juicy Quail on the menu instead. The desert menu is a step up from most restaurants and the sorbet is chilled and served perfectly. Very impressed with the sorbet. Would go back again!",
   "My wife and I's first time coming here was after we had gotten married. We usually come here on special occasions and are never not satisfied with our food and customer service.  \n\nTruly a great place to come. The atmosphere is soft, mellow, quiet, relaxed and all other synonyms of those words. I highly suggest The State Room Restaurant.",
   "Prefer the small menu, fresh, simple, Michigan creative. Locals enjoy, summer offers outside jazz nite dining. Don't miss it. Teaching undergrads how to be successful in Hospitality Business. They learn first hand from professional chefs. Menu is locally grown food and produce.  Brunch is good if you haven't experienced it."
  ]
 },
 {
  "name": "EnVie",
  "address": "210 S Washington Square, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a3554b58-9331-11ea-8be3-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7016225616291107681",
  "source": "GoogleMaps",
  "reviews": [
   "Only been there once, a bit too soon to give it  5 stars, as I had a salad. It was good. The service was excellent, everyone else liked their meal. Will definitely try again. The prices were about what I expected. The menu ran from dinner salads, to burgers, to steaks. I would recommend.",
   "Great place, extremely clean. The bar is awesome, they even have homemade bitters. Got to come back here!",
   "Loved new york steak here!!! Very elegant ambience and perfect place for my v-day",
   "Great ambiance. Delicious food and amazing service.\nThe bathroom is very clean.\nI suggest reservation.\nThe service is fast and the price $$$",
   "Great food. The atmosphere was very high end. Enjoyed our meals there. The duck was so well done."
  ]
 },
 {
  "name": "Aladdin's Restaurant",
  "address": "300 N Clippert St, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a3bb600c-9331-11ea-a622-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "delicious",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=549859359908416436",
  "source": "GoogleMaps",
  "reviews": [
   "Pretty good Mediterranean food for the price. The humus is excellent and they give you plenty along with much fresh pita bread. Some places skimp on the pita Aladdin's does not. The real deal Mediterranean coffee is one of my personal favorites in the Lansing area. I appreciate the refills are free. Staff is friendly along with good service. I'm leaving 4 stars as opposed to 5 due to the uncomfortable both seats and the place has deferred maintenance/updates on the decor.",
   "For $16+, you can get this lamb+chicken kabob w rice. To be honest, the price is a bit high for this portion. And the kabobs are a bit burnt. \n\nI am giving 4 stars to give them a chance to improve. I think they give a lot of condiments (bread, etc) but small meat and rice portions for the money. \n\nIf you come here, i suggest the sandwiches as those are much more worth it.",
   "My wife and I LOVE the Mediterranean menu at Alladin. ALL of our favorites are served in authentic fashion.  The Kebabs are a favorite because of the char broil and perfect spicing. And of course the delicious pastries like Bird Basket and a great way to top off a perfect meal.",
   "I love this place and I’ve never had a bad experience! When I lived in Lansing, I went very frequently and I still visit quite a bit when I’m in town. Great food and nice people!",
   "The food here was really good. My husband and I enjoyed our lunch here. Service was quick and friendly. Dinning area was clean. We will definitely eat here again."
  ]
 },
 {
  "name": "Tannin",
  "address": "1620 E Michigan Ave, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a3fc12f0-9331-11ea-b7cc-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5088689210707604367",
  "source": "GoogleMaps",
  "reviews": [
   "Me and my wife had a good experience here. a very well thought out beer list, and I appreciate that. I had the chicken parmesan, the chicken was good breaded well and good flavor. The noodles were good. My wife loved her dish. The bread that came out to start was great. Bathrooms could use some updating, overall atmosphere was very nice. To end I had the bourbon ice cream, heavy bourbon flavor but still good. I would recommend trying it out of you've been curious and I wouldn't mind coming back.",
   "Absolutely love this place. Service and food are both always great! \nReservations are a good idea on busier nights as they may not even have room at the bar without a reservation.\nAt dinner be sure to get the bread with salted butter, it's amazing!\nPortions are pretty large, but they offer a half for most of their entrees. Unless you are incredibly hungry, or want leftovers, the half portion is usually plenty if you have bread and an appetizer.",
   "Oh man. What an experience. Cracked it off with the calamari ~ amazing. The attention to flavor and bringing together senses that BELONG, the sour of the pepper pickles balancing the weight of the fried calamari, dressed in lovely herbs. Divine. The goat cheese ravioli was a whole different beast. I can't describe that sauce but it complements the cheese in... The most perfect way. To top it off, a lovely garnish of basil sprouts, too cute. Absolutely an experience, and at a reasonable price! Make the trip",
   "The food selections seem to have something for everyone's palette. The prices are fair and the food is excellent along with pleasing to the eyes presentation. We really liked how the entrees give you the option of a small or larger portion and priced according. My wife and I like to order different entrees and appetizers and share our food. We had Kyle as our server and he was spot on! A refreshing change from our last couple restaurant experiences where the food was good, however, the service was poor which is a real drag when you're spending decent money for the dinning experience.. The decor is just so so.. The building is the old Kentucky Fried Chicken that closed after an employee was murdered during an armed robbery in 2011. I felt there was a bit too many tables so when busy during Friday and Saturday night you're kinda shoehorned in there. The legs of the small tables near the bar are not level prompting our server having to place folded up napkins under one of the legs to prevent the table from rocking side to side. I would think a restaurant would have that figured out before opening up for business. A bit too much lighting in the restaurant I thought as well. All in all we did enjoy our experience and will return. When we do we'll request Kyle to be our server he was fantastic!",
   "Excellent food.  Best pasta in the Lansing area.  Excellent wine selection. Great service.  Prices are more adorable than the old location.  I really appreciate that they offer large and small sizes on most entrees."
  ]
 },
 {
  "name": "Taste of Thai",
  "address": "2838 E Grand River Ave #2, East Lansing, MI 48823, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a489fb2c-9331-11ea-9781-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17107624472996688751",
  "source": "GoogleMaps",
  "reviews": [
   "The food here is very good. Host is welcoming and friendly. Ambience is very nice. Definitely going to visit again. Everything we ordered from the menu was delicious.",
   "I like this place a lot and went there twice while visiting my dad over the holidays. I think he eats here at least once a week! If you come for lunch, the meal includes a tofu soup, salad, and spring roll. The entree portions whether for lunch or dinner are huge! The first time we came, we ordered lettuce wraps, papaya salad, and fresh rolls to share. I got a small cup of tofu soup and my dad had either tom kha or tom yum (don't remember). The next we came for lunch and I had the red curry noodle and my dad ordered the green curry. Everything was so delicious and the ingredients tasted very fresh. The service left a little to be desired but that's often the case in a college town. Overall, they have excellent food especially for having such a large menu. Definitely will be back next time I'm in town!",
   "Went with some co-workers for lunch.  I ate the chicken pad Thai, which was tasty.  Maybe not the best, but good and a great value with the soup and spring roll included with the meal. \nCo-worker loved the pad Thai.\nStaff was attentive and friendly.  The restaurant was clean and pretty nice ambiance.\nI would go again and try another dish.",
   "These might very well be the best crab Rangoon‘s I’ve ever had. LOL! I am surprised I loved crab Rangoon’s so much!  But these were perfectly cooked and surprisingly delicious! Th shell  is light and crispy and the sauce is a wonderful modern twist to the original and really sets it apart! The rest of the food was also wonderful, but I just love these!",
   "This is one of the best Thai restaurants in Lansing/East-Lansing area. The food is great. The ambience of the resultant is not second to the taste of the food, either. If you go for the Lunch time you get a complimentary appetizer dish with your main meal. I recommend the Prik Pao fried rice and Pad See Ew (noodles)."
  ]
 },
 {
  "name": "Soup Spoon Café",
  "address": "1419 E Michigan Ave, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a4d471e4-9331-11ea-8465-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6044028371928695532",
  "source": "GoogleMaps",
  "reviews": [
   "My wife has talked about this place for years (she went once as an undergraduate). Every time I ask where she wants to eat, she always brings up this place. I have always denied her and we would go someplace else. Anyway, I finally caved in yesterday (because no one else was open) and we stopped here and ordered the lentil sandwich! WOW! That was by far the most amazing thing I have ever eaten! It tasted just like a hamburger, with the texture and meaty taste. I am actually really excited to go back again this week! They have lots to choose from and from the brief interaction I had with employees, they seemed very nice! I am so sorry I denied my wife in coming here, we will be back a lot more now! I wonder if they sell growlers or where I can get one? I really want to try there beers! Anyway, if your looking for great food, I highly recommend this place! Also, Thank you for being open during COV19!",
   "The food here was fantastic and they do accept reservations, so that made things very easy. The staff were very friendly and helpful. Definitely want to go back!",
   "A small, quaint, pricey place! Appetizers and dinner meals were delicious. All dishes we re a tad bit salty and greasy, but interesting dishes. We were a large group and ordered several dishes and everyone liked theirs. Service was good, and the place was clean. Sides were small for meals for the price.",
   "Nice open dining areas. Waitstaff very nice and attentive. Manager even stopped by to chat for a bit. Nice selection of craft beers. Excellent appetizers and entrees. The bread pudding was the best that I have ever tasted. Overall a very nice experience.",
   "One of our favorite breakfast and brunch spots in the Capital region. The cocktails are always tasty as is the food. We have consumed many mimosas here with friends!  It's nice to see vegan options on the menu for vegetable inclined friends. The Smoky Scramble (smoked salmon and bacon!) is a personal favorite."
  ]
 },
 {
  "name": "Altu's Ethiopian Cuisine",
  "address": "1312 E Michigan Ave, East Lansing, MI 48823, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a5346c78-9331-11ea-aacd-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "unique",
   "eat",
   "delicious",
   "adventurous",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8785855892323615037",
  "source": "GoogleMaps",
  "reviews": [
   "Wow, this is super good food. I recommend going during lunch time for the lunch special because it’s the difference between spending 9 dollars on a meal versus spending 15 dollars on it. That beef stew is like oh yeah just right to me. Delicious as hell.",
   "I personally love Altu's. I used to get my lunch to go from here all the time when I worked on campus. I was in the area and some friends and I decided to come here for dinner. The food is flavorful. And I really appreciate the presentation they provide. It's a nice environment inside and the wait staff are always very polite. I ALWAYS get the spicy chicken breast stew, but this time I also got a half order of the spicy lentils, and they were great. I loved my whole meal!",
   "My first experience of Ethiopian cuisine was here, and it was a show-stopper!  I shared the vegetarian feast for 3 with friends, and it was a universal hit!  The staff was incredibly friendly and attentive, anticipated our needs, and brought us more bread when we needed it to finish our feast!  The restaurant has a unique and casual feel and smells heavenly.  If you don't want to eat traditionally with your hands, utensils can be requested easily and the staff is very accommodating.   I will definitely be returning to try some more of the menu!",
   "Have never tried Ethiopian food, but there's a first for everything! Well worth it if you're an adventurous eater, and even if you aren't. I always love a restaurant with a bigger vegetarian menu than not, and this place didn't disappoint. I highly recommend doing half rice and half bread, because the rice is delicious and gives you a bit more variety. We will be back!",
   "So I've been here for around 4-5 times and all of the times their service and quality has been consistent and awesome. If you like really spicy food, then this is the place for you. Their food is really delicious. I've tried almost all of their dishes and each one is full of flavours. One suggestion though : it'd be nice to have some kind of sauce/dressing with the sambusa.."
  ]
 },
 {
  "name": "Charlie Kang's Restaurant",
  "address": "109 E Grand River Ave, East Lansing, MI 48823, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a5a15f62-9331-11ea-a691-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6583086495956457087",
  "source": "GoogleMaps",
  "reviews": [
   "I have been a customer of Charlie Kang’s for over 12 years now and have always been a fan of their delicious food and great prices.\n\nA few days ago, I placed an order for pickup. I have been trying to support local businesses as much as I can during this difficult time. Earlier in the day I saw an article posted online featuring Charlie Kang’s and it inspired me to place an order there. I was incredibly excited to eat some delicious Chinese and Korean food.\n\nUnfortunately, I feel as though I set my hopes too high because I was really let down. I was very disappointed in the food :( (which was approximately $42 worth). The food quality was not at all what I remember it being; the chicken tasted like it was reheated/old and the chow mei fun did not taste fresh. I actually ended up throwing it away because it was that underwhelming.\n\nI hate writing this because I have always loved Charlie Kang’s; I also hate saying anything negative because I know restaurants are struggling at this time. But, this is just my honest review.\n\nI’m weary on trying them again because of this experience, but as I said, I’m a long-standing customer, so maybe it was just an off day for them.",
   "The food here is delicious and it came to the table fast. The service was fast too. I really enjoyed the food. I was skeptical of ordering spicy food but in the end I'm glad I ordered it. The best Mongolian chicken. The fresh spring rolls was something I've never had in my life. After eating those, I don't think I am going back to the fried spring rolls. Amazing dish.",
   "Great staff great price delicious food in good proportions!",
   "Everything they do is delicious, noodles, stir fries and soups. I've tried like five different dishes and always leave happy. The staff is awesome.",
   "Wonderful experience every time we dine-in or take-out. The owner is extremely nice and generous! Not to mention the food is fantastic! Best restaurant in East Lansing!"
  ]
 },
 {
  "name": "Huapei Restaurant",
  "address": "401 E Mt Hope Ave, Lansing, MI 48910, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a60837c6-9331-11ea-9c96-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5239565079832584457",
  "source": "GoogleMaps",
  "reviews": [
   "Very authentic Chinese food. They are open now after 2 months closing. Good food and reasonable price. My best is sweet and sour pork. 한국어 메뉴판도 있어요.",
   "The best East Asian fusion restaurant in town! The food is unbelievably amazing. We ordered several different Korean, Chinese, and Taiwanese dishes, and they all came in generous portions and all immediately satisfied our picky taste buds. Enjoying the very authentic taste, we felt as if we were magically transported back to Asia.",
   "Dear Lansing,\nWe have all been sleeping on Huapei Restaurant. This place looks ghetto as hell, sitting there on Mount Hope, but man is it FIRE. Great food and great customer service. This restaurant is also on Door Dash.",
   "Best kept secret! I had given up hope on finding good Chinese fare in the Lansing area, and was very impressed with Huapei. The service and food are just wonderful! We got our tea and rangoons pretty quickly, and the total wait for dinner was about 20-30 minutes. Not too long, and it's obvious that everything was freshly prepared. The sauces appear to be from scratch, and the chicken and shrimp had a light, crispy battered coating. The rice was perfect. The freshly sliced green onions on top of the dish were a nice touch. The portions are generous and prices pretty low, with most dinners at about $9 (and I took home left overs!). Our server was so sweet and attentive, and was able to recommend a dish to me when I asked questions. We can't wait to go back!!",
   "We are so grateful they are back open after having to take a break to care for a loved one."
  ]
 },
 {
  "name": "Capital City BBQ",
  "address": "1026 W Saginaw St, Lansing, MI 48915, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a65100dc-9331-11ea-b1b6-14b31f159f22.png",
  "tags": [
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7551471901803797429",
  "source": "GoogleMaps",
  "reviews": [
   "My son and I really enjoyed this restaurant. The pho was superb and my son's Cuban sandwich was yummy. The French fries were off the charts, fresh cut, and the array of various BBQ sauce made ketchup step aside. I can't wait to try the BBQ too. The service was perfect and the owner was there and delightful.",
   "Great food for a great price! We loved the Brisket Banh Mi and it was amazing! That was by far our favorite items we ordered. We ordered take out and it was ready quickly! We got some much food for a reasonable price  and it fed three people easily! We look forward to going back!",
   "Of the BBQ spots I've been in Lansing, Capital City BBQ has the best southern style sauce (The Dirty South).  I'll have to go again to get a good feel for this place.  My first try was decent.  The potato salad way too soupy though.",
   "This is a great combination of foods-BBQ and Vietnamese.  I had a rice bowl with brisket, fantastic.  I checked out the bathroom.  Very very clean.  I think that is a testimony of a clean kitchen and backroom.  We will come again.",
   "Incredible BBQ! Definitely one of my new favorite spots in the lansing area. Surprising variety in menu, with all the classic BBQ dishes plus specialty items like rib tips, smoked wings, even smoked salmon, plus an entire Vietnamese menu as well! And their Vietnamese stuff is no joke, it's delicious and made with obvious care. Egg and spring rolls in particular were delicious.\n\nHighly recommend any sandwich, highly recommend the baked beans, highly recommend the sauces, highly recommend the fries. You're going to want to come back to try other menu items\n\nIt's definitely not a looker from the outside, and parking isn't super easy, but don't let that stop you!"
  ]
 },
 {
  "name": "Acapulco Mexican Grill",
  "address": "300 N Clippert St suite.17, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a6aae0d0-9331-11ea-b0f2-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "unique",
   "food",
   "music",
   "drink",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16846493829582369829",
  "source": "GoogleMaps",
  "reviews": [
   "Great food but not always the fastest service.",
   "First visit of this unique Mexican restaurant and try their interesting dish Shark Tacos. It was delicious shark tacos, tastes like having fish tacos and I liked it. Playing Mexican music and kinda little loud for my opinion. They're fast serve food after placed order. I'm satisfied.",
   "Nice and clean dining area. Seated promptly. Waitress very cheerful and attentive. Large menu selection. Many drink options as well. All food was prepared well and delivered quickly. Food tasted fresh. Reasonably priced.",
   "I enjoyed my eating experience at Acapulco Mexican restaurant, I had the Enchilada Suizas it was very delicious, but somewhat salty for my taste, the restaurant is very busy in the evening hours, the service was great and the staff is very friendly and helpful. The restaurant was very clean and the crowd is young and trendy,  and diverse,  looking forward to returning soon. 👍",
   "Very good Mexican food. Dinner took a bit long considering the restaurant wasn't packed. Overall a good experience & we'll be back. Returned with my daughter a couple months later and the service was painfully slow.. Again it wasn't that busy. I revised my review to 3 stars."
  ]
 },
 {
  "name": "Olympic Broil",
  "address": "1320 N Grand River Ave, Lansing, MI 48906, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a70c890a-9331-11ea-a0e0-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=6594762501790169247",
  "source": "GoogleMaps",
  "reviews": [
   "Great local fast food joint. I always get a Humdinger Combo with a chocolate shake. It's a burger with a nice charbroiled flavor and loaded with everything I think a burger should have. The chicken tenders are also great and uniquely breaded or battered. I've never had tenders like theirs anywhere else.",
   "The best \"fast food\", if you can call it that, in town. Food is always delicious. Everything is made fresh when you order it and you can taste it. Their chicken strips are the best in town with no competition. You can sit inside or sit outside with a nice view of the river. I've even sat down and hung out with some ducks while eating my lunch. It's cool, I'm happy to share with them. I'll never stop coming here. If I could give more than 5 stars, I would.",
   "Delicious!  Best fried mushrooms and one of my favorite olive burgers.  Plenty of booth seating inside.",
   "Tuesday + warmer weather = Olympic Broil!  Usually.  However these are not normal times.  Go to Olympic Broil and help out Mike and Maria.  They've done SO MUCH for us geezers with classic cars over the years.  Time to return the favor.  Use their drive thru and don't forget to tip!!",
   "The best most fresh fried fish sandwich.  I'm going back today to get another one. I just can't resist"
  ]
 },
 {
  "name": "The People's Kitchen",
  "address": "2722 E Michigan Ave, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a7c1cfe4-9331-11ea-996c-14b31f159f22.png",
  "tags": [
   "eat",
   "drink",
   "food",
   "family",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5556381885289434213",
  "source": "GoogleMaps",
  "reviews": [
   "I eat here all the time and it’s great! Love all the plant based options because they really compete with the meat/dairy dishes on their own. The lemon pancakes for breakfast/brunch are to die for but the grits, and vegan chicken and waffles are also amazing. Dinner is great too though there are only a few options. Don’t worry, they’re all great, and there serve lots of small plates too. Really love this place! Also there’s generally a baked good in the morning and those are always good too.",
   "Very cool vibe, love the decorations. Drinks were great... Don't want to undervalue a good drink. Bloody Mary & mimosa were definitely quality. Even with that being said the food was  for sure the star of the show! Brunch people get in here if you haven't. Grilled cheese & tomato Bennie was amazing, so we're pancakes. No doubt this is a repeat, regularly!",
   "This place is a great find! I went here the other day with some family and was very impressed. I ordered the vegan chicken and waffles served with a  rhubarb compound butter and a slice of watermelon. \nThe waffle had a nice caramel flavor to it and was very light. And the vegan chicken kind of had a  falafel flavor to it, is the best way I can explain it.\nAnyways I haven’t really had much vegan food before and never at a restaurant and now I’ve become intrigued to try more things like this in the future. The only thing that would have made the dish more complete I think would for it to have some sort of a small apple slaw or salad on the side. That’s the only reason I’m not giving this place a 5 star review.\nI also had a bite of a beet sandwich and that was perfect. The vinaigrette that is used with it and how everything meshes with it was like a dance of love. Honestly the sandwich I would rate 5 stars but anyhow nevertheless this place is a must try.",
   "Hands down the food of The People's Kitchen is delicious. Everything that we ordered was super tasty and exceeded expectations. The pancakes were buttery soft and melted in every bite. The streak was freaking amazing and so was rest of the food. But you should note that the service is quite slow, but is friendly. We visited at noon on a hot day so even the space wasn't too comfortable for waiting for the food.",
   "INCREDIBLE brunch menu. Ordered four dishes and every single one blew us away. The restaurant was born from a food truck operation, and it shows because all the seasonal dishes have a satisfying and fresh spin on them, like the pork belly cheddar grits, or the to-die-for crunchy waffle. Service was phenomenal and the space is colorful with plenty of parking. As of time of writing, the place is pretty new, so check it out before it catches on and gets busy!"
  ]
 },
 {
  "name": "Jalapeños Mexican Restaurant",
  "address": "307 S Washington Square, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a8239f34-9331-11ea-a9e9-14b31f159f22.png",
  "tags": [
   "organized",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1749915552132594323",
  "source": "GoogleMaps",
  "reviews": [
   "I order no cheese on my burritos. They always put cheese on it. I’m lactose so I puke every time.  It’s like they don’t know how to fold a burrito without loading it up with cheese to make it sticky. They’re disorganized and the toppings are flung everywhere and cross contamination.  I can’t tell you how many times I ask for something not to be added and turns out it’s in my food.  I find floaties in my fountains. I’m pretty tired of this place. They need to be more organized, clean, and on top of things. I wouldn’t recommend this place if you want food made the way you ask for it and not to have cross contamination from other products they serve with their food.",
   "Nice and clean restaurant fast and friendly service, had the breakfast burrito , they are so good ! Parking downtown to the restaurant can be a hassle, so carry a couple of dollars in quarters to feed the parking meter, which is strictly enforced,  the  breakfast burrito are only available from 8-10:30 a.m. I certainly enjoy my eating experience at Jalapenos. 🙂👍🍽Just wish  the restaurant was not located downtown, because of the difficulty in navigating to it, as well as high parking rates and limited parking spaces.",
   "Best restaurant in downtown Lansing. The best deals/specials ever (Monday and Friday get 2 tacos, rice, beans and chips for $7). Delicious, great service, they even have ice cream in the summer!",
   "First time trying out the place, and I was impressed!  Had a shredded beef taco on flour tortilla with chips and salsa. It cost about $5. The flavor was amazing and I was full. I will be returning for lunch again in the future.",
   "Great food nice atmosphere "
  ]
 },
 {
  "name": "Red Haven Farm to Table Restaurant",
  "address": "4480 Hagadorn Rd #103, Okemos, MI 48864, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a88c7362-9331-11ea-9e8e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "tasting",
   "affordable",
   "delicious",
   "food",
   "creative",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=1807678585731081716",
  "source": "GoogleMaps",
  "reviews": [
   "Great evening at a local farm to table restaurant.  We ordered several dishes and shared. All very good. We ended the night with an adult Chocolate Milk.  Great finish.  I hope my son decides to go to Michigan State so we can go back!\n\nThe menu was easy to understand with several amazing choices.  \n\nI like the farm to table concept.  Each dish was original and fresh.  \n\nI though my ginger soup was the best I have ever had.  I got a bowl because I thought it would be good but they offer small shooter versions of you just want to try.",
   "This place's atmosphere was very airy and relaxing. The food was great, although the grind was too salty for my taste. The bisque was amazing. The shrimps (saute) were exceptional, and I'm picky with my seafood. We had an apple up-side-down cake for dessert and it was delicious, especially the icecream! The highlight, though, has got to be the homemade sugar that came with my coffee. \nI could feel the care and the hospitality from the chefs and servers, and that showed through the ingredients, the food, and the service. My husband and I definitely come back to support this business and try other dishes.",
   "I have eaten here for lunch, happy hour, and tasting dinners for special occasions. The rotating menu is seasonal and uses available produce from Michigan, and the dishes are well thought out. Lunch and happy hour are great for the price if you are concerned that Red Haven is not affordable. The dinner plates are surprisingly filling, so you definitely get your money's worth there too. Desserts are hit and miss, sometimes overly sweet and not complementary to the rest of the meal (but I recommend the pavlova when available). Cocktails have been hit and miss too; I wish they were on par with places like American Fifth. It can be loud and busy, so make a reservation and ask for the best times to be seated. Service is friendly and fast. One of the nicest restaurants in the East Lansing/Lansing/Okemos area, and absolutely worth a visit.",
   "Very interesting food combinations.  I recommend highly food was delicious and highly seasoned.   This is a dining experience not a quick serve restaurant.  Half off bottles of wine on Tuesday so make a reservation.",
   "We went to the New Year's Eve celebration at Red Haven and it was wonderful! The staff dressed up in 20s costume and did an excellent job. \n\nThe prix fixe menu was wonderful and having 6 plates of food inspired by the 20s, was a wonderful portrait of food flavors by a creative ched. It's always special, unusual and delicious, the pallette they use is completely unexpected -- flavor combinations you wouldn't typically expect. And the wine pairings also were perfect.\n\nSome people may think they won't be \"full,\" but I've never left hungry -- so don't let that stop you from visiting Red Haven. Their normal menu, you can pick as many small plates as you want to share with your table. Enjoy them and enjoy the company and have a good time."
  ]
 },
 {
  "name": "Boston's Restaurant & Sports Bar",
  "address": "3301 Centre Blvd, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a8e2f80a-9331-11ea-b581-14b31f159f22.png",
  "tags": [
   "organized",
   "food",
   "family",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17332148918406957724",
  "source": "GoogleMaps",
  "reviews": [
   "First time at Bostons and very pleased with everything.  Food was good, Service was very good, And the restaurant was very clean.  Space is organized and well lit.  Not a bad spot to watch sports by any stretch.  Will probably be back for a game.  All in all, everything was very good, keep up the good work.",
   "I have been to Bostons twice now and have enjoyed my experiences. It's a combination of a pub and a restaurant atmosphere. Great customer service, the hostess greets you with a smile and a upbeat \"hello\". The staff is very friendly and courteous. Food prices are reasonable and a whole lot of televisions. Try the pizza and the pull pork sandwiches, you'll love it. Take the family, go on a date; just an overall great place.",
   "A place that looked like it might have something decent to eat, but the host's station was a ghost town. I waited for over 3 minutes for someone to acknowledge me and at least say they'd be with me in just a moment alas no? The whole time I that I waited I observed the hostess, a ways off, with her back to the front door engaged in a conversation the whole time so I left for some place interested in my business.",
   "The food was great! I had a pulled pork burger with fries and the rest of my party had pizzas. The service was good as well. My only complaint is that they brought us pop but forgot to take the empty cups away. Still great food and service, will definitely come again",
   "Horrible!! Okay this was my 3rd time there... So we waited for about 5 min with no hostess so we wait then finally after 10 she comes didn't apologize just says\" oh\" 🤔.. Ok not busy at all so i was like ok.. So she sat us down gave us menus.. We sit there for another 15 min no one comes .. 👀 to give us drinks say hello I'm your waitress waiter.. So my daughter said you wanna go i said yep lets go.. Not going back!!! I'm kinda glad this happened so she could see for her self.. Just sad!!!👎"
  ]
 },
 {
  "name": "Gumps BBQ",
  "address": "1105 River St, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a93536f0-9331-11ea-96a7-14b31f159f22.png",
  "tags": [
   "delicious",
   "affordable",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=8276304452964255674",
  "source": "GoogleMaps",
  "reviews": [
   "A true and authentic BBQ joint! Gump's pulled pork breakfast tacos are a perfect balance.of smoked pork, potatoes, eggs and his signature sauces.\nEvery other item on the menu and his specials are better than any other BBQ place in the area, hands down!",
   "What a great experience! Gump's catered for our company and it was not only super delicious but the customer service was outstanding - they went above and beyond to make sure we had everything we needed. I would completely recommend. Plus, it was very affordable compared to other BBQ in Lansing. Thank you!",
   "Best breakfast  burrito in town, come early they run out fast, I had the beef brisket sandwich, it was delicious, they also serve BBQ ribs on Friday and Saturday which are quite popular, the place is quite small, great customer service and a friendly staff, but the sides and portion size are very small, but good, the MENU items are quite pricey , normally I get the breakfast burrito, which is the best value,but they ran out of them quickly so come early ,but eating experience was excellent and I will return soon!👍👍👍👍👍👍👍🙂🙂🙂🙂🙂🍽 Had the pork breakfast Burrito,on 10-9-19 it was delicious and filling! Highly recommend it. 🙂👍🙂🍽",
   "I enjoy this place because it's such a small business. I used to really enjoy the nachos but they moved more toward a liquid cheese that I dont love. The breakfast burritos are definitely worth stopping in for!",
   "Friendly local place, chill vibes, and legit BBQ! Bring everyone. 💜"
  ]
 },
 {
  "name": "Thai Village",
  "address": "400 S Washington Square, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a9894aa8-9331-11ea-804b-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14848562667464184649",
  "source": "GoogleMaps",
  "reviews": [
   "Came here on a night with my sister. Quiet cozy restaurant. Clean atmosphere. The service was quick and pleasant. The food was absolutely outstanding! Tofu Pad Pak that had so many flavors and the tofu was done perfectly. My one complaint would be that “hot” wasn’t all that hot but that’s my personal choice. If you’re in the Capitol Loop, go here. You won’t be disappointed.",
   "So for lunch I decided to try this restaurant, and it was the best decision I made all day. The service was A1, and the staff was well trained. Food was amazing, I ordered a Pad Thai Curry that was cooked to perfection. Definitely would come back soon !",
   "Best Thai in Lansing and Ingham County.  Casual restaurant, no frills.  As stated, it does get very busy and crowded during lunch time so we opt to go evenings and Saturdays.  Something for everyone on the menu, portions are huge too - we always leave with leftovers.",
   "The soup we had was delicious, it seats a decent number of people, prices were cheaper than expected, and the food was good with more volume than expected. It can seat a group up to 8 easily. I would recommend this place.",
   "This is my favorite place in all of Lansing! Great food with a casual atmosphere and friendly staff. I highly recommend Thai Village to anyone who loves Thai food!"
  ]
 },
 {
  "name": "Zoup!",
  "address": "214 S Washington Square, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a9df3328-9331-11ea-81d4-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "eat",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8265335030118307737",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic place to eat! Excellent service, let my family and I sample ALL the soups happily. Sandwiches are delicious too and the wonderful organic drinks. Very very pleased with the decision to eat here",
   "I love Zoup because of the variety of soups they offer and their service is always the best. They always have several vegetarian options. I love that their soup menu changes daily. The staff is always very friendly and cheerful. The food tastes great. A little pricey though. A bread bowl, drink and cookie was $12.50.",
   "Great food, but always wildly crowded during the lunch hour. They could probably have double the space and still be full. Would absolutely recommend, just prepare for little personal space during the lunch time rush.",
   "Staff was super friendly and explained their menu. Also gave me a sample to try! Definitely a positive first experience. will definitely be coming back!",
   "Soup was good, have to be honest. WAY!!! OVERPRICED FOR PORTIONS!!!! Welcome to low class Lansing Michigan!! Pay to park in a non existent shopping district...the only thing keeping this ghetto alive is the state office buildings nearby..this is the next Flint Michigan...how sad for the capital city of Michigan😞😞"
  ]
 },
 {
  "name": "Sultan's Express Lansing",
  "address": "305 S Washington Square, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/aa4a2a30-9331-11ea-bb94-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7901290739356048400",
  "source": "GoogleMaps",
  "reviews": [
   "Love the food. Owner and staff very helpful.",
   "I've had Middle Eastern food, but this place is awesome. The chicken wasn't dry and the hummus tasted amazing. I will be back.",
   "Love it here! One of my favorite places for Mediterranean in the area.chicken shawarma, shawarma sandwiches, fried eggplant, baklava and delicious smoothies ...yum!  Very popular with the lunch set downtown.",
   "This is my favorite restaurant in the City of Lansing! The food here is amazing. I’ve had Middle Eastern food from MANY different restaurants in MANY different states and by far this one is the best. The owner memorized his customer’s favorites. This place is EXTREMELY busy around lunch hours being that it is located downtown. They are EXTREMELY fast! It’s worth the wait!",
   "Fast and tasty lunch place. Nothing fancy, just good quick middle- east food. Falafel, eggplant, cauliflower, grape leaves make great vegan sandwiches. Hummus and lentil soup tasty too. Not a date-night destination, but a great spot for a filling vegan lunch."
  ]
 },
 {
  "name": "Tony M's Restaurant & Banquet Center",
  "address": "3420 S Creyts Rd, Lansing, MI 48917, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/aaa0fcfe-9331-11ea-8a24-14b31f159f22.png",
  "tags": [
   "drink",
   "walking",
   "family",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15273468002335003518",
  "source": "GoogleMaps",
  "reviews": [
   "Great wrap. Great service. \nAND for quick on and off the I-69 / I-96 meeting place this was a wonderful first visit. Also, we could hear each other chat, too. Thank you. We'll be back!",
   "We used to love this place, we went tonight after a few months and it was a joke. We ordered cheese bread and was told we had to pay an extra 75 cents if we want a cup of ranch and marina sauce. Ordered the burrito and was told it would be an extra 50 cents if I wanted sour cream. Then after paying we noticed there was a 3.5% charge to use our debt card. Crazy, we will not go back.",
   "We got a very nice bar-style pizza, nice yeast crust, good cheese and toppings,  nicely cooked to a just browned edge.  Nice friendly staff.",
   "My drink was good...but walking into a bar at 8:30 and seeing the chairs flipped over on most of the tables was a bit off-putting. \nI asked if they were closing and they said not till 10. It's Saturday night.? One of the waitresses said she thought they were closed at 9. It certainly isn't the place I remember from when I worked across the road.",
   "Absolutely hands down the best place to eat in Lansing.. excellent service very family friendly atmosphere. And the food is absolutely out of this world. If you're looking for a great dining experience then look no further because Tony M's is where you need to be!!!"
  ]
 },
 {
  "name": "Nola Bistro",
  "address": "603 N Waverly Rd, Lansing, MI 48917, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ab04a146-9331-11ea-80d5-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5660827857441006072",
  "source": "GoogleMaps",
  "reviews": [
   "Upon entering the restaurant was warmly greeted by two beautiful waitresses named Debbie and Ruby , they were so friendly , I felt welcome, I ordered the #2 marinated pork rice plate, it was very delicious, along with two shrimp spring rolls,  I left very satisfied, the restaurant was very clean,  definitely will be returning soon , hopefully to try the pho soups and the crepes. I highly recommend you to come try it. Definitely enjoyed my eating experience at NOLA Bistro.",
   "Worst first experience ever. There were bones in my chicken tacos, and 2 out of 3 had long black hair in them. I ended up going to McDonald's.",
   "Ordered Pho for take out during the \"Stay home, stay safe\". I was skeptical of buying pho from somewhere other than a Vietnamese restaurant. However, it was very delicious!! Five stars.",
   "Wow - really authentic Vietnamese food. The pho is to die for!!! Sorry, food so good... it's gone before I remember to take a pic.",
   "We went there because we know how.good their Pho and spring rolls are, and they exceeded our expectations.  Service was great and all around us was a very diverse clientele. All ages too."
  ]
 },
 {
  "name": "Bangkok House",
  "address": "420 E Saginaw St #112, Lansing, MI 48906, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ab59c624-9331-11ea-9e7a-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12188606483704172768",
  "source": "GoogleMaps",
  "reviews": [
   "Cute and delicious place for lunch. We've tried a variety of things but the best is the chicken satay appetizer. Brown it to your liking on your own mini grill with a peanut butter dip and cucumber sauce. Service and food is great. Would recommend.",
   "I give them a 5/5 for the quality and value of the food.  We've been to several Asian and Thai restaurants around and it's hard to find food that's actually spicy, Bankok house has been my favorite place for over 7 years! I usually get 2-3 meals from my entree, so it's a great value for me. The woman who answers the phone is awesome, she's just fast because they are so busy. If you want awesome Thai food, give them a try.",
   "I enjoy my eating experience,  the Pad Thai with shrimp combined with extra shrimp and vegetables,  was delicious and  more than enough to satisfy my hungry appetite. I also  had chicken fried rice , which I took home, couldn't finish eating it. The service was great along with a friendly and courteous staff. Looking forward to coming back soon. 😊👍👍👍",
   "This restaurant will surprise you. I tried it first in 2018 because I knew I liked Thai food and it is one of my favorites in Lansing. I haven't had a dish I didn't like. Also, the spice scale is normal, if you want medium, it's medium. If you want hot, it's hot. A must try if you like Thai food.",
   "Great food in the smells are wonderful. I really like their pad Thai. The service is very fast and sometimes you feel like you are in their way. Worth a try... And very authentic."
  ]
 },
 {
  "name": "SPUDS Restaurant and Greek Pastry Shop",
  "address": "611 S Waverly Rd, Lansing, MI 48917, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/abbe549e-9331-11ea-9efb-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2290338381414668113",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to take the family, relaxing and the food was hot and very plenty, Bella represented the family restaurant in a professional manner, she made my family feel welcomed. Thank you Bella!\nHighly recommend having a meal here.",
   "The atmosphere was really warm and cozy.  Customer service was great, the food was good...the pancakes and eggs were great...the vegetables in the omelette were raw that was a bummer.  All in all the I would come to this place again",
   "Last breakfast in Lansing before a move and this was a great, typical, ‘American’ diner. Had the vegetarian omelette with wheat toast and fries. Eggs in the omelette were nice and fluffy. Vegetables in the omelette tasted fresh and as someone who works in the food industry that is a tell-tale sign of quality and cleanliness. Staff was phenomenal and it was a very calm and enjoyable meal. Will be back next time I’m in Lansing!",
   "The food was good.  Clean restuarant.   The ladies in the market area were nice.  Unfortunately our waitress was kinda rude and short with us or I would have given 5 stars.  Can't wait to try the sweet treats we picked up for later.",
   "Great food,  I had ham,eggs, potatoes and toast, it was very delicious, the staff was very friendly and helpful and I enjoyed my eating experience at SPUDS."
  ]
 },
 {
  "name": "Zoobie's Old Town Tavern",
  "address": "1200 N Larch St, Lansing, MI 48906, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ac1bde2e-9331-11ea-b518-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food",
   "drink",
   "creative"
  ],
  "link": "https://maps.google.com/?cid=13716167546644393984",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place. Lively but not too loud, great drink selection, and the FOOD... the loaded fries are absolutely addictive and my favorite dinner is their fried goat cheese salad... YUM! Will make a return visit as soon as we're allowed to again.",
   "Food is great. Beer list needs work - unless you're into stouts and porters and other weirdly bitter concoctions. Even of their IPAs tasted off. I like IPAs but...",
   "Best bar/restaurant in Lansing! Get the corn fritter appetizer and pineapple prosciutto pizza and you won't be sorry. Great atmosphere and craft beer selection as well",
   "Love going here for the \"Trust Us\" options, they never let me down. Let them pick the toppings on your pizza and then let them pick your drink. Sure, y'all do all the work for us. Always good!",
   "This is technically a review for the cosmos but I ended up there on Tuesday night and sat on the zoobie's side. Went specifically for the pizza and was not disappointed! If you don't mind leaving insignificant things to chance order the trust us pizza like I did. They have some creative mules and a great beer list."
  ]
 },
 {
  "name": "For Crêpe Sake",
  "address": "221 S Washington Square, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ac6ac1ba-9331-11ea-b1ca-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7224114460456671385",
  "source": "GoogleMaps",
  "reviews": [
   "What a nice break from the ordinary! First time guest sees and appreciates Crepe Sake's efforts to bringing a new taste experience to Lansing. I had the raspberry and brie crepe and hot black coffee. ☕  It was great. They serve Zingerman's coffee blends right here in Lansing. Live a little and try something New!",
   "Friendly staff and super delicious food. We loved everything about it. It was cozy, had gluten free and vegan options that were wonderful. So glad we stopped.",
   "Delicious, really fast service, and plenty of options for any dietary restrictions (though they do charge extra for substitutions). Atmosphere was really nice for small groups. The girl taking my order was soft spoken but super nice and the other employees made sure to make us feel welcome there. Would come here again if I lived in michigan",
   "No place like it in Lansing. Huge variety of sweet and savory crepes. I recommend the banana crepe for breakfast.",
   "Cozy, fast and open on Sunday. So many places in Lansing are closed on Sundays; it was nice to find this casual little place."
  ]
 },
 {
  "name": "Chen's Restaurant",
  "address": "600 E Thomas St, Lansing, MI 48906, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/acc342a2-9331-11ea-b4ca-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10682565709938352275",
  "source": "GoogleMaps",
  "reviews": [
   "One of our favorites on the north side of Lansing. Place does not win any awards for decor, but always consistent presentation of food. Appetizer and food orders are made very quickly and always taste nice and fresh. Appears to be very popular for take-out.",
   "I had the orange beef. It was very good. I will go again soon for more. If you are tired of ordinary meals it is good. I find many places do not fry beef with batter, like in this dish.",
   "I order from there all the time and they are great. I have only been in there once and it was not to bad but this was a few years ago",
   "Fast & fresh!  Imo, it's hard to get fresh Chinese food in this area.  I've visited for years and never had a bad meal.  Great prices.  The go-to for me and my other Hawaiian \"ex-pats\".",
   "Huge and hot portions from friendly servers. Our go to Chinese restaurant when in the area. Crab ragoons, General Tso and Sweet & Sour Chicken are our favorites. Place is small and not anything fancy but food is fresh and fast!"
  ]
 },
 {
  "name": "Fleetwood Diner",
  "address": "2211 S Cedar St, Lansing, MI 48910, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ad2119e4-9331-11ea-bc25-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4390297586478468640",
  "source": "GoogleMaps",
  "reviews": [
   "My dad and I were out trying to diagnose a noise in my car and decided to stop in for coffee. The food around me looked so tempting that I tried to convince him to eat, but he already had breakfast. Once we're allowed to socialize and go out again, I'm immediately returning to this place. The staff was friendly and kept our coffee topped off. The hippie hash also looked delicious. The fact that it was steadily busy and was filled with all types of people is encouraging and speaks volumes about its food and value.",
   "Great feel... Felt like I was on a movie set. The classic look and atmosphere of the old classic diner was great. Our service was awesome. The food was amazing and price wasn't too bad. Only rating it a 3 because it's still a old diner but was a GREAT old diner. Definitely coming back.",
   "Service was quick. Food portions are huge. My eggs for Benedict were right on. Hollandaise was mildly creamy with bright citrus flavor. Multiple styles of hash available. My man was not impressed but he ate most of his meal. Tables are small, dinner style so don't let plates pile up. Things come on plates to be served but consolidate where you can. Hot Tea came with lemon and real honey with tea bag on the side. They way it should be.",
   "I've only ordered via Doordash. Really good food. Portions are amazing v cost. I've only tried their breakfast items and have never been disappointed. Food comes hot and fresh. Love their oatmeal. \nAll of my orders have been correct with condiments and eating utensils provided.\nLove this restaurant.",
   "This place has a fun nostalgic feel to it. I got an omelette with hashbrowns inside it. I can honestly say I've never had anything like that. It was great"
  ]
 },
 {
  "name": "Sultan's",
  "address": "4790 Hagadorn Rd, East Lansing, MI 48823, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ad799a6c-9331-11ea-a172-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=713180215586075600",
  "source": "GoogleMaps",
  "reviews": [
   "They have great Mediterranean food, but they don't have a liquor license. We didn't know that ahead of time, or we might have skipped going here for dinner and missed out on the excellent food. I had a falafel wrap that was delicious. I don't recall what my wife and out guest had, but they both enjoyed their meals too. We started with the combo appetizer I've posted a picture of. This is a family-run restaurant, which always gives a place a homey atmosphere.",
   "The food is very authentic food. Very good. The staff was very prompt and polite. Excellent Hummus. Great job",
   "The taste is incredible. There are some really good combos if you're looking to share a platter and save some money. I ordered the Sultan's Combo and it had a little bit of everything. It was soooo good!",
   "Love the food but, honestly, I was pretty disappointed by the service. Ordered takeout, they said it would be 10-15 minutes. Sat down for 20 minutes. When I went up the counter, the guy started to put it together in front of me. He had to ask me again what I wanted and kept getting it wrong, like it wasn’t written down anywhere the first time. A quick In and out ended up taking longer than I thought.",
   "A wonderful place that has been around supporting the local community for quite some time. Veg and non veg options. The veggie lunch combo was splendid. Arabic coffee - some of the best I have had in a long time. Great prices."
  ]
 },
 {
  "name": "Detroit Frankie's Wood Fired Brick Oven",
  "address": "921 N Washington Ave, Lansing, MI 48906, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ade1f992-9331-11ea-9fc3-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "delicious",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=653774005254696697",
  "source": "GoogleMaps",
  "reviews": [
   "Great pizza! Love the Wood-Fired char!  Great service, very friendly and knowledgeable! Sausage imported from Chicago is absolutely delicious! I would go here just for the pizza. 😁",
   "Best wood fire pizza around! Available at a few locations check their website to keep current. We love visiting them at Ellison. The pizza is delicious and you can get a specialty or order whatever you like. If they are busy it could be up to an hour, remember there is only one wood fire; but in the end it’s completely worth it. So have a drink relax and play some cards with friends while u wait for that delicious pizza.",
   "So happy Detroit Frankie's is back! Great pizza when he was at Ellison's. Bummed when he left, but happy now that it's a shorter drive. Still same great quality!",
   "Hands down the best pizza you can buy! Make sure you say hi to the owner and staff. Absolutely great people. There's a reason why they have a cult like following. Buy this pizza!",
   "Great pizza! Very nice group of workers! We will definitely be recommending!"
  ]
 },
 {
  "name": "Flap Jack Shack",
  "address": "3000 E Grand River Ave, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ae3570c6-9331-11ea-9a91-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12353641070985235729",
  "source": "GoogleMaps",
  "reviews": [
   "Great prices, tasty food, friendly staff, fast service, broad menu options and helpful recommendations from the staff! All around great experience here. Check out the Alaskan sourdough, its from.1975 and very tasty, but so were the pumpkin pancakes!",
   "I had a great brunch with the family. The food was great, thanks to the Chef. However let me just say the service obviously varies by Server. We were sat down by our host who was very polite, our server took a while getting things like a menu, coffee and creamer, and then none of the food came out at the same time and the restaurant was not even that busy. Although I didnt let this bother me, it did upset my family. Would try again, but maybe find a better server next time.",
   "Very busy on the weekends, so pack your patience. Very good over all. With the amount of people waiting and customers to be served, some of the people were a little verbal about waiting so long to place order, get served etc. Again, busy place like this means it's good food. Be patient, they do the best they can 🙂",
   "My husband love the strawberry pancakes. I really like the fat Greek spinach omelette. The service was awesome they left the coffee pot with you. They were very responsive to your needs they asked if you wanted do you want it condiments.",
   "Haven't been there in years, but today (during after church rush even)our order came in record time.  Our server was phenomenal and the food was delicious!  My son and I had the Energy Breakfast, I'd highly recommend it.  Egg whites, chicken breast, tomato slices and cottage cheese.  I'm not a huge egg person, or breakfast food in general, so this was a great alternative for me!"
  ]
 },
 {
  "name": "Midtown Brewing Co.",
  "address": "402 S Washington Square, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/aee623ae-9331-11ea-8b13-14b31f159f22.png",
  "tags": [
   "walk",
   "eat",
   "delicious",
   "food",
   "food",
   "brewery"
  ],
  "link": "https://maps.google.com/?cid=9805195417720659061",
  "source": "GoogleMaps",
  "reviews": [
   "Went for lunch because I was hard craving a burger and the pics online looked good. Should have taken the time to read reviews. For downtown Lansing at noon-thirty it should have been busy. Half full. Well. Cool, I don't gotta wait. Seat myself and had a very nice server. Get the burger (well done cuz, duh, burger) and tots. Not a bad wait. Good looking burger. Nice presentation. Tots were yummy. Fresh, appropriately seasoned. Okay. I bite the burger. Eh. Just, eh. It's a thick little hunk of dry, unseasoned beef. Not bad. Not great. And dry because thoroughly cooking a thick patty dries it out. That's kind of burger 101. The bun was just barely toasted and an icky, plain one but needed more to handle the insides. The place also had a grungy feel, and not in a cool way. So, they need to get some meatier buns, toast them, discover seasonings and flatten that patty out a smidge more. Then clean that place senseless and I'd consider a re-visit. Until then, I'll walk the extra quarter mile to Wendy's.",
   "An amazing place to have burgers and beers. Their beer list is amazing. Their burgers are amazing. Perfectly cooled and juicy. I had their olive burger. I was skeptical at first as I do not like olives, but just after my first bite, i fell in love with that burger. Their club fries is definitely something to have. I had heard that you can't stop eating those fries, and now I can second that statement.",
   "Found this place when looking for somewhere to eat downtown. Casual and cozy. Waitstaff very friendly. Great selection of craft beers, including their own brews. Appetizers and entrees were really good. Falafel bites with dip and southwest burger were exceptional. We lucked out and got to catch stand-up comedy as well.",
   "Went for lunch and then back the next day for brunch.  Food both times was great!  We had the burger a(perfectly cooked medium), Philly dip and for brunch we tried the breakfast tacos and the Fat Elvis French toast. Everything was delicious. Notably, sweet potato fries were the best I've had. Really enjoyed the breakfast tacos. These people know how to treat potatoes. The flavors were right on. We also had the Concord cider and a couple of the beers. Really good! Tried the Mimosa and bloody Mary. Would've liked the Mimosa grapefruit to be made with fresh squeezed.  Follow me on Instagram withlovefrommiche for more on Michigan eats and brews.",
   "Our new favorite brewery!! So many fantastic beers. The food was the best we’ve had at any brewery in town. The staff is outstanding too!!"
  ]
 },
 {
  "name": "AnQi Sushi Express",
  "address": "111 E Allegan St #1801, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/af411526-9331-11ea-8589-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "affordable",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=1678971495378993932",
  "source": "GoogleMaps",
  "reviews": [
   "Food came in prepackaged boxes, which was fine. The store seemed more like a hole in the wall type, which was fine. Sushi selection was limited but taste was good & the price was affordable which was fine. However, the noodles were bad enough that I doubt I'd consider coming back here, I've had instant noodles that were more delicious than the ones I had here.",
   "This place was absolutely wonderful. It was only my 2nd experience with sushi and the staff was patient and eager to answer my questions as to what was what. Very friendly. The flavors were great. I also tried the mango bubble Milkshake. It was very sweet, and not really what I expected, but still happy to have experienced it. I will definitely return to this place next time I am in Lansing!",
   "Great for quick lunch sushi. They have a stamp card loyalty program.",
   "Friendly staff. Very good dumplings, fresh made ready to grab sushi, some interesting creations as well. But those noodles....oh those noodles. So good! Today I had Inferno noodles after waking up with a slight hangover, scared the evil right out 😁 Thank you!",
   "Lovely establishment, simple yet effective menu. Daily specials and affordable prices. Portion sizes are large and the people are very kind."
  ]
 },
 {
  "name": "Korea House Restaurant",
  "address": "978 Trowbridge Rd, East Lansing, MI 48823, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/afa46b22-9331-11ea-bef0-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13776984350516787573",
  "source": "GoogleMaps",
  "reviews": [
   "This was the best Korean food I have found in East Lansing. It was visually appealing, had beautiful aromatics, and tasted amazing. If I could give it more than 5 stars I would! That plus an extremely nice wait staff made for an experience I can’t wait to have again.",
   "Delicious authentic Korean cuisine as always! Worth the 2 hour drive everytime! Nice atmosphere.  Clean.  Warm and personable staff.... legit best place in Michigan for Korean cravings.",
   "I love the menus. My friends and i decided to make this place as our post-exam celebration kind of self reward. Their small portion is big enough for 2-3 people! Need to come with very empty stomach!!\n\nThey might have grumpy old ladies as the waitresses, but who cares. I just want their foods.",
   "It was ok, underwhelming. Seemed busy though. Some of the food was good like the dumplings. Main course was so so.",
   "Out of all the Korean restaurants I've been to in East Lansing and Grand Rapids, this one is the most consistent in quality throughout the years. The taste is always authentic and the restaurant is also very clean. The waitresses are very friendly and give decent recommendations but my favorite part about the place is the diversity of the menu."
  ]
 },
 {
  "name": "Falsetta's Casa Nova",
  "address": "138 S Waverly Rd, Lansing, MI 48917, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/afe6f298-9331-11ea-904a-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "family",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=11040742706737659190",
  "source": "GoogleMaps",
  "reviews": [
   "My wife and I recently tried this place for the first time during a fun date night. We loved this place. The food was delicious! But even more importantly, the service was outstanding! We had a new employee training during our visit, but if her trainer hadnt mentioned that she was new, you never would have known. All around one of the best dining experiences in Lansing!",
   "Great service huge portions of good food. What's not to like?",
   "It has been around a while, and could use some updates. BUT, me and a whole prior generation of my family have been coming here for quite some, and the best thing I think I can say to recommend eating here is, I've never had a bad meal here. It is, at worst, a somewhat boring venue with reliable food and staff. Onion rings and the pizza (get that special!) are some of the best in the area.",
   "Delicious pizza and breadsticks with mozzarella cheese n meatsauce dipping.",
   "I have been going to this restaurant for years, it is a staple establishment of Lansing Mi and everyone should go there at least once. I love the spinach manicotti, buffalo chicken tenders and the loaded potato soup. They are not afraid to try new things and have had different deals and items on their menu over the years."
  ]
 },
 {
  "name": "Claddagh Irish Pub",
  "address": "2900 Centre Blvd, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b0384746-9331-11ea-bd28-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11375767507319310298",
  "source": "GoogleMaps",
  "reviews": [
   "I was looking so forward to some of our friends for an Irish dinner.  We arrived at 4:30 my husband and I had a drink while waiting for our friends to arrive they got there about 10 minutes later.  They order drinks and we ordered appetizers for the table.  We waited for several minutes for our food to arrive.  We the. Placed our dinner orders which also took several minutes.  By then, we ordered another round of drinks.  The food was delicious, but as we were finishing up, our waitress came to tell us in the next 20 minutes a table of 6 was going to need our table.  We weren’t even done with our drinks yet.  About 10 minutes later she told us not to worry they found another table.  About 10 minutes later the manager arrives at our table and asked us how the food was, we said it was great.  Then he folded his hands and my husband asked him: You want us to leave?  He said yes not to be mean but yes we need the table.  Seriously?  We just spent a lot of money on drinks, appetizers, and dinners for 4 and we were never asked if we wanted dessert, coffee or more drinks.  Just we need the table.  I’m insulted, as were our friends.  We eat out a lot and I’ve never been asked to leave a restaurant.  We recently returned from a trip to Ireland where some of the friendliest people I’ve ever met welcomed us as strangers to their country.  They never asked us to leave and instead encouraged us to stay longer.  Very disappointed with your hospitality!   Our total time there was 1.5 hours.  Not excessive by any means.",
   "Fantastic food at a great price. Had the fish and chips and a Guinness for dinner. Excellent meal in a cool Irish pub environment.",
   "Fast and friendly staff. I tried the Ginger Bush cocktail, if you like whiskey and Moscow mules then this is a fun twist on that. Super refreshing. I also had the pan seared trout, very good! Would definitely have it again 👍",
   "Claddagh has a great combination of Irish fare and typical pub food. Their staff are always friendly and the food is always good. You'll see a great mix between young and old there on any given night, so it's a great place for everyone.",
   "We just got done eating here for the first time and it was for our 2 year anniversary. We wanted to try some place we both haven’t been. We were both disappointed and won’t be coming back. \nThe bartender was our waitress and didn’t write down our build your own burger order. Both of our burgers came to us wrong. My boyfriend was ok with his but he sent my burger back for me since it was missing the fried egg and onion straws. When my new burger was delivered, it had the correct toppings however it was under cooked. I always order my burgers well done. Obviously the bartender needs to write down orders so she can put them in to the computer correctly. What a waste of money..."
  ]
 },
 {
  "name": "Fazoli's",
  "address": "5705 S Cedar St, Lansing, MI 48911, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b08c4974-9331-11ea-ad0c-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "free",
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=1109572777583036705",
  "source": "GoogleMaps",
  "reviews": [
   "It's the McDonald's of Italian food. I tried the ultimate sampler. Nothing was bad, but nothing was great. The price however was really good. I'd probably go back there for lunch, and maybe occasionally dinner if I just want something quick and cheap. It's a really good value for the price, but if you want really good Italian food, I'd look elsewhere.",
   "I gave them only 3 stars because I was not greeted, even though there were 3 workers in my vicinity. The food was delicious. I had a very customized order and the got it right! Kudos to them for that. When it was time to take care of my dishes, the waste hole was blocked by cleaning buckets and supplies, so I had to just leave them above the dish bin (which was full). \nThe restaurant was clean and my dinner was delicious!!",
   "Fazoli's is one of my favorite fast food restaurants.  It is great to get a delicious Italian meal so quickly.  The first Fazoli's that  I went to was in Appleton, WI many years ago.  Then after that I was mainly going to the one in Lansing,  MI as we don't have one near where I live.  Now, as I travel I have been seeking them out.  The spaghetti and sauce are my favorite, and the bread sticks are unlimited and they are also delicious.  I recently tried the pizza and that was very good also.",
   "Eating allergy free and VEGAN at this Fazolis was made simple and easy! Thank you for being so accommodating! We ordered this spicy penne pasta dish adjusted to meet our dietary requirements.\n\"Staff were very helpful and focused on getting it right the first time.👍\"",
   "If you're looking for a cheap, quick option for a great pasta night, Fazoli's is the place. They have spaghetti to bacon Mac and cheese. Don't forget the breadsticks, those are to die for. Most items on the menu, are unlimited. 10/10!"
  ]
 },
 {
  "name": "El Azteco",
  "address": "1016 W Saginaw St, Lansing, MI 48915, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b0dc3e62-9331-11ea-9d5b-14b31f159f22.png",
  "tags": [
   "family",
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "free",
   "kids",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=18247024459451595878",
  "source": "GoogleMaps",
  "reviews": [
   "Anyone that has ever come here knows that their menu is awesome with lots of choices but their tortilla chips, salsa and cheese dip is incredible and a must have!  A great place to enjoy with family and friends!!",
   "Delicious traditional Mexican food at great prices with friendly service. Chips and salsa are both homemade and excellent. I’ve been visiting El Az since the late 1980s and choose this location over the EL location any day. Awesome new patio addition!",
   "Amazing food . Generous portions . Great service. Salsa was the bomb. El Porto in owosso ahould take cooking leason from them. Real mexican food",
   "It was crazy busy when we went due to Christmas rush and being down a server. Even so, our food came quickly after being ordered.  It was hot and delicious as always.   I was pleasantly surprised to find that on Monday kids 12 and under eat free.  We had to ask for chips to go with our cheese dip and hunt down someone to get our check but everyone was helpful and very apologetic.  They work very well as a team and made a genuine effort to make it work.",
   "I have been going there since I can remember as a kid. LOVE their burrito plates, my favorite platter! The spicy burrito needs to be spicier though. Went there right after I graduated from Michigan State and it was awesome!"
  ]
 },
 {
  "name": "AI Fusion Sushi & Grill",
  "address": "2827 E Grand River Ave, East Lansing, MI 48823, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b1209a9e-9331-11ea-b635-14b31f159f22.png",
  "tags": [
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=12141843580277618389",
  "source": "GoogleMaps",
  "reviews": [
   "Enjoyed the Shrimp Tempura Appetizer was Amazing & such a Beautiful Presentation as well! We enjoyed our Uni Soups - Shrimp Tempura & the Chicken one & the were {{{Scrumptious}}}",
   "The location is a bit hidden, you’ll have to drive into the back of the parking lot to get to it. The service was good, he waiters are nice. My only complaint is the quality of the sashimi. It’s not the best, I believe it is frozen which is fine but the price doesn’t reflect that. The soft shell crab was very good though. I would order that again.",
   "What a great experience. We felt the staff really took care in how to ensure the safety of staff and customers during this time. We have always enjoyed Ai’s sushi, but their commitment to sanitization and cleanliness was truly impressive and the sushi was delicious. I would definitely recommend ordering from Ai Fusion any time, but especially if you are looking for a place to support during these hard times.",
   "This place is a little hidden to get to. Amazing service and ambience. Their sushi is really good and I'd come back again for their sushi. I had their fusion roll and the AI roll and both of them were really good. For the appetizer i tried their gyoza which was okay. It didn't really taste like a gyoza.",
   "Excellent sushi, really good service! All around great place to dine at a really good price. You'll never go away hungry & usually have take home. A must try"
  ]
 },
 {
  "name": "La Cocina Cubana LLC",
  "address": "123 S Washington Square, Lansing, MI 48933, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b1685234-9331-11ea-87c6-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "foodie",
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=9870210355149420891",
  "source": "GoogleMaps",
  "reviews": [
   "Nice little cozy eating spot in downtown Lansing. The food is flavorful and delicious. Portions are nice size. Fast friendly service. Busy during our lunch visit but everything was handled well. We will come back again.",
   "We were very pleased with our meal + are eager to try more dishes.\n\nTraditional Cuban Sandwich was very good, especially paired with a side of Fried Yuca + garlicky Ketchup Mayo dipping sauce, which were my favorites! \n\nChurrasco de Pollo, Rice + Beans + Maduros (instead of Tostones that come with the platter). The chicken was tender + flavorful! The maduros were riper + softer than I prefer, but I do love the pairing of sweet plantanos with savory chicken, rice + beans. \n\n(FYI: As a foodie of Caribbean descent, I cheered when I plucked a piece of bay leaf from my rice — it's like finding a prize in a cereal box + further proof that this is made-from-scratch the way I cook mine at home!)\n\nThe fresh Pineapple Juice was delicious + not too sweet. \n\nCafe Con Leche was tasty, but I do like my espresso to be a bit stronger.",
   "Muy rico! My mother-in-law is Cuban and La Cocina Cubana is the closest thing I can get to her authentic Cuban cooking. The dishes here are truly Cuban and food is extremely delicious. Try the ropa vieja or the vaca frita, two is my favorite Cuban dishes and La Cocina Cubana makes them perfectly!",
   "Server was very nice,  friendly and food was delicious.",
   "Delicious coffee! My boyfriend and I stopped in here after a tour of the Capitol because all the Biggbys and other coffee places around were closed. It was so good! Went down extremely smoothly with a nice crema and it was very strong, just the way I like it. A perfect pick-me-up! Definitely will be back next time we're in Lansing."
  ]
 },
 {
  "name": "Cask & Company Kitchen & Bar",
  "address": "3415 E Saginaw St, Lansing, MI 48912, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b1d62fb4-9331-11ea-beaa-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8024639685455398219",
  "source": "GoogleMaps",
  "reviews": [
   "I have been all over the country for more years than I will express now. However... I will say I have been to over 10,000 restaurants. Some were great, some not so much. But. This resurrection of an amazing experience at a restaurant deserves nothing short of 5 stars. Wait staff was incredible. The ingredients of the food.... Out of this world. It was a family friendly environment. I am so happy to say that me and my family will always return. Thank You! Great Work!",
   "Overall great experience. Interesting menu but they make it work to be honest. Want pho they have it, want sushi they have it, want mac and cheese they have it, want burger or wings they have it. The crab rangoon was good - light and fluffy. My wife had their classic burger and it was on point. I had the high end mac and cheese and it was good but I think for $17 it wasn't great. It would be nice to have a $12-13 option without the brisket (but the brisket was good). The chocolate cake was a little underwhelming, which was surprising because they mentioned they get it from Cheesecake Factory. Great beer and wine selection well done. The atmosphere was good, but it felt awkward to have so many TVs on the walls, it's upscale dinning with buffalo wild wings TVs on the walls? It's even more perplexing because there is a bar right next door which I believe are owned by the same people. But that's a nitpick I suppose. I would recommend and will definitely be back.",
   "Lunch buffet is great. The place is clean and stylish. Wait staff is friendly and prompt. I went here once and loved it so much that I went back 2 more times. The sriracha chicken is to die for. The selection is smaller than other buffets, but the quality is pretty high. There are 6-7 dishes plus various sushi rolls and things. Will be a regular, and I don't even like to eat lunch!",
   "Went for Valentine's day and was pleasantly  surprised. The food was great.We ordered the special Bree cheese appetizer which was amazing. We also ordered the maukau sushi roll which had a bit of spicy to it but lots of good flavors. The prices where a bit high but not outrageous. They had a large selection of drinks to choose from. The service was great. I definitely will go back to  try out more of the menu.",
   "We went for Valentine's dinner and I am very happy with the experience.  The food was 10/10. It has a great ambiance, the server was very pleasant.  I would be excited to go again"
  ]
 }
]