[
 {
  "name": "Sunken Gardens",
  "address": "S 27th St & Capitol Pkwy, Lincoln, NE 68502, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b244f728-9331-11ea-9eef-14b31f159f22.png",
  "tags": [
   "unique",
   "free",
   "family",
   "free",
   "free"
  ],
  "link": "https://maps.google.com/?cid=16846287004242914727",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful evening with my girlfriend for her birthday. Even with the recent frost killing off lots of plant life if you haven't seen it it's still a very unique escape from the urban jungle of city life. I'll post another review this summer with pictures when they start fresh plants.\n\nDefinitely worth seeing.",
   "We stopped here on the way to Colorado. It was beautiful! Loved the variety of plants. It being free was a huge bonus too. If it wasn't raining we probably could have spent a few hours at the gardens.",
   "Free admission. Always beautiful in the summer. So many different varieties of butterflies and dragonflies. We love going and looking at all the variety of flowers. Great place for family pictures, weddings, senior photos. If you go on the weekend, don't be surprised if you run into a wedding party. Definitely my favorite garden in Lincoln.",
   "Take a nice stroll around the garden and enjoy yourself, then head over to the rose garden across the street. Very pretty and the variety of roses is amazing.",
   "What an amazing public park! This is an expansive public space with lush gardens, statuary and water features. I can’t believe it’s free to get in. Parking is very limited so you may have to do off street parking. Continue across the street to stroll through the rose garden and see the fountain. The day I was there a vendor was open selling drinks and snacks."
  ]
 },
 {
  "name": "Pioneers Park Nature Center",
  "address": "3201 S Coddington Ave, Lincoln, NE 68522, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b28ef8b0-9331-11ea-9083-14b31f159f22.png",
  "tags": [
   "parks",
   "nature",
   "walk",
   "history",
   "walk",
   "family",
   "pets",
   "nature",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=489153674615407994",
  "source": "GoogleMaps",
  "reviews": [
   "Really well maintained trails. Great for families. Paved and gravel trails. Nature center. Going to see the bison is so cool. There has been times where people's cars have been broken into, so lock your cars and don't bring valuables. I've never run into this problem, but it has happened to people I know. This is one of my favorite parks in Lincoln",
   "Beautiful park! It had roads for easy driving access and paved paths we could walk on. We came to see the pillars that have some cool history. It has a plaque telling you about them and how they were originally in DC.",
   "Pioneers park is lovely this time of year (snow) well all the time really.  It's good for hiking, biking and wildlife watching. There is a nice play ground right by the picnic area, oh and the picnic area has grills and is large enough to accommodate large groups of folks without being bunched together like sardines.  This has been a favorite backdrop for photo shoots of all kinds... engagement, wedding and senior high portraits.",
   "It's not that far from my residence but I don't get to go there nearly enough in the colder than I can handle weather. This is my favorite park in Lincoln and as long as I've lived here I am ashamed to admit that I have not seen half of the place. I hope to remedy this starting as soon as I can get there on foot and stay for hours and discover the trails I've heard so many good things about but have yet to experience them myself. As for the new residents of Lincoln and surrounding areas make it a point to see the beautiful plants and ponds and the kids will love to visit the nature center and walk through the where the buffalo and the other large animals have a great habitat, very natural not like a zoo or anything. I plan on going tomorrow actually and I am going to try to get pictures of everything and then some. There's also an outdoor amphitheatre in the park and the shows are going on almost every weekend during the summer! Pioneers Park is a must visit with yourself and your pets or the whole family including the pets of course! Please don't forget the outdoor rule \"You pack it in, you have to pack it out\" there are trash bins everywhere if you are looking for one.",
   "Beautiful and big park in Lincoln! Excellent place for walks (there are some trail options), taking photos and spending time with family and friends. Definitely worth your time!"
  ]
 },
 {
  "name": "University of Nebraska State Museum - Morrill Hall",
  "address": "Morrill Hall, 645 N 14th St, Lincoln, NE 68588, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b2d7739c-9331-11ea-86b1-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "family",
   "history",
   "kids",
   "family",
   "history",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1160033830365400004",
  "source": "GoogleMaps",
  "reviews": [
   "We have come here a couple times with the family it has always been very enjoyable and educational. My kids love seeing the huge mammoths. My oldest son who loves animals loved seeing all the different kinds they had around the whole museum.  My dad and my son enjoyed looking at the varies rocks displayed on the second floor. There are so many different types of rocks to look at and a hands on science exhibit. The new exhibit on the third floor is really awesome as well. The kids got to do some hands on learning which was pretty great. Overall would highly recommend. The only downside might be parking but there is a parking garage close by and we just had to take a short walk to the museum.",
   "The museum isn't open for many hours, but it was VERY enjoyable! They had many different topics, from the Nebraska plains to ancient fossils. They had many different interactive exhibits as well, so I 100% recommend this place for small children. I also went to the planetarium, and while it was enjoyable, I think it is more suited for young children. They have a very extensive collection, and the amount of information in there is extensive and thorough. Another really cool thing in there was the lab where they were opening casts of fossils on display. The entire facility was very clean, and the bathrooms looked a little old, but also clean. The bathrooms were a little weird to find, but not bad. Overall, I highly recommend this place if you are a fan of history and science for sure.",
   "A neat museum and neat place to spend the afternoon. Lots to look at and explore. Some of the exhibits are very dated and could use some updates. \nEdit: I did visit the new fourth floor and it was great. Updates I would like to see would be better lighting. Many of the older exhibits are covered in shadow or very yellow light that makes it feel older and harder to see the exhibit.",
   "What a great learning museum for the whole family! 4 floors of science and history of Nebraska and fossils galore! It's not pricey to get in and you and your kids will love it!",
   "Lots of great learning experiences for kids and adults. Staff is friendly and helpful don't forget to ask for military discount if you are current or veteran for admission."
  ]
 },
 {
  "name": "Museum of American Speed",
  "address": "599 Oakcreek Dr, Lincoln, NE 68528, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b31d5658-9331-11ea-bf01-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "history",
   "unique",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17323169833802242467",
  "source": "GoogleMaps",
  "reviews": [
   "These two Gentlemen gave us very nice tour. Only there for a few hours and it wasn't enough time. Racing history ,rare and important vehicles and auto related collections are packed into this large museum. The most amazing thing to me were the examples of ingenuity in vehicle and engine designs. If you like cars,racing, history or engineering go!",
   "One of the best automotive museums I've been. Worth a couple of visits to study all the exhibit history or facts. 3 floor of memory, innovation and awesome collections of racing, hobby and American automotive lifestyle.",
   "An absolutely stunning collection! Three floors of absolute heaven if you are a gear-head. Hundreds of cars, engines, pedal cars, toys, and other speed-related stuff. I spent three hours in there and I still didn't see it all. It's the kind of place where every time you visit, you will see something you hadn't seen before. Not only is there a lot of stuff to look at, but they constantly move things in and out to keep it fresh. Clean, well-maintained, excellent signage, and spot-on presentation of the collection. Not too many car museums are better than this one. A must visit spot for anyone into the subject!",
   "Which words describes this place the best? Amazing? Fascinating? Awesome? Incredible? Magnificent? Mindblowing? Unique? Great? Cool? Well take all of these words and you have only 1% of what you will see!!! This museum rocks! It has so many cars, engines, models, part, toys ... you can spend here days (!!) not hours. There is so much to read, admire and discover that time flies by. There are three floors with tons of models in extraordinary shape. If you have fuel running through your veins you will cry when you see this place. I guess that it is one of the biggest car collections in the US. So many beautiful cars - simple incredible. The staff is very nice and friendly too, but be aware: They have much to tell. So if you ask a simple question you get the history of the car - which is simply fantastic! Great job by all the people working there. Thank you for the incredible day. Highly recommended!!!",
   "This is an incredible collection. If you are a car buff this is a must visit."
  ]
 },
 {
  "name": "Holmes Lake Park",
  "address": "70th & Normal, S 70th St, Lincoln, NE 68506, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b36f477a-9331-11ea-969c-14b31f159f22.png",
  "tags": [
   "family",
   "walk",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9620819299563655026",
  "source": "GoogleMaps",
  "reviews": [
   "Very beautiful scenery. A place to relax and enjoy the sunshine and spend time with your family and friends. You can even swim and play with your dog at Holmes Lake Park. Great place to be for good times.",
   "Whoever it was who set aside these lands for a park was a genius! Our family continues to love being at this park. The views of the lake are very stunning and it's just right there in the middle of town! The addition of gravel walking/running paths a few years ago made the park even more enjoyable and you can run/ bike there from many of the excellent bike paths. Walk around the lake on a maintained path, enjoy the children's park, watch a softball game or go fishing. Much to do and enjoy. You can watch the waterfowl and may even catch a glimpse of a fox.",
   "This holds many memories for our family lots of laughs and smiles where I trained for my first marathon",
   "This is a beautiful staple of Lincoln for all to enjoy.  Opportunities to bird watch, take an enjoyable stroll, or bike around the lake.",
   "If you're looking for a nice place for an evening stroll or to take in the sunset, this is one of the best in Lincoln. It's a flood prevention lake built by the Army Corps of Engineers surrounded by a city park. There's a walking/biking loop, playgrounds, fishing and boating, baseball fields, sand volleyball, a small observatory, picnic shelters and plenty of ducks and geese to watch. Swimming is not allowed except during special events. If you're looking for a place to camp or do more aquatic activities, check out Branched Oak Lake instead. But if you're just looking for a place to exercise, relax, or just get away from life, Holmes Lake is a great choice."
  ]
 },
 {
  "name": "Sheldon Museum of Art",
  "address": "12th and R streets on the campus of the University of, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b3e38d1c-9331-11ea-b17a-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "walk",
   "family",
   "art"
  ],
  "link": "https://maps.google.com/?cid=7111942626936312119",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent Museum. Well curated and focused collection. Ken was so welcoming and just a wonderful docent who discussed the exhibits with us extensively. The museum building itself is really neat architecturally. We really enjoyed our time there.\nThe other \"security\" guy was a little rude and overbearing...Couldn't give me even 30 seconds to look at a painting because they had just closed (Not exaggerating I promise). Please let him know that when people take the time in their travels to come to your museum from out of town and donate admission...I think it's ok to behave friendly and give them an extra 60 seconds beyond closing time. In fact everything and everyone else was great so maybe that guy just needs a little softening up.",
   "Seriously amazing. Great helpful staff in the front. And constant rotating and changing collections that they have on display.",
   "The building is nice and the staff are friendly but the art collection is really small and the stuff they have on display aren’t that interesting, except for the bulls",
   "As a Lincolnite, the Sheldon is a wonderful place to immerse yourself into art pieces from around the world. Whether it's a stroll through the sculpture garden or an adventure through the gallery, you won't be disappointed!",
   "Went to a First Friday event at the Sheldon Museum. The building is beautiful & don't forget to take a walk around the outside to see some of the sculptures. The staff were enthusiastic plus they had a nice little buffet of snacks & drinks. Also liked how they had activities for children. It's a quick trip through this museum but fun for a family as well as a solo visit if you're in downtown Lincoln or on campus. Also liked the different types of art work that were displayed. The permanent as well as the feature exhibit were definitely different."
  ]
 },
 {
  "name": "Nebraska State Capitol",
  "address": "1445 K St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b4335b10-9331-11ea-8a27-14b31f159f22.png",
  "tags": [
   "tour",
   "art",
   "tour",
   "art",
   "history",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=11117341759254861978",
  "source": "GoogleMaps",
  "reviews": [
   "The art is amazing, and I was really impressed with what they did with it. It’s not like normal capitols, most capitols are dome shaped but this goes strait up. I also like the inside. The art and engravings were just amazing. Also the tours were great. The tour guide talked about all the designs and art and gave a back story to all of it. Overall I had a good experience",
   "We love visiting capitols and were impressed with  Nebraska’s. This building has tons of character and art work, friendly staff and beautiful architecture. The view from the observation level is awesome! The tour guide had lots of information.",
   "The history behind this State Capital building was very interesting and informative.",
   "Another capitol building, another stamp!  We made a stop here during our return road trip.  \nWe made our way up to the observation floor and there were a couple of doors leading outside that were open (inspections were being done and some construction/repairs so some areas were inaccessible). There are some nice views and so far this is the only state capitol building we visited that allowed visitors to step outside (North Dakota use to but some unruly teens caused that practice to end).  This building had a chain link fence type of cover over the gaps on the outside which is probably why they could allow folks to go out and enjoy the view.\nThe first floor allows you to make a bit of a circuit (because of the construction we couldn't actually do a full circuit so back tracked just a bit). There's plenty to see, even a bashful bust that hides behind a newspaper! 😁 He does have a face, I just had never seen a bust holding a paper so just had to take a photo (in a few years kids probably will need to ask what he's holding in his hands).",
   "It was a random trip. We traveled to Lincoln to buy a car. Walked the streets that are lined in a perfect grid. While the tall building is a marvel, the treasure lies inside, dim light, spectacular tall beams, peerless marble work, wall murals, prefect chandeliers, the state house chambers, it has an imposing peaceful and quiet gravitas. The interplay of architecture, light and muted displays create a harmonious experience. The building is the museum. A must see."
  ]
 },
 {
  "name": "International Quilt Museum",
  "address": "1523 N 33rd St, entrance off 33rd, not, Holdrege St, Lincoln, NE 68503, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b48a06b6-9331-11ea-9b89-14b31f159f22.png",
  "tags": [
   "learn",
   "family",
   "family",
   "free"
  ],
  "link": "https://maps.google.com/?cid=11067677957192356254",
  "source": "GoogleMaps",
  "reviews": [
   "Man, I didn't even know that I liked quilts! I came here on a day trip with family, and it was fun getting to see the quilts and learning about all the work that goes into them. Definitely a must-visit if you have a couple hours and want to learn about something new!",
   "Beautiful museum! Made it there 20 min to close and was able to see almost everything but in a rather rushed pace. I would recommend more like an hour to see it nicely. Staff was so nice too. I also recommend getting a Groupon we saved alot of money and I think it's available all the time.",
   "Wonderful collection of traditional and contemporary quilts. Well done galleries for each type and exhibits change frequently.  A  treat to see the button quilt and the two sided Japanese quilt exhibit.",
   "I expected the museum to be larger, but I think it's actually the perfect size to be able to enjoy without getting overwhelmed. I was grateful for the wheelchairs provided, which made it much easier for the whole family to enjoy. My only critique is I wish they had evening hours.",
   "My wife is the quilting junkie: I just provide moral support (and woodworking support as needed).  But I very much enjoyed this museum.  We both thought it was an outstanding representation of a wide variety of quilts from around the world.  The facility is beautiful and spacious and very elderly and handicapped friendly.  Parking is on location, free, and spacious.\nThe arrangement of quilts by exhibit rooms allows the visitor to digest the intricate complexities of quilting by global region.  I particularly enjoyed the colorful quilts from India: they are breathtaking.  This is a must see even if quilting is really \"not your thing.\"  You are sure to be impressed."
  ]
 },
 {
  "name": "Nebraska History Museum",
  "address": "131 Centennial Mall N, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b4ccb54c-9331-11ea-b2d1-14b31f159f22.png",
  "tags": [
   "learn",
   "family"
  ],
  "link": "https://maps.google.com/?cid=13607351178217053348",
  "source": "GoogleMaps",
  "reviews": [
   "Woah, there’s so much to learn from this museum. Short, detailed descriptions beside every exhibit are insightful.",
   "This museum has a lot of valuable information and activities for children. This is a family trip. Great tourist attraction.",
   "Well balanced collection with some Interesting and thoughtful displays.",
   "Simple and accessible for a little time-killing walk-around",
   "Super proud to visit the Women's Sufferage Exhibit! Good work NHM. 👧👩👵"
  ]
 },
 {
  "name": "National Museum of Roller Skating",
  "address": "4730 South St, Lincoln, NE 68506, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b53c8e62-9331-11ea-84aa-14b31f159f22.png",
  "tags": [
   "unique",
   "history",
   "free"
  ],
  "link": "https://maps.google.com/?cid=8409309104916619035",
  "source": "GoogleMaps",
  "reviews": [
   "A very unique and super cool museum of the history of Roller Skating. I was trying to figure out what the previous reviews meant by “don’t forget your quarters,” but after visiting I would say bring a quarter or two!",
   "Very neat collection of roller skating memorabilia and equipment. However, the museum is located, quite strangely, in the rear of an office building. We wanted to buy something from the gift shop but there was hardly a soul in the whole building, and we had to grab someone from the cubicles to complete the transaction. Overall, just a kinda weird museum experience.",
   "If you ever skated as a kid, you'll enjoy the museum. Who knew the first skates were inline? Apollo Ono and Tara Lipinski started on roller skates. Rhonda Cann, the director, is a wealth of additional information. And it's free with free parking. Well worth the time!",
   "A long time ago my friend and I roller skating accross NYC, her using roller skates and me using roller blades,  Everytime I go to the museum it reminds me of more innocent days and our friendship. She passed on, so this is all i have left and the memories",
   "Great little museum.  A must visit when in Lincoln"
  ]
 },
 {
  "name": "Wilderness Park",
  "address": "4700-4798 S 1st St, Lincoln, NE 68512, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b59c88e8-9331-11ea-9a48-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6266237627324209490",
  "source": "GoogleMaps",
  "reviews": [
   "Cool place to go out and explore the edge of city wilderness. Vast array of flowering plants in the spring. Excellent place to go birding, see wildlife, ride your horse, bicycle, walk your dog or go on a nature y date. Also a good place to find inner solace and meditation on a self walk. Nice get away from the hustle and bustle of the city. Nice little stream, pleasantly bubbly. If walking in spring/summer, wear bug spray. The water is also a mosquito haven.",
   "There are so many trails and so much space. The scenery is always beautiful, no matter which area you start at. I often see wildlife while I'm here and it's close to get to from home.",
   "Beautiful area to take our dogs to get away from the sounds of the city a little. They loved it as much as we enjoyed the walk around!",
   "True Wilderness trail. The trail is well marked. The creek cuts through the trail. The opportunity to explore the outdoor vegetation and animal pathways are undending. Our dog lived the trails.",
   "Great place to get away from the city without going far"
  ]
 },
 {
  "name": "Lincoln Children's Zoo",
  "address": "1222 S 27th St, Lincoln, NE 68502, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b6175e98-9331-11ea-95e4-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "affordable",
   "kids",
   "kids",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=13958130257212715077",
  "source": "GoogleMaps",
  "reviews": [
   "My whole family just loves it here. I am so happy that they are open year round now. Price is affordable for such an amazing experience and sweet memories for the kids to look back. Thank you so much for your hard work and kindness. We, local people really appreciate your contribution.",
   "I have been going to the Lincoln Children's Zoo now ever since I was a toddler myself. I've seen the Zoo change over the years. This recent additional growth has allowed the Zoo to grow and add many new items for people to see. They have a program with the Lincoln Public School to offer Zoo School. The Zoo has its own train and recently laid new track to replace the 30 year old track. They have a beautiful Zoo Gift shop and I now have been told that they have a new restaurant in the Zoo. I look forward to taking my nephew's this summer to the new and improved Lincoln Zoo.",
   "This zoo is a great place to take kids as it is just the right size. The path through the zoo is very straightforward and kids usually seem to stay on the path. This makes managing your little ones easier! The Omaha zoo is a pretty cool place but I like the layout of the Lincoln zoo much better for smaller children. The new attractions are great (tigers, giraffes, red pandas, etc.) and the summer time brings a lot more volunteers to actually touch some of the animals. It's a great zoo for children.",
   "A lot of the new animals and additions are great! It's a nice zoo for little kids. We have had fun exploring the different places and feeding some of the animals.",
   "Disclosure, I haven't actually been to the zoo during normal operating hours...but did check it out for the first time last night for Zoo Lights & it was a fabulous experience! The event was well organized and put together & the lights were great! I will definitely be making a visit back to the zoo to check out all the exhibits & such! :)"
  ]
 },
 {
  "name": "Hazel Abel",
  "address": "1716 E St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b66cd1ca-9331-11ea-8310-14b31f159f22.png",
  "tags": [
   "family",
   "pets",
   "parks",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=17206250241556749846",
  "source": "GoogleMaps",
  "reviews": [
   "A tiny park but a very compact and adorable parks! Definitely on my list of top 3 favorite parks in Nebraska! So many places for pictures and picnics with friends, family and pets! I highly recommend this park to photographers looking for locations in Lincoln for photoshoots! :)",
   "I was so happy to see that the park was so well kept up when we were there, the maintenance and improvements done in the last few years really show. it is a great place to take pictures even though the neighborhood can be kind of rough. My girls had fun sticking their hands in the fountain and playing on the equipment and looking at all the pretty structures.",
   "Small park in historic neighborhood with beautiful landscape and features.  Great place to take photos...senior pictures, etc.",
   "Grew up here going to this park. \n\nCame back after 29 years away and took my daughter. \n\nNothing like when i was a kid, but she still lived it",
   "I got married here years ago."
  ]
 },
 {
  "name": "Lux Center For the Arts",
  "address": "2601 N 48th St, Lincoln, NE 68504, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b6c83888-9331-11ea-a6f8-14b31f159f22.png",
  "tags": [
   "tour",
   "art",
   "knowledgeable",
   "kids",
   "family",
   "art",
   "art",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=9336752824924208876",
  "source": "GoogleMaps",
  "reviews": [
   "I haven't had the opportunity to visit for a class or anything, but my sister gave me a tour of the facility. A very nice little studio will all different art forms. Staff was friendly too.",
   "Friendly and knowledgeable staff! Many surprising treasures in this gallery,  gift shop and arts center!",
   "Lots of beautiful art. We went to family day and the kids learned a lot and had a lot of fun!",
   "Wonderful art gallery and shop for locally made art, jewelry and more",
   "Excellent gallery shows. High end and unique"
  ]
 },
 {
  "name": "Great Plains Art Museum",
  "address": "1155 Q St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b73d1aba-9331-11ea-85cd-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "walking",
   "art",
   "library",
   "art",
   "tour",
   "art"
  ],
  "link": "https://maps.google.com/?cid=10458767136006994388",
  "source": "GoogleMaps",
  "reviews": [
   "What a gem of a gallery! I'd never been there before and was so impressed by the artwork displayed! Two prairie chickens made entirely of cut pieces of paper and amazing paintings & poems in the basement (Art & Poetry of the Barada Hills) we're my favorites! Worth going!",
   "Great displays of Great Plains art from a rotating group of artists. Varied literary collections from Great Plains historians.\nIt all starts out front with a mini sculpture garden that draws you in from the usual hustle of a University campus \nWalking through the doors into the several floors of galleries and special exhibits is truly a step back in time.",
   "Located in downtown, I was surprised to see that there were no reviews. So I figured I would pop in and see why. And to tell you, I don't know why. This is a small but interesting art collection and is well worth at least an hour of art appreciation.Some excellent American artists on display here including Frederic Remington (I've seen his sculptures in many places, including Bismarck and Salt Lake City), John Falter, Albert Bierstadt and Edwin Deming. The display of stereoscopes was super cool and having a device there to actually look through was awesome.",
   "I LOVE the Great Plains Art Museum! They always have amazing shows up, with their impressive library just up the stairs. Not to mention they’re right downtown, just across from the bus stop, and are only a quick jaunt to the Haymarket. Highly recommend!!",
   "We attended a special symposium last week \"Epic Neihardt\". The staff was welcoming and helpful. The Art Museum is lovely and easy to navigate. The layout (bathroom in the basement level) worked well for this event. Take a tour on your lunch break if you work downtown or on campus. Some great visual art (Sculpture) greets you upon arrival the entrance is on the east side of Hewit Place. Spend some time here and get to know The Great Plains!"
  ]
 },
 {
  "name": "Larsen Tractor Museum",
  "address": "N 35th St & Fair St, Lincoln, NE 68583, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b77f2cde-9331-11ea-a889-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "performance",
   "unique",
   "history"
  ],
  "link": "https://maps.google.com/?cid=16700613869246627055",
  "source": "GoogleMaps",
  "reviews": [
   "This was a cool place to see. The staff is very informative about the transformation of tractors over the last century.",
   "Nebraska Jewel 💎 \nAgricultural Prism 🚜\nFree Family Fun 👍",
   "Well this is definitely another unique Museum to be added to the list of y'all ain't going to believe there's a museum to do this list. This Museum Chronicles what has happened over the last 100 years with tractors being tested so that one can determine if the claims of the manufacturer and the performance of the tractor are equal. It turns out that Nebraska took this so seriously that in order to sell a tractor in Nebraska it's got to be certified and it's performance of its duties. I was lucky enough to come during the time when there was no crowd of students only the staff at the Museum. The lady who was the executive director had a script that was memorized that told stories of the tractors and the history of the testing and why it became important and how it's recognized now worldwide, it's an incredible story.",
   "Interesting  our speaker  was very good answered  all questions showed us around we also watched  a CD",
   "Awesome place to see the progression of farm equipment and tractors ."
  ]
 },
 {
  "name": "St Mary's Catholic Church",
  "address": "1420 K St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b7d9210c-9331-11ea-b154-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=4019724881243838269",
  "source": "GoogleMaps",
  "reviews": [
   "What this church lacks in appearance it really makes up for in passion of the priests and service to the poor and ill.  Loved spending time there.",
   "Nice church and people and food net",
   "Very nice place. The first time I'd been in there (for memorial service). It was a nice, clean, welcoming environment. There was lots of space. Lots of metered parking since it's right down town. Just depends on the day of the week and the time of the day how available parking will be.",
   "My St Mary's church is wonderful place to pray and give thanks to the Lord.",
   "So beautiful! A peaceful, prayerful place."
  ]
 },
 {
  "name": "Hyde Observatory Holmes Park",
  "address": "3701 S 70th St, Lincoln, NE 68506, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b83e4bf8-9331-11ea-89ce-14b31f159f22.png",
  "tags": [
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=11234741179570099574",
  "source": "GoogleMaps",
  "reviews": [
   "I've gone to this observatory for years.  My son's liked going when they were young too.  You'll fall even more in love w the stars after looking through the telescopes.  They put on nice shows for adults and older children.",
   "They have multiple telescopes that you can look through and several fascinating videos on space that are shown every week. It's a good date idea of you're looking for something other than \"dinner and a movie\" and don't mind letting your inner nerd shine. You might want to check the forecast before hand though. If it's drizzling, they won't expose the telescopes but they will still show a video or two and have people there who can answer many of your astronomy questions.",
   "went there and they were closed due to winter hours :*( saddest moment of my life. really enjoy the architecture, however. Holmes lake is beautiful at 8 pm.  would've gotten a full 5 if they were open",
   "Awesome volunteer staff. Great conversation and very knowledgeable",
   "A great place to visit.  Open every Saturday night."
  ]
 },
 {
  "name": "The Veterans Memorial Garden",
  "address": "3200 Veterans Memorial Dr, Lincoln, NE 68502, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b87a6a94-9331-11ea-a964-14b31f159f22.png",
  "tags": [
   "walking",
   "kids",
   "history",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12919609737864087872",
  "source": "GoogleMaps",
  "reviews": [
   "Serine place to reflect and give thanks to our veterans. The different dedications are written in large lettering making it easy to see which branch of the military or which war the memorial is representing. The walking path is calm and I found it was a good place to teach my son about what our military has done in the past and how he can pay proper respects.",
   "Very Nice. Lots of names and history to see. Great place to start teaching kids about the sacrifices so many Americans have made. Wish some of the monuments were better updated or taken care of. It's hard in the city to maintain I know. Most we pretty cool.",
   "Great place for remembering our Veterans.",
   "A quiet place to reflect on lost loved ones and people that fought for what they believed in. GPS game friendly,just be respectful.",
   "Beautiful Veterans Memorial. I Walk My Dog Almost Everyday And See This Garden."
  ]
 },
 {
  "name": "Licorice International Haymarket",
  "address": "230 N 7th St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b8cb49f4-9331-11ea-a9d1-14b31f159f22.png",
  "tags": [
   "unique"
  ],
  "link": "https://maps.google.com/?cid=8314706517859234225",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing selection! Great prices! I’m obsessed with salty licorice and it’s impossible to find stores that sell the kinds I like! This store has it all and they are super fast with shipping orders! Shipping is not absurd either!",
   "This was the #1 destination on our list for our first trip to Nebraska. It was 1000x worth it!!! So many different licorice from many countries. We will definitely be coming back!!",
   "You can guess what they sell licorice all kinds of licorice very strong wish licorice from various countries and large assortment and you can try all the samples you want They also have some unique candies and candy bars from around the US",
   "Lovely place! The owners were wonderful and there is a huge assortment of licorice and candy.  Seriously, it's probably the best candy/licorice store I've ever visited",
   "Great services for the Gift I wished to create. They are moving and expanding.\nUnion College, 4725 Prescott Ave  & Haymarket, 230 N.  7th St"
  ]
 },
 {
  "name": "Holmes Lake Park",
  "address": "Holmes Lake Parking Lot, 3, Holmes North Shore Rd, Lincoln, NE 68506, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b927e91e-9331-11ea-a190-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "kids",
   "walking",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2873480831067929080",
  "source": "GoogleMaps",
  "reviews": [
   "Diverse groups of people. Walking path around the entire lake. Benches and picnic tables. Kids play area. Covered picnic areas. Fishing.",
   "Lovely crushed limestone to run/walk on and such beautiful scenery as you go around the lake. I love hearing the birds, spotting different varieties and watching the waterfowl along the way. Great kayak spot also and always smiling faces. If you need motivation to get a workout in, this is the spot!",
   "Huge space with lots of opportunities to get close up to the water! Bring your non-motorized watercraft water board, canoe or kayak whatever & there's plenty of walking or biking trails. There's benches spread out throughout the park and picnic areas available. Great outdoor playground area for the kids!",
   "Great place to bring your family to relax or just come solo and watch the sunset over the lake. The locals know about the back entrance you gonna have to go and find it yourself. Look for the star observatory.",
   "Simply breathtaking sunsets. Jogging, bike trails, perfect place for open air business meetings, or moments of solitude. Must see this park. Bring the kids and enjoy."
  ]
 },
 {
  "name": "Mahoney Park",
  "address": "Lincoln, NE 68507, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b98e7352-9331-11ea-84d2-14b31f159f22.png",
  "tags": [
   "field",
   "family",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=10745907004982939239",
  "source": "GoogleMaps",
  "reviews": [
   "Good park, with alot of activities and open space. It's right in the middle of lincoln so you are surrounded by homes and can see a view of walmart over the horizon.",
   "This park is a nice peaceful place to bring the family or even have a nice party at. There is a playground for the children, as well as a tennis court and basketball court. Further into the park is a baseball field. It's beautiful nature is best seen during the summer months when all the trees are in full bloom!",
   "So pretty and plenty to do. Great park!",
   "The park is a great place to just chill and hang out with your babies and get away",
   "Beautiful park. Well maintained. Nice, paved trail."
  ]
 },
 {
  "name": "Trago Park",
  "address": "N 22nd St & U St, Lincoln, NE 68503, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ba079b62-9331-11ea-b2fd-14b31f159f22.png",
  "tags": [
   "walking",
   "free"
  ],
  "link": "https://maps.google.com/?cid=9821701999086303913",
  "source": "GoogleMaps",
  "reviews": [
   "Fun!!! As always!! Children of all ages have fun and you can even see some of the adults getting into the fun!! There's more than just the splash pad. There's a small playground and swings for those who want to take a break from the water but not the fun! There are a few rope sculptures that can be climbed on and into. Great fun for everyone!!!",
   "Loved this park! My children enjoyed the play equipment as well as the walking trail. It was clean and we loved the cute little tables and stumps etc. carved from stone! My 15 year old son did find a suitcase with what appeared to have a homeless persons belongings inside. ( he opened it before my husband or I could stop him!) There was also someone sleeping in plain sight right in the bushes on the other end of the park... at 3:30 in the afternoon! The couple asleep in the bushes didn't bother us though, and if there are other homeless people staying in this park, they clean up after themselves and don't leave trash laying around. Really neat little spot overall!",
   "Very nice lil spot for a hot lil day",
   "Why do I love this park? It's FREE! You can spend the afternoon or just stop to cool off real quick on a hot summer day. Picnic tables, shaded benches for reading, basket ball court, spray park and it's all right next to a beautiful bike trail.",
   "Nice park close to UNL and downtown area. The splash park is a fun summer activity for young and old alike."
  ]
 },
 {
  "name": "Stransky Park",
  "address": "17th St & Harrison Avenue, Lincoln, NE 68502, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ba8186a4-9331-11ea-b06d-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "music",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11296984727761180003",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped at this cute little park while we were in Lincoln. Water area and water fountain was empty / turned off which makes since it's just now warming up. Very clean, kids loved the equiptment, and going up the stairs to the waterfall area. Smaller then I expected but plenty of room to play. No restroom.",
   "Tons of kids messing around and throwing things. The music was pretty good though.",
   "wonderful little park with a little something for everybody. Nice green spaces, a beautiful waterfall, a small children's play area and some nice footpaths. All in a quiet neighborhood, with available parking.",
   "This is a beautiful park! It's well taken care of, always clean, and tucked away in a quiet neighborhood. The rock waterfall in my opinion, is the prettiest in the city. Great place to go with family or if you need a peaceful spot to clear your mind.",
   "A tiny park that's five times the fun and adventure!"
  ]
 },
 {
  "name": "Tierra Briarhurst Park",
  "address": "NE-2, Lincoln, NE 68502, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bb081c1a-9331-11ea-babd-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "walking",
   "family"
  ],
  "link": "https://maps.google.com/?cid=5616390889094957084",
  "source": "GoogleMaps",
  "reviews": [
   "I absolutely love walking these trails. The environment is beautiful and there is so much wildlife to observe. There are several deer, tons of fox and lots of squirrels. I do wish other people would respect the area and not leave trash around. This trail allows easy access to Russ's Market and the 33rd and highway 2 area as well as Tierra Park and connects to several other trails.",
   "The hubs plays disc golf here. I bring a dog or two and we tag along. Walking the dogs at Tierra Briarhurst Park is pretty painless. You can walk the trail or off-road it, which is what we usually do. The trails have exercise stops if you are into that kind of thing. The dogs mainly sniff the equipment. After that they aren't interested.",
   "Family friendly and also dog friendly. A great place to get lost talking pictures.",
   "Nice park. Caught a 19\"bass in the run off.... And a few others.",
   "Plenty of room for multiple people. Clean and maintained facilities."
  ]
 },
 {
  "name": "Star City Shores",
  "address": "4375 S 33rd Ct, Lincoln, NE 68516, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bb688be6-9331-11ea-8173-14b31f159f22.png",
  "tags": [
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6086151199749046982",
  "source": "GoogleMaps",
  "reviews": [
   "Godchild's swim meet this morning. Never been to this facility before. Beautiful grounds, clean and well maintained. Pools we're crystal clear. Plenty of room for participants and spectators. Had a chance to visit with several employees, life guards - very polite and engaging.",
   "This is my over all favorite of all of the City pools. Its not just a typical \"public pol,\" it's a mini water park. This particular pool is really great for the smaller kids and the ones not quite swimming yet as there is a large playset in the shallows giving them a lot of activity. There is also a nice, covered wading place to sit with your infant or toddler. It walks down, much like the beach so it is easy for anybody to get in and out of. Lastly, the last day of the year that the pool is open is \"dogs day\" where you can bring your dog...however I hear you need to get your pooch his ticket early as they limit the amount of dogs.",
   "Very Nice place",
   "Bathroom and restroom are dirty and old. Need to take care and clean more often.",
   "Seems to be really busy all the time but kids have lots of fun."
  ]
 },
 {
  "name": "Deer Springs Winery",
  "address": "16255 Adams St, Lincoln, NE 68527, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bbe165a4-9331-11ea-b1f2-14b31f159f22.png",
  "tags": [
   "delicious",
   "music",
   "unique",
   "tour",
   "tasting",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=16071391493281943603",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great venue for music. Shaded lawn. Easy drive from Omaha and Lincoln. Some delicious reds and whites reasonably priced.",
   "First of all, if you enjoy wine (even a little bit), I suggest taking a day trip doing tastings at the many wineries around the Lincoln metro. I've found that each region of the US has a unique wine culture and Nebraska is no different. Deer Springs would be a great stop on a day tour. It's located in a cute little house on a nice green space. There's a patio and gazebo area for outdoor seating.I'd recommend a tasting of the wines. They have a variety of reds and whites that range from dry to sweet. Like other Nebraska wineries, they tend toward the sweeter spectrum but that's our local viniculture (the types of grapes that grow in the region).",
   "Very good wine and entertainment on the weekends.",
   "The entire experience is always EXCELLENT. The wines are, in my opinion, the best around. The staff is always friendly and very knowledgeable. And the ambiance is lovely. From the restored farmhouse with the cozy fireplace and tables where you do your tastings, to the outside areas...firepit...gazebo...it's just so relaxing. And when they have music...you can be assured it is also the best around. Highly recommend!",
   "So peaceful, quiet, enjoying, friends......Today was an amazing day spent with my friend for my birthday!"
  ]
 },
 {
  "name": "James Arthur Vineyards",
  "address": "2001 W Raymond Rd, Raymond, NE 68428, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bc50f0ac-9331-11ea-9a7e-14b31f159f22.png",
  "tags": [
   "tasting",
   "music",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=17404114639511023041",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for a \"corporate\" vineyard. They have live music, great outside seating areas, good wine sample tasting options. The area is really beautiful and it has a very relaxing atmosphere. It can be rather busy though on some weekend afternoons but they have plenty of help so getting served doesn't take long.",
   "This vineyard had cats. That's an A+ from me. \n\n(Good wine too)",
   "Great place, excellent wine and atmosphere.",
   "Delicious wines and now hard apple cider. We try to go out there at least once a year to try the new products and re-sample the other items. You can get cheese, bread, and a meat product with a wine pasting. Our favorite is Edyn's Blush.",
   "An experience we'd recommend to everyone!"
  ]
 },
 {
  "name": "Memorial Stadium",
  "address": "One Memorial Stadium Drive, Lincoln, NE 68588, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bcd03352-9331-11ea-b0a3-14b31f159f22.png",
  "tags": [
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=14524227997740320679",
  "source": "GoogleMaps",
  "reviews": [
   "Although getting to the stadium is a long walk from parking lot 19, it is well worth.  I have been to all Big 10 football stadiums and this was the best experience.   The Nebraska fans are the best.  Very welcoming and kind.  Plus the University's football tradition makes attending a game a real great experience. \nThe red out lights they do between quarters was fantastic.\nThanks Nebraska fans!",
   "If you are a college football fan, you need to attend a game in Lincoln.  The fans are amazing and take pride it welcoming the other team.  It is located close to downtown Lincoln so there are options to traditional tailgating.  This is an old school stadium.  I do recommend getting the seats because of the bench’s.  It gets tight.  Go Big Red.",
   "We are from Oklahoma. I thought the workers would be kinder, but I get it, they are busy. I would definitely go back. And the bathrooms are clean. I also like how you can load your own hot dog, as I like lots of mustard. :) Go Huskers!",
   "First time for me and was a pretty good experience. Was there with my lady who is a Husker Fan and me I am from Wisconsin so go Badgers. 37-21 Badgers awesome. Was in section 32 row 98 way way up and would have been nice except for the 20mph wind blowing right in our direction. Loved the stadium and the prices for things very reasonable compared to other stadiums that's for sure. Will definitely be going again.",
   "We love watching the football games here as a family! The atmosphere on game day Saturday’s is amazing."
  ]
 },
 {
  "name": "Cripple Creek Park",
  "address": "Lincoln, NE 68516, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bd8070d4-9331-11ea-ac66-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "field",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=791151177812952243",
  "source": "GoogleMaps",
  "reviews": [
   "Such a great time there with my kids. There is not shortage of play structures for them to climb around on",
   "This park is super lame. The great, colorful jungle gym and slides in some of the posted photos are part of the elementary school next door. There was no divider between the two areas, which made it hard to determine where my little could play. We happened to go during recess, so we avoided the places where school kids were, which was literally all of the cool stuff. My recommendation would be not to go during a school day.",
   "We live in the neighborhood and absolutely enjoy relaxing atmosphere of the park. It is not too big and just enough people/activities. The park is next to the school and includes the soccer field ( I saw people practicing baseball as well).",
   "Nice park for kids of all ages. Sidewalks around the playground area so children can ride scooters or bikes.  Slides, swings, trees to climb. Small covered picnic shelter area.",
   "Great little park to take the family to."
  ]
 },
 {
  "name": "Bill Harris Iron Horse Park",
  "address": "235 N 7th St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bddaed28-9331-11ea-8e08-14b31f159f22.png",
  "tags": [
   "food",
   "art",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=4404563929682261521",
  "source": "GoogleMaps",
  "reviews": [
   "Went to the farmer's market (Saturday mornings through Oct.)- they have (almost) everything! Goat cheese from Dutch Girl Creamery, jam from Lana's Jams & Jellies, and amazing up-cycled goods from Marjorie Mae. For those that love the food carts, there were tons of baked goods & snack items, along with burritos or pulled pork. And of course the fresh produce & lots of craft items and great gift ideas. I recommend getting there early for parking though...",
   "If you love trains you will love it, small park with an original steam locomotive an a car. Nice!",
   "I love the train and the the brick art definitely an interesting part of the hay market.",
   "Nice park in the middle of town.",
   "Nice aesthetic addition to this area. Would be a great place for a walk."
  ]
 },
 {
  "name": "American Historical Society of Germans From Russia",
  "address": "631 D St, Lincoln, NE 68502, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/be37da70-9331-11ea-8364-14b31f159f22.png",
  "tags": [
   "unique",
   "history",
   "history",
   "library"
  ],
  "link": "https://maps.google.com/?cid=11688735980062027876",
  "source": "GoogleMaps",
  "reviews": [
   "Rich in history. Germans from Russia that immigrated here to Lincoln. They have artifacts, instruments and a blacksmith shop, a church. Even a store, & outbuildings. Quite unique. My ancestors are from Prussia so I may be a little bias.",
   "OK, who even knew that \"Germans From Russia\" was even a Thing?? Much less that they even have their own museum?! Well, if my own grandfather had not actually been one, and a homesteading immigrant to boot, I would be included among the vast number of ignoranti myself. Stop in and give this delightful little tribute to an obscure but interesting historical niche a visit and then head down to Beatrice to the Homestead Monument for broader context.",
   "Visited the open house. Great history. Very friendly people.",
   "Sneaky stuff.  I had been there before and I missed 90 percent of it.  They have a 20 min. video that explains why they left Russia.  In it is a picture of the Havelock Shops in a building where they were constructing train steam engines.  I lived across from there for 34 years and I had not seen that picture before.  Most of the displays are on the second floor of the main building.   In the basement is a research library.  In the back are several more buildings.  Unfortunately they are seasonly closed until April.  There is a chapel, general store, blacksmith shop and a couple more buildings.",
   "Great place to visit visit your heritage."
  ]
 },
 {
  "name": "Branched Oak State Recreation Area",
  "address": "12000 W Branched Oak Rd, Raymond, NE 68428, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/be7a6206-9331-11ea-8c1e-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=5441360892795528929",
  "source": "GoogleMaps",
  "reviews": [
   "This time of year is magnificent at Branched Oak. Today there were so many snow geese and some bald eagles. Such a sight to behold plus the sound of all those snow geese is etched in my mind forever. Thank you Jesus for such beauty!",
   "Very large lake. Great for boating and big groups. We have my bf's company picnic there every summer. Very popular lake because pretty close to Lincoln and Omaha. On site dump station...bathrooms and showers...swim area. Very populated though during the season.",
   "This is a nice park. The lake is beautiful. The only downside is if you go here on any sort of holiday during the summer, be prepared to feel like a sardine. The camper sites are extremely close to each other. So you're going to get to see your neighbor's quite a bit, whether you want to or not.",
   "Nice clean camping grounds. Non- residents pay 8$ per night. Park was well maintained and situated on a very nice lake. Was raining so did not get to enjoy as much as I would have liked.",
   "A great lake for families and your furry little friends. Also a great place to take beautiful pictures."
  ]
 },
 {
  "name": "Eugene T. Mahoney State Park",
  "address": "28500 W Park Hwy, Ashland, NE 68003, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bee09e14-9331-11ea-94a8-14b31f159f22.png",
  "tags": [
   "kids",
   "hike",
   "family",
   "kids",
   "parks",
   "kids",
   "eat",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=15123754436603941043",
  "source": "GoogleMaps",
  "reviews": [
   "This place is awesome! Some friends were staying at a cabin there. The cabin was very nice, multiple bedrooms a full kitchen, full dining room table, a large spacious home. The kids played at the activity center with huge tubes and tunnels for the jungle gym. There is a rock climbing facility and ice skating rink right there. They had a sledding hill out back of the activity center with artificial snow machine. The other play grounds around the park were great as well. Very cool place, take your kids no matter the age they will love it!",
   "Very nice state park! They have super reasonable indoor climbing and ice skating!  The rock wall is pretty cool, they have top rope, lead, and bouldering.  They have quite a few auto belays and 42-foot walls!  The ice skating rink looked nice, too.  I'd love to hike the observation deck there, but it is closed until Fall 2020 for repair they said. Will definitely be going back there!",
   "We found this park while traveling on I-80 to Omaha. Beautiful area and looks like a great family vacation spot! Pool, zip line, lookout tower hiking trails, cabins, lodge, restaurant. Other places of interest nearby. Open year around!",
   "Parks good, kids love the playgrounds, trials and mini golf. They need to move to a more traditional form of walk-up space reservation. They make you drive around, find your place and stop by the front to reserve before dropping your trailer which may or may not still be available. Most allow you to drop your camper and than pay. Much easier and less likely to trip over others.",
   "We visited the indoor playground and had a blast.  Very affordable for what you get.  There are many places for parents to sit while the kids run around and you can even order Valentino's pizza or other snacks to eat."
  ]
 },
 {
  "name": "Porter Park",
  "address": "2810 O'Malley Dr, Lincoln, NE 68516, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bf4bbc24-9331-11ea-9e0b-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "parks",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=8446902898238481013",
  "source": "GoogleMaps",
  "reviews": [
   "Nice little lunch spot for the family to picnic",
   "Good good park to play in I took my kids they loved it I don't see any reason why no one else wouldn't love this park I had son brought the dog do the frisbee no one lingering around like weird parks.",
   "Cool park 👍",
   "Great neighborhood playground with nice slides, swings and a basketball court.",
   "Good park for younger kids with imaginations."
  ]
 },
 {
  "name": "SCHRAMM PARK STATE RECREATION AREA",
  "address": "20874-21146, NE-31, Gretna, NE 68028, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bfb8af30-9331-11ea-9abc-14b31f159f22.png",
  "tags": [
   "family",
   "learn",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4503777815605170190",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful hiking large fish to watch even the geese were fun I know more than a park sticker it was a day of family enjoyment",
   "Very pretty and peaceful. It was early Spring so the full beauty of the plants and trees was still emerging.  Do note that this is a Nebraska State Park, so buy a pass before going, or you will need to pay when you get there. The drive to the Park was nice too.",
   "Such a wonderful place! Beautiful trails and plenty to do!",
   "A wonderful place to spend the day with family and friends. Numerous activities for children and a fun way to learn about Nebraska. Featuring many fish, birds, plants and wildlife native to Nebraska. Walking and biking trails and beautiful  scenic river views. Schramm park is beautiful any time of year.",
   "This place is pretty great for hiking! We do the 3 mile loop, which has variation with ups and downs. The scenery is pretty and the trail is well marked! Would definitely recommend!!"
  ]
 },
 {
  "name": "Strategic Air Command & Aerospace Museum",
  "address": "28210 W Park Hwy, Ashland, NE 68003, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c004ac78-9331-11ea-8764-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "walk",
   "kids",
   "history",
   "tour",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9360390609224376542",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome museum with both aircraft and rockets. \n\nI had the advantage of coming here with my son, an airman with the USAF, who is knowledgeable with just about every aircraft on display. They are decommissioned planes and some you get the chance to see the innards - a plus. The facility from both the outside and in is super clean and impressive to behold. And as an added bonus they also have a space-related display from NASA as well as a tribute to fallen airmen from 911 and the missions that followed. \n\nI highly recommend coming here and paying a visit.",
   "The place is a decent museum to take your children. Especially if they're interested in airplanes or rocket ships. They have a nice children's learning area. I have only two issues with this museum. One, it's far out of the way from the Omaha metro area. Two, a lot of things could use to be updated here. There's lots of dust on all the aircraft. And the exhibits are pretty outdated, but still fun.",
   "Really enjoyed the visit here.  The SR-71 Blackbird on display is visible when you walk in the door and is very impressive.  I think my favorite display was the MIG-21 which is kind of hidden in a corner.  I also thought the Hobgoblin experimental fighter was an excellent display.  This museum has one of only two that were ever produced.\n\nThe activity centers for the kids are very good.  All of the activities are science based and created opportunites to explain science concepts to the kids.",
   "This place is awesome! Of course the SR-71 is the big draw and was awesome! They have a B-52 , and many many more pieces of aviation history. The personal items that belonged to Gary Powers was neat. Next time I’m in the area I’ll definitely stop back! Anyone that has any interest in aviation or space wont be disappointed.",
   "A few years ago I toured the United States Air Force Strategic air command Museum and found it to be a great museum to take family and friends to. My father who was a former SAC member would have love to visit this great museum.The museum is staffed by an excellent staff for volunteers with knowledge of all the military exhibits and the history of Strategic Air Command . Great Tour"
  ]
 },
 {
  "name": "Platte River State Park",
  "address": "14421 346th St, Louisville, NE 68037, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c0590e5a-9331-11ea-8d74-14b31f159f22.png",
  "tags": [
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14637284720665710551",
  "source": "GoogleMaps",
  "reviews": [
   "So beautiful and well kept. My kids had so much fun exploring and having a little adventure! Would highly recommend coming and visiting this amazing state park!",
   "Valentine's Dinner was great. I had the buffalo. The rolls are super soft with cinnamon butter on them. I could make that a meal. Had to take food home as I was stuffed.",
   "Beautiful park. I stayed in one of the cabins with a school group. There was plenty of room in our cabin. There is one big bed on one side and two bunk bed sets on the other side. The park is nice and clean. Fishing is good and the paddle boats were a favorite of ours.",
   "6$ to get in lots to explore! We used it for a photoshoot with a mermaid since they have a waterfall. The waterfall was a little busy but all really nice people! They have easy medium and hard trails and the front desk was very helpful to show us where the waterfall was. You can also rent cute cabins! Also horse rentals!",
   "Nebraska’s treasure. One of my favorite places to spend time. The falls are beautiful as always. Missed the horses, hope they return soon."
  ]
 },
 {
  "name": "Lincoln Children's Museum",
  "address": "1420 P St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c0af92dc-9331-11ea-997f-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "family",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=9796968723961343444",
  "source": "GoogleMaps",
  "reviews": [
   "There were interesting exhibits and play areas here. Our son at the time was probably a bit young (about 2) to fully experience all the activities, we spent most our time playing with the large you trucks they had and at the foam brick play area. The cost was a bit much, since it was my wife and I taking our one child.",
   "Such a fun place!!  My daughter loves it!!  It's very clean, and there is a large variety of different activities for many age groups. The staff is very friendly and helpful. We drove from Omaha and it was worth it. This was our second visit and we will be back soon.",
   "A bit pricey for three people, but a great environment for the little ones. Lots of learning opportunities and all of the exhibits are built for exploration. Areas are also spacious enough to allow parents to play with their kids. Does get a bit busy! The also have a super cute wall of all the contributors and partners!",
   "We love the place.. but so many of the activities are broken.. or missing everything.. it is clean enough.. and the kids still have fun.. just wish things were better maintained.. and it is very expensive",
   "Fun interactive play for all age groups. Multiple professions,  rooms and activities.  You can easily spend 3 hours with your littles. The place is clean and organized.  It makes a great family activity."
  ]
 },
 {
  "name": "Fun-Plex Waterpark & Rides",
  "address": "7003 Q St, Omaha, NE 68117, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c14ac20a-9331-11ea-b3b2-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10792623510982347715",
  "source": "GoogleMaps",
  "reviews": [
   "A great place to take the smaller children. Other than the go cart track and water features there's not many rides for the kids older than 13. My grandchildren always have fun. But my 15 yr old grandson gets bored quickly.",
   "A great place to spend a day! Maybe a little pricey, but we have so much fun. The big waterslides are fantastic and they have smaller ones for the little kiddos too, so all ages are covered.",
   "Fun plex is a great place to enjoy an afternoon with the family.  Is it six flags, no but for a small park, we always have a good time.  Funplex sells season passes at a discount online as a black Friday deal.",
   "We had a blast on July 4! Riding go karts and water slides was great!! It is a safe place to have some outdoor without losing track of your group. Got here at 11am & had very short waits.",
   "Great place to go an spend a day relaxing and having fun with the family!! Amusement rides were great, staff very friendly, wasn't overcrowded, something for everyone. Cant wait to go back!"
  ]
 },
 {
  "name": "Lincoln Fire & Rescue,",
  "address": "1801 Q St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c1a0834a-9331-11ea-9e8e-14b31f159f22.png",
  "tags": [
   "history",
   "active",
   "tour",
   "family",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15000423031954807431",
  "source": "GoogleMaps",
  "reviews": [
   "Cool museum. The Fire station staff were great, well informed and good with our toddler.",
   "Small but really nice museum of fire & rescue history. Thank you very much for the day on fire station 1",
   "This is a great little museum! Our tour guide was one of the female firefighters. She was top notch! She explained everything that was used in the past, then escorted my wife, her parents, and myself out to the new trucks they have and showed us their new equipment. It was so interesting, my family talked about it for about an hour during our lunch down the street at Wendy's. \n\nWe visited on a Saturday morning so, we did not get to see the administration office or meet any of the administration staff but, we still had a great time. It was a perfect little get-away while we were visiting the city for a family reunion.\n\nI would plan for about an hour tour. It depends on how many questions are asked by your group members. Keep in mind this museum is located in an active fire station and your guide can be called out at any moment.",
   "Love The Museum,  a Great facility to visit and you can learn so much about the history of Lincoln Fire and Firefighting.   Thanks.",
   "A room of old fire stuff."
  ]
 },
 {
  "name": "Holy Family Shrine",
  "address": "23132 Pflug Rd, Gretna, NE 68028, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c1eca7ca-9331-11ea-8138-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=1273848464202078091",
  "source": "GoogleMaps",
  "reviews": [
   "I've seen it many times from the interstate and finally went up there today. It's such a beautiful place! Besides looking at the shrine you can also take a walk around it and look at the story of Jesus Christ and his crucifixion. It's a really lovely and calm place in general.",
   "Simply gorgeous, peaceful and serene. I've driven past this church on the interstate many times, but never took the time to stop and didn't really know how to get there. Eventually, took the drive and used Google Maps to easily navigate, which I highly suggest you do, as well. Nothing but pure beauty and calm await. There are initial out buildings and gift shop, which I didn't know about. There's also a water feature which stems all the way inside the chapel. You can read the entire story as to why and the vision which inspired this wonderful design into reality. Such a beautiful story for a beautiful Nebraska landmark! Check it out, even if you're not Catholic!",
   "Awesome place to visit as a guest or spiritual retreat fro Omaha.  Just off the same exit as the outlets.",
   "Such a beautiful and serene place to be! Travelers are able to take in the beauty of the majestic land around, as they sit and meditate or pray in peace. The area offers beautiful views and wonderful landscaping. A person may come in, and feel comfortable knowing they belong there.",
   "Great visit and definitely worth stopping for.  Wonderful story and beautiful building and grounds. Staff was helpful but not overbearing.  Being able to roam and enjoy everything as we wanted was perfect."
  ]
 },
 {
  "name": "OPPD Arboretum",
  "address": "Omaha, NE 68164, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c257ece8-9331-11ea-af16-14b31f159f22.png",
  "tags": [
   "walk",
   "field",
   "nature",
   "family"
  ],
  "link": "https://maps.google.com/?cid=16130197975021643083",
  "source": "GoogleMaps",
  "reviews": [
   "It is a great place to take a walk in town and still see some nature.  I think it is wonderful OPPD took the time to make this place and not just leave a large white grave field with electrical equipment.",
   "OPPD Arboretum is a place you would love to go when you wanna stretch a little bit. It has that bit of beautiful naturistic assemble in the middle of the chaos. I went on the first day of spring to there, but I think wasn't the wisest decision. The place would be more beautiful with all the green fronds developing over a month from now. Maybe that would bar the constant noise from the adjoining street. I'll go once more, later in summer to see how things unfold there.",
   "This is a gorgeous park! Amazing for photos. Would definitely be prepared for waiting in line if you’ll be visiting for photoshoots. In the 8-10 times I’ve been here there has always been an overly saturated amount of photographers taking photos here 15-30.",
   "My children and I love coming here in any weather!  There's a beautiful little hill with boulders at the top that we love going to, pretending we have our own little mountains in Omaha.",
   "Great place for family pictures! Plenty of variety in trees, nice windy pathways and benches. There is even an easily walked dirt path through the thick grove. It can be a bit of a feeding frenzy for photographers around sunset and on the weekends, but everyone I've met were pleasant and helpful in  allowing each other space."
  ]
 },
 {
  "name": "Standing Bear Lake",
  "address": "6404 N 132nd St, Omaha, NE 68164, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c2cde0ac-9331-11ea-9ba7-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "walking",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3650188535505840740",
  "source": "GoogleMaps",
  "reviews": [
   "This is a nice place to go for a walk with and without your dogs. I would give it 5 stars if the paths on both sides of the lake were connected.",
   "This place is fantastic, my wife and I visited to go on a run as we are pretty new to the area, and loved it. They have a little bit of everything here!!",
   "Wonderful path for walking with children! It has lots of foot and bike traffic, but the path is designed for it and wide enough for everyone. Alternately shaded and sunny for all weather. We did not see any benches or picnic tables, but we didn't walk all the way around.",
   "Nice lake.  Pretty good fishing.  Too much littering.",
   "Really love this area. We live withing walking distance and it is awesome to walk on the trails. My only complaint is I wish the trail connected all the way around the lake! Once you reach 144th street it is unfortunate to turn around instead of make a loop around the lake. It is a great place to Kayak as well!"
  ]
 },
 {
  "name": "Lauritzen Gardens/Kenefick Park",
  "address": "100 Bancroft St, Omaha, NE 68108, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c349eea6-9331-11ea-8c8c-14b31f159f22.png",
  "tags": [
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=13010883281236174654",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful! Way bigger than you expect! \n\nBecause of the weather... Guess what, most plants are dead. However, the set up and design of the garden grounds were so mesmerizing that you almost don't need any plants!! \n\nI expected to stay 1 hour, but actually-- I stayed 3 hours! This place is so beautiful and well kept. Very much worth the $11 fee to enter.\n\nAlso, the place looks like only the building. Some other lady particular noted \"what's outside?\" \"Oh, I think it's just a small path.\" ..... Think again!!!! Outside, the property is HUGE. Don't miss out on the outdoor portion.\n\nAnyways, I recommend. I went alone, which is great, but it's also perfect for a date or bringing your kids or chatting with friends. Superb 🙂",
   "This place is amazing! The lobby area and multi-level greenhouse are a fun quick visit in the winter (Christmas display, model trains, LEGO exhibits, etc.), and the outdoor area is an adventure to explore during nicer weather. \n\nThe outdoor area includes a running model train exhibit (multiple tracks and trains) and you can spend an afternoon wandering around the gardens. You can also visit the real train engines near the entrance, and the gardens have an annual European car show out on the grounds.\n\nDefinitely check it out! It's worth your time.",
   "The inside atrium is warm and inviting and colorful and has a huge variety of plants. I'm glad they label so many of the plants/trees. Fountains and brick work add so much to the experience. Very walkable/wheelchair-able. The outside is great for long walks - a lot to see. The tram is also a great choice, as they let you off - to walk around both the Founder's Garden & the Rose Garden.",
   "There is so much to see!  We could have spent a lot longer here and we will definitely be back!  I highly recommend seeing the LEGO sculptures while they are there at Lauritsen Gardens.  The staff that we dealt with were all very polite and helpful.  We will be watching for future events and are considering a yearly membership even though we live 90 minutes away.",
   "The Lauritzen Gardens isba great place to go and wonder around in the summer. They have lovely gardens and plenty of space to wonder through while enjoying the outdoors. They also have the Lego traveling exhibit that comes through every year and their lights at Christmas time are lovely as well.  Wear comfortable shoes!!"
  ]
 },
 {
  "name": "Pinnacle Bank Arena",
  "address": "400 Pinnacle Arena Dr, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c3a0c186-9331-11ea-8b8e-14b31f159f22.png",
  "tags": [
   "walk",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=3577295517091291504",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice facility, easy to navigate around. Plenty of room and places for snacks or drinks. The only issue was parking which is expected. I didn't expect them to only except cash for state basketball. One ATM \"out of service \" 30 minutes later I find a ATM. Bring cash you'll be fine.",
   "Wonderful facility that can host anything from a rock concert to a sporting events. Staff is courteous and helpful, everything is clean and reasonable comfortable. Some drawbacks are parking and concession prices but where isn’t that an issue?",
   "Great experience, parking was close (although 10 bucks), walk from parking before and after the concert was well lit and safe. Staff inside were organized and professional, although nobody on security staff seemed to care that a 70 yr old dude in pancake makeup smashed a glittery guitar on stage while people egged him on. Also another 70 yr old guy wearing dragon boots, and playing a bass guitar was bleeding out of his mouth on stage and medical staff were NOWHERE to be found. At one point near the end, the backdrop burst into explosions, sparks and fire, it’s amazing nobody perished. The place was left with confetti paper everywhere, very disrespectful of my fellow concert goers to leave the place so messy. Other than these few small issues, overall was a very positive experience.",
   "Great arena and comfortable seats! Made for a great high school state game day! Friendly staff as well when you are standing in the walkways waiting for seats.",
   "Always been nice and clean whenever I have been here. Staff is very friendly and helpful. Great place for concerts and sports."
  ]
 },
 {
  "name": "The Durham Museum",
  "address": "801 S 10th St, Omaha, NE 68108, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c408844c-9331-11ea-9fd7-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "history",
   "walk",
   "learn",
   "tour",
   "history",
   "food",
   "music",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=6764021754541068847",
  "source": "GoogleMaps",
  "reviews": [
   "Love the history and the ambiance of the place. The soda fountain is pretty legit, too and isn't overly expensive. Go for a membership if you have a big family like us- you'll save money the second time you come. Sometimes younger kids may not have the attention span to really get into like older kids and adults.",
   "Nice place to learn about Omaha and Nebraska's history.  This older train station has full size locomotives indoors that you can walk through.  Well worth the $8 fee. Perfect for a 2 hour tour before getting back on plane.  Is only 10 minutes from airport.",
   "Amazingly thorough Museum about the life of and on railroads.additionally, they had amazing slices of Americana and rooms set up as they would be during a particular era. You can spend a good two hours here if you visit all the floors and read all of the information. One of the most interesting things to me was an old Sears & Roebuck catalog selling everything including live baby chicks shipped to your address! It was on display inside a home recreation and you are allowed to turn the pages to look through it. I imagine people under 30 may have never seen one of these come to their home as I did as a child in rural America.",
   "Beautiful museum with great events for adults. I attended the Flappers and Fizz event for the first time this year and it was so much fun! Great food & music. Huge turnout for the event but it never felt overcrowded.",
   "We went to see the Politics and Rock exhibit. It was great - displays were interesting and informative. Over against the EMP in Seattle, this was well curated. Just enough to enjoy and not feel overwhelmed or frustrated by a dearth of artifacts. My wife is an educator and we both agreed that the rest of the museum was inviting to kids and a great place to take the whole family. It is a treasure."
  ]
 },
 {
  "name": "Joslyn Art Museum",
  "address": "2200 Dodge St, Omaha, NE 68102, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c4ce6cdc-9331-11ea-b409-14b31f159f22.png",
  "tags": [
   "creative",
   "kids",
   "free",
   "art",
   "free",
   "art",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8044214669702392203",
  "source": "GoogleMaps",
  "reviews": [
   "Definitely a go to! Need to get out of the house? This is a go to and they have an area for kids to get creative also! There is so much to see and do. They also have a cafe if you get hungry or need a snack. I took my two year old here and he enjoyed it just as much as I did!",
   "This institution is a blessing to the cultural fabric of the Omaha metro region. Profoundly important works of art available for free viewing by the public is not available in all communities. But here, it is provided and treasured by both locals and visitors. Thank you to the board of directors. We are in your debt.",
   "Loved it! We were under some time restraints so didn't see as much as we wanted. Will be back as soon as possible to spend some more time. Gift shop was also neat and picked up some great items.",
   "Beautiful, well kept museum. Best part is 95% is FREE. The other 5% would probably be for a new exhibition that just opened where you have the option to pay for that or just do the regular free area. It's also very large with many rooms and a cafe there for you to grab a bite so everything is very convenient. Staff at the front desk were very nice",
   "If you’ve ever been to the Freemason temple in Holborn, London it gives the same vibe.  I wish we could have so more time contemplating the images. It was a wonderful way to spend an afternoon. The quantity of paintings are only exceeded by the quality of master paintings. And sculptures.  We had a good time and we talked about the paintings, art, and history."
  ]
 },
 {
  "name": "Omaha Children's Museum",
  "address": "500 S 20th St, Omaha, NE 68102, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c5133e46-9331-11ea-a74e-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "kids",
   "creative",
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=8873895000456808741",
  "source": "GoogleMaps",
  "reviews": [
   "This place is perfect for kids. It's handicap friendly with tons of things for kids to experience. \n  Second level has a small food court bring your own lunch or buy something there. \n  The workers were so nice and smiles could tell they were all-in to making sure the kids had fun and stayed safe.\n   The bathrooms were nice and clean.",
   "This is a great children's museum. It may not look that big on the outside but it is amazing how much there is to do. Our daughter could spend hours here (and we often do). Each space is very thoughtfully designed to be engaging and educational in addition to entertaining. Many activities are as much fun for the adults as they are for the kids. This is one of our go-to activities when our little girl has some energy to burn.",
   "Amazing facility and amazing staff! They go above and beyond for the love of all the kids that visit. Love the different station options, specifically the career area, the ball room, face painting, and most definitely the train upstairs. The multiple ways our kids get to be creative here makes us wanna go all the time.",
   "The Children’s museum is always a great place to take the kids and spend the entire day. The variety of stations keeps us moving and attracts all different types of likes. Our 5 year old son and 3 year old daughter have different interests yet they manage to enjoy the entire time. The upstairs exhibits are always changing so the thrill always remains.",
   "So much to do!!!! Kids loved it!!! The only reason I didn't give it a 5 is because adults are charged the same price as the children ($14) and there isn't much of anything for us. In the dinosaur exhibit area, all of the parents and grandparents were just standing around. Plus the train and carousel are a separate charge. Other than that it's pretty cool."
  ]
 },
 {
  "name": "Chalco Hills Recreation Area",
  "address": "8901 S 154th St, Omaha, NE 68138, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c576e262-9331-11ea-8742-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=16483752165392004980",
  "source": "GoogleMaps",
  "reviews": [
   "I go here all the time. The trails around the lake are awesome. I think something like seven miles worth of trails.  Great for biking and running.  The best part about this place is their dog park.  It's my dogs favorite place in the world.",
   "Chalco is perfect all year round! We spent a lot of time in the summer and fall kayaking. It has a boat ramp with easy access to get the kayaks in the water.\n\nThere is also an 8 mile loop around the whole lake. Tons of greenery, shade, picnic areas, grills, playgrounds, paved trails, non paved trails, and restrooms!",
   "Soccer fields are great, in good condition, great place to go kick a ball around. Also a great place to go biking and hiking there is lots of beautiful trails. This is also a great place for photography if your a photographer or just wanna have some family pictures. I would recommend going here.",
   "I love coming here. I take my pup all the time and everyone here is so nice!",
   "We love Chalco! We bought our dream home that backs up to the Chalco trail and we love it! I have a bee hive back there that makes the best honey you will ever taste.... the park is amazing and we have a lot of fun back there!!"
  ]
 },
 {
  "name": "Joslyn Castle",
  "address": "3902 Davenport St, Omaha, NE 68131, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c5d7a036-9331-11ea-8cf5-14b31f159f22.png",
  "tags": [
   "tour",
   "kids",
   "history",
   "history",
   "tour",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=16478534962615174929",
  "source": "GoogleMaps",
  "reviews": [
   "Wow! What gorgeous history right here in our city. As a military child I had the privilege of living in England, visiting their historical places. I was so blessed I always wish to take my kids one day. Don't overlook this gem my 11 and 12 years old boys loved the tour!!",
   "The castle looks lovely. Our guide gave a thorough history of the rooms and grounds. Seeing the restorative process gave me a sense of grandeur. \n\nChildren and adults alike can enjoy this wonderful Omaha landmark.",
   "This is seriously one of the best places you could ever take a tour of. One of Omaha's gems, the Joslyn Castle is a thing of history and beauty, taking a tour here takes you into the amazing lives of the Joslyns and what great people they were and the huge part in they played in Omaha history. Whether you're attending a party or just taking a tour, you will NOT BE DISAPPOINTED! Please. Everyone must go here!",
   "Five stars for architecture.\nThree stars for lack of your time.\nFour stars is the average 🙂",
   "Outside path was alright, and the construction looks very cool. I wish they would have more access to the inside rather than just a couple times a week on a tour."
  ]
 },
 {
  "name": "Heartland of America Park",
  "address": "800 Douglas St, Omaha, NE 68102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c6210590-9331-11ea-8a3b-14b31f159f22.png",
  "tags": [
   "food",
   "kids",
   "walk",
   "free",
   "nature",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=16812472256757104255",
  "source": "GoogleMaps",
  "reviews": [
   "Such a very beautiful place. An absolutely beautiful place to visit. The tropical garden area is my favorite by far. There are lots of good food options available as well!!",
   "Such a beautiful relaxing place to go. The kids love going here and then taking a jaunt to the pedestrian bridge. It's generally very clean and very well taken care of.",
   "The wife liked how scenic this park is. To me it was just a very long walk just to see the river. And it could use more benches for enjoying the view. Wasn't a free seat when we were there. Popular jogging venue. Ample parking.",
   "The fountain is absolutely beautiful. The pathways are a really great way to spend time with your loved ones and nature while exercising. It's a great use of tax dollars at work for once. We took a ride on the boat $4 per adult it was great. The Gondola is $25 per couple that's a romantic way to spend time with a loved one(or propose)to the one you love. In the moonlight at the lighted fountain as it puts on it's light show.",
   "Such a pretty place to take pictures, walk around, and take a boat ride. The ConAgra fountain is also amazing!!"
  ]
 },
 {
  "name": "Fontenelle Forest",
  "address": "1111 Bellevue Blvd N, Bellevue, NE 68005, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c67b165c-9331-11ea-8370-14b31f159f22.png",
  "tags": [
   "nature",
   "walking",
   "family",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=17171620644885739058",
  "source": "GoogleMaps",
  "reviews": [
   "I am a big hiker and love the outdoors so spending time at Fontelle forest just makes my heart happy.   The people that work here are so friendly and helpful.   Walking on the boardwalk is a great way to get exercise and being surrounded by trees and my love of animals is always a great day for me.  When the weather is good and the trails are not too muddy I am always in the forest hiking.   There is nothing better than being with nature and the only sounds you hear are the birds and the leaves blowing with the wind.  I  would definitely recommend this place to everyone.",
   "Fun and great exercise for the whole family. We've had a membership since our son was a baby. We'd use the stroller on the boardwalk while our son took his nap. Fast forward to 4 years later, it's perfect exercise for the whole family and tires him down  before his naptime. If we want, we can go off of the boardwalk and explore the trails. When we remember, we bring our binoculars to check out the wildlife. A hidden gem in Bellevue.",
   "Surprising hidden gem in Omaha. really great system of trails, also has a very nice boardwalk that can be walked by all ages, wheelchair accessible. The raptor refuge is also very cool and educational. Would definitely recommend. \nHad an amazing-looking ropes course, did not get to go on at myself but it looks like a lot of fun.",
   "I love coming here to walk through the trails. A good variety of trails, but I would not encourage taking most trails with smaller children. Stay on the main path if you have small children. The staff is always super helpful in explaining the rescue birds and animals that have recently been brought in for recovery. A great place to teach children about how we should respect predatory birds because of the major role they play in the ecosystems of Nebraska.",
   "The best place. The boardwalk is kept clear in the winter, every other season is pure magic 💗 Go by yourself, with a friend, or with the whole family! Extremely low rates for yearly memberships! Had a membership for over 15years with no regrets 👍"
  ]
 },
 {
  "name": "Homestead National Monument of America",
  "address": "8523 W, NE-4, Beatrice, NE 68310, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c6d6ac7a-9331-11ea-9915-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "historic",
   "knowledgeable",
   "free",
   "walk",
   "walk",
   "unique",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9563974684597526079",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice historic site. Smithsonian quality layout. Very knowledgeable staff.",
   "The FREE Square Dance Lesson was awesome, the rangers were knowledgeable about the monument and the areas around.",
   "This is the plot of the first homestead. It has an inside museum, and attractions outside such as a cabin and farm equipment. There is an education center, and an old school building that is part of this center as well. There are many trails going through the prairie that are very well kept and pretty to walk along. This makes for a perfect stop during the day, but I would recommend bringing some water with you when you are on the trails, as the closest building can be as far as 1.5 miles away. Also bring sunscreen, as there isn't much shade on the prairie.",
   "Worth the stop!! Beautiful, clean, educational. This place is for all ages. You can spend as little or as much time as you want here and it's free.  The inside has several displays and a well done video. The young man working did a great job explaining the history of the site and the unique architecture of the building. You can walk a few yards from the building and see an actual settler home. Worth the stop!",
   "Visited for the solar eclipse as the monument site was perfect viewing. Bill Nye was there, can’t beat that. The site itself has a nice vantage for the surrounding landscape and the exhibits are very informative about homesteading and what the first settlers had to deal with to survive. Sobering."
  ]
 },
 {
  "name": "Omaha's Henry Doorly Zoo and Aquarium",
  "address": "3701 S 10th St, Omaha, NE 68107, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c72cbbf4-9331-11ea-b2a9-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "kids",
   "family",
   "affordable",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=1359054768198154345",
  "source": "GoogleMaps",
  "reviews": [
   "This has got to be one of the best zoos I’ve ever seen. We definitely walked 5 miles that day and we still didn’t get to see everything. It was an amazing zoo. It was during the winter time and the animals were in a different habitat that kept them warm but we still had such an amazing time and can’t wait to go back in the summer to see them in their normal habitats. Be prepared to pay anywhere from $10-$20 per person for food. But the admission is well worth it!!",
   "Amazing zoo that is affordable, fun, family friendly, and easy to walk. The annual pass is a steal if you have younger kids. Lots of events for both families and for adult's only.\n\nThe zoo is world class and it shows. Having visited several other zoo's across the US I can say that it is definitely one of the largest I have visited. The domes are amazing and really help to set the zoo apart from others. \n\nThe train and tram are great ways to relax and see some of the zoo. I only wish you could add unlimited rides to the pass.",
   "Amazing place! Truly deserving of being one of the best zoos in the world. They are adopting better display practices by keeping large cats in much larger exhibits and have done well in their newer Asian Highlands exhibit. The aquarium is stunning and a more recent trip to another country's top aquarium helped to cement how amazing of a place we have in humble Nebraska. The zoo is always exciting, no matter how many times I've been. I will admit though, there is a lot of walking and in a Nebraska heat, you want to be sure to be hydrated, avoid clothing that will chafe, and have good walking shoes.",
   "We arrived at 12pm. \nWe started at the desert dome. That alone was sooooooo gigantic. And it took us close to an hour. \nWe ended up leaving at 6. Everything was closed already.. we didn't even get to see everything.\nThe zoo itself was absolutely AMAZING and I can't wait to go back when it warms up!!!",
   "This is the best zoo I have ever seen.  We couldn't see it all in one day as it is so big.  Everything is so well taken care of and it is clean.  The animals have great spaces to roam around in. Highly recommend this stop to anyone visiting Omaha."
  ]
 },
 {
  "name": "Bob Kerrey Pedestrian Bridge.",
  "address": "705 Riverfront Dr, Omaha, NE 68102, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c78abac0-9331-11ea-9c62-14b31f159f22.png",
  "tags": [
   "unique",
   "art",
   "walk",
   "knowledgeable",
   "family",
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=8847225787680139487",
  "source": "GoogleMaps",
  "reviews": [
   "Unique for me to cross between two states on a bridge over a river. It's not your typical bridge, it's not straight it is serpentine and very well lit with alternating colors. It is a must see if your ever in Omaha, Nebraska.  This city has so much public art to see. I love this town and its community of flavors and and events that keep me coming back.  Two thumbs up. See you soon.",
   "If your passing through it's a cool place to stop.  The idea is a good one even if the amount of \"wet lands\" they are attempting to \"preserve\" is no where near the amount necessary for having a positive impact on the natural wildlife. It's great to get people to take notice and hopefully care. Only sad part is the name plates in front of the plants at the NE side are wrong. Kinda would have thought someone should know the differences between types of oak trees and tag them for the public correctly.",
   "What a great bridge to walk with the family. The kids think its so cool when your in two different states. Nebraska/  Iowa #theBob. The Lewis and Clark Ranger station was great! The staff was friendly and knowledgeable.",
   "This bridge is awesome. It's so fun to walk on and I love Bob's social media presence. And now that he has a troll, what could be better?!",
   "Such a beautiful place to go anytime, I always enjoy coming here to clear my head. At night the lights change colors and you can see some beautiful places all over the city. They have a new troll that is by the bottom of the bridge make sure to take a picture with it and check him out! Great place to come as a traveler and be able to stand in two states at one time."
  ]
 },
 {
  "name": "Lewis & Clark Landing",
  "address": "345 Riverfront Dr, Omaha, NE 68102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c7da88b0-9331-11ea-b600-14b31f159f22.png",
  "tags": [
   "hike",
   "music",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=10643737145547773760",
  "source": "GoogleMaps",
  "reviews": [
   "Typically beautiful spot to enjoy the river that is currently going through a recovery period due to flooding.  If you go now you can see upclose the aftermath and power of the Missouri.  Some great monuments to our service men and women and first responders down there as well to explore on a brisk hike!",
   "Love it here!! Bridge is beautiful & a great workout. Love how it is lit up @ night absolutely gorgeous ❣️❣️ The access to Heritage park is nice & really cool with the different bridges. Whole complex set up is quite convenient, you can park anywhere to get out of car & exercise or just chill listen to music, enjoy the beautiful & natural surroundings😊 Whole area is beautifully landscaped & extremely clean/well kept✨💞💯",
   "If you love being near the water, and won't some quiet time,  this is a great place to go, and a good spot is close to the pedestrian bridge.",
   "It's a really lovely spot for a walk or just to sit on a bench enjoying the view of the river!",
   "Lewis and Clark Landing is a great place to go and relax. The serenity of the riverfront view and the beauty of the bridge and statues and artwork are quite alluring."
  ]
 },
 {
  "name": "Pioneer Courage Park",
  "address": "1601 Dodge St, Omaha, NE 68102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c825265a-9331-11ea-b97b-14b31f159f22.png",
  "tags": [
   "walk",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17631052039929533160",
  "source": "GoogleMaps",
  "reviews": [
   "Best reenacting of our pioneers ancestors strugls through the mid west.",
   "Interesting but a bit small. Not somewhere you would go out of your way to visit.",
   "This is a half block sized park, so not very big. The statues are very detailed, depicting the pioneers crossing the plains. The wagon train is 5 or 6 wagons, pioneers , a hunter with a deer on his pack animal. Very nice spot for pictures, and a realistic historical display.",
   "A small but beautiful little park just on the north side of downtown Omaha. The life-like bronze sculptures capture an important moment in Omaha's time. Being just along the outskirts of the busiest part of town, it's a nice, quiet place to walk to in the middle of a work day.",
   "Very nice tribute to pioneer history and the statues were incredibly detailed. We really enjoyed this spot to visit on our way out of Nebraska!"
  ]
 },
 {
  "name": "Kenefick Park",
  "address": "100 Bancroft St, Omaha, NE 68108, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c886a7a2-9331-11ea-8162-14b31f159f22.png",
  "tags": [
   "drink",
   "history",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=18010718628213094568",
  "source": "GoogleMaps",
  "reviews": [
   "To see the 2 largest locomotives ever made up close is just amazing.",
   "Nice clean place and good view too, it has a really big set of steps so get ready for that, also has a ramp for wheelchairs!",
   "Rich in history, this monument celebrates the past and the future. \n\nThe showcase pieces include the Union Pacific Big Boy 4023 (4-8-8-4 consist)and the Union Pacific Centennial DD40AX 6900.\n\nWe didn't get at chance to check out the visitors center but we made our way to the top to drink in the majesty. There is a stopping point about halfway up that celebrates the Transcontinental Railroad meet in Promontory, UT by the Union Pacific and Central Pacific that later became the SP (Southern Pacific)'.\n\nThe placards/signs among the way share many forgotten details about both Omaha and Railroad history. \n\nWhether just passing through or wanting to see something new. This is an incredible look at one of the many things that made America great and what will keep her that way.\n\nRailroads are crucial for commerce.\n\nABC's Always Be Careful / Expect a train on and tracks at any time",
   "I love this park! It’s a great place for taking the kids and taking pictures. Our favorite part is the Union Pacific locomotives. It’s a great scene at the edge because you can take pictures! Hope you have a great time there and stay safe!",
   "The scenery is great and seems like a great place to take your children.."
  ]
 },
 {
  "name": "Hot Shops Art Center",
  "address": "1301 Nicholas St, Omaha, NE 68102, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c8cb03c8-9331-11ea-9965-14b31f159f22.png",
  "tags": [
   "creative",
   "unique",
   "art",
   "art",
   "free",
   "art",
   "walk",
   "art"
  ],
  "link": "https://maps.google.com/?cid=16494443936603903504",
  "source": "GoogleMaps",
  "reviews": [
   "Hot shops is the most amazing collaborative imaginative creative spot in Omaha! Great artist amazing facilities just  A wonderland Fun",
   "Great spot to see some unique items and talk to artists as they create.\nWe stopped in here as part of the Nebraska Passport program and I'm so glad we went in.  They were blowing glass when we walked in which was pretty cool.  We wandered through the building seeing the various types of art work and we spoke to several of the artists as they were working.  Not all of the shops were open which was kind of a drag but overall this is a really cool place to stop if you're in the area.",
   "I love the Hot Shops. Such creativity and inspiration can be found there. The open house events on the last weekend in April and first weekend of December are not to be missed as every Artist has their studios open and art work for sale. But the building is open 10-4 everyday and the anchor studios on the main floor always have something happening.",
   "More than just a gallery or two of finished art, this place is a hive of activity of working artists creating in real time. With more than fifty studios hosting 80 or so artists, you might be able to watch painting, violin making, glass blowing, sculpting, quilt making, pottery throwing, or jewelry making during your visit. And it's free.",
   "three floors of art studios of all stripes. If you feel down go there and walk the halls. You will see something that will make you smile and meet some great odd and interesting people."
  ]
 },
 {
  "name": "DISH Restaurant",
  "address": "1100 E O St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c913f3dc-9331-11ea-ab34-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6135969660854827014",
  "source": "GoogleMaps",
  "reviews": [
   "One of the good places I had dinner at in Nebraska. The service was great and the food too. They have a changing menu according to the season and always have fresh supply.",
   "Picked up a family meal last night of red wine glazed short ribs, kale salad, risotto, focaccia bread and a (GF) peanut butter/chocolate chip cookie. The huge chunk of short ribs melted in my mouth because it was exquisitely prepared! Every little detail provided something of great value, such as the thyme oil (antiviral!) and more. Even the moist cookie, ideally flavored, was beyond what this cookie-lover has achieved on her own! The only place I have experienced such a perfectly cooked piece of meat this size was in a 4-star restaurant in Montreal. We are fortunate in Lincoln, to have a gem like the Dish restaurant!",
   "Dish is the best restaurant in Lincoln in my opinion. I appreciate that they have a seasonal menu that changes based on the availability of fresh ingredients--something I'm not aware of any other restaurant in town doing. Well worth a visit and worth every penny. They also have excellent cocktails.",
   "I’m glad I tried it once! I took my boyfriend for a birthday dinner. The atmosphere was nice and the one entree I’d give a 4/5 to, but the other only a 2/5. \n\nGiven the larger price tag associated with DISH, I expect more. I should either be blown away by the food or at least be really full at the end of a $150 meal. However, I wasn’t blown away by the flavors and I was still hungry. It was definitely fun to try out once, but I do not think it’s worth the heftier price tag.",
   "The best meal we have had in a few months...great service too.. plan on the mussels again on Wednesday"
  ]
 },
 {
  "name": "Piedmont Bistro by Venue",
  "address": "1265 S Cotner Blvd Ste 38, Lincoln, NE 68510, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c95d2964-9331-11ea-bd58-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "knowledgeable",
   "food",
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16537523299486133913",
  "source": "GoogleMaps",
  "reviews": [
   "Always a great experience at Piedmont Bistro.  Some would say that my lunch would be hard to \"beet\". The  beet fries were amazing and the goddess salad with salmon is always spot on!",
   "This is a definite date night place for your spouse. Great food. Local drafts and wine specials make this a great neighborhood bistro. \n\nOrdered the Honey Glazed Chicken and Homemade Potato Chips. \n\nHoney chicken was excellent, served with Asparagus, pickled heirloom radishes and carrots and wild rice. The chicken is super flavorful and the honey glazed mixes well with the pickled veggies. \n\nHomemade Potato chips are essentially pub chips with sea salt and peppercorn pepper with a hint of vinegar.  Comes with a french onion dip that is also homemade. A great pairing with a White Elm Elm English Stout on tap.\n\nGreat and friendly servers, definitely a great atmosphere with patio outdoor seating in warm seasons. \n\nDessert tray looked amazing with lots of chocolate options at the time of review in late Dec 2019.",
   "One of my favorite restaurants  in Lincoln. The food is delicious and the service is exceptional. I always ask for NATE , He is an excellent server, very knowledgeable of the menu and very attentive. Went tonight for their anniversary dinner, everything was delicious and Nate was awesome as usual .",
   "I am never disappointed when I eat there. The food is delicious and expertly presented. The wait staff very attentive. Highly recommend you give it a try.",
   "Loved the environment. The food was great and decently priced. Can make this a regular spot!!!"
  ]
 },
 {
  "name": "Vincenzo's Ristorante",
  "address": "808 P St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c9a5dff0-9331-11ea-ae1f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16894294249031094554",
  "source": "GoogleMaps",
  "reviews": [
   "First time here and was craving seafood. Presentation was excellent as you can judge in the picture had the stuffed shrimp, shrimp was good but over the most bland simple pasta, tasted just like it was taked out of the boiling water. Not at all impressed. Not interested in returning",
   "What a wonderful dining experience! The timing of our apps, soups and entrees was perfection. Not to mention how delicious it all was! LeAnn was our waitress and she was very kind and gave us great service!",
   "Wow!  I had an incredible time tonight.  This was my first time and I came based on the recommendation of a friend.  Vincenzo's totally lived up.  I started with Crab Stuffed Mushrooms, they were incredible.  I also had the Baked Lombardi!  Fantastic flavors!  Can't wait to come back.",
   "Fantastic service. Great attitudes. Wonderful pasta!  A new goto for me.  And prices were very fair/generous portions.  Thank you.",
   "I usually have a phenomenal experience at this place. Came in and ordered take-out. Lady was very nice taking my order and tip. Then when she brought the food out, she essentially dropped it and ran away, not allowing me to ask if everything was there. We get home to discover something I had requested was not in the bag. I call to address this, and the girl on the phone clearly doesn't know what to say/do. She then, while LAUGHING, tells me they'll \"improve their procedures\". Will NOT be returning any time soon."
  ]
 },
 {
  "name": "Engine House Cafe",
  "address": "6028 Havelock Ave, Lincoln, NE 68507, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c9f98106-9331-11ea-8d65-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "family",
   "delicious",
   "family",
   "food",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12730547371741864888",
  "source": "GoogleMaps",
  "reviews": [
   "My first experience at Engine House Cafe was a great one! I came here with my family for brunch, and although it was quite busy, we were able to get our food in a timely manner. The food was delicious, and the atmosphere was welcoming. We will definitely be coming back.",
   "I love stopping here for breakfast! The staff is so nice and makes you feel like you're family. It's always busy and full of people which makes it feel cozy, and the decorations give it the feel of the old Firehouse.",
   "Come on come on to the engine house cafe. A wonderous idea and a breakfast for those seeking a hearty and rewarding investment. The service, the food, any atmosphere make for a tradition one may start for their family.\nHavelock is home to many great businesses in Lincoln Nebraska. Engine House Cafe is just a great example of what a community can make of itself.\nNo matter which food item you choose on the menu I assure you a delicious meal. The service is just how you would expect stellar and real. Your servers main priorities are your comfort and satisfaction. \nIf you're in Lincoln Nebraska and looking for a stellar breakfast or lunch, then go to engine house on Havelock avenue.\nwith that being said the one downfall of this establishment is the size and capacity. This does not in any way take away from the quality of this establishment. my one recommendation for this business is expansion. I expect my five-star rating with engine house to hold its presence here on Google as well as in my opinion.",
   "This is possibly the best breakfast dish, ever. Bacon Avocado Eggs Benedict. There is a good reason Engine House is one of the best breakfast places in Lincoln.",
   "Great atmosphere, cool history, amazing food. The service was also unbelievably fast. Like ask for something boom it's there in front of you. The greeter lady was having a very bad day apparently because she was in a very short and rude mood, but the waitress was amazing. My new favorite breakfast place!"
  ]
 },
 {
  "name": "LeadBelly",
  "address": "301 N 8th St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ca484038-9331-11ea-b7a7-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "tour",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8359109761086721231",
  "source": "GoogleMaps",
  "reviews": [
   "This is my go-to for interesting burgers in town (I'm not a fan of Honest Abe's, and Five Guys is my place for a basic burger). This place has a great atmosphere, great food, and it comes out pretty quickly. (Side note: The queso is excellent)\n\nHowever, service felt very impersonal, she got everything right, but there were no extra words exchanged beyond just ordering and paying. Their system using tablets to order and pay makes me feel like I'm talking to someone on their phone when ordering and kills the personal experience for me.\n\nOverall great food, but the service was basically just a mobile cashier, not a true server.",
   "This place is FANTASTIC! The Peanut Butter Stout was incredible! Being from Texas, this place is definitely on my places to eat again! Service was awesome and our food got to our table in about 10 minutes!! I will definitely be back!",
   "Chad was our server and was so nice and informative as it was our first time there. My sister in-law, niece, daughter, and I were in town for the NKOTB Mixtape Tour and heard it was great food from a friend. You guys did not disappoint! I had the Royal Mountie burger and it was killer good! Thank you all for wonderful food and excellent service. We will definitely be back!",
   "Went here on a Sunday night,  friend recommend it. Boy was he right. If you are hungry, I would suggest the Full leaded jacket. It is literally what every midwesterner likes..chili and cinnamon rolls but with a burger and fries..man it is worth try. the wait staff know all the beers on tap so that was good to hear since not all places do that",
   "Service was really good! I ordered the cowabunga burger, it was excellent!! Beer was cold which made my day!! P.S the atmosphere was great!!"
  ]
 },
 {
  "name": "The Oven",
  "address": "201 N 8th St #201, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ca940546-9331-11ea-919a-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5051666495540397850",
  "source": "GoogleMaps",
  "reviews": [
   "Arguably the best restaurant in the city. Hands-down the best Indian restaurant in the city. Food is always incredible and never once have we had a disappointing experience. Service is excellent as well. \n\nThe Cellar is not to be missed in the basement. It's a great option to have dinner (same kitchen as the restaurant), or just to enjoy their wine list (which is the best in the state) and cocktails.",
   "Food was very delicious. Thoughtfully and quickly prepared. Amazing service. Always had our water filled up. Will definitely be coming again.",
   "I have eaten here maybe 3 times in 10 years but the low number of visits has nothing to do with the taste and quality of their food. This place is amazing! This last time we stopped in the waitress was very helpful; she explained everything we asked about which was a lot since I'm not very familiar with Indian food. She interacted with my 2 year old daughter and made our dinner a great one. \n\nFor lots of reasons this is a great place for a family dinner",
   "Honest review being an indian.. Not so authentic flavor, Lack of traditional ingredients.. I would say more America touch rather than Indian flavor.. when you take order please listen carefully and try to give more options.. appetiser Tandoori fish comes with 2 piece and box of rice???",
   "Admittedly, I am not usually into Indian food. But my partner has had a fair share of Indian food and with all of the incredible reviews we decided we had to try it. We got the equivalent of a sampler meal and one of their appetizers with some extra naan. We kind of just felt like all of it was really over priced. And my partner felt that it wasn’t even particularly awesome food. But it has a nice atmosphere and the presentation was good. I don’t have enough comparison to give it less than 3 stars, but I also wasn’t impressed enough to give it more."
  ]
 },
 {
  "name": "Parthenon",
  "address": "5500 S 56th St # 8, Lincoln, NE 68516, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cad7423a-9331-11ea-8d78-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "food",
   "delicious",
   "food",
   "free",
   "food",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=15919279673982623847",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food!  Great service!   Server was very knowledgeable about allergens and the food in general.   She had an amazing sense of humor!   Loved loved the desserts!   So big and decadent!   Also as some of my other posts show bathrooms are very important and this one was pretty good.   Smelled nice and didn’t feel like you are trapped in a too small box.",
   "Cant beat the flavors and the dessert selection. If you want a wonderful meal with lots of food, check it out. We even took home a quart of baklava ice cream. The texture was a little more like ice milk, but flavors were good. \nFor dinner, the lamb, the dolmathes and the pastitsios were super yummy!",
   "Yummy yummy yummy! This is one of my favorite restaurants!! It is never bad! Food is always delicious!! Service is always so wonderful! It is a very comfortable atmosphere and reasonably priced!! Also best deserts in town!! Yummy!",
   "Food is quite good overall, ordered pikila for an appetizer which comes with pita and three choices of dips.  Portions were off in my opinion as one dip gets a large bowl while the other two were large spoon sized served on the side. Their version of \"plenty of pita\" and my version are very different in the appetizer.  Certain drinks even have a one free refill limit.  My overall impression is that the food is good, service is good, but just the \"nickel and dime\" feeling for extra cost on refills, the small portions of pita is a real bummer.",
   "Always love the Parthenon. You cannot beat the quality & service of this restaurant. The vibe is upbeat & someone is always ordering the flaming cheese appetizer, Opa! This past visit we called for a take out. We selected the delicious Gyro Family Meal. The order comes with gyro meat, pita bread, sandwich fixings (lettuce, tomatoes, onion & clitharacki sauce), plus choice of 2 sides. I always ask about Chef's veggie choice, and was not disappointed this time with Greek style green beans (beans sauteed in garlic with onions & tomato sauce). Highly recommend this restaurant."
  ]
 },
 {
  "name": "HopCat - Lincoln",
  "address": "601 P St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cb2feb30-9331-11ea-a335-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12717036448653236314",
  "source": "GoogleMaps",
  "reviews": [
   "What can i say ! I am speechless . . . \nUnbelievable experience , the place is cozy and i  loved the decoration which is fabulous. The staff are so nice when they welcomed us gently About the food, I nearly tried most of the menu just to get taste of the food and be able to give such a review.\nHopCat deserves another visit!",
   "Well second time at hopcat.. wasn't impressed. I shared a burger, also got the dipping sauce that was an extra $1.25, that expensive for sauce, normally it $0.50 \nsoany where,  basically she introduced/ Cheese, or ranch because it really good, was never explain that there was a cost. I also asked why there was a charge for the cheese.. and completely avoided. So company paid for her tip.... Took a long time to check on us. And when finally ready to pay after the questioning of cheese she walked off, had to wait even longer., I clearly had my wallet out, she took off.  Also she try to ask if we wanted more drinks, before we got checked out. Why give me my receipt ,after all that. Shoot if there was a negative chart, this be top pick.",
   "Great beer selection,  modern friendly atmosphere. Priced fairly for the area and quality. I wish they had a little more variety in the menu though. Burgers, sandwiches, appetizers. Some unique takes, but still kind of limited. Either way,  it's a fun place to grab s drink and a bite from time to time.",
   "As is frequent, it was a busy night in the area, and our crew visiting from KC was looking for a place for adults and our young teen athletes. Nailed it! We ate well, fueling up for the next day, and the adults enjoyed the respectable beer selection. Also, Faith was amazing.",
   "Been here three times now and it never disappoints.  Great local beer selection, and the food is on point.  The fries are amazing and make sure to get a side of cheese sauce.  Our server Donny was amazing to our whole table.  Great personality and enough edge he kept us on our toes the whole meal."
  ]
 },
 {
  "name": "9 South CharGrill",
  "address": "844 South St, Lincoln, NE 68502, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cb927dda-9331-11ea-895f-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "drink",
   "free",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13563116692230008276",
  "source": "GoogleMaps",
  "reviews": [
   "Never been. Amazing food. Servers were great. They might have been a bit under staffed and/or a bit slammed when we got there. We had reservations, we had a table, but the rest of the restaurant was packed. Worth the wait. I had mac and cheese with steak, awesome. Will definitely be back.",
   "I came here on a Wednesday night around 7:45. The dining room was busy but full of vibrant energy. Even though they were busy I was greeted promptly as I entered the door and was readily able to grab a menu. I ordered the Jack's BBQ bacon burger to go and was offered a drink free of charge while I waited. (I'm assuming it was free of charge as I'd already paid for my entree but I only got water so perhaps I would have been charged if I'd gotten a soda). The burger I ordered medium rare was indeed cook to perfection and tasted delicious! The staff was super friendly and offered me sauces on the side right before they bagged up my meal and handed it to me. An excellent Lincoln locale I would recommend to anyone of my friends!",
   "An excellent restaurant off the beaten path. Excellent food, great service, good prices. Their menu is extensive, so whatever you're craving, they will most likely have it. During this quarantine time, my family ordered takeout to go for 9 people. When we went to pick up, there were 2 people; the owner was cooking and a young lady was taking orders. They were amazing and put such care into making sure we had what we needed. Support  local businesses like 9 South CharGrill!",
   "The appetizers were very good.  We had the crab cakes and onion rings.  The fisherman platter and 18 oz ribeye were amazing.  Service was a bit slow but it was worth the wait!",
   "We love the fries nachos here (forgot what it's actually called) . Great portions and tastes good.   When we have eaten in, we got burgers and the we're good. It was cooked to spec (we normally get medium). If getting to go, the bottom bunk may get soggy."
  ]
 },
 {
  "name": "Stauffer’s Cafe & Pie Shoppe",
  "address": "5600 S 48th St, Lincoln, NE 68516, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cc0cf71e-9331-11ea-9275-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8488331437137030870",
  "source": "GoogleMaps",
  "reviews": [
   "Best breakfast in town. Bring your appetite! Local owners and fantastic service. Get breakfast and a pure to go.",
   "I went to Stauffer's cafe and Pie Shoppe for lunch/but ended up eating breakfast instead.  I found the breakfast to be delicious. My compatriot has the meatloaf and said that it was amazing, much better then she thought it would be.  My goal was to try the french silk pie as I am a big fan of that pie, but I was too full.  The only thing that brings the review from a 5 to a 4 is that the restaurant was too full, and that it took longer then what I determine to be an average time to get our order placed, but once it was placed the food came quickly",
   "Stauffers is that down home cooking you crave.  This is easily my favorite breakfast spot in town I like the number 3 with eggs scrambled, BACON, substitute french friea to replace hash brown and white toast! I don't do much sweeta myself but pies and rolls here are absolutely fantastic. True Lincoln treasure be sure to give it a try!",
   "If you want comfort food and an amazing slice if pie, this is the place to go. In the city, with a home town atmosphere, makes you feel like your back at grandma's kitchen table.  Enjoy a good meal and let your mind wonder to your favorite memory.",
   "Food is always very good here.  Cold winter morning.  I think food sat way to long before it was brought as it was cold, the rest of us breakfast was also cold.  just ruins going out for breakfast."
  ]
 },
 {
  "name": "Toast",
  "address": "570 Fallbrook Blvd #105, Lincoln, NE 68521, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cc4ce682-9331-11ea-b95b-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=16133490782095231396",
  "source": "GoogleMaps",
  "reviews": [
   "I was very pleased with this place. The staff was good and very informational. We got a table for 4 immediately. They had a decent selection of beers of draft. I had the Santa Fe Burger which was delicious. It would have been near perfect if it had a bigger patty, it was cooked a little dry, but the flavor and spices were on point. The fries were much better than they looked. \nMy girlfriend had the steak Mac n Cheese which she loved. We will be going back for sure.",
   "Good quality ingredients, but many dishes are very spiced, so much so that you can't appreciate what you're eating, the salmon cakes, for example. The greens are well dressed though and the cranberry - orange bread pudding has a great texture and balance of sweet and tart. A bit pricey, usually average $25 a person without alcohol.",
   "Had my first martini... Delicious... Server pleasant... Pretty fancy for my taste but definitely worth going back.... Felt like I was on vacation in some trendy city!!!",
   "Great place for a casual lunch,  dinner,  or brunch. Has outdoor seating and a full bar. Menu has great American cuisine in big portions and excellent desserts. Try the fried green beans as a appetizer, you won't be disappointed.",
   "This place was awesome! I haven't been this excited about a restaurant in a long time. It might take a little bit to find it, it's located in Fallbrook, but it's worth the trip. The place was busy then we got there not full but packed. No waiting for seats and service was quick. We ordered the Pot roast Poutine as an appetizer and it came out very fast. My wife got the Fallbrook Special and I got the Smoked Salmon Club. Both sandwiches we're good but the Smoked Salmon Club was the best. The salmon just melted in my mouth. We had the bread pudding for dessert and it was great as well. The price for everything is very reasonable too."
  ]
 },
 {
  "name": "Mellow Mushroom",
  "address": "601 R St #110, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cc9e3b0c-9331-11ea-8d5a-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "free",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=14608671042848631447",
  "source": "GoogleMaps",
  "reviews": [
   "Unusually busy evening, had to wait for our food.  Food was amazing.  Our waitress was diligent.  The manager made our evening memorable.  Especially for a birthday dinner that started rough, she got the birthday boy to smile more than once!!  We will be back!",
   "So good! Amazing food! Great service!! I'll definitely be going there again. Even better, someone told us to get as much alcohol as we can in before the concert since its even more expensive there. It was awesome!!",
   "Really fun funky laid back atmosphere and easy going staff made for a good relaxed night for excellent pizza, salad  & beer on a stormy evening.  Everything was extremely fresh and well presented.  Beer was nice and cold. And finally a place that isn't afraid to give you napkins, especially when you're eating finger foods.  Diverse menu with something for everyone.  Prices reflect the quality and freshness of our food and worth the price.",
   "Mellomushroom is a gluten free friendly and vegan friendly option. They have vegan cheese as well. The service was excellent. Parking is tough if you go on a busy night and you might need to use a garage. I do not know if they validate parking. My only complaint is that the last few times I have been to this location I have noticed that the bathroom sinks are not working properly.",
   "We LOVE this place. We live in Omaha and will drive out just to eat here. Best calzones you'll ever try! Naomi was a fantastic server and was very attentive! Despite the restaurant being busy, she got us a great table and took great care of us. Thank you Naomi!"
  ]
 },
 {
  "name": "The Green Gateau",
  "address": "330 S 10th St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ccf1b264-9331-11ea-abe9-14b31f159f22.png",
  "tags": [
   "delicious",
   "walk",
   "food",
   "delicious",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15333691673528087242",
  "source": "GoogleMaps",
  "reviews": [
   "There are a number of good restaurants in Lincoln, but very few that are as awesome as The Green Gateau.  We have dined here for breakfast and lunch but not dinner. There were 6 of us dining on Valentines Day evening and were seated at a round table in a room towards the back of the restaurant. We ordered everything from an appetizer to desserts with each of us ordering a different entree and each of us claiming our entree was the best. The plate presentation was beautiful and each bite delicious!  From the beginning to the end of our dining experience our server, Alexia, did not miss a beat!  Thank you for a wonderful experience! We look forward to returning soon!",
   "The Green Gateau never disappoints. We are always greeted by a warm, gentle feel every time we walk through the front doors. We love coming here for birthday, anniversary, and Valentine's day meals! The staff is always very nice, and eager to help with wine tastings & selections. My 25th birthday was capped wonderfully with a fantastic meal at the Green Gateau. Like always, thank you for a great evening!",
   "Holy cow... absolutely wonderful breakfast.  I'm not what I liked best,  the lobster Benedict, duck hash or gourmet french toast.",
   "Friendly staff. Awesome food. Cozy atmosphere inside. And prices are great for what you're getting.",
   "Fantastic dining establishment. Had a private event on a Friday evening; service was top notch, food was beyond delicious, and all entrees arrived at the same time. Great appetizer selection, huge variety of flavorful entrees, and desserts put you in a coma. Vegeterian options, great drink selection, and casual atmosphere. Treat your SO to a great 3 course meal, or get together for an event. I will 100% be returning to this establishment. Get the signature Green Gateu Dessert!"
  ]
 },
 {
  "name": "Rodizio Grill - Lincoln",
  "address": "737 P St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cd41a76e-9331-11ea-a6eb-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2605599159103092491",
  "source": "GoogleMaps",
  "reviews": [
   "Been there twice and had a great experience both times. Their salad bar is great and is a perfect meal, in itself!!! Went when they had the game meats and had some interesting selections!!! My favorite was the rattlesnake sausage. Meats are well seasoned and cooked to perfection!!! Grilled pineapple is out of sight!!! Friendly staff and great service!!! Be sure to give yourself lots of time to dine here!!!",
   "Fantastic food.  We came here on a date night before my girlfriend had a pool tournament and the food was amazing, the staff was friendly and welcoming, and the restaurant was clean.  This was an experience well worth it and I look forward to coming back again.",
   "A great place.  Lots of great food.  The waiters come and cut off the meat at the table. They have a great salad bar.  Very relaxing dining",
   "We went for valentine's day.The food was good and we loved the atmosphere. The only negative experience was the service. I could have attributed this to the busyness of the restaurant with it being such a busy night but most of the tables were empty when we were there. We had to wait and wait until we saw our waitress and then remind her of things that we had asked for more than 15 minutes earlier. My fiance never got the drink he ordered and were in the front area of the restaurant. I may give it another chance but I'll probably just move on and give somewhere else a shot.",
   "This is a high quality restaurant. All of the staff are friendly and there is food for everyone."
  ]
 },
 {
  "name": "Buzzard Billy's",
  "address": "247 N 8th St Ste 101, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cd9c23b4-9331-11ea-b728-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "drink",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1972377436312360848",
  "source": "GoogleMaps",
  "reviews": [
   "Fabulous food.  It's been along time it seems since we ate out.  We used the delivery service which was perfect for us.  Everything was perfect.  Thanks for being there.  Wonderful ❣️",
   "Good food.  Pretty good atmosphere. Little on the expensive side for some of the dishes.  A couple of the Cajun combinations were just a tad on the bland side....a little more spice is in order for those of us who know what it should taste like.  Nonetheless, the place was clean, and the service was as it should be.  Would I forget the name of the place....probably. Just  nothing that yanks you back in repeatedly like the Cajun dishes at the Jazz in downtown Omaha.  But, in all, if I was in the area, I'd visit Buzzards again.",
   "So glad I stumbled into this place! Great food and drink menu. Eclectic decor. TVs for the sports fanatics. Got a table before the dinner rush, but when we left it looked like quite a wait. The girls and I tried each others dishes because everything looked as amazing as it sounded. Each dish was chick full of flavor. I can not wait to go back and take my husband.",
   "Great food.  Fast service.  Excellent prices.  Large selection on the menu.  What more could you want?  If you're in Lincoln, I definitely recommend this place!",
   "Experience and food were amazing.  Cat dazzled my friends and I with great service and a sweet scrumptious smile. What a great escape to the bayou.  I felt as if I was in the swamps of the south. I’ll be back to see the southern kitten, what a pleasure to experience the smooth purr of such a fine feline. \nThe cats Meow."
  ]
 },
 {
  "name": "Single Barrel",
  "address": "130 N 10th St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cde2c9d2-9331-11ea-9a06-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "family",
   "eat",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7208931988338419553",
  "source": "GoogleMaps",
  "reviews": [
   "Was just driving though town and stopped by for some dinner. The food was amazing! I got a pulled pork sandwich with eggplant chips. The eggplant chips were so crispy and delicious! I've never had anything like it. My sandwich had really good flavor. My dad got a hamburger and loved it too. I wish I lived closer so I could go back!",
   "My family and I loved it. It’s a bit pricey but you get what you pay for. Everything looked so good! We will definitely come again. My son thought he could eat a full rack of ribs, but quickly realized his mistake when the food arrived. 5/5 some quality meat and bourbon.",
   "So glad you are willing to be open for carry-out during this difficult time!  It is truly appreciated since I was staying at a hotel and had to go out to get food. I couldn'ttake another day of pizza or junk food. My steak was absolutely wonderful and perfectly cooked and the potato cakes were great too!  I will be back!!!",
   "Excellent selection of whiskies and the pulled pork is quite good.   The ribs and dirty rice were over-cooked, but their flavor was good.  Maybe a bad batch.  I've been here before and both were tasty and much better that this go-round. I'll be back.",
   "The foods great and their whiskey selection is indeed impressive!  That being said when I entered in my last visit the host who would normally welcome the guest was asking if I was lost and if I needed something.  It came as rude and presumptuous that and being profiled came as a shock.  I was hungry and not one for confrontational and told her we're here to eat, so at least that message got across.  Food 5 starts, service needs work."
  ]
 },
 {
  "name": "Cracker Barrel Old Country Store",
  "address": "6700 N 27th St, Lincoln, NE 68521, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ce37a100-9331-11ea-871a-14b31f159f22.png",
  "tags": [
   "history",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13458127122096803845",
  "source": "GoogleMaps",
  "reviews": [
   "When I went January 1st, 2020, unfortunately someone passed out or something and 911 had to be called. All the workers, staff, and waitresses were all calm and chill about it. Our waitress Brooke or Brooklyn I don't remember her exact name was amazing. She was super nice and smiling all the time and I would definitely go again because of her! Amazing service!",
   "It's the perfect place to come for a hearty meal at a reasonable price and enjoy a warm fire on a snowy day. Other days it's still great. Hard to get seats Sunday mornings, though.",
   "The food was amazing and the waitress was the nicest. It was my first time there. So she told me the history about the restaurant and I learned some pretty cool things. The game with the pegs on the table was fun, even though the least of the pegs I could get was 4. I had a good experience.",
   "Are you a fan of country style cooking? Do you enjoy great atmosphere? Do you like your table to come with a brain teaser?? Then of course you already enjoy Cracker Barrel!",
   "Great food, great service for a great price! I had the open faced roast beef with mashed potatoes and gravy. It was delicious! I added a side of fried okra which was yummy too. I recommend this for anyone looking for a great meal!"
  ]
 },
 {
  "name": "Cheddar's Scratch Kitchen",
  "address": "5424 O St, Lincoln, NE 68510, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ce82eeee-9331-11ea-b653-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "free",
   "food",
   "delicious",
   "family",
   "food",
   "family",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18005286454871365717",
  "source": "GoogleMaps",
  "reviews": [
   "A fabulous family dining experience, but watch out this is a popular place and you may have to wait while to get a seat. The sirloin steak and sides were quite delicious. It's obvious all their food is made fresh. Even my gluten free family members found satisfying options for their meals. R didn't wait too long for the food especially considering the place was packed. I highly recommend Cheddar's for a great family dining experience that shouldn't break your budget.",
   "Our family ordered the Lemon Chicken Meal for 4 last night, with the sides of French fries, Cole Slaw, and an extra small side of Broccoli Casserole.  It came with the amazing croissant  rolls.  Curb side pick up, right on time when they said they would have it, and seriously, it was all delicious!  Would have it again!",
   "Wasn't the worst food I've had, but wasn't real good either. My daughters mac and cheese was cold in the middle like it was microwaved, and my chicken strips were very salty. So not to happy with the food considering the price.",
   "Showed up about an hour before close and the restaurant wasn't busy but it was a week night so kudos to the staff for being so quick and courteous to help me!\nMy order came FAST and it was pretty good!  The bartender was in good 'spirits' and had a smile on her face each time I spoke to her!\nWould've given 5 Stars but they did not have Free Wifi and my phone went to 3G as soon as I entered the building (1st world problems, I know)!  In a world filled with technology, maybe it's a little subtle hint from Cheddar's to enjoy family time and stay off your phones!",
   "The food quality is good. The atmosphere is awesome. The fish tank is beautiful to look at. Love the decor. Waitress was pleasant and fun. She definitely forgot to bring me my potato soup. That's okay."
  ]
 },
 {
  "name": "Honest Abe's Burgers & Freedom",
  "address": "840 N 70th St, Lincoln, NE 68505, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cecdf406-9331-11ea-827a-14b31f159f22.png",
  "tags": [
   "drink",
   "history",
   "drink",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8813339901929788909",
  "source": "GoogleMaps",
  "reviews": [
   "Honestly, It’s Good\nOn a whim, with nothing to do, I traveled to Lincoln, NE from Omaha for a day trip. When I did a search for the top ten best burger places in the area, Honest Abe’s Burgers & Freedom was at the top of the list. So, with an empty stomach and a big appetite, I went for the challenge.\nLocated on the corner of a shopping center, the restaurant isn’t fancy when you step inside, but there is a clever history timeline on the wall that you can read as you wait in line. Pay attention because there are some fun additions related to Abe and burgers written in.\nThe chalk board menu at the front of the restaurant lays out everything you may want before you give your order to the cashier. For me not only is the burger important but so is the bun. My “Greatest Burger Ever” selection was not only juicy with all the toppings that are offered along with their “awesome sauce,” but the soft, pliable bun held it all together. Since the menu is a la cart, for an additional 3.75, you can add the freedom fries, and a drink. It was a pleasure meeting Ben, who’s customer service skills were on point.\nOverall: Honestly, it was the best burger I’ve had in a while.",
   "Perfectly cooked burgers EVERY time we've visited!  Truffle fries are spot on!  Even the fountain coke has the perfect carbonation & syrup combo!  The shakes are incredible... I won't order because I'd drink the entire thing but you know I encourage the kids to order one so I can try it!  🤣",
   "As burger places go, this one seemed pretty darn good. The menu is up on the wall and there are several regular burgers and a few specials that change. The decor is quirky and features Abe Lincoln all over.\n\nMy burger came quickly and was well cooked. Special attention was paid to the toppings and the bun is high quality, so although it's a large burger physically, it stays together and is structurally sound. The fries were great, but I didn't need many of them after eating the burger.",
   "burger and fried are awesome, awesome s very tasty. meat cooks perfectly. love to see the writing menu on the wall",
   "I'm not from Lincoln but was told this is the first place I needed to come for food. I am so glad that I took that recommendation because this is one of the best burgers I've ever had in my entire life! I had the fireside Burger which consists of many different ingredients one of which being jalapenos but it was not too spicy at all don't let that scare you away. it also has toasted cumin on it which was a great addition to this burger. A must order are the parmesan truffle fries with awesome sauce. I will definitely be back and we'll try many different burgers next time."
  ]
 },
 {
  "name": "Heoya",
  "address": "3280 Superior St, Lincoln, NE 68504, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cf1bed28-9331-11ea-8e04-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "food",
   "delicious",
   "delicious",
   "eat",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=14961990521411393691",
  "source": "GoogleMaps",
  "reviews": [
   "We enjoyed what we had from Heoya! Yummy and delicious! All food is prepared when you order. The owner is super friendly and courteous! When we asked for more information regarding a couple of dishes, right away, he shared some samples with us. Even though this restaurant is located inside the gas station but we still had good time dining here. There are four tables and plenty of sitting.  The nice thing is you can purchase a drink from the gas station to enjoy with your meal. The restrooms are clean as well. We will visit again for sure! Highly recommend this place!",
   "We frequent this place almost every Friday for work... it’s great and different than anywhere else in town!",
   "This place is WORTH the hype. Hands down. It was absolutely amazing. Our group ordered the Pork, chicken, and Beef rice box and the Korean fries. Everything was so flavorful! The rice box comes with a salad and crab Rangoon. All the flavor just hits ya. And the fries with the spicy mayo was delicious. Such a cool place. The owner even gave us some spicy crab rangoons on the house just so we could try them. They were so friendly and greeted all customers. And the fact that it’s inside the U-Stop just makes it that much cooler. We will definitely be regulars here.",
   "Everything I've tried is delicious, but the Korean fries are at the top of my Favorite Things to Eat in Lincoln List! \nThey normally come with cilantro and onions, but I can't eat them, so the staff suggested adding pickled carrots and daikon. I'm so glad they did because it's FABULOUS! I also have to watch how much bbq sauce I have, so they put it on the side for me.  It seems most people take their out of town visitors to Runza, but I bring all of mine here, and every single one has loved it as much as I do!\nFor those of you who aren't sure, \"Heoya\" is pronounced, \"hell-yeah\" Like - Hell yeah that's my favorite place to go!  Those fries make me weep with joy! 😂",
   "This place was absolutely delicious. Quality was amazing for the price and it came out really fast. Don't underestimate this place because it's in a gas station."
  ]
 },
 {
  "name": "Sebastian's Table",
  "address": "8340 Glynoaks Dr. #100, Lincoln, NE 68516, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cf66d908-9331-11ea-aaa3-14b31f159f22.png",
  "tags": [
   "unique",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14649830116796389798",
  "source": "GoogleMaps",
  "reviews": [
   "What can I say? Sebastian’s Table has always been a place I can reliably go when I want something interesting and beautifully cooked. I was in love from day one on 14th Street, and I’ll still be knocking back sangria, sprouts, and smoked Gouda dip until the day either I or they shut the doors for the last time. (Extra stars for the inventive and unfailingly genuine bartenders!)",
   "Upscale casual atmosphere. Reservations are a good idea, but not required. Serving sizes are smaller, but the dishes are excellent. My wife and I walked out satisfied. Everything was will prepared and flavorful. The staff was very friendly and helpful.",
   "Excellent and well thought out menu choices. Our table shared the beef and blue, the duck confit, and the octopus and chorizo, which is probably the most unique dish I've tried in Lincoln. And the chocolate stone is also a great choice as a rich and decadent dessert you'll need to share. Our waitress was superb, however, on future visits I'm looking forward to the male wait staff developing beyond the drop and dash.",
   "Forgot photos! But enjoyed immensely. Been there several times with different size groups, friends and/or family. Been pleased every time. Front tables are cold due to breezes from door openings and closings. Servers give good advice and recommendations. Biggest problem is over-ordering because so many items sound delicious and typically are. Continue to return and will for the foreseeable future. Just delicious and very good with reservations and special requests, i.e.bringing small children, which we did very successfully. Highly highly recommended by all of our family and friends.",
   "We love this place whether eating indoors or outdoors. The food and service is always exceptional. We are getting through the menu one dish at a time and have not been disappointed with a single thing. Excellent!"
  ]
 },
 {
  "name": "Hiro 88 Haymarket",
  "address": "601 R St #100, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cfaf53e8-9331-11ea-b157-14b31f159f22.png",
  "tags": [
   "drink",
   "free",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6954418225209043137",
  "source": "GoogleMaps",
  "reviews": [
   "The food was really good and fresh. I enjoyed the lettuce wraps and all the sushi. There were several happy hours food and drink specials and we also ordered off the menu. They have lots of gluten free options. Our server was very nice and helpful!",
   "Went to Hiro 88 in the Haymarket on Sunday and found it to be impressive. Between two of us we ordered enough sushi to get the boat which I was very excited about when it came. The waitress was very nice and checked in regularly. The sushi tasted great and was very fresh (prior to going here we had bad sushi at ginger). The price was also at a competitive price. We will be back.",
   "Sushi wasn’t as described didn’t taste fresh. I couldn’t even eat some of it.",
   "Hiro 88 was phenomenal, like always! We had a great time with a large table, and received fantastic service. The food came to the table quickly, and it tasted phenomenal.",
   "Refined decor, great food presentation."
  ]
 },
 {
  "name": "Billy's",
  "address": "1301 H St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d00fb268-9331-11ea-9a88-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1166115326875962851",
  "source": "GoogleMaps",
  "reviews": [
   "By far some of the best food in town\n Upscale with a warm, homey feel. Great prices and even better service. Had a wonderful date night. They also have gluten free and vegan menus. Very accommodating and welcoming. 10/10 recommend.",
   "The restaurant is a beautiful old home with lots of character, the food presentation is appealing, but it may have just been an off day but what happened was ridiculous. First incident. Appetizer was mussels in white wine sauce, some were almost ice cold even though the shells were open, which Isent back. Second. Asked for another glass of wine, brought a different type than my first. Third. When my guest and I received our lamb chops almost 2 hours later, both were at best rare to raw and one was supposed to be medium. We got up explained how disappointed and unexceptional the meal was, tipped our server and left without eating.",
   "Atmosphere is great!  Staff was all very nice and talkative.  Drinks and food were great.  I ordered the pork shank, had a few bites and it was cold on the inside, so I asked Alex the server if they could warm it up.  He brought back an entire new meal!  It was great!  The brussel sprouts in a balsamic reduction were terrific.  Must try.",
   "Amazing dining experience! Chef Nader came to our table to ask about our food needs (vegan) and delivered a fantastic meal. The Brussels Sprouts appetizer was phenomenal!",
   "Love the historical environment. Food was 50/50. Pasta and salad quite good. Dessert was good. The vegetables not so much. Watery. Skip the duck. The sauce on the duck was very good though."
  ]
 },
 {
  "name": "The Eatery",
  "address": "2548 S 48th St, Lincoln, NE 68506, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d057d364-9331-11ea-9648-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3785395755812975788",
  "source": "GoogleMaps",
  "reviews": [
   "Wanted to stop somewhere for relaxing lunch, and this was a good choice.  The menu has so many item, it was almost hard to pick.  They have a wonderful lunch menu.  Smaller servings, but it also includes a trip to the salad bar or soup, so it fills you up.  Our waitress was in the process of training another waitress, and they were wonderful gals.  Enjoyed their humor, the lunch and the relaxing atmosphere.",
   "Great homemade food, fantastic place to eat. They also fo party groups and special menu for specific events.  The prime Rib is to die for. They do sell wine and beer and have their own bakery with outstanding desserts! Highly recommend you try this place,it will become your number one restaurant!",
   "Great place for breakfast lunch and dinner",
   "They have a HUGE menu and everything I've tried is delicious. LOVE their pizzas and french onion soup. This place is great for any occasion!",
   "Good Food, Great Atmosphere, Kind Employees and Very Personable Managers! It can get a bit loud, but that's a Positive! It means they are Busy and people are Coming Back Again and Again!"
  ]
 },
 {
  "name": "Wilderness Ridge",
  "address": "1800 Wilderness Woods Pl, Lincoln, NE 68512, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d0b5d1fa-9331-11ea-a1aa-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "eat",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=112446289068435868",
  "source": "GoogleMaps",
  "reviews": [
   "Patio and golf course are so beautiful! Food is delicious and perfectly cooked. Staf are very nice.",
   "Lamb was gamy, prime rib was cold and tasteless, sea bass was very good and the desserts were fantastic.",
   "This is one of my favorite golf experiences in this state.  This state is loaded with great public golf facilities, but this is a cut above the rest.  Great golf holes.  I am never disappointed when the round is over though, because I can't wait to head upstairs and eat at one of my favorite restaurants in town.  Also some of the best golf instructors around.  Course is usually in great condition!  They sunk a lot of money into this place when it opened and it has paid off.  Gotta check it out!",
   "Very nice atmosphere, I loved the wood architecture and design. I got the Hickory cheese burger and sweet potato fries, and liked it. Bud light draw was 4.50 so that was ok. Wasn't too expensive but the service wasn't the best, kinda slow when not a lot of people there. Outside sitting was nice, you can see the golf course. Overall I'd recommend it.",
   "Wilderness Ridge is a top spot in Nebraska for golf, drinks and dining. The magnificent log clubhouse is a Lincoln treasure. You'll feel like you're walking into a Rocky Mountain lodge."
  ]
 },
 {
  "name": "Asian Fusion",
  "address": "2840 Jamie Ln, Lincoln, NE 68516, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d11d94b8-9331-11ea-86ef-14b31f159f22.png",
  "tags": [
   "food",
   "knowledgeable",
   "eat",
   "food",
   "drink",
   "kids",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=10284677001084720793",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best sushi places in town. Staff is always attentive. Quality of food is outstanding. Prices are very reasonable.",
   "Went there for a late lunch and lunch special is great! Was very satisfied with the sushi and cashew chicken. The server was extremely attentive and helpful. Will definitely be going back.",
   "Food is fantastic. Staff is very knowledgeable and friendly. You can't beat Tuesday's an Sunday's all you can eat sushi appetisers soup ECT. For one price",
   "We arrived at about 5:30 pm on a Saturday.  It was rather empty in there customer wise Good time to arrive.  The booths were large and spacious I love the decor high ceilings and open.  Originally was just going to buy a couple rolls then we noticed they had their unlimited menu for $23 a person.  And only $12.99 for kids 10 and under.  The price includes drink. And a large selection of soups, rolls and entrees.  It was my son's first time trying sushi so we got one roll of various types.  We also got hot sour soup.  The hot sour soup was very spicy.  The roles were good, and they were big unfortunately rice made up a large portion of them.  My favorites at sushi restaurants are normally the spicy salmon and or spicy tuna rolls.  But the way they prepare them the fish tastes like it has bits of fried breading inside. This is a far cry from the way I feel spicy salmon should be prepared. Our waitress was very personable keeping our drinks filled and checking in with us to make sure the food was good.  They had light jazz music playing throughout the building it was light enough you could hear it but not loud enough to be a distraction from your meal and company.  The restrooms were clean.  I likely will come back again.  Total price after 20% tip two adults and one child was $76.  It would have been a five-star review but the way they prepare the spicy salmon cost them a star.",
   "Beautiful restaurant, they've decorated beautifully and the flow in the dining room is great, doesn't feel clustered. The dinner portions are huge, so think about sharing, unless you want leftovers. Sushi was fresh and fairly priced, great happy deals as well!"
  ]
 },
 {
  "name": "Florio's Italian Restaurant & Grille",
  "address": "7300 S 13th St, Lincoln, NE 68512, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d163779c-9331-11ea-8c46-14b31f159f22.png",
  "tags": [
   "creative",
   "food",
   "food",
   "food",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=7240584910191050101",
  "source": "GoogleMaps",
  "reviews": [
   "You should definitely try Wednesday wine testing dinner here every first Wednesday of each month. For $10 we try 5 different wine plus an appetizer come with it. Our entree always comes with warm bread, tasty soup, good portion of dinner. So many options to choose. Food is pretty good. Seafood section is very yummy and creative.",
   "Excellent food, atmosphere, and table service. We didn't have a single complaint!! I loved the bread and house salad.",
   "Have always had a delightful experience at Florio's. This is my wife and I's go to for \"Pasta Night\". \n\nDuring a pretty bad snowstorm a few years back, they were going to close early since it was so incredibly slow, but then me and the wife showed up. Turns out, we were the first customers to show up since they opened 6 hours prior! I wouldn't have been the least bit surprised if they would've turned us away with how bad the weather was, but they didn't. \n\nInstead, they sat us down and treated us like true royalty! It was incredible!\n\nTo this day, it was truly one of the greatest dining experiences I've ever had!",
   "Food is exceptional. I had the potato soup and lobster/shrimp ravioli with creamy marinara. I drove an hour for it, and yes, it is worth it. The white table cloth is appreciated and worthy of this traditional Italian eatery. \nHere is the thing. The service was not satisfactory. Long wait times for drinks, bussing, special requests, etc. The table next to us got up and left without being greeted. My party as well waited at least a good 10 minutes before we were greeted. \nAgain, food was wonderful. Wine is good. We were all satisfied with our meals, but the service was not fulfilling. Although I must say our server is very sweet, I am not a believer that niciety is a virtue.",
   "Love this place. Especially wine tasting Wednesday's!"
  ]
 },
 {
  "name": "The Oven",
  "address": "101 Pioneer Woods Dr #110, Lincoln, NE 68506, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d1c31106-9331-11ea-a828-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "knowledgeable",
   "food",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=13089178084639251649",
  "source": "GoogleMaps",
  "reviews": [
   "Let me start by saying I’m usually very lenient on restaurants but I couldn’t let this one slide. It was a very slow evening for them and we (girlfriend and I) were seated immediately. This was unfortunately the only truly fast thing about the evening. It took 20 minutes to get our waitress to our table and the only reason we even got her then was because I had to catch someone else. We were there for almost two hours and we saw her three times total. It took an addition 40 minutes for the food to come out. The chicken and rice were over cooked, and her paneer was tasteless. It was clear we were not a priority. If you’re looking for a good date night spend your money elsewhere. We will be.",
   "Delicious food, friendly and helpful service, great restaurant vibe. When I asked our waitress for help choosing a dish, she proved extremely knowledgeable about dishes on the menu and seemed happy to explain what to expect from each option I inquired about. She was both kind and patient with us and contributed to our enjoyable experience at The Oven. The food was delicious and the portions large: well worth the price (~$15/dish). When we had leftovers, our waitress packed up our dishes into containers and carefully labeled each of the lids with the dish name and date before placing our food back in front of each of us. Good good and service- worth a visit. You’ll want to come back again and again to try everything.",
   "Food was good, dont go here if you want to have a conversation with someone. They seat you so close to others your practically listening to their conversations. If your on a date they have all the tables for two stacked  in a corner. If your eating with a group and they are rowdy, then this place works.",
   "When this place is on point, it's the best Indian food I've ever had. But there's some nights where either it's different cooks, or something else, but it can be hit or miss on the quality. Mulligatawny soup is awesome almost every time though.",
   "This was my first time here. I ordered the Bhutanese Specialty which I thought was delicious.  Came out hot and fresh.  Pricing was reasonable.  Service was fine.  I would recommend trying if you are looking for something different.  There are two locations in town. They do serve alcohol.  Wine and champagne mainly."
  ]
 },
 {
  "name": "The Hub Cafe",
  "address": "250 N 21st St #3, Lincoln, NE 68503, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d20f00be-9331-11ea-8523-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "eat",
   "food",
   "free",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1922494145719706177",
  "source": "GoogleMaps",
  "reviews": [
   "Some of the best food our family has had in a long time. We all tried something different and it was all very good.",
   "This is a great place e to grab a bite to eat or a cup of coffee and even a beer.  The view is great and they have outdoor seating.  The food was very fresh and hot, service was great but there can be a line here during peak hours but definately worth the small wait time.  The avocado toast and skillet were great I added a egg to the skillet made it even better.  Will be back for sure.",
   "Fresh locally sourced ingredients.  Vegetarian, gluten free, coffee/tea, bar (beer, wine, & cocktails), and to-go items avaiable.  A cozy modern cafe with beautiful views, located right on the bike path.  This place has quickly become our favorite weekend go to.  Service is very helpful and friendly.  An excellent healthy option cafe.",
   "Perfect place for brunch. Mimosas are really good. It gets very crowded on weekends, so plan accordingly.  Service is really nice and food is exquisite. I will definitely come back.",
   "This is a really cute little cafe! The food is fairly upscale for Lincoln, but fairly priced and well worth it. It has indoor seating and a few patio seats overlooking the creek in the back. Definitely check it out for a great brunch!"
  ]
 },
 {
  "name": "Tiru Ethiopian Restaurant",
  "address": "2630 Orchard St #3, Lincoln, NE 68503, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d27e4354-9331-11ea-97ac-14b31f159f22.png",
  "tags": [
   "music",
   "food",
   "walking",
   "delicious",
   "economical",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15676505643181456252",
  "source": "GoogleMaps",
  "reviews": [
   "From the minute walking into Tiru Ethiopian Restaurant you are greeted with a pleasant ambiance with smiling staff tranquill music and refreshing aromatic scents all beckoning you to sit relax and enjoy your meal, with a vibe complicit to the Ethiopian culture of actually sitting to enjoy your food. There is no rush service it's just simply relaxing. The cuisine is truly enhanced with beautiful flavorings of spices and herbs, it just melts in your mouth, the spiced tea is delightful before and after dinner, to enjoy with your Pierre sparkling water. If a person is looking for a new food experience with culture, fine cuisine, relaxing environment and staff that aims to please Tiru Ethiopian Restaurant is the place to go to.",
   "This place is fabulous! I enjoyed their variety as well as the sense of authenticity this place exudes. The restaurant is clean and the staff pleasant. We walked out full and smiling.\n\nAll that said, I would recommend calling ahead to make sure they are indeed open, especially for Sunday lunches.",
   "How can food this delicious be this economical??!? SO GOOD!\n4 of us got the vegan plate and the meats plate to share, so good. The enjara is mild and yummy. Also, the hot tea was very nicely spiced. Totally coming back here! \nDoes take just a little time to cook, but we didn't mind the wait at all.",
   "Delicious food!  We tried the mixed meat platter and enjoyed it all (two lamb dishes, one chicken, one beef).  The flavours were all different, and the chef/host adjusted the spiciness to our liking as it was made fresh.  Aside from the spice accommodation it seemed authentic.  The restaurant is new so you may not have heard about it.  Hoping this one stays!",
   "Wonderful food!!!!  I highly recommend it.  Someone described Ethiopian food like this \"if you like Indian food you will love Ethiopian.\"  For me it was the perfect way to describe Ethiopian.  Yesterday was my first time ever eating Ethiopian and I am finding myself thinking about it today.  Thank you Tiru for sharing your culture and food......I will be back!!"
  ]
 },
 {
  "name": "AmuManu Ramen Bar",
  "address": "1451 O St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d2d7e92e-9331-11ea-8b38-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "food",
   "knowledgeable",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9121645369509364256",
  "source": "GoogleMaps",
  "reviews": [
   "Great lunch the Ramen was delicious and I was very happy that they had Gluten Free options. The staff was courteous and helpful when choosing my meal. Service was fast and the food was filling. Will be coming back again.",
   "I was a bit hesitant going here because I'm not very 'cultured' in food. I get the same things every time at the same restaurants, I'm kinda picky and dread trying new things, but this was a great experience! The staff was very knowledgeable and helpful in deciding on what to order (since I had absolutely no idea). My aunt and I shared the 'octopus meatballs', I can't remember the exact name, but they were amazing! After that we each got our huge bowls of ramen, which tasted very good.",
   "Tasty food and quick and friendly service. You’re able to add/subtract any topping from a dish on the menu.",
   "Absolutely delicious. You can taste that the broth and chashu are made in house. The options are extensive and very customizable. Everything was perfectly made.",
   "Just amazing food, easy access, great customer service, low price. I tried it all, My favorite is Tan tan meh (spicy noodle with peanut broth). Appetizer is small size and little bit expensive."
  ]
 },
 {
  "name": "Mazatlan Mexican Restaurant",
  "address": "211 N 70th St, Lincoln, NE 68505, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d331dd86-9331-11ea-8972-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=17877646374412431222",
  "source": "GoogleMaps",
  "reviews": [
   "All I can say is WOW.  What a horrible service.   A day they knew they would be busy.   Call a Togo order in at 6 pm and finally out the door at 930 pm.   Not much different from a regular dinner service...  you would think after waiting over 3 hours the food would be immaculate instead we recieved a pile of food all mashed together....",
   "Great guacamole!! Fantastic service! Excellent portion sizes for the prices!",
   "Chips and tortillas are home made.\n\nHouse Salsa was good.\n\nWe had the jalisco fajitas for two. Wonderful. \n\nProfessional staff with beautiful smiles.\n\nTheir Margarita should be categorized by the Roman Catholic Church as a mortal sin.",
   "Delicious giant margaritas! Extensive menu choices and fast, friendly, attentive service. Whether I order the veggie fajitas, guacamole and chips, or anything else - Mazatlan never disappoints - everything is scrumptious. They offer a large outside dining area as well as the large inside seating area. They treat you like family at Mazatlan - what's not to love?",
   "You know what your getting before you every leave your driveway. Yum yum one of the top rated ethnic foods in lincoln"
  ]
 },
 {
  "name": "Ginger Grill",
  "address": "6055 Apples Way, Lincoln, NE 68516, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d38d925c-9331-11ea-92b4-14b31f159f22.png",
  "tags": [
   "food",
   "knowledgeable",
   "food",
   "delicious",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7086329571869286621",
  "source": "GoogleMaps",
  "reviews": [
   "The food is always great. The place is really clean and pleasant. We had a reservation for 7:30pm and ordered food around 7:40pm. The cooked meal came out around 8:00pm. Then 10 minutes later the appetizers came out. However, it took 45 more minutes before the sushi rolls came out that we ordered. I sat there for 35 minutes with my food on the table while my date waited for her sushi rolls. \n\nWe were told by our waiter that there would be some kind of comp for the amount of time we waited. And for my food sitting on the table for so long. We were also told the manager would stop by to check on us but that never happened either. We got the bill with no discount or visit from the manager. \n\nThis used to be a great spot southeast Lincoln for sushi.\n\nI would recommend you head to a different sushi place to be served correctly.",
   "Yum! Lovely atmosphere, my husband's Korean ribs were perfect. Sushi was a little loose, but tasty. Ginger vegetable soup was spicy and good on a cold day.",
   "First off the atmosphere here is just best. Knowledgeable staff very prompt.  Food fresh tasty. Very interesting menu. Will visit again.\nBetter yet place one in Omaha.",
   "Our first trip was good, second was awful (hostess wouldn't seat us in the bar to have drinks, even though it was completely open and was super rude about it)...so I swore I wouldn't come back. Then tonight I ran into friends from out of town and they told me to meet them here. We sat in the bar and had a great experience! Dylan was amazing. Incredibly friendly (and patient while we kept visiting between ordering), as well as knowledgeable on menu items, and witty. The lettuce wraps with chicken (and Dylan's recommendation of peanut sauce) were delicious. The Yummy roll held up to it's name. I'd also recommend the Original Sin blackberry Black Widow cider. I'm giving this experience five stars and hope this level of service continues when we come back.",
   "The food was great.  The menu is priced reasonably and the service was very good."
  ]
 },
 {
  "name": "Issara Modern Asian Cuisine",
  "address": "1701 Pine Lake Rd #7, Lincoln, NE 68512, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d3eb1d40-9331-11ea-9492-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9580464929739139097",
  "source": "GoogleMaps",
  "reviews": [
   "After a good experience at their sister restaurant, Blue Orchid, I was definitely expecting more and better. We again had a large party as we did at the BO, with 15+. The food was not as consistent, but some of the flavors were definitely there for most of the dishes. I enjoyed my blue crab fried rice, but it could use just a little bit more crab. I also don't recall the description mentioning tomatoes otherwise I would have excluded it. That's important to me for allergy purposes. The pan fried halibut was also good, but small and a little dry for my taste. I also tried the duck which was very good. They ran out of Thai tea at 7pm on a Saturday night, so only a quarter the table could order it. How does that happen? I'm hoping it's an isolated experience and hopefully won't be a consistent problem. The other party members did enjoy their time and their food, so I think it's still worthy of the 4 stars.",
   "Delicious food. We've come here several times and the food has been excellent every single time. We've always been seated immediately. I'm surprised there hasn't been a wait the 3x we've been. We've been at 6pm, 7pm and 8pm on either Friday or Saturday.",
   "Excellent, we sat on the patio. Weather was great and so was the food and service.",
   "Would’ve given 0 stars if I could. Beyond awful experience. It was Valentine’s Day and we had a reservation. It took over ten minutes to even be acknowledged by a server. And that was after my husband went and found someone. Then we waited over thirty minutes for our appetizers and drinks and we never got them. We had to ask the server to put water in the glasses on our table. There was no bartender or manager helping out. We eventually left and went to another restaurant because it was beyond pathetic. We will never go back. There are other Asian restaurants in town that take care of their guests and properly staff their establishments.",
   "Definitely the best Asian cuisine I've had! The food was delicious and it wasn't too busy on the weekday so it was a very pleasant meal."
  ]
 },
 {
  "name": "Texas Roadhouse",
  "address": "6301 Apples Way, Lincoln, NE 68516, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d44db2a4-9331-11ea-afb7-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13259432875597711839",
  "source": "GoogleMaps",
  "reviews": [
   "This is our new favorite steak place. It can get a bit messy with the peanuts, but that's kinda part of the atmosphere. The food and service is always good. Be sure to call ahead or you will be waiting. We tend to eat around 5:30. They are usually quite full even that early.",
   "Good steaks, their rolls with the cinnamon butter are great, and a fun atmosphere! Our waitress was very good at her job! However it was absolutely packed. It may have been a Friday, but I feel like they should have a second location or something.",
   "Excellent curbside service!  Quick and efficient.  Staff were appropriately masked and maintained needed social distancing for attending customers and food preparation was great!",
   "Great food very much so comfort food. Very good customer service. My kids love that you can throw your peanut shells on the floor, the have barrels full to snack on. Even when full can still have a pleasant meal and hear each other talk. USUALLY VERY BUSY AND ALWAYS HAS A WAIT. Validates the fact that it is a wonderful restaurant, but everyone already knows.",
   "LOVE there ribs best ever. Leftovers are also always amazing even cold. Love the rolls n butter always warm n perfect"
  ]
 },
 {
  "name": "Pho Nguyenn Restaurant",
  "address": "611 N 27th St #5, Lincoln, NE 68503, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d4944b8c-9331-11ea-b545-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2910172985959865231",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place! The food is always amazing. And the service is awesome. I came here almost 3 times a week while pregnant! Highly recommend!!!",
   "This is my favorite place to eat. I discovered it in college, when my roommates from China wanted to long life noodles to celebrate a birthday. That day, I was introduced to pho.\n\nFor the next few years of living in Lincoln, I would eat pho at least once a week, trying new places, but always returning here. The broth tastes richer and contains a more complex flavor than all the others in town. There is a nutmeg aspect that I have never even tasted elsewhere.\n\nThe service has always been good. The family who ran it knew I liked spicy and would bring me special sauces they made for themselves from the back.\n\nNow I live in Omaha, some ways away, and I mostly just have to be sad about how much better the pho is there than at any place in town.",
   "First time having Pho. I was pleasantly surprised as to how good the food was. Very kind server, very helpful. We be returning soon!",
   "Best Pho in Lincoln. After visiting several vietnamese restaurants in.the city I've settled on this one being my favorite because of the relaxed atmosphere, friendly staff and amazing food.",
   "Who knew you could get world class Pho in the middle of Nebraska? This was excellent, and I consider myself a tough critic having eaten it all over. Service was super friendly and fast! Highly recommended."
  ]
 },
 {
  "name": "Honest Abe's Burgers & Freedom",
  "address": "126 N 14th St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d4e9c3dc-9331-11ea-8da6-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "unique",
   "unique",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11377959174943615734",
  "source": "GoogleMaps",
  "reviews": [
   "Great burgers, lots of amazing toppings and rotating burger of the day. Even the kids loved their food which can sometimes be tough to please.",
   "Honest Abe's true strength is it's variety of unique flavors. If you are looking for high quality patties I would say this isn't your place. But the different burgers and fries, as well as their unique rotating menu was fantastic. Their alcoholic shakes are quiet good as well. However, my partner mentioned that in our meal there were a lot of competing flavors, I would agree but whose fault is that but our own I guess. Fun atmosphere including a private dining room. Fun place to bring friends from out of town.",
   "The awesome sauce was awesome! First timers was excited by unique menu choices choose 1809 and named \"Greatest burger ever\" staff very friendly and brought to the table. The 1809 was so good!! Balanced cheese and apple burger. Well seasoned fries!! So good!\nReccomend coming here for a great meal!\n\nIt is a tad messy with all the sauces use napkins!",
   "We frequently visit this establishment and we absolutely love coming here. We always have to get a double Dutch fudge chocolate shake. We love to sit on the top perch & play checkers while we wait for our food and enjoy our shakes!",
   "The food was good minus the parmesan pile on the lack of fries 🤣. But we'd go back because the burgers were so good! The service however was lacking. The young lady taking orders couldn't be more thrilled to be there (sarcasm). We received our food and asked for a knife as my arm and shoulder are broken. It's easier to cut a burger in half to eat as they are very large and juicy. She said we're out of knives and just walked away. You have 0 knives and 0 enthusiasm for customer service. 😬"
  ]
 },
 {
  "name": "Carmela's Bistro & Wine Bar",
  "address": "4141 Pioneer Woods Dr, Lincoln, NE 68506, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d546eeee-9331-11ea-bb9a-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12179782689652494919",
  "source": "GoogleMaps",
  "reviews": [
   "Every time we come here, the portions, service, and quality are of the highest order! Well worth every penny! I'd recommend it in a heartbeat! It's my wife's favorite place to go! If you have not already been here, GET HERE FAST! Also, they have some of the largest crab cakes you'll find that taste this good!",
   "Terrible experience.  Our wait person was miserable, I hope it was just a bad day and not how she normally treats people.  We ordered bruschetta, which was just garlic bread with a few tomatoes, a salad, steak and the lobster mac and cheese.  I wasn't asked how I'd liked the steak done (came out well done), the lobster mac and cheese was basically noodle soup and you thankfully can't mess up a salad much.  For $100+ I expected better food and service.",
   "Awful service and management. Do not run a business if you can not simply keep up with dealing with guests that come and pay for your food and service. Awful employees trained by horrible owners with no respect towards anybody. Try opening a truck stop to match the service that I received tonight. For anyone looking to see if this place is worth it, it's not. Head to Venue across the shopping center, you will actually be greeted there.",
   "Came here for our anniversary. Dinner was amazing! We both had the rib eye. Atmosphere was very \"romantic\".  I'm sure we will definitely make the drive from Ashland again.",
   "We had dinner here last night and had a terrible experience!  We ordered the cheese board and it came out with a moldy strawberry and cheese that we hard due to being old.  The side salads were good, but we ordered the Chicken Parmesan for the main course to share and the chicken was not fully cooked. I had lost my appetite by then.  Our waiter was great and it wasn't his fault, but for the prices I definitely expect better quality food!"
  ]
 },
 {
  "name": "El Toro Mexican Restaurant",
  "address": "2600 S 48th St, Lincoln, NE 68506, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d5a8c098-9331-11ea-9bc6-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14273953257925715192",
  "source": "GoogleMaps",
  "reviews": [
   "This has been my favorite Mexican restaurant my entire life. Their food is always incredible. I absolute love the fajitas!! They come out still sizzling 😋. The chips are warm and the salsas fresh and delicious. But one thing that makes this restaurant stand out to me is the customer service. The servers are always in a good mood and the order is always accurate. They all work as a team and always give the best experience. You will never hve to ask for a refill on chips or water. Come here for authentic amazing food!!",
   "El Toro has been our favorite restaurant for years.  Tonight we got takeout, and it was wonderful, and abundant servings, just like usual.  We even got margaritas, none can compare.  We called in our order, to get our specifics (like no dairy) on one dinner. Please get takeout!  Keep El Toro going.  Great food and good people.",
   "Huge portions and tasty margaritas.  Take out was done on time.",
   "It was a late lunch for us and we walked by. We have never had before and heard good things! And it was delicious!! We were waited on promptly with a smile. Try he food came out hot and my girls ate everything up!! They wanted to lick the plates! So good! We will be back!",
   "Perfect spot to meet with an old co-worker and catch up! Quiet enough environment to hold a full conversation without interruptions. The food definitely surpassed my expectations for it being my first time there!"
  ]
 },
 {
  "name": "La Paloma Restaurant",
  "address": "8320 Northwoods Dr, Lincoln, NE 68505, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d5f3ff6e-9331-11ea-a2a8-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6897796096716265739",
  "source": "GoogleMaps",
  "reviews": [
   "I go to and review a lot of restaurants, this was an outstanding Mexican restaurant. In discussing what to order the owner recommended shrimp fajitas with guacamole and flour tortilla chips, based on my preferences. Everything was outstanding. Great food, great service, great atmosphere. Highly recommend this place",
   "La Paloma has some great food.  Some authentic and some Tex Mex styles make everything yummy.  The Verde sauce for the enchiladas is just perfect.  Rice is flavorful and Al dente.  The service is always friendly and in point.  Salsa and fried flour tortillas are a nice welcome they deliver to you as you are seated.  This is one of my favorites in Lincoln.",
   "Chips were burnt. Rice is possibly the the worst I have ever had, not fully cooked. The rice flavor was not good. Let's move on the the taco. They tried to fry the taco but it tasted like they put in in the grease for 10 second then flipped and repeated. Very chewy. The beans were ok. The tostada was a tostada. The enchilada sauce was decent at best. The one thing I can say is their friendly people. Thos restaurant probably will not be on my radar again.",
   "Great food (order something new), we love the coconut margarita and if you sit at the bar you’ll have a great conversation with the bartender.",
   "Service was excellent. Warm homemade chips and salsa were very tasty. Entrees we're very good but the side of refried beans were a little bland and the side Spanish rice had hard rice in it. Margaritas were very good too. I will go back but probably get different sides."
  ]
 },
 {
  "name": "Gate 25 Bar and Restaurant",
  "address": "300 Canopy St #140, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d66060c2-9331-11ea-ade0-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "drink",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=11304317485799860756",
  "source": "GoogleMaps",
  "reviews": [
   "Went before a concert. Place was packed, but staffed for the rush. Food was good.",
   "Great little night spot for dinner and drinks. Drinks are strong like me and the dinner was tasty and expensive, also like me. Nebraska is pretty amazing and the area around Gate 25 is pretty hip. Lots to do and see here. Had a great time.",
   "Great & comfortable set up in this trendy spot. Circular bar leaves plenty of space to walk up and get a drink quickly. Highlights of the menu include the lobster roll and the Cuban sandwich, we had & enjoyed both. Service was solid. Nice gastro-pub addition to the area, with generous pours and a friendly atmosphere, even if you aren't a Cornhusker. Best Moscow mule in the area.",
   "I went to grab some lunch and ordered a burger.  It was just fine.  Nothing to brag about.",
   "Wednesday night deals are the best! $6 burgers (that are delicious), $3 draft beers (good selection) and BINGO"
  ]
 },
 {
  "name": "Koen Japanese BBQ & Sushi",
  "address": "2601 Jamie Ln #100, Lincoln, NE 68512, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d6b83374-9331-11ea-94a2-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "unique",
   "knowledgeable",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12090437302741383299",
  "source": "GoogleMaps",
  "reviews": [
   "We have been going to Koen since it first opened and were not even open every day yet. The staff is phenomenal and food is terrific. Enough food to make it well worth the price. Keep it up and we will continue to eat there and enjoy such a wonderful experience.",
   "Koen Japanese BBQ is truly a unique experience.\nThe meats are tender & very well marinated for Awesome flavor. They have a large selection of cooked and raw sushi and sushi rolls. \n   Sunday's are happy hour ALL DAY, and you will LOVE the deserts. They have a knowledgeable staff and very clean high end layout for dining and nice bars.  You will be happy you went.\n   FYI, the lava cake is a five spice traditional that is out of this world.\nNew FAVE place for fun indoor grilling and AWESOME appetizers.\nGotta have the Crispy Rice withTuna, avocado and caviar.  Also LOVE their take on jalapeno poppers, sliced, and prep's like nothing you've had before.",
   "Terribly disappointed. Constant inaccuracies - I ordered two sushi rolls and received three. I would recommend when ordering, go though and double check they have written down what you requested because I just paid for the extra roll that I didn’t request, I wasn’t going to complain because how do you dispute an order. Then, we were there for happy hour (which is all day Sunday!!!) and got miso soup which would be $2 for happy hour and were charged $3. Also, got a salad which should be $4 and was charged $5. They fixed it when I questioned them about it but no apologies. Also one of the rolls said it was supposed to have tomatoes on top and it had spicy mayo. So overall, I was over charged, got rolls I didn’t ask for, and incorrectly made rolls. Also the salad I ordered came last? Salad for dessert anyone?",
   "This is a 5-star restaurant. I dine here for world-class sushi and can't believe it is here in Lincoln Nebraska! Koen, Kinja & Shogun have the best cuisine! The rest of the sushi restaurants in Lincoln cannot compare. If you have kids, Shogun is the best choice!  If you want the best Sashimi & Sushi Koen is exceptional!",
   "Hands down the best sushi in Lincoln. I did not expect to find this quality of sushi in Nebraska. The sushi here is on par with high quality sushi in larger cities.  The grill food was also very good. My only complaint was that the gochujang was too sweet."
  ]
 },
 {
  "name": "La Paz Mexican Restaurant",
  "address": "321 N Cotner Blvd, Lincoln, NE 68505, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d6fd2d06-9331-11ea-bfb2-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6906770426891167953",
  "source": "GoogleMaps",
  "reviews": [
   "Not the best Mexican in town. Margaritas were okay, but the food was subpar. Service was young and not super attentive. Atmosphere was pretty dated and menus were crusty 😬",
   "Went in for lunch. Service was excellent! Food was good, as it typically is, but the portions were smaller than I remember them being. Lunch time may have been the reason for that so not a huge deal. The complimentary chips and salsa are some of the best in town, but today the chips had virtually no salt on them so they were kind of bland. One thing that definitely never disappoints was the spicy green salsa (you have to ask for it) that alone deserves 10 stars. Overall a good lunch.",
   "I had a thumbtack in my food. \nHonestly I’ve never had an issue before this and our waitress was spectacular. I still had a thumbtack in my mouth (I bit into it) and the situation was not handled with severity . I just hope this will NEVER happen to anyone else",
   "Terrible food...!!! no cheese in cream cheese enchiladas barely any sauce??? Beans cold n slapped on the plate... had i not been with a friend that bought the lunch i would have walked out. 😢😔\nServer was snooty and threw our menus on the table because we asked to be seated in a different booth. The first place She seated us... had us right where everyone walks in.\nIdk if ownership has changed in the last few years... i know La Paz used to have been a first choice restaurant for me.\nI will Not be going back for a meal unless they make this right.... \n       DISSATISFIED CUSTOMER 😠",
   "Sarah Beth our waitress was amazing and never missed a beat!! I had the cream cheese chicken enchiladas and WOW incredible. So tasty and full of flavor. My husband had the chicken enchiladas and loved them as well!! If you are looking for good authentic Mexican food this is the place to go!!!!! Also make sure you try there desserts!!!"
  ]
 },
 {
  "name": "Copal Progressive Mexican Cuisine",
  "address": "4747 Pioneers Blvd, Lincoln, NE 68506, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d742e8d4-9331-11ea-ae12-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "delicious",
   "food",
   "walk",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=210142428010825257",
  "source": "GoogleMaps",
  "reviews": [
   "One of my favorites in Lincoln!  Copal caters very well to people with dietary restrictions.  They have gluten free and vegetarian options.  There are many menu options around $10.  Feels like you are eating higher quality food than typical Mexican food.  Would recommend to anyone!!",
   "Who knew such great food was available in Lincoln? I was skeptical to try a Mexican restaurant self described as progressive for fear of them putting a kooky spin on classic dishes. They kept the experimentation to a minimum and focused on making really delicious meals that made me want more. The hand crafted margaritas were absolutely perfect and the desserts were beyond description.",
   "I've always been a strong supporter of Copal - their food is reasonably priced and their 'premium' Margaritas are quite good!  I'm not sure if something has changed recently or what, but our latest attempt to dine there was a particular disaster.  Understanding that it was national margarita day, and having a party of 7 we chose to arrive early (shortly before 5 pm).  After waiting up front for well over 10 minutes we finally had to walk back and grab someone just so we could put in our name.  We then waited.\n\nSeveral minutes later a party of 3 walked in and also put in their name.  After waiting for about 10 more minutes, the waitress called the other party and sat them at a table that could have fit 8.  The waitress then told us it would be \"about an hour\" before we got seated as those people \"just sat down\".  When asked about why the other party got to go first even though we were there well before them, the waitress' response was \"because they had less people\".\n\nI'm not sure on what planet this kind of logic makes sense, but it will definitely influence our choice on where to spend money the next time we're out.",
   "This restaurant was a good experience. It has been there for 5 years before I knew it existed. Atmosphere was good, our server (she went by Z) was friendly and willing to help on choices. Not overly expensive and will definitely be back.",
   "Great food, service, atmosphere!  One of Lincoln's best.  Everything is good and well presented.  Staff are welcoming and helpful!  Drinks are awesome.  Go here, it does not disappoint!"
  ]
 },
 {
  "name": "Lee's Chicken Restaurant",
  "address": "1940 W Van Dorn St, Lincoln, NE 68522, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d7ac323a-9331-11ea-b7b2-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13985898752591429276",
  "source": "GoogleMaps",
  "reviews": [
   "It was pretty good, definitely not in its hay day anymore.  I went on a Sunday after church and the restaurant was basically empty.  The chicken was cooked perfectly, potatoes were boxed, and corn was tasty! Onion rings were very crispy, don’t expect them to be cut thick. But service was fast",
   "Food cold, service slow. But server and owner accommodating. I do not mean this as a derogatory rating - Lee’s is an institution here in Lincoln, but the prices and reputation do not reflect the reality. I hope that I gave constructive criticism to the owner in response to our experience. Places like this, locally owned, need actual feedback, not self-alleged victims plying for sympathy whilst absolutely lacking any sense of compassion, or self-awareness, whatsoever. A good place, maybe once a great place; the potential as something unique is there, but the execution is lacking.",
   "Saturday night. About 100 to 130 guests, only three servers. It took over 15 minutes to be greeted. It took over an hour and a half to get my food after being asked by three different staff what I had ordered. The one order still wasn't correct. I understanding staffing is an issue but come on.",
   "One of my favorite places.  The chicken is always good but tried the fish tonight and wasn't disappointed.  Keep family business going and patronize Lee's soon.",
   "The staff was friendy and the food was okay. Lee's has a really old fashion environment."
  ]
 },
 {
  "name": "El Chaparro",
  "address": "900 S 13th St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d7f60cb6-9331-11ea-83f1-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13864251046000215631",
  "source": "GoogleMaps",
  "reviews": [
   "I cater with these guys all the time and also eat in. Very yummy and they always have good customer service. Also can I say fast?!! When I cater 40 tacos they have them ready in 20 minutes...crazy fast. The employees work very hard in their kitchen.",
   "Honestly, the only thing I order from this place is 5 steak tacos and occasionally a pineapple water. I get it for lunch almost everyday that they instantly recognize me now. All I have to say is they have the best tacos in town!! I have attached a photo for reference. I accidentally tipped them over so they look a little messy, but they are still good!! As for other food from this place, I have no idea. Never ordered anything else. The tacos are too good to pass up. The staff is also very friendly and make me feel comfortable every time!",
   "One of my favorite places to get food in Lincoln! The service is great!",
   "The service was lovely, and the atmosphere was cozy. I also really appreciate the large amount of food I was able to get with just $6.00- that being said, the steak Tortas I had was amazing! The bread was fluffy, and everything was well distributed on my sandwich. The chips are also perfect. \nI plan on eating here again as soon as I can :)",
   "Nice food with good quantity. Really reasonably priced."
  ]
 },
 {
  "name": "Pepe's Bistro",
  "address": "1311 S 11th St, Lincoln, NE 68502, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d84369a2-9331-11ea-9b55-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "free",
   "food",
   "drink",
   "food",
   "delicious",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5298513284482204535",
  "source": "GoogleMaps",
  "reviews": [
   "Pepe's has the absolute best vegetarian food in Lincoln. The flavors and colors are vibrant and rich. Every dish comes out beautifully plated and perfectly cooked. I love how the menu is small and always changing. Pepe always gives each dish his own unique twist with layers of flavor. \nThe restaurant has a friendly and cozy atmosphere with an adorable patio area in warm weather. Pepe does so much for our local community!!!! So thankful. \nMy personal favorite things to order are: avacado cheesecake, cucumber lemonade, and guacamole. I can't choose a favorite main dish- they are all AMAZING!!!!!",
   "Pepe is dedicated to providing vegetarian/vegan options to Lincoln using fresh locally grown crops. He loves his community and supports in any way he can. If you’re vegetarian or vegan this is spot a must see and even if you prefer meat, this food is so good that you’ll forget that it’s cruelty free!",
   "Holy buckets this place was an amazing find. Pepe's serves some of the best vegan food I've ever had. It's such a cute and cozy little shop tucked away in the neighborhood of 11th and B. The soups are bomb and I could drink the cucumber lemonade all day everyday. Truly one of Lincoln's little hidden treasures.",
   "This place is amazing. Some of the BEST vegan options in Lincoln. He usually does delicious pop-ups around Lincoln, but he finally opened up his own spot. Even if you aren't vegan, I HIGHLY recommend you go and try Pepe's food. It really is worth your time. Such an awesome place.",
   "Great food and service! It's always a pleasure to eat at Pepe's, and with signatures like cucumber lemonade and avocado cheese cake you'll find yourself coming back"
  ]
 },
 {
  "name": "Mi Tierra Family Mexican Restaurant",
  "address": "5500 Old Cheney Rd #4, Lincoln, NE 68516, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d89a3c50-9331-11ea-9a39-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "walking",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10368497819253699057",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best kept secrets in Lincoln! I love the food here, the menu isn’t massive but it has a lot of really high quality dishes that always taste great. I love spicy food quite a bit so I was pleased when I ordered the Devils Shrimp here and it pulled no punches! It was a thorough enjoyable experience. I plan on coming back here again in the future.",
   "Great Mexican restaurant! Place has a good environment,  good lighting and decorations, and place looked clean. Upon walking in we were greeted and quickly seated. Then recieved some complimentary bean dip, mild and spicy salsa with chips as we waited for our food. Our order came out in around 20-25min which is reasonable for how busy they were. I was satisfied with the food portions we were given when compared to the price. While eating, our drinks were never empty as they have someone going around every 5 minutes or so filling drinks. Overall would recommend this Mexican restaurant!!",
   "Wonderful, authentic Mexican food! I am a HUGE Spanish Rice and Bean Dip hater, but here, they were both fabulous! I don't know how they do it, but I LOVE their bean dip and the rice is so soft and fluffy. Plates of food were extra generous, I had to get a to go box! Everyone working a the restaurant were very friendly and always smiling! DON'T MISS THIS HIDDEN GEM!",
   "The best Mexican food in town! Great staff! Delicious chips, salsa and bean dip. I've never had a better flour tortilla in my life. If you're looking for an authentic experience, this is the place.",
   "Very clean restaurant. Great Atmosphere! The chips, salsa and beans to start were very good. The main courses were excellent. The staff was very friendly and eager to please! Will definitely be going back again soon!"
  ]
 },
 {
  "name": "Mazatlan II Mexican Restaurant",
  "address": "2701 King Ln, Lincoln, NE 68521, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d8e9bc1c-9331-11ea-bc5a-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "food",
   "kids",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10710929992057236181",
  "source": "GoogleMaps",
  "reviews": [
   "Was very very Impressed. Had amazing fast service with a smile. $7 top shelf margaritas. Was vary authentic except for the season on the meet, which made it even more impressive. BEST Guacamole I've ever tasted in my life and I've tryed alot !",
   "I highly recommend Mazatlan II. The food is great and reasonably priced, but the biggest selling point is their service. Soon after you're seated, someone will bring out water, chips, and sauces (see photo) free of charge. My wife finished off her sauce and literally 10 seconds later a new sauce was brought out without being requested.\n\nOur food was brought out in about 8 minutes after we ordered, in spite of the full restaurant at peak dinning times. My meal was the chicken fajita salad where I requested the sour cream and guacamole on the side. My wife ordered a chicken quesadilla. Both were quite filling and came to about $23 before tip.\n\nThe staff are courteous, quick, and accurate, though they are not very talkative. I love this place, we will be back!",
   "Amazing food.. amazing service.. \nperfect for lunch and dinner :) \nI had chicken fajitas and my colleague had Beef Burrito .. he loved the food too \nThe service was quick and the food terms were explained on the menu which makes it easy to order.",
   "Sadly, we were not told an accurate account of wait time (45 min became 1.5 hours, though they did bring food wiggly l quickly for the youngest (as requested) the other meals were sporadic and inaccurate.  \nThey did have fantastic mushroom salsa, and I'm aware that larger groups (7 adults, 5 kids) are more difficult, it could have been handled better.  But I'm going to return, just probably not with a large group.",
   "One of the best quality food I've had in a while. Price was a little high and the drinks were weak I thought but great food ill return. Fried icecream was not good. The cereal coating tasted stale."
  ]
 },
 {
  "name": "Imperial Palace",
  "address": "701 N 27th St, Lincoln, NE 68503, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d942159c-9331-11ea-8885-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7938723439883439664",
  "source": "GoogleMaps",
  "reviews": [
   "Fast and polite service.  Great lunch specials and easy on the wallet too.  Cant beat that with a stick.  Highly recommend stopping in for lunch especially.  I love the decor inside too.  So good!",
   "Ordered the general tsos chicken... was the worst I've ever had!!!!!.. was soggy and greasy.... and I didn't even eat more than 2 bites... i paid 23 dollars for the meal.. told them it was horrible and they didn't offer me a refund or anything... I even tipped the delivery guy 10 bucks... so Imperial palace definitely earned this bad review!!!!! I hope no one else gets food this bad...",
   "Great quality food and great value. Fast friendly service and nice retro old school decor. Big portions.",
   "Not good.  We ordered 4 dishes and all of them were terrible.  The “fried” rice seemed like it was steamed rice with soy sauce dumped on it, no veggies or anything. This was the worst Chinese food I’ve ever had.  The chicken was chewy and greasy.",
   "Awesome hot and fresh and the king pau... really had zing"
  ]
 },
 {
  "name": "Tico's Restaurant",
  "address": "317 S 17th St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d989a600-9331-11ea-a006-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "family",
   "food",
   "food",
   "unique",
   "free",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14306708493074917290",
  "source": "GoogleMaps",
  "reviews": [
   "Good food, friendly staff, and as a bartender I wouldn't mind being behind the beautiful bar they have set up near the entrance. Building is pretty neat too.\n\nThe black beans when finished look like fudge and I thought that was amusing lol",
   "My family and I went there for the first time this weekend. We reserved ahead and when we got there, we only waited about 5 minutes to get our table. Parking is difficult to find if you want to park in their parking lot, since it was full when we got there 6 pm on Saturday night and waited for another car to leave. The restaurant was nice and clean. We had complimentary chips and salsa. Their chip has seasoning and their salsa is very good with enriched cilantro flavor. Menu prices seems pretty average to me. I ordered the chicken fajita burrito and it was good. My toddler does not like Mexican food but did enjoy their chicken tenders and fries. Overall, seems like a good place for gathering! Probably good to reserve ahead and come early to find a good parking spot so you don't have to walk far especially if you have kiddos.",
   "Great lunch and excellent service! Haven't been in for awhile, but will be returning soon. Lunch special was the Deluxe Burrito and it was very good. Food arrived hot, fast, and very nice presentation.",
   "What isn't there to love about Tico's?! Awesome atmosphere, staff, and decor...delicious drinks and food. Incredible variety of perfectly crafted margaritas. Unique and amazing chips. Cream cheese chicken enchiladas are where it's at for the main entree. Ice cream with wine sauce is to die for. Gluten free menu for our daughter is huge. Bonus!",
   "One of my favorite restaurants in Lincoln! The service is always AMAZING and the food is to die for. I am never let down by Tico's! I have to come here at least once a month, otherwise I feel something is missing from my life.\n\nThe vegetarian fajita burrito is my favorite item on the menu; it's great!"
  ]
 },
 {
  "name": "Venue Restaurant & Lounge",
  "address": "4111 Pioneer Woods Dr Ste 100, Lincoln, NE 68506, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d9df8eb0-9331-11ea-bff2-14b31f159f22.png",
  "tags": [
   "food",
   "free",
   "knowledgeable",
   "food",
   "knowledgeable",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=9498788670534831045",
  "source": "GoogleMaps",
  "reviews": [
   "Great lighting and warm feel. Customer service was very welcoming with no rush and very attentive. Food was good and flavorful. I particularly liked my mash potatoes. Dessert was surprisingly magnificent which I generally don't have. Will revisit more often...",
   "We told them (in our reservation) we were coming for our anniversary  and they took it to heart! Hostess searched out quiet table in back area on purpose and added a nice Happy Anniversary sheet for table decorations. Waiter offered free champagne for toast, which I'm not aware of anyone else in town providing. Big plus. Ordered 3 from the sea (shrimp, scallops and small salmon fillet) on top of some tasty risotto. Hubby ordered lobster tail and got even better risotto with asparagus and peas. There was enough we each took some home but many people would be able to finish. Will def return and may keep it as a \"special\" meal location since they made dinner feel so, well, SPECIAL. Also our waiter, Otto, was just the best!! He made great recommendations, was not impatient with my many questions and timed his visits to the table pretty close to perfectly. Know we will return esp when looking for that feeling of being pampered.",
   "Great aesthetics, ambiance, atmosphere!  Our server was very knowledgeable of the menu and drinks.  The food did not take long to get to us, and everything was tasty!  We'll definitely be back for the dinner service one of these soon days (to try the duck breast)!",
   "I ordered the filet mignon today for lunch & it had no flavor. It was cooked too much that it tasted like cardboard. The sides, asparagus & Mac & cheese tasted better then the meat. Do you put any salt or seasonings on your meat?",
   "We were there late at night for drinks, appetizers, and desserts, after a concert. This is one of few classy places open at that time. We had pizza, brussel sprouts, and spinach artichoke dip. All were outstanding. We then shared three different desserts between four people.  Also outstanding, and more than enough to eat. The wait staff was friendly, knowledgeable, and efficient. It's our new favorite place."
  ]
 },
 {
  "name": "Sultan's Kite 13th O Street",
  "address": "1309 O St, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/da2b64a8-9331-11ea-a58e-14b31f159f22.png",
  "tags": [
   "food",
   "walking",
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=15757050864915547846",
  "source": "GoogleMaps",
  "reviews": [
   "The food had no flavor I think cardboard would have more flavor. The green sauce is the hottest they have, I had to ask if that was what I had no heat at all.  The only good thing was someone asked to go with them and they paid. I will never spend any of my money.",
   "Super tasty and authentic gyros and amazing potatoes!  The staff is incredibly friendly and the prices are awesome!  Destination within walking distance from The Bourbon and they are open until 2:30 a.m. on the weekends 😍",
   "I don’t know what they put in their food, but goodness is it addicting. Every time I go the food is top notch, I love everything I’ve had from here. The only complaint I could have is that it’s a tiny bit pricey, but definitely worth every penny with how good it is!",
   "Absolutely outstanding. food! Service was friendly and helpful. Bathrooms were spotless. The lentil soup was to die for, my compliments to the chef's mother and her recipe. Laid back atmosphere, great prices. We will be returning!",
   "It was a nice place to eat, meat was nice, the portion was huge.\nQuite enjoy my salad as well. The WiFi connection is OK. nice place to have a lunch here."
  ]
 },
 {
  "name": "Grey Whale Sushi & Grill",
  "address": "129 N 10th St #113, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/da6a90d0-9331-11ea-82e3-14b31f159f22.png",
  "tags": [
   "family",
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=3687879881811524153",
  "source": "GoogleMaps",
  "reviews": [
   "I cannot express how disappointed I am in this place.  Our nephew planned  the proposal to his girlfriend for three months in the Grand Manse, a place with sentimental meaning to them.  His plan was to propose in the foyer and then family and friends would be waiting in the Grey Whale to celebrate with them. \n\nHe made the original reservation three months in advance and spoke with them 48 hours before the big day to confirm our party of 14.  We went to the restaurant a couple hours before the event to drop off flowers and some other special items and were greeted with blank stares. After some conversation we assumed we had the issue worked out and the plan was safe. Forty five minutes before the big event we arrived at the restaurant to find that they had GIVEN OUR TABLE AWAY!!! No effort was made to accommodate us and it was clear they could care less about ruining what was a very special evening. \n\nThankfully we were able to make a last minute switch and another restaurant agreed to graciously accommodate us so the evening wasn’t totally ruined. \n\nTo say our family was furious and disappointed would be an understatement.  I would never darken the doorstep of this establishment again if my life depended on it.  Absolutely horrible experience.",
   "My sushi place of choice in town, always love coming here, the food is delicious and it's a cute place for a date.  I'd recommend trying the takoyaki if you're here!  It's delicious, but make sure they cool first.",
   "Ordered delivery, arrived 15 minutes faster than estimated time, came 25 minutes from order time. Best sushi I’ve had in a long time!\nThe Heart Attack roll and Cornhusker roll are my favorite. I will definitely be ordering more from here",
   "Great food! However, my boyfriend had made a reservation on Valentine's day and it was a mess. We got there early so we were able to get our food but a lot of people who had made reservations were standing outside waiting for the tables to be cleared. People were starting to get really frustrated. The servers did their best to get everything done but they were obviously understaffed. I blame this 100% on management! Everyone else was amazing!",
   "A real sushi place in Lincoln.  Miso and maki were delicious.  They have some very inventive and tasty rolls."
  ]
 },
 {
  "name": "Blue Orchid Thai Restaurant",
  "address": "129 N 10th St #111, Lincoln, NE 68508, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dabc0c52-9331-11ea-a3fc-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "walk",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10637555483023682195",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food, upscale and beautiful environment, good service. Seems to be authentic Thai food, and it tastes so good. The dishes have the perfect amount of sauces (not drenched) and are flavor filled. I’ll definitely be coming back. \n\nThe location was a bit difficult to find, so park at a garage or on the street once you’re close and then hunt down the place on foot with your phone map handy.",
   "The basil fried rice was absolutely delicious. I could have eaten it all!! My husband ordered the red curry chicken and I wanted all of his too. It was spicy but we both loved it. Looking for awesome Thai food, find it here.",
   "Great service and as always great food!",
   "Amazing flavors! It was a bit hard to find this place at first, but it's worth tracking down. It is in the center of the block, you have to park and walk to find it. The menu has vegetarian and vegan options. The tofu was perfectly cooked. The Panang curry is among the best I've ever had! If you like Thai food or want to introduce it to someone, definitely stop and check this place out!",
   "Nice quiet place on a Thursday evening. Food was Amazing!"
  ]
 },
 {
  "name": "Mary Ellen's Food For The Soul",
  "address": "Lincoln, NE 68504, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/db22bdae-9331-11ea-83f9-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "family",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3260817644773289419",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely loved it. From ordering our food to eating it was a great experience. Great customer service and great food. You can’t go wrong with Mary Ellen’s. Thank you for making us a plate! \nP.S. The peach cobbler is to die for. I love it and would love to have some right now!",
   "Always friendly, always delicious. Best spot for food and A+ service.  Definitely worth the wait.",
   "Without question, the best food truck in Lincoln. \n\nBrisket: 9 out of 10\nPulled pork: 8 out of 10\nPotato salad: 9 out of 10\nMac n cheese: 7 out of 10\nBBQ beans: 9 out of 10\nBBQ sauce (kc style): 10 out of 10\nCorn bread: 7 out of 10\nService: 10 out of 10\n\nI'm a certified KCBS judge so know what I'm talking about. Hunt this place down via their Facebook page and drive across town if you have to. Worth the trip.",
   "Amazing food.  The customer service is phenomenal.  Very nice when the owners treat everyone like they are family!",
   "They have great BBQ and you can tell they care about the food and service. They treat you like family."
  ]
 },
 {
  "name": "Vung Tau Pho Grill",
  "address": "2708 Y St, Lincoln, NE 68503, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/db682b4a-9331-11ea-a1c4-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=6730279844459930814",
  "source": "GoogleMaps",
  "reviews": [
   "There's a wonderful combo seldom seen, the traditional Pho with thin-sliced grilled pork.  It's amazing.  Everything else is also wonderful!  This food is my panacea. I could be dying of Cancerous EbolAIDS and this big bowl would restore me to full and extend my life-bar. \n\nHands down, the best Pho in Lincoln; fight me!",
   "Always good food, especially for the price. A great value. My husband enjoyed his grilled pork. It was a cold night, so I got Pho, perfect thing to warm me up. Nice neighborhood atmosphere, highly recommend. \nIf you get the Bahn Mi, ask for broth to dip it in. For lunch, you can get a Bahn Mi sandwich and a Vietnamese coffee to power you through your afternoon for under $10! So perfect!",
   "Awesome . Great food, very reasonably priced, fast, clean, and friendly staff. We got two different Bun bowls, and both were very good. The meat was deliciously seasoned and grilled, the noodles were just a little undercooked so they had the perfect texture, and the bed of lettuce and cucumber was just right. The traditional sauce is served on the side, and there are additional condiments on the table to allow crafting the bowl to your taste. We saw other people having phó, but it was 90 degrees outside, so that was out of the question for us.",
   "Best Vietnamese food in the country. Beef pho broth is incredibly rich and flavorful. Everything is top notch.",
   "By far the best restaurant in Lincoln! Authentic and delicious!!! We have been going there almost every week for a decade."
  ]
 },
 {
  "name": "Las Margaritas",
  "address": "2700 Jamie Ln, Lincoln, NE 68516, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dbc8c218-9331-11ea-bfa5-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "eat",
   "food",
   "delicious",
   "family",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14571257808201981120",
  "source": "GoogleMaps",
  "reviews": [
   "The food is so big and good prices!! So DELICIOUS!! The drinks are big and amazing as welk! Yum yum yum!",
   "Las Margaritas is a great place to go and eat. They have delicious caso (my favorite) and they serve you quickly. I recommend there food and margaritas (the most important part)",
   "Greeted by friendly staff as we entered.\nSeated promptly.\nFriendly, efficient server.\nComplimentary chips with 2 types of salsa (mild & semi hot)\nWe ordered guacamole and we received a huge portion in a cute pig mocajete, my daughter immediately wanted one. 😊\nFood served hot & promptly. \nDelicious & larger than most other places we have eaten at portions for about the same price.\nWe will definitely return when we visit family again. 💞",
   "We had a perfect experience. It was Valentine’s Day and we came in and got right in up at the bar. We had quick, friendly service. Food tasted great. I think our server’s name was Joel. Wonderful. Will go back!",
   "Attention all other restaurant owners please take note of the excellent service provided at all the Morales Family restaurants. These people have 10 star service all the way. Food is HOTT served on HOTT plate. Unlike a lot of places as of recent all plates come out at once. This seems rare in Lincoln anymore. This place is a true shining example of great business ownership small piece of Vegas caliber service. You won't be disappointed."
  ]
 },
 {
  "name": "Dino's",
  "address": "2901 S 84th St #16, Lincoln, NE 68506, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dc1d4b10-9331-11ea-b4a9-14b31f159f22.png",
  "tags": [
   "music",
   "family",
   "walking",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16891731579068724490",
  "source": "GoogleMaps",
  "reviews": [
   "Walking in the atmosphere feels more like an upscale bar then you're typical family restaurant.  Air conditioning was keeping the place very cool Ladies might want to bring a jacket to stay warm. We had to wait a few minutes for a hostess to come get us and see us.  There was no wait for seating.  We went on a Thursday around 6:00 p.m. The waitress was very cheerful.  It took her a while to get our drinks which was an iced tea and a couple of waters.  I don't blame her it just seemed they were a little understaffed I believe she was the only waitress helping customers at that time.  My tea tasted kind of funky.  Had almost a chemical taste to it.  Though I've had that same taste in tea at other restaurants so maybe at some seasonal flavor.  Either way the tea was a turn off -1 star for weird tea.  I originally came here to get the Reuben sandwich but unfortunately the waitress informed us they were out of sauerkraut.  -1 star for not keeping your kitchen stocked with necessary ingredients.  It wouldn't have been that hard to have someone run to the grocery store and buy some to get you through the day.  Since they didn't have the Reuben available I got the club sandwich instead.  The sandwich was good they used real turkey instead of deli meat which was different but a nice change.  But the bread wasn't toasted very well and ended up being rather soggy.  I feel like the sandwich could have been bigger as well.  I got the parmesan fries on the side they were good but portion size was extremely small.  My son got the bacon cheeseburger it was very good though the meat was just a tad bit dry.  Carrying on a conversation with my wife was a little difficult the acoustics plus the music playing made you have to raise your voice to be heard.  At which point every table around you can probably hear you as well.  So not much privacy for a conversation. After our meal we all used the restrooms.  restrooms where very clean and upscale TVs mounted above the urinals.  The price was about $10 a plate.  Which I feel would be a bargain if my gripes above were addressed.  I doubt we will be back it's a nice place has a lot of potential it just feels like a lot of corners are being cut, and they're severely understaffed for what little crowd was there.",
   "I haven't found a menu item I don't like. I often end up here with a large party and they've been very accommodating each time. Great servers and amazing staff have made sure our experience was stellar.\nP.S. Try a boozy shake. You'll be glad you did!",
   "This has to be the top restaurant in relation to the surrounding nearby restaurants.  It is a big place and hosts a lot of people so it's good for big groups.  I know there is a couple different seating sections and I think you could rent one out if you have a big enough party or event.  The food is quality, atleast everything I've tried, and they have some good local beer selections, which I love to see... and drink.",
   "Dino's is a great place for an awesome burger & fries, pub style pizzas, cocktails, and brunch.   Good service, relaxed and clean atomsphere are a standard here.  If you want to watch the game, there are also plenty of screens to watch and enjoy. In an easy to find location with reasonable prices, Dino's is a neighborhood favorite.",
   "Great food and friendly staff! I'd highly suggest the caprese salad with some added medium rare steak. Probably one of my favorite meals anywhere!"
  ]
 },
 {
  "name": "HF Crave",
  "address": "4800 Holdrege St Suite 100, Lincoln, NE 68504, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dc6acf0c-9331-11ea-ba0a-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "eat",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=17789715725946954942",
  "source": "GoogleMaps",
  "reviews": [
   "If I could give this place 0 stars I would. Not only was the service terrible but the food was overpriced and falsely advertised. We took our daughter here for her birthday. I ordered the risk it for the brisket burger. There was 3 TINY pieces of brisket mixed in with quite literally 3/4 cup of mayo. There was so much mayo it was pouring over the bun. It has ZERO flavor. In my honest opinion I've had better burgers at McDonald's! My husband ordered a blue cheese burger and for some reason there was a bunch of brown sugar grilled into the bottom bun, it had no flavor and didn't even taste of blue cheese at all which is surprising considering how pungent blue cheese is! Our waitress had an attitude and despite the fact that there was hardly anyone in the restaurant she was barely tending to us. Both my husband and my daughter went most of our meal with nothing to drink. For $12 per burger I would expect so much more! Needless to say I will never ever go back.",
   "Absolutely some of the best Burgers, Veggie Burgers, waffle fries and cheese curds in Lincoln. So good for a reasonable price!",
   "Excellent meal.  We just ordered carry out for 6.  They had it ready in minutes for pickup and all 6 orders were perfect!  We had a variety of burgers and we were all quite pleased.  The fries are also amazing.  Thanks and we look forward to dining in when all of this craziness ends!",
   "Ah-mazing!! Came in fairly late, about an hour before closing with a group of 8. They were absolutely happy to serve us, and we didn’t feel rushed at all. This is rare - we go to eat every Friday night around the same time and often feel rushed. Food was great, server was patient and friendly! We even stayed for dessert... the grilled cookie. Huge, we shared among 4 of us. Well worth it!",
   "Great gourmet burger options and the classics as well. Superb taste, delicious! Very fast order and serving. Highly recommend. We will be back to try more of their menu."
  ]
 }
]