[
 {
  "name": "Julius Breckling Riverfront Park",
  "address": "400 President Clinton Ave, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dcc39d86-9331-11ea-a7fb-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "free",
   "walk",
   "art",
   "walk",
   "kids",
   "family",
   "walking",
   "walk",
   "kids",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13698303629607314796",
  "source": "GoogleMaps",
  "reviews": [
   "This is a really nice park. Kids will really like the climbing area. Parking can be difficult at times. One tip is to park on the other side of the river and walk across Junction Bridge. Not only is it free parking, but more than likely you might have visited the bridge anyway during your visit. The bridge leads right into the heart of the park for easy access.",
   "The care that has went onto this park is amazing. Every where one looks you can find the most amazing art. Around every corner is a new discovery. There are two pedestrian bridges that link the the North Little Rock and Little Rock sides of the Arkansas River.\n\nBe sure to walk towards the Clinton Presidential Center and find the great wetlands bridge and educational walk.",
   "An amazing park with a lovely playground as well as a nice historical walk. Has many different historical attractions integrated within the walking path as well as having many different statues. I've came here many times in the afternoon as well as 1 or 2am in the morning. I've never had issues with bad people here nor any feeling of danger.  Great place for kids and family",
   "Beautiful park that overlooks the Arkansas river. Also has a good look at the U.S.S. Razorback a submarine that served in World War 2. Got a little crowded during the evening.",
   "This is a great spot to visit for some history of Little Rock as you walk along the river. You also have the opportunity to stop by the local shops and eateries just a short distance away from the park. This is a great area to take pictures. The family will enjoy the walk and there is a park gym that the children can play on When it is warm to hot outside there is a splash fountain or park that the kids can play in and run through. This is centrally located from several hotels and restaurants nearby and other local attractions. The Museum of Discovery is nearby for the family as well."
  ]
 },
 {
  "name": "Big Dam Bridge",
  "address": "4000 Cook's Landing Rd, North Little Rock, AR 72118, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dd134466-9331-11ea-8531-14b31f159f22.png",
  "tags": [
   "unique",
   "walk",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=17869723390477343867",
  "source": "GoogleMaps",
  "reviews": [
   "It’s a cool bridge so you can’t expect much ,but it’s a unique experience for people driving by. On the side where Burns Park is its very friendly for bikes on the side. Especially since there is many good views to look at. In the middle of the bridge is a big water stream. It’s nice seeing the massive amounts of water go down the bridge. On the other side of the bridge is not as bike friendly for it is fairly steep ,but if you really wanted to you could go ahead and go.",
   "Absolutely mind blowing how big the bridge is! Quite a modern marvel to visit! I always enjoy taking in the view from the center of the bridge. Definitely a place of interest for tourists, especially if you've never seen a river this large. I know the Mississippi River is bigger, but Arkansas River is still quite a sight to see. Arkansas is such a beautiful state!",
   "I love love love walking across this bridge.. It's our go-to place for an afternoon walk.  On hot summer days it's nice and breezy!  Have had some real jerks on bicycles speed past with no warning which is no fun..",
   "My favorite place for outdoor fun or a nice run. It is a central point of the Arkansas River Trail. The east view at sunrise over the Arkansas River is beautiful and equally matched with the west view which includes Pinnacle Mountain. It is well lit in the evening and there are benches at the top to just sit an enjoy. The distance across is almost 1 mile.",
   "Great place to walk and get the heart rate up. Too bad people don't pick up after their dogs or it would get five stars."
  ]
 },
 {
  "name": "Little Rock Central High School National Historic Site Visitor Center",
  "address": "2120 W Daisy L Gatson Bates Dr, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dd78e44c-9331-11ea-8dca-14b31f159f22.png",
  "tags": [
   "organized",
   "history",
   "tour",
   "history",
   "tour",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=2257556035071238206",
  "source": "GoogleMaps",
  "reviews": [
   "Everything is so we'll organized. Anything you want or need to know about the struggles of the past is located here. Enlightening and sad at the same time. My heart is full of joy for what is. And perplexed by what was. Blessings are so real. TGBTG🙏🙌 GIFT SHOP IS INCREDIBLE👍👍👍👍👍🤗🤗🤗🤗🤗",
   "Absolutely mind-boggling to think that it wasn’t long ago that schools were segregated. \nThe school is beautifully built and still in use today. The architecture alone is magnificent. The history behind this building adds to the feeling of reverence I felt when visiting. \nThe visitors center located across the street displays the history of the site and offers a wide variety of items for purchase.",
   "Excellent tour. Well informed park rangers. I learned so much history.",
   "This museum highlights great work in the continuous struggle for freedom and equality in our shared American Experiment.\n\nThe exhibits can we enjoyed from anywhere to 30 minutes to up to 2 hours. \n\nAlso there are several book titles available in the gift shop as well as National Park passports, stamps, t-shirts, postcards, etc.\n\nThe staff are very friendly and helpful. They're also clean restrooms which are easily accessible by the physically disabled.\n\nJust across corner to the visitor center is Central High School which is still a functioning for year senior high school. If you wish to go on a tour it is an necessary to call ahead and or go online to sign up for the tours which are only available twice a day.\n\nAcross the street you can see the fully restored filling station which offered the public telephone which the media used at the time.\n\n I'm so grateful to the National Park Service for this facility which offers education and reflection on difficult and painful journey our fellow Americans have beared and the good we have all benefited from despite powerful forces that desire to keep us mired in hatred, divided and suffering.\n\nSee you on the road,\n📸 🙋‍♂️@gabrielcraft.me",
   "Loved our experience at the central high school. Great knowledgeable rangers who give you much more insight than the textbooks share."
  ]
 },
 {
  "name": "The Witt Stephens Jr. Central Arkansas Nature Center",
  "address": "602 President Clinton Ave, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ddb8d3ae-9331-11ea-aec3-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "walk",
   "eat",
   "food",
   "kids",
   "learn",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=3096597327974663105",
  "source": "GoogleMaps",
  "reviews": [
   "Cute little place to visit if you're in the area. We spent about 20 minutes here. It's free, so don't expect a whole lot. It has a small aquarium woth some interesting fish, and turtles. Very educational spot with lots of small historical items. The gift shop has cute items for kids and adults at reasonable prices.",
   "This place is so much fun! We eat and hang out  in the food court at the River Market and walk over to see the fish while we are there. My 8yo daughter loves to find all the different fish listed and feel the fur of all the different animals. My 2yo enjoyed it also, watching the fish, especially the leucistic (not albino) gar! It is so neat!!",
   "It is nice to see. Informative for kids. Its a small place",
   "Great place to learn as an adult or Explorer with kids of all ages. All at no cost. All funded by the Arkansas Game and Fish Commission (I think 🤦🏾‍♂️)\n\nFor Local Business Owners: Contact me if you would like me to visit your establishment and give an honest review.\n\n....OR if you would like a free online/social media audit which will highlight some areas where you can improve.  I'm here to help. 🤝",
   "Prettiest and different flowers. I’ve learned more about gardening just from watching how/when they plant."
  ]
 },
 {
  "name": "Old State House Museum",
  "address": "300 W Markham St, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/de206f7a-9331-11ea-bcaa-14b31f159f22.png",
  "tags": [
   "free",
   "walking",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=4679743598728721160",
  "source": "GoogleMaps",
  "reviews": [
   "What a wonderful place to enjoy strolling around looking at items that are apart of historical events. The Museum has some old fashion flair and could use more interactive features like holograms life of old presidents or just Arkansas in general..The best part this place is free to enjoy on a nice day when you walking the Downtown area I definitely recommend this place as a hidden gem.",
   "Informative, and interesting. They could make It a little more fun, more personality with staff would be good. I enjoyed it, especially the gowns, and hand made blankets.",
   "The grounds were beautiful and had a couple of exhibits. The museum itself was free if I'm not mistaken and we wandered through the whole place. Arkansas has spent a considerable amount of money on this building and I highly recommend that you visit if you're in this area. There is a lot to do in this immediate part of town but it only took us about 20 minutes.",
   "Thought was the state museum.. just hx old state house. Some artifacts mainly boards with pix..  skippable unless a political fan.. could be great... wish more like PA state museum. In cool area off the trolley line.. love the trolly.. close to the water.. really nice staff..",
   "It isn't action movies, but it is history! Marvel at the elegant architecture and beautiful furnishings, and then lose yourself in the extraordinary heritage of early Arkansas and the people who shaped the future!"
  ]
 },
 {
  "name": "Historic Arkansas Museum",
  "address": "200 E 3rd St, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/de77904a-9331-11ea-9de6-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "learn",
   "historic",
   "free",
   "tour",
   "free",
   "kids",
   "art"
  ],
  "link": "https://maps.google.com/?cid=15678007188619841545",
  "source": "GoogleMaps",
  "reviews": [
   "This is an amazing place to learn about history. They had beautiful quilts. Gorgeous hand made knives and a section on American Indians. You can choose to pay $2.50 to see historical buildings. One that is said to be oldest in Little Rock. Excellent experience. Don't hesitate to go.",
   "You will always learn something on the tours of the older construction, and the attached museum has incredible exhibits and connections rotating through.  A true gem.",
   "This is actually a great museum. It’s got two sections. The first is an 1800’s village that you can take guided tours of for a small fee ($1.50), complete with a print shop, pub and some other cabins and houses. The second section is the main museum itself (free), with tons of exhibits, ranging from artifacts from the daily life of early Arkansans, Native American artifacts, Civil War artifacts, early exploration artifacts, and more. Definitely a good stop when you’re in historic downtown.",
   "Absolutely loved this museum! It's free to tour the gallery and they have guided tours for a small fee. The gift shop has lots of interesting little items. I picked up a very tiny mason jar of honey and a bat magnet. The artwork and artifacts here are pretty tame so its a good place for kids. I highly recommend checking it out.",
   "The place is huge with some awesome art. Very cultural and I appreciate it!"
  ]
 },
 {
  "name": "Rock Town Distillery",
  "address": "1201 Main St, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dec0f5ac-9331-11ea-abdd-14b31f159f22.png",
  "tags": [
   "delicious",
   "tour",
   "tour",
   "tasting",
   "delicious",
   "drink",
   "tour",
   "free",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=9572137905017019745",
  "source": "GoogleMaps",
  "reviews": [
   "Had a good time on a tour here - and delicious samples at the end. Learned a fair bit from our tour guide, too. I recommend both the tour and the spirits, which they sell seven days a week.",
   "It’s just gorgeous and absolutely amazing selection. it’ll blow your mind beautiful indoor setting. The service and staff are  awesome they bend over backwards for you.  Just an absolutely amazing selection located in a beautiful section of town it’s a must if you like your Bourbons and vodka.",
   "What a very nice distillery! Tour is good, tasting is excellent of all their products. I'm a bourbon lover but wound up buying their whiskey cause it's pretty damn Good! They have a nice bar area on site too. Nice to be able to have a tour and then spend some time at the bar",
   "Tour was great! It was over an hour long so you def get your moneys worth. You also get free tastings which was awesome!  They have delicious cocktails. I had the drink of the week and it was fantastic! Only $5 too! The place is very clean too. We will be back!",
   "For connoisseurs great experience. Loved every bit of the tour."
  ]
 },
 {
  "name": "Mac Arthur Museum of Arkansas",
  "address": "503 E 9th St, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/df0cf300-9331-11ea-874b-14b31f159f22.png",
  "tags": [
   "free",
   "history",
   "history",
   "walk",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13410887565829847636",
  "source": "GoogleMaps",
  "reviews": [
   "A nice little museum showcasing US military, especially in reference to Arkansan military. This is one of the oldest buildings in Little Rock and is the site of many important Arkansas events, such as the start of the Civil War in the state, as well as the birth of General Douglas MacArthur. It’s got some decent exhibits on all manner of wars where Arkansas citizens are involved, as well as some on the acclaimed general and the suffragettes. Best of all, it’s free admission. Might as well go if you’re in the area.",
   "Learned some Arkansas history.  I just recently moved here.  The historical objects were artfully displayed.  Our docent was informative.  Cool building and grounds.",
   "Birthplace of Gen. Douglas Mac Arthur in 1880.  Its a Great museum to the early history of The Arsenal in Little Rock , which was used as a frontier Arsenal and Command camp for AR and FT Smith. In the time when the AR became a state and it closed in 1890.  \nHolds  military artifacts from 1840 to 1970 \nAnd Gen Mac Arthur memoribilia.\n\n\" An old soldier never dies , they just fade away.\"   God Bless all , safe travels.",
   "Went on a trip with a bunch of friends and we had a great time! Loved all the exhibits and the little presentation we got at the beginning :)",
   "This museum has something for everyone! Civil War, WWI, WWII, Vietnam. I especially loved the room with war posters. If you like a guided tour there's even an option to call a phone number for one as you walk around. Definitely recommend this museum if you're in the area and love history."
  ]
 },
 {
  "name": "Esse Purse Museum & Store",
  "address": "1510 Main St, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/df501690-9331-11ea-b092-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15464816709444071304",
  "source": "GoogleMaps",
  "reviews": [
   "What a fun lo a gem! Museum takes about 20-30 minutes to walk through and a fun little stop! The store has many unique purses, wallets, and jewelry! Great stop in Little Rock! Staff is super friendly as well! Gave great reccs for local places!",
   "Cute shop.... DON’T waste your money on the museum part",
   "What a treat of a Museum with lovely hosts on a fabulous road in downtown Little Rock! \nI spent an hour visiting the Esse museum with my 3 little daughters and we were transported back in time and memories as I recognized handbags that my grandmother used, then the types of handbags that my mother/their grandmother used and finally the type of handbags I used as a kid in the 80's and 90's! My daughters loved the different stories and styles! My 8-yr old wanted to walk through the museum again and spend all her pocket money on handbags and jewelry in the shop full of eye-candy delights!! We will most definately return when my girls are a bit older for another fun mother-daughter date and shopping spree!!",
   "Definitely worth visiting! For fashion and arts lovers this museum is a must! Well curated and interesting content about women fashion!",
   "Fun place to spend 30-45 minutes. I brought my teenage daughter. I wouldn't pay to take kids though they wouldn't have appreciated it very much."
  ]
 },
 {
  "name": "Arkansas Arts Center",
  "address": "2510 Cantrell Rd, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dfad03f6-9331-11ea-a18d-14b31f159f22.png",
  "tags": [
   "theatre",
   "family",
   "free",
   "art",
   "art",
   "food",
   "art"
  ],
  "link": "https://maps.google.com/?cid=13341051348297696437",
  "source": "GoogleMaps",
  "reviews": [
   "Great venue for children's theatre. Since the remodel, the theatre is a nice place to introduce your family to the arts. I have also attended a catered wedding here...It was really nice.",
   "I enjoyed this place a lot! Great pieces to enjoy throughout the museum. Best part? It was free! ",
   "The Art Center is a wonderful place. Their collection is varied, and wonderful. They have paintings by Monet and Picasso, sketches by Rembrandt, and a range of pottery, jewelry, vessels, and urns that range from a few hundred years old to a over thousand years old. They have rotating exhibits the feature a lot of artists that are from the area. The have a restaurant, gift shop, children's theater, and they offer amazing classes year round from woodworking to painting to making jewelry (metalsmithing). It's a must see place.",
   "Dining at Canvas restaurant located inside the Arkansas Art Center was terrific. We held our sister's birthday party there. The manager and staff went over and beyond the call of duty. The food was excellent!",
   "Great art center, a lot of diversity"
  ]
 },
 {
  "name": "Arkansas Inland Maritime Museum",
  "address": "120 Riverfront Park Dr, North Little Rock, AR 72114, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dffad5fa-9331-11ea-b41c-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "knowledgeable",
   "tour",
   "tour",
   "kids",
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=9401581648013172689",
  "source": "GoogleMaps",
  "reviews": [
   "The Razorback tour was great! Our tour guide John was very knowledgable about the subs history and operation. It was really a treat to step back in time and see where the crew lived and worked in the original tiny home of the sea.\nThe staff at the museum are very friendly and helpful.",
   "Nice little museum, it's a fun 2 hours to spend between stops. You get to tour the sub with a knowledgeable guide. Good times for an old sea dog and his kid.",
   "Excellent ww2 submarine tug boat museum. Right on the river I say this is very cool. My 3 year old couldn't tour the sub (must be 5 years old). So we walked around the museum and tight boat while the wife took the rest of my kids for the 40 minute submarine tour.",
   "My husband was extremely enthusiastic about this tour. I loved it too but didn't care so much about all the facts and figures. The size and where everything was stashed is what amazed me. Tour guide was very knowledgable.  We had a few questions that he was able to answer. I bought a book in the gift shop and it is one of the best books I've read (and I read continually). Bonus We saw about a dozen turtles on their shore.",
   "This is a wonderful place to visit in Arkansas. We actually get get to go inside of a submarine and the tour. I would recommend this to everyone who goes to Little Rock."
  ]
 },
 {
  "name": "The Heights",
  "address": "5450 Kavanaugh Blvd, Little Rock, AR 72207, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e04e2654-9331-11ea-a9de-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=15646376846037540563",
  "source": "GoogleMaps",
  "reviews": [
   "The Heights Little Rock Neighborhood is truly a spectacular place to live work and play.   The Heights offers all of the above.  If you want it, check  out The Heights!  This new construction residence offers over 2 story, 3000 square feet, 4 bedrooms, 2.5 baths with the master bedroom on the main level.  Please inquire for more details.",
   "It is so easy it makes you feel alive.",
   "Side walks need work, probably why everyone walks in the street.. but beautiful gardens, neighborhood.",
   "Great place for families.",
   "I don't know\n"
  ]
 },
 {
  "name": "The Bernice Garden",
  "address": "1401 S Main St, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e0afce90-9331-11ea-bc9a-14b31f159f22.png",
  "tags": [
   "tour",
   "family",
   "food",
   "music",
   "music",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=1124392713265070932",
  "source": "GoogleMaps",
  "reviews": [
   "It's a little hard to see from the street, so in this case watch carefully. Parking is somewhat limited, but that's pretty much everywhere in downtown Little Rock. We took a self-guided tour. If you aren't familiar with the plants, I suggest you use an app like Picture This or Bixby Vision to help identify the plant. If you're hungry the River Market is nearby, as is Community Bakery. Sometimes you can also find a food truck on or near the premises. On to the garden itself. I found it well maintained and quite peaceful for a downtown garden. It is not as big as I expected but if you have children or elderly family members with you, that could be a plus. It was a cold fall day when I went. I would love to visit the garden again in the spring! There are a few homeless people around, so just be aware of your surroundings and choose an appropriate time for your visit.",
   "The Garden was fun tonight with a 70's theme and Disco music. Lots of folks who were too young to remember the decade were dressed for it and having fun!\n Sharon and I danced a bit and smiled the whole time. Join us next time!",
   "This here place is what I like to call the garden of recognition and peace. Was just there around 3 days ago. I enjoy going here basically because every item there has a connection with all things that's in that area 🤔 So Be it😉 as I was saying everything there shows a form of spiritual dedication and I enjoy going there listen to the soft music and watching the animals fly crawl and of course jump from tree to 🌲 all in all I like to keep in touch with such said places. It's in my Spirit to do so. And thinking on the spiritual subject, It's getting about round the time to check the locks foundation. I have one on the channel lock post also 😁😉😇💂🕴️👣💨",
   "Such a neat place to stop and enjoy. \nWould be better if it wasn't a homeless hangout.",
   "Really like this place, whether its when they have food trucks or farmers market. Love the live music, a lot of talent there. Close to some cool shops."
  ]
 },
 {
  "name": "William J. Clinton Library and Museum",
  "address": "1200 President Clinton Ave, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e1310cdc-9331-11ea-81e5-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "food",
   "library"
  ],
  "link": "https://maps.google.com/?cid=8035004359637958132",
  "source": "GoogleMaps",
  "reviews": [
   "Even though I didn't care for him or his wife, this is a really nice museum with lots of photos and history. It's a rip-off to get a photo at the (reproduction) resolute desk in the Oval Office. If you want a photo it's $15.00! ridiculous. Since this is supposed to be history.....how about something along the lines of Monica.....that was a big piece of history that was conveniently forgotten to be added.",
   "Every time I visit. I see something new. Great place to get some great history on the 32nd president and the first look into the bridge to the 21st century.",
   "Food in the restaurant was good, and the grounds on the river were beautiful in the fall, however the museum itself was a snoozer.  Very boring.  It needs to be updated with some interactive displays or something interesting besides letters from celebrities.  The Foundation room was closed.  Didn't take long to go through it.",
   "We had such a fun time visiting here today.  We were especially excited to see the 90s exhibit that is currently here.",
   "Modern architecture. Endless information. Great exhibits that are always changing. The presidential library is a must see."
  ]
 },
 {
  "name": "Mosaic Templars Cultural Center",
  "address": "501 W 9th St, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e181c52e-9331-11ea-b612-14b31f159f22.png",
  "tags": [
   "historic",
   "tour",
   "theatre",
   "tour",
   "free"
  ],
  "link": "https://maps.google.com/?cid=7616183010276127830",
  "source": "GoogleMaps",
  "reviews": [
   "It is a beautiful historic museum. The staff was accommodating.  There was some difficulty with light during our induction ceremony,  but it was solved within mintutes.",
   "Clarity and fascinating displays of honor, care, and devotion into moral psychology that I lost for two hours and haven't been able to get all the way to the end of the displays. Definitely worth returning to more than once.",
   "Extremely informative, the guided tour was well paced and allowed for time to explore the exhibits for yourself. The third floor has a nice ballroom for large events.",
   "It's a very education place I learned a lot of new things I didnt know",
   "The Mosaic Templars Cultural Center is housed in an incredibly beautiful old building in downtown Little Rock.  There are galleries, a theatre, and a gift shop within.\nIt is free to tour and also hosts a variety of wonderful events and productions."
  ]
 },
 {
  "name": "H.U. Lee International Gate and Garden",
  "address": "101 E Markham St, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e1ece35c-9331-11ea-990d-14b31f159f22.png",
  "tags": [
   "walk",
   "free",
   "unique",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2011401497964952585",
  "source": "GoogleMaps",
  "reviews": [
   "It's a small, yet scenic garden. A peaceful stop for those who practice ATA taekwondo, and others!",
   "This is a very interesting place to see. Very calming and relaxing. Interesting story of the entrance.",
   "An incredibly reverent and serene location to sit and be. Quite the memorial, I wish I had met the man it represents. Visit if you can.",
   "Great place too sit, rest and meditate in the busy city. The best parking directly across the street only $3 for first hour. Or a short 15 min walk from free parking! Pet friendly with leash!",
   "A special place to all members of the ATA, but also has some unique features of Korean culture that can only be seen here or in South Korea with some specially authorized statures that were imported just for this garden. \nSee the history and legacy of ATA's founding members and high ranking masters.\nAlso the site of the ATA Masters Ceremony for the past several years. A worthwhile trip for all martial artists of Korean training and especially ATA Students."
  ]
 },
 {
  "name": "Museum of Discovery",
  "address": "500 President Clinton Ave, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e23efb2e-9331-11ea-b283-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "kids",
   "family",
   "kids",
   "learn",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16338434694446452897",
  "source": "GoogleMaps",
  "reviews": [
   "Very reasonable membership. $85 for 5 family members. Staff seems friendly and pleasant. I take my 1 year-old son almost everyday.  Kids Play room have a nursing room with a changing table which I think it's great! Normally there is a staff at each section so if you have a question they are there to help you. Machines are kept clean. Great place to entertain kids for few hours with no hustle.",
   "The Museum of Discovery is a fun and imaginative place to go to. There is 3 floors of fun like a bed of nails, a robot Spirograph, and a room with a presentation what it’s like to be in a tornado. The museum is especially fun with kids because they get to experience new things. They have so many things you can’t do them all. An overview of The Museum of Discovery is that if your near the museum I definitely recommend going the here. It’s a very fun experience.",
   "Wonderful place. In homeschooling my 6 year old and this is one of those places I look for in every city to give her ideas and inspiration to discover how modern technology works. We really our day as a family discovering new things.",
   "Great for kids. Especially younger ones. Only a few displays get updated though so you can't go regularly. I am sure this comes down to funding and they do what they can do if you have the money to make a large donation I recommend doing it to benefit the kids interested in science.",
   "Really fun. My girlfriend and I are 30 and we had fun for an hour and a half checking everything out. This would be a great place to take kids for a few hours to learn about science in a fun way. Just a heads up, the tornado simulator is fairly loud."
  ]
 },
 {
  "name": "Burns Park",
  "address": "North Little Rock, AR 72118, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e29a8902-9331-11ea-b6d0-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=18303069099405761385",
  "source": "GoogleMaps",
  "reviews": [
   "Great soccer complex and running/biking trails",
   "We always have a great time at the park. So much to do and see.",
   "Nice long trails to explore with ur family, bridge, soccer fields, baseball fields, concerts.",
   "They took out the original batting cage",
   "Great place to take your kids and have family time"
  ]
 },
 {
  "name": "Pinnacle Mountain State Park",
  "address": "11901 Pinnacle Valley Rd, Roland, AR 72135, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e315378a-9331-11ea-a053-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7415151776586774696",
  "source": "GoogleMaps",
  "reviews": [
   "I love nature/outdoorsy activities but the bugs hate me.  My first time was in 2005 through the east summit trail, tougher hike. I accidentally kicked a wasp's nest and got stung on each leg.  The east summit has bigger rocks and can get quite steep-- getting on all fours would be recommended. We took the west summit trial this time (1.5 miles total).  There were bumblebees swarming everywhere, but didn't get bit (thank goodness).  Unfortunately, I went after a  night of drinking and so it took us over an hour just to reach the top (due to multiple breaks) and only 30 minutes going back down. I thought the hike down would be scary due to some steep inclines, but it was fairly quick and easy. There are small loose rocks than can make you slide and sprain an ankle so look where you are stepping. I slid, but thank goodness it was a light fall.   It's best to pay attention to the yellow painted rocks/trees and it guides you where to go and probably the easiest way to hike.  Luckily my friend knew to stick to the left coming up as it is the easier, less steep hike.  The trails are laid out with rocks to step on (some may be slippery due to some sand), but for the most part, the path is clear-cut.  There is an area where you hike up nothing but big rocks (that was the fun part for me). It can get dangerous.  I somehow ended up bleeding from a large scratch, but I was probably too tired to feel a scratch on my leg. I didn't notice this until after the hike was completed.\n\nThe hike, overall, was pretty much shaded thanks to the trees, but unfortunately the summit is not.  Once you reach the top you're fairly tired and want to rest, but if you go on a 100-degree day like we did you cannot sit up there and enjoy the view for long. I ran out of Gatorade by then. The view is worth it!   I enjoyed it and would like to hike it again in the fall.  Pack plenty of water!",
   "A nice quiet place to relax, hike, fish, boat, and just be...chill. Plus the roads are great! It looks amazing! Go see the view from the top of the lookout!",
   "Great spot to get outdoors without having to drive too far out of the city. I like going on weeknights to avoid the crowds. The East Quarry trail is my favorite!",
   "I love this place. Lots to do in the park. The climb is not too difficult; beautiful views from the top. It's just a steep uphill walk with no climbing skills needed.",
   "Climbing Pinnacle is an experience that every able Central Arkansan should try at least once.  There is a reason you see so many selfies from the top--it's truly gorgeous."
  ]
 },
 {
  "name": "Little Rock Zoo",
  "address": "1 Zoo Dr, Little Rock, AR 72205, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e35797fa-9331-11ea-a8ba-14b31f159f22.png",
  "tags": [
   "kids",
   "eat",
   "kids",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=8740204647355742622",
  "source": "GoogleMaps",
  "reviews": [
   "For Little Rock not being a big city (I'm from San Diego where the zoo is world renowned), I am very impressed by this zoo. They are always making it better. We got the annual pass this year and it is a great value! Lots to see, clean and fun environment. The kids love it!",
   "Fantastic zoo! Great staff and beautiful animals! This park is easy to navigate. There is a great restaurant to eat lunch and cool off! Very kid friendly with a little kid zone, which contains slides and other play equipment. There is a train that runs through the zoo as well. The animals are close enough to see easily and take great pictures!",
   "I’ve been to my fair share of zoos and this zoo is amazing!! I was so surprised going for there for the first time. They have so much there, it is very nice, and the staff is friendly. We ended up buying a season pass on our first visit. A great place to take kids of all ages in Little Rock!",
   "The zoo is awesome and seems to always be renovating to make life for the animals the best as possible. One interesting thing about the Little Rock Zoo is that a lot of the animals they have are geriatric and the staff takes awesome care of them. The staff is also great about educating guests on the various animals located at the zoo and answering any questions you may have.",
   "What a Great time at the Zoo.\nPerfect weather on a Sunday afternoon. $12.95×2 Adults was very affordable. Scenic train on a random schedule due to overheating issues. Soda machines everywhere. Bring quarters to feed the Koi Fish.\nMe and a good friend walked around for hours. Hadn't been to a zoo in 25 YEARS. \nBring your own lunch, the cafe was out of Coke & French Fries..gift shop is small, but not over priced.\n$3/ Person for Mini-Train ride..\nGreat Job to the whole staff working..we shall return for a membership now.."
  ]
 },
 {
  "name": "Altitude Trampoline Park",
  "address": "15707 Chenal Pkwy, Little Rock, AR 72211, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e3c50006-9331-11ea-93b7-14b31f159f22.png",
  "tags": [
   "kids",
   "parks",
   "affordable",
   "kids",
   "family",
   "parks",
   "music",
   "kids",
   "music"
  ],
  "link": "https://maps.google.com/?cid=13863486984983531029",
  "source": "GoogleMaps",
  "reviews": [
   "Great place!! Fun, wide open and tons of room to jump and play! Friendly, awesome staff! Much more affordable than other so called trampoline parks. This one actually has TONS of trampolines plus lots of other stuff! Kids loved it!!",
   "This is an awesome place. Everyone loves it. No more specials or discounts. It was empty when we went. Had the whole place to ourselves.",
   "First of all the kids love it. They had me drive to Little Rock from our hometown of Searcy rather than going to Conway. I understand that Conway has a similar trampoline park. This particular trampoline park is huge. It has dozens and dozens of trampolines and activities associated with trampolines. There are virtual reality games, basketball goals video games, etc... there are a lot of family size picnic tables that you can set it to have your pizza, nachos, chips and candy that you can get at the snack bar at pretty reasonable prices actually. They have bottled drinks and believe it or not the bathrooms are pretty clean. You would think with hundreds of kids coming to this place daily bit by this time a day which is around 7 PM and our close on Sunday, that the bathrooms might be disgusting. Well anything but disgusting they actually smelled nice and are very clean. Sure you’re going to see a little paper laying around here and there but the men’s bathroom is actually clean.  The price was basically $20 for two hours per kid. Plus there’s a new added bonus of that you must buy a pair of their traction socks or grip socks and an additional two dollars per kid. This is a little different than most trampoline parks. Most trampoline parks will let you use the socks you bring The price was basically $20 for two hours per kid. Plus there’s a new added bonus of that you must buy a pair of their traction socks or grip socks and an additional two dollars per kid. This is a little different than most trampoline parks. Most trampoline parks what do you use the socks you bring., Then The grip socks at two dollars each are optional. Not crazy about that , But I understand you need to create various streams of revenue to operate a business. It’s set me back eight dollars plus tax so not too bad I guess. One thing I do like about this trampoline park over the other ones I’ve been to is I can actually hear myself make this review while using voice text. There is music but it’s not so loud that I can feel it in my teeth. Don’t get me wrong I like music but they figured out a good balance for us parents who want to watch videos or TV on the phone while we wait for the kids.  I understand they have party discounts as well or group discounts. I’m not sure about the pricing on that but I know if you give them a call or check their website you could most likely find out easily. If you’re in the little rocky are you or what we are 50 miles away and decide you want to try a trampoline park give Altitude a shot I think you’ll be happy. And I know the kids will be.....",
   "No rules enforced and big kids were running full speed and tackling each other. Plowing into the little ones, pushing them out of the way. My kid got plowed and didn’t want to go back in the trampolines by herself. No employees anywhere to control unsafe behavior. Someone threw a crushed water bottle on a trampoline and it was there until I picked it up. The bathroom was beyond disgusting. It could be a great place if their own supposed “rules” were enforced and the bathroom was sanitary. The trampolines are fun.",
   "My boys love coming here. Staff is friendly and helpful. Always clean! My boys have a blast everytime we come. Love the socks 😉😁 and the boys think its awesome they get to take them home. I do wish there was different music played more kid friendly.. like 93.3 the fish. Or klove so its all positive and not promoting sex and  worldly activities  that would be my only request.  We need more Jesus in this world . Especially for our children. Amen."
  ]
 },
 {
  "name": "Central High Museum",
  "address": "2120 W Daisy L Gatson Bates Dr, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e412f928-9331-11ea-94e9-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "history",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5950371790359604572",
  "source": "GoogleMaps",
  "reviews": [
   "Fascinating history and sad at the same time. Can’t believe what happpened in the late 50’s. We got the tour but we did not go in because of the corona scare going on! Bummer!",
   "Grounds seemed to be well maintained as every national park is I have been too.  Tours are available of the high school along with many audio visual historical documentations.",
   "Awesome trip! Our NPS Ranger Randy gave great presentation on the history and importance of this site! He brought it to life...feeling history is always better than just reading about it.",
   "There were news reels of the event where the kids were barred from entering the high school based on race. No thought how smart or interested they were in learning. Pictures of people obviously making their life uncomfortable.  Hopefully those people realized their error later in life. The barred kids acted courteously and refused to meet hate with hate. Non-violence worked for them. Those kids and parents were BRAVE.",
   "This is a great museum for those interested in the modern American civil rights movement. For those of us who have witnessed that struggle, Central High is an awesome place to visit."
  ]
 },
 {
  "name": "Arkansas Governor's Mansion",
  "address": "1800 Center St, Little Rock, AR 72206, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e46a8f4c-9331-11ea-bb50-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=14892434474984539269",
  "source": "GoogleMaps",
  "reviews": [
   "Beautifully decorated home. Attended an open house around Christmas time in 2016 with my grandmother. Mr. and Mrs. Hutchison were extremely friendly when we met them. We had a wonderful time seeing all the different rooms in the house. The place was packed and everyone seemed to be having a great experience. The staff members were all very professional and the grounds were kept well. Overall it was an extremely rewarding experience and I hope they will hold another event like this again sometime soon.",
   "Wonderful Christmas decorations and a nice greeting by Governor and the first lady of Arkansas.",
   "Very expensive home for a governor and not any tours available to the public. The Mansion is very big and very well covered by vegetation. It would be nice if they had a way to allow the public to get in and to park. Instead of shutting out the cut the public they should want to include the public. Can't wait to see if they do that.",
   "Immaculately well kept grounds and manicured landscaping. This building is historically at the center of what happens in Little Rock and is filled with a busy schedule of galas, meetings, hosting and other events.",
   "The mansion is gorgeous and the First Lady was so gracious!"
  ]
 },
 {
  "name": "Boyle Park",
  "address": "2000 Boyle Park Rd, Little Rock, AR 72204, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e4bd6a66-9331-11ea-a397-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6539049716460829786",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to go and enjoy the day. I love outdoors!",
   "The park is so nice and relaxing. Good for kids and adults 😌",
   "The park is really clean! If you are looking for a park that is pretty lonely, this is not the one for you! There is always people here but that's fine. The park is so big its almost like your the only one there. There are several pavilions and grills. You can fish here and walk trails. The playgrounds (there are about 2 scattered around) are amazing!! I've been here as a kid and still fascinated by how cool the playgrounds are.",
   "Massive park so has a secluded feel even when plenty of people are around. Nice escape from the sounds of the city. Good for bird watchers.",
   "Wonderful park. It has plenty of room for kids and many different family's to have their own space without bothering us. It also has a very peaceful trail, a great way to excape nd get a piece of mind"
  ]
 },
 {
  "name": "Two Rivers Park",
  "address": "6900 Two Rivers Park Road, Little Rock, AR 72223, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e528136e-9331-11ea-921f-14b31f159f22.png",
  "tags": [
   "walking",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3852413415211130700",
  "source": "GoogleMaps",
  "reviews": [
   "Had a nice time hiking down to the river, and spent some time in the kayak.I did find a nice little fishing spot. From 10 take 300 till you see a soccer park\nRight across the street there is a boat ramp. Small though. Lots of crappie and channel cats. Liver is a must.",
   "Great trails for walking and many friendly people too!",
   "Nice park with several trails for jogging or biking. There are places you can park along the trailheads to access the trails and the river. Clean restrooms, posted trail maps, benches and a bike repair station. This park felt very safe and is well-maintained. Nice neighborhoods nearby.",
   "My wife and I visited herefor a afternoon bike ride. It was absolutely amazing the scenery was gorgeous the park was very neat and clean. A train came by on the mountainside it was beautiful. We definitely recommend this park for biking and walking",
   "Great Park! It is close to town but feels remote. The paths are paved and frequented by bikers, runners, and walkers. So everyone should feel safe and welcome."
  ]
 },
 {
  "name": "The Old Mill",
  "address": "3800 Lakeshore Dr, North Little Rock, AR 72116, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e5918410-9331-11ea-b0cd-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=13753738084307160303",
  "source": "GoogleMaps",
  "reviews": [
   "The Old Mill is a old place that’s great to spend the afternoon any day. The mood of the Old Mill is very relaxing and you can’t get mad there. The bridge ,the mill, and even the entrance are all charming to go to on a good day. I recommend going to the Old Mill if your in the area. It’s a good place to relax to.",
   "Stopped for lunch in Little Rock on a road trip- DEFINITELY worth the slight detour!\n  I loved this spot & can't wait to come back when it's warm (Still worth checking out in January!) \n  >5 min drive from the riverfront. Street parking in a neighborhood.",
   "Beautiful historical park, nice paths, and views.  Artwork and sculptures are wonderful and imaginative.  Some of the walkways and bridges are difficult to walk over for the disabled.  Wonderful place to visit for an hour or so.",
   "Great historic park. Small but very beautiful with pond waterfall and bridge. The focal point is the old mill of course. The place is quiet and good for family for take some good photoessays there",
   "We loved it here! Picturesque and quiet. Plenty of space to kill about and then a nice stroll around the stream! Such a lovely place!"
  ]
 },
 {
  "name": "Downtown Little Rock Partnership",
  "address": "101 E Capitol Ave #106, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e5fe28ac-9331-11ea-84b7-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walk",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17161584732611447480",
  "source": "GoogleMaps",
  "reviews": [
   "FOOD TRUCK FESTIVAL WAS GREAT! Delicious food and the weather was PERFECT!",
   "We only stayed here 1 night, but I would recommend this hotel to anyone visiting Little Rock. The location is convenient to the bustling River Market area. The hotel also has a shuttle if you prefer not to walk. The warm cookies they offer at check-in are wonderful. We stayed in a king room with a city view. The bed was comfortable and the air conditioner worked well. I like a cool room and I was able to keep it that way. The bathroom looked like it had been updated. There is no longer a tub, but a walk in shower instead, with tiling all around. Parking would be the only negative for this hotel. There is a large underground parking lot attached, but I had to circle several times to find a spot. Then it was quite a walk to the hotel entrance. They will validate your card, though, so at least it is free. All the staff was very friendly and helpful.",
   "Love the Downtown area,there is so much to do and see. The murials on the walls are great.",
   "I visited to look around and to see what's in the building. Never been inside. Curiosity satisfied.",
   "Food truck festival was amazing! Can’t wait to go back next year."
  ]
 },
 {
  "name": "T.R Pugh Memorial Park",
  "address": "North Little Rock, AR 72116, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e6674b00-9331-11ea-84e0-14b31f159f22.png",
  "tags": [
   "free",
   "parks",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9852214148803471343",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to come and relax while taking a trip back in time to the early 1800s. The scenery of the whole place is absolutely lovely. I enjoy places like the most while I'm traveling.",
   "Beautiful place to take pictures. We will definitely be back when its warmer to get more pics taken.",
   "Absolute beauty. Well kept. March 9 ...flowers, wildlife and bayou.",
   "The old Mill, great place to visit and relax. The mill was featured in Gone with the wind,  just got a major upgrade to make the waterwheel work again, the path has a couple of bridges(made to resemble wood) to the mill itself, which has 2 levels, the stairs are on the inside. A couple of fountains have been added. The mill area is also part of a bigger lake, which has recently been drained and cleaned out and had renovation work adding some docks for the locals who live across the street.",
   "We were disappointed in the Riverwalk Market area. It is great if you want food or drinks but shopping was VERY limited. The streetcar was nice. Showed locations of all the museums and it is free! All of the little parks are worth a visit. You probably won't need to pay for more than 3 hours parking though."
  ]
 },
 {
  "name": "MacArthur Park",
  "address": "1000 McMath Ave, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e6c4384c-9331-11ea-a55d-14b31f159f22.png",
  "tags": [
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=18302662121566733152",
  "source": "GoogleMaps",
  "reviews": [
   "The pond provides recreation for kids and adults who wanted to fish. They stock trout in winter and cat fish during summer. I would recommend not to feed ducks there as their huge population already of them.",
   "Really great park with lots of puppies hut the water wasnt working so lots of the dogs who didn't bring water were very thirsty!",
   "A very well maintained park.   We came here for the dog park but were impressed by the park in its entirety.",
   "Awesome place to take a history lover. Great place to honor those who fought for our country.",
   "This park is near and dear to my heart. I went to elem. school and lived near the park as a child. A lot of fond memories that i cherish. The park has changed over the years but the warmth and hospitality hasn' t.  I go back and visit every chance i get!"
  ]
 },
 {
  "name": "Burns Park Funland",
  "address": "25 Funland Drive, North Little Rock, AR 72114, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e72a7494-9331-11ea-90c8-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13818492943699694191",
  "source": "GoogleMaps",
  "reviews": [
   "My son always enjoys Funland. When went to Funland holiday express party to see Santa. The Santa they had was very nice and looked the part. The only problem I ever have with Funland is that they don't have enough employees so you have to wait for them to walk over to the other rides.",
   "Place is pretty cool, always kept clean and is under new management. The new manager, Betty, is great. They have your family's best interest at heart. They recently just had the concession stand painted and are doing some work to the exterior. A lot of time and effort is being spent on the place. The city always keeps the park cleaned and mowed/leaves mulched, and its regularly patrolled by NLR police or even a state trooper from time to time. Not at all sketchy like it use to be. Funland kinda has that \"festival\" vibe. It's a welcoming place, so long as you come with your child, and you're not 30 trying to ride the attractions. There's even a dog park, one for large breeds and another for small breeds!",
   "Oh my goodness what a great time we had today!! Poppa and Gammy sure enjoyed watching our sweet grandkiddo's having so much fun riding the Funland rides, (made for just their size) if you've not been with your grandkids or kids you should go! A $10 wrist band gives the kids unlimited all day rides!! That's an awesome deal... 😊 all the staff is so kind and ready to help where needed.. Thank you!!!",
   "To begin with, the staff provided excellent customer service. They are extremely understaffed. There are about 13-15 rides, but only 3 people running around to attending the rides. You pay $150 for 10 kids attending party. Get 10 wristbands for unlimited rides for 2 hours. Well we didn't get to ride but 3.  If it is staffed appropriately, it would easily be 5 stars. I'll try again in the future.",
   "Clean and safe park for kids of all ages."
  ]
 },
 {
  "name": "Allsopp Park",
  "address": "3700 Cedar Hill Rd, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e78a20e2-9331-11ea-86a4-14b31f159f22.png",
  "tags": [
   "walk",
   "field",
   "free",
   "wander",
   "nature",
   "walk",
   "art"
  ],
  "link": "https://maps.google.com/?cid=11184102650855523637",
  "source": "GoogleMaps",
  "reviews": [
   "One of my favorites just because of how many treasures I find. Plenty parking on off hours. I’ve gone at less busy times, so I don’t ever have a problem. Playground. Ball field. Pavilions with grills. Upper parking or unloading for pavilions only open at certain hours. Lovely creek with a cute little bridge. Dog poop bag dispensers with bags. Nice for a little walk or exploring through the woods. Heavy on mosquitoes at night and in the woods trail area. Trails link together and lead into neighborhoods. Honeysuckles make the place smell so wonderful when it blooms everywhere!",
   "This is so awesome!  I've never seen a FREE \"bike repair station\"  like this before and it's genius!  All the tools are easy to get to but also are locked/chained to the station to prevent theft.   I have been seeing this for a couple weeks now but never would have guessed it was this!   Like I said before GENIUS!   \"Gateway at Allsopp Park North\" I believe it's called, but whatever it's really cool!",
   "This place is a little treasure.  Nice trails.  Woodland.  And there's a little ensemble that regularly plays at noon.  Delightful to wander around with a musical background.  Get out in some nature and unwind.",
   "My youngest daughter (19 months old) loved the creek that looks man-made. She seemed to really mellow out and enjoy the sun and the crystal clear water that was gently rolling  past the rocks that broke the surface of the stream from underneath. Shes usually a ball of energy and this place really seemed to soothe her.",
   "There’s so much to do! There’s a small loop that’s paved that goes around the activity area, a larger “South” loop that’s about 1.3 miles that takes you on a forest walk and a “North” loop that you have to cross a street to get to but is more secluded. Zoom into Google maps just close enough and it’ll show you the walk paths. The loops start in the south west culdesack of the south west parking lot. \nBaseball diamonds, playground equipment, art, covered areas, and even a tennis court. Time here is automatically well spent just showing up."
  ]
 },
 {
  "name": "Murray Park",
  "address": "5900 Rebsamen Park Rd, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e7f67794-9331-11ea-a4c5-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=13425768046898910529",
  "source": "GoogleMaps",
  "reviews": [
   "I have a tiny little Chihuahua who can't go into the big dog park they also have a small dog park there so he gets to get out and run around and have a good time we have a blast there.",
   "This is a great park located on the Arkansas river. There are plenty of things to do here like biking, fishing, walking. They also have a great dog park.",
   "Great place. I love it because I grew up with that part of LR, good memories and making more still today.",
   "Great little park with fields to okay games and some places to explore. The old playground in the sand is gone (too dangerous?) so be sure to bring your own forms of entertainment. Perfect for flag football, volley ball, soccer, flying a kite, throwing a frisbee, etc.",
   "Love the dog park.  It is nicely maintained and everyone is so welcoming!"
  ]
 },
 {
  "name": "President Clinton Library",
  "address": "President Clinton Ave, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e8589500-9331-11ea-a1c1-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=2820069533608562468",
  "source": "GoogleMaps",
  "reviews": [
   "Its beautiful",
   "This place is so fun to visit and see all the gifts Clinton brought back from other places I never been to around the world.",
   "Calm steady paced atmosphere, lots to see here",
   "This place is awesome.",
   "Great place!"
  ]
 },
 {
  "name": "Emerald Park",
  "address": "Marge Gardner Ln, North Little Rock, AR 72118, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e8bf1f74-9331-11ea-b65f-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=14860266810328559427",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely breathtaking Park. . Great place for photographers and videographers to come and get amazing photographs and videos. Not a whole lot of wildlife when we went, could just be the season. Great for walking running and biking also!",
   "Place is huge and well kept with the off trail option and some great views. Look forward to exploring it more",
   "Beautiful views! Going right at the fork gives you breathtaking views, the left side is a good jogging path.",
   "Love this place for either a quick stroller ride with the toddler or the 7 mile loop connecting to the skateboard park.  The trail back up to the parking lot is NOT paved- so I end up carrying the umbrella stroller and the toddler up the switchbacks but it's not too bad.  Watch out for snakes",
   "This park is gorgeous! The views are breath-taking, the trails aren't physically demanding, and the air is crisp and cool. Definitely going again!"
  ]
 },
 {
  "name": "William E. \"Bill\" Clark Presidential Park Wetlands",
  "address": "618 President Clinton Ave, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e9362476-9331-11ea-9023-14b31f159f22.png",
  "tags": [
   "walk",
   "library",
   "history",
   "nature",
   "free",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12889452421236894518",
  "source": "GoogleMaps",
  "reviews": [
   "Wow . Plan on spending all day. A wonderful experience of history and architecture and true service to our country and nature walk and much more . Excellent example of a presidential library.  You will want to do it again.",
   "Beautiful park, easily accessible from parking lot",
   "Great place to have walks, photography, keep eyes on Map, difficult navigation from and to Freeway.\nFree parking available. Nearby aquarium and other attractions.\nWorth spending free time if you are visiting this city.",
   "An extremely informative destination.  Attractive facility.  Great restaurant on site.",
   "Nice, scenic park, best place to walk and relax in Littlerock Arkansas."
  ]
 },
 {
  "name": "Over-the-Jumps Carousel",
  "address": "Zoo, Zoo Dr, Little Rock, AR 72205, USA",
  "avg_visitor_review": "",
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=11046004432894350373",
  "source": "GoogleMaps",
  "reviews": []
 },
 {
  "name": "Kanis Park",
  "address": "820 S Rodney Parham Rd, Little Rock, AR 72205, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e994714a-9331-11ea-b0e6-14b31f159f22.png",
  "tags": [
   "field"
  ],
  "link": "https://maps.google.com/?cid=10814171435074772792",
  "source": "GoogleMaps",
  "reviews": [
   "Can you clean the trail? The new highway has damaged the grass and flooded the trail. All just off the third base line of the baseball field.  That would be nice. How about a restroom? That would be better. And post a sign for dog controlling, would help also.,🌝",
   "Beautiful fall afternoon",
   "We had a fun skating around! The boys had a blast on the ramps and stuff!",
   "I love kanis been skating here since a teenager.",
   "Awesome park. Good peeps all around. Good vibes."
  ]
 },
 {
  "name": "Conner Park",
  "address": "13100 Cantrell Rd, Little Rock, AR 72223, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e9ef89d2-9331-11ea-9852-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=1251259821378217014",
  "source": "GoogleMaps",
  "reviews": [
   "Quiet, hardly used city park.",
   "Excellent mile an a half! A park playground area for the kids. A nice size lake for fishing which is also a beautiful site to see!!! If the trail was 3+ miles this would be a perfect spot for all types of trail hunters.  I recommend this trial for first time, beginners and out of shape folks. It will give you a great workout if you tackle it at your physical fitness.",
   "Great hiking trails and access to the South Ridge Trail. Seen lots of people fishing here as well.",
   "Nice secluded trail off of Cantrell around hwy 10 good place to walk your dogs",
   "Nice little park in West Little Rock with a fishing pond that holds small bass, bream, and catfish. Also has a few different trails to walk and explore. There is paved parking right in front of the park."
  ]
 },
 {
  "name": "Lake Willastein Park",
  "address": "Maumelle, AR 72113, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ea5eedc2-9331-11ea-a617-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "walking",
   "kids",
   "parks",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=9735631006385348296",
  "source": "GoogleMaps",
  "reviews": [
   "Nice outdoor walk today. Easy to navigate there via Google Maps on a walking trail.",
   "Theres much to this park. Plenty parking. Conveniently located close to one of the best laundromats in Little Rock. Great for exercising, playground, events, picnics, walking animals.",
   "Love taking the kids or coming by myself. The trail is nice. The lake is pretty, and it always seems to have a cool breeze blowing.",
   "So much to do here. Walking path, massive lake for fishing, picnic areas, play areas, etc. The city of Maumelle has done a great job of maintaining their parks over the years. This is one of my favorite fishing spots.",
   "I've always enjoyed this park and it's well maintained"
  ]
 },
 {
  "name": "Burns Park Dog Park",
  "address": "4200 Joe Poch Rd, North Little Rock, AR 72118, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ead5087e-9331-11ea-8357-14b31f159f22.png",
  "tags": [
   "parks",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=17003103229511555546",
  "source": "GoogleMaps",
  "reviews": [
   "Great park. Was a bit soggy after a rain, but the dogs enjoyed running​ through the puddles. Three large fenced parks accommodate small, medium, and large dogs. NLR parks Dept trucks drove by regularly, offering some feeling of safety though the park was otherwise empty in the late morning when I visited.",
   "Good place for your dogs to roam around and meet other dogs.",
   "Considering the amount of space available at Burns Park, it's a shame this area could not be quite a bit larger. McArthur dog park in downtown Little Rock is bigger with more dog-running space. Boulders are nice, but hurdles are are a disgrace.  \n\nStill a spot to take your doggo off-leash, though.",
   "I’ve visited dog parks from coast and this is one of the least cool I’ve seen. I don’t even mind that Pitt Bulls are not allowed. My problem is that it’s just three rather small pens divided by dog weight. So 25 lbs dogs can’t play with 35 lbs dogs? That’s just odd. In a huge park this is a very small space once it’s divided up into three fenced squares",
   "Very well kept park. Liked that they had 3 sections divided by weight. Areas were large enough for plenty of run space and seating areas for while the pups play. Staff caring for area were nice and friendly."
  ]
 },
 {
  "name": "Ottenheimer Park",
  "address": "Little Rock, AR 72209, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eb246128-9331-11ea-8c05-14b31f159f22.png",
  "tags": [
   "free",
   "walking",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=15304574753686936860",
  "source": "GoogleMaps",
  "reviews": [
   "It's likely you'll have the park practically to yourself; but, my nine year old son was able to befriend a boy on the playground and play a raquet sport with a wiffle ball and throw a frisbee.\n\nThis park is designed for handicapped guests. My son liked the globe net merry go round.\n\nThey are renovating the park. There is a nice walking path. We got to see the train go by covered with cool graffiti tags.\n\nThere are heavy equipment vehicles over at the Riggs Caterpillar dealership across the street to look at.\n\nThere are very tame geese and a nice pond.\n\nThe basketball court is usable. The tennis court needs an overhaul.\n\nThere's one built in BBQ grill.\n\nI'm not sure what goes on at the nice looking activity center.\n\nThere is free City of Little Rock WiFi but it says to ask the host for login info.\n\nI think this is what is good about Google Maps - I searched for a park close to Arch St.",
   "It a good place to take kid's. They've remodel it look very nice. Just to go,and sit to get out the house.",
   "Basketball court is big..perfect afternoon spot for the whole family",
   "Nice park with a pond, walking trail, basketball court, and playground.",
   "Grew up playing ball here"
  ]
 },
 {
  "name": "Mt Holly Cemetery",
  "address": "1200 Broadway St, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eb7fc7d2-9331-11ea-b717-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=11967341465542425062",
  "source": "GoogleMaps",
  "reviews": [
   "I’m not morbid, but I love to visit old cemeteries.  There is so much beautiful artwork and sculpture.  I love to get a small glimpse of our beloved departed personalities.  Some of the graves date back to the civil war era.  This cemetery is very beautiful and well maintained.  It’s worth a visit if you are in town.",
   "So much history so peaceful",
   "Beautiful and peaceful cemetery.  We walked it looking for inspiration for a name for our child.  Adelaide.  ",
   "",
   ""
  ]
 },
 {
  "name": "Benny Craig Park",
  "address": "4610 Gum Springs Rd, Little Rock, AR 72209, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ebec1e92-9331-11ea-88d9-14b31f159f22.png",
  "tags": [
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15205008204387778216",
  "source": "GoogleMaps",
  "reviews": [
   "The Fourche creek is beautiful. I loved walking along the trail and looking at all the cypress trees.",
   "because it was an event we had a blast canoeing and fishing in the creek in the back",
   "Ball feilds and basketball wth picnic tables.",
   "Uneasy feel because a cop was posted there the entire time. And the lake water smelled bad",
   "Very clean and great place for kids"
  ]
 },
 {
  "name": "Mills Park",
  "address": "1003 Mills Park Rd, Bryant, AR 72022, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ec4450e2-9331-11ea-9ec8-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4369063553639424614",
  "source": "GoogleMaps",
  "reviews": [
   "This park has a very nice play area for kids that is fenced in with lots of things to entertain them. Surface around play areas is padded. Restrooms are available in the play area.",
   "Fun place to swim & chill out. Only $5  great deal , clean pool , life gaurds on duty. Cool fun slide & diving board.",
   "We love this place. Great little park where you can play and walk a few trails.",
   "Love the fact it's in walking distance from my home. The grandchildren love going there  and watch Gigi and Papa Shayne being big kids with them💯♥",
   "Nice ,clean, lots of play area and fenced for safety and security. Definitely will return to play again"
  ]
 },
 {
  "name": "Plantation Agriculture Museum",
  "address": "4815 US-161 South, Scott, AR 72142, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eca50ed8-9331-11ea-99d9-14b31f159f22.png",
  "tags": [
   "history",
   "learn",
   "learn",
   "history",
   "learn",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=5007945061723295069",
  "source": "GoogleMaps",
  "reviews": [
   "Great place glad the state of Arkansas was able to restore. Most of the stuff they have is a soon to be gone from history the way people know how farming is and was. Very neat stuff how they have decorated and put together",
   "i'll make this simple. i have never seen i site like this so for me this was like a one of a kind place. i learn a lot from all the great exhibits and the employees are so friendly and made you feel welcome. i could of chatted with these ladies all day. i really enjoyed my stay here.  don't forget about The Ashley Alexander Plantation House & Scott Plantation that are only minutes away makes this a great day trip.",
   "Great place to learn about agricultural history in Arkansas.  The staff was amazing and spent time patiently answering questions.",
   "Great place to take the kids to learn about the history of agriculture.",
   "This Arkansas State Park showcases the cotton industry in central Arkansas.  I learned what boll weavals actually ate and where the terms \"high cotton\" and \"fair to midlan\" come from. \nIt's a great place to go see how a cotton gun actually works. Toltec is north if you want to see how the native Americans worked these soils, too."
  ]
 },
 {
  "name": "Arkansas Korean War Veterans Memorial",
  "address": "Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ecf9bee2-9331-11ea-9f9a-14b31f159f22.png",
  "tags": [
   "art"
  ],
  "link": "https://maps.google.com/?cid=18419836157599627969",
  "source": "GoogleMaps",
  "reviews": [
   "God Bless the Fallen on Both sides of this conflict.  May God guide the fate of Man with Faith , Hope and the most important .... Love .\n\" Love all as I have Loved You \".",
   "A joint project between the state of Arkansas and the Korean government, this beautiful monument does not just honor Arkansans, but all American soldiers and Korean civilians who lost their lives during the Korean War. It is a wonderful piece of art, though it is ironic that it’s located next to Douglas MacArthur’s house considering that was the war that got him booted from the Army. It’s in a convenient location for students of UALR Law to visit, so I recommend stopping here as well as the adjacent house of MacArthur.",
   "Remembering those Arkansan that bravely fought for our country! ",
   "ARKANSAS Korean War Veterans Memorial, Little ROCK, ARKANSAS",
   "Un lugar bonito para estar con la familia o solo. Es tranquilo y muy amplio para realizar cualquier actividad física"
  ]
 },
 {
  "name": "B-17 Memorial Park",
  "address": "1836 Grant 51, Sheridan, AR 72150, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ed8695c8-9331-11ea-a202-14b31f159f22.png",
  "tags": [
   "learn",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=10784022889379761951",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to tour and learn some history and honor the late crew that gave their all.",
   "Really nice, clean little memorial park. Absolutley worth the drive! It's a great tribute to the men and women that have given thier lives for their country.",
   "Very nice.wasnt expecting to be so beautiful. Very peaceful. Heart felt place",
   "Well done, did  not know 2LT Dolan but he was a fellow Navigator. Nice side trip and worth the stop.",
   "Well maintained and very nice memorial"
  ]
 },
 {
  "name": "Toltec Mounds Archeological State Park",
  "address": "490 Toltec Mounds Rd, Scott, AR 72142, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ee0e63c6-9331-11ea-8ca9-14b31f159f22.png",
  "tags": [
   "history",
   "learn",
   "family",
   "free",
   "history",
   "walking",
   "walk",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=14915001845003961523",
  "source": "GoogleMaps",
  "reviews": [
   "A must see for anyone who is interested in the history of this country and Native Americans. This is a very important part of this country's past and should be seen by everyone. We need to do everything we can to preserve places like this before modern \"progress\" has destroyed all of these sacred sites to build cookie cutter subdivisions or mass production businesses.",
   "A very beautiful place to go with family! Also, A good place to learn more about our beautiful state Arkansas!!\n\nFact:\n- Did you know the reason our state is called Arkansas is because the french called the Qua paws Arkansans (meaning down stream people)",
   "We enjoyed our visit here.  Super peaceful reflection on our history and lots of information in the museum.  Easy walking path around the mounds and along the pond.  We stayed on the paved path though could probably easily have done the other longer path with the stroller.   Really neat FREE experience!",
   "Very nice park. Trails are easy to walk. The boardwalk area over the oxbow lake and next to the Cypress trees is especially nice. Visitor Center is very informative. Nice video. Very nice Park Ranger.",
   "Wow! It has been years, when I was a kid, since I have been here. But this place is great. What little impression I had when I was a kid was blown out of the water by what we experienced today, we took the family of four, which included a five and a three-year-old out and we had a great time! We did half of the longer Trail before we had to get back to the visitor center to take the tram ride. The trail is nice, but where your Sun tan lotion and bug spray. The tram ride was a fun experience and the breeze from it was welcomed. Park interpreter Amy was amazing, great with the kids and very personable. Can't wait to get out here for a equinox or solstice program."
  ]
 },
 {
  "name": "William Kirsch Preserve within Ranch North Woods",
  "address": "8803 Ranch Blvd, Little Rock, AR 72223, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ee642512-9331-11ea-a49b-14b31f159f22.png",
  "tags": [
   "hike",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=15867392373012980478",
  "source": "GoogleMaps",
  "reviews": [
   "I expected this to be a tiny little area behind a neighborhood. But it is a lot larger than expected so I think I will come back out ready for a jog because it is a more flat area with nice scenery and a well kept path. While driving in it does look almost like you have to have special permission to come here but it doesn't seem that way after coming in. The entrance gate is just not very welcoming",
   "What a great place to get out on some Black water!  Park and the dock is a 100 yards from the parking lot!  Great Little dock.  Paddle out a little ways and you’re right in the middle of the little Maumelle river.  Make a left and you can paddle down and see pinnacle mountain.  What a breathtaking view!  Bring a fishing pole and get ready to catch fish!  I have taking my mountain bike here as well!  Great Place to ride bikes!  Great hiking trails and beautiful places to have a picnic!",
   "A pretty place to check out. When I was there today, the Arkansas River had the place completely submerged. Record flooding going on.",
   "Short hike through the woods. Good low cut, light technical mountain bike trails through the fields. Secluded camp and sitting areas. Wildlife. Definitely worth supporting.",
   "Awesome place for walking, enjoying the outdoors!"
  ]
 },
 {
  "name": "Butler Park",
  "address": "Little Rock, AR 72227, USA",
  "avg_visitor_review": 3.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eec455c8-9331-11ea-bf13-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15691486428465903253",
  "source": "GoogleMaps",
  "reviews": [
   "Kids had fun, they still have a merry go round which is always a blast. It's a little small if your looking to enjoy a playground. It was clean and they do have usable tennis courts. It wasn't a very diverse park either.",
   "I've always had fun in this park, small playground and a scattering of picnic tables. But the best part is all of the wonderful trees. Perfect for reading a book in the shade or just hanging out in a hammock",
   "More spacious than it looks (from the road)! Creek and a bridge, bathrooms, water fountain, trash cans, playground, tennis court/bball court, green space to walk dogs and run around, lots of shade, just a few concrete picnic tables with a grill. Could use more benches/picnic areas. Wonderful area!",
   "Lovely neighborhood park to give the kids an opportunity to exercise!",
   " Nice playground, a lot of benches."
  ]
 },
 {
  "name": "Jacksonville Museum of Military History",
  "address": "100 Veterans Circle, Jacksonville, AR 72076, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ef32b6b4-9331-11ea-9b72-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=13502006774017399654",
  "source": "GoogleMaps",
  "reviews": [
   "It's been a long time since I last visited,  but it is a great place to go. Run by volunteers,  many of whom are veterans, you will find that this little museum has more to it than meets the eye. Jacksonville is mostly ignored by tourists, leaving this museum fairly empty, but I promise you will find no better place to pause at on your way to Hot Springs.",
   "For 3 bucks to get in... can't complain at all. Nice displays and info from civil war to current times.  You could expect 1-2  hours here.",
   "Awesome place to see.  Very clean and professionally run. A must see when in the area. Lots of exhibits .. big and small.  Volunteer staff.",
   "This place is a gem!\nCareful preservation and thoughtful museum for our armed services.",
   "The museum is awesome so much history in the town of Jacksonville."
  ]
 },
 {
  "name": "Enchanted Forest Trail of Lights",
  "address": "511 Bear Paw Rd, Sherwood, AR 72120, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ef782d98-9331-11ea-8065-14b31f159f22.png",
  "tags": [
   "free",
   "family",
   "free",
   "family",
   "free"
  ],
  "link": "https://maps.google.com/?cid=14325288036183324817",
  "source": "GoogleMaps",
  "reviews": [
   "We take our grandchildren every year. Some are teenagers now and still enjoy it. The displays are beautiful! We did a Christmas light scavenger hunt this year, looking for specific displays (elf, gift, Santa, etc.). It is run very efficiently, but I reccomend going early to avoid the longest lines. You can't beat the free price, but I encourage you to donate well, as all donations go to new displays and keeping this wonderful Christmas event going every year.",
   "A family friendly, cute event. It is free but they take donations and you should definitely donate a lil so they can keep bringing us these cool light creations!",
   "Wait was long to enter. Very festive!",
   "This is a free drive thru light display. Donations are accepted for future light displays. Arrive early or you WILL be in a very long line of cars! Worth a trip with the family.",
   "Very pretty bit of wait but worth it !"
  ]
 },
 {
  "name": "Arkansas National Guard Museum",
  "address": "6th & Missouri, Camp Robinson, North Little Rock, AR 72199, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eff489ee-9331-11ea-9e87-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=6519040515227155552",
  "source": "GoogleMaps",
  "reviews": [
   "NOTE: You'll have to go into an actual National Guard Base. \nWhen going to the National Guard Base, be prepared for a background check, and make sure your car insurance is valid as they will request that as well in order to give you a guest pass. Finding the Museum itself can be a little tricky too, but google maps should be able to point you in the right direction. Drive safely through the base and respectfully, you don't want problems with local enforcement. Remember, you're on the grounds of a military base.\nThe museum itself is quite fascinating. They have all sorts of vehicles outside for you to observe and even touch (no climbing allowed, i don't suggest testing out your luck and climbing a tank in a military base... just saying). There's also an inside part of the museum which is just as fascinating as the outside.",
   "This place is a great place to come check out. There's so much history there. I love to see how things was and compare what we have now. I feel like everyone should at least go here once to just see the history.",
   "Amazing place",
   "Military history your thing... This has everything you wast to see",
   "Good displays and historical information"
  ]
 },
 {
  "name": "Tyndall Park",
  "address": "913 E Sevier St, Benton, AR 72015, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f037fba2-9331-11ea-a2e2-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "parks",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2243490240383959148",
  "source": "GoogleMaps",
  "reviews": [
   "Tyndall Park is a great place to take kids of all ages. They just added another brand new playground and fenced it all in so little ones can't escape. They also have basketball and tennis courts here along with a skate park so it really is a great place for everyone. Highly recommend taking your kids here sometime.",
   "Got a nice upgrade recently and unlike Bryant they added new equipment in addition to what they already had.  Safe and has everything from a skate park, walking trails, baseball, splash pad and playgrounds.",
   "Great day at the opening of the junior disc golf course. It is super fun, and more technical than it first seems. Great job Cedar Creek, and Benton Parks and rec for bringing this to the community.",
   "Great park which includes toys for disabled children, splash pad, and skate park. Many area to play in! There is 3-4 play areas for different ages of children from toddler, kindergarten, and elementary aged children. Some area have shade which help on hot summer days!",
   "Tyndall Park is a great place to take the kids. We go there often. It offers 3 great playgrounds and a splash pad. My kids love the skate park!"
  ]
 },
 {
  "name": "Centennial Park",
  "address": "1850 W 16th St, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f0836b00-9331-11ea-9926-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13159723998784256865",
  "source": "GoogleMaps",
  "reviews": [
   "Nice, green, and well kept park with full court basketball & tennis courts. It's huge so you can come here and relax",
   "I was there very late at night, no one there. Enjoyed the calm vibe. I now know there is a closing time on the park haha",
   "Good place for kids to play",
   "Need to be handicapped friendly,  needs water fountain, bathroom.  Not senior friendly.",
   "I attended school there 1st grade through middle of 5th . Started there in Sept. of 52. The building had a large open area in the center, 3 floors high. It was a massive looking building. I spent a lot of time climbing in the big spreading Oak tree on the Wolf street side. Have a lot of good memories of the place."
  ]
 },
 {
  "name": "Petit Jean State Park",
  "address": "1285 Petit Jean Mountain Rd, Morrilton, AR 72110, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f0d7d598-9331-11ea-8f6a-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "hike",
   "walk",
   "parks",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=11642735551630460087",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of the most beautiful places in Arkansas.   Don't miss Cedar Falls.  The Stony House Cave is cool too.  I haven't been to very many of the other features of the park but I look forward to my next visit.  Great camping,  fishing,  hiking,  and just all around enjoyment of the beautiful surroundings.  Enjoy!!",
   "Great hikes and activities available. We stayed in the yurts which were comfortable.  The walk to the showers and restrooms was not too far. The hike to the falls was a little steep in places but even our youngest hiker made it with no problem. The children have a nice time in the water from the falls. Canoes were a nice activity for those that chose to venture out. Biking around the area was also a big hit with the kids.",
   "A MUST do if you are in the area! This is definitely one of the more busy parks, but for good reason. Once you get past the steeper part of the start of the trail, it is a fairly fast and flat walk to the waterfall. The restaurant and lodge are comfy, cozy, and have guest that are hard to beat! The restaurant has a fairly large menu that is absolutely fairly priced. The drive alone to get to the park is great! Must see!",
   "A great spot not too far off the main way through the state if you're traveling through the area. I'm glad we found this park because I love waterfalls, and we happened to visit in the middle of February when they were flowing quite well from all the recent rain.\n\nThe Cedar Falls trail is pretty short and leads up to a great waterfall, but it's the most popular hike in the park so if you're wanting to avoid a lot of people go earlier or later in the day. If you have time, the Seven Hollows trail was nice, too. It also had fewer people on it, probably because of its length. The 4.5 mile trail is a fairly easy one, but bring water.",
   "Absolutely INCREDIBLE state park. The best I’ve gone to. So much to do as it is such an enormous park. Hours and hours of trails to hike, including one that is 12 miles which I hope to get geared up for soon! If you’re near the area going hiking here is a MUST! Do not miss out! Even if you’re out of state looking for an amazing place to hike, GO HERE!!!"
  ]
 },
 {
  "name": "Cadron Settlement Park",
  "address": "6200 Hwy 319 W, Conway, AR 72034, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f12ba31e-9331-11ea-9119-14b31f159f22.png",
  "tags": [
   "walking",
   "hike",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=18394760510418608494",
  "source": "GoogleMaps",
  "reviews": [
   "Love walking my dog here. Great view of the Arkansas River. Has short hiking and mountain biking trail.",
   "Well maintained grounds and hiking/biking trails. Beautiful scenery, all overlooking the Arkansas River. This is also a historical site with information posted throughout the park.",
   "Great trails to hike and mountain bike. Scenic view for sunsets over the river, easy access from parking",
   "Normally this is a great Park but right now you can't even get in. The floodwaters have taken over.",
   "Authenticly reconstructed Blockhouse at point overlooking the Arkansas River. Pit toilets nearby. Tolantuska Walking trail in the park, and multiple mountain biking trails."
  ]
 },
 {
  "name": "Laurel Park",
  "address": "2310 Robinson Ave, Conway, AR 72034, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f17ada1e-9331-11ea-8c25-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "field",
   "parks",
   "field",
   "walk",
   "field",
   "kids",
   "kids",
   "free",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10549372850309209659",
  "source": "GoogleMaps",
  "reviews": [
   "The best park in Conway! Great place for kids to play, we love to visit! The playground equipment is very nice & safe. There are parts for both younger & older children to enjoy. They have nice pavilions to rent for parties too. During the summer months we enjoy the splash pad located here.",
   "Laurel Park is a great place to spend an afternoon! In the summer, the attached splash pad is a nice way to cool off, and a playground to warm back up. The grounds are kept clean, with trash cans readily available, Picnic tables for lunch, and pavilions to keep out of the sun. The trees offer a lot of natural shade a well, that other parks don't have. Beyond the splash pad and park there is a large level field to picnic in, play kick ball, Frisbee, fly kites, or just a walk on the trail provided! Great area!",
   "This is a clean and wonderful place for birthdays or just a day at the park! It has a playground, water toys for the hot summer days, a track to run on, and an open field to play in also! Something for everyone at any age!",
   "My kids love this park. Playground equipment for toddlers and older kids. Splash pad. Large open field. Tennis courts. If you play Pokemon GO there are several pokestops here and you can walk the loop and by the time you get back to the beginning you can start again.",
   "This is my son's favorite park in the Conway area! There's lots of space for kids to run, a tiny slide for the littles, 4 buckle-up swings, 4 big kid swings, 3 big kid slides, plenty of stuff to climb on, and a free splash pad (like a water park without the slides) to play on during the summer! There's also well maintenanced bathrooms! (There's a men's,  women's and family bathroom, but they're usually locked on Sundays.) There's plenty of benches surrounding the park and lots of shaded area! \nLaurel Park is also super close to Patti Cakes, where you can take the kids to get a well deserved treat after playing nice with the other kids! And Patti Cakes is literally right next to Stobys, where you could take the kids for a filling lunch before getting a treat at Patti Cakes!"
  ]
 },
 {
  "name": "Hot Springs National Park",
  "address": "369 Central Ave, Hot Springs, AR 71901, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f1f0fa26-9331-11ea-b126-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "history",
   "history",
   "parks",
   "nature",
   "history",
   "free",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=6353847046271224029",
  "source": "GoogleMaps",
  "reviews": [
   "This was such a nice relaxing place to be! The water was so warm, perfect bathwater temperature. While sitting next to this spring, you can almost forget that this is located right in town. There are a lot of nice walking trails in the park.  It is also nice to fill up a jug of water at one of the drinking water stations. There are at least two that we saw. It is nice to see the area from the nearby tower as well as go to all the nice shops, restaurants and hotels nearby. The one thing I was hoping to see more of was the natural springs other than the one pictured. We didn't  walk every path, so we could have missed something. I am sure most of the  springs are harvested to use in the nearby bath houses. Overall, it is very nice place to see  and worth a visit.",
   "Insanely gorgeous area! The history is enough to warrant a visit. The fact they still have operating bath houses is even more impressive and is a cherry on top. Beautiful natural sites and the amazing geological marvel of the springs are a sight to behold. Without a doubt make your way to this amazing time of a place.",
   "As far as a place to visit, it's alright. Learning the history of the area is kind of interesting, and visiting one of the bath houses for a spa is, once again, an interesting experience. But as far as National Parks go, this is an odd one. Since it had the label \"National Park\" I really expected something different, more nature. I would think of this more as a National Monument or something along those lines. I think that would have set up my expectations better.",
   "I really loved spending time in Hot Springs. I really enjoyed the history of the bathhouses. We stayed at the Waters which was a great place. We walked around and had a private soak and a couples massage, which we really enjoyed. We were there for 2 days so we didn't get to explore as much as I would have wanted to. It was cold in December, so I would like to come back in the summer and check out the lakes.",
   "The only national park I've ever seen that's center is also a town center. Also had walking trails where u could get off the sidewalks and onto the dirt for less traveled, crowded areas. Free access to fill your own containers from both cold and hot springs which was very cool."
  ]
 },
 {
  "name": "Garvan Woodland Gardens",
  "address": "550 Arkridge Rd, Hot Springs, AR 71913, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f23d55c2-9331-11ea-9ae2-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "walking",
   "family",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=15289273205729726149",
  "source": "GoogleMaps",
  "reviews": [
   "This was a fun place to go out with the family. Had a big group of us, and the trails and walking were pretty big. We barely covered 1/3 of the walkable trails and it was just short of 2 hours. We spent a good amount of time at the children's garden and waterfall to let the kids climb around and explore. It was damp when we went or we may have been able to explore more.",
   "My family and I go every year, absolutely worth it. Great price point, and even though it can be a bit busy depending on times, it’s well worth it. I notice this last year they made it more handicapped friendly, offering rides. They also have snacks and merchandise stands. Lots of restrooms. Easy paths to navigate",
   "Not much else to be said about a place already so highly reviewed. Stunning natural paths beautiful waterfalls amazing scenery and impeccable architecture. What else is there you need? Makes any trip to the region more than worth it. I know I'll take every opportunity to come back and see this beautiful place again.",
   "Second time here and it is still as enchanting as the last. The flowers and accompanying trails frame the world a beautiful way. I highly recommend going when it's still cool in the morning. The walk is worth the price of admission and though hard as it may seem...try not to see the gardens through a camera lens.",
   "Fantastic garden with plenty of plants and tree varieties from around the globe.  Great place to take children, with plenty of photo opportunities.  Our visit was in early March, but I guess it would be fully bloomed during late spring and summer time."
  ]
 },
 {
  "name": "YaYas Euro Bistro in Little Rock",
  "address": "17711 Chenal Pkwy, Little Rock, AR 72223, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f2a7d7a8-9331-11ea-b1f2-14b31f159f22.png",
  "tags": [
   "family",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7385941872282177140",
  "source": "GoogleMaps",
  "reviews": [
   "Love going to YaYas when I’m in Little Rock visiting family! The weekend brunch is awesome, copious but really awesome and it’s especially enjoyable when they have a jazz band playing. \nIt’s a great place for family as their booths and tables are spacious and there’s something on the menu for everyone. We love having our girl gatherings here ❤️",
   "Delicious and attractively displayed in a warm, inviting atmosphere. Loved our waiter who anticipated our needs with the added benefit of being very entertaining. You haven't lived until you've taken in their Sunday brunch!",
   "Fantastic food -- the duck breast on the Chefs Special was perfect.  Excellent beverage list -- highly recommend the Casino Royal aka The Vesper martini for true Bond fans .  Beautiful restaurant setting with a great atmosphere.\n\nA great downtown restaurant in West Little Rock -- don't pass it by, it's a gem!",
   "Food is amazing, service is fabulous. I've always had a great experience at YaYa's!  Highly recommend.",
   "Great for brunch! The selections were excellent and the service was friendly. It's only $22 and the options range from omelette/pasta stations, roasted wings, bacon, risotto, sausage, to prime rib and more... The mimosas are addictive so, bring a designated driver. I've been here twice and I shall return!"
  ]
 },
 {
  "name": "Brave New Restaurant",
  "address": "2300 Cottondale Ln #105, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f2ef6824-9331-11ea-9347-14b31f159f22.png",
  "tags": [
   "unique",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12999221451360198353",
  "source": "GoogleMaps",
  "reviews": [
   "This place was fantastic but it’s so weird to get there.  Would be a lovely spot in the summer time since there is an outdoor patio. Not featuring the steak sandwich but that was my favorite thing.  This place is absolutely worth locating even if it feels rather obscure.",
   "Disappointing to be honest. Maybe my expectations were too high based on the good reviews I heard from some people. Service was very good though, attentive but not loitering around. Cool location near the river, probably great view when its warm. Went for dinner on Friday. We shared the wild mushroom tart for an appetizer; filling was great, crust was burnt and bitter. For mains we had the walleye ($37) and the duck with duck ($32). Each main came with a salad that was pretty basic, not bad but just a filler. The mains also came with identical sides of red cabbage, new potatoes, and patty-pan squash. The sides were just kinda tossed on the plate, squash was undercooked and flavorless, potatoes and cabbage just more filler. The fish was cooked well, saffron sauce was good. Duck was cooked medium and was flavorful, but the skin was not crispy. The sausage was a little sweet but alright. Wine prices were reasonable, but at $30+ for entrees I just dont think its worth the money.",
   "This fantastic find is hidden away in an office building setting on the 1st floor.... above G floor.  As we got close, the signs and smells directed us the rest of the way.  A quaint, clean, and inviting setting overlooks the Arkansas River and pleases from the start.  The shrimp, avocado, and grapefruit appetizer was unique and very well presented and fantastic.  I had the walleye and it was superb, and another had the Reuben sandwich that was huge and unbelievably tasty.  I’ll be back sometime when I can set outside and overlook the river, eat endless appetizers at random, and have wine glass after wine glass.",
   "Love this place. Fine dining with an awesome view of the Arkansas River. Guaranteed that every single thing on your plate is meticulously prepared and nothing was put there by accident. I’ve never had a dish or side that wasn’t amazing. The owner Peter Brave is always there mingling with the customers as well checking on you seeing what you thought of the food. Very special place to me and my wife. We love it here. Highly recommend.",
   "Tucked away in Little Rock is a true hidden gem. Excellent service with friendly and welcoming staff! Delicious food with every bite.  Peter Brave personalizes the night by visiting every table and capturing your dining experience."
  ]
 },
 {
  "name": "The Pantry Restaurant",
  "address": "11401 N Rodney Parham Rd, Little Rock, AR 72212, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f3594dd4-9331-11ea-acaf-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2045451117767992662",
  "source": "GoogleMaps",
  "reviews": [
   "Great atmosphere in a small, quaint restaurant setting. Smaller seating areas that could get too full in peak times. The menu items are unique & fresh - the turkey sandwich & hamburger come in bread that is super fresh & looks even better. German cuisine is the spotlight - but the desserts are the hidden gems.",
   "Our goto where everyone knows you name spot. Great Northern European food. Wonderful cocktails and some of the friendliest wait staff you will run into and the bar tenders are even better",
   "Wonderful atmosphere. We dined on the patio. Great service. Our server was just the right amount of attentive, and explained all the dishes for us. And her recommendations where spot on. And the food, was a deligth. Every bite was amazing. We had the bacon wrapped date and the Deviled Eggs for appetizers. My daughter made a meal out of the smorgasbord tray. I had the Brat plate, and was happy as clam with it.  Had the Apple Strudel and the Crepes for desert to finish a great meal. They are lightly sweet and just a perfect compliment to all the different taste sensations of the meal.\nWe will be going again as we are wanting to try several other dishes. The house pate is great. They make most of what we ate in house and it just enhances the taste and over all meal experience.",
   "The atmosphere and the food here are out of this world! You feel as if you have been transported to Central Europe! Comfort food Plus a fabulous staff! Bonnie our server has the best recommendations, and always a pleasant smile! Love her!! This place never disappoints!",
   "What a great little gem! We had the Lasagna and it blew me away. We loved the environment as well. It was lively but quiet enough to have a nice conversation. The deserts were to die for!"
  ]
 },
 {
  "name": "One Eleven",
  "address": "111 W Markham St, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f3b4185e-9331-11ea-8618-14b31f159f22.png",
  "tags": [
   "delicious",
   "cheap",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6770766032632388727",
  "source": "GoogleMaps",
  "reviews": [
   "The food at this restaurant was so divine we had to go back for their brunch. Their shrimp risotto was incredibly creamy and so delicious. The scallops were perfectly cooked and the duck salad was amazing. The dining room looks like a French restaurant with their freshly pressed white tablecloths and the wait staff were all super nice and took great care of us. It's definitely a high-end restaurant and therefore not cheap but it was money well spent.",
   "Had an amazing \"anniversary dinner\" fantastic food and fabulous service. Well worth it!",
   "One of the city's best restaurants. 111 is a fine dining experience appropriate for any family, friends, or company dining event. From date night to dinner with out-of-town visitors no matter what time of day you'll find an exquisite menu offering the best ingredients in a most beautiful presentation. The breakfast is one of my favorite two locations in the city. The biscuits and gravy are excellent as well as the eggs benedict. For lunch, would recommend the Express Menu. Recommend making a reservation with the hotel concierge or online reservation system. Valet is available for the car even when not staying at the hotel.",
   "The best homemade biscuits. They are so fluffy and light",
   "Bottom Line: Excellent food and environment, but questionable service. \n\nThis was our first time to visit One Eleven. We are massive fans of the Capital Bar & Grill as well as the general vibe of the hotel. So, we have always wanted to try One Eleven, especially after hearing such great things about their brunch. \n\nWhen we arrived, it took us about 10 minutes to get the attention of the hostess. In her defense, she seemed to be addressing some sort of a situation. Once we were seated, it took our waitress a good bit to come by. While she was kind, she was generally inattentive. \n\nOur food, however, was excellent. The eggs Benedict and the Salmon eggs Benedict were both spot-on, truly some of the best we’ve had. The coffee was also very good. \n\nIt was an overall good experience; it was just a bit disheartening to feel like an afterthought to the waitstaff. \n\nWe are going to give it another try at some point to see if the service improves."
  ]
 },
 {
  "name": "The Root Cafe",
  "address": "1500 Main St, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f41d88b6-9331-11ea-822f-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "eat",
   "food",
   "food",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=2097092921480150968",
  "source": "GoogleMaps",
  "reviews": [
   "The Root Cafe is a fun little restaurant serving a solid menu of comfort foods and one or more specialty dishes and salads.  They also have a few vegan and gluten-free items to choose from. When the weather is nice you can make use of their beautiful outside garden. I had one of their homemade brats which I found to be delicious. Overall I would come back.",
   "This is my new favorite place to eat.  The food is absolutely delicious, they have exciting combinations for your palate that linger in your mouth all day long. The energy and staff is so kind.  You feel good overall being there and when you leave. The best way to describe the experience is wholesome. Can't wait to come back!",
   "Saw this featured on Diner Drive-ins and Dives a couple years ago and it's been on my list since. Great menu and colorful, kitschy decor. The food was great and the service was quick. My only reason for 4 stars is some of the staff was not on their best behavior. They seemed to be mad at each other and it showed in their interactions. We found a table right next to the kitchen so it was obvious there was some friction there. But overall,  definitely worth a visit when in Little Rock. Its popular with locals and tourists and with good reason.",
   "Such a yummy place! Even if you aren’t into the whole “farm fresh” thing this place is a good stop! Our favorite drink we get every time we go is the blackberry lemonade... so good!! It’s always busy when we go which I’ve always noticed to been a sign that it’s a good place. I’ve had both breakfast and lunch here, both great!",
   "I've heard from many of my friends about this place for some time so I decided to by for breakfast.  They certainly take a different approach what many consider a traditional breakfast as there are some options that no other place around offers.  Honestly it's a bold move but that's definitely hit or miss.  I had the biscuits and gravy with a side of bacon.  The biscuits and gravy were pretty good, slightly sweet but no complaints.  The bacon on the other hand.... I'll just say that I've had bacon bits that had more flavor.  Maybe it was just an off day but I think it was actually made ahead of time because it literally crumbled to the touch.  Even microwaved bacon would be ashamed to claim it as its relative.  But the service was very good!  Couldn't have asked for a nicer staff.  I'm not completely writing this place off but I had to be honest and my experience.  I'll go back again for a dinner service and will let you all know what I think of that."
  ]
 },
 {
  "name": "Bruno's Little Italy",
  "address": "310 Main St #101, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f46e411c-9331-11ea-bc45-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "family",
   "eat",
   "food",
   "music",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12287615356521430026",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely awesome. Beautiful small bar. Went twice within the week. Delicious food, outstanding service and great location downtown. Definitely compares to New York Italian. Owner came out of the kitchen to see how our meal was.  The ravioli is amazing. highly recommended",
   "Many people complain that Little Rock doesn’t have good Italian in the area. I couldn’t disagree more. I have lived in Manhattan and dined in the original Little Italy of the Bronx. Bruno’s Little Italy is every bit the best of the best of Italian cuisine. My New Years’ resolution is definitely to frequent Bruno’s more often. Service was impeccable! We also had cannolis and spumoni ice cream, but ate them faster than I remembered to take a photo! So delicious! The ambiance of Bruno’s is everything you want a homemade Italian cafe to be! Thank you!",
   "Came down from Springfield, Missouri area to try this restaurant out.  Heard nothing but good things and this place delivered!  Their bread even tastes phenomenal and I am not usually a big fan of just bread.  They have a homemade sausage on spaghetti that’s to die for!  \n\nWe were down here on the first weekend when President Trump was considering the notion of banning domestic travel and this place was STILL busy!  Highly encourage you to get here early.  They have a bar across the street from them that has fun bar games if you come before they open up.  Well worth the wait!  Not to mention, the owners are amazing people and have quite the passion for making sure their customers are happy and satisfied!",
   "My wife and I went downtown Little Rock to eat at Bruno's Little Italy on a Friday night in July. It was around 6:30 pm.   They do have valet parking for those that can't find parking.  The place was packed in the inside but we were the first people in line for a table.  We choose outdoor patio seating.  The atmosphere in the inside reminds me of a bustling Italian restaurant you see on television.  People moving really fast to go get orders or to place orders.  People seated at their tables laughing and having a great time.  The authentic Italian smell of Pizza or tomato sauce fills the air.  We were promptly seated outside.  they do have Italian music playing on the inside and outside which gives it even more authenticity.  My wife ordered an appetizer tray that was full of prosciutto, pepperoncini peppers, olives, many different cheeses, and sun-dried tomatoes.  I opted for the chicken cacciatore.  It did take a little to get the food probably around 30 to 40 minutes but it was well worth the wait.  I highly recommend this as a place to be with family and friends and eat really good Italian food we will be back.",
   "This is a must do if you're in little rock, Vince is as humble as they come, it was a pleasure eating here, I'm thankful for triple D for putting it on the map.  The heritage, old world Italian manners and great food.  I'll be back says most people that eat here, me included.  Get there early, they open at 5 and all tables were full by 6.  Oh yeah, if you eat nothing else...you gotta have the toasted ravioli...it's outta sight!"
  ]
 },
 {
  "name": "Samantha's Tap Room & Wood Grill",
  "address": "322 Main St, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f4cc8dfe-9331-11ea-9152-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "walk",
   "delicious",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=968809158917917987",
  "source": "GoogleMaps",
  "reviews": [
   "Food and drinks were amazing! The bartender, Jennifer, was super personable and the cocktails were bomb. Pictured is the quail and collard greens. We also had the champagne cake and waffle for dessert. My mouth is watering writing this review. The manager, Ashley, checked on us several times and was so friendly. She and Jennifer had us laughing all night and we felt well taken care of. We absolutely plan on going back soon.",
   "WOW 🙏 My daughter and I came to Samantha's Tap Room. To celebrate her birthday 🎂🎉🎈 The wait was long. But the food, ambiance and loving service. Made for a memorable experience we will never forget 🤗🤗🤗🤗🤗🤗🤗 We are planning our next visit soon in the very near future 😊😊😊😊😊😊 We also saw our extended family here as well. Great minds think alike 👏👏👏👏👏👍👍👍👍",
   "Everything was excellent! Saw all of the many reviews and we were looking for somewhere great to have dinner and here it was! We had the surf and turf queso, fried green tomatoes, wood fired grilled shrimp, lamb chop lollipops, Cuban sandwich, chicken and sausage seafood gumbo and pork skins. It was all simply wonderful!",
   "This is a great restaurant and craft beer place in downtown Little Rock. It's an easy walk from the Marriott. I got the ribeye steak, which is grilled in their wood fired oven. Packed with flavor and cooked just right. We were in an upstairs room for a group event. Service was good. The overall vibe is energetic and fun.",
   "This is a great place for a special dinner or date night! The restaurant is beautiful and the staff is very knowledgeable. All of the dishes I had were so delicious and I will definitely be coming back!"
  ]
 },
 {
  "name": "Layla's Gyro",
  "address": "9501 N Rodney Parham Rd #7, Little Rock, AR 72227, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f51fde6c-9331-11ea-b3a9-14b31f159f22.png",
  "tags": [
   "cheap",
   "eat",
   "food",
   "delicious",
   "food",
   "delicious",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6007918697882661352",
  "source": "GoogleMaps",
  "reviews": [
   "Well my wife suggested that we go to this spot I was not that interested because I had a taste for a burger. I am glad that I decided to just go with her suggestions. (Who knew listening to wife was a winner)\n\nFrom the moment we stepped in the establishment a calming vibe came across of me. Now I  have had gyros before. (Who hasn't?) This place did not only made me realize that I had very cheap copies to the point I will be forever unable to accept the lesser versions. \n\nI also realized that the American policy that salt is a  season is unfounded and leads us to miss out on actual seasoning. The Rosemary Pasta (or the Olive Garden slayer) had so much taste I wondered if I can just buy the sauce. We all have experience bland chicken that was not cooked with the pasta and is void of seasoning throughout it. This was not the case. The chicken had to be infused and had become one with the flavors of the dish that I wanted to go hug the cook. \n\nI thought that I had pasta and a calzone before but I was misled in accepting D class pasta as A class. \n\nIf you want to eat at Olive garden again do not come here your taste buds will not accept second rate food again.",
   "Wonderful food!  The pita was soft and warm.  The humus was delicious!  The gyro was huge and exceptionally good. The chicken plate was a cacophony of flavor.  Rice on the bottom, grilled squash next, then topped with seasoned pieces of chicken.  Will definitely go back.",
   "I absolutely love Layla's! It's one of the places I miss most since we moved from the area. Their Greek style pizza is delicious and always has that perfect crust.  The Greek salad with chicken is also great. It's perfectly seasoned and has a generous portion. The prices are incredibly reasonable, especially considering the portions.",
   "One of my favorite places to eat. Each time I have gone I’ve always had a good experience and the food is always delicious. \n\nI suggest getting one of their quality calzones: I highly recommend either the triple meat, artichoke or Greek calzone with gyro meat!",
   "Layla's is GREAT!!! The lamb is AWESOME!! It's some of the best meat I've ever tasted. It had me singing, \"Now behold the lamb, the precious lamb of Layla's.\" Nice atmosphere. Good service. Definitely one of my go to spots now."
  ]
 },
 {
  "name": "Sonny Williams' Steak Room",
  "address": "500 President Clinton Ave Suite 1, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f5881680-9331-11ea-85e5-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=979183551896635919",
  "source": "GoogleMaps",
  "reviews": [
   "The best steak & garlic mashed potatoes in Arkansas. This is my most favorite restaurant in the world. No skinny steaks here! The ambiance is amazing, the staff, the food. It's so warm & cozy. I love everything about Sonny Williams!",
   "Had a nice steak dinner for two. Service was good the steaks were seasoned and cooked medium accurately. Green beans and potatoes were okay, had better sides at mom and pop restaurants. \n  Felt like pricing was steep for what we ordered. The highlight was indeed the steak. Decor needs a little touching up.",
   "Jeremy was our waiter this evening and he was attentive, friendly and a great host. The food is divine. The best lobster i have ever had.",
   "This is an expensive steakhouse to be warned. But their steaks, sides, drinks, and atmosphere is unmatched in the river market. Really where to go to have a memorable night or wanting a 1950's mobster feel. The piano man was the absolute icing on the cake. I loved it.",
   "The food was excellent. We shared the porterhouse. It was cooked to perfection. When you split You get a choice of four sides, just a heads up. The service was great. They had TV scattered in certain areas so a great place to go to kill time and watch a game or if you want a nice quiet dinner, they have areas for that too. Great experience. They have valet as well. No complaints."
  ]
 },
 {
  "name": "Kemuri",
  "address": "2601 Kavanaugh Blvd, Little Rock, AR 72205, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f5da0706-9331-11ea-932c-14b31f159f22.png",
  "tags": [
   "food",
   "knowledgeable",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1738223811988348497",
  "source": "GoogleMaps",
  "reviews": [
   "Nice atmosphere and excellent food.  Went out with some friends and the food was absolutely fantastic!  Awesome sushi, perfect presentation, and excellent diversity in their menu.  A MUST TRY for everyone who visits or lives in Little Rock!",
   "This is some of the most incredibly flavorful food I have had in a long time. The atmosphere is great and the wait staff is knowledgeable and very friendly. The spare ribs and asparagus were grilled to perfection.\n\nThe beef tenderloin is skewered and pairs nicely with a grilled corn on the cob.",
   "Have really enjoyed my experience both times I have been here. Kemuri has a pleasant ambience, excellent service and great food! Attached: The Mango Tango.",
   "My son wanted to celebrate his 19th birthday here and I would like to say that I pride myself on being very versed when it comes to being comfortable in very fancy or posh food situations,but this was the first time I felt so uncomfortable in a restaurant and the server when we asked her questions she basically was no help in suggestions or anything and was very dismissive to our needs. We did end up ordering and it was really good but I will say that we could have gotten food that was just as good that cost alot less somewhere else.",
   "This place is outstanding. The staff was very attentive. Food was very flavorful. Everything was clean, even the top of the picture frames. That's how I check a new restaurant I visit. Go to the bathroom and find a item on the wall. Get a paper towel and wipe across the top. It was cleaned. Very impressed 🙌"
  ]
 },
 {
  "name": "Maddie's Place",
  "address": "1615 Rebsamen Park Rd, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f63b883a-9331-11ea-b9f5-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5332915990518344497",
  "source": "GoogleMaps",
  "reviews": [
   "Rainy, cold day out. Flipped the collar of my jacket up and hunched my shoulders from the parking lot just across the street. Entered through a heavy wooden door into a welcoming, open space with great decorations. It was a quiet afternoon with nothing but the sound of the rain outside and my fellow diners to accompany my meal, which I absolutely ate up. Speaking of, the bowl of roasted chicken and dumpling soup I ordered hit the spot, punctuated with readily-available hot sauce, and complimented by a tall glass of freshly-brewed sweet tea. Baskets of crackers offered some additional texture when desired. The waitress was pleasant and professional.\n\nOverall, a good, cheap, wholesome meal that left me with a full belly and a warm fuzzy feeling as I ventured back out into the elements to continue my day. Only time I've been there so far, but based on my experience I can't recommend it highly enough. Definitely check them out.",
   "Yes, it is that good. If you like good, spicy food full of flavor, you got to check it out! The grilled oysters are to die for!",
   "Chicken tenders were perfect and the 16oz rib eye was.on point. Really enjoyed the thin cut natural fries",
   "Maddie's place is my favorite restaurant in Little Rock. \n\nI highly recommend the meat pies appetizer and if available, the boudain balls. They are out of this world. \n\nFood is always consistent and fresh, and service is attentive and quick. \n\nMaddie's fits the perfect mold of casual dining with exceptional food. Nothing too fancy it's just right.",
   "Amazing Red Fish, great New Orleans oriented menu, with familiar favorites like red beans and rice. Nice surroundings, full bar, helpful staff. Well worth the visit, as I am a returning customer for years!"
  ]
 },
 {
  "name": "Capital Bar and Grill",
  "address": "111 W Markham St, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f69f0534-9331-11ea-a8cc-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13325988936391995170",
  "source": "GoogleMaps",
  "reviews": [
   "One of Little Rock's best kept date night secrets. Great food, knowledgeable bartenders, excellent selection of drinks, GREAT live jazz, cool balcony seating that overlooks part of the city, professional/helpful staff; I could go on and on. The pimento cheese spread and the banana pudding are two of mine and my wifes favorite things. Check it out!",
   "Food is good.  Cocktails are good but overpriced.   The place is small and dark so don't take a big crowd.   It's good for a table of 2 or 3.",
   "This is a quaint bar and grill but the food is not. The chef is the real deal because the food is amazing! I also love their holiday or event-center specialty drinks. When Wicked was playing at the Robinson Auditorium,  they offered some \"wicked-good\" drinks.",
   "Nice bar in an upscale hotel. Small but nice southern food menu and good cocktail list. Bartenders were friendly and the place had a nice vibe. You can have drinks in the lobby of the hotel and listen to live jazz or sit in the bar area and watch a UFC fight; something for everyone. We ordered a few of the cocktails, the fig and thistle (I think?) was really good. We also ordered the chicken fried steak and pimento grilled cheese with fries and truffle dipping sauce. Both were simple but done well. Good place to stop in if you're downtown.",
   "Wow, the Capital Hotel in downtown Little Rock was a great place to celebrate my wife's accomplishments!\nFood totally awesome, atmosphere welcoming with reasonable pricing! \nIt was a very special day for us and guess who we met there to make it even more special!"
  ]
 },
 {
  "name": "The Fold: Botanas & Bar",
  "address": "3501 Old Cantrell Rd, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f6f00b9c-9331-11ea-a976-14b31f159f22.png",
  "tags": [
   "unique",
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2628828070291520041",
  "source": "GoogleMaps",
  "reviews": [
   "This my absolute favorite taco place.  I am a lover of all things tacos and I will never go to Little Rock and not eat here.  The photos included in this review are just a couple of the MANY times that I have eaten here.  Perfectly priced and WONDERFULLY made and perfectly tasty!  So many flavors that are unique and beautifully paired ingredients.  Drinks have always been top notch and just typing this review makes my mouth water.  I’m ready for more tacos.",
   "New favorite fresh Mexican restaurant in Little Rock.  Parking was tight but once inside you will forget all about that.  Service was great and very helpful.  Fist time visiting and they answered all our menu questions.  The chips and salsa are great with amazing queso so start with that.  Tried 3 dishes and loved each of them. Everything was cooked to order and I was surprised at the end by all the desert options.  Unfortunately I didn’t save room so I’ll just have to go back.  Very fresh and tasty you won’t be disappointed.",
   "Had the 3 taco plate (shrimp, pork and bison), which came with diverse toppings. But the mini crab tacos were ridiculously good!!! Crab meat was so fresh and tasty, including the little salad that comes with it! Can really tell they care about quality here. Easily the best tacos I've had in Little Rock!!  For dessert had the tres leches cake - can't remember the last time I had a cake even comparable in taste and texture. Easily five stars.",
   "I went to the Fold: Botanas & Bar for dinner with some friends after visiting Little Rock Central High School. There was no wait time around 3pm on a Sunday. We ordered the shareable chips and four type dipping sauces—red salsa, green salsa, cheese, guacamole. The chips are delicious and the cheese dipping sauce was the best one out of the four. For the main course, I ordered the 3 taco plate with an additional taco. I ordered two fish tacos, a chicken taco and a beef taco with a side of rice. The food was served in a timely manner. However, the taco meat was not very well seasoned. With a little bit more seasoning, the tacos would be great. The chips and dip was the best part about the meal. I would return to this restaurant just for the chips and dip. The restaurant decor is super cute and it is a relaxing environment. Also, there is an outside patio area that is dog friendly.",
   "Overall good experience got the green salsa appetizer. Ordered Crab sandwich and the three taco plate bison,pork, shrimp. Three of us shared are orders    the meal was good..."
  ]
 },
 {
  "name": "Table 28",
  "address": "1501 Merrill Dr, Little Rock, AR 72211, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f7430dd0-9331-11ea-ab82-14b31f159f22.png",
  "tags": [
   "walking",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9391657743459929599",
  "source": "GoogleMaps",
  "reviews": [
   "Farm to table at its best.  Located inside the Burgundy Boutique hotel its a must try.  Parking is decent but don’t let that hold you back.  Reservations are welcome but not necessary.  The waitstaff is excellent and they are great at walking you through the menu.  Everything is fresh and they have new items added regularly.  Portions were good size and the flavors of every dish were mind blowing amazing.  My tastebuds were popping out of my brain with delight.",
   "Fantastic! I didn't know what to expect and the place was just great. The waitress was awesome, her recommendations were spot on! The octopus was so tender and delicious, so flavorful! They have oyster tacos, oddly enough, and delicious 😋!\nI had the sort rib for the main course and it was very tender and just perfect.\nOthers had the chicken and donuts (raves), the red snapper also great and a few other dishes.\nCan't say enough, definitely go there!",
   "I have had a few trips to Table 28 over the last few years. This was the first time we were seated inside, and it really changed the experience. Server was prompt. Drinks were refreshed frequently, and the food was excellent. We shared two of the fish mains, and both were amazing. Chef came out to say hi after the meal.",
   "This was our third meal, and like the previous, was excellent. The flavors are amazing, everything is well prepared, and the plating is spot on.\n\nWhat we didn't care for was the new (to us) dining lay out. In the past, the seating was more intimate, almost romantic. Now, it comes across as a hotel restaurant. \n\nOur server was nice, but she seemed like a minor league player, trying to play in the majors. Maybe she was new, but she definitely needs a proper mentor to be better. With a little refinement, she'll be great.",
   "Very Accommodating Service and the Flavors were wonderful. Words such as exquisite, and elegant come to mind when reflecting my off menu vegan visit. Suggest the mushroom Risotto"
  ]
 },
 {
  "name": "Soul Fish Café",
  "address": "306 Main St, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f788c99a-9331-11ea-8067-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "family",
   "delicious",
   "music"
  ],
  "link": "https://maps.google.com/?cid=7597615608908398625",
  "source": "GoogleMaps",
  "reviews": [
   "Best catfish I've had, EVER. And I've eaten a lot of catfish. I thought that I should try something different than what I normally order and ended up trying a special offered on Friday. It had blacked shrimp, fried green tomatoes and fresh greens (the fried green tomatoes are usually served on top of the salad, but I wanted to judge them on their own merit) . It was scrumptious!  I will continue to visit for the catfish but the sides are so tasty.  Hubby's favorite is the black eyed peas, but I love the cabbage and sweet potatoe. \n*Special note: if you have to pay for parking, show your receipt to your server and they will give you a discount.",
   "The fish was well seasoned and cooked well. I ordered my catfish fried extra crispy and it was just perfect to me. Great atmosphere and family vibe. I would definitely return!",
   "I'm on a specific eating plan and Maddie the kitchen manager modified the Ruby Red Trout for me.  She was patient with my requests and was very eager to help me out.  That is HUGE!  My husband loves the blackened catfish and I can not get over how good the trout is.  You won't be disappointed with any of it.  Service, food and atmosphere all combine to make it a dining experience you will want to frequent over and over.",
   "My family loves Soul Fish Cafe! My husband loves that they have whole catfish and he also loves the gumbo. I love pretty much everything on the menu and especially the fried okra and the hushpuppies. My son loves the fried shrimp. We always get seated right away and have always had great service. The only complaint I ever have when I go there is trying to find a parking spot. 😬",
   "Came on a quiet Sunday evening. There were only a few tables occupied, we got seated right away. The restaurant has a modern feel to it, playing light pop music in the background.  Our waitress Kale was very attentive.  We ordered the blackened catfish. It was delicious. Highly recommended overall."
  ]
 },
 {
  "name": "Big Orange : Midtown Little Rock",
  "address": "207 N University Ave #100, Little Rock, AR 72205, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f7e8c446-9331-11ea-9ad7-14b31f159f22.png",
  "tags": [
   "delicious",
   "brewery",
   "knowledgeable",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8239089933159456590",
  "source": "GoogleMaps",
  "reviews": [
   "This was our first visit. The wait time yo be seated was really short and the staff were friendly. We ordered two veggie burgers and shakes. They were delicious and we enjoyed it. Our server was very friendly and attentive. I recommend this place to my friends.",
   "First time here. In town for Wicked. Had the Umami Bomb with an Angus Patty. It was pretty good, but I don't know if I'd say one of the best burgers in America. Arkansas maybe, but I've had better burgers in my hometown. Chicken sandwich was good.  Truffle-garlic fries were good.\n\nAtmosphere is fun and friendly and the service was good. Give it a shot and form your own opinion on the burgers.",
   "A story of the great, the bad and the good. The great - Burgers are great, truly amazing, great beef cooked well, great ingredients - lettuce tomato pickle very fresh, amazing. Truffle fries are really good with a garlic aioli sauce that tastes amazing. The bad - The beer pricing is a little outrageous, Lost 40 and the big orange are owned by the same people and somehow trash panda at the big orange is $8.50 when you can buy a four pack at the brewery for $9?? The good - staff are really friendly, atmosphere is amazing, bathrooms are clean. Overall I would recommend ( maybe get a beer somewhere else though ) and I will be back.",
   "By far one of the most pleasant experiences I have had at a restaurant. Waiter was knowledgeable and made fantastic recommendations.  Was honest about whether or not foods were as advertised or left a little to be desired. The burger was by far one of the best I have had and the beer flight is highly recommended.",
   "Nice atmosphere and friendly employees. Our food was brought out quickly and tasted delicious. We got the Border Town Wedge Salad, and the Southern Friend Chicken Sandwich with Sweet Potato Fries."
  ]
 },
 {
  "name": "South On Main",
  "address": "1304 S Main St, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f84d048a-9331-11ea-b849-14b31f159f22.png",
  "tags": [
   "unique",
   "free",
   "food",
   "affordable",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9893206117721302328",
  "source": "GoogleMaps",
  "reviews": [
   "Had a party of 20 and the waiters were nothing but nice and patient with the crowd they served. Very professional and great ambience. Perfect date night spot and cozy",
   "Unique menu options with a variety of vegan, gluten free and specialty entrees and appetizers. A small stage and distinctive atmosphere set the stage for great dinners for groups or a date night. Right in the heart of Downtown Little Rock - a must try! The wait staff were very friendly and helpful.",
   "Pork chop with fried sweet potatoes. 👍👍 The chop was cooked and seasoned to perfection. Fried sweet potatoes were the perfect partner to the pork. The restaurant   has a speak easy look & feel. A gem of a restaurant in downtown Little Rock!",
   "Terrific local spot in SOMA.   Fast, friendly service.  Great food and drinks.  Affordable.",
   "Absolutely Love this place, whenever we travel to Little Rock we always swing in for delicious food and vintage atmosphere. The owner is so nice and always has great recommendations and is super personable. Haven't been when there is a show the the stage looks amazing! Honestly would have to work here if I lived in Little Rock AK because I like everything about this place!!!"
  ]
 },
 {
  "name": "Gus's World Famous Fried Chicken",
  "address": "300 President Clinton Ave, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f8a536da-9331-11ea-bd20-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3088786990121259922",
  "source": "GoogleMaps",
  "reviews": [
   "The customer service was exceptional!! Our waiter was so friendly and helpful and quick. Food was very good and it was nice & hot when brought out to us. I love potato salad and was told their potato salad was really good, so I tried it. It's made with sweet pickles instead of dill pickles, so kind of made for a weird taste, but it was still good. I'll definitely be going to Gus's again the next time I'm in Little Rock.",
   "We stopped here after a day of hiking. The food was SO delicious! The chicken had just enough spice, and wasn't overly greasy. The fries were the best I've ever tasted! Fries at other restaurants will be incredibly boring after eating these. The staff was friendly, attentive and efficient! Even the owner came over to say \"Hi\". Prices were reasonable!  We need to find one of these in our home state of Minnesota!  🙂 (P.S. My husband enjoyed the home made pie!)",
   "Chocolate chess pie was over cooked, and crust taste burnt. The chicken was hard and taste like  it was cooked in old peanut oil. I've been there many times but haven't  had an experienced like this one. This was a pick up order.(Disappointed ) On a positive note the lady that brought my food to the car was real nice.",
   "Great spicy fried chicken!!  I ordered a two piece white meat meal with greens and baked beans.  My chicken breast was big in size and the greens were spot on.  The wait staff was courteous,  fast and very friendly!  I definitely recommend this place to everyone.",
   "In my travels from Texas to Illinois I stumbled across a quaint little restaurant named Gus Famous Fried Chicken. I did like most people do and read reviews, some good and some bad. I decided to give it a try and here I am. It happens to be in the downtown area with metered parking. $1.25 for an hour of eating pleasure. Upon entering the restaurant which is cozy I was greeted with a hello and have a seat wherever you would like. My waitress Tia was very prompt and explained the menu choices and answered all my questions. I chose chicken wings, Mac and cheese and potato salad.my meal took 11 minutes to arrive. It was extremely hot and freshly cooked. For dessert I had sweet potato pie. It was excellent. My overall experience was exceptional. I would recommend this restaurant and come back my next trip this way."
  ]
 },
 {
  "name": "Whole Hog Cafe",
  "address": "2516 Cantrell Rd, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f8faaa3a-9331-11ea-b6d3-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17705174657643560352",
  "source": "GoogleMaps",
  "reviews": [
   "THE BURNT ENDS WERE AMAZING. I eat what some might consider an unhealthy amount of barbecue and this place is 100% in my top five ever. The burnt ends, as mentioned, were phenomenal. The ribs were delightful. The pulled pork finished third, but only because one and two were ringers. I also liked the varieties of sauces at each table, six of them to be exact.",
   "Food was great as usual but service was over the top fantastic. They took care of my group of about 25 after a funeral. They did something special that they didn't have to do and had everything set up perfectly when we arrived. They continued to take care of every need to the very end!",
   "The food was really good. The barbeque sauces are all different flavors for every taste. You order and they are really fast with your food. Quiet environment. Good Job guys. Your food is delicious",
   "I love that the meat comes without any sauce and that there is 7 sauce flavors to choose from. Pick 1 sauce or mix n match to make your own sauce. The sliced brisket was perfect by itself but amazing when you add the sauce. Outstanding job!!!",
   "Great food. I really love the sausage. Good serving and service."
  ]
 },
 {
  "name": "Trio's Restaurant",
  "address": "8201 Cantrell Rd #100, Little Rock, AR 72227, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f941775e-9331-11ea-afb3-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "kids",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11024754208991170737",
  "source": "GoogleMaps",
  "reviews": [
   "Everything was wonderful. Our waitress was great made awesome suggestions that we tried. Food was really good fresh and reasonably priced. Would highly recommend you try this spot.",
   "Great place for brunch and lunch and dinner too. Everything is top notch at this long time favorite of the locals of west Little Rock. Service impeccable and food is delicious. Cannot go wrong with any of the Egg Benedict creations such as the Scandinavian salmon and capers! We were lucky that strawberries were in season in Arkansas and the strawberry short bread cookie crust was luscious. The crab dip is good and is served with crispy French bread. The bread needed more crisp but still very good. Must do bucket list Little Rock eateries!",
   "This is one of our new favorite restaurants. It was our first time. Our server, Krista, gave us great suggestions and was friendly. We had the guacamole, Peck Salad, a sandwich, and the Lorraine Quiche. Everything was so good we tried the key lime pie, which was amazing. You need to try Trio's!",
   "Fantastic service, delicious food, and a quiet atmosphere; perfect place for a date night without the kids, although I did notice they have very reasonably priced kids entrees. I had the Blueberry Pork Tenderloin and my husband had the Voodoo Pasta, both of which were amazing. We'll definitely be returning.",
   "Another place I've been wanting to try today Trio's brought some delicious delicious pasta for all the TSA employees who haven't received their paychecks (two) during this Government shutdown. \n\nThe Officers truly appreciated the generosity that Trio's Restaurant showed. Absolutely generous. \n\nThe catered food was really tasty so I can't wait to go try some other food on their menu."
  ]
 },
 {
  "name": "Flying Fish",
  "address": "511 President Clinton Ave, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f9945278-9331-11ea-b909-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=15399250899550809109",
  "source": "GoogleMaps",
  "reviews": [
   "Grilled salmon, grilled zuchinni, squash and corn was perfectly prepared. Ordering and picking up was extremely easy. We came here all the way from South Texas to help with power restoration after Easter storms. We love to support small businesses! This was a great choice in Little Rock!",
   "Simple and great fried baskets. I tried the catfish and oysters with fries. Although it was a lot of breading for me, i pretty much destroyed the basket. Tartar sauce was great, not sure if they buy or make it. I particularly enjoy restaurants that have stood the test of time, unchanged. Will go back next time I pass through",
   "This will always be one of my absolute favorite places to eat in little Rock. It is always amazing and so delicious every time. I love their grilled shrimp kabobs with grilled squash and zucchini. It is mouthwatering!! They have the best frozen margaritas too. They're soooo good!!",
   "I usually do not leave reviews for restaurants, but this place is TOO AMAZING to not review. I had the grilled salmon salad, it was outstanding. The freshest crisp greens, slices of avocado and tomatoes, slivered almonds, sweetened cranberries; all this topped with a large slab of grilled salmon still dripping garlic butter sauce. Paired with a bowl of phenomenal seafood gumbo, seriously, I can't remember when I have enjoyed a meal so much. It's my first visit to Little Rock, I will be back!",
   "If you like fish, you need to eat here.\nIf you like Catfish, you have to eat here.\nGreat pricing, great selection of cooking methods.  Simple place, fairly quick service.  Friendly staff.\nGive of a try if you are in the area.  It'll be worth your while."
  ]
 },
 {
  "name": "Capeo",
  "address": "425 Main St, North Little Rock, AR 72114, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fa067592-9331-11ea-960e-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2349934928727282787",
  "source": "GoogleMaps",
  "reviews": [
   "Didn't have reservations so was seated in a side room. Bit lonely with family when main rooms were packed (kids were misbehaving so maybe lucky). Have to respect any restaurant that daily makes their mozzarella, which was great. Tomato soup felt like they ran out and gave us some extra pizza sauce. Seafood linguine and lobster/prawn pasta were slightly boring, and could have used less salt. Portions decent. Desserts tasty. Service impeccable. Atmosphere charming.",
   "Stopped in to enjoy a lite dinner before the Celtic Women concert. Arrived early as I did not have a reservation. There was NO ONE in the restaurant and I was told there was no tables available. Hopefully my casual attire was not the reason. I give them 2 stars only because the food was very good on my last visit. Customer service has apparently diminished since then.",
   "I had planned on going to a different Italian restaurant, but wanted to make a reservation and the other place didn't take them, so I made them at Capeo for a Thursday night.\n\nAll of the people were very polite and engaging. The atmosphere wasn't super quiet, but it wasn't terribly loud. There just happened to be a party nearby that was a bit boisterous. However, it was a good \"date\" environment. \n\nThe food was really great, and I actually ate all of the food on the plate. Seafood linguine. One thing that they don't have which I feel like an Italian restaurant should have is Angel Hair pasta... OK, it's not really that important, I know. My date liked her meal as well.\n\nI would definitely go back.",
   "I ordered the elk chops, and by far it was THE BEST meat I've ever had in my LIFE. It was perfectly cooked and the texture was soooooo good. The brine they used was perfect and added a great balance of flavor to the elks perfect texture. It had a very red look and then you bite in and it seems to melt in your mouth. The sauce BLEW me away. Also the fried calamari was the best I've had in my life. The flavor was perfectly balanced and fried excellently. The service was excellent and the staff handled our big group very well. Best meal I've had in a long time!",
   "Food was very good.  Service was great!  Shannon is a wonderful server with a sweet smile and very helpful.  She helped choose our Anniversary meal which was just perfect.  Thank you"
  ]
 },
 {
  "name": "Bonefish Grill",
  "address": "11525 Cantrell Rd, Little Rock, AR 72212, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fa5ad74c-9331-11ea-b8b6-14b31f159f22.png",
  "tags": [
   "drink",
   "delicious",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4743783366426624963",
  "source": "GoogleMaps",
  "reviews": [
   "Bonefish Grill is an absolutely wonderful place  to dine, drink, socialize or to have a nice quiet romantic night cap with the most important person in your life. Our waiter, Josh was amazing. As top notch at they come, Josh made sure we were very comfortable, had everything we needed, and thus being our second date he seemed honored to take our picture for us. Totally gets \n5 stars! And Bonefish Grill gets 5 stars as well :)",
   "Delicious!  Jonathan was one of the best servers I've ever had.  I wish I had gotten pictures of more of the food.  I was passing through Little Rock and was taken off of the highway by a long shot, but it was worth it.  Lighting and noise were good for conversation with my wife.  Clean both in the dining area and restrooms.",
   "They have some great fish (which is expected). Especially their wood grilled fish  are very good. Quantity was generous during our first visit but wasn't good the second time with the exact same dish! \nTheir rainbow trout is huge while salmon is hit or miss. The sides are pretty good. \n \nThey have a big sitting area and it is not noisy like many restaurants. The service is good as well. I would NOT bother ordering any alcohol as that is super expensive and that's where they get you. I would visit again for the fish! \n\nI would highly recommend buying their gift cards for 20% discount as this restaurant is quite expensive (since it is a chain and they sell too may gift cards).",
   "The Little Rock Bonefish Grill was a great host to our annual family Christmas dinner.  We had 11 adults and 3 children.  We called ahead and made reservations for the group. When we arrived they had the tables put together and menus out on the table.  They brought out children's menus and brought out their food first.  There were 2 wait staff assigned to the table and they kept the drinks coming.  So many restaurants cannot handle groups, but the restaurant did a great job handling the group and being great hosts.  The staff was warm and friendly.  We will definitely consider going here again!",
   "We have always had great experiences here! We went the say before Valentine's day and it was really busy but we were seated within 15 minutes despite not having a reservation. I think our waitress's name was Michelle and she was helpful and nice. (The staff are always superb.) I can be indecisive so she helped us pick drinks and dessert. The bang bang shrimp were an awesome appetizer and are $6 on Wednesday! We splurged and got the guacamole with shrimp as well. We each got the sirloin and crab cake dinner and our steaks were cooked perfectly (medium rare). The portions are good without being over the top and I always leave with at least 1 to go box. The chocolate melting cake with berries for dessert was perfect for sharing."
  ]
 },
 {
  "name": "Cache Restaurant",
  "address": "425 President Clinton Ave, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fab68c18-9331-11ea-924a-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5748213909089791984",
  "source": "GoogleMaps",
  "reviews": [
   "You'll love the ambiance and food variations. This place is design for people to relax and enjoy a nice evening for sure. The patio has a nice view plus fire pits. \n\nIt will he hard to leave there hungry! It's also a good business spot to entertain clients.",
   "I probably should have given it a five.  My wife dish was very tasty and the shrimp were cooked just right.  My dish was too salty and they were very gracious in remaking it. Too bad you can't give half points... I took video and pictures and bragged to on FB and Instagram.  We may make this place an every other week visit. The ambience was great!!!",
   "Yuuuuuuummmmmmy food great atmosphere modern yet elegant and up stairs they have a bar lounge. Out on the balcony you can get a good view as well. Staff very professional.",
   "Great food and atmosphere. Pricey- 14 dollars for bacon shown below but it was delicious. The sides are priced well for the portions.",
   "Food doesn't get much better than here. Seabass was so fresh, rigatoni rich in flavor and risotto so creamy (added 3 scallops - cooked beatifully). Great location and service absolutely impeccable!! We had creme brulee and cheesecake for dessert, which were amazing. Easy to spend a lot of money on food and alcohol here, so be careful...but its worth it!!"
  ]
 },
 {
  "name": "Arthur's Prime Steakhouse",
  "address": "16100 Chenal Pkwy, Little Rock, AR 72223, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fb0ac6da-9331-11ea-b84d-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5265489113352351425",
  "source": "GoogleMaps",
  "reviews": [
   "Nice restaurant! Would have received 5 stars if not for the following. Tables are a little too close for comfort. Steak was under cooked and brussel sprouts were a bit mushy. We expect more attention to detail for the price paid.",
   "Arthur's is wonderful! It is expensive, but you get what you pay for. Service, atmosphere and the food are all great. I don't think you can go wrong with anything off of the menu. I definitely enjoyed celebrating our anniversary there and they made it extra special with the dessert. The creme brulee is awesome and I will go back just to get that. Arthur's is a must!",
   "Wow! This place is totally amazing. Our waiter was super attentive and helpful.  Our food was very delicious. We are celebrating our 17 year anniversary and they gave us a complimentary customized dessert to mark this very special occasion.  Our food was cooked to perfection. I would definitely recommend this place to everyone.",
   "Excellent service! Food is wonderful and owner is in dining area to check on his guests. It is a little pricey, so worth it for a special occasion. Also, love the sparkling light fixtures. A+ Atmosphere.",
   "Prime steak restaurant with great service.  The steaks were delicious and cooked to perfection.  Creamed spinach was creamy and delicious and the scalloped potatoes were top notch.  We ordered some bottles of wine as well and the selection was top tier.  Price was as expected, $$$$, but the food and service matched the price.  If in Little Rock and are looking for a steak dinner where price isnt a factor, this is the place to go."
  ]
 },
 {
  "name": "Ciao Baci",
  "address": "605 Beechwood St #3846, Little Rock, AR 72205, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fb5e3e4c-9331-11ea-8e2b-14b31f159f22.png",
  "tags": [
   "eat",
   "unique",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13805485784758690265",
  "source": "GoogleMaps",
  "reviews": [
   "Man I've had some great meals here before but when I was here a couple weeks ago it was a big disappointment. This is a favorite spot in Little Rock especially when I wanna eat something kinda late at night. I still think about the fried rabbit I had a couple years ago. I had the steamed mussels and they were not fresh.  A couple were not even open. I had some in Bethesda the following week and they were like night and day.  The ones I get at home in New Orleans are fresh also. I know my seafood.  I understand Little Rock is more inland but if you can't keep fresh live seafood then it shouldn't be on the menu.  But I've had fresh mussels at other places in Little Rock.  I'm glad I didn't get sick. I gave three stars because my waitress was extremely nice and all the meals I've had here before were good. My waitress was so nice I still left a 20% tip for the original total.  But that was my first and last time having their steamed mussels.",
   "This place was pretty dope. From my understanding, they have seasonal menus, use nice ingredients, and rotate stuff frequently. This was my first time here but the duck confit I got was phenomenal. The drinks were also really awesome, no Ramos gin fizz though. Maybe next time. The staff was super nice and attentive. Would definitely recommend and will definitely be going back soon.",
   "The best resturant I have been to in a very long time. The atmosphere was perfect, romantic, and quaint. The food was unique, very flavorful, and just really very good. The staff were awsome, and made us feel like we had been there 100 times before. Would highly recommend!",
   "Bartender is the reason for the 4 star rating and not 2 or 3 star. \n\nOrdered calamari that was under seasoned and served with cocktail sauce + mariana. 3/5\n\nCocktails were 5/5 hands down. \n\nElderflower is in 75% - 85% of their cocktails. \n\nGreat atmosphere and service. \n\nTotally coming back",
   "Love this restaurant. Service is fabulous.  Food is superb!  Highly recommend the BBQ pork rinds with the spicy maple mayo and the jalapeno cheddar tots, the duck confit was superb and my husband really enjoyed the lamb shank"
  ]
 },
 {
  "name": "Istanbul Mediterranean Restaurant",
  "address": "11525 Cantrell Rd #914, Little Rock, AR 72212, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fba9c680-9331-11ea-817d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6132610430924626450",
  "source": "GoogleMaps",
  "reviews": [
   "It was our second visit and it was just as amazing as our first. The food is freshly prepared and arrives hot and full of flavor. I'm not a huge fan of hummus but theirs is delicious beyond words. I had the beef and lamb plate. My wife had the chicken gyro. Everything was just amazing. My wife said later in the day we've got to go back. The grilled vegetables we're perfect! Will definitely go back",
   "Delicious food and friendly folks! I was traveling through Little Rock and happened to drive by this place and stop in for lunch. I grew up with Greek food and this place does not disappoint with their Mediterranean vibes. The Turkish coffee was delicious, as was the salmon platter and house made rice pudding!",
   "Superb food. Excellent meat quality. We really enjoyed it and can't wait to come back. The staff is very helpful and gave us very good service.",
   "Istanbul is incredible. The food is so delicious and the people that own/run it are so kind. One of our favorite places in Central AR.\n\nThe Beef/Lamb Donner is hard to beat. Their hummus is so smooth and the flavor lacks that sharp finish many others have. Add a Turkish coffee and Profiteroles for a heavenly conclusion.",
   "So I’ve never had this type of food before and I cook a lot. I was very impressed with everything. Seasoned to perfection, the service was on point. Prices are very reasonable. I am definitely going back often and recommending this place to everyone."
  ]
 },
 {
  "name": "Red Door",
  "address": "3701 Cantrell Rd, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fbebd89e-9331-11ea-a88d-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2680373857426226848",
  "source": "GoogleMaps",
  "reviews": [
   "There was about a 30 minute wait and it was so extremely worth it. Pricing is very reasonable for such good food. Our waitress, Brittany, was extremely helpful on recommendations. Our food came out fast and hot. Any place that makes homemade biscuits and croissants, plus melting cheese over food needs 5 stars at all times.",
   "Not bad.  Not bad at all.  I had the bbq shrimp and stone grits with a side of sauteed spinach.  The staff was friendly and we were promptly seated on a Tuesday at 600 pm with hardly anyone in the restaurant. The restaurant is clean and the parking was easy.  I will be back.",
   "Went for breakfast with my husband,  very pleased. The Eggs Benedict with crab cake was outstanding! Everything was delicious. We will definitely return.",
   "I went there twice and both times it was only average. I got a very salty crab cake, in which I got middle of my entree.\nSecond time we got steaks, where we ordered it medium rare, came out medium well.\nFor a \"high end\" restuarant it doesn't even have big solid ice.\nWouldn't go again, or recommend to anyone",
   "My cousin recommended this place for breakfast, and it was so good! My mom got one of the skillets, and I ordered the chicken fried steak and eggs. We were both very impressed with the food. The service was great. We sat outside on the patio because the weather was so nice. I would definitely come back the next time I'm in town!"
  ]
 },
 {
  "name": "The Butcher Shop",
  "address": "10825 Hermitage Rd, Little Rock, AR 72211, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fc62ddd8-9331-11ea-aa6a-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "delicious",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7017324668943785416",
  "source": "GoogleMaps",
  "reviews": [
   "If you love delicious thick- cut steaks, the Butcher Shop should definitely be on your must-visit list of Little Rock restaurants. Their beef always comes out properly prepared and you won't wait too long between ordering and eating. The service is absolutely wonderful. This is the perfect place for dinner when you want to treat family, friends or business acquaintances. Highly recommend.",
   "Been in Little Rock THREE years and haven't had service like this yet. By FAR the best. Good job guys!! Coming from someone who owns their own catering business and I've been a restaurant manager for years, excellent service. Hats off to you guys!!!",
   "The place looks really nice, the service was wonderful and the food was delicious!!! Totally worth it. Definitely will be back again. I totally recommend it.",
   "Awesome experience.   Great atmosphere, excellent variety of food choices.  My meal was excellent.  I would highly recommend to family and friends.",
   "Incredible steaks and Alfredo sauce along with award winning homemade gourmet cheesecakes. Super friendly servers and bartenders"
  ]
 },
 {
  "name": "Capers Restaurant",
  "address": "14502 Cantrell Rd #4271, Little Rock, AR 72223, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fcab58b4-9331-11ea-ab8d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2047980806129484471",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food, service and atmosphere. We had a great time. The small group nooks are perfect.",
   "Their outdoor sitting area is beautiful. The food is good and worth trying at least once. The waiters are very courteous. \n\nNot all food items are good. This restaurant is on the expensive side for lunch, especially because the food quantity per dish is not much. Overall a good restaurant though!",
   "Shrimp cocktail appetizer, grilled Mahi Mahi w/mango salsa, soft shell crab, chilled shrimp, veggies & cheddar cheese grits. Amazing meal, service was excellent. Great birthday dinner!!! Will definitely go back again.",
   "My porkchop was dry and tough. My mother's mahi mahi was very dry. Our waiter was high or drunk. The creme brulee was delicious.",
   "Great food, waiters and ambiance!\nNice separate room for special events.\nConvenient location."
  ]
 },
 {
  "name": "Loca Luna",
  "address": "3519 Old Cantrell Rd, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fcf707cc-9331-11ea-945e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1477321758385648626",
  "source": "GoogleMaps",
  "reviews": [
   "This was our first visit to Loca Luna. We started off at the Red Door but the wait was crazy long so we walked next door.  I'm so glad we did! My husband had the chicken fried chicken and I had the Spanish casserole. There foods was delicious and the service great! The charro beans needed a little salt, but otherwise wonderful. The roasted potatoes were melt in your mouth deliciousness. We'll definitely be back to try more menu items.",
   "The service was great. We were seated right away, and the staff was very friendly. The food came fresh, and very tasty. It's a great place for brunch on Saturday morning. My wife and I will come back and try some of their other menu items. Well worth the money.",
   "Crab cake eggs Benedict for brunch was awesome! The hostess the waiter and the waitress were all very engaging and very on top of everything. This was my first visit here but will definitely be going back. A good friend informed me that dinner is just as good as the breakfast.",
   "Stuffed grouper was great, the crab toppings were delicious! Kids pasta had a tasty marinara sauce. Loved the capers in both dishes and how paper was the table cloth, really entertaining for kids to draw. Hostess was fantastic at seating us and bringing color pencils. Do have to say pepperoni pizza was flaccid and way too salty. However, after living in LR for a year now, seems like this is pretty standard for pizza here. Good service and atmosphere.",
   "Everything about this place was absolutely fabulous I had the best time from the atmosphere the food the drinks the service our waitress was amazing everything was perfect I will come back over and over again!!!!"
  ]
 },
 {
  "name": "Cafe Bossa Nova",
  "address": "2701 Kavanaugh Blvd #105, Little Rock, AR 72205, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fd504b9c-9331-11ea-816a-14b31f159f22.png",
  "tags": [
   "unique",
   "unique",
   "food",
   "food",
   "music",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1906253705216073567",
  "source": "GoogleMaps",
  "reviews": [
   "The ambiance was one of a kind. the menu was inspiring to the effect of wanting to order everything in this one meal.  Our waitress not only showed a unique passion for each dish, she gave us a greater understanding of the dish itself. Our experience was on Valentine's day and the special chocolate truffles were exquisite. We will be coming back. I can't wait too!",
   "I've been wanting to try this place forever but just haven't. The staff was wonderful, the food was good but expensive.\n\nI highly recommend the Xingu beer and the Brasileirissimo Streak - very tasty!\n\nEdit:  I decided to try the Sunday brunch, it was pretty good, but not spectacular (I'm a tough breakfast critic). I had the biscuits with gravy and 2 eggs.  The gravy was not your normal country sausage gravy, the sausage was unique and the result was pretty darned good if a little salty. The biscuits were good, but I found it odd that they toasted them (usually not a sign of home made). The eggs kind of missed the mark - a perfect over medium well egg will have a yoke that is like jelly and no brown skin on whites (I did mention I'm picky about breakfast, right). The eggs missed on both of these marks (brown skin and runny yoke).",
   "Good food. Good service. Very nice place to get together. Dress is casual, but meal seem like it is from a more formal restaurant. We arrived later on Thursday and caught the end of some live music. Very nice. We were told by the singer that there is live music every Thursday.",
   "The Tuesday special was delicious!  Shrimp in a curry sauce on top of rice with sauteed vegetables.",
   "This food is truly something different than the other local restaurants. I don’t have any experience with Brazilian food, but love the food here. I will say that they do move at a slower pace here, so maybe not the best place for a quick meal."
  ]
 },
 {
  "name": "Raduno | Brick Oven & Barroom",
  "address": "1318 S Main St, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fdb660b8-9331-11ea-861b-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "free",
   "eat",
   "delicious",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17346456726356156823",
  "source": "GoogleMaps",
  "reviews": [
   "This is a really cool place. The atmosphere is nice. The food is amazing. I ordered an apple cider type beer that was very good. It was a nice change from what I normally drink. My girlfriend and I had the cheese appetizer. It was very good. My only complaint about it is I wish there was more different types of cheeses. It had several other little finger foods which made it good though. For the main course I had the Italian sub and my girlfriend had the chicken alfredo. My sandwich came with the soup of the day which was a sausage and potato soup. Everything was so good. I will definitely be returning.",
   "Came here for their well regarded Sunday brunch.\n\nLox pizza was 4/5 and gluten free pizza was a 2/5. Only issue is the gluten free crust, which was very small and hard. The topings were a hit though. \n\nGood place for parties of 2 or 4. Amazing huge bar and very nice modern vibe otherwise.",
   "Went there for lunch with a friend. I recommended it because of reviews.  Nice atmosphere.  We were not pressed for time, but did need to get back to a meeting. We asked our waiter how long it may take for a pizza because it looked so good at a nearby table.  She responded rudely that we should expect to wait a bit. She said that we were not the only ones there. I asked if there were smaller pizza options. She stared at us. We opted for a sandwich and a salad. As we waited SEVERAL others were seated around us and began being served...........PIZZA. Quickly.  Apparently, there was some type of lunch special that included......PIZZA.  Funny how our wait person NEVER mentioned it or suggested it.   I ate a $17 sandwich (Italian beef... not great, but good) My friend tried to eat her $12 salad that was drenched so heavy with dressing she was only able to eat the top.  Neighboring tables had pizza. We drank an entire bottle of water with no refill which we would have gladly paid for. Our wait person only returned once....with our tickets. When we left, all three wait staff and hostess were at the bar deep in conversation.  Won’t be back. Our time (and money) were not valued. We had choices and chose here. We will opt other choices in the future",
   "This was our second visit to Raduno. In both cases, the service was attentive without being smothering, and the servers were knowledgeable about the menu.\n\nThe antipasto board included a nice variation of many ingredients, while the burrata was creamy and delicious. \n\nThe pizzas were flavorful, properly dressed, and fired expertly. They were crispy, and held the ingredients expertly. \n\nIf you are looking for good pizza in Little Rock, look no further.",
   "I like this place.  True to it's name, you can get a decent pizza and a cold brew.  The crowd is mixed.  They have an excellent bar which runs most of the depth of the space.  The waitresses and barkeeps are friendly and provide excellent service.  The beers and the food I've had here have been very good.  The atmosphere is laid back and relaxed.  Highly recommend.  Taking a star off because most of the beer selections are IPAs which is the fad now."
  ]
 },
 {
  "name": "Izzy's",
  "address": "5601 Ranch Dr #4496, Little Rock, AR 72223, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fe1e4a8c-9331-11ea-9adf-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "free",
   "delicious",
   "food",
   "art"
  ],
  "link": "https://maps.google.com/?cid=11407479308258888096",
  "source": "GoogleMaps",
  "reviews": [
   "Always delicious food. Make sure to save room for dessert! Bread pudding, lemon ice box, and raspberry cream. The staff is always friendly and wonderful.",
   "My husband and I had dinner here over the weekend. He's a somewhat regular, but I haven't been in quite some time. He ordered their beef tamales with cheese dip which he always enjoyed. I ordered the chicken tortilla soup which is a meal in itself that comes with fresh avocado. Everyone working seemed to be a teen but had impeccable manners, was pleasant, and always smiling. My glass was never empty and they stuck my dessert with ice cream in the freezer until we checked out. We will continue to return.",
   "Izzy's was phenomenal. There was a lot to choose from and everything sounded yummy. There were a lot of choices for gluten free folk. I ordered chicken salad and a fruit salad with yogurt poppy dressing. Delicious! Others at my table ordered pizza, side salads, tamales, chicken tortilla soup, and bread pudding for dessert. It all looked great and tasted even better. Izzy's is a must if you are ever in Little Rock.",
   "A Little Rock original gem. The menu is diverse with a little bit of something for everyone. The food is delicious, and the wait staff is friendly and helpful. Highly recommended.",
   "Family-owned and operated. Clean, attractive, friendly. THE BEST veggie-burger. Everything fresh. Nice selection of teas. Great service. Lovely colorful art by local artists. Worth enduring Cantrell traffic."
  ]
 },
 {
  "name": "Tokyo House",
  "address": "11 Shackleford Dr, Little Rock, AR 72211, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fe81c78a-9331-11ea-bc3c-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "adventurous",
   "affordable",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=14223454326012798199",
  "source": "GoogleMaps",
  "reviews": [
   "The selection was very small compared to other buffets. I could not taste the difference between the run of the mill Chinese food buffet and this location. Honestly, as a traveler this place is a good place, but not my choice dining for the future. It has a 4.5 stars rating, but I do not know why. The best that I can do and only because they had fried frog legs and it's a buffet; is a 3 rating -Too high of a price per person for a small selection.",
   "Best bang for buck for Asian food around! Who would've thought Little Rock had an amazing Asian buffet? Delicious dishes of Chinese, Japanese and Korean. The sushi and sashimi is freshly made. I definitely will drive out of my way to visit this place when I'm in Little Rock. I highly recommend this place.",
   "Love this place, and although I'm not sure if most of it is genuine Japanese food, they have dishes on and off the sushi menu that you can't really find anywhere else in town, especially at a buffet. The food is impressive, the spread is kind of fancy. They have a full and fresh sushi bar with sashimi, and baby octopus and jellyfish salads. The price gets knocked up about $5 on weekends but they typically have different dishes. I recommend to anyone wanting some good Japanese food.",
   "I love this place for lunch- plus it's more affordable. The one time I went for dinner the buffet choices were different and they didn't have my favorite beef dish ( I think it's called kobe beef).  The sushi is amazing. The have \"starter\" sushi for folks like me who enjoy California rolls, but hubby and the kiddo are far more adventurous.  The sushi is made right there and all the ingredients are very fresh.  They even have a fruit sushi roll.",
   "My wife and I went with friends. They have a nice lunch buffet.\nThis was one of our favorite places to eat in West Little Rock\nThey had plenty of choices including shrimp and fish and if you like sushi try this place. I believe the cost was $12.95.\nWe go at least twice a year. \nWe live in the Village so we don't always go to Little Rock for dinner."
  ]
 },
 {
  "name": "MeMe’s Twisted Potato",
  "address": "3005 Asher Ave, Little Rock, AR 72204, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fee0b0cc-9331-11ea-b47b-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=895804901666648867",
  "source": "GoogleMaps",
  "reviews": [
   "What A GREAT dining experience! The atmosphere is eclectic and a little funky. The service is entertaining and efficient but most of all, the food is exceptional. Vegan takes on comfort food and various ethnic foods. \nOne thing. This is NOT a fast food restaurant. It takes up to 45 minutes to be served. It is worth the wait!",
   "Hearty, delicious vegan food! Don’t judge this book by its cover - we almost drove on after laying eyes on the haunted-looking house in the middle of a cemetery, but are so glad we didn’t! The buffalo cauliflower, kale salad, and fried green tomato sandwich were particular highlights of an enormous meal bursting with flavors. MeMe was incredibly sweet and warm, and made us feel like guests for a home-cooked meal. An essential stop for vegans and veg-curious diners in Little Rock!",
   "If you are in the area I highly recommend going to MeMe’s, we had just gotten to town after a long drive 15 minutes before close. She accommodated us and cooked the most delicious cauliflower wings I’ve ever had. The kale salad was amazing as well. Huge portions, great food!",
   "Go eat here as soon as possible. Schedule a little extra time (about 45min), because your food is being hand-made for you. You aren't at a fast food restaurant, you are getting the opportunity to be fed by someone who is preparing some of the most flavorful food you may have ever eaten. Don't have time to wait? Call ahead a plan for pickup. Enjoy!",
   "The food was amazing! We ordered online and and got the emails giving us updates on our order throughout the process. The website clearly states that this is not fast food so be patient! We ordered 4 different dishes and each was cooked perfectly! Will be back for sure!"
  ]
 },
 {
  "name": "Buenos Aires Grill & Cafe",
  "address": "614 President Clinton Ave a, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ff46ece4-9331-11ea-8495-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "kids",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8665913529135901310",
  "source": "GoogleMaps",
  "reviews": [
   "I really liked it.  The atmosphere was really nice.  I actually noticed the flowers on the table were real and fresh.  The staff was very nice and friendly.  The food was delicious and full of flavor.  The skirt steak was moist and had a grill flavor that was out of this world.  Everything was perfect.  I highly recommend this for a dinner spot.",
   "My husband and I have been wanting to go here for a long time, we finally stopped by and it was 200% worth it. We had a three piece empanada, 1 chicken, 1 beef, 1 ham & cheese. All were good but chicken was the best. Shared a Buenos Aires mixed grill that comes with chicken, flank & skirt steak, shrimp & bratwurst. A margarita & beer. Everything was exceptional and we were planning our next visit while eating appetizers. The margarita was very weak, I'll stick to beer going forward.",
   "This is one of our go to date night spots! The food is amazing, the atmosphere is awesome, and the service is exceptional! They catered our iRealty Arkansas Christmas party this year and everybody raved about how good the food was. Love love love this place!",
   "I was so excited to try this place. The service was slow and it took an hour to get our entrees. And then they were cold! The manager (owner?) apologized for the delay and offered a 20% discount but it was still pricey. We paid $85 (with tip) for 2 entrees, 1 kids meal, 2 apps and 2 drinks. I wouldn't have a problem if the food and service were on point.",
   "Excellent service! excellent food and location. Owners are so welcoming and accommodating. Quality of food is amazing and prices are excellent!!! Definitely a place to visit every time in Little Rock, AR"
  ]
 },
 {
  "name": "Little Greek Fresh Grill",
  "address": "11525 Cantrell Rd #905, Little Rock, AR 72212, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ffaa69ee-9331-11ea-91d0-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=378957099877686822",
  "source": "GoogleMaps",
  "reviews": [
   "I love little Greek and everyone who works there. Especially my girl, Cheryl. She always takes such good care of me. I have been going to little Greek once a week for about five years now and they consistently crank out amazing food! It’s a little more expensive but it’s worth it for the high quality cuisine and awesome service! Love you guys!!!",
   "Great Mediterranean food! Fast & friendly service, tv’s with sports & news around the eating area, plenty of table or booth seating. Order your food and pay at the counter, take a number and they bring it to you. Greek salad with lamb was 👍🏽.",
   "Very good.  I love the cannoli.  I've never had the dolmades due to not being open minded with leaves.  I tried it with my wife and I have to admit...  They were very delicious and probably the best thing I've eaten in a while.  Five thumbs up.",
   "This was my first time but won’t be my last! I ordered the Gyro platter and my wife and daughter ordered the chicken kabob dinner. We all loved the food. But, the star that stole the show was the fried pita chips with the hummus. The chips were the best I’ve ever eaten! Crispy on the outside soft in the center and absolutely awesome! We will be back! I can highly recommend this clean and inviting restaurant to you!",
   "Omg, I had the chicken pita. The bread was so warm & fresh. I wanted to wrap myself in it like a blanket. Will definitely be back soon."
  ]
 },
 {
  "name": "Copper Grill",
  "address": "300 E 3rd St # 101, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fffb978a-9331-11ea-b1a2-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=10264224739468629452",
  "source": "GoogleMaps",
  "reviews": [
   "This place is a hidden gem. The atmosphere is very nice. The drinks are good and I only had the appetizer sampler but it was served its purpose. The millionaire bacon.. 🤤 lol\nAlso, the coconut cream pie was creamy and delicious.",
   "Copper Grill is my favorite restaurant in Little Rock!! Not only is the food excellent (never had a dish I didn’t love!) with an atmosphere that is elegant yet very comfortable and obvious it’s frequented by neighborhood locals!! The staff and owners are super and wait staff make you feel as though you are friends! Love this downtown restaurant!! 5 stars!",
   "Excellent customer service, great food!  Lee is an exceptional server, the  Vibe is super chill. Great place to go for drinks or food",
   "Really great spot for a business lunch or date night. Love the Signature Sweet Hot Burger and the Sampler Platter. Great patio for Happy Hour.",
   "We had a wonderful evening at Copper Grill!  Had a one night stay in LR and Copper Grill was just around the corner from our hotel.    Our waiter, Richard, was perfectly attentive - kept the wine poured and courses perfectly spaced.  Don’t miss the oyster appetizer, stuffed chicken or spicy meatloaf.....all delicious!   We will definitely return the next time we pass through the area."
  ]
 },
 {
  "name": "Three Fold Noodles + Dumpling Co.",
  "address": "611 S Main St, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/004c4fbe-9332-11ea-a54f-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=8652957031257163452",
  "source": "GoogleMaps",
  "reviews": [
   "Great food. I like there chicken noodle. Definitely check out this place when you want to eat something downtown Little Rock.",
   "This place has become my new favorite. I have eaten here several times over the last few weeks and it has been great every single time! This is a great place to pick up at. You can easily order online and just pick up in 20-30 minutes! Yum yum yum.",
   "Delicious food, fast service, and friendly staff.  The menu is very simple yet jam packed with flavor.  I had the Half and Half dumpling and noodle bowl with chicken and medium heat on my first trip. The bowl was filling and appropriately priced.  Great atmosphere with a modern vintage vibe.  I will absolutely return.",
   "Awesome Food very very fresh my boyfriend and I absolutely loved it. The chef was very nice and attentive. The guy that took our order was very polite. I advise one thing though from the other guy at the register.  Don't know if this guy owned the place or what but we can tell he either judged us for who we are or he was having a bad day. This was our very first time eating here and I looked online prior to coming to the restaurant so I asked for  the two fold noodle bowl. So he was being arrogant and stated that is the name of the restaurant but if you look at your menu you have a salad named  the two fold salad right under the noodle bowl. I will not let his attitude affect my experience. Very Very Good fresh food minus the attitude. I totally recommend!!!!",
   "My sandwich was so salty that I could not eat it.  I also had the pork dumplings and they we good but nothing to make a special trip for.  People were not as friendly one would like.  The atmosphere was good."
  ]
 },
 {
  "name": "So Restaurant Bar",
  "address": "3610 Kavanaugh Blvd, Little Rock, AR 72205, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/00a37082-9332-11ea-81c6-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "delicious",
   "drink",
   "food",
   "creative",
   "food",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=10370697958524853559",
  "source": "GoogleMaps",
  "reviews": [
   "Wow!  I loved So Restaurant. The food and service we're amazing. Our waiter was on point and very friendly and knowledgeable. The wine list was very extensive and had a great selections to choose from. I loved our food and appetizer. I definitely recommend this place and I'm definitely coming back. Thank you very much. What a classy little place.",
   "In May we had a company function here with around thirty people and the food and service were excellent. The atmosphere was nice in the back upstairs group room. Very accommodating area for a large group. The servers worked very hard with all the food and drink orders. The desert were delicious and we cannot day enough good things about this service oriented restaurant!",
   "As someone who is both a regular customer and a former employee here, I can confidently say that Sõ offers one of the greatest dining experiences in Arkansas. The cooks are all exceptional at creating phenomenal dishes, and the head chef continues to top himself with a creative special each week, while the front house staff are attentive and consistently on point. If you're looking for top notch food and service at a reasonable price, Sõ is where to go.",
   "I typically would not post this type of review for the public to see. I contacted the restaurant in private, saw that they read my note and 48 hours later, still no response. So, here is the note I sent to SO Restaurant. “I visited your restaurant for the very first time last night, NYE. It’s a beautiful facility, charming and elegant. Our waiter was Brock. We had a 5:30 reservation for 6. We were seated promptly. We all ordered from the NYE limited menu. 5 of us got the oysters as our appetizer. The oysters were room temperature. It was an item that should be hot, melting cheese from being under the broiler. The oysters in the Bienville were very strong, fishy tasting/smelling. Very disappointing dish all around the table. The Turtle soup was ordered by most of us for the next course. It had good flavor, but has also room temp, not even warm. Again, very disappointing. Most of us ordered the prime rib for our main course. The mashed potatoes were divine, as was the asparagus with shaved yams. Delicious. The seasoning on the prime rib was excellent. The prime rib however, was also not warm, and mine was very, very tough. Difficult to cut. Just a terrible cut of meat. The desserts were hit and miss. Pineapple cake was great. The cheese plate was cold brie and a glob of apricot jelly. Just terrible. Never had cold brie cheese.  The chocolate truffles were awful, dense, dry, hard, just awful. We ordered coffee and it took 3 times reminding Brock for us to get it, one in a dirty cup, and not hot. It was bad. It took 3 times asking Brock in order to get a glass of tea. Brock was frazzled, kind of high strung, odd. I wanted to inform you of our experience and I would never want to put this on public social media. We are all professional people and we eat at fine dining establishments often. Our tickets had a 20% tip automatically added in. I thought that was tacky. I felt this may have been the single most overpriced meal I have ever had then was forced to pay 20% for mediocre service from our waiter. I feel terrible even writing all this, but the owner of this establishment deserves to know this.”",
   "Nice, quiet sophisticated spot! Pork chops with the ghost pepper glaze, off the chain. Will definitely be back!!"
  ]
 },
 {
  "name": "La Hacienda Mexican Restaurant",
  "address": "3024 Cantrell Rd, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/010abe28-9332-11ea-8536-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "food",
   "drink",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8453971713555288490",
  "source": "GoogleMaps",
  "reviews": [
   "La Hacienda is a Little Rock Classic. A well established local restaurant that was recently remodel. You can expect fast service and delicious food. They have a tasty salsa that is more flavorful than spicy. That have a large food and drink menu with all American-Mexican classics all at a decent price. Don't forget to grab a lime mint on your way out!",
   "great food and staff. place was clean. my only issue with this place was how often people were coming by to ask if everything was ok or if we needed anything. its good you care about your customers just give them a little breathing room to enjoy there meal. if there drink is getting low simply just bring them another one you don't need to ask every time you see a glass half full.",
   "Service was great.  Good food.  The restaurant looked very clean and neat. Loved the wood designs on the tables. I'll visit again.",
   "My husband and I were looking for really good salsa. We saw the reviews for this restaurant on Google and decided to try it. We have driven past this for years but never stopped. We were not disappointed! Salsa and the green salsa was excellent! I had the Ala Diable chicken. The meat was well done and had tons of flavor. The refried beans were great! My husband had the street tacos and he really enjoyed. We will be coming back as our “go to” for Mexican food!",
   "Good consistent Mexican food. Their new menu is really nice.. you can tell they spent some money on it."
  ]
 },
 {
  "name": "The Pantry Crest",
  "address": "722 N Palm St, Little Rock, AR 72205, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/015f953e-9332-11ea-b5ff-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "unique",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=12916070890829628525",
  "source": "GoogleMaps",
  "reviews": [
   "I have been here on several occasions and am always delighted. The staff is pleasant. I love the vibe of the restaurant. It's in a converted house. There is plenty of seating and I beleive that when the weather is nice they have outdoor seating as well. There are dedicated handicap spaces in front of restaurant but the rest is street parking or in a nearby grocery store lot. My friend and I went last night as we heard that there was a late night happy hour from 10pm to 12am. Most of the appetizers are half price (shrimp is not). Everything is beautifully presented and the food is always delicious! Can't wait to be back.",
   "Warm, cozy environment envelops you to a place away from it all. Being a hummus junkie, it did lack a little flavor🤔, but every other dish tried was highly flavorful. They serve traditional drinks but also have delicious, unique cocktails if you're up for trying something new.",
   "The food was top notch -\nquality ingredients and tasty central European dishes. The Hungarian sausage with the egg noodles and vegetable medley was prefect. I’ll return here the next time visit Little Rock.",
   "First time to try this restaurant and I will say it didn't let us down. The beef stroganoff was off-the-wall great, as was the breaded Jager schnitzel!! Share the dessert-Chocolate Salami- rich & delicious.",
   "One of my favorite restaurants in the area.  Always excellent service and we really enjoy the drinks.  In particular love that the kitchen stays open pretty late.  I go here regularly and have no reason to stop.  My favorite place in the neighborhood and one of my favorites in the city."
  ]
 },
 {
  "name": "Doe's Eat Place",
  "address": "1023 W Markham St, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/01a59f0a-9332-11ea-b171-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "food",
   "family",
   "unique",
   "family",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7535193228708625938",
  "source": "GoogleMaps",
  "reviews": [
   "Does is a staple in little rock for many reasons. Steak,tamales,shrimp, and a killer atmosphere ! You never know what celebrity of Arkansas may frequent this place. The wait staff is awesome and the food is just as good! Never dissatisfied when we head over there!",
   "I have heard a lot about Doe's over the years and FINALLY I had a chance to try it. The food is not bad but I've had better seasoned steak. We ordered the 4lb sirloin and split it among the 4 of us. Its a unique atmosphere but sadly not worth the hype for me. However, if you go please do try the homemade chocolate cake!",
   "Small unsuspecting spot for steak family style. Order your steak type (or shrimp) and it comes with sides for the table family style. Steak was good and homemade fries were too; not sure we needed the red potatoes AND fries but that’s how it comes. Friendly staff.",
   "Some of the best, juiciest steak in Little Rock, served in a unique family style. Doe's has always impressed and they remain a landmark location downtown. If you want the porterhouse though, be sure to reserve one ahead of time!",
   "Was told I had to go and try the porterhouse and went an did that for my birthday. Very nice dinner, and a small little hole in the wall kind of restaurant, but was delicious and well worth the money."
  ]
 },
 {
  "name": "Cathead's Diner",
  "address": "515 Shall Ave, Little Rock, AR 72202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/020635d8-9332-11ea-a5ea-14b31f159f22.png",
  "tags": [
   "family",
   "eat",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12385436919914820009",
  "source": "GoogleMaps",
  "reviews": [
   "Ok... “All you can eat brunch” and they have cocktails & Mimosas. I mean really, when was the last time you went to a cafeteria style, family friendly buffet and had a Bloody Mary? Well, it was a first for me.\n\nOpen dining hall in the newly renovated “paint factory”. Very friendly and accommodating staff. The menu changes on a regular basis. The offerings today included pulled pork, chicken tenders and greens to go along with the usual breakfast options.\nAnd of course they had awesome biscuits with your choice of white or “chocolate” gravy.\n\nEverything was very good, but they do have an opportunity to improve their freshly prepared eggs. I suggest perhaps a separate “station” or table. I ordered eggs over easy (willing to wait for them), but our waitress brought them to the table and they were over cooked.\n\nOh yeah, they have biscuits as big as a “Cat’s Head”. 😉👍",
   "Great southern food perfect for a brunch outing. Ambiance was loud, but that’s as to be expected for a Sunday. My husband and I are both in the hospitality industry and understand how hectic it can be to work on a busy day. However, as this was our first time coming to dine we would have loved an explanation from our server on the process, instead she said something along the lines of,  “go on up”. Would have loved to give it 5 stars, but the service was lacking.",
   "Tasty, Hot, ready and fresh home cooking served buffet style with many pie options to choose from. Wear loose fitting clothing for comfort!!!",
   "Fulfilling. If you're working and you want to eat lunch here...You will need a nap. I had the meatloaf, greens Mac & cheese, mash potatoes and corn bread. I was way too full, but you'll love it.",
   "Food was amazing and very super surprising! I am a big critic when it comes to soul food especially greens! Most of the downtown area does not have good greens but this place had some good greens and they seasoned it so well. And oh my gosh let’s not get started on the tator casserole!! To die for! I’m a big dessert person and their peach cobbler and bread pudding was the bomb! What also made this place great was the service and the owner. Being an owner myself to a few restaurants, I understand the importance of being present and infront of the restaurant. Makes people feel good and happy they are talking to the chef!"
  ]
 },
 {
  "name": "The Terrace - Mediterreanean Kitchen",
  "address": "2200 N Rodney Parham Rd #120, Little Rock, AR 72212, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0257d88c-9332-11ea-bb08-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=999374380442260952",
  "source": "GoogleMaps",
  "reviews": [
   "Love the trio hummus and every meal my husband and I have had has been wonderful!! Great staff and food!",
   "An excellent long time restaurant here in Little Rock. Authentic and flavorful food served in a beautiful, small spot. You will love this place.",
   "Pretty hard to find and you definitely want a reservation but the food and service were absolutely incredible. The Babaganouj is especially delicious",
   "Absolutely the best restaurant in Little Rock!  The food and service are consistently great. I’ve eaten all over the world, and The Terrace ranks with the best. Every dish is outstanding.",
   "The food is always good here. I usually order the salmon or chicken dish with great results. Atmosphere is cozy. Service is hit or miss. "
  ]
 },
 {
  "name": "Ciao | Italian Restaurant",
  "address": "405 W 7th St, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/02ac6158-9332-11ea-b78a-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17286686371501579034",
  "source": "GoogleMaps",
  "reviews": [
   "Had a great dinner the other night.  Their lobster ravioli was delicious.  Always love their cream of mushroom soup and the mushrooms ravioli too.  Great steak and pastas.  Friendly service, nice atmosphere, and Becky always makes us feel welcome.  Highly recommend!",
   "I was in Little Rock for the Marathon weekend ( Mar 2020) and needed some pasta. I went for dinner and order the Bolognese pasta. The  pasta was a little under cooked , but the sauce was very good. The service was great and very friendly, but at the end it took forever to get the check. And took forever to my credit Card back, due to the restaurant only have one credit card machine working.",
   "Me and my wife love our dinner experience everytime we eat here. It is our go to for a speacial occasion date night!",
   "Visiting from Dallas and this place is close to the historical sites. We had a party of five for lunch. We all really enjoyed the food and loved the waitress. There was something for everyone on the menu and the prices were very reasonable.",
   "Was in town for Little Rock marathon and they had special dishes so you could Carbo load. How great is that! Nice place, good variety, great food, fair prices"
  ]
 },
 {
  "name": "At The Corner",
  "address": "201 E Markham St, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/02f26b30-9332-11ea-af94-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "food",
   "food",
   "unique",
   "family",
   "food",
   "delicious",
   "free",
   "delicious",
   "family",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14070381006722028018",
  "source": "GoogleMaps",
  "reviews": [
   "As always we had an another unbelievably good brunch experience at The Corner.  The food is unique and always delicious, the service and speed is impeccable, and we've literally never had anything other than a perfect experience here.  The most intimidating part about it is that there is usually a wait line outside and yet even that moves so quickly because of how well run it is.  Cannot recommend this place enough",
   "I would have given 5 stars but my biscuit was room temperature and the sausage gravy was barely warm. I ordered the biscuit & gravy breakfast. Everything tasted pretty good, just the food could have been (heat) hotter. The staff was pleasant. The atmosphere of the restaurant was cozy. We will go back for another try.",
   "Great locally family owned restaurant. I've heard about it from friends from France as well as Little Rock foodies. The restaurant is able to accompany a surprisingly large number of people. If you want a Sunday brunch, get there early as the line was about  a quarter way down the block. Metered Parking only, is not free during the week, but it is on the weekends. An ever changing menu based on locally sourced products and seasonal food make each experience unique and varied. Delicious. Great for casual dining.",
   "A-MAAAAAZING!! My family and I were driving back home to Oregon and read a review, so we stopped on our way through. Our children have never had food so delicious!! Seeing as we are from the Great Northwest, we had never EVER had grits taste mouth watering like those! And the biscuits, please...my mouth is watering while I type this, they are phenomenal! We ate every last bite of food we ordered, it was so marvelous. I wish I could tell you when I would ever go back through Little Rock, Arkansas just to eat there again.",
   "Fun little place! I loved the retro/modern diner decor. Food was very good. Hubby wasn't happy that it took so long for the food to come out. I was very happy with the locally sourced food and my healthy breakfast of avocado toast and berries. Hubby got the Dutchman burrito. Both were great! Good place to go if you are not in a hurry."
  ]
 },
 {
  "name": "Star of India Restaurant",
  "address": "301 N Shackleford Rd, Little Rock, AR 72211, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/035488b6-9332-11ea-b636-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "family",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2069572346415520339",
  "source": "GoogleMaps",
  "reviews": [
   "The owner said \"Welcome home\" as we entered. There cannot be enough good said about this place. The servers are always sweet and prompt to take care of filling your drink even when it is a buffet and they don't typically make as much. The food is incredible and the price is maybe a dollar higher than the average fast food lunch. Definitely worth a visit!",
   "Our go-to place for Indian. We prefer to go during the buffet, which is available seven days a week. Food for the whole family, even our picky eater!\n\nGreat soup, and a variety of dishes! Large varieties of meat, vegetarian, and vegan dishes. The tofu curry is really good!\n\nChicken curries, lamb curries, vegetable curries, several types of naan, roasted vegetable dishes, grilled chicken, grilled fish, spinach salad.\n\nI'm a big fan of the curried lentil, curried tofu, saag paneer. Family also loves the Tandoori chicken, Tandoori fish, curried chicken, curried chickpeas.\n\nThere is just too much food food dishes and options to list them all.",
   "My husband and I ate here last night for the first time, and our experience was amazing!  The food was fresh and delicious, despite my pretty intense allergy to turmeric...no rash or anything, but lots of dizziness which paired quite well with my two Indian Mules, I must say ;D.  The highlight, though was the excellent service.  The manager and staff were extremely attentive and friendly.  All things paired with the beautiful, cozy ambiance of this little gem will certainly be bringing us back again and again.  Loooove this spot! ",
   "Wow. Great food, including some of my favorite goat dishes, and black tie service that's unbeatable. Our meals were ready very quickly, but came out piping hot and delicious. The garlic naan is to die for. I would wholeheartedly recommend Star of India to anyone who enjoys eating authentic Indian foods.",
   "This is the spot! Treat yourself to the Lamb Vindaloo. Let em know of you like it spicy. They can turn up the heat. I usually just let him tell me what I want when I go here. Very nice people too! 5 stars! I'm a fan a and a regular."
  ]
 },
 {
  "name": "La Terraza Rum & Lounge",
  "address": "3000 Kavanaugh Blvd #202, Little Rock, AR 72205, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/03b14fe8-9332-11ea-afe6-14b31f159f22.png",
  "tags": [
   "history",
   "food",
   "delicious",
   "knowledgeable",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=206552498879264344",
  "source": "GoogleMaps",
  "reviews": [
   "Oh my god! This place is amazing. Juan was the best server I have had in years. Very nice guy that made you feel right at home. He brought out different runs for us to smell and gave us the history on them. The food was just out of this world. Some of the best food I have ever had. First time here and we had a great time. Please go see Juan. Thank you guys very much. We will be back soon!",
   "I just move back to Little Rock and this is one of my favorite places to dine alfresco. The atmosphere inside is a little bright for evening dining but this is one of my favorite places in Little Rock because hearing the sounds of Puerto Rico and the Dominican republic is so refreshing to have in Little Rock. The upbeat sound of salsa makes dinner lovely while in a cozy and tranquil setting.  When my friends visit from the islands, I like to take them here.",
   "This place is a GEM! The owner Sarah accommodated our group last minute. They have a special party room that was perfect for our group. She and her staff were incredible attentive and gave helpful suggestions. The drinks were delicious. The arrepas were yummy but the paella was INCREDIBLE! One of the best restaurants in Little Rock. Parking is on the street but easy to find. They also have outdoor seating when the weather is nice. They have happy hour specials and fun themed nights. Will definitely be back! Also, the owners are amazing! I would come back for their hospitality alone.",
   "Had the braised beef dish with black beans, fried plantain, and fried egg.  The dish had good seasoning and flavors and the beef was juicy.  Really enjoyed the plantains and black beans too.  Would prefer a runnier egg but still tasted great.\n\nAdditionally, our server was spot on!  Excellent service and very knowledgeable.",
   "My husband and I ate there for our 23rd anniversary.  He is a native of Venezuela and he enjoyed the food and dessert tremendously.  The staff was friendly, the food was hot and service was excellent! We will definitely be going back to enjoy more delicious entrees!"
  ]
 },
 {
  "name": "Copeland’s of New Orleans | Little Rock",
  "address": "2602 S Shackleford Rd, Little Rock, AR 72205, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/04b6b1b8-9332-11ea-a4b4-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family",
   "delicious",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16452513748643798135",
  "source": "GoogleMaps",
  "reviews": [
   "Staff excellent, lovely environment and food tasty/good value. Be prepared though, should expect a wait...maybe the could have table side bread or something to help out those who are hungry. Seafood is fresh and cheesecake really good.",
   "Enjoyed a nice lunch. Waitstaff was great and very attentive.  Food was cooked to order.  Parking was adequate.",
   "My family and visit Copeland today.  My daughter’s choice.  Why is it so dark.  We was seated in the aisle of the restaurant.  It was dark there was no light above us.  The waiter passed our table several times without asking did we need anything ( water is what we needed).  Salad came with the entree.  Sad to say my visit was not meet satisfying results today",
   "By far my favorite restaurant. The ambiance is perfect for date night and the creole menu is delicious! Plan on a 20 minute wait, but it's worthwhile. Have a drink at the bar while you wait!",
   "Copelands is our go-to-place for unplanned celebrations! No reservations, ever. Excellent food. Reasonable prices. Beautiful ambience. Great service.\nCan't ask for more!"
  ]
 },
 {
  "name": "All Aboard Restaurant & Grill",
  "address": "6813 Cantrell Rd, Little Rock, AR 72207, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0516d34c-9332-11ea-a91e-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "kids",
   "food",
   "kids",
   "food",
   "food",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3257561999590996770",
  "source": "GoogleMaps",
  "reviews": [
   "The food was hot and made to order, the fried pickles were still crunchy, the hush puppies were wonder, according to my husband, who is very picky with his hush puppies. My chicken pita was wonderful. Our daughter enjoyed her burger. The train was really cool. And the house ranch was great. No complaints here. Going to have to bring the family sometime.",
   "Great experience! The atmosphere is wonderful!! Kids of all ages love it here, even the teenagers and adults!!! I love going and taking other children that have never gone. They get so excited watching and waiting for their food to arrive. The older children like to try and figure out how it works.",
   "This is a special place for kids and adults who enjoy trains and good food! It's a fun and novel experience with friendly service. I won't spoil all the fun but go find out their special tableside delivery! The food is also yummy. We tried the burgers, Mac and cheese, pizza, and chicken sandwich and everyone enjoyed their meal!",
   "Loved it! First time coming! They have extra long booths for big families! Reasonably priced and kid friendly! Food was good!",
   "Awsome place to bring kids. My kids loved the train play area. Enjoyed the food delivery by train. I reccomend All Aboard and will visit again."
  ]
 },
 {
  "name": "Riverfront Steakhouse",
  "address": "2 Riverfront Pl, North Little Rock, AR 72114, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/056eb7ba-9332-11ea-a70e-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10999020570985421463",
  "source": "GoogleMaps",
  "reviews": [
   "Was with a large party (about 30) in the large room. Had one waiter for all 30. He was great but it took forever to get our meals and forever to pass them out. Food was cold when we were ready. Should have allowed for at least 2 people to help. I had blackened chicken and wife a steak. Chicken was flavorless...basically just a extra well cooked semi charred piece of chicken. Seemed to have no seasoning on it like you would think \"blackened\" would have - it was 2$ extra for the blackened. Steak was tough and not worth the cost. The 1 star came from the salad bar - it was good. I should have just got that. I was not the only one that had issues with the food. This was my first visit and my last.....",
   "Excellent service nice wine selection and the desserts are delicious",
   "Went for valentine's day with my husband.  We had a great time and, as always,  the food was fantastic!  Great service,  as well.  Its pricey, so we don't go often.  But when we go for special occasions,  it never disappoints!!",
   "The steak was fantastic. The service we received from our waiter Stephen was not however. Out of our party of four, only one steak was cooked how we asked for it. I asked the manager as he was going by if we could get our correct steaks. No problem. However when Stephen our waiter came back he made a passive aggressive comment about how he would’ve liked the chance to fix the situation himself. Serving assistant chip was fantastic as well. I think Stephen might have been an outlier.",
   "Server was very friendly! Salad bar was outstanding. The filet was slightly over cooked and had a very strong pepper coating."
  ]
 },
 {
  "name": "Benihana",
  "address": "2 Riverfront Pl, North Little Rock, AR 72114, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/05d988d2-9332-11ea-8421-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1697110750142682855",
  "source": "GoogleMaps",
  "reviews": [
   "It was..  very good.  I eat at many central Arkansas hibachi.  The servers were extremely polite and courteous.  The food was delicious and we'll put together.  The steak was outstanding, the veggies were delicious and the shrimp were perfect.  Highly recommended.",
   "My daughter and I hadn't had hibachi in a while. We really enjoyed the food, ambiance and most of all our chef Mr. Long💖😍👍💕Although we had to wait over 30 minutes after we were seated. He made our experience EXTRA SPECIAL 💓💫😁😄😋",
   "This was the 3rd time I've been to Benihana and have not been disappointed yet. The chefs are entertaining and the food is excellent. The portions are spot on. I like that you end up with people you don't know at the table which make for some pretty interesting conversations.",
   "Service & food is always great! You can't go wrong with the lunch specials. Whatever your food preferences there is something for you.",
   "First time going and I have to say I was impressed. Mind you it's a loud atmosphere so be ready to turn around and see what's happening. The food, of course, was great and it's always a keen type of entertainment when you see how they cook and prepare the food. It's mostly cooked well to where soy sauce is not a heavy need. And yes they do all the food tricks. Good for the family or even a couple's date."
  ]
 },
 {
  "name": "Allsopp & Chapple Restaurant + Bar",
  "address": "311 Main St, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0628441e-9332-11ea-8623-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "music",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=681941860922689567",
  "source": "GoogleMaps",
  "reviews": [
   "The food was was really good and the atmosphere was nice. One of the cocktails we had was good and the other was gross. We liked the Great Gatsby and would recommend. Our waiter made a couple of mistakes with our order, but they made them right each time.",
   "Great service and great food. Nice job.",
   "Came on a Monday night and was not disappointed in food or service. The atmosphere was the usual low light calm with background music of most upscale American bistros, which is perfect for fine dinning in my opinion. The place was had only 3-4 other tables one of which was Asa Hutchinson (our current governor)so I assume he enjoys it. My table had the Veal chop, shrimp and grits, wagyu short rib, and red snapper(I think). Everything was close to perfect. My veal chop was cooked a little much, no pink in the middle, but it was still delicious and I hate to be \"that guy\" so no biggie. The smoked Gouda grits were amazing. The short rib was so tender you could cut it with a spoon. The shrimp and grits and red snapper were cooked perfectly as well, highly recommend. All our plates were wiped Clean and we were all satisfied. For cocktails we had the Animal farm bacon bourbon old fashioned and the Night to remember a mezcal with apricot liquor and blue berry lavender syrup. Both obviously delicious.",
   "My server, Austin, was the best! Beyond excellent customer service, he made suggestions that were right on point. In fact, the entire team was really friendly, and made sure we had a great experience. Oh, and the food was pricey but DELICIOUS.",
   "The food and service was great! Loved the duck and the short ribs. The Catch 22 is also delicious."
  ]
 },
 {
  "name": "Flying Saucer Draught Emporium",
  "address": "323 President Clinton Ave, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/06b2aa34-9332-11ea-8d8a-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7408731798959532243",
  "source": "GoogleMaps",
  "reviews": [
   "Besides having more beers than you could ask for, Flying Saucer also has some really good food.  Lauren's Goat Cheese Salad (pictured, with chicken added for an additional fee) is one of my favorite salads in Little Rock. They also have several sandwiches that my husband brags on. Their appetizer list is pretty awesome, especially their Loaded Rocket Tots! We like the atmosphere as well.  The front area is great for sunny days, with tons of windows.",
   "Highly recommend this place. The German plate and fries were excellent. The bratwurst reminded me of Germany. My girlfriend really enjoyed her cheese fries as well. The atmosphere was really welcoming, the server was very friendly and the beer was great.",
   "Pretty good place, service , food and drink. They also have a very nice beer selection.\n\nIt is also located in a very good spot in downtown nearby a bunch of cool attractions.\n\nFood: Reuben-Esque Sandwich + 2 sunny side eggs (this was a custom order I asked)\nDrink: Local IPA beer",
   "I have always enjoyed each of my visits to this establishment. Lots and lots of beers on tap! Definitely always try to swing by here for a different brew each time I'm in Little Rock. Really cool atmosphere too! Located right in the middle of downtown Little Rock.",
   "Great place to get a bite or a drink. Their drink selection is vast, and they have $4 taps all day Monday and 4-7pm Tues-Fri. Their food is exceptional as well. It's a bit of a pound environment, so don't expect a quiet place, but it's a bar; what do you expect? I highly recommend."
  ]
 },
 {
  "name": "42 Bar and Table",
  "address": "1200 President Clinton Ave, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/07228354-9332-11ea-a2dd-14b31f159f22.png",
  "tags": [
   "delicious",
   "library",
   "drink",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16275860239909120968",
  "source": "GoogleMaps",
  "reviews": [
   "Had lunch here with a new friend from the Ultimate Travel Writers Workshop. The outdoor location was cool in the shade and perfect even in the heat of the day.  Had Fish and Chips. It was awesome!  Had to deduct 1 star with the fly attack that accompanied serving of the meal.  Fortunately a breeze flew in and drove than away.  Otherwise it was a great lunch and I will be back.",
   "Went for lunch..had the smoked brisket and sweet potato fries....outstanding! Will definitely be back to try the brunch menu. \nOh..the carrot cake was delicious too..a bit pricey but good nonetheless.",
   "excellent southern brunch. They have a very nice shrimp and grits as you'd expect. I had the crab cake Benedict which was way too decadent but absolutely up to snuff. The chicken and waffles is quite good, as are the beignets which are definitely worthwhile. The pricing is very reasonable and the atmosphere is upscale with nice views of the Arkansas River as well as the garden and a very nice patio that is shaded by the library itself. My daughter ate all of her Nutella crepes and they also have a good selection of a la carte.",
   "First let me say that the bartender was worth visiting again. He was nice, entertaining, and made a great negroni. Also, the filet was excellent. Those reasons are why this place gets 3 stars. It got dinged because our server actually complained about us bringing in our own wine(which I'm pretty sure is not illegal) and he proceeded to do a piss-poor opening and presentation after we told him we could just open ourselves if he was going to be so put out by it. UGH. He also vocalized his frustration at us paying and tipping the bartender before we sat down so that he missed that tip. Dude, you didn't mix our drinks and entertain us, bartender did. Bartender gets the tip. He tried to recover with light banter but had already lost us as an audience. Several slightly snide comments later he tells us that we were supposed to be one of his VIP tables(humble brag). Could have fooled us, buddy! I hate to see how he treats the rude tables if that were true. Also, we felt rushed. Here's the deal, we like to eat, drink, and talk and are happy to pay for the privilege to do so in your establishment. We do not want to feel unwelcome or hurried. The biggest hint that it was time for us to leave was when our server told us that we probably wouldn't want any of the desserts that he had left and he didn't want to bother the kitchen. OOOOkkkkaaayyyy. Never mind then. Turned out that the kitchen was not bothered a bit and sent out a sampler plate. And they were all good. Winner. Too late to order a cup of coffee though, it wasn't ten o'clock yet. Then the valet came up to our table, asked if this was the key to our car, tossed it on the table, and turned tail. Saved that tip money, I guess. \n\nWe have been baffled lately by some of the poor service we've received at some of the pricier restaurants in town and 42 is not immune to this epidemic. \n\nAgain, bartender was cool. Food was good. Server was neither. Valet was lame. Get it together, team.",
   "Food is great and reasonably priced. Also, the personnel is very accommodating with large parties."
  ]
 },
 {
  "name": "Kontiki African Restaurant",
  "address": "3901 S University Ave, Little Rock, AR 72204, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0785d966-9332-11ea-b2e4-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "music",
   "kids",
   "food",
   "delicious",
   "drink",
   "family",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=6464846849215019829",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent food. We ordered a lot of different items off the menu, including all of the appetizers and some of the specials of the day.\n\nEveryone in the party thought it was really exceptional food. I liked the peanut soup with beef the best. I was really blown away by how delicious it was. \n\nWould definitely come back and recommend you try it if you've never been.",
   "Excellent service, vibrating music and all above tasty food. I simply enjoy eating there. Love it!",
   "First time here, can’t believe it has been open for 2 years and we didn’t know it. It was fantastic! We brought our kids and they enjoyed it as well. They have food for everyone, even picky eaters. Their okra rice and pepper soup were my favorites!",
   "Can’t help but order the Peanut Stew every time (beef is much more flavorful than chicken to me) but the jollof Rice is also amazing, and the plantains are delicious. I’ve never gone wrong at Kontiki. Ginger beer is very strong, which is a good thing in my opinion, but may be too much for some.",
   "I really liked the cleanliness of the restaurant & it seemed family friendly. That being said, it was a little sterile. There was no music playing and I expected to feel emerged in an West African type of experience. I had the couscous & chicken. The food had generous portions of couscous and fresh vegetables, but the chicken didn't seem to be marinated in the sauce (which there wasn't enough of). The waitress was nice & brought me my water, but never came by my table to refill my drink or to ask how the food was. I hope they expand their menu and add items like chicken yasa, provide Maggi sauce, or popular African deserts. I will definitely give this restaurant another chance and maybe try another dish."
  ]
 },
 {
  "name": "The House Of Mental",
  "address": "801 S Chester St Suite 1, Little Rock, AR 72201, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/07e20434-9332-11ea-ac01-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=4802237984299550692",
  "source": "GoogleMaps",
  "reviews": [
   "This place is insanely good. The cauliflower wings are delicious and crispy and the mac-no-cheese BLEW ME AWAY. I'm still sitting here trying to figure out how it tastes so good. I highly recommend supporting this small business!! ❤",
   "I got the kale, buffalo and Asian cauliflower wings, and the spaghetti. Everything was Awesome! I will most definitely be going back. Anyone who eats there will not be disappointed.",
   "Delicious food, friendly service. Cozy environment driven by a mission to spread health. THIS IS A GREAT BUSINESS TO SUPPORT!",
   "She literally had the best vegan food! and them sweet potatoes are amazing 😫❤️🔥",
   "The MacNOCheese is jaw-dropping delicious! And the portions are huge!  I'm already planning my next meal there!"
  ]
 },
 {
  "name": "Buffalo Grill",
  "address": "1611 Rebsamen Park Rd, Little Rock, AR 72211, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/084c3780-9332-11ea-959e-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "family",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18089363202034329756",
  "source": "GoogleMaps",
  "reviews": [
   "You gotta \"Shuffle on Down\" to the Buffalo Grill! Absolutely  love this place! Hands down, my favorite burger joint of all time! I have been coming here since I was a child and will continue coming here so long as I live. Everytime I'm in Little Rock I make sure to stop by here and eat. Never disappointed and not a thing on the menu I don't like! Be sure to try the Cheese Dip and Chips, you won't be disappointed!",
   "Been here a couple times. It's good, and certainly better than fast food. Service friendly and fast. Portions generous and love the French fries. Wish they toasted the hamburger buns though...they tend to get way too soggy, especially if getting lots of toppings.",
   "Amazing experience. And great food. Had the hamburger steak, awesome. I was there with 16 others for a birthday party, it was a sunday night and we just kinda popped in, not only did they accommodate us, they went out of the way to help my handicapped father. The owner was hands on and friendly. Just great family atmosphere.",
   "Turkey club is the best. Huge drinking cups and nice servers. There is an downstairs seating area that’s typically less packed, head to the back in the left and the second set of stairs.",
   "Great food, very friendly staff! Cozy atmosphere, love the ambiance. One of my favorite places to eat!"
  ]
 }
]