[
 {
  "name": "Wisconsin State Capitol",
  "address": "2 E Main St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/08917e2e-9332-11ea-83e4-14b31f159f22.png",
  "tags": [
   "unique",
   "history",
   "tour",
   "free",
   "art",
   "history",
   "structure",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=5780779485522475748",
  "source": "GoogleMaps",
  "reviews": [
   "What a unique place! I discovered quite a bit of United States history here. And the paintings are beautifully painted. Lots of architecture to take a look at. And plenty of bathrooms on every floor. If you're looking for a place to sit down, there are leather chairs outside the supreme court courtroom on the second floor, in addition to benches outside the Capitol itself",
   "The Capitol’s Art and Architecture Gives Great Aesthetic Pleasure -  The capitol building is a marvel - built with over 40 different types of marble, great art throughout, and interiors lit by natural light.  Definitely take the free tour.  Afterward enjoy the downtown area.  There are great nearby restaurants, small cafes, and a modern art museum.  On Wednesday enjoy the Concert in Capitol Square and on Saturday morning enjoy the farmers market surrounding the capitol.",
   "Beautiful building - the tallest in Madison and without a doubt it's most iconic structure. The daily tours are informative and the history of the capitol building itself and the city are fascinating. It's beautiful when lit at night.",
   "If you have never visited Madison before this should be your first sight seeing stop. You can tour it on your own but I would recommend taking one of the guided tours as it will definitely enhance your visit. This beautiful building is a great repository of Wisconsin history. The panoramic view from the top also is not to be missed.",
   "As I imagine is tradition visiting a town for the first time, I took a stroll down town around the capital building. It was absolutely gorgeous! The entire town of Madison impressed the hell out of me, and I'll definitely be going back. The capital building is stunning, with great architecture and lots of small details to discover. Exploring inside was well worth it, and it was nice and air conditioned on the 85+ degree weather day. Will most definitely be going again to explore down town and the surrounding areas!"
  ]
 },
 {
  "name": "University of Wisconsin-Madison Arboretum",
  "address": "1207 Seminole Hwy, Madison, WI 53711, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/09066076-9332-11ea-a693-14b31f159f22.png",
  "tags": [
   "walking",
   "free"
  ],
  "link": "https://maps.google.com/?cid=4817247072601894084",
  "source": "GoogleMaps",
  "reviews": [
   "The arboretum is close by to my home. Over the years, I found great comfort escaping the city noise by walking through a woodland, a prairie, a pond. All still natural state. Delightful!",
   "Among the nicest gardens in Midwest.",
   "This place is beautiful year round. Parking can get difficult to find when it gets real busy, but always worth the trip.",
   "What an awesome treat. I'm not sure if this is a popular destination but it sure should be. Especially considering it's free and open to public.  A colorful escape in the middle of Madison. You could spend several hours just taking pictures and admiring of all the vibrant plants you see here. The gardens were fantastic. The trails were okay and well I'm not sure about the pond thou lol",
   "I now live next door so am excited to have such a great opportunity to enjoy year round. We attended the meteor shower event here by the UW Space Place on Park St. It was amazing."
  ]
 },
 {
  "name": "Madison Children's Museum",
  "address": "100 N Hamilton St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/09612ac8-9332-11ea-8bc0-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "kids",
   "kids",
   "learn",
   "affordable",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9939938927957093187",
  "source": "GoogleMaps",
  "reviews": [
   "Our company hosted our annual winter party at the Madison Children’s Museum earlier in January. It was an absolute blast! We were so impressed by the planning process we went through with the staff at the museum. They had such great suggestions and have really nailed down the coordination of large events at their venue. They worked seamlessly with our caterer, DJ, and many other vendors, which made the planning of our event both pleasant and effortless. Our guests had so much fun playing in all of the exhibits, especially the giant hamster wheel! We highly recommend the Madison Children’s Museum for any event (even when there aren’t any children attending)!",
   "Ben P., the animal education specialist in the Clubhouse on the rooftop was the absolute highlight for my kids & I!!!!  He is full of energy, friendly, knowledgeable and entertaining!  He made learning about the animals interactive & fun!  He asked my kids thought provoking questions, taught them how to be calm around the animals, how to hold them and had them engaged the entire time!  He had them really thinking about the animals and got them excited about it all! He was our ultimate absolute # 1 FAVORITE part of the entire museum! If it wasn’t for him, our experience would have been ... meh (only because the museum is geared more towards littler kids).  But because he gave us the experience of a lifetime, we highly recommend this Children’s museum!  My kids got to touch and hold; 2 snakes, bearded dragon, gecko, tortoise & a huge chicken!  Most importantly, they were excited about learning more about our native Wisconsin snakes and more!  Ben, you lit up our day and made our trip extremely memorable!  Thank you!  Please gives this hardworking guy a raise!",
   "I think this will be more fun once my son is a couple years older but for now it's really only entertaining for maybe 30 minutes as he crawls around the under 5 area. In the summer the rooftop is beautiful and he enjoyed looking at the plants and animals up there. It's still a beautiful museum, I just wish there were more for the barely mobile kids.",
   "The children’s museum is A really fun and educational place to take your children. I have been taking my children to this museum since they were very young, they always seem to enjoy it every time especially when I treat them to ice cream in the lobby. There’s always something to do for them to learn and have a good time while interacting with other children. With affordable rates for families of all incomes this is definitely a place children from all backgrounds in ages can enjoy.",
   "They finally changed it up some and kids had a blast. One of the only things to do on a Sunday for kids/toddlers. Plus entire staff was great but one of the workers Destany was so awesome! She made sure we were having fun and was very helpful when asked her questions."
  ]
 },
 {
  "name": "Chazen Museum of Art",
  "address": "800 University Ave, Madison, WI 53706, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/09af720c-9332-11ea-a189-14b31f159f22.png",
  "tags": [
   "walk",
   "art",
   "family",
   "free",
   "knowledgeable",
   "free",
   "organized",
   "kids",
   "tour",
   "art",
   "free",
   "art"
  ],
  "link": "https://maps.google.com/?cid=9869801201374312674",
  "source": "GoogleMaps",
  "reviews": [
   "One of my favorite art museums. An eclectic collection that has something for everyone.\n\nAnd it's huge! Every time we think we've seen everything, we walk in to a new and unexplored room.\n\nA really great way to spend an afternoon in Madison.",
   "I have lived in Madison for several years, but only recently checked out the Chazen while showing some family around town. What a great surprise! I hadn't expected much; it's a small free campus-based museum, but we actually spent a couple of hours in here. Great exhibits and a few pieces that made me stop and stare for a while. I'd highly recommend.",
   "I have been to the Chazen many times to see the free art. They have great rotating collections and visiting artists throughout the year. They do give tours for groups as well. I have been on one of their tours. I highly suggest that you take a tour. The guides are very knowledgeable and will ask if the group wants to see anything in particular. I think the tour took about an hour from start to finish. One of the guys on my tour asked a lot of questions and the tour guide was able to keep up with him even! I was super impressed. The museum is always very clean and well organized. The variety of art in the museum is very diverse. There seems to be a little bit of everything for everyone. It's a great place to take the kids also.",
   "Color me impressed, Chazen! I could not believe how much quality, beautiful art was at this museum. As I walked through the museum I told my friend, \"If they have a Picasso I'll be amazed.\" Maybe 50 ft later - Picasso. There was no cost for entry and they provided free coat/bag storage. I will definitely go back and I strongly suggest all art lovers check it out as well!",
   "The exhibits and rotating galleries are always well thought-out and interesting.  It's never a boring trip when you go to the Chazen! Professional staff and the museum is always extremely clean."
  ]
 },
 {
  "name": "University of Wisconsin Geology Museum",
  "address": "1215 W Dayton St, Madison, WI 53706, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0a56fd3a-9332-11ea-b7c4-14b31f159f22.png",
  "tags": [
   "free",
   "walking",
   "free",
   "free"
  ],
  "link": "https://maps.google.com/?cid=17979438336623922738",
  "source": "GoogleMaps",
  "reviews": [
   "Small but fun, they had nice exhibits set up. The dinosaur bones were really cool! The information by each area explaining what everything was was really great. The different stones and minerals all over were really cool to look at. The florescent light room was a great touch as well. I'd definitely make a trip back there again sometime.",
   "Well displayed minerals and geological stuff with well detailed information regarding each specimen kept over in simple terms. Situation within walking distance from downtown. Best part is it's totally free to visit and open for photography. Staff is also very nice and cooperative if you need any information on specific thing.",
   "What a treat to find this museum! Excellent interpretive signage accompanies a small but FANTASTIC collection. I only wish we had given ourselves more than hour to see the exhibit. As a bivalve biologist I was particularly taken by the clam and oyster fossils. And it's FREE!",
   "What a cool \"small\" museum on campus! (They have two full sized skeletons of prehistoric creatures...so it's not that \"small\") My son (he's 4) LOVES rocks and so this place is pretty much his dream. There's SO many cool rocks displayed and you can even peek in on researchers in the lab! I'm seriously impressed!",
   "Wow what a hidden treasure. This is a small museum. It is amazing though. There is great rocks. There is a wide variety. Go outside and use the map to figure out where rocks are located in an outdoor little, peaceful area. Best: free! Bring cash if you want to buy a small rock souvenir."
  ]
 },
 {
  "name": "Wisconsin Veterans Museum",
  "address": "30 W Mifflin St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0ac130d4-9332-11ea-a277-14b31f159f22.png",
  "tags": [
   "field",
   "field",
   "history",
   "drink",
   "tour",
   "free",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=640434698471395322",
  "source": "GoogleMaps",
  "reviews": [
   "Took my son here on a field trip and it was a fun place.  They have a nice selection of historical artifacts and weaponry.  The prices were pretty fair too.  Definitely a must-visit.",
   "Nice setup with realistic dioramas. Covers Wisconsin military history from Civil War to Modern. Has real aircraft and field gun on display. Awesome actual submarine periscope to see outside",
   "Had been meaning to visit for years a small, but well put together collection, focusing on Wisconsin, and it's military contributions to our country. Great gift shop as well, I highly recommend. Also the Wisconsin State Historical Museum is across the street.",
   "They have done ALOT with a small space. We went for drink n draw: so cool! Plus drinks! The museum is a 4, but the event made it a 5!",
   "Free. Very organized. Took a guided tour with my daughters 5th grade class. Very informative! The displays are Great! Life like! No parking, find a ramp just off Carroll Street."
  ]
 },
 {
  "name": "National Mustard Museum",
  "address": "7477 Hubbard Ave, Middleton, WI 53562, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0b17dcd2-9332-11ea-b618-14b31f159f22.png",
  "tags": [
   "free",
   "free",
   "creative",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15227287926733914636",
  "source": "GoogleMaps",
  "reviews": [
   "It is a free museum in Middleton that gives free taste tests and has a mustard gift shop. What's not to love? It was a very playful museum with some interactive parts that were a lot of fun. I highly suggest making this stop any day they are open. Loved it!",
   "nice area to hang out and dine, you may as well stop in and try one of the many many mustards.",
   "So fun!  The museum is small, but packed with fun facts and mustard memorabilia. Admission is free but donations are appreciated. The store offers tastings of pretty much every mustard there, and of course you will certainly find something wonderful to take home.",
   "This place is so nice and creative. Love the Museum in the basement and will be going back again.  It has all your mustard needs in one stop.   Great place to find a gift nobody would be thinking of.",
   "It is a fascinating and quirky museum with mustard from around the world plus a wall of mustards from every single state. The best part is that you can try several highlighted flavors and buy ones that you may otherwise not have access to in any local store. I highly recommend this as a fun visit with kids or friends."
  ]
 },
 {
  "name": "Vilas Park",
  "address": "702 S Randall Ave, Madison, WI 53715, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0b74a2da-9332-11ea-8d5c-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "kids",
   "free",
   "kids",
   "free",
   "free",
   "learn",
   "free",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=15507955481159557504",
  "source": "GoogleMaps",
  "reviews": [
   "This is a nice park. Its most special thing is that it is adjoined with the zoo of the same name. Don't get me wrong by not giving it 5 stars. I just feel that we shouldn't give 5 to everything just to make sure it's fine. It is a larger park and has at least one playground for young kids. It also has a few ponds for ambience. It has one baseball diamond and has volleyball areas as well. Enjoy lunch at the park and follow it with a visit to the zoo for a great family day.",
   "This place is an incredible, little gem! It’s nestled nicely in Madison and surrounded by beauty. It’s an amazing attraction to take the kids to or just anywhere in general. It’s free and has plenty of stuff to do. There is a suggested two dollar donation and there’s a few donation boxes around the zoo. \nVilas Park is one of my personal favourite ways to spend a whole afternoon. There more than the zoo inside this park but that’s what makes it amazing!",
   "Nice zoo, especially for young kids. Its clean, not too big and FREE! Great place to spend half a day or so. Take your time and enjoy.",
   "This is one of the better free zoo's that I have been to. Been many times and have always enjoyed it.  We were in Madison recently and I saw that they had Christmas lights at the zoo, after dark.  It was so amazing. Highly recommend stopping anytime,  but if you get the chance check out the Christmas lights",
   "It's completely free, and even in the winter season it's still entertaining. Sometimes I find it hard for me to see any large animal in captivity and not where they belong in nature. Although is zoo is still a great place to observe and learn about foreign wild animals as well as domestic."
  ]
 },
 {
  "name": "Allen Centennial Garden",
  "address": "620 Babcock Dr, Madison, WI 53706, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0bdf7358-9332-11ea-a256-14b31f159f22.png",
  "tags": [
   "walk",
   "free",
   "walk",
   "food",
   "learn",
   "historic",
   "free",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=12861554139020398336",
  "source": "GoogleMaps",
  "reviews": [
   "This is a hidden gem on the UW campus. It’s a beautiful place to take a walk, sit on a bench, and relax. The flowers are stunning in spring, summer and fall. Entrance is free, but donations help maintain the beautiful landscape. I would definitely recommend for a cute date spot!",
   "I attended a work wellness event at the Allen Centennial Gardens. What a fantastic resource on the UW-Madison campus that is free to everyone who wants to learn more about this garden and plants in general. I have been to this cute garden a hand full of times in the past, but have never taken a formal tour of it. I'm so glad that I took a tour!\n\nIn the ~45 minute tour, I learned so much about plants, general landscaping designs, our changing environment, agriculture in Wisconsin, bees and the beautiful historic home on the garden grounds.\n\nThe gardens are absolutely free to the public and also can be rented out for events (ie weddings, photo opportunities, etc). They also host quite a few events during the year also. They have a really nice website where their events (most are free) are posted.\n\nThe historic home is under construction currently and is not open for viewing. It sounds as though the home will be closed for an undetermined amount of time still. Once finished, it will host environmentally friendly campus organizations.  \n\nThey have quite a few different gardens to walk through or sit in to enjoy a little longer. The walkways are paved and easy to maneuver through. There's lots of seating throughout to enjoy the gardens. I love the water features and their relaxing sounds. The koi pond was probably my favorite spot. They were anxiously awaiting us to drop some food into the water and would follow us as we circumnavigated around the waters edge.",
   "Celebrating 30 years June 2019, stunning gardens!  Multiple styles in one setting to include container, rock, woodland, English - crazy variety of hostas along with a Koi pond, lovely shade trees and various spots to sit and enjoy.",
   "Allen Centennial Garden is awesome! It shows a huge variety of plants from different environments.",
   "Great UW-Madison landmark showcasing beauty and quiet."
  ]
 },
 {
  "name": "Wisconsin Historical Museum",
  "address": "30 N Carroll St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0c4a69fe-9332-11ea-872b-14b31f159f22.png",
  "tags": [
   "history",
   "kids",
   "history",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7281105885454582034",
  "source": "GoogleMaps",
  "reviews": [
   "I visited the Wisconsin Historical Museum to see the Ever Gleam exhibit showcasing their assortment of aluminum Christmas trees. The exhibit was pretty small, but it was interesting to see some of the history of them. I didn't realize that this was their 60th year on display for the holidays. The exhibits rotate through. Check their website for events.",
   "Very interesting. Many items were conversation starters with my brother. You have to see the picture made from hair. SO intricate!! \n\nAm excited to visit again when they move into the new building. There should be so much more to see. The staff was very informative, friendly, and kind.",
   "Great place. For floors. A lot of things for kids to touch. Great Indian history. No admission fee. Just donations.",
   "A wonderful free (with recommended donation) museum! I've lived most of my life in Wisconsin, so learning more about the history of this great state was a treat. The extensive exhibit about the Native Americans was fascinating, along with the exploration into the political history of the state. Highly recommended!",
   "Cool museum with lots for historical artifacts from the great state of Wisconsin"
  ]
 },
 {
  "name": "Warner Park",
  "address": "2930 N Sherman Ave, Madison, WI 53704, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0cba911e-9332-11ea-92be-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "wander",
   "kids",
   "free",
   "music",
   "field",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=8165061967116333387",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful prices. Even my mom at 88 wants to go back as the announcer makes it fun. Catches kids attention as Many side show events tht are amusing; even chooses the audience members to join in like; baby crawls, throwing balls N many more at each game",
   "This park is beautiful. There are trails to wander on, the Mallards Stadium, nice areas for the kids to play, and it was just a pleasant experience.",
   "My grandkids love to come here so we enjoy",
   "Absolutely the best place to take the kids for a baseball game! There's something for everyone! Activities for kids and adults; giveaways throughout the entire game; donations to charities; and all kinds of things to keep everyone involved, from bouncing giant baseballs throughout the stands to throwing free goodies up into the seats and lots and lots of music. Fun time!",
   "A great park with so much to offer! Mallards Stadium, East High football games, little leagues, softball, soccer field, walking and biking paths, community center, multicolored shelter, play equipment, basketball court and some scenic views. Hope you like it too!"
  ]
 },
 {
  "name": "Madison Museum of Contemporary Art",
  "address": "227 State St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0d4126b6-9332-11ea-b04b-14b31f159f22.png",
  "tags": [
   "free",
   "art",
   "organized",
   "art",
   "free",
   "art"
  ],
  "link": "https://maps.google.com/?cid=10661753417326145979",
  "source": "GoogleMaps",
  "reviews": [
   "Fascinating, thought provoking, reflection inducing, carefully curated art open to the public free of charge.  A wonderful service and a remarkable opportunity.",
   "The staff was very informative. Nice place to spend some time without spending money. They had a couple really nice exhibitions I would have been fine spending money to see, the quality was fantastic.",
   "I collaborated with the museum on a February styled shoot and I was so pleased with my experience! It offers such a gorgeous, bright and open wedding space. The staff were so polite, organized and accommodating! It was a pleasure working with them!",
   "Beautiful space surrounded by glass walls.  Collection includes many different styles of art including many media.  Displayed with appropriate space and light.  Spent an hour appreciating the three major galleries.  Convenient location at the Overture Center in downtown Madison.",
   "A beautiful building in downtown Madison, highlighting a diverse array of contemporary and local art. Well worth a visit! And it's free! (But you should leave a donation of you can.)"
  ]
 },
 {
  "name": "Olbrich Botanical Gardens",
  "address": "3330 Atwood Ave, Madison, WI 53704, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0d911bb6-9332-11ea-a712-14b31f159f22.png",
  "tags": [
   "free",
   "walk",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9993984398970806407",
  "source": "GoogleMaps",
  "reviews": [
   "I truly love this place! I've been going there since I was born and now take my children there. I love seeing all the beautifully maintained gardens. It's such an enjoyable place to visit! I love that it's basically free but always give a nice donation because I really enjoy visiting! I'm sure I'll be coming back for years to come!",
   "Wonderful place for all seasons!\n\nWinter: Go inside and check out their conservatory featuring various exotic birds, plants, and trees. This place is sure to cure your winter blues.\n\nAny other season: Check our the botanical gardens and see all the various plants and landscaping they incorporate into their flawless layout.\n\nVery inexpensive date idea, typical time it takes to walk around is 1-2 hours.",
   "Feburary is Orchid month at the dome. Stepping into the indoor tropical garden is just what the doctor ordered for subzero winter blues. The tiny birds flying around and the quail on the ground add a lively element.  We can't wait until the spring when the enormous outdoor garden starts to bloom. The gift store has some very pretty souvenirs. I especially like the Wisconsin themed alphabet book. B is for Badger of course.",
   "Excellent winter time activity for the whole family.  Attractive and lively garden center with train and holiday display to visit in addition to the conservatory.  Gardens still had some plants to see despite the cold weather and the stroll through the outside paths made for good exercise.  The indoor conservatory transports the visitor to a tropical paradise and allows for an educational walk with flowers, plants and birds not available in Madison.  \n\nConstruction of the new educational facilities in ongoing.  Will be a fantastic set of buildings when completed.\n\nEasy to borrow a scooter for people with mobility challenges.    Holiday Cafe set out for refreshments.",
   "Went here for the orchid show in Jan or Feb of 2020. Glad to see flowers in Winter.  The building was stuffed full and packed with people.  Lighting in the lecture-room with the sloped glass roof needs to be updated from old big fixtures. First time they're looking forward to going back in better weather."
  ]
 },
 {
  "name": "Escape This",
  "address": "120 E Wilson St #2, Madison, WI 53703, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0deb980a-9332-11ea-9b7f-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=16614541635325500246",
  "source": "GoogleMaps",
  "reviews": [
   "The staff here was very helpful and prompt with responding to questions and recommendations of dining options nearby.  The escape room puzzle was fun and entertaining. The only mishap we had with our puzzle is that one item opened with an incorrect code somehow which threw off our ability to complete the entire puzzle correctly. The staff person was very apologetic and assured us the item would be reset correctly for the next time around. We would recommend ‘Escape This’ to other groups.",
   "Such a fun bonding experience... awesome puzzles and games in the rooms! Great gamekeeper to help keep you on track.",
   "Alright, this was a lot of fun. Sherlock room so I can't speak to the other one but this was fairly tough. I think having done one we might be able to figure out the next one, but this was a good challenge.",
   "I brought a group of 12 here. We initially planned to do the lost Friday night room, but the host here suggested we switch over to the Sherlocked room which was available. This was a great suggestion. We took almost all the allotted time to complete this challenge. It was well paced and well themed. Overall had a great experience, and everyone in the group was able to get involved. This was a moderately challenging room, so experience helps.",
   "Only issue is I wish the first half was as hands on and physical as part two"
  ]
 },
 {
  "name": "Escape In Time - Escape Rooms",
  "address": "6527 Normandy Ln UNIT 203, Madison, WI 53719, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0e4a3300-9332-11ea-8d92-14b31f159f22.png",
  "tags": [
   "eat"
  ],
  "link": "https://maps.google.com/?cid=9992342063593004578",
  "source": "GoogleMaps",
  "reviews": [
   "From the initial entrance of trying to find your way in, to finally getting the serum in 8min to spare. Bunker 57 was a great way to spend our evening for my daughters birthday!  Start to finish it was a rush of survival! Never done anything like this before and had an amazing night! So much fun we already bought tickets for our next adventure!",
   "Great time! The room was a blast, and I loved how emersed into the story I felt. The room(s) where convincing. Other escape rooms have not been done as well, still hints of being in a regular room. But not here. I would deffinatly reccomend!!!",
   "Right away, we had a malfunction in our room (our door got physically stuck), so the game master gave us permission to move onto the next step (even though we solved the clue). It definitely killed the mood. There are NOT enough tasks for a group of 8 to do at the same time. There was AT LEAST 2 of us standing to the side at any given time doing absolutely nothing. The room we were in was also unnecessarily dark. So much so, that we missed part of the game play and the game master chimed in because we couldn't see the item in question. While it killed a good hour of time, it was not worth $30. I was not entertained. I would not visit again. The group sizes need to shrink or they need to add more components/steps to the escaping prices, even if they're not critical to the actual escape and are more \"side quests\" - just something to keep everyone busy. Be aware, our room was also quite chilly.",
   "Overall, Escape in Time heavily invests in aesthetics and lacks in content. The aesthetics are very impressive, the only upside to this location. However, our group of four purposely chose their \"most-difficult\" room, Cyrosleep. The room lacked sufficient puzzles to keep everyone moving and often had multiple people standing around waiting till one person was able to plug in a code. The puzzles were very linear and not challenging. We escaped with 19 minutes left and were disappointed. We were expecting atleast another room to move into. The designs and displays were intriguing but we left feeling like we completed half a room. There was no rush or adrenaline or sense of emergency. Not going to return to this escape room.",
   "We had a really fun (if nerve-chilling) time escaping from the \"Eat or Be Eaten\" room with 8 seconds to spare! It is a perfect room for this time of year with Halloween coming up. 😁"
  ]
 },
 {
  "name": "Tenney Park",
  "address": "402 N Thornton Ave, Madison, WI 53703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0ea21774-9332-11ea-b13d-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "free",
   "historic",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=8737370584904932256",
  "source": "GoogleMaps",
  "reviews": [
   "What a beautiful spot! Feel free to fish, hike, take a leisurely walk, and NO SWIMMING. This is a beautiful spot for some professional photos because of the beautiful bridge here. When I went, I saw some people painting outside, and thought, 'what a great idea!'",
   "Beautiful park. Nice waterways, including historic bridges. Lots of rain gardens with pollinators. There's a beach and boardwalk with a lighthouse. There are public restrooms near one of the playgrounds (by the lake) and another by the locks. Lots of tennis courts.",
   "Beautiful spot to walk, swing, swim, fish and more. You can watch the boats go through the lock. Fabulous place to watch the sunset.",
   "Tenney park and locks is an essential element of Madison. An excellent place to shore fish, the park is also a very nice place for a walk or run anytime. Good neighborhood, quite safe. Try ice skating at the pond during the winter, can be a great time.",
   "Great service! Surprisingly functional on a snowy day! Bring your own shovel!"
  ]
 },
 {
  "name": "Aldo Leopold Nature Center",
  "address": "330 Femrite Dr, Monona, WI 53716, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0ef2a866-9332-11ea-8d23-14b31f159f22.png",
  "tags": [
   "nature",
   "unique",
   "nature",
   "kids",
   "nature",
   "nature",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=12239526863888914946",
  "source": "GoogleMaps",
  "reviews": [
   "A great nature refuge in the city. There are several paths to explore including a small pond. There are not landscaped as in a park but simple rugged paths. In the building, they provide a variety of classes and activities. The building is handicap accessible however, the paths are rough. (The staff is very helpful and I suspect that if you contacted them in advance some accommodations would be made - but the paths are rough.)",
   "Beautiful nature center located just outside the city! They've got a lovely prairie full of diverse plant life, squirrels and a wide array of birds including a nesting pair of sandhill cranes. There's a nice array of trails through the nature park and inside there's an awesome exhibit of climate and the earth, including two very cool movie presentations in unique little theaters.",
   "Beautiful place.  I went there for my first time with my daughter to attend a birthday party.   Anyone who has never visited must check it out.",
   "I am a first grade teacher. Yesterday I took my students to Aldo Leopold Nature Center for the Pioneer Days program they offer. It was so wonderful!! They do such a fabulous job with the kids; the docents lead well and are so kind to the students! We had Miss Grace and Miss Katherine yesterday and they were phenomenal!  The Pioneer Days program is full of hands-on activities. This was my fourth year taking a class and I have yet to be disappointed!",
   "Beautiful nature get away, nor far from the city. It's the perfect little escape. I love just walking aimlessly on the trails "
  ]
 },
 {
  "name": "Elver Park",
  "address": "1250 McKenna Blvd, Madison, WI 53719, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0f492d02-9332-11ea-9721-14b31f159f22.png",
  "tags": [
   "free",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=18390592916668781845",
  "source": "GoogleMaps",
  "reviews": [
   "Enjoyed a lot the Winter Festival, Madison. It was free. Ski materials are available on rent. Great place for sledding too.",
   "This park was quite an enjoyable experience for my son, 5 y, and me. We essentially went on an adventure exploring the park, and decide to walk through a *portal* we found at the park 🤔😳😎 into a whole new world. There, we explored the world through the imagination of my son which was so much fun. We essentially found our way back through the portal onto Earth 😁🤩☺️.\n\nThe park is quite clean. There's disc golf for a small cost. It's a great place for a walk or jog. We definitely will be coming back soon for another adventure 😎.",
   "This place has everything for every season! Ice rink, with skate rentals to relax in the cool air. Sledding hills for the rush of cold air in the face. Cross country skiing for a great workout with great trails. That's just winter!!!\n\nSummertime has disc golf, splash park, and great hiking trails!\n\nIf you like being outdoors, you'll like Elver Park!",
   "Very nice park, brand new playground and a very popular disc golf course. There is a splash pad for the kiddos too! Very family friendly 👪👍",
   "Elver Park is a great place to ski, snow shoe and ice skate in the winter, good summer stuff too. Lots of hills so its fun."
  ]
 },
 {
  "name": "Picnic Point",
  "address": "University of Wisconsin Madison, 2000 University Bay Dr, Madison, WI 53705, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0fabe6c2-9332-11ea-a49c-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6185312931871907490",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely stunning. It is like you are far away in vacation but you are in the middle of Madison. Awesome i think i found my happy place",
   "Gorgeous location.  Well maintained trail with a few fire pits along it.  They provide wood near them.",
   "Picnic Point is one of the more special places in Madison. Now only a walking trail, with several (reservable) fire pits along the way, and a large one at the tip, it's a beautiful walk through a wooded, wildflower-strewn landscape with water on both sides. A spectacular view of the University and downtown Madison. And a spectacular sunset vista the opposite way. Truly a great walk but bikes are no longer allowed.",
   "I go here all the time, great place to walk, meet people, hangout, see a sunrise, just all around great place. The trails are spacious and views are amazing one of the best places in Madison hands down. If you are lucky enough to wake up for a sunrise it's definitely worth it. It's kept clean, and well maintained. Definitely recommend you to go here",
   "This place means so much to me! Such a peaceful place where amazing sights can be seen and amazing people congregate."
  ]
 },
 {
  "name": "Wisconsin Governor's Mansion",
  "address": "99 Cambridge Rd, Madison, WI 53704, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/10133474-9332-11ea-8315-14b31f159f22.png",
  "tags": [
   "organized",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=14192005593710409492",
  "source": "GoogleMaps",
  "reviews": [
   "We attended an event here. It was well organized, the grounds were lovely, and Governer Evers and his wife were incredibly friendly. Thank you for a great experience!",
   "It's nice to be welcomed in the People's home again!",
   "Go in the summer when you can enjoy the view of the lake! Beautiful property!",
   "Beautiful house on the lake. Staff was knowledgeable and friendly. Quick walk-through with plenty of opportunities to ask questions.",
   "Beautifully decorated Governor's Mansion.  All real evergreen trees were used throughout the residence."
  ]
 },
 {
  "name": "Pheasant Branch Conservancy",
  "address": "4864 Pheasant Branch Rd, Middleton, WI 53562, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/105ac50c-9332-11ea-87d7-14b31f159f22.png",
  "tags": [
   "parks",
   "walking",
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=7437520381784141802",
  "source": "GoogleMaps",
  "reviews": [
   "Pheasant Branch is absolutely lovely! I've enjoyed every experience I've had hiking there, and my dog has as well. It's one of the few Madison parks or hiking areas where I have never seen anyone violate leash laws with their dog, which is absolutely wonderful. A great place to go spend some time outdoors!",
   "Great walking route! the whole route is pretty long, but there are many exits you can come out from. If you drove here, you would have to go back to where you parked. You can also hear a lot of woodpeckers",
   "Trails are marked well and maintained. Porta potty available at the Middleton Orchid Heights location. Various trails available for ability levels. Some paved, boardwalks keep travelers above marshy areas, mostly gravel. Park expansion in progress. Please check website for progress.",
   "So Beautiful!  I went hiking on a sunny, fall afternoon, and it was quite busy with couples and families of all ages. Everyone was helpful and in jolly spirits. An enjoyable afternoon!",
   "If you guys want to bike ride or want to take a free relaxing walk you can go this park. It is calm and quit. So many plants surrounded by you. There is a bubble spring,flowers and a long trail you can walk on. There is also a park. The park is fun to play in. You guys should try this place out whenever you want to play outside."
  ]
 },
 {
  "name": "Olbrich Park Beach",
  "address": "3527 Atwood Ave, Madison, WI 53714, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/10a3dbf0-9332-11ea-be60-14b31f159f22.png",
  "tags": [
   "free",
   "affordable",
   "family",
   "free"
  ],
  "link": "https://maps.google.com/?cid=5831548483320537114",
  "source": "GoogleMaps",
  "reviews": [
   "Can't beat the sunsets on this west facing local beauty. LOVE Madison... Let's get these lakes clean though!",
   "Olbrich Gardens is exceptionally beautiful, expensive and very affordable. It’s a wonderful place for families, couples and singles. I love how the back open air gardens are absolutely free, and the Thai Pavilion is an absolute gem of the city of Madison. Can’t wait to go back!!",
   "The place is beautiful, went with my family in vacation, since I have a Nikon camera they made me pay $31.00 for a permit as photographer, they didn't care when I told them that my family and me are visiting and that the photos taken were for personal use and memories to share, like other people who visited that day. Told the person that I could put away the camera in my bag, but didn't let me, and insisted in me leaving it with him, so I accepted leaving the camera, and ask for a ticket, the person told me that it was good and didn't need a ticket. So I paid since I don't trust that way of the facility, made me fill some paper that mention me as a photographer in an event or photo shooting.",
   "One of the nicest public gardens in the Midwest. Take time for a peaceful break in your day and go enjoy the simple beauty of this city Oasis. It's even pretty in the winter after a fresh snowfall. We all need to stop and smell the roses!",
   "Absolutely stunning outdoor gardens! The whole place seems to be run by sweet, old women and the best part is that it's free! There is also a small conservatory indoors that you can see for a small fee. Very friendly staff, lovely gift shop. 10/10 would recommend. Also seems like a beautiful place to get married, wink wink."
  ]
 },
 {
  "name": "Olin Park",
  "address": "1156 Olin-Turville Ct, Madison, WI 53715, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/10ee52da-9332-11ea-84a6-14b31f159f22.png",
  "tags": [
   "creative",
   "free",
   "kids",
   "free",
   "music"
  ],
  "link": "https://maps.google.com/?cid=8156003549140761494",
  "source": "GoogleMaps",
  "reviews": [
   "This is the Olin park at night during the holiday season. The electrician union of Madison makes an exemplary display of holiday lights. Of course there are multiple companies that sponsor this event as well. A good place to have a picnic or go for a quick run.",
   "Grounds maintained nicely, easy to reserve event space in the enclosed pavilion for gatherings large & small. Stunning view of WI State Capital looking across the lake which borders the inland perimeter of park. Nice boat launch access with concrete traction bars leading in & out of piers for optimal traction control whether launching or retrieving boats.",
   "We loved seeing the Holiday Fantasy in Lights display at Olin Park tonight.  The many light displays were  creative and clever. I  urge everyone to see this.",
   "I had enjoyed viewing this beautiful light show last night. The light show would be running until 1/4/20. I would suggest everyone to have a view of the beautiful light show. \n-free admission\n-drive thru\n\nMerry Christmas 🎄☃️🎅",
   "They finally changed it around this year with some new additions! Kids loved it and the channel played Christmas music! Thanks for having this free light show."
  ]
 },
 {
  "name": "Old Sugar Distillery",
  "address": "931 E Main St #8, Madison, WI 53703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/11499264-9332-11ea-9b82-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "tasting",
   "drink",
   "delicious",
   "music"
  ],
  "link": "https://maps.google.com/?cid=9760127891043844986",
  "source": "GoogleMaps",
  "reviews": [
   "We booked a distillery tour and tasting. It was mostly a tasting but we enjoyed it. Our guide was knowledgeable and friendly. Had a good variety of cocktails. Mostly dark liquor.",
   "Great products, make fantastic gifts. Nice interesting interior. Strong drinks and some interesting cocktails. They have outdoor seating during summer months. Service is not the best; been there countless times and never gotten any better. Might be due to being short-staffed or something. I recommend you order your next drink before you finish the one you are drinking to minimize wait time. Be prepared to wait for that great drink. They have snacks like cheese and sausage/cured meats; they are pretty good. Once you get a drink in your hand, its a good time!",
   "Went here for a cocktail or two with some friends and knew it would become a favorite! Delicious drinks, friendly bartenders, and such a cool space!",
   "High quality distillery with great cocktails, friendly staff and a beautiful space. Great patio for the warmer months (good dog friendly!), and perfect hangout inside in the winter. Sometimes they have really great live music, too!",
   "Not impressed. The whiskey tasted too young. There was not a gin option. Brandy was ok."
  ]
 },
 {
  "name": "James Madison Park",
  "address": "614 E Gorham St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/118d7ac0-9332-11ea-aa64-14b31f159f22.png",
  "tags": [
   "parks",
   "kids",
   "parks",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16168677138266404854",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great summer time park, huge grass lawn with playground and volley ball court and basketball courts. \nLast few summers the beach has been closed from blue green algae but that's nut the parks fault! Highly recommend of you want to go to a big wide open park.",
   "My favorite place that I visit during my travel to visit my daughter in Madison. It is a nice serene place, calm and cool as well as neat and clean. Well kept park by the authorities.",
   "It's ok as far as parks go, local hangout with access to Lake Mendota. Basketball court, play area for kids, limited street parking. Summer it's busy.",
   "Wonderful, lake-front park in downtown Madison WI. Lots of open space",
   "The most beautiful and relaxing spot Downtown Madison through the summer. Not very crowded during the weekend. It has a cute kids area and small beach. The place is suitable for kayaking, brunch, barbecue,volleyball game."
  ]
 },
 {
  "name": "B.B. Clarke Beach Park",
  "address": "835 Spaight St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/11d72dec-9332-11ea-993b-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=4294898353194721772",
  "source": "GoogleMaps",
  "reviews": [
   "One of Madison's great beaches! The sand and swimming area are what you'd expect, although it gets deeper quicker than, say, Vilas. If you pass a simple swimming test you can swim out to the float and diving board. The grassy slope from the street down to the water makes this a wonderful park for picnics, hanging out and people watching, reading, or a nap in the shade.",
   "First Visit June 8th 2018\nPARK INFORMATION - GREAT 1ST TIME VISIT\n\nPARK HOURS:  4am - 10pm\n\nLIFEGUARD on Duty 11am - 6pm\n      Hired by the city of Madison\n\nRESTROOMS:  Available lifeguard hours\n\nHANDICAP ACCESSIBLE - NO \n       * See comment bottom\n\nPARKING:  On the street above the park.  \n        The park is located at the base of a small\n         hill.  There is a bike/walking trail to \n         access before using wooden steps \n         to get to the beach area.  Benches line\n         This walk area to oversee the park and \n         Viewing area.  Very pretty. \n\nFOOD/DRINK:  None,  bring along\n\nBEACH:  Sand was freshly grated/clean\n     great for building with sand toys\n     (bring along) and walking/sitting\n\nSWIMMING:  Buoyed area for safety \n       Diving board area for those interested\n\nATMOSPHERE:  Refreshing area,  not large  \n        Just right for a day at the beach. \n        Playground equipment right by water\n        Easy to keep watch of children safely \n        View over Lake Monona,  City of Madison\n        Residential neighborhood\n\n*HANDICAP COMMENT - NO, But not impossible if by use of boat landing.  Not sure how to access it or if locked.  Right next to bathroom building and beach area.  Otherwise the park is on a slanted hill looking down from the road making it a challenge.",
   "Love this beach. Great for swimming. Try to get there early in the season before the blue-green algae moves in.",
   "Swimming area, lifeguards, place to sun yourself -standard, lovely for an afternoon. ",
   "Great place for fun & swimming or water sports"
  ]
 },
 {
  "name": "Warner Park Dog Park",
  "address": "2301 Sheridan Dr, Madison, WI 53704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/122968a4-9332-11ea-bc81-14b31f159f22.png",
  "tags": [
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=8733987691293401936",
  "source": "GoogleMaps",
  "reviews": [
   "Such a beautiful day for the dog park! Love walking by the water",
   "Always a lot of dogs here. My dogs love it! There's trails and water access for my dogs to swim. The people that come here are always really nice too",
   "Two huge fields, woods with squirrels to chase, and a doggie beach make this the best dog park in Madison!  Also has a separate fenced area for small, shy, or older pups.",
   "Very fun place to walk around, my friends and me tried sledding down the hill on a card board box it didnt work that well. I would recommend this park.",
   "This is my favorite dog park in Madison, and my dogs love to visit too. I love that there is one long path and a smaller enclosed area for older dogs. I have to keep my Springer away from the water though - it's way too muddy!"
  ]
 },
 {
  "name": "Governor Nelson State Park",
  "address": "5140 County Highway M, Waunakee, WI 53597, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/127f29fa-9332-11ea-90b0-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=7507634006883550034",
  "source": "GoogleMaps",
  "reviews": [
   "Great park in the winter of summer.  The beach is great place to relax with the family.",
   "We enjoy this park for hiking, pick nicking and the play ground. The park is never very busy and they have carts to use to haul things to the park area. Nice mix of trails that are through the woods and prairie. You do have to watch carefully when hiking since the trails aren't marked great. We enjoy the park area for the view of the water and Madison. Also like all the shade and breeze, perfect for relaxing or a picnic.",
   "Great place to see butterflies and birds. Three of us saw 2000 monarchs on migration on 9/15/19.  This photo was taken right across from the building at the entrance. The prairie trail is suitable for a powered scooter.",
   "Cute little park on lake Mendota. Bring a picnic and enjoy the view of the capital",
   "There is plenty of parking. Entrance fee is steep ($8 or $11/ day if you are resident or non resident). They do have annual passes as well. The park has a lot of potential, but could use some TLC. Infrastructure is crumbling. Beach area isn't that well upkept. Beach was full of green sludge. You can see downtown Madison and there is a boat launch available. Mosquitoes and bugs can be bad. There are plenty of trails through tall grass where you can see plenty of pollinators. There otherwise isn't that much to see"
  ]
 },
 {
  "name": "Orton Park",
  "address": "1103 Spaight St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/12cc11cc-9332-11ea-b8fd-14b31f159f22.png",
  "tags": [
   "free",
   "music"
  ],
  "link": "https://maps.google.com/?cid=3830278931241432574",
  "source": "GoogleMaps",
  "reviews": [
   "This was my childhood playground! Great big park with lots of trees, basketball court and gazebo. Even space for a baseball or kickball game!",
   "Orton Park fesitval.  Another great  park in Madison with free music festival.  We wemt for 2 days.  1st happy hour on Friday half price beer and wine and great music from Slow Pulp.  Saturday stopped in after bike ride around the lake.",
   "Orton Park is another excellent City of Madison park, very clean and beautiful. Orton park fest is one of the oldest city festivals at 40+ years. Certainly a great festival to attend.",
   "Tall trees. Has a kiosko. Lake is pretty close\nNice playground",
   "Nice park with playground, gazebo, and lots of green space. Basketball court, lots of benches in a lovely neighborhood. Shaded playground area is nice in the summer."
  ]
 },
 {
  "name": "Olbrich Park",
  "address": "3527 Atwood Ave, Madison, WI 53714, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1316fe7e-9332-11ea-a118-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=17615792668633687685",
  "source": "GoogleMaps",
  "reviews": [
   "We had a fun time at this little biergarden in Madison. There are a bunch of picnic tables, a few games to play (a big Jenga set, some sandy volleyball courts nearby) and even a small beach to hang out on. The day we visited was a bit overcast and drizzly but we still had a good time. As the evening got later, the small hanging lights in the area came on and created a sweet atmosphere. They had a number of beers to choose from and even came in a reusable plastic mug. Though the area is small it's worth checking out because it has great views of the lake and easy parking.",
   "Olbrich is a beautiful place to walk, play, swim, or just sit in the nearby beer garden (or not) and enjoy a gorgeous sunset over our lovely capital city.\nThere is a lot of space for pretty much anything you'd like to do. \nEnjoy!!!",
   "Nice park by the lake.",
   "Very peaceful place with natural garden and bundle of different flower trees .. love it",
   "Nice park on the lake with a beach, multiple boat launches, and canoe/kayak rentals.  Lots of space so pretty spread out along Atwood.  The beer garden was a good place to hang out.  Botanical gardens looked nice."
  ]
 },
 {
  "name": "Yahara Place Park",
  "address": "2025 Yahara Pl, Madison, WI 53704, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/136b398a-9332-11ea-8d8c-14b31f159f22.png",
  "tags": [
   "parks",
   "free",
   "food",
   "music",
   "structure"
  ],
  "link": "https://maps.google.com/?cid=6717789207436887402",
  "source": "GoogleMaps",
  "reviews": [
   "One if the better lake side parks surrounding Lake Mendota. Has a legit playground, volleyball court, and although it's not incredibly wide it's big enough to throw a frisbee without fear of it going in the street.",
   "Very beautiful.",
   "Lakefront featival with friends. Great music and Free.  2 days of live music with some good bands.  Neil Francis and his Hammond B3.  They travel gig to gig with the organ.  Nice.  ERic Mcfadden from New orleans.  Loved his song writing and music.  The festival stull has long lines for food and beer, but the music is free and the weather was nice.",
   "Nice waterfront park, older play structure and volleyball net. Great festival in early June.",
   "Very nice, LowKey spot."
  ]
 },
 {
  "name": "Lakeview Park",
  "address": "6300 Mendota Ave, Middleton, WI 53562, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/13b67252-9332-11ea-b106-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "parks",
   "walking",
   "kids",
   "walking",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3357596689097519777",
  "source": "GoogleMaps",
  "reviews": [
   "It's a very beautiful park. A big facility for kids to play, a huge shelter and a few grills. You can also bring your own grill, like us. We had a great time cooking there two weeks ago.",
   "One of the best parks in the area! It offers so much to do. It has two play areas, bathrooms, a splash pad that's open in the summer, a lake that you can fish in, and a short walking trail around the lake. My kids never get bored here and it offers a wide variety for all ages!",
   "Nice splash park for the kids, pond for fishing, path for walking, and shelters for parties",
   "Great park and memorial piece! Lots of parking, shelter area, and courts. Kids area is pretty significant in size. Great park for kids.",
   "Super fun! Beautiful walking trail with exercise equipment! I'll be back!"
  ]
 },
 {
  "name": "Crawdaddy Cove Indoor Water Park",
  "address": "1109 Fourier Dr, Madison, WI 53717, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/140aad02-9332-11ea-9aa4-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6601190069239073636",
  "source": "GoogleMaps",
  "reviews": [
   "We booked the facility for a first birthday party that we’ll be having in March. We tested it out to see how much our 6 month old would love it earlier and she had a blast!  Small enough to not be overwhelming but still plenty of fun for kids of all ages. She loved going down the slide with daddy and enjoyed the bubbling water features. The birthday room we selected for the part overlooks the pool and should be perfect for food, cake and presents. The package also includes pizza and soda. Such a fun place for the kids! :)",
   "Our little guy has a blast with his buddy. The adults loved the big slide and the hot tub. Since most visitors have a room, the bathroom and changing facilities are minimal -- too minimal for a visitor who is not also an overnight guest. I can imagine that might be an issue for anyone who has to check out on the day they visit the facility. That was my only knock on the place. We had a great time.",
   "A nice place to take your younger kids. Could definitely use a little updating but all in all we had a good experience. I definitely suggest looking online for deals to this hotel prior to booking because there are definitely some good deals out there!",
   "Don't expect Dells quality facilities. But it will do. Kids like it. It's definitely not maintained super well, but good enough. Big pool was closed while we were there due to \"contamination\" (ie: kid pooped in the pool). Have gone to a birthday party there, which was fun. Again, if you're not expecting Dells quality water park/hotel, then you will be fine. It works for what you want it to. Employees were very friendly.",
   "I would rate between a 3 or 4. The hotel is under construction for updates. We will be back again because for the 4 year old it was the perfect size. However for the 16 year old not so much to do in the eater park. One slide and basketball hoop. The slide isn't that large. For a mini getaway it was nice. Hopefully it will get better with the updates.  Our room was clean the lobby area was clean. The restroom in the waterpark needed to be cleaned."
  ]
 },
 {
  "name": "McKee Farms Park",
  "address": "2930 Chapel Valley Rd, Fitchburg, WI 53711, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1459b7a4-9332-11ea-8c20-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "pets",
   "music"
  ],
  "link": "https://maps.google.com/?cid=3902528563480713419",
  "source": "GoogleMaps",
  "reviews": [
   "A bit cold, but still fun for the kids. Restrooms are closed for the winter and water fountains are off.",
   "McKee Farms, hosted the Festival Italia in June 2019. The park is spacious, well groomed, has  a nice pavilion for parties, and also a great water sprinkler park for children.",
   "Lots of parking, hosts a lot of fun events. Great amenities. Lots of Pokestops and gyms for players of Pokemon Go. Worth checking out!",
   "Wide and good breathtaking park:)",
   "My kids enjoyed the slides and playing with others’ pets. I enjoyed the view and the friendly people out there. Diversity is noticed and it’s good to meet people from different backgrounds. It enriches our culture. Observed 2 birthday parties with lovely music"
  ]
 },
 {
  "name": "Washburn Observatory",
  "address": "1401 Observatory Dr, Madison, WI 53706, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/14a7b0dc-9332-11ea-8e45-14b31f159f22.png",
  "tags": [
   "free",
   "walking",
   "active",
   "historic",
   "walk",
   "library"
  ],
  "link": "https://maps.google.com/?cid=17215322226692810382",
  "source": "GoogleMaps",
  "reviews": [
   "Perfect place for a date night if you love science and space. On Wednesday's in the summer you can go for free and look through their telescope. the location is great, on top of a hill with a view of Lake Mendota, lots of walking paths nearby and a bike lane.",
   "Washburn Observatory is the original research observatory for the University of Wisconsin (Madison) astronomy department. Completed in 1881, it is of significant historical value though its active research days are far behind it. From the historic Clark refracted located inside to the picturesque dome-on-the-hill, Washburn is a great place for a visit when you're in Madison.",
   "A great resource. Definitely stop by on one of the open-house evenings. Much fun gazing through the refurbished telescope and observatory. Support science!",
   "Loved it.. Sign up for tweets to know if its open.  We saw Jupiter the night we went.  Its can be a long walk depending where you are starting from...",
   "Neat building, they have a cool library."
  ]
 },
 {
  "name": "Winnequah Park",
  "address": "Gazebo Nichols Rd & near Winnequah Road, Monona, WI 53716, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/14eb499c-9332-11ea-a4df-14b31f159f22.png",
  "tags": [
   "library",
   "kids",
   "structure",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2431609633407057358",
  "source": "GoogleMaps",
  "reviews": [
   "Who equal park has a quaint lagoon and gazebo that is picture perfect in any season. In the warmer months, the MY Dream Park is an amazing labyrinth of fun for all ages. I was in elementary school and got to help design the park many years ago!!",
   "Near public library Nice neighborhood park on Lake Monona near Madison, WI. Playground, picnic area, tennis courts, and municipal building. Hosts various events during the year. Was here for annual Lake Monona 20k/5k race. Good time!",
   "Very nice park.  The highlight is a dream park playground that the kids loved.  It has a large wooden structure to climb on and run around.  Two year old and 4 year old loved it.",
   "Great family park. Kids will have fun. Great area. And the pool is right next to it.",
   "My grandson's favorite part. The Dream playground is the best I've seen in a public park. And they host wonderfully executed activities. Ie: the Halloween Egg Hunt and Movie. Plenty of volunteers with friendly face. The event was fun for everyone regardless of very cold and damp weather. Thank you!"
  ]
 },
 {
  "name": "Owen Conservation Park",
  "address": "6021 Old Sauk Rd, Madison, WI 53705, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/153ab45c-9332-11ea-b763-14b31f159f22.png",
  "tags": [
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=15877111360627563614",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent park tucked away, just off of Old Sauk Road. Entrance is on the right hand side of the road, just before the elementary school, as you head down the hill towards Old Middleton Road. Small parking lot with about a dozen parking stalls. Lots of trails with plenty of elevation changes. Would be excellent for trail running.",
   "Owen Park is one of the gems of the Madison Park system. When you were inside of it and on the Prairie restoration portions or around the oak savannas. Or in one of the fern filled valleys of the middle growth deciduous forest You can barely see any of Madison. It is though you go from being in the middle of the city to the country in a matter of roughly 10 second ride in. Great walking paths very good for contemplation and meditation.",
   "Such a nice conservation park in the of residence area, provide for wild life and casual hiking environment.",
   "The prairie is like a painting of purple, yellow, browns and greens in August.  Swallowtail butterflies and monarchs floating over the flowers; tiny hummingbirds are drinking nectar at the beebalms.  Breathtaking!",
   "Lovely park to walk in with several inches of snow. There are several loops to walk which are wide enough for both those on foot and cross country skies."
  ]
 },
 {
  "name": "Capital Springs State Recreation Area",
  "address": "3113 Lake Farm Rd, Madison, WI 53711, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1591d53a-9332-11ea-9e3e-14b31f159f22.png",
  "tags": [
   "family",
   "parks",
   "field"
  ],
  "link": "https://maps.google.com/?cid=5502395293391267038",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic bike trail. Definitely going back",
   "Such a nice destination so close to Madison. Come by foot bike or car. So much wildlife to view. Peaceful relaxing. Take pictures if you like. Maybe a picnic would be fun. Close to camping. Close to boating and fishing. Bring your whole family to enjoy this gem in Madison.",
   "Seems like nice park. Bathroom clean and big. Pulled in last night, but as i have shore power,  there is mo h2o at the sites. I saw dump station pulling in. Visited this park a couple years ago. Very pretty grasslands. But, as with all the wisconsin State parks, imho,  over priced by a little. 27.00 a night is high. Maybe 25.00 would be more in line. Oh well...ok, found water hookups. Still not worth 27.00.",
   "Nice dog park with a .75 mile gravel path,  plus lots of unofficial paths and mowed or wild prairie grass areas. Limited shade in the summer,  but they are building a shelter for 2018. Poop  bags provided,  but bring your own water.",
   "Very large dog park often filled with great dogs and people. It actually has twists and turns, as well as hills and topography; not just a flat, open field with a fence."
  ]
 },
 {
  "name": "Garner (Harrison) Park",
  "address": "333 S Rosa Rd, Madison, WI 53705, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/15e17c18-9332-11ea-bef6-14b31f159f22.png",
  "tags": [
   "walk",
   "field",
   "active",
   "free",
   "parks",
   "music"
  ],
  "link": "https://maps.google.com/?cid=5798900138073518094",
  "source": "GoogleMaps",
  "reviews": [
   "A wonderful medium sized park on Madisons west side.  Room for a few soccer fields below near the basketball court.  Up top near the really cool shelter are tennis courts.  There are also several trails to walk through and around the park.  There is also a softball area in the lower right side if your at the top of the park looking down.  Also home to a few wild turkeys that you will see from time to time.",
   "Excellent park! Very spacious and lots of amenities. Small parking lot at the main park entrance that can fit approximately 20 cars. Plenty of street-side parking though. Large pavillion, soccer fields, basketball courts, a volleyball court, tennis courts, and a baseball field. Lots of connecting paved paths throughout the park. Occasionally, they have Opera in the Park here.",
   "Garner Park is a gem in Madison!  It has so many uses.  The tennis courts have been converted to pickleball and now serve many active residents.  Lessons are available through the summer months.\n\nOpera in the Park is a free event for the community that is held in what is a natural amphitheatre in the Park.  The slope of the sledding hill provides summer seating to a huge crowd, drinking wine, picnicking, and enjoying sublime music from Madison Opera.\n\nThe natural prairie is lovely in all four seasons, providing cover for a variety of birds and wildlife.  The Madison Parks Department has recently upgraded the paths and roads within the park to make it very accessible.  Playground equipment is available and well used by neighborhood children and visitors alike.",
   "Good sledding hill. Not too steep, not too short. Won't send you to the hospital like Elver but big enough to be satisfying.",
   "Nice & quiet place. Lots of space to roam around in. People play pickle ball here."
  ]
 },
 {
  "name": "Prairie Moraine County Park",
  "address": "1970 County Rd Pb, Verona, WI 53593, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/163800dc-9332-11ea-a191-14b31f159f22.png",
  "tags": [
   "nature",
   "walking",
   "walk",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=9030492717503149315",
  "source": "GoogleMaps",
  "reviews": [
   "Huge dog park with many trails for lots of distance options. Well maintained trails, mostly wood chips with gravel driveway to top of tower hill. Beloved by many, yet never feels crowded because of size of park. I love this park for a great connection with nature for me and great exercise for my pups.",
   "My dog loves coming to the Prairie Moraine park! I enjoy walking the trails while he's making new friends and exploring. Great place to get some exercise!",
   "This place is amazing. It's a big off leash dog park. You dont have to worry about other people not liking dogs while you're here and your dog has so much space to roam and explore. Even with all the cars in the parking lot on a nice Saturday morning, there was more than plenty of running space and trails for all the dogs. Wish there was a place like this closer to our home!",
   "Best park I have ever been to.  You will not find a dog park of this size that is enjoyable for dogs as well as owners looking for a nice walk.",
   "Gorgeous park! Along with the Prairie there is also woods.  A good place to go to relax and enjoy nature."
  ]
 },
 {
  "name": "Oscar Rennebohm Park",
  "address": "115 N Eau Claire Ave, Madison, WI 53705, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/16a1bf62-9332-11ea-8df0-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "walk",
   "parks",
   "field",
   "structure",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1372663400410362266",
  "source": "GoogleMaps",
  "reviews": [
   "A beautiful park in Madison. Perfect location for apartment buildings and houses around. There's a tennis court, kids play area, swings slides etc, a gathering center, a jogging, biking track, and beautiful lawn everywhere. Awesome location for my daily strolls and morning walks.",
   "I used to live in a near by apartment and used to go to this park every other day .... I am missing it so much. There is a play ground for kids and tennis courts and beautiful flowers ... every thing you need is there",
   "There is nice playground equipment and a good gazebo that is great for hosting parties and events",
   "Lovely park. Quiet. Clean. Big. Easy access.",
   "One of my favorite parks. There is diversity in the neighborhood and always families there. I feel safe bringing my kids there. I like the slides and structure. The ping pong table is a great touch. The big field is fun to run through on warm summer evenings and the walk around the park is beautiful in autumn with the leaves!"
  ]
 },
 {
  "name": "Hiestand Park",
  "address": "4302 Milwaukee St, Madison, WI 53714, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/16fcff4a-9332-11ea-9ccf-14b31f159f22.png",
  "tags": [
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6567456003723184047",
  "source": "GoogleMaps",
  "reviews": [
   "Radar Hill. I have been walking this now for several weeks and utilizing the inclines and the declines for proprioceptive training. The snow makes it even more interesting. I'm so glad it's here and within walking distance. It's my new Wisconsin version of my Florida \"Primal Playground\". Outdoor exercise is better than stuffing yourself inside of a box any day of the week.",
   "Cool park with so many fun things",
   "A great park to go for a walk in or take your dog for a walk in. Usually pretty empty but if the weather is really nice you'll get a lot of Ultimate Frisbee players. It's really well kept and clean, if you're looking for somewhere on the East Side to take a breathe I would suggest stopping here.",
   "Mid level dual basket disc golf course. On the bus line but near the highway if you wanted stop make a pit stop or road trip. Enough of a challenge for all skill levels. Glide disc golf shop is across the road.  It is a pay to play course.",
   "Best disc golf course of the city of Madison! Lots of variety and elevation change."
  ]
 },
 {
  "name": "Cherokee Marsh - North Unit",
  "address": "6098 N Sherman Ave, Madison, WI 53704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1743cc46-9332-11ea-9a98-14b31f159f22.png",
  "tags": [
   "walk",
   "free",
   "hike",
   "hike",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=13799030046166428254",
  "source": "GoogleMaps",
  "reviews": [
   "This place is magical. You can walk over the marsh in several areas of the park. It's easy to remember the paths after you've ventured through the area a handful of times. There are so many beautiful spots to sit at and enjoy the various views of the marsh. Then, there are cranes all over the place. If you're lucky, you'll get to see them up close at some point during your visit. This place is really well laid out. The bathrooms are very good, for outdoors bathrooms. I was impressed. You can find a map close to the restrooms of the marsh, if you need one. The marsh is free to the public - that's right, you do not have to pay to visit the Cherokee Marsh. I highly recommend this place for hiking. Today it was still snowed over quite a bit. Bring your snow boots/rain boots if your planning on hiking. Things still need to thaw out.",
   "Great place for hike.  They have heated bathrooms for visitors which is amazing.  Its suprising large for being in Madison and the trails are very well care for which makes hiking easy.",
   "Snowy winter hike; scenic, sunny, crunchy; solitude together",
   "The sun was shining and the meadow was gorgeous. It was lovely to get out for a walk. We did a large loop and it was definitely over 3 miles, I'm thinking closer to 4. There are shorter loops options available, but it was so nice out that we wanted to continue.",
   "Cool spot with lots of mini destinations to keep 4 year olds excited. Almost enough wind and sun to keep off the mosquitos"
  ]
 },
 {
  "name": "Marshall Park",
  "address": "2101 Allen Blvd, Middleton, WI 53562, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/17a56dca-9332-11ea-98e6-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "family",
   "drink",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=10237593321189722434",
  "source": "GoogleMaps",
  "reviews": [
   "A good place for a quick jaunt and be close to the nature. They also have place to take out your boats or kayaks. The restrooms are closed during winters. Not a lot of area that you can walk around the lake though. A good place to have a picnic during the summer time. A lot of open parking space available. Good time to visit is during summer.",
   "Awesome park! Has plenty of parking, lots of areas for family activities (volley ball, fishing, etc), a kid's playground, boat landing, beach, kayak rentals, trails, a small store, and shelter areas with bathrooms. There was also an overlook area where you can look out at the lake and there were people getting their wedding pictures taken there. Very beautiful park overall. Awesome trees!",
   "Great little park to explore, with lots of small trails to hike, and places to sit. Gets a little buggy in the summer, but on a windy day it isn't too bad. There is plenty of parking even for a busy day, and access to the water is plentiful. Docks for little and big boats. Sit on the beach and tan or sit in the shade and have a drink with some friends!",
   "Our favorite fishing spot! Now you can also rent canoes and boats here as well as buy ice cream.  It's a beautiful park and place to grill out",
   "Marshall's is so great. I have the boat membership via Madison Boats and honestly the staff is so incredibly helpful, caring. and friendly. They have got your back whether you are a beginner renter or experienced boater. The lake is beautiful from here and you get a great view of the sailboats. ♡"
  ]
 },
 {
  "name": "Law Park",
  "address": "410 S Blair St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/17e7f542-9332-11ea-b856-14b31f159f22.png",
  "tags": [
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=12010073269800522720",
  "source": "GoogleMaps",
  "reviews": [
   "Got tickets to watch Shake the Lake. There was food, drinks, and private seating. The only problem was the trees that blocked the lake. But, I found a spot that was perfect for the show. Watching all the boats lining up on the lake, the lights, and the fireworks was another beautiful night in Madison.",
   "Great little park. The perfect jumping of point for many adventures. Sits on lake shore path, right near Monona Terrace on the west, and machinery row bike shop on the east. Free parking after 6 and on the weekends.",
   "An excellent view of downtown Madison with a great bike path. Views for days. A great spot for one to see the lake front from a distance.",
   "Water ski show was amazing.. Seems to be most Sunday nights in the summer.",
   "Beautiful park on the lakefront"
  ]
 },
 {
  "name": "Burrows Park",
  "address": "25 Burrows Rd, Madison, WI 53704, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/183cd434-9332-11ea-a2f0-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=17079227557922734422",
  "source": "GoogleMaps",
  "reviews": [
   "Very peaceful, great place to watch the sunset across the lake",
   "Nice quiet little spot to fish and watch a storm roll in to Madison",
   "Attended a 1 years birthday party in the shelter. Very cute park for a small gathering.",
   "Pulled in to check messages, make some phone calls and relax for a moment. Beautiful day. Lovely lakes views. Very peaceful.",
   "Beautiful park to hang out in, play soccer,  or just swing on the swings. The waterfront view is breathtaking, especially at sunset. Stop on by and enjoy the view and amenities."
  ]
 },
 {
  "name": "Brittingham Park",
  "address": "829 W Washington Ave, Madison, WI 53715, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/18a1b0e2-9332-11ea-b548-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=17556554035924463072",
  "source": "GoogleMaps",
  "reviews": [
   "Great park for all ages. Multiple playgrounds for little ones. Nice shelter house for gatherings. Community garden and bike trail. Fishing must be good because there are people fishing whether it's rain, snow, shine, summer, or winter. Close to everything. Large parking lot. Multiple parking lots and recreation areas including a basketball court. Canoe, kayak, and paddle board rentals available in season. Highly recommended.",
   "I loved this place! Huge lawns to play on, a kids playing area, a path for biking, barbecues, and easily accessible fishing areas. You name it, and you have it. Beautiful view of lake monona. Easily accessible by bus (around 3 minutes walk from the closest stop)",
   "Lots of death fish 🤔, stinks by the Lakeshore.",
   "Beautiful atmosphere. Very nice park and lots of ducks!",
   "Excellent park. I walk my dog here every day"
  ]
 },
 {
  "name": "Lake Kegonsa State Park",
  "address": "2405 Door Creek Rd, Stoughton, WI 53589, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/18f2b73a-9332-11ea-934c-14b31f159f22.png",
  "tags": [
   "walking",
   "music",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=18240728491792411385",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome campground. Great location. Lots of playgrounds! Tons of privacy in each spot. Beautiful views, lots of running trails with absolutely stunning landscapes. The water was not accessible though due to a thick green algae that signs warned against swimming- only reason for four stars. Coming back next weekend!",
   "Had a great time here. Campsites are spaced well and there's brush between them to keep some privacy. There are areas where dogs are not permitted, but they also have an area just for dogs to compensate. Very pretty views. Nice staff. Will be returning!",
   "We enjoyed walking and sitting on the nice floating  benches in the lake!",
   "Spend one weekend here every year.  Generally without issue, however, there are wardens, federal, not rangers policing. The 1st noght which was a Thursday, we felt a bit threatened when we were asked to turn our music down.  Granted it was 1045 but we were aware of quiet time and only had one neighbor within 2 campsites. He told us flat out that we quote better not make him come back unquote. I don't understand the hostility oh, we were polite and turn the music off not down. We still had 15 minutes and we were not ridiculously loud. This was kind of a hindrance but we will return to this park because of the amenities and the Rangers that are there. They've always treated us fairly and been very nice.",
   "We were going to theater in Janesville… And didn’t want to make the drive home. So we grab the campsite and plan to just drop camp in our van after the show… The sites are reasonable but there was some construction going on…It didn’t matter since our stay was so short… We did take a short hike before we left… The trails are nice in the park seemed alive with people.   I wouldn’t say it’s a Destination Park, but it surely met our need for a stay over and was nice and well-kept."
  ]
 },
 {
  "name": "Cambridge Winery - Madison Tasting Room",
  "address": "1001 S Whitney Way, Madison, WI 53711, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/19467cee-9332-11ea-8f1a-14b31f159f22.png",
  "tags": [
   "drink",
   "knowledgeable",
   "knowledgeable",
   "tasting",
   "knowledgeable",
   "food",
   "affordable",
   "unique",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=17433420534435017902",
  "source": "GoogleMaps",
  "reviews": [
   "The wine here is great and local. The employees are knowledgeable and passionate and I learned a lot about the wine I was drinking! I highly recommend this place for a nice relaxing drink on a cold or rainy day.",
   "Fun and knowledgeable staff. Fantastic wine tasting!",
   "Should be 10 stars. Brought a friend of mine who \"doesn't care for wine.\" Changed his mind about wine! Billy Peregrine is not only extremely knowledgeable, but an absolute delight. They pair food perfectly with wine if you're looking for dinner as well. Highly recommend for affordable yet fancy outings with friends. Left with 2 bottles we didn't even plan on getting it was that worth it.",
   "We go at least once a month for the monthly tasting flights. Nice mixture of sweet and dry, light bodied and full bodied, reds and whites. Some unique, locally grown grape varieties as well as grapes sourced from New York and Central California. Enjoyable, quiet, and cozy atmosphere with friendly staff.",
   "The two hosts that assisted us were absolutely lovely and excellent, and had a great synergy with one another"
  ]
 },
 {
  "name": "Physics Museum",
  "address": "1150 University Ave, Madison, WI 53706, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/198a15a8-9332-11ea-8e7d-14b31f159f22.png",
  "tags": [
   "free"
  ],
  "link": "https://maps.google.com/?cid=4631157328213362271",
  "source": "GoogleMaps",
  "reviews": [
   "Great free hands on physics museum.",
   "Nice place explaining physics using showing it in action.",
   "Interactive museum with decent exibits, a little tricky to locate. Yes it is inside a campus building",
   "A disappointment. The college had constructed many interactive devices to illustrate physics principles but they were poorly maintained, not well enough explained, and no docents around. Looks like no one in authority was paying any attention too the place.",
   "ALL the exhibits are for real experiments, and nearly all of them are working, and they work exactly the same as they do in Europe, and as far as I know, everywhere in the entire universe. PLASMA."
  ]
 },
 {
  "name": "Badger Prairie County Park",
  "address": "4654 Maple Grove Dr, Verona, WI 53593, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/19cb64b8-9332-11ea-a32e-14b31f159f22.png",
  "tags": [
   "free",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4754018608554354409",
  "source": "GoogleMaps",
  "reviews": [
   "There are a lot of trails through Badger Prairie to enjoy, with good connectivity to other trails throughout the area. It is right in the city of Verona and you'll never completely get away from road noise, which is a drawback for me. Plenty of space where it never feels crowded, nice prairies and beautiful sunsets to be had here.",
   "Great dog park. Very large, completely fenced-in area that the dogs can run around in off leash. There are garbage cans in 3 different places and a very small agility course in the summer. You do need to register your dog with the city and pay an entrance fee. It's something like $5/visit or $20/year (exact amounts are probably different but you get the idea). \n\nI highly recommend this place.",
   "This is a pretty nice park. There are actually 2 areas, one for small dogs and one foe big, but nobody uses the small dog area. The big dog area is HUGE and the doggos can really run free. My two criticisms are that there is no water for the dogs here so you have to bring your own, and I really wish they would have the walking paths because the gravel just turns to mud when it rains.",
   "Great, large park. Good double gate entrances. Bags provided. Great crowd of regulars.",
   "Very nice. There is a super model duck here that will pose like crazy for anyone. But you gotta find her. Very nice park. Bathrooms could be cleaned and renovated but everything else is on point"
  ]
 },
 {
  "name": "Token Creek County Park",
  "address": "6200 Williamsburg Way, DeForest, WI 53532, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1a293c5e-9332-11ea-9a2c-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=3516439613114418896",
  "source": "GoogleMaps",
  "reviews": [
   "Big beautiful dog park! Wonderful trails throughout the whole park! Also has frisbee golf! Just a lovely place to be!",
   "Beautiful Little campground Nestle in the woods little campsites. Unfortunately there are very few campsites and a mosquito population is 1 million to 1 1 million mosquitoes to one human. Other than that quiet great facilities beautiful place",
   "Fun county Park camping. We're able to secure a secluded camping spot the day we wanted to camp without reserving ahead of time. \nAs a caution, we did find quite a few ticks here.",
   "Beautiful park, out of the way from Madison, but still close enough for an easy drive. Would highly recommend going when it's warmer though. No fault of the park, just snow buildup is a problem in most of Wisconsin anyway.",
   "There are many regulars here - really great dogs & owners- that make this park great.  \n\nThere is a large enclosed area specifically for puppies and small breeds.  This area has some fun agility features, like a tunnel, jumps, a tire.\n\nThere are some trees, but the is mostly a wide open area.  Plenty of picnic tables and benches throughout the vast property. \n\nThe reason for 4 stars instead of 5 is how hectic it can be on Saturdays, lots of large breeds and many times I've had to offer the use of my leash to owners to prompt them to get better control of their aggressive doggo.  \n\nIn all, my 2nd favorite Madison dog park."
  ]
 },
 {
  "name": "Mendota County Park",
  "address": "5133 Co Hwy M, Middleton, WI 53562, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1a6fe2c2-9332-11ea-8cd8-14b31f159f22.png",
  "tags": [
   "history",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=12767362871048228743",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely park, where you can sit on a bench by the lake and look at the water (among other things to do).  Here you don't have to pay eleven dollars to look at the lake, as you do at the nearby state park.  Beautiful and fairly peaceful, with camping and full facilities.",
   "Awesome park with lots of amenities. Large kid's playground, multiple shelter areas, a boat landing/dock, a small swimming area, lots of tables/benches, and a large portion of the park set up for campers/RV's. Definitely a busy park with plenty of parking on site. Check out the park sign, as it gives some of the parks history and references to effigy mounds.",
   "Always a Beautiful location to stop at look at beautiful lake mendota.",
   "The lake by itself has such beautiful views. I could sit there all day if I didn't have to work. Lol.",
   "It very hot here so we gone down by the lake and cool off it's very pretty  here to watch people  on the lake"
  ]
 },
 {
  "name": "Fisher King Winery",
  "address": "1105 Laser St, Verona, WI 53593, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1acb493a-9332-11ea-b867-14b31f159f22.png",
  "tags": [
   "winery",
   "affordable",
   "music",
   "delicious",
   "winery",
   "music"
  ],
  "link": "https://maps.google.com/?cid=11487879779172296093",
  "source": "GoogleMaps",
  "reviews": [
   "Loved the Marquette wine and the sconnie board was awesome and affordable. Worth checking out this cute Verona winery!",
   "My favorite wine place in Verona so far. They moved from Mt. Horeb to here and I like their new location more. There is more space overall and the different parts each feel cozier. I think they made a pretty good port and like most of their other wines as well. They have a mix of local and non local grapes used in their wines, sell chocolates and some charcuterie at the bar. They also host a variety of events like live music and paint nights which are nice. Overall a good ambiance with friendly staff.",
   "Cute little place, reminded me more of a wine bar than a winery and the wine wasn’t my favorite and seemed a bit overpriced. They offer small snacks and charcuterie plates also that are fun and delicious, but again on the pricey side. The service was just okay and nothing to really write about. I wouldn’t go out of my way to visit but it might be fun for a one time stop while in the area.",
   "I like the wines pretty well, and it's fun to do tastings here. The bottles are kind of pricey though.",
   "Wine was pretty good.   The music was WAY too long. Could not carry on a conversation.   If I wanted loud music I'd go to a bar."
  ]
 },
 {
  "name": "Warner Park Beach",
  "address": "1101 Woodward Dr, Madison, WI 53704, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1b0ff368-9332-11ea-97cb-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=109643444367378048",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful beach.. There is a lot of seaweed right now though.",
   "Nice place to catch sunsets.  Sometimes there are some not so desirable hanging around but hey, it's a city park with a great view I can't blame them for wanting to be there too",
   "Beach is really rocky, but there is an area with a life guard on duty. Place to launch motor craft if you posses it, also areas for people to deploy personal watercraft like kayak. Best part is the wide open park area with lots of shade and plenty of benches and  tables for picnicking. Can be kind of sketchy later at night especially in the summer time. Also a dog park/overflow parking lot right around the corner which is also a nice place to take your doggo.",
   "A nice place to go by the lake and just watch the fishermen and the ducks.",
   "Quite, pretty, a boat launch, some parking"
  ]
 },
 {
  "name": "Edna Taylor Conservation Park",
  "address": "802 Femrite Dr, Madison, WI 53716, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1b6a96c0-9332-11ea-90cf-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=14306076460971349155",
  "source": "GoogleMaps",
  "reviews": [
   "It is a small marsh with grassy areas full of trees and hidden paths. I enjoyed a morning walk around there. Its beautiful!",
   "Loved walking in the park",
   "Always a peaceful place to visit and to see great wildlife !",
   "Wonderful place for birds and other wildlife",
   "Hidden east side Marvel.  This was once an ancient village of Mound Builders 1000-1500 years ago, complete with it's own mini Isthmus, walking trails leading to 300 foot long mounds atop a terminal drumlin that rises 150 foot above freshwater spring fed ponds."
  ]
 },
 {
  "name": "Alumni Park at UW-Madison",
  "address": "724 Langdon St, Madison, WI 53706, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1bbd9914-9332-11ea-bba5-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=8851006183827975501",
  "source": "GoogleMaps",
  "reviews": [
   "Great access to Lake Mendota. Outstanding for people watching.",
   "A must see in Madison!  Go Twice, once during the day and then again at night.  It is two different experiences for sure.  The night lighting is cool but you don't get to see everything if you go at night as some exhibits are only visible during the day.",
   "It's a great place for sharing with friends or by yourself,  great landscape 😎😍",
   "I love being in this place as it's a source of happiness to me. Most people do a great job by keeping it clean",
   "Very nice place, but it was wet and cold outside."
  ]
 },
 {
  "name": "City of Madison Parks",
  "address": "210 Martin Luther King Jr Blvd, Madison, WI 53703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1c043f18-9332-11ea-8209-14b31f159f22.png",
  "tags": [
   "field",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=827765115250803022",
  "source": "GoogleMaps",
  "reviews": [
   "Madison is fortunate, indeed, to have the array of natural areas we can and may enjoy within the city, and on its outskirts.  For instance, at Warner Park on the north side of town, I've seen wild turkeys, pelicans, swans, cranes, red tail hawks, great blue herons, painted turtles, frogs, toads, tree swallows, turkey vultures, belted kingfisher, grey catbirds, sharp-shinned hawks, red-bellied woodpeckers, pileated woodpeckers, American goldfinches, Cooper's hawks, scarlet tanagers, indigo buntings, osprey, ruby-throated hummingbirds, foxes, white-tailed deer, and the all-too-common mallard ducks and Canadian geese.  The flora are also vast, and there's a significant stand of black walnut trees in one area of this large city park.  It also offers a large field that is fenced, so your licensed day may run off leash - please pick up after it!\n\nI would give five stars were it not for the fact that I called today with a question, and waited for the 9th ring before my call was answered with \"City of Madison Parks Department, can you hold?\"  First off, it is for some obscure reason, a division, not a department.  Second off, clearly there is insufficient staff to answer the phone.  Third, I waited on hold for ten minutes before I gave up.  TIME IS MONEY.  My time is worth something to me, but further, I pay real money to charge my phone, and for every minute I'm on a connected telephone call, and that money was burnt in a fire when nothing is accomplished during the call.  In modern times where everybody has a mobile phone, government and business need to stop conducting business like people are still all using landlines where you can talk as many hours as you want each month, and the bill is always the same.",
   "Keep up the good work",
   "Nice places 🙌",
   "Good",
   ""
  ]
 },
 {
  "name": "Henry Vilas Zoo",
  "address": "702 S Randall Ave, Madison, WI 53715, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1c574168-9332-11ea-b258-14b31f159f22.png",
  "tags": [
   "free",
   "free",
   "free",
   "kids",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10628532423613094977",
  "source": "GoogleMaps",
  "reviews": [
   "Free zoo! Just got some nice updates. \n\nThis listing needs a better picture. Vet surgery tables? Really? Yet Vilas park nearby gets a picture of a giraffe, which it would be virtually impossible to see from the park. Fix please",
   "The animals look so sad. This zoo looks run down, and the poor animals hardly have any space to move around. I’m surprised by all the five stars... these animals need a happier life.",
   "This is one of the better free zoo's that I have been to. Always enjoy it.  Went recently to check their Christmas lights.  Very very cool. I highly recommend visiting this zoo any time of year.  Thank you to everyone that makes this zoo possible and remain free to the public",
   "This is a great zoo and it has free admission. Since the first time I've been here, and I  have been countless times, they have added a primate exhibit, an aviary, a children's area, and upgraded the polar exhibit. They have plans  to continue their upateds into the future. As I understand it, the land was bequeathed to the zoo with the stipulation that it be free of admission. I also heard that they have had greater than average success breeding lions. They have 4 adults right now.",
   "Wonderful free zoo.  I take my kids here about 1-2 times a year.  It's perfect for younger kids who can't handle an all day excursion at a bigger zoo.  The last few times we went, we either brought a picnic lunch and ate at the park adjacent to the zoo or we purchased food at the park's grill and ate at one of the picnic tables inside the zoo.  They also have an awesome playground for kids too."
  ]
 },
 {
  "name": "UW-Madison Lakeshore Nature Preserve",
  "address": "2000 University Bay Dr, Madison, WI 53705, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1ca07f86-9332-11ea-a176-14b31f159f22.png",
  "tags": [
   "walking",
   "nature",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=11802857267742645497",
  "source": "GoogleMaps",
  "reviews": [
   "Great walking and jogging paths with lots of fire pits and picnic spaces. Beautiful wildflower fields and lake views. Great place to see a sunset. Paid parking during work hours. About 1.9 miles round trip unless you take one of spurs.",
   "Well maintained trail system through the woods. Even after a rainfall, the trails were in good condition. Trails are on a hill going to and from the lake shore of Lake Mendota. Stairs and bridges are built to make the climbs safer.",
   "Definitely make it out to the point for nice views back towards the plaza.",
   "It stretches from the Eagle Heights Nature Area to Picnic Point on the University of Wisconsin campus in Madison. A real jewel!",
   "We love this place! It can get pretty packed with outdoor enthusiasts, but that is never a reason to feel deterred from going for a morning/evening walk, jog, run.  Very well marked and clean paths."
  ]
 },
 {
  "name": "Nook",
  "address": "2138 Atwood Ave, Madison, WI 53704, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1ce74cc2-9332-11ea-89a7-14b31f159f22.png",
  "tags": [
   "food",
   "creative",
   "unique",
   "eat",
   "food",
   "delicious",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=12974115787402410911",
  "source": "GoogleMaps",
  "reviews": [
   "Most excellent experience. This was our first time at Nook and the food was absolutely incredible. Each course was impeccably executed, both visually and by taste. Chef Noah was an absolute joy. Highly recommend this gem of a restaurant, Madison is so fortunate to have the Nook!",
   "We like to cook, we like to eat, we like the company of others.  We like camaraderie of others and a bit of adventure and whimsy in our lives.  All of this was met at Nook.  The chef(s) had stories behind the dishes so instead of just eating, you understood the how it was made and the why.  The serving platters were different every course and were unique.  The long table allowed us to make new friends and enjoy new conversations.  The pairings were fun and allowed us to try things we usually would not have.  I think if you're looking for an intimate and creative way to dine and like great food and a bit of adventure - this is a MUST in Madison!",
   "I’ve never been anywhere like this before and I loved it! The atmosphere is cozy and fun, the service is super friendly and attentive, and Chef Noah is amazing. The food was plated beautifully and tasted equally as delicious. Chef Noah took the time to describe every dish in entertaining detail. I can’t wait to go back!",
   "Phenomenal time. Got full with 4 courses to go.",
   "Absolutely phenomenal. Excellent food, friendly and helpful staff, beautiful space. Great music and just an all-around welcoming experience. I can't wait for our next visit."
  ]
 },
 {
  "name": "Graft",
  "address": "18 N Carroll St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1d398bc8-9332-11ea-8132-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4832760849106372658",
  "source": "GoogleMaps",
  "reviews": [
   "I highly recommend dinner at Graft!  Super delicious all around.  The carrot salad was spot on.  You especially have to try the smashed potatoes. They are a real treat!.  The Pork Loin and Short Rib were both very savory and flavorful. You have to get the Pot de creme for dessert. Everything was wonderful from  the first bite of the carrot salad to the last bite of dessert.  All the staff were very friendly and provided excellent service as well.",
   "Stopped into Graft on a Friday evening about 5pm for an early dinner and drink and was not disappointed. Cozy atmosphere at the bar with a nice view of the capital building. Staff was informative and friendly. We shared a couple of small plates and they were all delish. Especially liked the broken Caesar salad dressing on asparagus - yum.",
   "This place made the most delicious bite I've ever put in my mouth, in my 60+ years. Grilled asparagus in a deconstructed Caesar salad. Incredible!! But, really, everything we had was perfect.",
   "My second visit to Graft was another very good experience.  My favorite BLT was no longer on the menu but that was okay since it keeps the menu fresh.  The prawns are awesome with a touch of roasted coconut and sweet potato puree.  New was the asparagus 'caesar salad' style.  A touch too much oil for me but still good, just my personal taste.",
   "The restaurant has an amazing atmosphere, with a very elegant design. The food was outstanding and full of flavor."
  ]
 },
 {
  "name": "Graze",
  "address": "1 S Pinckney St #107, Madison, WI 53703, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1da01508-9332-11ea-a8ce-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9977612385576127183",
  "source": "GoogleMaps",
  "reviews": [
   "Most everything is great about this place. Great food, great service, and great atmosphere. It's very vegetarian and 'alt-diet' friendly and staff are accommodating and responsive. My ONE gripe is that their cocktails are not great. They need a legit bartender/manager running the show back there and they need quality control. Beer and wine are fine but the cocktails need some love, guys. Please improve your pours and let's get back to 5 stars.",
   "Graze, is a super cozy place especially for a late lunch. It can get very busy during the lunch hour. A friend and I met shortly after 12:30pm and it was very packed until around 1:10pm. My friend and I basically ordered the same lunch menu, \"Harvest salad\". To me, the wait time was absolutely prolonged given what we ordered - salad. It was about a 15 minute wait time. My friend enjoyed a glass of wine, while I had a hot tea. So, not much adventure regarding this lunch. But it was my first time and I thoroughly enjoyed my meal. The only thing I might say was that if you love blue cheese, make sure you order extra blue cheese on the side. It seems they really ration the portion in the salad. I may not have tasted the blue cheese if I had not ordered extras. For those who are okay with a slight taste of blue cheese, this is a great salad to have it with. Everything in the salad also seemed very fresh and well put together. I hope you enjoy it at least as much as I did or even more.",
   "This was my first time to Madison & I went with a coworker. I ordered the Banh Mi (without the baguette) & a side of cheese curds (because it's Wisconsin after all). I enjoyed ever bit of this fresh meal. Our server was Martha & she was extremely professional, personable and attentive. I will absolutely go back the next time I'm in town.",
   "Amazing food! Everything was absolutely delicious. Fresh vibrant flavors. Atmosphere was romantic and cozy. Have been telling everyone I know about this place!",
   "Came here for lunch & loved everything about this place. Starting off with the location, which is right in front of the capitol with amazing views. The service was tremendous & my food as well. I had an order of the pork steamed buns & wow was it packed with flavor. Loved how crispy the pork was on the outside & juicy in the inside. Definitely order this as a starter if you come here."
  ]
 },
 {
  "name": "Heritage Tavern",
  "address": "131 E Mifflin St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1df25514-9332-11ea-977e-14b31f159f22.png",
  "tags": [
   "creative",
   "knowledgeable",
   "eat",
   "food",
   "delicious",
   "knowledgeable",
   "food",
   "knowledgeable",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5136204810994751160",
  "source": "GoogleMaps",
  "reviews": [
   "The best taste I have ever had in Madison. Elegant and flavorful. Waiters are super friendly and helpful!",
   "Best restaurant in Madison! The chefs are creative with nightly specials and the menu changes with the seasons because their ingredients come from local farms. The quality of the food is top notch & the staff is very knowledgeable and welcoming. I wish I could eat here every night.",
   "Amazing restaurant! The atmosphere was inviting and quiet and the food was DELICIOUS! Our server was very knowledgeable and helped us with our questions (we were a big group). The cheese board is a must when you come here. And get the full board, you don't want to miss any of the options. The food portions for the big plates were pretty big! No one regretted any of their choices. The dessert were phenomenal but the portions were tiny.\nOverall, a place that I'd recommend and definitely come back to",
   "The best! Eat here. \n\nThe best food, cocktails, everything! The ham sandwich for brunch is amazing. Also, anything with eggs. Their specialty is pork, so I would get anything that contains. Additionally, this restaurant has some truly gifted staff. If you do decide to dine here, I would suggest asking them based on what the restaurant has at that time. They are so knowledgeable and I would trust their recommendations over my choice! \n\nAlso, thank you to their kind staff for giving us champagne when my fiance and I got engaged! It was such a nice touch for our evening!",
   "Food was amazing. Service was great.  The deviled eggs were the best I have ever had and both meals were memorable.  We will definitely be back."
  ]
 },
 {
  "name": "A Pig In A Fur Coat",
  "address": "940 Williamson St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1e3d1a00-9332-11ea-97c1-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "walk",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=16582978104066303374",
  "source": "GoogleMaps",
  "reviews": [
   "Heard a lot of great things about Pig in a Fur Coat before I went, and I was not disappointed! First off, definitely get the duck fat fries. Repeating once more for the folks in the back: DEFINITELY GET THE DUCK FAT FRIES. \n\nOther than that, the place is a shareable plate/tapas restaurant, so order a lot and share everything! I went with my significant other, and we got the octopus and pork belly for small plates and the rabbit for our large plate. Everything was perfectly cooked, perfectly seasoned, and packed with flavor. \n\nOverall we got five dishes to share (3 plates, 1 duck fat fries, 1 dessert) and it was the perfect amount of food for two people. Be cautioned though, plus two drinks easily put us over $100 for the meal, but the food is definitely worth the price.",
   "Very happy to stumble upon this place. I had dinner at the bar. Bartender helped pair a good red wine with me food. I really don't know what to say, just look at those pictures and go try this place for yourself. It was very good. The restaurant is cozy and good for a quiet dinner with good company. Loved it.",
   "We arrived when it opened so it was nice and quiet compared to other reviews. Service was fairly quick. We ordered 2 apps and large plates. I have to say it was a lot of food. The pork chop and wagyu ribeye did not disappoint at all. Couldn't finish them so we packed them to go. Overall, it's worth checking out if you don't mind spending a bit more.",
   "People always say nothing is perfect. If there is one, it must be there. This little restaurant is the best I have ever visited in the USA. Although there are many Michelin-starred restaurant in the US, but this is what I feel should called a real restaurant. The food are just perfect, waitresses and waiters are super friendly, the atmosphere is elegant and warm, people all enjoying their food. Can’t wait to come here again!",
   "Booked a month in advance by telephone. We arrived on time (7pm) and a lady with little interest told us there was a considerable wait. I though I must have misheard her as that could only mean they had overbooked - no restaurant has a considerable wait at 7pm unless they have allowed too many people to dine from 6pm. \n\nSo we sat at the bar and we waited and we waited. I caught the lady’s eye a few times but she did not come over to provide any update. She even walked past me. \n\nI was ready to walk out but my wife said she would ask for an update. She waited patiently in the restaurant and the same lady walked past another few times without acknowledging her. My wife finally said ‘excuse me’ and asked for an update. This was after 15 minutes of waiting. She said she would go and find out - so obviously wasn’t doing anything about it up to then. \n\nShe returned to say there would be another 10-15 wait. We all know that means 25-30 minutes. When I said that was not OK she offered us a drink and appetizer but too little too late. A restaurant experience does not involve being left in a corner for 15 minutes u til you complain and only then do you offer something to appease a disgruntled customer. \n\nI said we would be leaving and she simply walked off.  No apology.  \n\nNo longer will we be eating at Pig in a Fur Coat nor buying our meats from Alimentari.  I though USA service was the best in the world. Not at this establishment."
  ]
 },
 {
  "name": "L'Etoile",
  "address": "1 S Pinckney St #107, Madison, WI 53703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1e82d5d2-9332-11ea-9ed1-14b31f159f22.png",
  "tags": [
   "tasting",
   "food",
   "creative",
   "food",
   "family",
   "food",
   "delicious",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=5835651330379855128",
  "source": "GoogleMaps",
  "reviews": [
   "Second time visiting here and doing the chef tasting menu both times. This time they included a surprise course about half way through which was an amazing pretzel bun with carmelized shallot and onion ash butter. The staff are very attentive and friendly. It is pretty pricey but definitely worth it. Be warned, each dish seems small but adds up to a ton of food. I was stuffed when I left.",
   "I won't beat around the bush. L'Etoile is one of the two best restaurants in Wisconsin, and this is a state that abounds in good food. Come to L'Etoile for a special experience where you be welcomed as an old friend, enjoy exquisitely beautiful ambience, and be treated to creative and original cuisine. Oh yah, and the wine list is enormous and frankly astounding. L'Etoile is Perfection with a Heart and Soul.",
   "We had the Family Meal during the current pandemic. Everything included in the meal was fantastic - there is no skimping on quality or quantity, The value was perfect, I would highly recommend this option for restaurant quality \"take-out\" food.",
   "27 Sep 2019 - Former Chef de Cuisine Itaru Nagano has moved on, but L'Etoile delivered another spectacular dinner tonight, with the octopus a special standout!  Monkfish also was great, and I was very pleased to see a cheese tray that let me select which I wanted after my meal.  Keep up the great work!\n- - - - - - - - -\n17 July 2019 -\n\nL'Etoile NEVER fails to deliver magnificence in dining.\n\nSpurred on by the online menu, which featured veal sweetbreads and other delicacies I found too irresistible to put off enjoying, I determined to have another splendid meal at L'Etoile.  I wasn't disappointed!\n\nDinner began with a special treat from the kitchen when Chef Itaru sent me a gift of a delicious course featuring goat cheese, something which I delight in.  The photo is among those I'm posting to show the delights of tonight's meal.  I had hoped for, and wanted, a bottle of Arneis di Roero, an unusual white Denominazione di Origine Controllata e Garantita (DOCG) wine from the Piemonte in the northwest of Italy.  Alas, L'Etoile could not offer me that, and after some discussion with my waiter, I agreed to try an unfamiliar grape, in a \"Vermentino\" varietal from the region of Liguria, in the northwest of Italy, where the city of Genoa is found.  It proved to be an amazing wine, and I'm thankful to Frank for his recommendation!  I was well-cared for by Frank and his assistant, Thomas, along with other waitstaff who lent a hand to ensure my dinner was up to the standards of the typical marvelous L'Etoile dinner.\n\nMy special meal began with the above-mentioned and unexpected treat from the chef, and thereafter, continued with my plans, with the exception of the dessert, which I had intended should be recommended from the \"normal\" desserts on the menu, but was instead an item from the tasting menu which had QUITE got me attention as an entrée item.\n\nSWEETBREADS\nChicharrón, gorgeous green fava beans, queso fresco\nThese nuggets of delicious veal thymus were so amazing I felt compelled to ask for a special wine to accompany them, and ended up with a glass of Bual Madeira, most of which I enjoyed with the sweetbreads, but a small portion of which I saved for further on in the menu . . . \n\nSCALLOPS\nEggplant purée was amazingly delicious!, duck confit demanded a bit of the Madeira, blueberry - this was marvelous!  It reminded me of the perfection of toasted/toasted marshmallows I used to strive to make for a neighbor lady who I quite liked as a boy, for the spectacular lasagna she made and shared with us as children.\n\nAU BON CANARD FOIE GRAS\nBurnt Strawberry \nWhile there was not a lot of duck liver here, and I knew that in advance, it was chosen to be my dessert instead of the conventional options from the menu.  It was a marvelous choice!  While the custom selected wine for this course was a lesser version of the first grown Sauternes, the remnants of my Madeira, and the Italian white wine also went nicely with it, and I ended my meal in heaven.\n\nTHANK YOU EVERYONE AT L'ETOILE FOR CONTINUING TO LIVE UP TO THE EXPECTATIONS DINERS LIKE ME HAVE COME TO HAVE FOR DROPPING IN UNEXPECTEDLY FOR A SPECIAL MEAL!",
   "A simply stunning New Year's Eve prix fixe dinner featuring the incomparable Tory Miller, Elizabeth Dahl, and sommelier Michael Kwas, and the incredible waitstaff, like our server Caitlyn.  Every bite and every dollar is worth it."
  ]
 },
 {
  "name": "Cento",
  "address": "122 W Mifflin St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1ed218a6-9332-11ea-9403-14b31f159f22.png",
  "tags": [
   "creative",
   "food",
   "walking",
   "eat",
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=14259946453170358769",
  "source": "GoogleMaps",
  "reviews": [
   "We were fortunate to have planned an early dinner the night we ate at Cento. Walking in with no reservation at 5pm on a Saturday, we snagged a bar table in the corner and then watched the whole restaurant fill up within minutes.\n\nAs an appetizer, we ordered wine-poached beets, a bright, fresh and flavorful dish that came out quickly from the kitchen. I was happy we had the starter because there was then quite a wait for our mains. I ordered a margherita pizza and my husband had the tagliatelle pasta. When we finally had our meals, both dishes were tasty, though the pasta was a bit salty and I would have preferred a crispier crust on my pizza.\n\nOverall, we enjoyed our experience. Beyond what we ordered the menu featured lots of creative twists on familiar Italian dishes. The food presentation was lovely and our service was great. If we hadn’t had to wait as long for our main course, we probably would have ordered dessert too, but it had gotten pretty late and we didn’t want to stay. If we’re ever in the area again, I’d definitely go back, just on a less busy evening.",
   "I was very impressed by the food and the price for that tasty food! But don't too many people😅. They have a wonderful building for the restaurant! Sunday brunch is awesome! Good drinks. The service is quick and a friendly staff! Maybe for some older folks, the stairs to restroom may be an issue. A new favorite place to eat!",
   "One of my absolute favorite restaurants in Madison! Their boozy brunch is such a good deal, the happy hour is good, and their pasta is amazing! Such a beautiful space with good service. I love that they allow you to reserve a table online as well. Definitely check it out!",
   "Tucked between the Overture and State, Cento is a classy bit of dining well situated. We ate in the back room, a quieter added space that still held its own ambience. Food, drinks, and service were on point. Couldn’t have asked for a more reasonable bit of upscale Italian this close to the Capitol.",
   "Went here for my 21st birthday and loved it. Waitstaff was so helpful with the menu and dissecting what to eat. Their recommendations were amazing and the experience was awesome!"
  ]
 },
 {
  "name": "Tornado Steak House",
  "address": "116 S Hamilton St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1f152824-9332-11ea-8b0f-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=767869262038286428",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I had our first experience at Tornado this past weekend and we were not disappointed! The food was amazing and the staff was superb, we were both thoroughly impressed. Our water glasses were never empty and our dishes were cleared immediately. It is a little pricey, but if you look at their website prior to going, there will be no surprises with pricing. We had a wonderful time and cannot wait until our next visit!",
   "This is a very great experience overall. The seafood bisque was great and had lumps of crab meat. I ordered the 8 oz filet and it was spectacular. It was cooked perfectly and very tender. The taste was great as well with minimal seasoning. Overall, I enjoyed my experience.",
   "The quintessential steakhouse enveloped in a dreamy, woodsy, supper club atmosphere, bathed in low red light. \n\nSo, that’s why the photo of my amazing flank steak looks meh. \n\nIf you love supper clubs and darkened interiors with fabulous eats and drink choices, make a night of it and hit the Tornado.",
   "Excellent food!! King crab was huge and tasty! Service was top notch",
   "I was in Madison at the home office for American Family Insurance and we \"stumbled upon\" this cool steak house.  Our food was great!!  I would go back for sure.  The shrimp cocktail was excellent too."
  ]
 },
 {
  "name": "RED",
  "address": "316 W Washington Ave #100, Madison, WI 53703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1f5e4eb6-9332-11ea-9bb0-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "knowledgeable",
   "eat",
   "music",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=12498934419736399897",
  "source": "GoogleMaps",
  "reviews": [
   "I have always been a fan and gave the 5-star rating years ago but today deserves a full review and if I could give another five stars, I would. I had lunch today with a CEO from Japan for a business meeting. The staff was extraordinary. The service was impeccable. The food was stunning. I am proud this restaurant is in Madison... it makes Madison a better place.",
   "World class offerings... So delicious! I highly recommend the spicy Godzilla shrimp roll, and the brussel sprouts, which were fantastic! Make reservations,  this place is very popular! The food was so much better than any other sushi restaurant that I have ever tried... It is pricey, but so very worth every penny.",
   "This sushi bar is an absolute must if you're looking for a classy atmosphere and some top quality sushi or sashimi.  Great for small groups or large, the food is great and the prices are pretty on point for the service and the quality of food.  The only thing I would recommend is that if you can, try to get a reservation made.  Even when I go here as a party of two there's usually a wait even for a seat at the bar.",
   "This place is amazing! The food is delicious and the service is superb! The food is a bit pricey for most items. So plan accordingly if you go here. The staff is knowledgeable on all items and can answer any question you might have if you are a first time sushi eater. My aunt and I ordered a mix of items and then shared what we ordered with each other. There is loud house music, so if you dont like club music, you might not like their atmosphere. You are able to take home any sushi you do not eat. They pack it up in a nice container. Overall, great experience, food tastes delicious, and I will definitely be back!",
   "Excellent customer service, high-quality sushi, wonderful atmosphere - what more can you ask for? \n\nDelicious every time and the server made great suggestions. We never had to wait for anything to be refilled. All around great experience!"
  ]
 },
 {
  "name": "Dotty Dumpling's Dowry",
  "address": "317 N Frances St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1faf7170-9332-11ea-b07c-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "food",
   "creative",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1479514273501834402",
  "source": "GoogleMaps",
  "reviews": [
   "I love Dotty’s!  Atmosphere is so cute- waiters wear retro-like clothes, and they play old school music!  Food was amazing!! And really reasonably priced!  Built-your-own burger for $6.99, add fries for like 2 more bucks.  The salad was phenomenal!  Great, not-too-greasy cheese curds!! Wish I had discovered this gem sooner!",
   "Great place to go before games at the Kohl Center. We frequently stop here before hockey games and its always a good time. Good food and a good selection of beer. Its a bit small so it can get crowded quick. If you're stopping in before a badger game, I recommend arriving early.",
   "Uniquely creative burgers in a laid back, ambient setting.  Bring your friends, bring your SO, bring your parents, bring ANYONE from out of town (unless they're vegan), and enjoy the food and drinks here.  The atmosphere is enough to keep you there for longer than necessary, and the rest will keep you coming back.  I ♡ this restaurant!",
   "Fantastic burger in the Madison area. Check out the melting pot burger. Don't skip the garlic sauce. Great curds. Really cool atmosphere inside. Waitress was very friendly. Will definitely return when we are in the area. Highly recommended.",
   "Great tap beer selection paired with lots of great burger options. Add in old movies(or local sports) on TV and you've got a great bar. The dining area is nice too if that's more your scene."
  ]
 },
 {
  "name": "Lombardino's Restaurant",
  "address": "2500 University Ave, Madison, WI 53705, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1ff3f870-9332-11ea-85cf-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "delicious",
   "delicious",
   "family",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7237993425757699522",
  "source": "GoogleMaps",
  "reviews": [
   "Exceeded expectations. Scrumptious, savory, mouthwatering delights! Well trained professional staff. Intimate atmosphere. Looking forward to returning soon.",
   "I am new to Madison and this is already one of my favorite restaurants. The truffle mushroom pizza and Caesar salad is awesome! I’ve been here twice now with the hope of trying something new because everything on their menu looks enticing... but that Caesar salad and pizza call my name every time :) The bartenders and staff are very friendly and I feel like there is a very family-oriented and welcome home vibe from all patrons.",
   "Really cozy interior with great food. The salad was had unique flavors and was amazing!",
   "WOW, amazing meal tonight!\nStarted with the house salad and Pizza carbonara,  then the short ribs.\nOne of the most delicious meals we've had in a long time.",
   "I go to Lombardinos at least once a year as it's my brother's favorite restaurant (his birthday dinner) in Madison. He loves the spaghetti bolognese, and so do I. Haven't had a bad thing on the menu: duck breast, pork chop, beef, fantastic pasta dishes. Really great food, if it's your first time, I recommend one of the pastas. Honestly, my favorite dish is probably the pork chop though! So delicious with the olive oil and escarole. This place is a Madison classic that my family loves to eat at."
  ]
 },
 {
  "name": "Alchemy",
  "address": "1980 Atwood Ave, Madison, WI 53704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/203c9a64-9332-11ea-bc18-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "creative",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=12344080004854236548",
  "source": "GoogleMaps",
  "reviews": [
   "Outstanding food! The small batch bread was a delicious start to a thoroughly satisfying meal.\n\nThe stuffed grilled cheese was fantastic and the burger was one of the best I've had in a while. Service was on the ball, friendly, and attentive.\n\nDefinitely a strong recommendation should you find yourself in the neighborhood.",
   "My go to when I want to go out, but can't make up my mind. Drinks are fantastic. Food is good (fries are amazing). Sometimes really busy, but most of the time we get seated no problem.",
   "Very good food and service. Nice beer selection. Wonderful atmosphere for eating dinner or hanging out in the bar. Came here on a suggestion of places to stop at while driving through the area. Love the food and friendly staff. Must go and try for yourself.",
   "If you want some of the best food in Madison, do not hesitate on Alchemy. Small cozy space with a very beautiful bar and seating is creative. The drinks menu is fantastic and great rotating craft beer taps and an even better rotating food menu that NEVER disappoints. Just go here and enjoy the experience!",
   "This place could not be any better. I'd like to come in and sit at their bar but I can't resist their food. Their menu is quaint yet diverse. The music is joyous. The people are kind and efficient. Do yourself a favor and GO HERE. Then, best of luck when this is the only restaurant you want to go to."
  ]
 },
 {
  "name": "Tempest Oyster Bar",
  "address": "120 E Wilson St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/208fc3d2-9332-11ea-9e52-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food",
   "eat",
   "drink",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=13921152074835373805",
  "source": "GoogleMaps",
  "reviews": [
   "Romantic vibe. Nicely decorated. You can check in your coats. We were seated fairly fast for a group of 15. If you're not a seafood person I don't recommend you to eat here. Drinks were good. I recommend the house cocktails, yum! Good selection of drinks.  Steak  was ok, not much seasoning but the potato scallops were delicious. Pork chops were good too. A friend order the lamb chop and said it was undercooked. Also, their oysters had a funky smell. It didn't taste like it was fresh. Kinda sad when it's what they were known for-good oysters?? Overall,  I had a good time.",
   "Holy cow does this place have ambiance. The nautical theme is intense and adorable. But don't let some of the kitschy pieces fool you - there's no joking around when it comes to the food. Incredible steak and seafood cooked perfectly. My only complaint is that the carrot cake was a bit dry and could have used a little more sugar and spice. Everything else was beyond perfect.",
   "We celebrated my husband’s 60th birthday at Tempest Oyster Bar and everything was beyond perfect. The food, from appetizers through dinner, was amazing and the customer service was that and more. A big thank you to the entire staff, especially Eric, for doing so much to make the experience for our group of twelve so great. Who says you have to go to the coasts or down south for great seafood? We’ve eaten in many coastal restaurants and Tempest ranks with the best of them. We will be back!!!",
   "Excellent service! Had the red snapper and the server gave me pointers on how to eat it. Much appreciated! Tasty drinks, wish they were a bit stronger. Overall a great date night.",
   "We had a table for 5 walking in at 1015pm. We were seated quickly. Server took about 5 minutes to come to the table and get drink orders. After we got drinks the server took our food orders. 20 minutes later the server came back and said almost half of what we ordered was not available while simultaneously serving one dish of what we had ordered. We modified our order to fit the available dishes and waited. The rest of our came at 1130pm. We watched smaller tables place their orders and get served before any of got any decent part of our order. We were trying to take advantage of the late night menu deals and ended up being charged full price anyway. They did fix the total when that was pointed out. The food was decent. The food is the only reason I’m putting 4 stars, the service was atrocious:"
  ]
 },
 {
  "name": "Bonfyre American Grille",
  "address": "2601 W Beltline Hwy, Madison, WI 53713, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/20eb2a70-9332-11ea-ba27-14b31f159f22.png",
  "tags": [
   "free",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17322480855674282317",
  "source": "GoogleMaps",
  "reviews": [
   "Good not great. To get their best steaks, it's either $51 or $60 bucks. At that price you can get better steaks elsewhere. Menu is quirky, but if you like obnoxiously Bloody Mary's, worth checking out for brunch once. To make this place a value, sign up for their birthday club, you'll get $20 toward an entree. Their Irish Margaritas are good and the wood grill makes it cozy.",
   "A high end place to grab bite to eat for lunch or dinner, located just off the beltline.\n\nA wide selection of dishes to choose from.  Bonfyre offers salads, sandwiches, stakes, and bowls.  There are vegetarian options along with gluten free as well.  The veggie black bean burger is good. For a side the roasted red potatoes I would recommend.\n\nNice open bar to sit at while you wait for your table.  Good beer and cocktail selection.  Service is very good, friendly, and attentive.  Extra parking in the ramp is available in the back if you can't find a spot out front.  It can get a bit loud when it is busy so it can be hard to hold a conversation.\n\nThe cheesecake mousse dessert is amazing. Try it you won't be disappointed.",
   "Our first visit, and it was for Fathers Day. From the Service, decor, the entrees, and dessert. It was amazing. The best-grilled shrimp I think I've ever had.",
   "Great meal. Excellent food. Atmosphere was a perfect break for us, having a \"Parents Night Out\" dinner. Casual yet polished. Recommended :-)",
   "Rave review! I ate here yesterday and the food was EXCELLENT. It's funny, this place has always been good but the last few months, I feel like they stepped their game up somehow. The food is better than ever. If you're in the Madison area, Bonfyre is a must. 10/10."
  ]
 },
 {
  "name": "Osteria Papavero",
  "address": "128 E Wilson St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/214139e8-9332-11ea-b952-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1442335628884503964",
  "source": "GoogleMaps",
  "reviews": [
   "It’s a cute place and their service is wonderful and friendly. Something I didn’t appreciate was when my siblings ordered their clam with rocket fish, they didn’t tell them they had ran out of rocket fish and gave us cod instead. We had found out after our dinner. Otherwise it’s a great restaurant.",
   "Very good Italian food, and great service too. The gazpacho was excellent, and the lasagna all Bolognese was perfect. Dessert and wine were great as well.\n\nDefinitely a great place to go for lunch in Madison!",
   "I love going to papavero for lunch. The atmosphere is more relaxed and parking is convenient.",
   "I went here during the restaurant week. The price was $25 and it included an appetizer (fried seafood), a main course (halibut), and a dessert (cake). The appetizer was great in quality and taste. The halibut was much smaller than I expected and the taste was descent. The dessert was Ok. The biggest concern here was the service. The waiter never smiled to me and was frowning all the time. She never refilled my water and never said thank you. A professional waiter should not do any of these",
   "Osteria is a great place. I hadn't been here in a few years as my travels haven't taken me to Madison as often. But when they did this was one of my go to places and it hasn't changed. I think it even got better. It is one of the great spots in Madison to eat.\nIt is a very small dining room so you should try and make reservations, but walk-ins are welcome and there is always the bar. The food is ever changing with a great assortment of dishes on the daily board. While your there they may even erase one of them and substitute it with another. So you know this is all made to order. I really love the appetizers also and save room for dessert."
  ]
 },
 {
  "name": "Pat O'Malley's Jet Room",
  "address": "3606 Corben Ct, Madison, WI 53704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/21858bda-9332-11ea-9dd5-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2159900042505942257",
  "source": "GoogleMaps",
  "reviews": [
   "We’re new to the Madison area and wanted to go somewhere for good breakfast food on a Sunday afternoon. Found this little place on google maps and we’re SO glad we did! Food was delicious, you can really tell everything is homemade. The old school diner vibe is fun and we had THE BEST SERVICE. You can tell they get a lot of regulars because they greeted some customers by name. Our waitress was so nice and attentive. We will definitely be back!",
   "Excellent food and very friendly staff. It was our first visit but we will definitely be going back. Try the potato pancakes - they are awesome.",
   "Slam dunk! If you are on the fence about coming here, climb down, run inside, scoot up a chair, and dig in! The breakfast was great, the busy atmosphere was excellent, and the service was awesome. I'll be back -- bringing the fam! Cool to see all the planes outside, too.",
   "We were in Madison for a concert and wanted to get some breakfast before heading home. It was awesome! Delicious, quality food at very reasonable prices. Cool views of the runway. Great benedicts. Would like to try more items if we're ever in town again!",
   "Simply the BEST breakfast in the Madison area! Seven kinds of eggs Benedict on the menu .. highly recommend the crab cakes eggs Benedict and the tenderloin medallion eggs Benedict! Don't be fooled by the location .. right at the airport!"
  ]
 },
 {
  "name": "Bassett Street Brunch Club",
  "address": "444 W Johnson St, Madison, WI 53716, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/21c9e7fa-9332-11ea-89a3-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "music",
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=17731823541811296443",
  "source": "GoogleMaps",
  "reviews": [
   "Can I just. Please never take the coconut cream pie french toast off the menu, it is so good. The place is always busy but food is always worth it. This place is a Madison staple and almost every dish off the brunch menu is amazing. They have variety for all kinds of diets whether you want just a wholesome steel cut oatmeal or a hefty chicken and waffle (or donut, won't judge if you get both).",
   "LOUD dance club music... for breakfast? \nWe literally had to yell at each other to hear what we were saying. Even the staff had to shout at each other. I don't want to hear super loud bass driven music about bump and grind with my eggs at 10am. Completely ruined the brunch experience.\nThe food was edible. My French toast was burnt. Not worth the wait or price.",
   "Great breakfast!  Very modern atmosphere. We shared a delightful donut!! My husband loved his chili chorizo breakfast burrito.  My avocado toast was delicious, with the only critique being that I wish the bread was sliced thinner. The greens on the side were light and refreshing.  Monday morning with no wait time!",
   "Overall, we enjoyed our experience. The green goddess grilled cheese and chicken & donut were big hits. The burger didn't deliver on the big flavor the menu described (some sriracha mayo helped fix that), and the salad was just fine. Good sized portions, reasonable prices, and great service.",
   "You cannot pick a bad thing to order here, everything on their menu is delicious. The staff is (usually) friendly and the service is great. My friend lived in the building next to it my freshman year so we were able to put our name down, go back to sleep, and come down an hour later to a table. I only wish they might mix up their menu a little bit or add weekly specials."
  ]
 },
 {
  "name": "La Kitchenette",
  "address": "805 Williamson St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/220d08f8-9332-11ea-ad1e-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1470951067794268908",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely incredible service...absolutely incredible food...absolutely incredible ambience! Wonderful restaurant! 5 stars and 5 cheers all around for La Kitchenette! Stopped in for a quick lunch date and was greeted and sat ourselves in an intimate dining area. Our server Ethan was warm, informative and not over bearing. I had Biquette and tea but it was so good I only snagged a picture of dessert. I will definitely be back to enjoy their two for $45 date night on Tuesdays.",
   "Home style French cooking. The food is outstanding, and the staff is friendly and helpful. It's on the small side, which creates a homey atmosphere, but also means you should make a reservation. Très bien!",
   "Fantastic food and even better service, our server Ethan was incredibly attentive and helpful with making a choice on the large brunch menu. I can highly recommend the French onion soup, the Green French Toast and the garlic potatoes. For dessert we had the Brioche French Toast which was absolutely incredible. Not to forget the homemade Belgian Hot chocolate. We'll definitely be back!",
   "We have been to la kitchenette several times before the pandemic.   Food was always good but I’m especially impressed with the daily curbside pickup specials they now offer.  Everything is delicious, very little plastic is involved and they seem to have new specials frequently.",
   "A little gem in Madison, with a romantic and cozy ambiance. The food is outstanding as well as the service. Whatever you order make sure you get some of their persillade potatoes, they melt in your mouth! If you are there for brunch, don't forget to try the Green French Toast."
  ]
 },
 {
  "name": "North and South Seafood & Smokehouse Madison",
  "address": "6604 Mineral Point Rd, Madison, WI 53705, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/22592d4c-9332-11ea-bd48-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "cheap",
   "food",
   "food",
   "drink",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14085269347568476436",
  "source": "GoogleMaps",
  "reviews": [
   "My family and I had a really great experience at North & South this weekend the food was fabulous the service excellent. Having never eaten there before, we were surprised to see every table filled on a late Saturday afternoon, we were promptly seated, and warmly welcomed by our server Eleyne. She delivered our drinks quickly and the cheese curd appetizer came out (hot!) a short time later (The curds were great, I highly recommend). \nOur main plates came out hot as well and were delicious, very generous portions, we brought home pulled pork and brisket for lunch the next day. \nOur entire dining experience was excellent from start to finish. We felt well attended and our tummies satisfied. \nWe will definitely be back!",
   "I was down in Madison for a business trip and needed a quick bite on a Friday. I came in and they were packed (I try to go for places filled by locals) and there happened to be a spot at the bar.\n\nJesse, their bar tender/server was amazing and took care of me the whole time all the way from food to drinks. The atmosphere was great, employees friendly and the food was amazing and surprisingly cheap for what you get. I would certainly stop by again when I have the chance.",
   "Order the Rib, Pull Pork and Brisket combo for $26. The Rib was dry and hard, not the (meat) fall off the bone type. Pull Pork and Brisket was not good either. For $26 the portion was quite small, this should of been a $15 dish. I’ve been to a lot of BBQ places and I know good ribs, brisket and pull pork. \nService is a 4 star. I tip base on good service. Food wasn’t worth it but the service was good. Nice set up and dining area.",
   "Came here with my family we all enjoyed our meals. We were seated quickly for our big group which was very nice. Ordered a old fashioned sweet which was great! Our waitress was very nice but felt like she rushed us, I wanted to order another drink but by the time I was about to she had already put our bill on the table without asking if we wanted more drinks. Overall still would come here again.",
   "I absolutely love this place.  My dad and I had the nicest waitress who was well informed with the menu and very helpful.  The food was to die for.  I enjoyed everything from the cheese curds appetizer to the brisket to all the tasty sides and even the BBQ sauces and dipping sauces were mouthwatering good.   I will be coming back and hopefully it will be frequently.  The atmosphere is warm, cozy and clean.  I highly recommend this place and think everyone should try it!"
  ]
 },
 {
  "name": "Weary Traveler Freehouse",
  "address": "1201 Williamson St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/22a5c6f0-9332-11ea-a20f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15227207329581465882",
  "source": "GoogleMaps",
  "reviews": [
   "Friendly folks. Delicious food. Willy Street unconventional at it's best. \n\nGo past the bar and sit on the other side if you want a quieter area. The mulligatawny is superb!",
   "Great little haunt. Bob's bad breath burger will one day be my undoing, but I am willing to roll the dice for a burger with a hunk of cream cheese and green goddess dressing. Goulash is amazing. Great brunch. Lots of veggies and vegan options and I'm pretty sure they make their own bread. Great atmosphere as well.",
   "Really cool place! I had a Reuben and a meat and cheese platter. Everything was great quality! Love the decorations on the walls!",
   "The grilled cheese, the bad mouth burger!! The Weary Traveler's food is so good! We love this eclectic place! Additionally, the food is so reasonable for downtown Madison. We especially love it for brunch. \n\nParking can be a little tough. I recommend parking on Willy street a block towards the capitol.",
   "Loved this small local restaurant. Atmosphere is ecceclict and comfortable. Portions are large and we ended up splitting some items to taste them all. Burger, goulash and soup were outstanding. Service was good and we highly recommend this place for one of a kind home made meals."
  ]
 },
 {
  "name": "Marigold Kitchen",
  "address": "118 S Pinckney St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/22f5e334-9332-11ea-918a-14b31f159f22.png",
  "tags": [
   "creative",
   "tour",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=490400573216906693",
  "source": "GoogleMaps",
  "reviews": [
   "This place gets busy and for a good reason. The food here is amazing! The dishes are also very creative and fun! I love how you get to order tour food first then the staff will bring out to once you’ve been seated. They have a variety of dishes, from sweet French toast that tastes like a cinnamon bun to spicy and savory breakfast nachos! Their coffee was also 👌",
   "I love the rotating menu of soups and quiche. The baked goods are also quite good. I had the vegetarian soup bowl with a side of toast and was pleased by the amount of food (and of course by the quality). Seating is an issue if you go at peak times even during the week but it's still worth venturing to. Good vegetarian and a few vegan options.",
   "Great place for breakfast. Delicious greens complete the meal. Just busy enough to be fun and casual enough to feel like home. Favorite!",
   "I was blown away by how immensely flavorful everything had from the hot chain tea latte to the breakfast potatoes I had. This place had the cutest atmosphere and amazing service. So happy I got to try this while in Madison.",
   "Came here on a Saturday morning for breakfast. There was a line to the door but it moved very quickly. Although it is counter service, they did utilize a host to seat us once we placed our order. Food and drinks were great."
  ]
 },
 {
  "name": "Camp Trippalindee",
  "address": "601 Langdon St 7th floor, Madison, WI 53703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/23449f9a-9332-11ea-804d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "drink",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=7541608912993695403",
  "source": "GoogleMaps",
  "reviews": [
   "Food is delicious for a college campus bar. It exceeds my expectations. The view from the rooftop is beautiful. It is a cozy place with lots of boardgames available to play.",
   "The camp theme is amazingly well done. The views from the outdoor lounge were great. It was a good place to spend an afternoon with food, cocktails and games to play at your table. Food is ordered at the bar, no wait staff. Burgers, fried chicken sandwich and impossible burger were all delicious. Due to the location the clientele seemed to lean towards out of town guests.",
   "It's cool I guess. Sometimes you can take your theme to seriously. Uncomfortable chairs and other strange furniture choices. Burger was five guys quality so not bad but nothing to remember. The fries were okay and like everything else just mediocre. The service was poor as well. Great view though. Lots of boardgames which is fun. Just think they could have done more with this space.",
   "We stopped up at the roof because we were staying at the Graduate, just to see what it was all about. While we didn’t get anything to eat or drink, the view from up here is fantastic! \n\nLike The Graduate, this bar holds very true to its “camp” theme. The decor is spot-on and makes you feel like you’re at summer camp in all the best ways. There are board games, a fair amount of patio seating, and excellent thematic touches. Even though we didn’t get anything, the staff was authentic and welcoming. \n\nWe hope to stop back and enjoy some grub!",
   "Fun place. It is camp themed. They call the bar tenders counselors, they serve bug juice, they have tons of games, a nice out door seating area, and you can even get a smores kit which has an flame in a can, marshmallows, chocolate, and Graham. They provide roasting sticks too. If highly recommend."
  ]
 },
 {
  "name": "Paul's Pel'meni",
  "address": "414 W Gilman St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2391d55c-9332-11ea-9733-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17027343013115456987",
  "source": "GoogleMaps",
  "reviews": [
   "I eat here whenever I can make it downtown! Ask for double works if you like the sauce and they'll absolutely cover it for you! Service is usually quick, 5-10 minutes tops, and the dumplings pair very well with the beer selection. My only complaint is that parking can sometimes be a pain, but that's nothing on them. Try it!",
   "Been loving this place since they came to State St years ago. Proof that a simple dish can be absolutely perfect.  My order is full beef with the works and an extra sour cream.  I also stop by Oasis Cafe in Fitchburg to snag them there as well.",
   "Casual dining. Order at the counter and it is delivered to your table. Little potato filled dumplings with options of toppings and sauces. Full service bar.",
   "Paul’s offers delicious food for an excellent price that students can actually afford. For $7 a plate (a large plate), I’d come here every night for dinner. It doesn’t help that Paul’s is in such close proximity to my apartment and all my classes 😉",
   "Fantastic find.  A full order with the works is delicious and filling at a fair price. Great way to try some Russian food"
  ]
 },
 {
  "name": "Mickies Dairy Bar",
  "address": "1511 Monroe St, Madison, WI 53711, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/23dc7d8a-9332-11ea-87fe-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16392169699419206452",
  "source": "GoogleMaps",
  "reviews": [
   "I was super excited to visit Mickie's Dairy Bar for the first time yesterday. It was like taking a step back in time. Such an iconic 1940's diner!  We visited on a slow day so did not have to wait in line to get a coveted table but I almost think that would have added to the experience. The fact people stand outside in line waiting for a seat pretty much says it all. The food is simply prepared, the portions are hearty and exactly what you want from your favorite breakfast joint. Our server was super pleasant and we wanted for nothing. I can't say enough about the pancakes. They're the size of dinner plate, dense, moist and incredibly flavorful. What a great experience. Thank you to the owners for keeping this old place alive and rocking. What a gem!",
   "My all time favorite diner in the Madison area. They have such an authentic old school diner feel to it thats unmatched by other places in the area. Prices are fantastic for all menu items. Cash only yet so keep that in mind before coming in. They do all the breakfast and lunch classics and they do them big! You wont be skimped on here folks. Always big portions. They do sandwiches, burgers, pancakes, french toast, omelets, scrambles, skillets, coffee cake, shakes and malts, french fries...and sweet fries!, steaks, ham steaks and way more I'm forgetting. Never paid more than $15 for a big meal with add-on items and a drink. Fast customer service, kind staff and every walk of life is always present inside from the campus. Never know who you be sitting by if you take a bar seat, seriously, anyone!",
   "Quaint little place. Looks like a hole in the wall dive. Great food great menu and quite possibly the best service I've had in my 3 months in Wisconsin so far. I didn't get the guy's name who greeted me at the front door he was wearing a Green Bay t-shirt and a Green Bay beanie. As soon as I walked in he greeted me immediately I told him I was interested in the corned beef hash and he told me all about the hash it was house made with several different spices that gave it a slight spicy kick but nothing overwhelming. I ordered the hash at the bar and a cup of coffee. I'm used to corned beef hash in Santa Cruz California Santa Clara California and San Diego California. I'm traveling United States in my RV and Jeep and seeking out great corned beef hash. This was a four out of five stars or a 7 out of 10. Just the right amount of spicy kick to make it a little different. I wish I had time to try the rest of the menu.",
   "Just as good as I remember from college! My husband swears that they have the best corned beef and hash that he's ever had. If you want to get in without a wait, especially on the weekend, show up early - they're definitely busy by 8:30 or 9 am.\nYou won't go away hungry!",
   "Still there and still tasty for that Sunday after funday. Good food served quickly by very friendly wait staff. Remember to be kind and tip 😉👌"
  ]
 },
 {
  "name": "Hạ Long Bay Restaurant",
  "address": "1353 Williamson St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/242d5cc8-9332-11ea-9a1f-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1201729566241833689",
  "source": "GoogleMaps",
  "reviews": [
   "Food was very good! Decorations were a bit sparse, and bathroom door didn't lock. I understand they are recovering from when a car hit their building.",
   "We absolutely LOVE Ha Long Bay! They never disappoint, the food is worth the wait on those busy nights. The staff is always cheerful and friendly. Pictured is their PH1, Vietnamese rice noodle soup with rare beef, the chicken dumplings (fried and steamed), yellow curry fried rice and Thai Iced coffee. This restaurant has been a family favorite of ours for years now!",
   "Quick service and great food. The prices are okay for the quantity of food served. The place was very busy for Thursday evening (could've been because of the holidays as well). They have imported beer in the drinks menu, should you prefer that. We ordered a whole red snapper which was fried and then some sort of lemongrass sauce added. The dish was served with broccoli and mushrooms, along with rice. Because it was whole fish (not fillet), the price was $45. The fish lacked spices and sauce and  perhaps that's the way it's supposed to be. However, I feel it be improved. Also ordered pho, which wasn't my favorite perhaps because of the consistency of noodles which I didn't like. There is some parking in the back and Street side parking and getting an open spot on a busy day might be a problem. Overall great experience. Will come back again to try new dishes.",
   "I spent just 3 days in Madison but I visited Ha Long Bay restaurant twice!!! Despite the fact several restaurants were located around me, I still ignored the cold and went for this and it was absolutely worth it. The meals and waiters are super great! I tried new meals every time I went there and I enjoyed every bit of it. The only disadvantage is how crowded and busy the restaurant is but that is what you get when you have very tasty meals. Thanks Ha Long Bay for the very tasty meals. I would most likely visit again!!!!",
   "They always impress me. I highly recommend their curries, noodle dishes, pan fried chicken dumplings, and sesame tofu. If you have a party of five or larger, you should make a reservation. The wait time can be upwards to an hour during their peak hours."
  ]
 },
 {
  "name": "Taqueria Guadalajara",
  "address": "1033 S Park St, Madison, WI 53715, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/247429e2-9332-11ea-afc1-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "food",
   "eat",
   "food",
   "adventurous",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8716120561867797073",
  "source": "GoogleMaps",
  "reviews": [
   "Great authentic Mexican food! Been coming here for years. Never had anything that wasn’t fantastic. One of the cleanest authentic taquerias I’ve been too! The go to place for Mexican food in Madison!",
   "Wonderful local authentic Mexican restaurant! Amazing home cooked food. They are able to make anything on the menu vegetarian for you. It's great little restaurant for the whole family. It was really busy though so a few things got overlooked by our server. But other than that it was excellent. Definitely a new favorite for me. I love that they made a bean chimichanga just for me.",
   "Very authentic. Excellent food. Great service. Awesome prices and good atmosphere. What more could you ask for? If you like hole-in-the-wall kinda places that are totally authentic and you want awesome mexican food, go here.",
   "Mom n pop place for a quick bite. The parking can be a challenge on a busy day. Tacos were okay but I've had better tacos at other places. The service is quick and the servers are friendly. Overall a good place to eat if you are in the mood for Mexican food - although I'm not sure how authentic it is.",
   "One of my favorite restaurants in town. I visit quite often. Amazing food, friendly service, great atmosphere. Love their beef tongue tacos and weekend menudo soup (best in town). For less adventurous eaters, you can also find all the classics."
  ]
 },
 {
  "name": "Fresco",
  "address": "227 State St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/24b92242-9332-11ea-b87c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4775851284303764209",
  "source": "GoogleMaps",
  "reviews": [
   "A little bit expensive, but will worth the money. The salmon was cooked AMAZINGLY!! Most places overcook salmon. They were also amazing at balancing complex flavors.",
   "Wow! What a fantastic dinner we had celebrating my parents wedding anniversary tonight!! The service, food and ambiance exceeded all my expectations. We were immediately greeted with exceptional service and sparkling wine to toast a significant anniversary.  Our waiter, Ian, was awesome!! His recommendations were spot-on and the food was amazing. From the BEST Brussels sprouts I’ve honestly ever had, to mouth-watering pesto gnocchi, seared scallops and a gorgeous dessert tray to top it off, it was all perfect! All of us thoroughly enjoyed this gem of a restaurant located downtown Madison, it was truly exceptional. Thank you Fresco Rooftop for making my parent’s anniversary extra special!!",
   "I admire this place! They serve marvelous dishes, their menu is nice, The chief cook in that place is an expert, I like a lot eating all their food. The dishes are always of high qualtity, the service towards the visitors  is helpful. I often go to  this restaurant and I was never unhappy. I recommend it to all.",
   "Great place!  Atmosphere was incredible,  as well as the view!!! Our waitress Jenn took very good care of us.  Definitely a return visit is in order!",
   "Wanted somewhere special to celebrate Valentines eve with my special lady. It was everything and more!  You could actually have a conversation where the sound wasn't bouncing off the walls and ceiling.  The presentation of the food was exquisite, and the taste mouth watering.  If you expect a Golden Corral you have come to the wrong place.  Gourmet food at its best.  We will be back.....oh and by the way, Ira our server was excellent!"
  ]
 },
 {
  "name": "HungryBadger Cafe",
  "address": "above IT'SUGAR across Five Guys, 540 State St, Madison, WI 53703, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/24fe5692-9332-11ea-bc77-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2285865082144862865",
  "source": "GoogleMaps",
  "reviews": [
   "So fantastic!  I had the dumplings with the Brats in them. Great combination and the spicy mustard was a perfect match. \n\nThe chicken rice bowl was a perfect blend of flavors. Definitely not spicy but just a mouth full of flavors. \n\nHighly recommend.",
   "Excellent meal! Went with several friends to try something new close to campus on a weeknight. Once we placed our order, everything came out quick. Delicious momo of many flavors were shared around the table: beef, chicken, and bratwurst. Can't wait to go back!",
   "Great little place, upstairs from Its Sugar. It is easy to miss the door if you aren't looking closely. \nWe tried the alu momo, classic chicken momo, chicken rice bowl and samosas and shared them as a group so everyone could try all the dishes. They were all wonderful! Staff was great. Small selection of beers and wine.\n Warning: the small bottle of Badger Heat sauce that you can add is super hot!!",
   "Absolutely wonderful atmosphere! Beautiful energy! Amazing staff!! And the food is authentic as authentic gets! Hungry badger is a beautiful spot to take a friend/loved one & eat absolutely wonderful food at a very reasonable price!! You get such great food for such a low cost! Highly recommend this place!! If you haven’t eaten here, you have to!!",
   "An absolute hidden gem!!! Amazing service, great food and drinks. They have awesome drink specials as well! The momos were very well seasoned and perfect for sharing. Highly recommend!"
  ]
 },
 {
  "name": "Harvest",
  "address": "21 N Pinckney St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/25465e06-9332-11ea-9cf4-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16363203684158007791",
  "source": "GoogleMaps",
  "reviews": [
   "4.5 stars if it was possible.  Quality of the food was very good, quantity was okay.  Probably not the spot for big eaters, but definitely a great place to try.  Came during restaurant week, so menu was somewhat limited.",
   "Great restaurant during the stay home order. I tried the asparagus soup, the bone in ribeye, and the dark chocolate cake. Everything was delicious, the soup was very smooth, the ribeye tasted great, its mashed potato was very good as well, and the dark chocolate cake was very delicious. There are 3 things that could have been better. I asked the ribeye to be medium, but it was rare/medium rare, so I put it inside my microwave for 2 mins to cook more. I requested for silverwares and napkins but both were not provided. Lastly, a $10 handling fee regardless of pickup or delivery seemed too high.",
   "Gorgeous interior, varied menu, fantastic friendly staff. Food was great but, as the waiter admitted, the portions run small. On the positive side, a starter, main, and dessert are fulfilling but not overfilling.",
   "We come back again and again. It’s our favorite restaurant in Madison from the very first time there. The staff are very attentive and offer a great experience. The food is delicious and always very fresh. The scallops are to die for. Thoroughly recommend Harvest.",
   "Wonderful restaurant with great staff and fine dining ambience. Scallops are a winner every time. Well priced for the quality of service and food. Great wine list too."
  ]
 },
 {
  "name": "Himal Chuli Restaurant",
  "address": "318 State St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/25938f92-9332-11ea-864b-14b31f159f22.png",
  "tags": [
   "unique",
   "eat",
   "food",
   "eat",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9388304491540498164",
  "source": "GoogleMaps",
  "reviews": [
   "This is my favorite restaurant. I’ve been coming here since I was a kid. Every time I come to Madison I eat here. The food is amazing and unique. I’ve been across the USA and haven’t found another restaurant quite like this. Wish I could eat here every day!",
   "Beautifully prepared and presented foods. Not overly treated, each dish celebrated the items included and let those items be the star versus heavy seasoning or pretentious preparation. The staff treated us wonderfully. Great for vegetarian and vegan dishes.",
   "This place is a great restaurant!  The food is magnificent! I've been going for over 20 years. I live in Milwaukee but go eat every time I go to Madison. I highly recommend it!👍😊",
   "The food here has really interesting flavors worth exploring. Tiny place, charming & welcoming servers. Our plan is to make this our new place any time we are downtown or going to something at the Overture, to try lots of other items.",
   "Delicious food, amazing service, with a cozy and convenient location.  It's no wonder it's been in Madison so long.  Leave time to sit and chat, this is not fast food.    The golden tea is worth both money and time."
  ]
 },
 {
  "name": "Everly",
  "address": "2701 Monroe St, Madison, WI 53711, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/25d8af2c-9332-11ea-8649-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "unique",
   "delicious",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12233384877171959221",
  "source": "GoogleMaps",
  "reviews": [
   "Enjoyed my breakfast selection tremendously, and the three others in my party enjoyed theirs, as well. Those little side potatoes were divine. Chef had no issues making a substitution to accommodate food allergies, which we appreciated. Nice selection of alcoholic breakfast beverages. Can't wait to try out the lunch menu!",
   "Neat place to try out dinner. Good cocktails too. The steak frites were excellent. The brisket ragout was good. They seem to be trying to cram every food trend into their menu but if that's your thing, you'll love it.",
   "We called and called. A good 30-45 mins before close. Well they must just want to go home early versus make money when people are losing their jobs no worries someone will take our money.",
   "I can't say enough good things about this restaurant! Amazing atmosphere, plenty of staff so the best service I've had in a while. Delicious coffee, unique menu, handmade ingredients, but at a really good price! And talk about a beautiful interior! Good thing we made a reservation for Saturday night, it was nice and busy. Can be casual, but the table of suits and dresses next to us didn't stand out by any means. Can't wait to go back!",
   "We had dinner here yesterday and food was great! We can taste the freshness of all ingredients. I’m glad to find restaurant who care about their customers and served quality foods that taste great. We ordered fried brussel sprouts and charred broccolis as appetizers. Let me tell you that I hate brussel sprouts and kales in general, but I love this dish here. Try it and you won’t regret. Charred broccolis was great as well. \nI got pesto pasta as my entree and it was delicious. My husband ordered fried chicken sandwich. My friend ordered roasted chicken. I didn’t try their dishes but they all said it was good.\n\nNote: while this restaurant accepts kids but they are not the type to hand out crayons and drawing paper, bring your own if your kids need that."
  ]
 },
 {
  "name": "Mr. Kimchi Modern Korean",
  "address": "225 King St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/262e4998-9332-11ea-a769-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6712454812949177312",
  "source": "GoogleMaps",
  "reviews": [
   "This is a hidden gem. The Korean menu has some very tasty appetizers and the sizzling purple rice is superb. The staff are friendly and attentive. There was no wait and the food came quickly. Evidently they just added a sushi menu - we will definitely be back!",
   "Great Korean restaurant. This place is more of a modern Korean feel to it. Really enjoyed the atmosphere. I went for lunch and it wasn't too crowded. They had a great lunch menu. I opted for the spicy pork belly lunch box with purple rice. I definitely recommend it. The staff was very friendly and attentive. I will definitely be back.",
   "This place is amazing! Such delicious food! This was my second time, and it was just as good. Not crowded, so the service was fast and the food came out quickly. It was really tasty, and the dishes were slight variants on traditional Korean which made it even more interesting. I will definitely be going back.",
   "Do you ever go to places and wish that the food they served was as good as the photos they put up? If so, this is the place for you. Their Bibimbop is to die for, and with great sides and teas the meal comes together as a wonderful dinner for a reasonable price. Definitely worth a visit.",
   "Yummie! Reasonable lunch price, fast and nice service. Order these two just to try. Ended up eating it all. The server though I was done with my steak lunch box and i told him \"no I'm not done yet.\" Lol got there before the lunch rush and made out alive. Would go again next time. Great food and service."
  ]
 },
 {
  "name": "Pizza Brutta",
  "address": "1805 Monroe St, Madison, WI 53711, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/267876d2-9332-11ea-81b1-14b31f159f22.png",
  "tags": [
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=18435045059021380071",
  "source": "GoogleMaps",
  "reviews": [
   "Best Pizza in Madison! Every visit is so yummy",
   "It takes effort and learning to create great pizza - the whole package from the crust to the bake. Pizza Brutta has achieved great pizza :)",
   "Wonderful place! Authentic Italian style pizza made in large wood fire stove. Great location on Monroe St. Right on the bus line. Definitely can serve any size group, which is important for me to know based upon the work I do. Everything tastes and looks fresh. Pizzas can be watched being made in front of you. Such a comfortable, warm and cozy environment. Friendly and knowledgeable staff with warm smiles. Thank you, Darcy, for this experience! Your place is wonderful! ",
   "Great wood fired pizza here.  Friendly service and a very easy going experience.",
   "Best pizza I've had in forever. Custom made, fast service. There's nothing like a brick oven pizza."
  ]
 },
 {
  "name": "Bar Corallini",
  "address": "2004 Atwood Ave, Madison, WI 53704, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/26c005dc-9332-11ea-bae3-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "knowledgeable",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=459970235172783283",
  "source": "GoogleMaps",
  "reviews": [
   "This is currently my favorite Italian place to go for dinner with good wine and cocktails. Had e group dinners here in a month and a half and love it more each time. Richie the GM and Giovanni the Chef have this place working like a charm for service and for great food. Truly delicious Neapolitan style Italian food. Every dish I've had here has been amazing. Not yet had pizza myself but my dining pales seem to like it very much indeed. Prices are reasonable, service is fast even when busy. Staff is profession and kind. I love talking to Giovanni in Italian when I come in here. I think he likes it too. The artic char and the chicken piccatta are amazing dishes. The grilled octopus app is a must try as well. The Sicilian red wine is great with any dish! A must go place for groups if you want to impress and not break the bank or leave hungry all while having a great experience.",
   "Excellent food, service, and atmosphere. Our server was extremely friendly and knowledgeable about the menu. Three of their pasta dishes have fresh, in-house made pasta. The rest are imported from Italy. We will be going back to try the pizza!",
   "Just had brunch and let me tell you, it was fantastic!! Had the Egg sandwich, which is a meal or two, and the Kale salad is the best I’ve ever had. The Mimosa too is def the best I’ve had. They took time to squeeze fresh OJ and it showed. Service was fantastic. Space is fresh, clean and cozy. I could chill here for hours. Can’t wait to come back and try the wood fire pizza. Well done. A new favorite spot in Madison!!",
   "Simply amazing! We celebrated our daughters 4th birthday at Bar Corallini and it was simply an amazing experience. The chef involved her in making her own pizza, the staff, almost all of them came to wish her a happy birthday, the food was nothing less than delicious. 5 star restaurant and 5 star experience easily! Thank you guys again!!! Quote of the night was “best birthday ever!”",
   "Best Italian in Madison!!! Very good food. Beautiful clean restaurant. Staff are incredibly friendly. Thanks for an amazing experience."
  ]
 },
 {
  "name": "Forequarter",
  "address": "708 1/4 E Johnson St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/270e77ca-9332-11ea-ae91-14b31f159f22.png",
  "tags": [
   "creative",
   "drink",
   "food",
   "food",
   "delicious",
   "art",
   "food",
   "music",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=12712325188561696654",
  "source": "GoogleMaps",
  "reviews": [
   "A cool, more intimate setting. We didn’t have reservations but were lucky enough to land a spot up at the bar. Great cocktail menu with many creative selections. The bartender also made some great suggestions for small plates to share as well as dinner. For our first visit to Madison, this was a great spot to find and add to our list of places to visit again when next in town.",
   "A+ atmosphere the few times I've been now! The food is all really good too (try the cauliflower). I keep missing happy hour (4:30-6pm  on weekdays I think), which is sad b/c they have awesome deals on drinks and some select food items. The outdoor seating is nice. I'm not big on cocktails but you can see the attached drink menu if interested.",
   "Coziest spot in Madison! Great food and decor. Some dishes slightly over salted, but still yummy. Reservation is a must - expect to be seated at the bar, which is equally cozy. Dumplings were amazing!",
   "Our experience at forequarter was amazing! We stopped in for late lunch/early dinner on our first visit to Madison. The sign out front is rather nondescripts and doesn’t actually say that it’s forequarter but we figured it out. The atmosphere in this place is so very nostalgic, like something of another time. It’s small and cozy with chill vibe and jazzy music playing. I got the bobal wine with the help of Grace, our servers suggestion and my bf max got Great Dane brut IPA. Again with Graces kind guidance and recommendations, We went with some small plates first- the shaved parsnip salad and the rainbow carrots with a daikon tzatziki sauce. We were instantly WOWED. First impression was “now THATS how you show RESPECT to vegetables” so often veggies are treated as an afterthought on a plate and here these two small plates are the exact example of how veggies and using their flavor profiles can own an entire dish. Simply delicious. Additionally..each dish came out prepared almost like the perfect combination between food and a work of art. Their chef takes a lot of pride and passion in his work and that translates through to the food. Next stop we took was we got the red pepper dumplings large plate and the cheeseburger that was on the happy hour menu. The dumplings had a tough act to follow with those veggies and it didn’t knock my socks off but it was still really good, the broth was the best part in my option, but the burger was out of this world. Hands down one of the best burgers I’ve ever had. It was juicy, tender, simple ingredients, pickle meat mustard and the bread was phenomenal. I would’ve gotten two or three more if I had the room! And for only 5 dollars on happy hour! We finished our meal with the chocolate ganache which such an interesting take on a ganache! It has the perfect blend between sweet, salty and tangy. Additionally, grace our server was very sweet, personable and patient as we asked her all sorts of questions about the food and beverages etc. She made great recommendations and definitely contributed to our wonderful experience. Next time we’re in Madison we will be coming back! Highly recommend!",
   "Unbelievably delicious. Wish I could afford to eat here all the time, def one of my favorite restaurants in Madison."
  ]
 },
 {
  "name": "Sardine",
  "address": "617 Williamson St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/27650362-9332-11ea-a1eb-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "drink",
   "kids",
   "food",
   "food",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9010803749008159984",
  "source": "GoogleMaps",
  "reviews": [
   "\"It's okay.\" That's what three stars on Google means. Very pricey for what you get. If you are just drinking, it's decent prices. The food is crazy expensive for the quality, and I would rather eat at any local bar even if the prices were similar. The wait staff very clearly does not want to be there. Either that or they hate you on a personal level. Guess they're pretending to be Parisian? I was there twice - a Saturday around noon and a Sunday for oyster happy hour ($1 off). This is the lowest rating I can ethically give of a place that hasn't personally wronged me. IF YOU are dragged here for brunch - get the waffles. Between the price and the quality, it is the only item I have found to be worthwhile. Very tasty.",
   "I like the brunch. There is plenty of off street parking. The dining room is nice but I prefer the bar or a table with a lake view. The plate pictured is the savory oats. 1 drink is salty greyhound made from fresh squeezed grapefruit juice and the other cocktail is the beet juice body mary.",
   "Fantastic brunch. Food was tasty. We had an awesome table by the window. The louder/livelier bistro setting made it more relaxed and i saw a few families with kids as well. I’ve loved this place since 10+ years ago and it is still amazing.",
   "Great service (friendly and fast), great food (quality, portion sizes), and lovely ambiance (clean, homey)! My only \"complaint\" is that we made reservations several weeks ahead of time and asked for a window seat, but upon arrival there were no window seats open. We were still able to be seated right away so not a problem. I would definitely come here again and would definitely recommend it!",
   "Ever reliable, semi-contemporary, lovely atmosphere, and good service.. are the factors that keep pulling me and most people I know back to Sardine!  Very well done and executed from brunches to dinners to private events. Food is reliably good/very good.. and matches the pricing. Great big bar area that still feels cozy and fun; knowledgeable staff. During summer they have outdoor seating; even with the parking lot in front it’s nice to see the lake. The interior has a more formal white table cloth dining area, as well as a more private spot to side where you can host a decent 20-25 people team dinner. They do well with organizing such events and customize the menu. I do recommend it. We live pulling up to the bar for a boozy brunch or a happy hour cocktail - has not disappointed! ... on replay!"
  ]
 },
 {
  "name": "Paisan's Restaurant",
  "address": "131 W Wilson St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/27b00ea2-9332-11ea-a113-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "eat",
   "food",
   "delicious",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17036332558103435056",
  "source": "GoogleMaps",
  "reviews": [
   "Terrible management. 3 of 4 of our take out entrees were wrong. They offered to refund 1 of 4. No thanks. He asked what I wanted. Obviously to have all 3 incorrect orders made properly. He scoffed and said they couldn’t do that. Really!? We didn’t get what we ordered! We won’t be back. The food is decent but this is the final straw. I even came back after there was mold on my bread but now we are totally done after being treated so poorly.",
   "Definitely the worst dining experience my family and I have had. Staff was poorly managed and unprofessional. The food was actually uneatable for all of us. We have never wasted food and not taken leftovers we couldn’t eat home before , but knowing how sick it made us we decided to leave our full plates there. Unclean and outdated place, the only nice thing was the view of the lake. Food was incredibly greasy. Here are some photos of all of our meals.",
   "The place is very nice and well kept. The parking is a bit hard since it' in the basement and the ceiling is a bit low. Better than not having dedicated parking since that can be said to any downtown Madison restaurant. We sat outside in the sun. There are no oversized umbrellas so be ready to embrace the Sun and a decent breeze.\n\nI ordered the Garibaldi with a glass of water. The sandwich seemed a little too simple in presentation versus the description, but it tasted good. Not a flavor punch, but good enough to enjoy.\n\nI'll be interested in the other dishes the next time I come back! Yes. It's worth coming back.",
   "Great atmosphere. Love the outside patio  during warmer days. The menu is great and my favorite their pizza. I would recommend Paisan to anyone. Special times or just a casual dinner.",
   "The pizza and drinks are quite delicious here. They have their own unique oven toasted crust and house sauce. Try the deluxe pizza. \n\nThe bartender was nice and made custom manhattans for us. Our waitress was also satisfactory. \n\nThe food came out a bit slow considering that it wasn’t too busy and the mozzarella sticks were served with marinara in a plastic cup. This restaurant could be amazing if they were to improve a few small details; the main dining room has an epic view of Lake Monona."
  ]
 },
 {
  "name": "Monty's Blue Plate Diner",
  "address": "2089 Atwood Ave, Madison, WI 53704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/27f4b8e6-9332-11ea-a884-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "walk",
   "food",
   "delicious",
   "food",
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18428712374463412590",
  "source": "GoogleMaps",
  "reviews": [
   "Vegans rejoice. Monty's has you covered.\n\nMust eat brunch or breakfast location in Madison. Do not skip this place. Food is amazing breakfast was fantastic.\n\nThe hashes were huge and the portions generous. Most ingredients locally sourced. Seating is plentiful and they accommodated for our large group. There is good seating outside.",
   "Monty's Blue Plate Diner gets what it means to be a \"diner.\" You walk in the door to a shiny tiled floor and a gleaming case of oversize freshly baked pies and immediately see the logo for Just Coffee Coop. You know that no matter what, you are getting an amazing cup of coffee. And, you know, that, in the parlance of restaurants, you save \"some room\" you will be rewarded with dessert. The food is diner fare, eggs, pancakes, etc., but the interpretation is elite. The eggs were served with a chunky buttermilk biscuit and crispy home fried potatoes. Really excellent. Line can be long to get a table because this place is popular, but it was worth the wait. Will return.",
   "Excellent! We went around 11:30 on a Saturday, and the place was packed. The 45 minute wait was well worth it. Food is delicious and fresh, service was prompt and friendly, and the pies are amazing.",
   "Monty's Blue Plate Diner is amazing! I ordered the Meatloaf Hash, and it is so delicious! The servers are all really friendly and the food is served quickly! I really enjoyed how casual of a place it is to eat because you can just relax and enjoy your meal. I also got a cinnamon sugar doughnut, and that far exceeded my expectations!!",
   "Definitely one of my favorite restaurants in Madison. The only downsides are parking and how popular it is. Quite often during all hours it will be busy. Other than those things the food is amazing, fast and had more vegan/vegetarian options than almost any place i can think of. Im not those things but i go there for a damn good meal as often as i can. Go with a little time and it is worth the wait."
  ]
 },
 {
  "name": "Green Owl Cafe",
  "address": "1970 Atwood Ave, Madison, WI 53704, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/283eba5c-9332-11ea-8bc4-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "eat",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12051185682425246510",
  "source": "GoogleMaps",
  "reviews": [
   "If you're in Madison and you have a craving for some delicious vegan or vegetarian fare, this is the spot!\n\nGreat character and tasty food make this place a great choice. I'm a meat eater and even I loved it (the mushroom veggie burger was so good)! The local artwork was a great touch, too!",
   "Top notch vegetarian food at a reasonable restaurant price! I have yet to eat something at the Green Owl that I don't like - I particularly recommend their burgers. Plus you're supporting a local business ran by an amazingly innovative and dedicated new owner!!",
   "Top notch vegan food with the bonus experience of being stared at by wooden owls as you devour your meal. What more could one ask? The owls will even grant you a dessert menu full of amazing options. Eat here immediately.",
   "Amazing food with amazing dedication to service. Was absolutely blown away by the willingness to go the extra mile to make the best vegan selection.",
   "Looks like they recently started having their $11 sandwiches delivered without boxes, but wrapped in an aluminium wrap. That's cringe-worthy.\n\nAlso, the TLT sandwiches they have been delivering nowadays sometimes has way too much lettuce, and little tempeh than they used to put in earlier."
  ]
 },
 {
  "name": "Essen Haus Restaurant and Bar",
  "address": "514 E Wilson St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/288b2ce8-9332-11ea-88c0-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=5036223470101885794",
  "source": "GoogleMaps",
  "reviews": [
   "We met with friends at this restaurant for dinner. we heard about this spot from a lot of people.  Well, we were not disappointed. The staff were extremely nice and we felt good. The meal was yummy. We loved this restaurant very much and we will definitely return to this restaurant. We recommend this place to all.",
   "The building looks pretty rough from outside if it would fall apart any second. However, people seem to enjoy very relaxed atmosphere. If you are looking for a classy place this is not the one. Centrally located and easy to access from John Nolan drive. If you like beer this is your place.",
   "This place is my first choice restaurant.  Of all restaurants I know I favor it most. I never miss an opportunity to go to visit this restaurant. everytime  I feel like having a special dinner, this place comes instantly to my mind. superb and diverse  food and a rich menu.professional staff, and pleasant ambience. Also important, the tariff is good. I praise this place with pleasure.",
   "This restaurant is  SO much fun!!\nOur food was authentic DELICIOUS German food with all the delightful extras. \nIt's hard to save room for dessert, but their Black Forest Chocolate cake is a dream come   \n\n true! The service from our waitress was the very best I've experienced in  years!\nDon't miss this GREAT restaurant!!",
   "I love this place! The food was amazing and they even had live polka music. Our waitress was very nice and did well to accommodate us despite the fact that they were packed the night we went. \n\nThe Essen Haus also has Spaten Optimator on tap, which is my favorite beer."
  ]
 },
 {
  "name": "La Taguara",
  "address": "3502 E Washington Ave, Madison, WI 53704, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/28d57ce4-9332-11ea-93a6-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "walk",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=530482770692794203",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place. Fast, friendly service. Plus, they do a great job with dietary restrictions. The catering options are great! I've done several catered events with La Taguara. Always a pleasure working with this team!",
   "We arrived at this place for lunch. my friend recommended this spot.  Well, it was very nice. the staff were so friendly and we had a great feeling. The food was just great. We loved this place very much and we shall definitely come back again. Highly recommended.",
   "Wow. If you love passion fruit- you will love this place! Just opening the door- toy can tell that the food is going to be good. The passion fruit glazed chicken wings with plantains were outrageously good. I really can't believe I haven't found this place sooner. The cheese  empananda was delicious and the sauce it comes with is so flavorful and delicious. I can't wait to go back and try more of the menu. The passion fruit cheesecake was very good too. There was nothing disappointing about our meal here. The service was good and staff was friendly.",
   "Food was A+ and also quick given how busy it was. The host was so friendly. Good prices too. If I had one tiny suggestion it would be to have menus available to look at when you walk in - it was my first time there and the only available menus were at the cashier and we had to wait to view them until we were first in line",
   "Loved it! Loved the food and loved the people! Everything was great but we especially loved the Arepas! Wow!! Get yours with roast pork, avocado and cheddar cheese. Can’t wait to come back. I’m thinking one arepa and the Cuban sandwich for the road."
  ]
 },
 {
  "name": "R.P. Adler's Bar and Grill",
  "address": "8202 Watts Rd, Madison, WI 53719, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/291df586-9332-11ea-a070-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "drink",
   "delicious",
   "drink",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=9790618160570560858",
  "source": "GoogleMaps",
  "reviews": [
   "BBQ brisket plate, pretzels, and soup.  Service was great, the price was okay, and the food was okay. The pretzel was tasty, the brisket wasn’t my favorite, but I’m sure there are other things to order.  The soup was fairly tasty.",
   "I came to visit this place under the recommendation from the hotel that I am staying at so I decided to walk down the street and try it. I went to the bar where they had plenty of seating in the bar area. I was greeted by the waitress of whom was very friendly. I ordered the spicy wings and they were really good. They were fried really well and had a good crunch to them which i like. The one draw-back was that there was not a lot of sauce that they wings were tossed with. I would recommend asking for extra sauce if you like your saucy wings. I ordered the pepperoni and sausage pizza and that was good. Pizza was thin crust. The sauce had good flavor and toppings were good. I would highly recommend the wings with extra sauce and its a good place to come to hang out and have a drink and relax with friends/coworkers",
   "This is one of my favorite neighborhood haunts. I often come here for a beer or light snacks with friends, and it's exactly what you would expect from a pub-style American restaurant. The bar side staff are very friendly and accommodating - and after going a couple times in a row, the staff remembered my group and could suggest relevant drink options for us. \nFood recommendation: shrimp salad. Delicious!",
   "Delicious. Their special pulled pork sandwich and Friday fish fry are amazing!",
   "Ordered room service twice. That berry salad with no meat or eggs is a TOTAL WINNER!!! I didn’t care much for the apple crisp or the cheese curds, but I can’t rave enough about that salad. Delivery vs in restaurant could be the difference in both dishes. 🤷🏽‍♀️ I’ll definitely be back for that salad on my next visit to Madison. Nice delivery guy too."
  ]
 },
 {
  "name": "Mediterranean Cafe",
  "address": "625 State St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/29693c10-9332-11ea-a219-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "music",
   "delicious",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=1728596221950207888",
  "source": "GoogleMaps",
  "reviews": [
   "Come for the food, stay for the ambiance and friendly staff. Excellent Algerian tea, fresh soft pita, tasty hummus all served in large quantities. Extremely quick service. They only take cash or check.",
   "Just picked up lunch. It put us in our happy place. Great food and a great way to combat cabin fever. Thank you, Faycal!",
   "Food is great!\nI’d give 5 stars if they didn’t have such short hours of operation.\nOnly open a few hours for lunch Tuesday - Saturday.\nHours are so short, may as well call them minutes.\n\nWhen they’re open, they’re often so crowded you can’t find a seat.\nI remember the days when Med Cafe was open for lunch and dinner (until 7PM) six days a week.",
   "Be ready! You will get your food within 5 minutes of ordering. Great lunch spot that is quick yet relaxing and warming. The culture of the food - and the music, decor, service - is alive. I almost always get the vegan lentil soup (it has a lemony hint which I love). Whenever I come to Med Cafe, it is an oasis, a self care treat, and I am 99% of the time pleased. Enjoy! Try the Algerian Tea for a sweet kick. The Greek Salad is very well rounded and lemony. Baklava for the win. Just about anything will serve you right.",
   "Med Cafe is a magic place that will take you to distant lands with its delicious food, music, and service. It will feed not just your tummy but your heart. From lentil soup to Falafels, Hummus, Akin's Plate, Moussaka, Spinach Cheese pie, Ratatouille, everything is exquisite, don't be afraid to try something new. Ah! Don't forget to try the Algerian tea!"
  ]
 },
 {
  "name": "Parthenon Gyros",
  "address": "316 State St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/29b97ef4-9332-11ea-a534-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "delicious",
   "food",
   "kids",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12478676143214038679",
  "source": "GoogleMaps",
  "reviews": [
   "I've never had a gyro before because I'm picky and I don't want to eat lamb, so I had the chicken caesar gyro and it was delicious! The guy who took our order was friendly, energetic and fun and he came over a couple times to see how we were liking our food, maybe because we had 3 first-timers? We appreciated his excellent customer service!",
   "This place has always been a favorite in our household. And, they just gave their dining room a face lift. Looks and tastes fantastic!!",
   "I just took my girlfriend to have her first Gyro here. This food is/was so delicious and perfectly made that it brought a tear to her eye. The food was ready promptly and everything was made with care and attention to detail. The staff was the definition of friendly and professional. They had wonderful, upbeat attitudes and made us feel welcome and appreciated. The atmosphere is charming, festive and comfortable. I highly recommend it to anyone who is a fan of Greek food or looking to try it for the first time. You will be happy that you made the stop!",
   "How does this place have so many high reviews?  Drunk college kids?!\n\nI have never been a fan of their overly greasy gyros and fries. Today we had a work lunch though and our manager was paying, so I decided to try their salad and some kabobs. We were missing my coworkers Baklava and my entire lunch order!  We work at the hospital, so we opted to have it delivered. After two calls and two hours later, I still have no food. They claimed there is nothing they can do cause the order was already delivered!?  What?!  I have NEVER had a restaurant not redeliver or at the least offer free food to get me to give them another chance. Instead, no food, no apology!",
   "30+ years of gyros from parthenon.  Always good gyros and sauce.  Fries still are not really good.  Rooftop is nice.  Pretty clean and fast service"
  ]
 },
 {
  "name": "Laredo's Mexican Restaurant West Madison",
  "address": "694 S Whitney Way, Madison, WI 53711, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2a05e506-9332-11ea-a55e-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "tasting",
   "delicious",
   "free",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6791862709859825454",
  "source": "GoogleMaps",
  "reviews": [
   "I got the half chimichanga (chicken) it was pretty standard Mexican food fair. The chips were nice and crispy and had good flavor. The only problem was one of my friends that I was with tried to modify an order and I don't know if there was a misunderstanding or what but they could not seem to give him his order without covering it this cheese sauce. We sent it back once and didn't a second time because we didn't want to be a bother.  Perhaps we weren't clear but it was a little frustrating.",
   "Found this hidden jewel in Madison. Upon entering instantly fell in love with the lower and floor level seating. Very tasteful and clean. Was greeted right away with smiles and warm welcomes. Now to the food. Everything from the chips to the main course was cooked to perfection and even tastier! Thank you for the welcomes and the amazing meal I so enjoyed!",
   "Chips were flavorful and fresh tasting, no \"old deep-fryer grease\" taste like some places. Salsa heat was about just right. Everyone in our group of nine was happy with their meal and we all ordered different items. Minor confusion on billed items was expected with a group that size.",
   "Wow! This was a wonderful dining experience! The service was quick and the staff were very friendly.  The food and drinks were delicious.  I went with friends and we stayed a few minutes to talk after eating. They started to get really busy so we left to free up the table. We appreciated being able to talk a little bit without feeling rushed-out. We will be back!",
   "The food here is great!!!! Decorations are good and the customer service is great as well but I wish there were more people here so we can have a fiesta"
  ]
 },
 {
  "name": "Rare Steakhouse",
  "address": "14 W Mifflin St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2a4f6278-9332-11ea-9a82-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "eat",
   "food",
   "delicious",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13544985942859234515",
  "source": "GoogleMaps",
  "reviews": [
   "Rare is an \"Okay\" place to eat. The ambience and decor is five stairs and would be the joint I would take clients to for dinner. My significant other went to Rare for a special occasion and were saddened that the hype didn't meet our expectations. I had the dry age bone-in ribeye which was a great piece of quality cut meat. Sadly the cap was seared so much that it burnt the fat to charcoal. Just plain sinful, but the rest of the steak was great. My significant other had the wet aged fillet which came out as Rare instead of Medium Rare and was surprisingly firmer side similar to a choice grade of meat.  Overall the food is enjoyable but not enough to write home about. The staff were very friendly and knowledgeable but my Significant other and I felt like the time between the our dishes (bread, wine, appetizers,entree) were short to the point of being rushed which hindered our enjoyment. About 5 min We went a slow night where there was no wait. My only problem with Rare is the service is too quick where you can't enjoy your experience.",
   "Cannot say enough good things about this place! Would recommend to anyone considering a beautiful dinner downtown. The food was absolutely delicious and presentation was beautiful! The view of the capital out the windows was an incredible backdrop to our lovely dinner. Can here for my birthday dinner and was blown away! It can get a little pricey but it is beyond worth it! Come check this place ou!",
   "The most amazing steak Ive ever had.   Jose gave us great service even though it got really busy while we were there.       The Teacher's pet drink YUM!!",
   "The food is regularly fresh and delightful, cashiers hands out great customer service. I loved how neat it is and mood. Keep up the good work.",
   "Amazing place! Wet aged capital cut is crazy good! Wonderful place to enjoy with friends/family.  Staff was super attentive and engaging... Try it and you'll love it!"
  ]
 },
 {
  "name": "Bonefish Grill",
  "address": "7345 Mineral Point Rd, Madison, WI 53711, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2aa579e2-9332-11ea-8616-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17670430908458425756",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely fantastic. Great food, reasonable prices, easy parking, easy access. The selection of wines was also very good. The best was our server Patricia. She went out her way to make sure we had a great experience. I cannot wait to go back again.",
   "The best happy hour ever. The best adult juice boxes ever!(Raspberry Tom Collins) It is a great place to dine but also meet new people. The Bang Bang Shrimp is delicious and popular. The owner Robert, and his staff make everyone feel welcome. If you like to talk smart and meet new people meet us at the bar. Best time ever.",
   "Very nice people. Don't be afraid to ask about their recommendations. Will be back when I'm back in Madison.",
   "They are not set up for Curb-Side pick-up even though they say they are. I know a lot is going on in the world but I wasn’t happy with our experience. We ordered a Family Bundle. Shrimp was pretty good but veggie and salad were brown and far from fresh. Overall disappointed.",
   "To go to Bonefish you must want to eat sea food! Well made and very fresh! They do have other tasty dishes not made with sea food. Sunday brunch! Coke products, good drinks and a nice wine selection.  Staff is friendly and wants to help to make your visit special. Booth or table seats."
  ]
 },
 {
  "name": "Delaney's Steak Seafood Wine",
  "address": "449 Grand Canyon Dr, Madison, WI 53719, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2aeb0ea8-9332-11ea-b024-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18135847776468621993",
  "source": "GoogleMaps",
  "reviews": [
   "We took our son out for special night with Mom and Dad. Delaney’s did not disappoint! The bar area had a cool jazz band playing, the drinks were great. Our food and service was awesome once we sat down. They treated us great, without being pushy. The food was the star, I got a bone in Ribeye, flavor town! No dinner is complete without dessert, I had the creme brûlée...tasty!",
   "Was really great! I had a T-Bone which I ordered medium. It came out rare which I completely understand with T-Bones. They took it back and fixed it and it was amazing. The only thing that kinda bugged me it the steaks don't tasted seasoned. Other than that everything else is amazing!",
   "I have never been disappointed at Delaney's!  This long-established local supper club-style steakhouse does it right.  From the straightforward yet properly varied menu to the high professionalism of the staff,... on top of the consistently delectable quality of the dishes themselves,... Delaney's will continue to be my go to recommendation for out-of-town visitors looking for  a combination of tradition, high quality, and easy access in a delightful restaurant atmosphere. It'll also always be my go-to spot for birthdays and special occasions ;).",
   "Best steaks in town! Not only for food but drinks and service. Their martini's they are the best around. Expect to pay about 50 bucks a plate, but for a nice night out it's definitely worth it. Plus, I always have left overs to take home.",
   "I simply loved their food. I always get fantastic service there. The place is always clean and the cashiers are always nice. Keep up the good work."
  ]
 },
 {
  "name": "Gates and Brovi",
  "address": "3502 Monroe St, Madison, WI 53711, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2b324bdc-9332-11ea-a9fd-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3942463332136024014",
  "source": "GoogleMaps",
  "reviews": [
   "Way cool place for group dinner. Been in twice and enjoyed myself each time. Great place for watching a game and for happy hour as well. Wide menu options for all tastes and dietary needs. The fisherman strew and chicken salad are staples for me. Great wine list as well. The carrot cake here is legit I promise. Made in house from scratch, love it! Kind staff, quick service and near vibe. True gastropub feel to the space. I really want to try their brunch menu on a weekend and there Friday fish fry. I hear both are spectacular. Good portions and fair prices.",
   "Want to dine at a small local bar without all the hassle of downtown parking? Then look no further than this spot. A descent sized menu with a variety of food options and a great liquor, beer, and wine selection. Also, the hype is real. Their cheese curds are the top 5 of the town. It's a bit one the pricey side so if you are looking for cheap eats this is not the spot, but you are paying for the exquisite quality and service.",
   "Worth a visit. Likely one of the nicer family-friendly restaurants around that also caters to folks without children looking to have an evening out. Just an enjoyable place to spend an evening. \n\nThe setting is great, with a number of stylistic touches to reinforce its vibe. The cocktail menu was decent and people liked the beer list. The food looked amazing, but it seemed to be lacking something. I’m not sure quite what exactly, but something was missing. You can see from all the photos I shared that the offerings are diverse and the dishes were well-prepared and plated carefully; the salmon and roasted carrots in particular was well-constructed. The fries were cooked enough to have the rich brown coloration and the greens served with the burgers were fresh and well-dressed. Unfortunately, the food looked better than it tasted, but neither the presentation nor the food were bad. Definitely an above average restaurant and great place for an evening with friends or family.",
   "We arrived a little after 8 PM on a Friday night, we were seated right away, even tho it was busy, they found a place for us.  Adrian, our waitress was exceptional.  She suggested a glass of wine for our meal along with describing their mouthwatering specials.  We were not disappointed in the spicy chicken sandwich topped with slaw or the bowl of savory Italian sausage & potato soup.  Their menu is rich with home made delicacies, will have to save room for dessert next time we're there.",
   "My favorite burger in town is the G&B burger! One of my go-to restaurants I've been loving for years! They are great at accommodating larger parties as well if you call ahead."
  ]
 },
 {
  "name": "Muramoto Hilldale",
  "address": "546 N Midvale Blvd, Madison, WI 53705, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2b7974f4-9332-11ea-8c1e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=3608765512049130988",
  "source": "GoogleMaps",
  "reviews": [
   "The atmosphere is slightly fancy, like it would seem upscale. BUT there was a variety of people. We tried the Maki Combo which was chef's choice. We got the Godzilla Roll, spicy tuna and salmon roll. It was delicious and just enough to share and filling. Definitely recommend. The menu prices fit the area.",
   "What can I say, it's excellent sushi. The calamari is also fantastic which we ordered extra crispy and will absolutely do again. We also shared the Godzilla roll, tarantula roll, and Ecuador roll. The amount of caviar on the Godzilla and tarantula rolls do not disappoint. The sauces that the sushi is on top of are also a great blend that goes well with each roll.",
   "Great food,. Service was even better. We were new comments and Amy gave great suggestions on what we should have 😁",
   "Best sushi place in town. There are also great options for who can't eat raw foods. You could try black cod with rice and dragon roll.",
   "One my favorite sushi/sashimi destinations. Great rolls, too. Outside of that, not a huge menu but what they have for soup, salad, apps, entrees is sufficient to cover the basics. Check the menu online to see if it meets your needs. Enjoy your sushi experience!"
  ]
 },
 {
  "name": "Otto's Restaurant & Bar",
  "address": "6405 Mineral Point Rd, Madison, WI 53705, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2bc4d5fe-9332-11ea-8ec2-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "affordable",
   "tasting",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13114850959655444111",
  "source": "GoogleMaps",
  "reviews": [
   "Cute supper club.  Very good dirty martini.  Great for a leisurely dinner.  Does take a little time for your delicious food. My scallops were AMAZING.  We were on our way to another event so we didn't get to try their desserts. Definitely a great place to spend an evening.",
   "We've been going to Otto's for many years.  Good news - food is always excellent.  Bad news - menu never changes and now the service in the bar area has gone from excellent to very poor. We've always enjoyed the atmosphere in the bar area, but the last 3 times we were there, we waited from 20-30 minutes for a bartender to wait on us; even after waving them down a few times.  It's time to find a new place to go...",
   "This spot is first-rate and broad, the meals was enchanting and the prices were very affordable. fast, productive service and very welcoming staff. Highly recommended.",
   "Good atmosphere and food. Their tasting menu was a good deal as you got an appetizer, a main course, and a dessert for $30. This is only valid Monday to Thursday. The taste and the food quality were amazing. However, if you come here to purchase their regular menu, it will be very pricy (~$30-40 for just the main course).",
   "This restaurant gives fantastic service and enjoyable food. One of the best restaurant around here. The food and drinks served fast and the rates were fair. Highly recommended."
  ]
 },
 {
  "name": "Tipsy Cow",
  "address": "102 King St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2c0d2a06-9332-11ea-88ed-14b31f159f22.png",
  "tags": [
   "creative",
   "food",
   "affordable",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10292978332979740009",
  "source": "GoogleMaps",
  "reviews": [
   "Cheese curds here were really good! I think they use something different in their batter as it had a nice onion taste! Also got their buffalo sauced and Asian sauced wings. The buffalo had a nice kick while the Asian sauce was more on the plain side, but overall a great meal! Definitely a good location due to being at the square and I recommend people to definitely give it a try!",
   "Great Customer Service. The bartender and wait staff were super helpful and prompt. Happy hour specials were great and the specialty fries were a meal in itself. Great selection of local brews of all styles with a full bar available for cocktails. A great visit if in the downtown Madison area.",
   "Sat outside; it was busy but service was still great. Ordered the cheese curds and Tipsy burger; both were amazing. I ordered another round of cheese curds because one wasn't enough. And obviously a Spotted Cow to wash it all down. Five stars and I will be going back next summer when I'm in town.",
   "In my experience, one of my favorite options among the vast array of Madison pub food options. They have your classic offerings (burgers chicken strips, etc), some items you might not expect  (fried alligator bites), and tasty fusion options (Korean beef fries, pictured below.) My personal favorite item they serve is the fried walleye sandwich (pictured below)! It was very generously sized and very moist. \n\nTLDR: The Tipsy Cow differentiates itself from other pub/bar offerings in Madison by offering very high quality affordable eats with more creative flare than one might expect from a restaurant in its genre.",
   "Great service with really good food. We would suggest the Tipsy Chicken or Griddled Turkey & Havarti.. delicious! They really like the Nueske bacon here and you'll appreciate it too. Don't forget to eat your pickle. It completes either sandwich."
  ]
 },
 {
  "name": "Parkway | Family Restaurant",
  "address": "1221 Ann St, Madison, WI 53713, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2c65f9c0-9332-11ea-a5dd-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "family",
   "eat",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16080411652581180662",
  "source": "GoogleMaps",
  "reviews": [
   "Parkway is always good! I almost always get one of the specials. Delicious food, sizable portions, and menu options to please everybody. I took away one star because I should never have to ask for a coffee refill in a place like this. But overall a good choice for breakfast, lunch, or dinner.",
   "We ordered for the first time today via Eatstreet, my son was looking for waffles and Parkway Family Restaurant was the closest place. I nervously ordered as I’m picky in the sense that if I don’t like the taste, I won’t eat it. We ordered waffles with scrambled eggs and bacon as well as chicken strips and cheese curds. The waffle was huge and delicious, eggs were cooked (not runny) and not over cooked (dry), the bacon was crispy, big, and not burnt! Chicken strips were crispy and well seasoned, I was impressed! The cheese curds were crispy and not over cooked, a little salty but that happens. Overall an amazing experience I can’t wait to repeat!!",
   "The Texas Toast French toast was not anything special, and the hash browns were extremely greasy and left a weird chemical (maybe oil/grease?) aftertaste in my mouth. This is really unfortunate, with all of the great reviews I was hoping for a good experience. Maybe just these 2 items are not that great, and other items are better...",
   "Amazing restaurant. With covid happening we had to order delivery but the food is phenomenal! They give huge portions, and the service was super fast. Will definitely eat here again!",
   "Been working in the area for the last week. Order takeout twice and each time the food was delicious and I don't need any added seasoning. Will definitely be coming here anytime I'm working in the area and in need of some homemade food"
  ]
 },
 {
  "name": "Miko Poke",
  "address": "2701 Monroe St #250, Madison, WI 53711, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2cbc07fe-9332-11ea-99ea-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "affordable",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=12861160262872169465",
  "source": "GoogleMaps",
  "reviews": [
   "One of the first poke places in Madison, and still one of the best. Very consistent, well-made poke bowls with solidly prepared seafood. Little touches on all the ingredients elevate Miko Poke above other fast casual restaurants; it genuinely feels like care is put into everything they serve. Rotating monthly bowls keep things interesting (I liked the January pork option a lot), and the Monday buy-one-get-one-half-off special is really nice. \n\nOne of my go-to takeout places in Madison.",
   "They are absolutely delicious, great service! Love that they are local and love to support them!",
   "Awesome place to eat something when in a hurry. Their service is efficient, prices are affordable, fantastic vibes. Would recommend to others",
   "This place was delicious! I'm certainly not claiming that it tasted exactly like real Hawaiian poke but if you're looking for something fresh and delicious then this is definitely it. Bonus points for having a separate compost, recycle, and trash bin with help for what to put in each. We will be back!",
   "Awesome ingredients. Friendly service. I wish they had more house recommendations. One of my favorite healthy choices."
  ]
 },
 {
  "name": "Merchant Madison",
  "address": "121 S Pinckney St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2d02ae12-9332-11ea-9db5-14b31f159f22.png",
  "tags": [
   "creative",
   "food",
   "creative",
   "delicious",
   "food",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=11139728440618202797",
  "source": "GoogleMaps",
  "reviews": [
   "Came here for brunch. Sat at the bar and got great advice from the bartender on cocktails and food. We loved the scotch egg appetizer and the country fried steak and the hot chicken sandwich dishes were excellent. This was a great bar with a very cool atmosphere. They have beautiful and creative menus as well. Would definitely recommend this place and would come back if ever in Madison again.",
   "First time in town and we ended up at this fantastic restaurant. The cocktail menu was out of this world and drinks were both creative and super delicious. We also had our first cheese curd experience — cheese curds in a buffalo sauce... yum! Everything about Merchant left a lasting impression. The bartenders were helpful with cocktail and dinner suggestions. A definite must-visit-again when back in town.",
   "Tried this place for restaurant week. Food was really tasty, but it's a VERY loud place. The classic cheese curds had a really good breading, and the lamb sliders were a really nice balance of savory and sweet with the caramelized onions. The strawberry rhubarb trifle had a really nice tart jam.",
   "Merchant is a great place to get dinner downtown. Their menu is small but wonderful — the food is always fresh and well-prepared. We've never been disappointed!\n\nThey do a weekly date night deal on Tuesday that makes it a bit more affordable as a regular thing, which we really appreciate as well.\n\nAll in all an excellent restaurant with beautiful decor and great food!",
   "We always have an amazing experience at Merchant. Our favorite brunch place & date night spot. Be sure to check out their wine selection."
  ]
 },
 {
  "name": "Double 10 Mini Hot Pot",
  "address": "1272 S Park St #2102, Madison, WI 53715, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2d5dc69a-9332-11ea-9d85-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "delicious",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3041090879025833076",
  "source": "GoogleMaps",
  "reviews": [
   "Have eaten here 5 or 6 times and have enjoyed the food each time. Curry base is my favorite but everything seems good. Usually packed and can get uncomfortably warm in the summer due to the moisture build up from the boiling but wouldn’t keep us from eating here!\nService is good and the staff is always helpful to explain things.",
   "Great food and friendly staff, I highly recommend dining here. The hot pot with lamb and the spicy broth is my favorite. You get to choose your own unlimited noodles to cook in the broth and create your own dipping sauce. They keep adding fresh hot broth to your pot as you eat. You will not leave hungry.",
   "This is a wonderful place to enjoy hot pot!  I'm not sure if there are other places around town, but we tried it on a whim a couple of years ago, and where my wife and I go on our date nights when the season gets to be cold out.  The wait staff is friendly, and the food is delicious!  The \"make your own\" sauce bar is fantastic.  I would definitely recommend trying their suggested sauce posted on the the bar.  AYCE starches which include linguine style noodles, rice noodles, sliced sweet potato, eggs, etc.  A gem in Madison!!",
   "This place is worth visiting. They serve large portions for fair rates. Always clean and with fantastic atmosphere. Will come visit again.",
   "LOVE THIS HOT POT EXPERIENCE! I tend to not like family style dinners and really dont enjoy sharing food (I know, bad...) but love hot put which is all about family style but this place gets you your own personal hot pot and wow is it amazing!"
  ]
 },
 {
  "name": "CIRC",
  "address": "1 W Dayton St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2da186a6-9332-11ea-be0a-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=2037316722766735203",
  "source": "GoogleMaps",
  "reviews": [
   "This is my first time trying Circ on a weekday. I was really impressed by the salad bar, which has much more than salad. The beef barely soup was amazing!! It was fresh made and had huge chunks of beef. \n\nCirc, which is part of the Concourse Hotel, is a relatively mid to upscale restaurant. The service is excellent, as is the food generally. \n\nTry the Sunday brunch, you won't be disappointed.",
   "We had the wonderful breakfast buffet this morning and it was so special! So many choices of very well made food and a french toast made out of a homemade donut was to die for.\n\nThe service was also exceptional. Very personable and kind. I would choose this place to start my day, every day.",
   "Above-average hotel dining.  Solid choices of both starters and  entrees. Generous portions, and half-size options for all pastas. Courteous and professional service.",
   "The hostess of this restaurant on February 15th made the four of us feel completely inadequate for being there.  When we walked up to her, she looked us up and down a few times and said in a snippy voice:  “Can I.......help you guys?”   Looking at the 25 empty tables it looked very likely that we would be seated immediately.   I politely asked if there was room for the 4 of us to eat.   The hostess said that the tables were all booked and the earliest we could be seated was at 8:30 (3 hours later).  I mentioned all of the vacant tables and she said that she was expecting everyone to come in at once.  At that point, we knew she felt we did not belong and went to spend our fortunes elsewhere.",
   "My husband and I enjoyed dinner and breakfast here when staying at the hotel. Dinner was excellent. We ordered a cheese board with only one cheese sample, the seasonal cheese. It was delicious. My husband and I both ordered lamb. He ordered his well done while mine was medium rare. They were made just as ordered. Breakfast was good. If I stay at this hotel again I will definitely eat here for dinner."
  ]
 },
 {
  "name": "Bandung Indonesian Restaurant",
  "address": "600 Williamson St, Madison, WI 53703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2de6cd24-9332-11ea-9cb9-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16496891173457802539",
  "source": "GoogleMaps",
  "reviews": [
   "Food was very good. Service was excellent. They took great care of our large party. Awesome way to end a 13 hour road trip.",
   "Good restaurant during the stay home order",
   "My favorite restaurant in Madison. The staff is awesome, every dish is delicious, and the portions are great. My fiancé and I are both vegan and they are so accommodating. There are a ton of dishes we are able to choose from and we love them all! You can also get their tempeh to go (3 for $10) and use it to cook at home. We can’t say enough good things about this place!",
   "I've been here numerous times and never disappointed.... Everything taste different.... Their small lunch options are pretty satisfying and the veggie egg rolls that come with lunch are to die for",
   "I’ve been eating my way around the menu, and I’ve always loved every dish- my partner is a hardcore mango curry fan, and the pad Thai really is the best in town! Also, pop by for one of the Indulge parties on the first Friday of the month- rotating artists, Dj’s, and a cute buffet of food- my husband raves about the spicy meatballs!"
  ]
 },
 {
  "name": "Slow Food UW",
  "address": "1127 University Ave, Madison, WI 53715, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2e290686-9332-11ea-8176-14b31f159f22.png",
  "tags": [
   "food",
   "affordable",
   "food",
   "eat",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=11677593721363292862",
  "source": "GoogleMaps",
  "reviews": [
   "Great food affordable price",
   "Went there to experience Chef Andy's food using fermentation.",
   "This is an awesome way to get exposed and also eat an awesome meal that is fresh and supports local producers/farmers. The people there are also great and sitting next to a stranger and meeting someone is part of the experience too",
   "Delicious dinners for only $5 on Mondays!",
   ""
  ]
 },
 {
  "name": "Dairyland Family Restaurant",
  "address": "716 Cottage Grove Rd, Madison, WI 53716, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2e907b2c-9332-11ea-a8cd-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "affordable",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3728151474114064949",
  "source": "GoogleMaps",
  "reviews": [
   "Dairyland is our family's favorite restaurant in the area - and that recommendation spans 3 generations so far! The servings are generous and the food is great, especially the breakfast food, where you absolutely cannot go wrong! For example, their crepes are way better than the crepes we've had in creperies! The staff are delightful, warm, welcoming people, and eating there feels like a real treat all around, yet is very affordable. We very highly recommend Dairyland Family Restaurant!",
   "I decided to take my friend here after reading good reviews. Wonderful little local restaurant. We came on a Saturday afternoon and it wasn't overly crowded. The menu is huge and offers all 3 meal options. You can tell the food is homemade and they put quality into it. We loved it and will come back in the future. Very good!",
   "Very much enjoyed our \"to go\" lunch yesterday from Dairyland. We go there often and always receive excellent food + excellent service from wonderful employees. They go out of their way to help you enjoy your day. \nSHOP LOCAL 🇺🇸",
   "Stopped in to check this little diner and was surprised at the taste of their food. Fresh and large portions. Would recommend it to anyone. Soup and salad together puts the icing on the cake. Dont forget their pies.",
   "Good amount of food for price. Friendly and warm atmosphere, cheese curds were great"
  ]
 }
]