[
 {
  "name": "The Legacy Museum",
  "address": "115 Coosa St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2eda7ca4-9332-11ea-bea3-14b31f159f22.png",
  "tags": [
   "kids",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4234322467542160415",
  "source": "GoogleMaps",
  "reviews": [
   "A moving and relevant museum showing, sometimes in graphic detail, the horrors of slavery and it's continued impacts on people today. Definitely worth a visit no matter your skin color. Children are welcome and this museum can be a great teaching opportunity, but kids will probably understand it better after 10-11ish. Younger than that will still get the basic concepts.",
   "I encourage everyone to go visit this Museum! It is very informative! Parents please be warned that some images and stories are graphic. Please use caution when bringing small children. It’s is a great place for a date night for couples as well. I plan to visit again soon!",
   "The Legacy Museum was a wonderful last stop on our day-long trip to Montgomery. After visiting the memorial, we visited the museum, located in a warehouse used in the past for holding slaves. Upon entry, we were immediately struck by the informational and expressive exhibits inside. Completely self-paced, you could easily spend hours inside. Highly recommend.",
   "A place that after visiting you probably think it is unforgettable. It is like walking through part of history, so live, sad and true! \nThey utilize excellent design and new technology to effectively connect with audience and tell the story of real people. It's well worth the time.",
   "While a somber experience, the museum is DC-quality.  Very well done. The holograms immediately upon entry are unforgettable as is most of the museum.   I went to the National Memorial for Peace and Justice as well and was equally moved."
  ]
 },
 {
  "name": "Montgomery Zoo & Mann Wildlife Learning Museum",
  "address": "2301 Coliseum Pkwy, Montgomery, AL 36110, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2f2b0e64-9332-11ea-bc29-14b31f159f22.png",
  "tags": [
   "field"
  ],
  "link": "https://maps.google.com/?cid=10271188534453263994",
  "source": "GoogleMaps",
  "reviews": [
   "Easy to get to. Not very crowded on days there are no field trips. Great place for all ages. The walkways could use fixing up. A few areas have broken concrete and are uneven. Definitely check out the Mann wildlife center. There are awesome displays of stuffed animals in there.",
   "Great zoo! Good size for small children,a preschooler can see the whole thing without getting too tired. Zoo admission also includes the Mann Wildlife museum and the stingray petting, both which are worth doing. When entering the zoo, I recommend going to the right first since the playground is to the left. If you go right first you can do the whole zoo and end at the playground. There is also a train and skylift which are both enjoyable. They also have pygmy hippos which are adorable. At Christmas they have a lights display as well, so worth the visit during the holidays.",
   "This was a really nice zoo. We have been to several national zoos, and have yet to see the animal availability that is here. Every animal was it and visible from several viewing angles. All animals seemed healthy and happy. All in all, it's a really nice, local zoo. Definitely recommend.",
   "My son just loves going to the zoo. Even though the animals were lazing around out of sight it was still a good visit.  The Ray's were extra playful some really liked to be touched.",
   "Had a nice visit back again in Montgomery! I have not been to the zoo since it opened. Wow what a change! The zoo looks like they are trying so hard but funding is desperately needed for not only the animals but some paint to freshen up the buildings. It would be nice for a club to donate their time to repair and paint the structures. That said.we had a very nice time 5 adults and one 7 year old child. They were setting up lights for the annual Christmas display. I would say go. It is not expensive..but entertaining in a calm manner. BTW we did not visit the Mann museum but if you are into taxidermy I am sure you will  like it."
  ]
 },
 {
  "name": "Dexter Avenue King Memorial Baptist Church",
  "address": "454 Dexter Ave, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2f792e1c-9332-11ea-a33b-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "family",
   "kids",
   "tour",
   "tour",
   "history",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=13694660786506488315",
  "source": "GoogleMaps",
  "reviews": [
   "What an incredible experience I had at the church, due to a wonderful tour guide named Wanda. She was closely connected to Dr. King and other great leaders from this community, and she channeled their love and open heartedness in a beautiful way.  I have a deep connection to Dr. King, so for me, being there was a kind of holy pilgrimage. I feel uplifted and inspired to do more to make the world a kinder place.",
   "Highly recommend this tour.  Wanda is amazing...the tour was engaging and very informative.  My 9 year old said \"she was great, I don't know why more tour guides don't try to keep kids interest\". A must see for everyone in the family!",
   "An uplifting experience.  The church looks much like it did when Martin Luther King Jr was pastor.  The tour by Wanda was moving and it’s great to see the preserving and continuing of such an important mission 😊",
   "This was an AWESOME experience! The tour guide was AMAZING! The ladies know how to greet and welcome each person with love.  They know and understand how to share the history! This a must go see!",
   "I arrived late in the evening and was only there for one day. I was able to walk around the area and take some photos. It was right down the street from the state capitol and the other government buildings. \nIt is a beautiful church!"
  ]
 },
 {
  "name": "Civil Rights Memorial",
  "address": "400 Washington Ave, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2fcea14c-9332-11ea-b406-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=12826433837879648889",
  "source": "GoogleMaps",
  "reviews": [
   "This is a memorial for all the documented lynchings. And the ones that were not documented. Very beautiful.  And knowledgeable as well because everything is in alphabetical order so you can find whatever county in the south and see how they got down in the past. Sad how they did my people and we still have a ways to go",
   "There are no words to describe this memorial. It’s a museum for everyone to see to understand the journey of African Americans in this country. Just like visiting the Holocaust museum my breath was taken away. This museum is huge, so I didn’t see everything but will definitely be going back.",
   "Absolutely a must see!!!! I am so happy that I went. I encourage all to go.  They also have a nice gift shop with absolutely beautiful people working there.",
   "A window into the tragic past of the US and Birmingham, fantastically set up and awesome staff",
   "The kids have fun reading learning new facts and being able to put their name on the wall."
  ]
 },
 {
  "name": "Montgomery Museum of Fine Arts",
  "address": "1 Museum Dr, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/30372770-9332-11ea-8542-14b31f159f22.png",
  "tags": [
   "kids",
   "art",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12639860204436299758",
  "source": "GoogleMaps",
  "reviews": [
   "Hands-down one of the most beautiful places in Montgomery! They even have an area designated for kids that is so cool, and well thought out. Absolutely LOVE this place! :)",
   "Very nice and green surroundings. A good place to meditate and get some culture.\nVery interesting expositions. \nA section only for children. \nPerfect.",
   "Today was our very first time going to this museum and we aren't sure if we're returning. There was a female security guard who followed us around the entire time and made us feel uncomfortable. She harassed us about our diaper bag and told us we couldn't have it with us. The guard in the front never mentioned we couldn't bring our diaper bag,only that we couldn't bring our stroller wagon. She was talking loudly on her phone and left her post plenty of times. Overall she was unprofessional and made us feel extremely uncomfortable. She didn't follow anyone else in the museum that was there with toddlers so, why were we followed? My wife and I weren't touching anything or acting out of place. She was literally behind us at every turn we made. The male guards were nice and spoke to us. It got to the point we abruptly stopped browsing the art  and just left. She needs to work on her people skills.",
   "It’s a wonderful place to visit. Plenty of parking and the grounds are beautiful.  We will definitely visit again.",
   "Beautiful place to walk your dogs or feed the ducks. Plenty of trails along a beautiful scenic landscape. Great exhibits inside."
  ]
 },
 {
  "name": "Riverfront Park",
  "address": "355 Commerce St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/308547ca-9332-11ea-92a8-14b31f159f22.png",
  "tags": [
   "walking",
   "music",
   "food",
   "walking",
   "walking",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10970243207465321637",
  "source": "GoogleMaps",
  "reviews": [
   "I really enjoyed walking around the area. It is very close to some incredible museums that are must see places! Don't miss the Equal Justice Initiative  or a little further out the Legacy Museum.",
   "Nice little river stroll and evidently a place for music and other community events.  Met many nice people walking along the river checking out the scene.  This is a great thing for Montgomery and it is so close to food and other great spots.  Parking is easy and it is very walkable.",
   "Very nice i really enjoy going down there! So if you enjoy being outside get down to the riverfront! Lots of walking and lots to see! You will enjoy yourself!",
   "We traveled all the way from Texas with the whole family, and we enjoyed this city. I wanted to take the boat but was closed hopefully next time. The museums were great.",
   "One of my favorite places to go in the area. It's beautiful and great for picnics"
  ]
 },
 {
  "name": "Rosa Parks Museum",
  "address": "252 Montgomery St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/30d08198-9332-11ea-bbaf-14b31f159f22.png",
  "tags": [
   "field",
   "family",
   "history",
   "parks",
   "walk",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7647375402306827961",
  "source": "GoogleMaps",
  "reviews": [
   "Great experience! We stumbled upon this museum and were blown away by the service, information, and eloquence. Tiffany was great and very informative. Visiting the museum is a quick experience but 100% worth it.",
   "I accompanied a school's field trip to the Rosa Parks Museum, they had an educationally terrific time. Here in the southern States they designates the month of February for Black history. However, in Ghana (Nigeria) Africa, they're being taught the Black History everyday. When you conversates with our dear family from our Mother Country... Africa, they will tell you, they're pretty interested in how we are doing as a people who have fought many obstacles that have been made to keep Us from moving ahead. No matter the outcome, we as a strong People of culture and longevity to stay focus and continue to advance at making it better for the next generation, and \"Still We Rise.\"",
   "Great experience for me and my 9 year old daughter! Tiffany was very courteous to my daughter and was an excellent staff person!   Definitely recommend this as a quick stop if you're visiting.",
   "It is a walk through history. There are really two sections. I'm not sure of both museums are a part of the Rose Park Museum. One section is a bus ride that takes you through history. Both are worth a visit. There is also a children's museum. We did not go in the children's museum because we didn't have any children with us.",
   "Very very cool place and information was exceptional done to understand the civil rights issues of that time"
  ]
 },
 {
  "name": "Old Alabama Town",
  "address": "301 Columbus St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3118393a-9332-11ea-87f8-14b31f159f22.png",
  "tags": [
   "history",
   "kids",
   "free",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8308431284567587129",
  "source": "GoogleMaps",
  "reviews": [
   "Wow, where will I start. Me and my grandsons visited the Old Alabama Town. It was just awesome. They got the chances in talking to different curators that was there to tell little true facts about each and every building and it's contents. We toured the school house, pharmacy, Eli Whitney's Cotton Gin, shotgun houses,. Check it out for yourselves and try to put yourself back in time. It will help one to appreciate your life now. Very educational.",
   "It was like going back to my youth! Seeing the pharmacy, the general store, etc. so much history, so much to see. Definitely, worth the visit.",
   "Neat to look at. Very friendly folks. We thought $20 a person was a little high but it goes to OP keep and restore the town.",
   "My girls and I love coming here to take us back in time. Every second Saturday it's free with activities for the kids. Across the street is a beautiful playground and giftshop.",
   "Great place to go & learn Alabama History. Very informative and interesting."
  ]
 },
 {
  "name": "First White House of the Confederacy",
  "address": "644 Washington Ave, Montgomery, AL 36130, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/315d5bd2-9332-11ea-afc8-14b31f159f22.png",
  "tags": [
   "family",
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=3025799713672246518",
  "source": "GoogleMaps",
  "reviews": [
   "The house is amazingly preserved,  and the job done to collect the artifacts and possessions of Jefferson Davis and his family is outstanding.   The rooms are beautiful and the experience of seeing the decor and furniture from that time is fun.  The Confederate artifacts are in great condition.  The guide/curator \"Yankee Bob\" is very energetic,  warm, and an awesome historian !",
   "I really appreciated the opportunity to see this house.  True preserved history",
   "Nice for a quick stop. I expected more artifacts mostly period furniture.  It was neat to see.",
   "Well kept peice of Southern History. It is good to stand were great men once ruled.",
   "We went on a Sunday and were closed.  We were disappointed we could not go inside but no ones fault.  It is beautiful on the outside and enjoyed the history behind it."
  ]
 },
 {
  "name": "Dexter Parsonage Museum",
  "address": "309 S Jackson St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/31a8e3d0-9332-11ea-b553-14b31f159f22.png",
  "tags": [
   "history",
   "learn",
   "tour",
   "tour",
   "tour",
   "free",
   "family",
   "tour",
   "historic",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8827180726762315541",
  "source": "GoogleMaps",
  "reviews": [
   "I enjoyed this visit unfortunately both works were on lunch so we weren't able to get inside to see everything.  The one employee was able to assist with giving us additional information and history about the site. We will be heading back soon.",
   "Martin Luther King Jr lived here, it is a great experience to be within the energy of good purpose...It is nice to see the investment in the city of Montgomery, Alabama.  If you want to rid Racism and need to learn the language to stand up to your community, church, or close ones.\nGo to Nikki Myers & Sean Corn \"Race In America Learnig & Listening Tour Retreat 2020\",  \nGoogle the name!\nYou will experience a city tour, good meal, slavery reenactment(NOTHING U EVER EXPERIENCED). Be ready to be challenged, be raw, loved and educated to make change!!!!",
   "Hidden gem! We were the only people there and got so much out of it. We had an awesome tour guide and are sad people are not visiting this place more. It's a historical landmark for the Civil Rights Movement in the U.S. This place marked me personally and I'd strongly recommend it to anyone  driving through or in the area.",
   "Amazing historical tour of Martin Luther King Jr's home. \n\nThere is free parking behind the home and the staff are so friendly. The tour begins with a short video followed by a tour of the parsonage. Our guide was really informative and took time to point out the smallest details and knowledge about the King family. Following the tour, there is an opportunity to visit the King Johns Garden for Reflection which was a fitting end.\n\nThe tour lasts about an hour. We were travelling from the UK so it was difficult to book a time before we arrived but by just turning up we were the only couple there so it was like a private tour.\n\nWould recommend this to anyone in the area and really glad we chose to go go hear whilst visiting Montgomery.",
   "Great hour tour. It was just what we were looking for on MLK day. \n\nThe tour might not start off great. They have you watch a 10-15 min poorly produced video of the home’s history before going over. In my opinion they could completely cut that out. The talking and in-person storytelling was much better. \n\nThe tour guide did an awesome job telling the story of 54-60 as though we were there. He had lots of anecdotal evidence and retrospection, meeting history. I don’t think he could have done a better job delivering historic wonderment to the kids in the group. He tailored the tour to the audience well. \n\nThere may be some points that are more round about, but the tour is a well spent hour of your time while in Montgomery. \n\nMake sure to follow the Dexter Parsonage up with going to the MLK’s Church on 454 Dexter Ave!"
  ]
 },
 {
  "name": "Escapology Montgomery",
  "address": "130 Commerce St #700, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/31f0e9a2-9332-11ea-b408-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "family",
   "free"
  ],
  "link": "https://maps.google.com/?cid=9011320729092990020",
  "source": "GoogleMaps",
  "reviews": [
   "My family and I just visited Escapology and had a fantastic time! All of the staff was extremely friendly and helpful. I've worked in and played in several escape rooms throughout my life and this one is the most interesting, well put together and well managed ones I've been to. We played the code room, and I can't wait to go back and try the others! Highly, highly suggest.",
   "This place is awesome.  I have hosted several birthday parties here and the staff and management are always so helpful and accomodating.  One of the most entertaining activities in the river region for adults, kids, or the whole family.",
   "The games here are amazing! High production value, super streamlined, and with a great hints system. We did four games in one day. Also, as a nice bonus, there's restaurants and bars so you can get a meal between games. Parking is free on weekends so try to go midday on a Saturday, that's what I'd recommend!",
   "One of the best escape rooms I’ve been to! The decorations in the lobby are fantastic, and the escape rooms themselves look very professional. I would definitely go back.",
   "Absolutely the most fun, entertaining attraction for all ages! I highly recommend Escapology. The staff was courteous and attentive. The escape rooms were exciting and challenging  because you have to solve puzzles, find hidden clues and beat the clock to \"escape\" the room in an hour. They need a satellite branch in Wetumpka!!"
  ]
 },
 {
  "name": "Freedom Rides Museum",
  "address": "210 S Court St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/32381628-9332-11ea-b04b-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17749236576466999169",
  "source": "GoogleMaps",
  "reviews": [
   "A magnificent experience! We met a Freedom Rider and heard a great deal of details, helping us better understand.",
   "A small but mighty museum! An incredibly important piece of our history is preserved in this museum. If you have the opportunity to hear Dr. Montgomery speak, do not miss her, you will be enthralled. Ms. Dorothy is informative,  gracious,  and engaging!",
   "Landmark in the black history of USA. Combination of values and courage created this amazing group of people- The Freedom Riders.",
   "The museum is small but loaded with history, and the video interviews with the Freedom Riders alone make this a worthy stop on the Civil Rights Trail. Unfortunately, some major parts of the bus depot are missing because the city didn't recognize the importance of the building.",
   "So much important history in one small building. Don't skip this museum. The people who work there are incredibly kind and helpful."
  ]
 },
 {
  "name": "The MOOseum",
  "address": "201 S Bainbridge St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/32827552-9332-11ea-be13-14b31f159f22.png",
  "tags": [
   "historic",
   "tour",
   "free",
   "learn",
   "kids",
   "learn",
   "history",
   "kids",
   "free",
   "learn",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=119006082413191246",
  "source": "GoogleMaps",
  "reviews": [
   "Free museum dedicated to showcase the Alabama cattle farmer.  Educational, self directed tour.  Very cool historic artifacts - many I took pictures of.  Thank you!",
   "Great place to go and learn about the cattle industry in Alabama. Excellent place for kids to learn about it through interactive means and from Mr. Bainbridge!",
   "Interesting place, even for those with no interest in ranching or cows. Well, let’s amend that : it helps to have some interest at least in cows as historical bovine varieties, or have children who like to play dress up as cattlemen, or to want to learn a bit about Alabama’s cattle and cotton history, or agriculture at large. It’s donation-based, so nothing lost, in any case.",
   "This was the best experience for my children.  They learned so much and when they see things out, they can related it back to the museum. The staff was very friendly and even made suggestions for farms to visit to get hands on experience. The dress up area was so much fun. My daughter said she enjoyed trying on chaps...who knew. They have a kitchen that is so educational and of course the kids can relate when in public. Highly recommend this FREE museum to past the time. Kids can't wait to return.",
   "Great place for young kids to learn about the cattle industry.  Short introductory movie.  Nice kid friendly area.  Whole thing only takes 30-60 minutes."
  ]
 },
 {
  "name": "The Scott and Zelda Fitzgerald Museum",
  "address": "919 Felder Ave # 919, Montgomery, AL 36106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/32cdfd76-9332-11ea-b47d-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "unique",
   "family",
   "learn",
   "family",
   "learn",
   "family",
   "art"
  ],
  "link": "https://maps.google.com/?cid=3829185255658504939",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent museum. Small but packed with interesting objects, some originals, some replicas or prints, and some representative period objects. Staff are friendly and very knowledgeable. Some of the original wallpaper is still visible. Parking is available on site.\n\nIf you get the chance spend the night in the Airbnb! It's located above the museum. After the Fitzgerald's moved the house was divided into 4 apartments. The two upstairs apartments can be rented on Airbnb! It's called the Fitz. We loved our stay in the Scott Suite. It was so well decorated and atmospheric. Unfortunately as far as I could see the apartments are not wheelchair accessible.",
   "My family did the airbnb part of this museum (the Zelda suite).  It was a great experience.  Very roomy rooms and beds for the price. The house is of course very old and as such didn't have the most modern furnishings.  But that's what made the stay very unique for us. Much more memorable than a stay at a local Marriott would have been!",
   "It was really interesting to learn more about this American family of artists and writers.",
   "Fantastic home !! So beautiful and it will take you back to when Zelda was actually there. Can you imagine those days? Awesome",
   "My family stopped by here on our way back to Louisiana after a trip to Savannah. I wish we had had more time to really explore this house. They have so much to see and read an explore. It's a very complete an expansive collection of both of their literary works and art. It does cost to get in which is a little steep. They call it a tax deductible donation and I even had to pay for both of my children who are under the age of 4 and can't read lol. Still it is a very cool place to visit especially if you are into Zelda and Scott. It's really interesting to see Zelda's paintings and see their personal items and learn about different aspects of their lives. Montgomery Alabama is just a cool town to visit they have a lot to offer in a lot to do and see. This place also has an Air BnB. I don't think I could stay in this house long term because the smell of the old books and clothes is really overwhelming. I'm surprised that they don't have these items kept in a humidity controlled environment. The woman that we met who was working there was very sweet to both of our children."
  ]
 },
 {
  "name": "Blount Cultural Park",
  "address": "Festival Dr, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/331f041c-9332-11ea-8a96-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=5872503573067380038",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful park with rolling hills and pretty paved walkways. We stopped here for a place to stretch our legs and let our dogs stretch theirs during the last leg of a road trip. The weather helped, but this park is spacious and lovely. Even with a dozen or so cars parked in the lot, we still.only saw a couple people since the park is so large.",
   "I've been walking here for a while I love going early in the a.m. while it's still kinda cool. Beautiful green grass and trees. Always clean. Fresh air is is a plus. The ponds are soothing.",
   "Absolutely beautiful grounds with rustic romantic feel.",
   "Great outdoor natural activity in Montgomery. Nice paved walk designated areas for running and walking in a great atmosphere.",
   "Great place to walk, exercise, picnic and/or play with the children.  Has a dog Bark Park too!"
  ]
 },
 {
  "name": "The Hank Williams Museum",
  "address": "118 Commerce St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/336338f0-9332-11ea-a9b9-14b31f159f22.png",
  "tags": [
   "family",
   "tour",
   "music"
  ],
  "link": "https://maps.google.com/?cid=1511556621406507360",
  "source": "GoogleMaps",
  "reviews": [
   "A life long fan! Worth the trip to see some of his outfits and the car he was in when he died.",
   "A wonderful tribute to The Legend of Hank Williams. A must see for any Hank Williams fan. Seeing his Cadillac is indescribable and I’m so glad that we came. \nDon’t forget to bring a quarter to play a song on the  jukebox.\nP.S. the lovely girl working there is the grand daughter of the man that owes the museum.",
   "If you're a Hank Williams fan this is the place for you. It is FULL of memorabilia and stories about his life. We really enjoyed learning more about Hank and his family.",
   "Great little museum. Brought back memories of my daddy. Such a short life for a very talented man.",
   "What a fantastic tribute to one of America's best Country Music Legends. I wish I could share photos with you but photography is not allowed. You'll hear Hank singing some of his most loved tunes along with admiring the beautiful costumes he and his wife Audrey wore to perform in. Hank's big blue Cadillac is on full display. You'll read about how he died and much about his life. There's authentic furniture from the home he shared with wife Audrey and children Hank Jr and Lucretia. What an enjoyable experience this was and I highly recommend you tour it."
  ]
 },
 {
  "name": "Mann Wildlife Learning Museum",
  "address": "325 E Vandiver Blvd, Montgomery, AL 36110, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/33b8fa5a-9332-11ea-9075-14b31f159f22.png",
  "tags": [
   "nature",
   "family",
   "kids",
   "kids",
   "family",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14178703140051307354",
  "source": "GoogleMaps",
  "reviews": [
   "This is very up close and personal with nature. However, the animals aren't movable...which is good, for the viewing of it and its habitat and environment. People will appreciate this place,you can take pictures to enhance the magnificence of Creation. Please check it out. 👩‍💻🐺. I personally visited the Mann Wildlife Learning...with my grandchildren. We always made learning about Creation, and how everything around us, had to have a Brilliant Creator, our Awesome God of the heavens. Powerful indeed. However, don't take my word for it check it out for yourselves 😻\nPictures designed by C.Jahnz",
   "The zoo has created an excellent environment for the many different types of birds & animals. It was a pleasure to enjoy with family",
   "The kids enjoyed the stuffed animals could be a little more interactive!!",
   "We love the zoo. It's a great place to have family outings. Fun animals to see, train to ride, petting zoo, etc. They even have a great playground. I do wish you didn't have to pay for adults to take kids to feed the giraffes (I wish you could just pay for the kids) but it's a fun experience.",
   "Great place to visit with any of your family members because it's a place for adults and children. The scenery is gorgeous and there are a numerous amount of animals to view. The Mann Museum is also interesting and has a lot of fine arts and history about different animals...."
  ]
 },
 {
  "name": "W.A. Gayle Planetarium",
  "address": "1010 Forest Ave, Montgomery, AL 36106, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/340b1234-9332-11ea-b79e-14b31f159f22.png",
  "tags": [
   "family",
   "field",
   "kids",
   "tour",
   "free",
   "family"
  ],
  "link": "https://maps.google.com/?cid=8919168382326374006",
  "source": "GoogleMaps",
  "reviews": [
   "Since it was built many years ago, it seems like yesterday, we visited in the 5th grade.. many moons ago. Still has the eye catching moments of the vast universe. The family will enjoy it. Don't take my word for it check it out for yourselves.",
   "This is a great place to take your kids. My daughter attended several field trips here, and they have had events in the evening when there is going to be an event like a meteor shower, comet or eclipse. I have really enjoyed our visits here and it's a great learning experience. They have an auditorium with a curved ceiling where they can project the night sky and constellations. And it's nice and cool inside during the summer!",
   "Cozy neighborhood planetarium with rotating monthly presentations. Very nice and personable staff give a tour of the night sky following the movie. Great for all ages!",
   "Super nice! They host free events there sometimes! Has a good size imax style theater with plenty of seating for events they hold.",
   "Interesting, fun, and educational. I like that they provided a print out of the constellations. A nice short family friendly activity."
  ]
 },
 {
  "name": "Museum of Alabama",
  "address": "142-158 S Union St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3465b70c-9332-11ea-b27f-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "history",
   "free",
   "history",
   "kids",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13500920034167691671",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful museum. Free.  Amazing 200th birthday celebration exhibits with displays of Alabama history that are interactive, educational, and entertaining. We loved the layout of the displays, colorful with just the right amount of text. Grandma's attic is a fun area for the kids, but also great for educational activities. Highly recommend it.",
   "This was Great museum! Start from the beginning with the native American indians and then takes you thru the years ! Lots of history! Awesome displays!! For free!! You cant go wrong!! If you love history! This is the place for you!!",
   "Loved it.  Gotta go back to see more.",
   "Fantastic, free, museum in the Archives, 2d floor, that gives a very detailed and above expectations exhibits about the history of Alabama, back to ice age times through modern day.  The hands on room amazes kids when they see the first Google (phonebooks) and can even get inside old phone booths and use an electric typewriter.",
   "My daughter left her favorite water bottle. Reward if you find and return. Left on 3/7/20. 😁"
  ]
 },
 {
  "name": "Riverwalk",
  "address": "Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/34b006c2-9332-11ea-960d-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12754182859482004613",
  "source": "GoogleMaps",
  "reviews": [
   "This was my second visit to the Harriott II River Cruise Experience!  The first visit was for my brother-in-law’s retirement and this time it was for a wedding anniversary on the Blues Cruise!  WE PARTIED LIKE ROCK STARS!! The music was top notch and the food and drinks were good.  The lemon pepper wings that I ordered were a tad dry.  Overall, it was a great time for $25! I will definitely be back!",
   "Wonderful place for a walk or picnic with grass, wide walkways, restrooms, and picnic tables.",
   "Beautiful location. \nVery nice historical markers. \nWithin viewing distance of the historical Union Station and the Harriott II paddle boat.\n\nFollow my travels on Instagram\n\n📸 🙋‍♂️@gabrielcraft.me",
   "This Time it was so much fun!!! Me, my boyfriend, and my two sisters had a BLAST💋. We ended up docking, and that brought life to the PARTY💜💙❤. I will go again real soon.",
   "Well kept park with beautiful views of the river."
  ]
 },
 {
  "name": "Wright Brother's Park",
  "address": "544 Maxwell Blvd, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/34f5c290-9332-11ea-b16d-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "walk",
   "history",
   "free"
  ],
  "link": "https://maps.google.com/?cid=7163155417429034869",
  "source": "GoogleMaps",
  "reviews": [
   "Calling it a park is generous, but it is quite a nice strip of grass accented by a few trees and benches, overlooking the river. \n\nI spent about an hour here with my dogs one sunny afternoon in December. We picnicked on a blanket and shared some delicious bbq from Dreamland. Then we wandered along the path there. I wasn’t expecting it to be a bird watching outing, but a charming mockingbird watched us for most of our meal. And a cardinal came to join it for a bit. A lovely surprise. \n\nAnd the free parking is always good.",
   "I came to this park to view train activity. While there aren't many trains, it's a wonderful vantage point. When you walk down the steps to the riverwalk there is a passenger bridge that crosses the tracks for a stellar view point.\nI brought my little westy puppy with me and because there were no dogs and it is fenced and walled in, I was able to play fetch with her. Excellent place to experience.",
   "Great insight into history.",
   "Free parking right off downtown Montgomery. The little park is nice too. Down the stairs is the urban garden. This place saved me money on parking more than one day.",
   "This is a good place to take a stroll during the day or night when it's not summertime unless you like swimming in the air lol. Good view of the Alabama river and surrounding areas northward. Also a good place to view the fireworks at Biscuits stadium on fireworks night which is usually on a Friday or Saturday....sometimes both."
  ]
 },
 {
  "name": "Lagoon Park Trail",
  "address": "Gunter Park Dr E, Montgomery, AL 36109, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/35523efe-9332-11ea-bea3-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "walk",
   "walking",
   "walk",
   "active",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=12621994542065104401",
  "source": "GoogleMaps",
  "reviews": [
   "Perfect for families! They have walking, hiking & biking trails that take you around the park. There is nice size covered picnic area that is located next to the playground. A very nice lodge you can rent for events. The bathrooms are located on the outside and normally unlocked for you to use while visiting the park. The park also has a few ponds around the main area you can walk around.",
   "The hiking trails have become my favorite place to be. I take my little dog and explore almost everyday. I clean up any trash I see along the way. Yesterday, we explored the creek and it's bridges. And today just a walk and picking up trash. Now to find the place to volunteer to help keep it beautiful",
   "It is a super nice place to go walking. They continue to build into it as time goes on and they also have biking trails..we have seen a beaver in the water there before and tons of wildlife. Just when its warmer out keep an eye out for snakes, because we have seen a lot..but just let them pass by and then carry on.",
   "Beautiful trail that is kinda hidden away- I see very few people here. Well taken care of by the city. Great place to have lunch, go for a walk, run, or ride a bike. Montgomery the beautiful!!!!!",
   "So Lagoon Park was a super cool place to take my dog there's not a lot of dog parks around when we went it was actually King's birthday he had a wonderful time was super tired afterwards which is great because he's a very active dog and they have roughly around to Trails across country to Trail and then they also had to just the river scene Trail which was pretty cool as well we did both of them we spent time there and it was pretty fine you should really take your dogs there it's a leased facility so they have to be leashed but it's it was super exciting I will go back and back and back and back!!!!"
  ]
 },
 {
  "name": "Governor's Mansion",
  "address": "1142 S Perry St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/359debb4-9332-11ea-9020-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=10572298057174130319",
  "source": "GoogleMaps",
  "reviews": [
   "Everything was decorated very beautifully. Got a chance to meet Gov. Ivey who is a truly wonderful person.",
   "My first visit and The Governor's Mansion is Beautiful. Lots of history to explore and see in Montgomery, AL.",
   "Alabama Business Council reception with Governor Ivey.  Historically beautiful place.",
   "Beautiful Christmas Decoration. Well worth the trip💕💕",
   "Gracious host and beautiful mansion."
  ]
 },
 {
  "name": "Hank Williams Statue",
  "address": "216 Commerce St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/35e86234-9332-11ea-b6c9-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6497643597478177221",
  "source": "GoogleMaps",
  "reviews": [
   "I guess if you're a massive Hank Williams fan this would be really exciting. Other wise it's a statue in a nice part of town.",
   "Maybe, if you love baseball, it means something. It’s not much.",
   "He The Man. Hey Good Lookin, What Cha got Cooking",
   "I loved being able to park my bike nearby and walk around the riverfront.",
   "Very nice statue. Be sure and read the back."
  ]
 },
 {
  "name": "Hank Williams Memorial & Gravesite",
  "address": "Montgomery, AL 36107, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/363ff96c-9332-11ea-818b-14b31f159f22.png",
  "tags": [
   "music",
   "music"
  ],
  "link": "https://maps.google.com/?cid=5355210030498821914",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely beautiful, im 23 and I grew up on Hank and ive always wanted to see this.. he was an amazing man that was taken way before his time. This man made true music. This site is surrounded by marble with 2 large marbles grave stones, one engraved for his wife and the other for him, on his they have some of his music engraved on there as well. Fascinating, a great tribute to a wonderful man. I drove down from Missouri just to pay my respects to such an amazing artist. Youll never be forgotten Hank.",
   "This needs no explanation.. Powerful & surreal to be standing where my heroes have stood while paying respects to someone who made a mark on the world that CAN'T be erased or covered over.",
   "I am sitting on my own in England listening to 1940's music and every other song is Hank Williams. I was privileged to visit his grave with my brother in 2012. A very beautiful and peaceful site. I also noticed some British War Graves to the left of the memorial. The whole experience made a lasting impression on me.",
   "Awesome. Very fitting tribute.",
   "Very elaborate markers. Be sure to look at the details. Other interesting markers here for foreign soldiers."
  ]
 },
 {
  "name": "Town of Spectre",
  "address": "Dirt road near, Cypress Ln, Millbrook, AL 36054, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/369608be-9332-11ea-9ce8-14b31f159f22.png",
  "tags": [
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9414384057880867384",
  "source": "GoogleMaps",
  "reviews": [
   "Nice little place.  My wife loves the baby goats that roam around the island. It cost $3 per person. Sometimes exact change would be suggested, other time someone is there to take your money at the entrance.",
   "I must agree, if you are a Tim Burton fan and love the movie Big Fish this is a must see place. \nIt is adorable even if you have never seen the movie it is a great place to spend the day picnicking and fishing. While we were visiting there were many families with young children everywhere and that made it even more enjoyable. \n\nThe goats!!! After we had been there about 30 minutes I was a bit disappointed in the goats or lack thereof, my son loves goats, then suddenly in the distance we could hear them bleating and there were at the very least 40 goats and kids, it was a full blown goat parade. Watching my son and all of the other children playing with them absolutely made my day.\n\nThe property is beautiful and we'll maintained, there was no goat poop everywhere, only in the small area where their feed and water is located behind the church. \n\nEveryone from the gate attendants to the campers and visitors were very nice. I can't wait to spend more days with my family in the Town of Spectre.\n\nThere is a $3.00 per person entry fee, they accept cash and credit or debit card.",
   "Great place to visit if you're an adventurer, a movie lover, Tim Burton fan,  or looking for something different to do. The goats are cute, the owners are sweet, the scenery is beautiful and magical, and best of all you can camp out there. Highly recommend!",
   "Interesting movie set. Beautiful landscaping and fun for families. They have a few activities and camping areas. The goats are fun to watch and play with. Be sure to bring money as there is an entrance fee that is automated.",
   "If you're a fan of the movie 'Big Fish' should definitely visit Jackson Lake Island. You'll find what you were looking for (the movie set) and more (lots of joyful goats). Entrance is $3 per person and you can also camp there."
  ]
 },
 {
  "name": "Montgomery Tours",
  "address": "568 Hollow Wood Rd, Montgomery, AL 36109, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/36e5518a-9332-11ea-93dd-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "tour",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14665346988140267814",
  "source": "GoogleMaps",
  "reviews": [
   "Jake Williams is a fabulous guide for a tour of Montgomery. He covers the Confederacy, civil rights movement, and the revitalization of downtown Montgomery. He is extremely knowledgeable, measured, entertaining, and a wonderful driver. Could not have been a more pleasant and informative tour. Thank you!!!",
   "The best tour that we have ever taken.   Jake shared the history of the area and his personal experiences that made our visit to Montgomery one of most memorable trips.  Don't miss taking a tour with Jake!",
   "I NEVER expected to fall in love with Montgomery AL, but now I cant wait to get back.  Jake puts the good and the bad in perspective, and makes me so hopeful for America's continued progress.  He knows his history, and he loves his city.  You will, too!",
   "Great job on they tours",
   "Clean bathroom"
  ]
 },
 {
  "name": "Cooters Pond Park",
  "address": "1844 Cooters Pond Rd, Prattville, AL 36067, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/372d6bee-9332-11ea-a342-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walk",
   "free",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6569416218944081265",
  "source": "GoogleMaps",
  "reviews": [
   "What a gem for Prattville! This was recommended to me by a local person as it didn't immediately show up on my searches. This is an absolutely wonderful park, with amazing views, picnic benches, drills, and a stream that was wonderful to walk through barefoot. The park has a lovely dog park as well. This park is maintained and a wonderful visit for anyone in town.",
   "This place is a beautiful death trap. There is no way I would bring kids here. The dog park is nice, but there is no divider for big and small dogs. Everywhere there is a potential 100 ft fall into the lake.",
   "Quiet park, shaded areas, and lots of room to walk and play with your dog. Really pretty trees. It could be better maintained. Trash cans are full and there's a bit of pollution.",
   "Very interesting. Nice dog park and boat launch. All free.",
   "Awesome place to relax, you can put in a boat, visit the dog area, see Montgomery from the park. Have a picnic, kids can play was overall a nice safe place to be."
  ]
 },
 {
  "name": "Vaughn Road Park",
  "address": "2858 Fieldcrest Dr, Montgomery, AL 36106, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/37799074-9332-11ea-8632-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2407891545989787991",
  "source": "GoogleMaps",
  "reviews": [
   "Great place. i wish one day we can get the wooden play area up dated.",
   "This park is awesome. Plenty to do and easily accessible to tiny folks and their parents so we can always see our kids. Also, what helps me is the foamy ground in a lot of it. Helpful on the feet",
   "Lots to do here. Grandchild of 2+ yes. Old really enjoyed it. Some maintenance needed",
   "very clean and fun park. something for all age ranges and such a beautiful park.",
   "It was really fun but there's not much to do for older kids. All we had to do was walk around, take pictures, and play card games"
  ]
 },
 {
  "name": "Alabama Safari Park",
  "address": "1664 Venable Rd, Hope Hull, AL 36043, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/37cae508-9332-11ea-b152-14b31f159f22.png",
  "tags": [
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10654179531034795188",
  "source": "GoogleMaps",
  "reviews": [
   "We absolutely LOVED our day at the Safari Park today. We went when it first opened and now decided it was time again. Wow! They have added so much more! It was great the first time but even more awesome this time. Great job guys! Can't wait to go back!",
   "We went today and completely enjoyed this experience! Considering the amount and variety of animals the pricing was more than reasonable. We were feeding zebras, llamas, antelopes, water buffalo emus and other animals right from our cars! Loved feeding the giraffes, the animal petting area and aviary! Very clean facilities and park!  It's a must do!",
   "We are more than Civil Rights! I just visited one of the best kept secrets in our area! Thousands come to Montgomery to see the civil rights but we have more to offer. My recent family outing to the Safari Park  left me, no us, ranging in ages from 1-80+, truly and thoroughly engaged in God’s beautiful creation. And I didn’t have to leave the continent to see these exotic animals. Great, reasonably priced outing for all. A brochure is provided, with helpful information, but we were too excited to read it with all the action right there in our face. The feeding of the animals was a bit tricky at first, but we were able to get the hang of it. So if you want to see more than statues when you come to town, go to Safari Park, just miles out of Montgomery’s city limits.",
   "Kangaroos in Alabama? Yes, please! We took the teens and grandkids and it was a great experience. The llamas were eager and the camels aggressively snatched a feed bucket. We fed a giraffe, listened to squawking parrots, and fed a flock of budgies. We will definitely be doing this again!",
   "The kids enjoyed it. Spent about 1.5 to 2 hours there. Not terrible for the price and they really enjoyed getting up close and personal with the animals.  The only reason I didnt give it a five was because the feed was really expensive for what you got."
  ]
 },
 {
  "name": "Gateway Park",
  "address": "3800 Davenport Dr, Montgomery, AL 36105, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/38118b12-9332-11ea-9cee-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10743986260733352737",
  "source": "GoogleMaps",
  "reviews": [
   "Love this park its beautiful if u want to get out the house this is the place to go very beautiful and it has ducks",
   "Nice calm and relaxing spot to enjoy the day.",
   "Nice park. Enough space for the kids to play. A walking track and some workout equipment.",
   "We had a great time at the park. The restrooms could be better, but overall well kept. The play area was quite nice.",
   "Huge park with lots of things for kids. \n\nKept up well."
  ]
 },
 {
  "name": "Jackson Lake Island",
  "address": "Millbrook, AL 36054, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3872e542-9332-11ea-8c53-14b31f159f22.png",
  "tags": [
   "affordable",
   "walk",
   "family",
   "family",
   "nature",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=10259271698853313197",
  "source": "GoogleMaps",
  "reviews": [
   "We had a wonderful visit last year - plan to head back up again next weekend. The property owners are wonderful people. It is a nice, close and affordable getaway for us.... and of course we love the goats too!",
   "We came here to see the town of Spectre just as a funny thing to do nothing really serious and when we got out there what we thought was going to be a 10-minute stay turned into a 2-hour stay because it was beautiful they had a nice benches where you could just sit in the swing and enjoy the view and when the wind blew it was comfortable coming off the water there is a ton of goats when we came in we seen the signs to watch out for the goats and we thought it was for the movie set that was abandoned here and when we turn the corner we seem 30 goats it was just a fun cherry on top of the day. It's $3 a person to get in and they had really nice little camping spots where you can pay $10 a person we completely plan on making time to come out and camp",
   "“Time stops when dreams come true before you, Time stops when fantasy is real”\n       \nToday was a fantastic day, Lauren and I rented a car and drove from Louisiana to Alabama. We were headed to Jackson Lake Island or the Town of Spectre! And it was magical!                                                     Bring here was so inspiring, just to stand where Edward stood was inspirational. And I hope I can by half the adventurer he was!",
   "Very peaceful, with plenty to do: from camping to getting married! \n\nJackson Lake Island offers full site hookups for RV camping and plenty of space to pitch a tent. For those relaxing weekends, bring the boat, kayaks, and/or bikes to take leisurely cruises around the island. \n\nMany locals take advantage of the boat ramps, on Jackson Lake Island, as an entry to the Alabama River. A variety of freshwater fish continuously flow through the lake, attracting anglers as they attempt to land that big fish. Bank fishing is also permitted.\n\nThe Island is home to the Town of Spectre movie set from the film \"Big Fish\". It is fun to walk down the street to see the buildings and the shoes that are still being collected and tossed over the line. \n\nWhile visiting the movie set, it is almost guaranteed you will be greeted by a goat or two. If you have little ones, they are sure to love on them as they roam freely around the island. \n\nIn addition to the movie set and the goats, the island is made up of rolling grassy hills with a private events cabin to make the perfect space to host your special event (babyshowers, birthdays, weddings, family reunions, etc.).",
   "\"Big Fish\" is one of my favorite movies ever. When I heard that I could visit this island and see the abandoned movie set I had to make the trip from New Jersey. The entrance was easy to find and the instructions for submitting payment and calling for the gate code was super easy. The island is beautiful and full of nature. The movie set was amazing to see and walking down the street you can't help but feel like Edward Bloom in the movie. While taking some photos the goats came right over to us to see what was going on. They were very friendly and photogenic. Hahah!! It was icing on the cake for this trip. I'm so glad that we made this trip as a family."
  ]
 },
 {
  "name": "Go Karting Montgomery",
  "address": "9033 Wares Ferry Rd, Montgomery, AL 36117, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/38d530a4-9332-11ea-bd3f-14b31f159f22.png",
  "tags": [
   "family",
   "knowledgeable",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2046846857879177683",
  "source": "GoogleMaps",
  "reviews": [
   "Went for my annual check up with Dr.  Nguyen today and as usual was so very pleased.  He takes time with his patients and listens to their questions and concerns.  His scripts are spot on and he offers options regarding contacts that might be more to your liking and needs.  He has a busy schedule but never appears rushed.  All in all a good experience and I recommend him to everyone!",
   "The mini golf was pretty close to the worst mini golf experience I've ever had.  At 6 bucks a pop it was severely disappointing, a dollar a piece seems fair.\n\nThe go carting, however, was fantastic. My family had a blast, a solid 10 minute race. Clearly the reason to go here.",
   "This was by far the best eye exam I’ve had thus far. Mr. Nguyen was AMAZING. His professionalism was top notch and humor was humbling. He made me feel very comfortable as I was going in kinda nervous. I would recommend him 100% of the time. Thank you so much.. I’m so happy to say I can see. (:",
   "Dr. Don Nguyen is a fantastic optometrist. He is very knowledgeable and kind to his patients. I highly recommend this doctor!!! Thank you very much!",
   "Prompt and couteous service. Great place for kids to let loose and have fun. Awesom place for birthday parties!!"
  ]
 },
 {
  "name": "The National Memorial for Peace and Justice",
  "address": "417 Caroline St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/392748a8-9332-11ea-832a-14b31f159f22.png",
  "tags": [
   "walking",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=6004518316863125898",
  "source": "GoogleMaps",
  "reviews": [
   "This memorial + the legacy museum in downtown Montgomery combined to make one of the most powerful and remarkable experiences of my life. Everyone should go, and look, and keep looking, thinking and feeling. We can’t turn away from this past. If we have any hope of moving forward, we have to reckon with it.",
   "A reminder of our country’s past. Less not we forget that it was not too long ago a person could be lynched just purely based on the color of their skin. Highly recommended place to visit for education on the reality of lynching in the US. Take your time and do not rush through it. Very solemn place to honor the innocent lives of Black men and women.",
   "Beautiful memorial and very emotional monument, it was heartbreaking to read real stories about how ppl were lynched back in the day for no reason other than the color of their skin. It's an eye-opener to the past and educating experience. A lot of walking, but the area was very clean and well maintained",
   "This is extremely powerful and I only saw it because the Greyhound bus I was catching to New Orleans was three hours behind. Lucky me. I am curious, do the museum have tour guides. I think that would make it much more informative and powerful. FYI, there's a museum and a bus that takes you to the memorial. I say that because I originally though the memorial was the museum.",
   "There are no words to describe this memorial! Just to view the names of the many lives lost gave me chills! It is $5 to enter. These tickets can be purchased in the gift shop just across the street from the memorial. Additionally there is a shuttle bus that runs every 10 mins back and forth from the museum to the memorial for your convenience. This memorial is a must see for all! I highly recommend!"
  ]
 },
 {
  "name": "Fort Toulouse-Jackson Park",
  "address": "2521 W Fort Toulouse Rd, Wetumpka, AL 36093, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3969f708-9332-11ea-ae4e-14b31f159f22.png",
  "tags": [
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13819779000968392031",
  "source": "GoogleMaps",
  "reviews": [
   "This is a very nice park and camping area (quiet/clean). A lot of history to explore in one spot, but be prepared to deal with mosquitoes. A Walmart is nearby if you need anything. Be sure to check out Grumpy Dog for lunch and take a tour of the Capital in Montgomery.",
   "Good park. Quiet peaceful surrounding. Definate stop if you are traveling thru Wetumpka.",
   "Very interesting. We thoroughly enjoyed it!",
   "Pretty cool, muddy",
   "It's a great place"
  ]
 },
 {
  "name": "Freedom Park",
  "address": "Montgomery, AL 36112, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/39ba754a-9332-11ea-9b46-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6394490063248843751",
  "source": "GoogleMaps",
  "reviews": [
   "Rhian park is safe ns clean my son loves to play there.",
   "It's a small, yet cozy park. There's a play area for the kids. And workout space for the adults. You can either stroll or run around the track.",
   "This location is very near the medical center, and it was a great place to take the kids while waiting for an appt.  There were 5 sections of kid play areas, as well as adult workout stations, a walking track, disc golf, picnic tables, and tons of shade.",
   "really like just wish there would be a sandbox for kids",
   "I really like this park. Plenty of options for playgrounds, room to park, and clean bathrooms. Nice play areas for a range of ages, and soccer fields as well."
  ]
 },
 {
  "name": "Saint John's Episcopal Church",
  "address": "113 Madison Ave, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3a0df014-9332-11ea-ac9f-14b31f159f22.png",
  "tags": [
   "historic"
  ],
  "link": "https://maps.google.com/?cid=17734420845157287136",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely beautiful. This historic church has wonderful stained glass windows and a gorgeous sanctuary.",
   "A very welcoming church. God is love and loves all!!",
   "I love just going here and being able to clear my mind in the little garden they have. It's something magical. I feel a presence each and every time I visit. Thank you for whomever decided to keep it open throughout the year.",
   "great place. nice people",
   "I attended a wedding at this church and I was mesmerized with the beauty of the gardens and the various artist styles. The sanctuary is a museum of biblical images telling a story from the floor to the high ceilings."
  ]
 },
 {
  "name": "Alabama Shakespeare Festival",
  "address": "1 Festival Dr, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3a77fca8-9332-11ea-88f6-14b31f159f22.png",
  "tags": [
   "free",
   "kids",
   "family",
   "free",
   "art",
   "performance",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=2588426241869888086",
  "source": "GoogleMaps",
  "reviews": [
   "Good time for a good price. I went to see \"The Cat in the Hat\" with my wife which is a strange thing to see at a Shakespeare themed venue. (I can't wait for \"Green Eggs and Hamlet\") Although it was a short play geared toward children, we enjoyed it. The cast did a \"meet and greet\" after the show in the foyer. Parking is free and convenient. Staff helpful and polite.",
   "Love this place! It’s a great time for friends and for family. I love the openness!!! My kids loved to play out front with the ducks. I have had some wonderful experiences here.",
   "Enjoyed some sun in the park, also went and saw the herb garden.  Beautiful!",
   "Saw the play The Alabama Story. It was powerful. The venue is lovely and theater we entered was in the round for a very moving performance. Beautiful facility, beautiful landscape and surroundings. Free parking a plus and the Art Museum is nearby.",
   "I knew from photos that this place was gorgeous outside, but I didn't realize that it was attached to a park. It was much bigger than I expected. Everywhere I turned was a new delight, from the fountain to the beautiful doors to the statues of children climbing a tree.\n\nThe play was also unique in that they played clips of interviews on old tvs from people who had been in concentration camps, but they also had actors reenacting scenes in between.\n\nAfterwards, they had a discussion about it for those who wanted to stay for that. \n\nIt was a lovely experience. Well worth the $30 ticket. I can't wait to go back!"
  ]
 },
 {
  "name": "Montgomery Parks & Recreation",
  "address": "1010 Forest Ave, Montgomery, AL 36106, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3aca77dc-9332-11ea-a9ef-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=5957191568753133092",
  "source": "GoogleMaps",
  "reviews": [
   "Quiet, clean, and small. Just wish the area around the park was kept as clean and updated.",
   "Could use newer play grounds & be a little cleaner. I also think they should have nice restrooms suited for the handicap & a changing station",
   "Can't wait to see the goldfish pond after they are done with construction!",
   "They have a fantastic staff or able and willing to try to help in any way",
   "Simply Awesome 👍👍"
  ]
 },
 {
  "name": "Bush Pediatric Dentistry",
  "address": "4740 Woodmere Blvd, Montgomery, AL 36106, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3b2ad4ac-9332-11ea-93ca-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9090614574540009144",
  "source": "GoogleMaps",
  "reviews": [
   "I took my son for his first visit to see Dr Bush and he had a wonderful experience. The staff is friendly, the office is adorable and we were in and out in no time. We got to see Poppy the dog, and that was icing on the cake for my son. I highly recommend them!",
   "Great friendly people. They work sooo great with kids. These are true professionals, from the Dr. to the nursing staff. I highly recommend for all your child's dental needs.",
   "The staff is all very caring and supportive! Dr. Bush makes sure to answer any questions you have. The waiting room is very interactive and you can see Poppy the dog. Couldn’t ask for a better dentist experience for my 2 year old!",
   "Printed off the forms online to fill out before the initial visit, and handed them to the lady at the front desk when we walked in. Waiting area was set up nicely. My son enjoyed playing with the toys and watching Poppy. We were called back quickly for our cleaning. His cleaning was completed quickly and Dr. Bush discussed healthy tips and what teeth to expect next. Petting Poppy was my little one’s favorite part! Positive first experience!",
   "The sweetest staff and the best doctor. They are so fun and patient with my little boy. It’s always a good thing when your child says, “Yay, the dentist.” And of course, we always look forward to seeing Poppy the dog."
  ]
 },
 {
  "name": "Upper Kingston Park",
  "address": "1309 Upper Kingston Rd, Prattville, AL 36067, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3b6efa4c-9332-11ea-b83a-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "family",
   "walking",
   "walk",
   "field"
  ],
  "link": "https://maps.google.com/?cid=11790096237468431665",
  "source": "GoogleMaps",
  "reviews": [
   "Nice clean park in a area surrounded by neighborhoods & a high school. There is a ball field, restrooms, & lots of room for kids to play",
   "Very clean park but needs more parking space",
   "Family friendly, pet friendly. Walking track circles park. There's 5 or 6 soccer fields. All in all pretty nice.",
   "It's a great place to watch my children play soccer, you can go for a safe nice walk around the premises & the playground is fun for the smaller children.",
   "We were at the Prattville High School soccer fields.  \nThe field we played on was in okay shape, not perfect.\nThis place was easy to get to and there was plenty of good. Unpaved, parking.  \nBathrooms were clean and convenient to the fields."
  ]
 },
 {
  "name": "Montgomery Biscuits",
  "address": "200 Coosa St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3bc902ae-9332-11ea-acc4-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "family",
   "library",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10874460789026108960",
  "source": "GoogleMaps",
  "reviews": [
   "We attended the library reading club celebration. Excellent family summer fun. The kids had a blast parading around the field.",
   "It's about the best thing to do in Montgomery. Though it is like the only thing to do. Good value for a good family time.",
   "They really do put in for the city of Montgomery and they expose and share the facility with multiple events and it’s a kid friendly atmosphere. The beer is second to none!!",
   "Montgomery is very lucky to have the Biscuits here. If you like baseball, good food, and beer then you can't beat a biscuits game. Great balance of adult/family atmosphere which makes it great for all ages.",
   "Loved the stadium and the game. Biscuits won! Fans were right though. The umpire did need glasses."
  ]
 },
 {
  "name": "Selma to Montgomery National Historic Trail",
  "address": "7318 US-80, Hayneville, AL 36040, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3c153c2e-9332-11ea-b796-14b31f159f22.png",
  "tags": [
   "history",
   "learn",
   "unique",
   "free"
  ],
  "link": "https://maps.google.com/?cid=17246105998637916560",
  "source": "GoogleMaps",
  "reviews": [
   "I walked the bridge that so many others had struggled to get across marching to secure their voting rights only to be beaten with Billy clubs and chased by dogs and cops on horseback. Truly riveting and enlightening experience for me 55 years later. Everyone should visit this bridge over the Alabama river.  Important American History.",
   "A great place to learn about what our parents generation went thru back in the 1950s and 60s.",
   "Very nice layout and detailed explanations",
   "Awesome! Stopped at both interpretive centers, the one between Montgomery & Selma and th ed one at the base of the bridge in Selma. Both were unique  - not repetitive at all. Enjoyed them both!",
   "You must visit this Interpretive Center to really feel what happened that week in 1965! And it is absolutely free!!"
  ]
 },
 {
  "name": "Confederate Memorial Park",
  "address": "437 Co Rd 63, Marbury, AL 36051, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3c600226-9332-11ea-b2d4-14b31f159f22.png",
  "tags": [
   "history",
   "nature",
   "historic",
   "walking",
   "history",
   "history",
   "library",
   "history"
  ],
  "link": "https://maps.google.com/?cid=3241497830470715146",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful nature trails, full of wildlife. The museum and grounds, are full of rich, Southern history. You have many opportunities throughout the year, to visit while Civil War reanactors, display period correct, living history demonstrations. We are very blessed to have this park available.",
   "Very interesting historic information for central Alabama. The museum has many interesting artifacts and the walking trail is well maintained.",
   "The memorial park is absolutely fantastic. A great piece of history. The old buildings and history behind them are fascinating. The cemetery is beautiful and well kept. \n\nThe museum however was a disappointment. If you go, take cash. Their card machine could not read either of the two cards my man and I had available, so we were unable to even see the museum. The guy behind the counter was friendly enough and apologetic about the machine.. The state really needs to update the  internet connection for the machine.",
   "You cannot understand the South and Alabama without learning about the Civil War, and this Museum and Park tell you about little known part of that history, a home for indigent Confederate soldiers and their wives. \n\nThe Museum tells a really great story, including a letter by the gentleman who started the place writing a letter describing a leader of Union soldiers who was willing to contribute to this cause. Let bygones be bygones.",
   "For anyone interested in the history of Alabama and the War Between the States I highly recommend a visit to Confederate Memorial Park. From the increasing quality of the improving restoration of the original site, to the history museum and the well-documented exhibits, and the small but well-rounded and thorough library, Confederate Memorial Park does an excellent job of presenting as full a view of this portion of Alabama's history as possible."
  ]
 },
 {
  "name": "Tuskegee Airmen National Historic Site",
  "address": "1616 Chappie James Ave, Tuskegee, AL 36083, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3caf31b6-9332-11ea-99cf-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "history",
   "history",
   "learn",
   "hospitable"
  ],
  "link": "https://maps.google.com/?cid=5987153536424869127",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best sites I have visited across the country. The historical hangar had great voice overs to help you feel like you were there and tell the story of this place.\n\nHangar 2, the museum, pulled no punches. It told the great story of these thousands of men and women as they fought and struggled for the double victory.",
   "Friendly, informative staff. Great exhibits. Well worth the trip to learn more about this period of our history.",
   "Excellent historical site and presented in a professional manner!  Thoroughly enjoyed looking back at the history of African Americans embracing the will to battle for freedom!  Thank you all for your service to the United States of America!",
   "I was in Tuskegee for work and had some time to stop in. The history and knowledge in this place is amazing. I just wished the gift shop was open. Otherwise a great experience.",
   "Large property for tired old guy. It was interesting and informative. I enjoyed all the people I met and the Ranger was polite and hospitable. Lots to see and learn. These   Airman were great contribution to U.S.A. Military. But I'm an ARMY guy. Go Army."
  ]
 },
 {
  "name": "Buena Vista Mansion",
  "address": "641 County Rd 4 E, Prattville, AL 36067, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3cf562ac-9332-11ea-b7f5-14b31f159f22.png",
  "tags": [
   "tour",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=17312072316725533718",
  "source": "GoogleMaps",
  "reviews": [
   "Darlene is wonderful! A joy to work with and extremely helpful. The venue is so beautiful and well maintained. I am so glad I was able you hold an event there.",
   "You can get a tour of the mansion on Tuesdays from 10am to 2pm.",
   "Beautiful historic home open to public for limited viewing as well as an event venue available at reasonable rates.",
   "Beautiful",
   "Very professional a legitimate.  Don't lay In the beds. You can host events there and it will be over the top amazing.  Definitely thinking about hosting an event there."
  ]
 },
 {
  "name": "Spinner's Park",
  "address": "390 W 6th St, Prattville, AL 36067, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3d4a37b8-9332-11ea-bb31-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1208534429821049920",
  "source": "GoogleMaps",
  "reviews": [
   "Its ok they need to fix some of the mud spots that are all over the place. Its hard to get from the front lot towards the slides and stuff without having to go way outta the way to get there. But other than that its ok.",
   "Had a great Time with the kiddos at Easter egg hunt!! And enjoyed the park!! Great shade!!",
   "Came here for an event, cute park! It was very clean and everyone was so nice. I had a blast.",
   "Nice quit spot for my kids to play and keep an eye on .",
   "Beautiful park...home of the Spinners pumpkin patch arts and crafts show."
  ]
 },
 {
  "name": "Lowndes Interpretive Center",
  "address": "7002 US-80, Hayneville, AL 36040, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3da5a55e-9332-11ea-86e6-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "parks",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=3375806589689702729",
  "source": "GoogleMaps",
  "reviews": [
   "Great learning experience, during a sad, yet great chapter in America History",
   "Well put together and very moving.  I learned so much and am glad I stopped.  Great opportunity.   Important history to face, especially considering the current climate.",
   "National Parks Service.  A fantastic display of photos visual/voice displays.  Powerful statue display in one room. New, clean,  modern Center.",
   "Interesting and very informative.",
   "Fantastic exhibits that are SO well done! The staff were very friendly and helpful.  The use of sight, sound, photo’s and video, were well thought out.  It was especially meaningful to have the real artifacts from this historic era. An immersive experience to say the least.  Deeply moving."
  ]
 },
 {
  "name": "George Washington Carver Museum",
  "address": "Campus Rd, Tuskegee, AL 36088, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3dfbd842-9332-11ea-ab60-14b31f159f22.png",
  "tags": [
   "academic",
   "free",
   "historic",
   "library",
   "parks",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=233113930004555621",
  "source": "GoogleMaps",
  "reviews": [
   "I love museums and this is a very well done Museum.\nGW Carver's academic life was presented very well.\nMy young son loved the museum and the displays.\nThere were many exhibits that were educational for me and held my son's attention.\nThe museum entrance is free.\nThis was well worth the visit.\nIt only took about and hour to go through and read nearly all the displays and information plaques.",
   "Historic museum in Tuscegee University campus, showing all contributions. Very educational! Cancellation stations by the door when you enter for Passport programs and nation parks store next to it. \n\nThis is the National Park Visitor centre for Tuskegee Institute. Also, to note Visitor parking is available across the street behind Ford Motor Company Library.",
   "Very informative museum!! Most of the information is about George Washington Carver but you can also find a small portion on Booker T. Washington. Here you will find a very in depth history of Carver's life and inventions with many photos and interactive exhibits. Entrance is free. There is a restroom and bookstore that sells souvenirs. Because there are items like old dishes and a stove in hnds reach I do not recommend this museum for those with rambunctious toddlers unless they are closely supervised or in a really good stroller since no touching is allowed.",
   "What am inspirational presentation of one of our nation's greatest Americans .",
   "Very interesting and informative."
  ]
 },
 {
  "name": "Wind Creek Montgomery",
  "address": "1801 Eddie L Tullis Rd, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3e47d5ca-9332-11ea-99e2-14b31f159f22.png",
  "tags": [
   "drink",
   "music",
   "food",
   "delicious",
   "free"
  ],
  "link": "https://maps.google.com/?cid=172920755484215029",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice laid back atmosphere. Did pretty good in winnings this visit. Spent $20 and won $230. Always clean and very good service every visit. Very short on staff right now so a drink order will take almost an hour but the place is very busy and they are doing all they can do. Very clean restrooms and good music also. Would recommend this location for a good day trip. Best chances of winning are on weekend nights. Not much luck on weekdays for us",
   "Love the Gem that they built in Montgomery. And would honestly love the opportunity to stay in one of their rooms too be able to give a complete review for Google. But unfortunately it's outside my funding range. Doesn't help that when I got I end up giving the extra cash I do have to a lady friend so she can play. But the staff is always friendly, and do there absolute best to try and make sure your in good spirits.",
   "Hotel was great! Staff was very professional, and very nice!\n\nWe had dinner at Etta Bina's.  Live piano was excellent, and food was magnificent!  Me and my daughter were given a beautiful white rose as we left!  What an experience!  Can't wait to go back!",
   "I love the slot machines and that they celebrate birthdays. I think adding table games would be good or even expanding. They have a lot of unused lot space and room to grow. I pretty sure they have the money because the slots took all of mine.",
   "I'm a brown skin is Cherokee Indian enjoying going to Wind Creek what some of the things I see there I do not like but overall enjoy myself and Friends one for an example when they have contests less men's are giving credit participate there are a ladies night on Thursday night. I haven't noticed a men's night and I never wanted jack pot looking forward to it I was receiving free play in the mail but that has stopped some parent parent reason. So the Highlight for me is the people that clean up behind all the customers I give them A good jobs well done and the greeters and I will not leave at Miss Sheila red shirt people take their jobs very serious love to be invited to play at the B.B. king Club I love eating chicken wings at the BB King Cafe that 10 piece is delicious"
  ]
 },
 {
  "name": "Montgomery Convention and Visitors Bureau",
  "address": "300 Water St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3e8aab24-9332-11ea-919b-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=16750868925183466594",
  "source": "GoogleMaps",
  "reviews": [
   "Helpful staff, lots of brochures, gift shop, displays, and a beautiful building interior with wood and stained glass windows.",
   "Very helpful staff, lots of character in the building. Not really a destination on its own but a great starting place to see the city.",
   "The ladies were very helpful and answered all of my questions",
   "Beautiful place with very helpful people and amazing suggestions to enjoy the time at the city ! ",
   "Lovely building. The ladies who work here really know their stuff. If you are visiting, go by and get the run down."
  ]
 },
 {
  "name": "Montgomery Performing Arts Centre",
  "address": "201 Tallapoosa St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3ed68168-9332-11ea-a90a-14b31f159f22.png",
  "tags": [
   "performance"
  ],
  "link": "https://maps.google.com/?cid=6426644806203185265",
  "source": "GoogleMaps",
  "reviews": [
   "Attended a concert. Facility is top notch. Clean, well maintained and a courteous, professional staff. Seating is very good and comfortable.",
   "Again, another great show from Joe Bonamassa.   This is a great venue for concerts.  All seats are great.  Become. Member of MPAC and get ticket notifications early and get your tickets early for best choice.  Been more times than I can count.",
   "Black Jacket Symphony of Led Zeppelin is AMAZING!!  Worth every penny.  These guys are amazing.  Did I say amazing?",
   "We enjoy our 2 or 3 nights out a year here. We usually go to dinner then the show. One thing I would suggest is that those scheduling the performances vary the ages of those on stage. Lots of performers have been older not that old is something to avoid. Just find some younger good performers as well as the older ones.",
   "This venue was very nice with balcony seating very spacious. The performance was AMAZING I was seriously blown away. This a great venue for performing and the acoustics are great."
  ]
 },
 {
  "name": "Edmund Pettus Bridge",
  "address": "Selma, AL 36703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3f22a5cc-9332-11ea-a9e1-14b31f159f22.png",
  "tags": [
   "walk",
   "historic",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=4721902031347998823",
  "source": "GoogleMaps",
  "reviews": [
   "There are no words to describe how it felt to walk across the Edmund Pettus Bridge today! So many great  individuals marched across  this bridge and endured so much just so we could have the right to vote! I needed my son to see this so he can appreciate and be proud of the many sacrifices that were made before him so he too can be great! \n\n🖤\"Teach them so one day they can lead!\" 🖤",
   "I don't hate anything.so please stop putting words in my mouth. I love my home town.",
   "This was the most amazing exciting experience i ever had. I can mark this trip off my bucket list. I will be back next year!!",
   "The historic Edmund Pettus Bridge in Selma. A civil rights icon. Beautiful old bridge. Check the nearly hidden (though not well maintained) park under the bridge.",
   "Was honored to walk the bridge and just try to imagine how the Marchers felt.  Did it on a cold quiet morning, was very moving. Fight the good fight."
  ]
 },
 {
  "name": "Harriott II",
  "address": "200 Coosa St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3f744892-9332-11ea-9d81-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1717641300525982021",
  "source": "GoogleMaps",
  "reviews": [
   "Cruising during the late hours was definitely an experience. The security was engaged with patrons as we waited to board the ship. Upon getting on the ship, it was truly a pleasure. My husband and I were celebrating our anniversary. The late night cruise was nothing short of a celebration.  We were able to look out into the night sky and party like it was 1999. Great Times!",
   "Whew, we had an awesome time May 2019. I want to go back, my expectations and experience was great and amazing. I will go again this year!!!",
   "My family and I celebrated my mother's milestone birthday last week with a dinner cruise aboard the Harriott.  We reserved an entire deck celebrating with a group of 76 family and friends.  The food was okay but the servers were awesome, constantly checking to make sure the honoree was happy -- as well as her family.\n\nOur main deck was filled with wonderful jazz and R&B music performed by Mr. John Bull & Band.  Of course we turned up with lots of laughter and dancing.  As we moved about the riverboat to the upper deck, we discovered a DJ playing pop/contemporary music.  Many of our guests danced so until they were drenched with sweat.\n\nThe highlight of the evening was when my mother got a chance to wear the captain's hat and steer the boat. The huge smile on her face from the entire evening-- as well as the smiles from our guests -- confirmed their enjoyment of everything that was offered.\n\nI would have given the riverboat a 5-star rating had it not been for the slow telephone response time by the event coordinator.  My siblings and I were coordinating this event from 2 different states outside of Montgomery, so prompt responses to our voice message(s) would have been appreciated.\n\nIn closing, I would have no problem doing another dinner cruise with this venue.   Once on the boat, the entire crew did everything they could to make sure our evening was memorable -- and fun and memorable it was!\n\nThanks again to the entire crew and I look forward to riding again.",
   "My first time visiting it was Awesome the band was great. Price reasonable., if a large group additional discount. You must give it a try",
   "The paddle boat was clean.  Food okay from the snack shack.  The staff friendly and respectful.   Great outing."
  ]
 },
 {
  "name": "Alabama Department of Archives & History",
  "address": "36130, 624 Washington Ave, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3fb8f2c8-9332-11ea-8e65-14b31f159f22.png",
  "tags": [
   "family",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17197609214463514298",
  "source": "GoogleMaps",
  "reviews": [
   "A very nice place to visit especially as a family. Children enjoys the room... Grandma's Attic. Take them back in time. Also, you can search the archives for the genealogy.👵.🛑*👀*👂. However, don't take my word for it check it out for yourselves. Have fun learning.",
   "Accompanied a group of citizens from different cities to view the Bicentennial display, \"We the People. Alabama's Defining Documents\" at the ADAH. This first exhibit of all state constitutions will be limited until Dec. 31 in order to preserve fragile parchments. Visitors may trace the evolution of Alabama from a territory to its present statehood, hearing stories from historians who highlight content of the six Constitutions of 1819, 1861, 1865, 1868, 1875 and 1901. Well worth the visit!",
   "Great place to learn about the history of Alabama state as well as the history of world war first and second. There are a lot of cultural relics displayed so that one can have a better understanding about what’s going on back then. Nice staff and one of the few places that actually open on weekends!",
   "Beautiful place, if you're from Alabama, you really should check it out. Beautiful place.",
   "Not really inspired by the help. Decided it best to use other sources and search my families from other states. Maybe they are doing all they can. Website is a train wreck. When you do find something, info is incomplete. And it you don't happen to like how they do things, they could care less. So I use Ancestry and whatever else I can to keep from wasting yet another trip to Montgomery. And this is one of the better agencies in Montgomery. Edit; there is an African American lady there that is a tremendous help but she is not always available. I once asked one younger white lady that seemed in charge when the majority of Archives records would be digitized, specifically genealogy records. She said \"never.\" This is the attitude you deal with here."
  ]
 },
 {
  "name": "Alabama State Capitol",
  "address": "600 Dexter Ave, Montgomery, AL 36131, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4003b7f6-9332-11ea-956e-14b31f159f22.png",
  "tags": [
   "active",
   "field",
   "history",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=5246508250365218411",
  "source": "GoogleMaps",
  "reviews": [
   "Best state capital in the United States! I might be a little prejudice and basing that on my love for our great state. Might not be perfect, but it is what it 8s and in general we have a great state.",
   "Went on a 4th grade field trip here, great experience, learned a lot and it makes me want to get more active in our state. We truly live in a great state.",
   "It's the capitol building. It has great old architecture, and the lawn is well maintained. There are lots of little infographics and statues around the building that tell you about Montgomery's history. There is a pine tree that was taken to the moon as well as a tree that is touted to be the oldest in the state. It's a great place for tourists and residents to go and just explore and enjoy.",
   "The historic feelings you get is amazing. But the values of the state is making that harder to amaze. Still the historical value is closely matched to Washington.",
   "It was as beautiful and architecturally astonishing as I believed it to be. Very educational too for some."
  ]
 },
 {
  "name": "National Voting Rights Museum and Institute",
  "address": "6 US-80 BUS, Selma, AL 36701, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4058d6ae-9332-11ea-93b7-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15290230828570308497",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful collection that pays tribute to the men , women and children who were on the front lines risking their lives for equal voting rights for ever African American..  A must see!",
   "It wasn't bad. It smell really old. And you couldn't really hear the little show they had on the tvs. But in all its a good place to learn about history.",
   "This is the exact spot where I met one of FBI's most wanted!! Heck yes I love it",
   "I learned a lot and I cant wait to show my students the information in which I learned",
   "Been here three times. I love it. Very rich with history"
  ]
 },
 {
  "name": "Newtopia Fun Park",
  "address": "3731 Malcolm Dr, Montgomery, AL 36116, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/40bf39d4-9332-11ea-be12-14b31f159f22.png",
  "tags": [
   "music",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=11290742450052196034",
  "source": "GoogleMaps",
  "reviews": [
   "My Newtopia experience was good overall. I was there to celebrate a birthday. The things they do to make the celebration personal is good. However, there could be some options other than song choice and characters. At least make the characters fun. There was not much to it! The attendant in our private room was very nice and accomodating! There was fun to be had there too; it carried over!",
   "This was SO much fun for my 2 and 4 year-old! It was a terrific adventure, and lots to do.❤",
   "Such a fun place to be! Everyone is really nice and the restrooms are clean! Very toddler friendly with different games and toys to play with. The music isn't that loud and you can still have a nice conversation with someone. We will be back for sure!",
   "Anytime I tag along with my nephew for toddler time, I see him become more outgoing and he’s always tuckered out by the end which is good (ha ha). This past time, an employee named Fiona was super nice and helpful and we ended up having a fun conversation about ancestors. It always makes me feel a little more at ease when even the employees are fun! Would definitely recommend this place!",
   "Loved it! I got to play and have fun with the kids too. The slides are so much fun! We all had a great time."
  ]
 },
 {
  "name": "Talladega National Forest",
  "address": "9901 AL-5, Brent, AL 35034, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/410a25c6-9332-11ea-bcc6-14b31f159f22.png",
  "tags": [
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2571131466994822488",
  "source": "GoogleMaps",
  "reviews": [
   "Curvy roads. Beautiful scenery.  Great for a family drive but be careful for young adults and teenagers driving through out the mountain especially on weekend. They're most of the time drunk or buzzing. You have to srop and pull over best you can to fit 2 cars",
   "Good outdoor activities, have to pay to get into lakes and too of mountain. Rangers are great. The public should take more pride in the park. Outdoor toilet at Lake Chinnabee needs attention (lime) to control smell, or have it pumped out. We love the Lodge and the cabins, I camped with my Family many times when I was a child and worked on the trails as a Boy Scout. Nice to visit after 30+ years.",
   "Talladega National Forest is beautiful.   We enjoyed the drive, we stayed at a wonderful camp ground Coleman Lake.  It's a curvy road to get there but don't give up its absolutely worth the time it takes to get there.  The camp host greeted us at 7 PM and he was so nice and helpful.  Our GPS tried to take us down a long gravel road but thanks to a review we read online we took highway 78 through Hefline and turned on county road 61, then just follow the signs.  It's a diamond in the National Forest,  16 dollars a night with water and electric.",
   "Great place to camp. Range is always full. Excellent decor scattered about.",
   "Great place to get away from it all. I was here looking at my great great grandfather's grave site that's all but forgotten you can just make it out born 1812"
  ]
 },
 {
  "name": "Alabama State Capitol",
  "address": "Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/416f9eb6-9332-11ea-88ee-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "tour",
   "free",
   "history",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8741507569707074812",
  "source": "GoogleMaps",
  "reviews": [
   "A bunch of history in this building. Really cool place to visit. Excellent tour guide with a wealth of knowledge",
   "So far it is the most beautiful State Capitol we have seen in person.  Unfortunately we did not have enough time for a tour but did enjoy the outside views",
   "Sorteo distance from each other we visit Tje State Capitol, MLK Jr Church ( we didn't have time for the museum) and Rosa Park Museum  \nRosa Park's take both tours $7.50 each ot both for $14 per person. \nMLK Jr. Have tours every hour except 12 for lunch",
   "Completely free and was a nice place to check out the history of Alabama.  The gift shop there was nice but when the lady says she is closed until 2pm she means it so don't be opening that door or you'll get in trouble =)",
   "Wow. Great tour on a Saturday!  Aroine ran our tour and he was awesome!  Very interesting history. A must if you visit Montgomery!"
  ]
 },
 {
  "name": "Central",
  "address": "129 Coosa St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/41b59b98-9332-11ea-94ad-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10548656685922183621",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome place!!! Food was good!!!! Love the atmosphere and the decorations. The best part was the service, Gabby was our server and she was outstanding!!! Her suggestion were spot on! Next time I am in Montgomery I will definitely come back here.",
   "The food and atmosphere at Central were fabulous. Absolutely enjoyed my birthday dinner there! My 16 oz ribeye was one of the best I’ve ever had.",
   "the food here is amazing I got the flat bread and local vegetables and they were so delicious! The waitress was very helpful with what was on the menu, she was also very kind and quick to bring out the food. I highly recommend this place to anyone the food here is good and it's not an expensive price either! We had a party of 7 and we still got served very quickly, it's really nice to be able to see the kitchen to from where you're sitting",
   "Absolutely exquisite! Great atmosphere & even better food. The staff was second to none! Might become my new favorite restaurant",
   "SOOOOO yummy!! The service and staff were so friendly!! The food was absolutely phenomenal!! I am really excited to go back! It made for a fantastic date night/birthday dinner. I would recommend this place to anyone. I will say, it is fine dining, so it is on the more expensive side, but totally worth it for the experience!"
  ]
 },
 {
  "name": "Vintage Year",
  "address": "405 Cloverdale Rd, Montgomery, AL 36106, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/421b8e5e-9332-11ea-ba7a-14b31f159f22.png",
  "tags": [
   "eat",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3540231054206436107",
  "source": "GoogleMaps",
  "reviews": [
   "Shrimp and grits dish had the tails still on the shrimp making it hard to eat. Bob enjoyed his creole omelette and Ann enjoyed her eggs Benedict. Restaurant was nice and quiet making it easier to carry on a conversation. Service was excellent.",
   "I’ve had several exceptional meals here. The last one was a few days ago. I had the venison steak with polenta. It was very good. Great service and wonderful atmosphere.",
   "We had the dinner for two pick up last night. OMG. Was great snapper was perfect. Easy in and out. Called ahead and got a pick up time. Price was right. No muss no fuss. Thanks  Jud and Eric and your crew.",
   "This is an elegant little restaurant. I felt comfortable and welcome. Every dish speaks for itself - stupendous and scrumptious. If you're looking to celebrate with the family, this is your spot.",
   "Absolutely worth the money. Hubby and I wanted a nice date nite and that's exactly what we got. We enjoyed cocktails, cheese tray, entrees and dessert. Highly recommend and will definitely be back."
  ]
 },
 {
  "name": "Martin's Restaurant",
  "address": "1796 Carter Hill Rd, Montgomery, AL 36106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/425fd926-9332-11ea-8afd-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "hospitable",
   "food",
   "family",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7695849343111733111",
  "source": "GoogleMaps",
  "reviews": [
   "Try the Fried Chicken Pulleys! It will be the most tender, juicy, meaty and crispy fried chicken you've ever tasted in your life!! The side portions are enough to eat half and save half. And you should save half and order a piece of pie! The coconut meringue is a tower of sweet and delightful! Don't miss this spot, foodies!",
   "OMG - don't know how to convey our absolute delight and excitement when we 'accidentally' discovered Martin's! \n\nThe food quality was exceptional, fresh, and everything delicious!  Serving sizes were HUGE!  Servers were hospitable, patient, doted on us... and encouraged us to take home what we couldn't finish. \n\nThis is a hidden, off-the-beaten-path jewel of Montgomery... a favorite of locals and tourists like me who are fortunate enough to find it!\n\nYou will NOT be disappointed. \n\nFried chicken the crispiest, freshest,  tastiest ever, anywhere in any state. Fresh veggies (black eyed peas, greens) remarkable.  Banana puddin' was worthy of #1st places in any dessert contest. \n\nHighly recommend.  :)",
   "Good small country place. Nice family atmosphere and friendly wait staff. Overall good food and good time.",
   "I couldn't have cared less about the carbs. This was my Mother's Day meal and it was worth every one of them and the calories. It's good home style cooking. And it's easy to see (and taste!) why their fried chicken was voted best in Alabama. It's some seriously good fried chicken. Portions are huge and your appetite will be too once you smell the food.",
   "Talk about seriously good hone cooking! Delicious food and servings big enough to feed 2 people. I ate 1 of the 2 whopping chicken breasts on my plate and half the 3 sides and took an equal amount of leftovers home. Will be stopping here for lunch whenever I'm passing through Montgomery."
  ]
 },
 {
  "name": "D'Road Cafe",
  "address": "121 Montgomery St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/42a7f4f0-9332-11ea-ab58-14b31f159f22.png",
  "tags": [
   "unique",
   "delicious",
   "delicious",
   "unique",
   "food",
   "delicious",
   "food",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=15733074483594042228",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful service.  My meal was a fish stew in coconut milk that had unique and rich flavors.  Clearly cooked with passion and love.  The bread pudding was flavorful and unique.  Very satisfying meal.  The restaurant was very clean and while spartan was completely welcoming. I will definitely come back next time I visit Montgomery",
   "Super cool artsy kinda funky but chill atmosphere. Service was tremendous and the breakfast? On point. Eggs perfectly fine, brisket was super moist, and everything delicious. Awesome little breakfast place",
   "04/27/2020 Fantastic food!! Was at Truckworx for service and ordered through grubhub. Food was piping hot when arrived, beautifully presented, ample portions and everything tasted oh so good!! Very unique food - plantains cooked perfectly (so sweet & delicious), black beans & rice yummy, curry chicken was not spicy and deliciously tender, and vegetable medley fresh & cooked perfectly.  Delivery was quick and driver friendly, as were staff on phone. HIGHLY RECOMMENDED!",
   "We need more Venezuelan immigrants. This food was AMAZING and the breakfast menu looked authentically delicious. They don't use oils or fry or anything, but you couldn't tell from how much flavor was in our food. Even the water had a perfect saturation of lemon and lime!",
   "Love the atmosphere and unique flavors of the world! Different cuisine from all over the world with outstanding taste. Excellent service with great price."
  ]
 },
 {
  "name": "Cahawba House",
  "address": "31 S Court St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/42f3560a-9332-11ea-a024-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walk",
   "art",
   "drink",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17602326589908184082",
  "source": "GoogleMaps",
  "reviews": [
   "Was looking for something different than my standard lunch fare, but not to far off the beaten path. With everything that is going on, the restaurant business has been hit pretty hard,so the choices are limited. This business has changed up its model slightly by offering basic supplies/produce in addition to the menu items. What has changed is the tables for socializing at. They are no longer available. So the ambiance of this local establishment is both longer the same, the. Food is still wonderful and at a good value. Was definitely pleased with the service and the employees were polite and quick to answer any question I had.\nI've been here before a couple of times, will definitely  stop back in for another lunch and try out something else on the menu. delicious !",
   "Incredible! All your southern comfort favorites but in a fresh, low-key way--not heavy or over-the-top either. Order when you walk in and sit wherever (we chose outside on the sidewalk and it was *perfect*)--food is brought to you super fast. The Breakfast Bowl is so good...the pimento cheese getting all melted with the grits and eggs and bacon...and the cahawba burger with the crisp fried green tomatoes...can't wait to go back and try more. Really nice, friendly and inviting. Grab some local art and gifts while you're there!",
   "Very good food. Home cooking. Came out very fast. You go in, stand in line, order, then they give you a number and you take it to your table and wait. I fixed my drink, sat down, and the food was aleeady being walked out to the table. I had herb chicken, fried green tomatoes, collards, and vegetable medley. Chicken was on point. Fried green tomatoes were BEST I've ever had. Collards were good. I wasn't a big fan of the vegetable medley. Atmosphere is pretty cool. Saw the meatloaf coming out a lot and it looked amazing. French fries looked pretty good also. Definitely a plus, plus experience.",
   "Yum yum yum yum. Super good, our food came out fast, even though the drinks are self served the staff still came to the table often and it was nice. I loved it. I ordered the meat loaf sandwich, my wife had the big burger and my daughter had the chicken strips. We split some fried green tomatoes. Everyone loved their food. The price was great too, all of us food and drinks under 28 bucks. Stop in a visit these guys. You wont regret it!",
   "Fun atmosphere, nice location, good price and great food! We got the meatloaf, fried green tomatoes, collard greens, and the Cahawba Burger, among other things between the four of us and it was all great! Would come here again if we ever make it back to Montgomery!"
  ]
 },
 {
  "name": "Sol Restaurante Mexicano & Taqueria",
  "address": "3962 Atlanta Hwy, Montgomery, AL 36109, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4343243e-9332-11ea-b251-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18023076269820334204",
  "source": "GoogleMaps",
  "reviews": [
   "So delicious! I have been 2 times. Mario waited on us last time and he was fantastic. The restaurant is clean, we were greeted and seated promptly, and the service and food were excellent. Also, the prices are very reasonable. Best Mexican in Montgomery.",
   "Great Mexican food and service\nWe arrived just before 6 pm on a Saturday evening and the restaurant was already full.  Luckily we only had to wait 10 minutes for a table.  The chips and salsa were great and the naked poblano (with grilled steak) was outstanding, but we thought that the vegetarian burrito was unremarkable.  We like spicy food so we loved their home made hot sauce!  Even though it was really busy, our food came out quickly and the servers were super friendly and efficient!",
   "Good restaurant and fast service. They have it figured out once you sit down. Drinks, chips and food then get out. Good Mexican food for being in Alabama. Salsa has a decent flavor and the cheese dip was great. I’ll try to make it back while I’m here. Thanks guys",
   "This is an excellent little spot for a quick lunch.  The menu is very reasonably priced and the food is generally excellent. I have been very impressed by the attentiveness from the wait staff, and the food leaves very little to be desired.  For those who like Mexican without the spice you can't go wrong; however if you enjoy authentically spiced Mexican you might be a little disappointed.  One note-- when ordering quesadillas I definitely recommend the beef.  The chicken is good but dries out quickly.",
   "The street tacos are epic! I had the Tinga a shrimp tacos. Spicy, but it was so worth it. My head was sweating when I finished. I would come back again."
  ]
 },
 {
  "name": "First Watch - Montgomery",
  "address": "2920 Zelda Rd, Montgomery, AL 36106, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4392cacc-9332-11ea-9c96-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8088445736687687504",
  "source": "GoogleMaps",
  "reviews": [
   "The Vanilla Chai pancakes with raspberries on top were some of the best pancakes I've ever had a restaurant. \n\nStarting out with a great cup of coffee set the tone for the whole meal and the wait staff was both friendly and observant. \n\nOur big group was given fast, great service and all the food looked incredible. \n\nWill definitely be recommending your place for breakfast to other folks who visit Montgomery.",
   "This bar is so great. They have great drinks, really fun and delicious cocktails, and amazing staff. The inside has a really cool vibe, and it's so nice to chill out there, listen to bands play, or engage friends in an epic round of ping pong.\n\nThe outdoor area is also beautiful and is the perfect spot to lounge on a warm Montgomery evening.  I could not recommend this bar enough!",
   "I have never had a bad meal here! Both the breakfast and lunch menus are really good. It's much better than fast food and the atmosphere makes each meal an enjoyable one.\nFurthermore, there is vegan coffee creamer available upon request (this is a huge deal in AL)!",
   "Some consider the entrees a bit pricey. I say that you get what you pay for. In my experience,  all meals are worth it. Love First Watch. Stellar customer service. Delectable and diverse menu choices. Top-of-the-class ambience.",
   "So in love with this place's food!\nThe waiter was so good to us that morning and recommended the absolute best choices with the most delicate patience. We can't wait to go back! #Dori"
  ]
 },
 {
  "name": "Charles Anthony's Restaurant At The Pub",
  "address": "10044 Chantilly Pkwy, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/43e076dc-9332-11ea-96b6-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "delicious",
   "delicious",
   "food",
   "delicious",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8618374534577533301",
  "source": "GoogleMaps",
  "reviews": [
   "Came here for my wife's going away dinner we are from Birmingham so we had never been but this place was amazing the ambiance and elegance are amazing and the food was pure heaven. Our server Brandon was amazing and attentive and very knowledgeable of the menu items and he took great care of us the whole meal. I was very pleased with my experience here and if I'm ever in town again I'll be visiting here for sure...",
   "Nice local restaurant. Good menu selection included steak and seafood. The snapper with crab was excellent! The service was friendly, attentive and efficient despite being very busy. Probably be ause they were well manned for the crowd. Kudos to the wait staff, bartender, and management. Truly worked together.",
   "This is hands down the BEST restaurant in Montgomery and the State of Alabama.  The steaks are always freshly cut and cooked to perfection.  I usually order the ribeye steak cooked at medium.  This restaurant gets it right every time. I've never had to send my steak back.  The sides are always fresh and delicious as well.  Every time I make a trip to Montgomery, I always make time to have a delicious dinner at Charles Anthony's Restaurant.  Once you have dined here, you will never stop going. In addition, kudos to Carlie, the bartender.  She serves the best cocktails in Montgomery as well.  I will definitely be back soon.",
   "Fantastic food.  This little restaurant gives off a Castle, Medieval vibe with the decor.  Destiny our lovely waitress was so helpful.  I had left my glasses in the vehicle so she got a couple of spare pair for me to utilize while perusing the menu.  I chose the Grilled Red Snapper with Lump Crabmeat.  Everything was exceedingly delicious and meticulously prepared.",
   "Very good food. The service was great. I had the ribeye steak and it was good. The sea base was good and had a good sauce. Very busy but the food was served in a timely manner and very good service. I ordered a drink and it took 12 minutes to get to the table and they comp it. I did not ask for the comp. Just great management. This place cares about your experience. The salad dressing was delicious. It  was  Greek Balsamic and it was so good, I asked for more and poured it on my steak."
  ]
 },
 {
  "name": "Firebirds Wood Fired Grill",
  "address": "7078 Eastchase Pkwy, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4437e4b6-9332-11ea-81e7-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "eat",
   "delicious",
   "unique",
   "kids",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1469542208036402410",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent service and the food quality is second to none that I have ever experience. Management was involved and very visible and our server just couldn't seem to do enough for us. The server seemed to be genuinely pleased to serve us and couldn't do enough for us. She was willing to bend over backwards to see that we were happy with our visit there.\nI would recommend this restaurant to anyone wanting to eat a great meal and thoroughly enjoy their experience there in the process.\nAbsolutely one of the best out there.\nKeep up the good work!",
   "Always a busy and good place to eat. The absolutely best place for happy hour. They are always fully staffed. I love the private room for 8 -10 people. You can see kitchen via window in the restroom. You know they are clean and professional.",
   "Went for Valentine’s and had an excellent meal. They do know what they are doing! The steak was cooked perfectly. The atmosphere is comfortable and beautiful with racks of wine bottles lining the walls. It was festive with balloons at every table which makes me think they must do their holidays in such a manner. Great place for a date night. They even have a patio to enjoy a good Montgomery day on.",
   "I had the beef kabobs and the meat was the most tender I've ever had. It had an anchor chili glaze that was delicious.  We ordered freshly squeezed lemonade that was a unique and welcoming beverage choice. Samantha was our waitress and she was very pleasant and attentive.  We will definitely put this in our regular rotation of places we frequent!",
   "Awesome restaurant for such a small city. The atmosphere, decor, staff, open kitchen, drinks, and food are exceptional. Coming from NY I was very pleased and impressed with this establishment. \nGreat place for a family (awesome kids menu) and date night."
  ]
 },
 {
  "name": "Mrs B's Home Cooking",
  "address": "415 Air Base Blvd, Montgomery, AL 36108, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/448345e2-9332-11ea-a7db-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3221911789551432183",
  "source": "GoogleMaps",
  "reviews": [
   "Don't be fooled by the outside appearance. They employees were quick to greet us as we walked in. The food varies by day and we wanted to try everything. We decided on fried chicken with corn and mac n cheese, smothered chops over rice with collards and mac n cheese, and ox tail over rice with cabbage and broccoli casserole. Everything was so good!! Only downside was that it was a bit warm for us inside as we ate but that's purely a personal preference.",
   "Food was pretty good! I had the Oxtail and hubs had the Catfish. A few things on their menu board are actually not served everyday, so you might have to dbl check. The meal came w a drink, tea or fruit punch. The ladies that worked there were really nice. The area and ambience definitely could use a lot of work but the nostalgic pictures, food and good service makes up for it!",
   "This was an amazing breakfast at an incredible pric . The staff was so loving and kind the service was second to non. Food was well cooked and prepared perfect. I fee my whole office breakfast at half the cost I would have spent at McDonald's.......you have to try the food it is amazing.",
   "Mama B's was fantastic.  Home cooking at it's best.   Not a fancy place.. just awesome food.  About$10 a plate",
   "Stopped in for breakfast. Good Lord that was a good breakfast sandwich. Don't let the looks fool you, coffee is legit, the food is crazy good and they have a 97 on the health inspection. Will be back."
  ]
 },
 {
  "name": "Midtown Pizza Kitchen",
  "address": "2940 Zelda Rd i, Montgomery, AL 36106, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/44dd25f6-9332-11ea-96cd-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3413627952960832084",
  "source": "GoogleMaps",
  "reviews": [
   "Incredible atmosphere.... The ant-pasta board was Delicious...The Pizza was out of this world.... Can't wait to go back..😋😋😋😋😋💯💯💯💯💯",
   "You can’t go wrong with Midtown’s pizza. It is the best in town. The ingredients are fresh, the dough is not too thin and not too thick. It’s just right. There are flavorful options to make your pizza personal. We usually order the pizza with white sauce, caramelized onions, fennel sausage and mushrooms. If you haven’t tried it; give it a try. It will change your life! The staff is friendly, efficient and they seem to genuinely want to please you. The restaurant is clean, the tables are clean. It’s just a nice, wholesome place to get good food.",
   "Just finished 1/2 of my Chicken Marsala order!! Absolutely delicious!! And enough for another meal as well!! Thank you SO much for being there for us MPK!!",
   "My pizza was burnt . I sent it back and asked it be taken off the bill,  they didn't even ask if I wanted something else. The food has gotten worse over time so this will be my last visit. Just lost two very dependable customers ! This was the Prattville location .",
   "Good food.  Nice people.  Holy smokes awesome pizza.  The balsamic salad dressing I can drink shots of that.  All freshly made.   Good stuff."
  ]
 },
 {
  "name": "Chappy's Deli",
  "address": "1611 Perry Hill Rd, Montgomery, AL 36106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/45204986-9332-11ea-b712-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13256895571850799544",
  "source": "GoogleMaps",
  "reviews": [
   "My photo here doesn’t do justice as I had already started eating off my plate but Chappy’s has been a staple in the community for 30 years. I actually worked here 25 years ago before I started my current career. The owners and employees have always been nice and friendly. The food is pretty good across the board for breakfast lunch and dinner. Prices I think are a little higher than say Cracker Barrel but not over exorbitant. The menu has a wide variety of choices from soups, sandwiches, salads and healthier choice items. It’s a great place to go when you have kids as they have several items for the picky eaters to choose from. I would recommend Chappy’s as a local deli favorite to anyone coming into town who want to avoid the typical chain places to go. It usually doesn’t disappoint.",
   "Enjoyed the well prepared breakfast. The place was magnificently clean; food was prepared to taste; and the waitress (Mary) and the staff were very friendly and on top with their service. My Sis and I were thankful for the presence of numerous uniformed law enforcement officers. There was plenty of local friends chattering, to add a homie touch to the breakfast.",
   "Great Southern style breakfast enjoyed our meal especially the Conecuh sausage. Add a mango shake would recommend. Will visit this Deli again in the future great service and atmosphere in Montgomery",
   "Had a delightful breakfast at Chappy's.  I'll be going back for sure.\nThey were very busy but it didn't take long to get the food to us.\nThat was a treat after waiting at other places for extended periods of time for our food.",
   "5 stars where 5 stars is deserved. Employees literally run. That is what you call good customer service."
  ]
 },
 {
  "name": "Jubilee Seafood",
  "address": "1057 Woodley Rd, Montgomery, AL 36106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/456d314c-9332-11ea-9a21-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16064053056258470183",
  "source": "GoogleMaps",
  "reviews": [
   "This was a VERY pleasant surprise. We like to try different places around town so we Googled nearby seafood and Jubilee Seafood came up. When we arrived we were a little skeptical. It isn’t the most appealing from the outside. Then when we walked in and the place was packed to capacity. However, my party of three were the only Blacks in the place. Uh oh, right? Nope. We decided to stay and try it anyway. The waiter was super nice and very knowledgeable about the offerings. We ordered the scamp, oysters, and shrimp. We shared bread pudding with a scoop of ice cream for dessert. ALL delicious! The portions were perfect. The most satisfying part were the people. Couples stopped by our table and bragged on the food, gave my daughter compliments, and even gave us tips on what to try. It’s true... don’t judge a book by its cover. We’ll definitely return.",
   "Stopped,by this jewel of a restaurant find driving from Biloxi to Atlanta. Wanted some more fresh seafood. This spot was perfect. Small and local. You must try the gumbo appetizer and bread pudding dessert. Tasted like my Grandma's from years back. Fresh Snapper was fantastic. Very good experience.",
   "Jubilee Seafood was recommended by a friend. I had the blackened Redfish dinner special which was excellent. Also had a half dozen raw oysters for an appetizer, which were rather small, but very good. The wait staff members were very attentive and provided excellent service. All the people in our group were very pleased with their dining experience. It reminded me of dining in New Orleans.",
   "Location of company Christmas party. Everything was outstanding. Pheasant legs, prime rib, scalloped potatoes, a tomato/squash/onion ok n dish I've never seen before but was very tasty... and the caramel and pecans over cheese cake was awesome.",
   "Incredible seafood and desserts!"
  ]
 },
 {
  "name": "Martha's Place | Buffet and Catering",
  "address": "7780 Atlanta Hwy, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/45b3b068-9332-11ea-8cc5-14b31f159f22.png",
  "tags": [
   "field",
   "eat",
   "food",
   "eat",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17925556096322437885",
  "source": "GoogleMaps",
  "reviews": [
   "On our way home from Atlanta to Houston we stopped by this charming restaurant. To say this is the best southern comfort food on the planet is an understatement . I grew up eating southern food and this reminded me of my grandmothers  cooking. The fried chicken is amazing and could not get enough of the field peas and potato salad. Look forward to  taking another trip to eat here again.",
   "An amazing place ran by an amazing person🤚🏽",
   "There were no other seafood than catfish, at the moment. But maybe God didn't want me to have seafood at the moment. Smiling. I don't eat cat fish. Other than that, food taste good. Friendly atmosphere. I like it overall. I will go back if time allows.",
   "Awesome soul food. The price is unbelievable for this all you can eat southern comfort food restaurant. I will definitely visit again. Wish I'd discovered it sooner. The food choices include multiple vegetables and meat choices. The meats change according to the day of the week. Multiple desserts are also included in the price.",
   "Martha's is an authentic soul food experience!  We were quickly taken care of with some of my childhood favorites like beans and cornbread, fried chicken, corn fritters, and banana pudding. Not a bad little place at all."
  ]
 },
 {
  "name": "Baumhower's Victory Grille",
  "address": "2465 Eastern Blvd, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/45f43bee-9332-11ea-9e15-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "unique",
   "food",
   "performance"
  ],
  "link": "https://maps.google.com/?cid=10645496916952200131",
  "source": "GoogleMaps",
  "reviews": [
   "This bowl (Honestly forgot the name of it), was pretty good. Fries, cheese sauce, bacon, chicken fingers and ranch. Food could definitely have been warmer upon arriving to the table. It was more room temp but I didn't have to wait long for it. Beer tasted a bit flat. (No fizz to it). Atmosphere was a typical family friendly sports bar. Waiter was great and hostess was too. I will be back to try other menu items!",
   "The chicken and waffles is incredible. Perfect amount of sweet and hot (they drizzle some syrup on the waffle and put a hot sauce on the chicken). Also it's the perfect amount of crispy for both the waffle and chicken. Comes with a little fruit cup on the side. The portion is huge though so you better come hungry! My boyfriend got the artisan power salad with grilled shrimp and balsamic dressing and that was great too.",
   "Excellent food excellent service in a very cool unique cabin-like sports feel! Already planning my future visit.  Not a huge fan of desserts, but the Fried Banana Pudding is a must.  Check this place out!",
   "The smothered chicken dish was good. It has bacon on it as well. Loved the rice also. Lots of TVs so you won't miss any games",
   "This is the second Baumhower's location I have been to and their customer service is top notch.  We went prior to attending show at nearby Alabama Shakespeare theater Christmas performance and were warmly welcomed.  While it's a sports bar theme restaurant it is great for everyone and doesn't have sound blasting which allows you to carry on a conversation.   I had the All American cheeseburger and split it with my wife as well as the grilled chicken salad she ordered.  Both were very good.  Couple we were with had the Hot Brown.  Definitely a must.  They raved about it."
  ]
 },
 {
  "name": "Bonefish Grill",
  "address": "7020 Eastchase Pkwy, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/463e1680-9332-11ea-b685-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12875871393480922611",
  "source": "GoogleMaps",
  "reviews": [
   "Upscale dining with a \"twist\"! The ambiance & lighting sets the mood for a great evening. Celebrate for two or host a business accomplishment with your business partners. Stop by Bonefish soon and don't forget to try the \"Bang-Bang\" Shrimp Appetizer...for it is Amazing!",
   "I went out to eat with my friend.. This was my first time eating here the food was amazing. The drinks were excellent!! Staff were very friendly and prices were on point. I will definitely be back again",
   "Food, beverage, and service were great. Tiffany did a great job. I've always enjoyed dining here for dinner, but this brunch indulgence will start to happen more often.",
   "The employees were very nice, as was the ambiance. I must say the food was a little disappointing, though. My French toast was tasty but hard, maybe due to the type of bread that was used. They gave me cold syrup to go with it. In fact, everything but the syrup and the fruit was lukewarm at best when I got it. I just expected better.",
   "Top-notch food and service. My eldest son, a USAF pilot, came into town from Colorado for a couple days for a visit,  and I took him and his younger brother, my other son, to Bonefish Grill. We were kinda late getting out to eat, but everyone was so friendly and attentive. It was 45 minutes until closing, but no one made us feel rushed or mean mugged us like we were slowing them from getting out early. The food was superb. Of course we started with Bang-Bang shrimp. My guys had steak and seafood, and I had a gnocchi with something like a lobster and seafood alfredo sauce with their brussels and bacon side. Both my boys and I were impressed with everything on our plates. Thanks for a great evening Bonefish Grill!"
  ]
 },
 {
  "name": "India Palace",
  "address": "2801-E Vaughn Plaza Rd, Montgomery, AL 36116, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4684202e-9332-11ea-83d3-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9837971857234973161",
  "source": "GoogleMaps",
  "reviews": [
   "5/5 would not justify the food here- the amazing Indian restaurant in Montgomery. Buffet starts at 11.00 and that is the best time to go there. Non-veg dishes are extraordinary",
   "I would like to rate this restaurant 4.5. The chicken 65 is awesome. Chicken biriyani was good but the tandori chicken was below expectation level. \nAnother sad thing is that only chicken is halal here. Other meats are not halal.",
   "Excellent food. Amazing customer service. I have eaten there many times before but tonight it was exceptionally good. The palak paneer was perfectly prepared. The chicken vindaloo was exquisitely done. Delivered in roughly 30 minutes. Keep up the great work!!!",
   "We found this restaurant just off the interstate near Montgomery while looking for vegan & vegetarian options. We showed up just before they ended the lunch service but they were very friendly & seated us without hesitation. The food was all great & I appreciate that the vegetarian dishes are kept separate from the meat dishes, making it that much easier for us to eat animal-free.",
   "The best Indian restaurant in the local area. Atlanta may have better ones and I'm still trying different ones in Birmingham but this is the best I've had within 2 hours driving. They have a lunch buffet when they are open for lunch and perfect if you have not tried Indian food before. Grab a little of everything and see what you like. Be sure to get some raita(yogurt, also on the buffet and regular menu) in case something is too spicy for you. The staff is very helpful so feel free to ask them questions."
  ]
 },
 {
  "name": "Jim 'N Nick's Bar-B-Q",
  "address": "6415 Atlanta Hwy, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/46c8a3a2-9332-11ea-9a60-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "affordable",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12241639598544319196",
  "source": "GoogleMaps",
  "reviews": [
   "It's not like it used to be. It has been a few years since I've gone here but I used to love it. My ribs were very tasteful but they were tough. Biscuits was delicious, as well as the Mac and cheese. The hot links were not to my liking. I do not think I would purchase those again. Overall it was an okay experience. However, customer service was over the top!",
   "Love Me some Jim N Nicks! Although they are a chain restaurant the food is always consistent. The staff at this location is always friendly and on top of the game. Price is affordable for the portions you get.\n\nIf you like this review but that 👍button for me!\n\n#outalongcr30a",
   "The food was good but I had hair in my macaroni and cheese. They replaced it but didn't even offer to take a percentage off my meal how most restaurants do. Also they don't do well with giving out the biscuits and we stayed waiting on them. I do like that I can buy my own biscuit mix from Winn-Dixie and Piggly Wiggly stores.",
   "Saturday evening and we stopped by for something simple. The place was busy but the wait time was only about five minutes. We ordered BBQ sandwiches and a side. They were great and so was the biscuits. Our server was very polite and attentive with a splash of humor. We shall return!",
   "It's has a family atmosphere.  Our waitress was friendly and very attentive.  The food itself was fresh and more then we could it."
  ]
 },
 {
  "name": "Wharf Casual Seafood of Montgomery",
  "address": "3954 Atlanta Hwy, Montgomery, AL 36109, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/47111e6e-9332-11ea-8982-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2467365634814455636",
  "source": "GoogleMaps",
  "reviews": [
   "The food was good. Staff was alright. We sat outside and enjoyed seeing all the people.  We stopped in out of curiosity. Wanted to see how good seafood could be coming from something in a strip mall. It was worth it all the way around",
   "Nice clean restaurant and really nice staff. Two beers and some fried shrimp and it got the job done. Fries were ok and the coleslaw has pickle chunks which was new to me but then again we r in Alabama. Shrimp was good and tarter sauce was spot on. Bathroom was clean and the beer was cold.",
   "I enjoyed a delicious catfish and shrimp platter with two sides (red beans & rice and fries).  The red beans & rice was okay. I've had better.  I wouldn't recommend the red beans & rice.  But I would recommend their fried catfish and shrimp.  It was tasty! The servers were very polite and courteous.  I will go back there again the next time I'm in town.",
   "First impressions:  nicely located with lots of parking. Inside the decor is tastefully done.  There is a good amount of menu choices. Quick & Friendly service.  Hot and  delicious food was delivered fairly quickly.  I was going to have seconds but, the meal size was good enough.   I am a fan, this will be the place I will make as many return trips to as I can.",
   "Amazing food! We had the fried green tomatoes and shrimp baskets. The food was seasoned perfectly and came out hot and fresh. The fried shrimp have great flavor and the breading is not heavy. Will absolutely be back to try more items!"
  ]
 },
 {
  "name": "La Jolla",
  "address": "8147 Vaughn Rd, Montgomery, AL 36116, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4756da28-9332-11ea-b656-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12268488541902249396",
  "source": "GoogleMaps",
  "reviews": [
   "This place was delicious! I have never had veal in any other cut than a cutlet before. Here, they serve a Veal Porterhouse and let me tell you, it is so tender and full of flavor. Everything we ate that night was fantastic from beef carpaccio to dessert. The drinks were also great. Definitely make reservations, it gets packed, but if you don't you can also eat in the bar area. I would absolutely go here again.",
   "Great food!  Just gotta try this crazy burger comprised of Elk, Duck, Pork and Beef.  This place literally burns through two Big Green Eggs a year because it's running 6-8 hours a day.  Obviously the flavor of the grill takes this burger to another level.  Oh yeah, and the rest of the food seems great, so I keep hearing.  I just can't stop ordering the burger.  They also have a fine selection of drinks.",
   "The food was outstanding. The seafood was beautifully prepared. My husband's steak was a perfect medium rare. The chocolate bread pudding was out of this world! Our server, Patrick, was attentive and sweet.",
   "Celebrated our 5 year wedding anniversary here. Food was delicious and drinks were fair priced. Patrick was our server, he was attentive but not intrusive. We will be back, thank you!",
   "I'm sure it's great during regular times but the meals do not seem to make the best take home dishes. Will try again when things return to normal."
  ]
 },
 {
  "name": "Tomatinos Pizza and Bake Shop",
  "address": "503 Cloverdale Rd, Montgomery, AL 36106, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4798ec5e-9332-11ea-8ee7-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "art"
  ],
  "link": "https://maps.google.com/?cid=1355365519731238156",
  "source": "GoogleMaps",
  "reviews": [
   "Very high quality food and amazing service. Everything I have eaten here is the best version it can be. The staff is friendly and isn’t afraid to have a conversation about anything if you please. The tea and coffee are phenomenal. Skip Starbucks and Pizza Hut...this is where you want to be.",
   "I have pizza everywhere I visit... It is my idea of the perfect food. Venice, NYC, Chicago, San Francisco and many others. Tomatinos Summer Garden Pizza ranks with the best of them. A perfect combination of flavors on a freshly baked crust... Just incredible! They knocked it out of the park!",
   "I enjoy Tomatinos. The pizza, beer and service are exceptional, and the location takes it to the next level. Close to downtown and in the heart of Old Cloverdale's Historical District — it's convenient and feels like home. Not to mention it shares space with one of the best coffee shops and bakeries in Montgomery. Stop by Tomatinos the next time you are in the area. You will not regret it.",
   "Wonderful pizza with a side of acceptable service. I have been a fan of this place longer than a decade and since I first started going the service had usually been good but never great. The pizza however has always been excellent (though in my opinion it doesn't travel or reheat well). In it's new location it lacks the hole in the wall charm it used to have but kept the art. I would recommend trying it and forming your own opinion and ignoring what constitutes mine.",
   "I love this pizza. It is the best pizza in the city. The spinach salad is what pushes it over the top."
  ]
 },
 {
  "name": "Saffron Indian Kitchen",
  "address": "8868 Minnie Brown Rd, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/47dfb97e-9332-11ea-9308-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=11822685188310462141",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent service in lunch buffet. The quality of food, variety of dishes in a lunch is excellent.Spicy levels were very well balanced. I definitely recommend this place and today is one year celebration of restaurant open and more special taste today.",
   "Birthday with my mom tonight was exceptionally wonderful! The owner and staff go out of their way to make sure you have everything you need and explained the menu in great detail!! Excellent atmosphere!!! #bestcurryever",
   "It was very peaceful and nice place. We've had samosa chat, which was the best samosa chat I'd ever had. But  goat curry wasn't the best. It's a good place to taste indian cuisine.",
   "Saffron is the BEST Indian restaurant I have been to in the 6 years I have been in US and travelled across multiple states but never found a taste that comes close to what I found here.\n\nThe vegetables as well as the meat is so succulent, the flavors just wake up your palate and every taste bud on your tongue without being overbearing at all! \nThe rates are great and the selection as well as the description on the menu are perfect! \nThe service is very commendable and friendly.\n\nCan't wait to come back for more. We are going to be regulars here for sure as well as let our friends know they NEED to try out Saffron!",
   "I stopped here while traveling from Destin to Atlanta.  What a great place. The buffet was wonderful.  The staff was pleasant.  This will forever be my pit stop while traveling.  I would highly recommend for traditional Indian cuisine."
  ]
 },
 {
  "name": "The Tipping Point",
  "address": "5015 Hampstead High St, Montgomery, AL 36116, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/48252764-9332-11ea-9c27-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "eat",
   "food",
   "kids",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=509652364314765216",
  "source": "GoogleMaps",
  "reviews": [
   "A lovely little secluded spot of Montgomery that is the perfect spot to unwind and have a drink.  The beer selection here is truly spectacular, from everything on tap to the wide selection of homegrown brews that are posted on the top shelf of the bar.  The food is not gourmet but it is quite delicious and appropriate for the environment. I had the BLT which was cutely cute into a heart.  An underrated aspect of this place's ambience and charm is their decor and musical selection.  There is a homely seating area in the corner (sofa, chairs, lamps, & tables) for those intimate conversations. A nice touch. There is also plenty of outdoor seating,  in the summer time this becomes their greatest allure.  The soundtrack ( my last visit was at noon on a Saturday) made me feel as if I was back in my childhood and my mother just turned on the Golden Oldies station so we could promptly clean the entire house. I was comfortable instantaneously. I've never had an issue with service,  Rebecca was a gem. I've never visited this establishment at night but if you want a place with great ambience,  a good bite to eat,  and simultaneous homely/chic feeling then look no further.",
   "Really fun little place. Good food and drinks. Outdoor eating. Kids love the hill. Trivia nights. And lots more.",
   "I was in town for a conference and came here with some co-workers. They serve crafted beers and you will not be disappointed. The food are fairly priced, though the southwestern sandwich and the nachos I ordered were a bit salty.  They are located in a very nice and modern side of town and they're space is modern, inviting, and clean. Overall we had a great experience with this gastropub and would recommend it to anyone local or visitors!",
   "Such a great way to unwind after the week. Sit outside, enjoy the drafts, flatbread, trio of dips. Service is excellent. I love the relaxed atmosphere and though I have sat inside a few times, nothing beats the spring afternoon weather and a local spot to enjoy a draft (even if it is cider). My go to for an early start to excellent weekends!",
   "Laid back environment, matter-of-fact staff that works quickly to meet requests, even in slower spurts. Live music was a great experience. Newcomer to the area."
  ]
 },
 {
  "name": "Mr. Gus'",
  "address": "6268 Atlanta Hwy, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/486bcd52-9332-11ea-8eed-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2540800675950801622",
  "source": "GoogleMaps",
  "reviews": [
   "We had dinner here for our first time and we were pleasantly surprised. Our waiter, Preston, was fantastic! He was very attentive without being in our faces all night. The food was great. The menu is certainly not a traditional Italian fare. I got the moussaka and my husband got the chicken parmigiana. Both were delicious and the portions were more than sufficient. We’ll be coming here again. We also liked that it was quiet so we could enjoy our conversation.",
   "I ate here on a Friday with a large group of people. I enjoyed my food and the group service was really nice. The starter salads were pretty tasty, I order the Tuscan Grilled Chicken and thoroughly enjoyed that as well. For dessert I had their strawberry cake it was a huge slice! The cake was delicious as well. I definitely would recommend this place. I went back yesterday to try their cheesecake and was pleased with that as well :)",
   "Nice atmosphere, like a small town Italian restaurant. Wait staff was pretty nice. We ordered the Hummus, Lasagna, and Veal Parmesan. The food is okay. Nothing really bad, but of everything we ordered, the side salad was the best food we had. They could definitely benefit from a little revitalization in the kitchen.",
   "Exceptional food and service. I have been numerous times and the food is always excellent. They have a waiter with a ponytail and a goatee who is hands down the best waiter I have seen in the 150 countries I have visited.",
   "Everything is fresh made. The hummus is the best I've ever had. A nice dedicated owner and a great staff. Don't pass this one up."
  ]
 },
 {
  "name": "City Grill",
  "address": "5251 Long Acre St #112, Montgomery, AL 36116, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/48b27362-9332-11ea-b796-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "food",
   "food",
   "food",
   "delicious",
   "food",
   "art",
   "foodie"
  ],
  "link": "https://maps.google.com/?cid=7283723130976745232",
  "source": "GoogleMaps",
  "reviews": [
   "First thing I noticed was the atmosphere, loved it.  Then we met our server, Lily, she was so friendly and very knowledgeable about the menu.  She even made some suggestions & man was she right, all the way to the dessert. The food was delicious, I tried a few new things there & I loved them. \nHighly recommend!!!!   We will be coming back for sure!!",
   "This is the nicest restaurant in Montgomery. Great food, innovative menu concepts but they keep the 'old favorites\" too. Great wine list and penultimate service. You have to try it!",
   "Went here for the first time. We had an GREAT experience at this amazing culinary gem in Montgomery! They, unlike many venues in this area, have realized that reasonable prices for superb food and service are key for a successful business that people would want to come back to for more! What a great concept! Meal & service was hands down THE BEST we have had in this city.",
   "All I can say is great and delicious!",
   "Hands down the best restaurant in Montgomery. The place that turned me into a foodie! My dad  brought me to City Grill for the first time 17 years ago. I have been a repeat customer ever since. The quality of the food and service is always excellent. I've traveled and enjoyed fine dining in larger cities like Nashville, Memphis, Birmingham, Atlanta, New York, and Chicago. City Grill remains one of my top favorites and could complete in any of the above cities. The chef is an artist. He treats the food with care and respect. Each plate is a work of art held to the highest of standards. Freshness is a top priority. The portions are large enough to meet southern expectations and are ample for the price. If you are visiting Montgomery I would recommend this place over both Central and La Jolla."
  ]
 },
 {
  "name": "Southern Comfort Restaurant",
  "address": "210 Wasden Rd, Hope Hull, AL 36043, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/48faa038-9332-11ea-9618-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7197213127372350595",
  "source": "GoogleMaps",
  "reviews": [
   "Great southern comfort food. I couldn't believe the portion size! It was easily enough for two full meals, but I somehow managed to eat every bite. Staff was very friendly and attentive. Stopping here is a must.",
   "We stopped by here during a road trip. Picked this spot due to the excellent reviews. I really wanted some good wings so we ordered those as appetizers. About 12 for $11. The wings were delicious. You could taste the smoked flavor and the BBQ sauce was all throughout the flavoring. It wasn’t like some places where they cook the wings, dip in sauce and send them out. I highly recommend the wings. \n\nFor entrees I had the chicken fried chicken and hubby had the pulled pork Cuban. My sides were Mac and cheese and gumbo. Hubby had collars greens and fries. My chicken fried chicken was cooked perfectly and the white gravy was good. The Mac and cheese was okay. It was super cheesy but not really seasoned. I mean it was good but not like grandma’s cooking good. Hubby liked the gumbo (okra based) and greens. No complaints there. \n\nOur fries came out a lot later than the food but they were hot and fresh and tasted okay. \n\nWaitress was nice. \n\nThe only reason I’m deducting a star is due to cleanliness. It was trash everywhere all over the floor and tons of tables that weren’t bussed. They weren’t even busy. Employees were standing around talking or folding napkins. I mean it was a lot of trash on the floor. It really detracted from the decor. The other thing was it was sooooo humid inside. Every time someone came in and left a nice breeze came through but other than that it was hot as heck. I’m a normally cold person and I had to use my menu to fan. \n\nIt was no circulation because of that either. \n\nAll in all I would definitely return again if I was in the area.",
   "Food was excellent. I asked the waitress what she suggested and the first thing out of her mouth was the pot roast. She couldnt have been more right! You could tell from every part of the meal that everything in the establishment was good. Prices were superb also!! Would definitely make this place a regular if I were a local.",
   "Absolutely delicious! I chose this place because it's close to the I85/I65 intersection. Met friends from Birmingham there. Had a lovely reunion. Angel was such an enjoyable, personable server. Love love love",
   "Very nice little country restaurant. Very good country style food and very nice employees..... one of the waitresses likes to joke around and that's right up my alley...."
  ]
 },
 {
  "name": "Asia Bistro & Seafood",
  "address": "7839 Vaughn Rd, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/493f71d2-9332-11ea-b2ba-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15289180950287152909",
  "source": "GoogleMaps",
  "reviews": [
   "Food and service was excellent.",
   "We have dined with this family for 30 years. First it was Bamboo Garden's in Normandale, then they moved to McGehee Rd. as Emperor's Garden. Asian Bistro continues to have great good, and wonderful service. Their take - out is great, just miss the service and family.",
   "Through Doordash, I ordered wings, Pad Thai and miniature spring rolls. The Pad Thai was dry with little chicken. The wings weren't fresh and the spring rolls were soggy. I'm so disappointed.",
   "This the only Chinese place I like to go in Montgomery. I have been eating with this family for over 20 years (they had a different restaurant before this one). They never disappoint. Everything on the menu is great - but my favorites are the hot and sour soup and Szechuan chicken. The service was exceptional first and foremost. The food was tasty and exuded freshness. I highly recommend.",
   "The only thing they got right is the stream rice. They used chicken cold cuts for the chicken in the pad Thai. Gross. The pad Thai was used with a different apice then normal. The curry was really thick and gross looking. It's suppose to be runny.\nNever again."
  ]
 },
 {
  "name": "Mama's Sack Lunches",
  "address": "21 S Perry St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/498d43d0-9332-11ea-ae02-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=61771591306674773",
  "source": "GoogleMaps",
  "reviews": [
   "Discovered this breakfast place on a recent trip to Montgomery. Reviews were great so I decided to check it out. Reviews did not disappoint. Food was delicious. Service was great. Mama’s not around anymore but when I asked the owners they said they were all “Mama” which I could appreciate having been raised in the south. Tough to leave here hungry.",
   "Downhome breakfast in warm homey digs.  First visit and loved it.  Friendly staff that make you feel at home. Great breakfast food. No frills and inexpensive.",
   "Awesome food, great service a must stop place for lunch. Taste like home cooking at it's best",
   "Amazing place! I loved the welcoming atmosphere and how the staff seemed genuinely happy I was a customer. If I’m back in town I will definitely go back for seconds!",
   "Awesome breakfast with eggs grits and smoked sausage,lots of cheese and a biscuit,I need a nap."
  ]
 },
 {
  "name": "Zoës Kitchen",
  "address": "2960 C, Zelda Rd, Montgomery, AL 36106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/49e37a82-9332-11ea-9155-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=10229482353533758057",
  "source": "GoogleMaps",
  "reviews": [
   "Never a bad meal here. Many food options. Always fresh! Staff here are very friendly. Tables and restrooms are quite clean. Really nice atmosphere. A favorite place to stop for a quick meal that isn't fast food.",
   "Cauliflower rice, roasted vegetables and chicken kabobs. Delicious!",
   "Always good food.  Had the tomato bisque which was very good.  I miss the Gruben sandwich.  Wish they would bring it back.",
   "Very good food. Service was good. Food was fresh. Didn't know what to expect, but what a pleasant surprise. And end with a chocolate chip cookie!!",
   "We took a chance here one day when we were dying for chicken salad chick and the place was closed. So we headed over to Zoe's to see what we could get. I ended up with these little steak wraps that were delicious and that my daughter kept stealing off my plate. The coleslaw with the feta cheese was also great. The service was very friendly and efficient."
  ]
 },
 {
  "name": "Capitol Oyster Bar",
  "address": "617 Shady St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4a29d234-9332-11ea-ba5e-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13568282527974672341",
  "source": "GoogleMaps",
  "reviews": [
   "Don’t let the out of the way location fool you, this place has great local food and pleasant staff. They’re happy to suggest what’s popular if you’re unsure of what to get. The food was amazing. Never had better fried scallops or alligator. Go give the place a try especially if you’re just in town for a little bit and like to sample the unique restaurants.",
   "The fried crab claws and cheese sticks are AMAZING! Tons of meat on the crab claws and the BEST cheese sticks I have EVER had! We always order both. My husband likes the ribeye. We both love the cheese grits. We both thought the cheeseburger was just okay.\n\nThe service is always great, especially the bartender!\nThey have a changing assortment of beers on tap.\nWe will definitely be back again!",
   "Wonderful food, service, and atmosphere!  So glad we went.  Great place to hang out.",
   "That's some tasty seafood. \n\nOverall, it's a pretty good joint to grab some seafood.  It has a pretty chill vibe, and a good staff.  \n\nI'd recommend this place to anyone, but I would also tell them that it took a little longer than expected to get our food.  That's not a bad thing, but it's definitely something I want to know before I'm looking at my watch wondering where my food is.",
   "I love the Oysters Rockefeller, try it out!  My brother isn't a seafood guy so he ordered the ribeye not having high expectations given the specialty of the restaurant. We were both blown away at the amazing flavor of that steak! I have yet to find a better Oyster house that's not on the coast."
  ]
 },
 {
  "name": "Noodles Cafe",
  "address": "8123 Vaughn Rd, Montgomery, AL 36116, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4a70c6c6-9332-11ea-95ae-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "unique",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=488788183879061346",
  "source": "GoogleMaps",
  "reviews": [
   "Food is really delicious! The restaurant is pleasantly decorated and the staff is friendly and helpful! Pictured is the Sampler Appetizer, Special Chicken Noodle Soup, and Thai Fried Rice with Chicken. Yum!",
   "The Red Curry was nice and hot and spicy. It had lots of good vegetables. But I had to add some extra spice to it. If you don't like spicy food  I would ask for it less spicy.",
   "This place is absolutely wonderful. \n\nThe atmosphere was nice, our waitress was amazing, and the food was so good. They have lots of vegetarian options! Just about all dishes can be made with tofu or vegetables. \n\nThe salad that comes with the lunch combination has the most unique dressing. Also, the lunch portions are the perfect size.",
   "Noodle cafe has the best Thai food in Montgomery hands down! I have lived in 13 different cities so trust me I have tried a lot. \n\nFresh ingredients, great atmosphere, and exceptional customer service. 25*",
   "I ate lunch there and enjoyed the Drunken Noodles. I look forward to coming back to sample other items from the menu. There was no waiting. The food tasted fresh and the restaurant was clean."
  ]
 },
 {
  "name": "Simply Southern Cafe",
  "address": "3457 McGehee Rd, Montgomery, AL 36111, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4ab9a7f8-9332-11ea-a1af-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "drink",
   "food",
   "delicious",
   "food",
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11226833542394444734",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food! Absolutely delicious. Authentic southern cooking at it's best. My family loved it. Everything we had was really good. Definitely worth a stop!",
   "If your from Montgomery and your looking for a good soul food spot you come here. Their menu is via Facebook but you can also call the number listed for the audio menu as well. Prices have become steep over the years but portions and food are good. Desserts are extra and for the price should be included with a drink. Expect to spend $15 on a meal each. Wait time varies as during lunch you can expect to wait for up to an hour in the buffet line that is not self serviced. Also be sure to not be on your phone as they won’t service you otherwise. People are generally nice but it’s a face pace space so it’s good to know what you want ahead of time before arriving.",
   "Everybody brags on this place and I can see why. Their food is delicious the best baked Mac n cheese I've ever had. The owner should start a franchise. Best soul food ever 🤞",
   "I wanted something good to eat coming from Gulf Shores and this is exactly what I got. Everything was great. I can't wait to get back in town to go eat again. The service was great and they had a live band.  Awesome.",
   "Great service! Food was delicious! The line was long but moved very quickly. I will definitely be back 👌🏼😁"
  ]
 },
 {
  "name": "Dreamland BBQ Montgomery",
  "address": "12 W Jefferson St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4b0198d4-9332-11ea-98b7-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "brewery",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1653644313013102385",
  "source": "GoogleMaps",
  "reviews": [
   "Phenomenal barbecue in a great space. Really gives off a good baseball brickyard vibe.\n\nThe food is fantastic-I got the pulled pork sandwich and the potato salad. Highly recommend. They have good beers too, plenty of Alabama options. \n\nAnd do make sure to have the banana pudding. I haven’t had a good banana pudding in years, very nostalgic.\n\nIt does get really crowded-we are at the bar, which worked perfectly, but if you want a table, call ahead or be ready for a wait. There’s a decent amount of street parking nearby.",
   "What a wonderful find in downtown Montgomery!  A great barbecue restaurant with super customer service and delicious food, especially the ribs!  It also offers a nice selection of in-house, local, and bottled beer,  plenty of TVs to watch the games, as well as ample seating. Their barkeep, Amanda, took great care of us and never left us hanging! Will definitely be back for more!!",
   "The spicy rib wrap and mac n cheese were delicious. Felicia was a lovely server. The hotbox honey porter from Railway brewery went very well with the wrap. The bread pudding was to die for. Would love to visit this place again--excellent southern BBQ!",
   "Absolutely phenomenal location. One of the absolute best places I've had the pleasure of dining at. Extremely high quality food, enormous portions all for a fantastic price. Our server was Cindy and she was the sweetest woman ever, and took the time to go over several menu items and provide suggestions and talk to us. A truly enjoyable experience as the establishment has a rich history and wonderful aesthetic. Thank you for providing the four of us this experience, as we won't forget it during our road trip.",
   "Awesome BBQ with friendly service! The place was packed but within a couple minutes they seated us. We had combo plates with big meaty ribs, pulled pork and chicken with sides of potato salad, baked beans, and fried okra. We were unsure of their BBQ sauce so they offered to put it on the side. It's a little tangy/spicy but good. This is definitely a place we'll return to."
  ]
 },
 {
  "name": "Little Donkey Mexican Restaurant - Montgomery",
  "address": "7720 Eastchase Pkwy Ste B1, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4b53b0a8-9332-11ea-ba76-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "creative",
   "drink",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=4674351567675667241",
  "source": "GoogleMaps",
  "reviews": [
   "Had an early dinner here tonight.  The place is modern and doesn’t look like a Mexican place at all.  The staff was pretty good and the food came out quickly. I had the fish tacos - that’s the reason for the 3 score - the fish tasted horrible.  It had a bad flavor. Other than that, the salsa is amazing along with the Mexican Street corn - that was fantastic.  The food was well-presented and other than the fish. It was good. Also, pretty pricey - was just me and I only had a Pepsi, so no alcohol and it was $30 before tip.\n\nI would go back, but next time get the fried chicken.\n\nUpdate- I went back and had the fried chicken.  I think maybe the cook was having and off night, because, sadly, it was overcooked.  Again, however, the sides were the star of the show. Some sort of smashed and fried potato with brown sugar and got the street corn again. The fried chicken comes with a nice little palate cleansing vinegar doused veggie mix and the vinegar and habanero sauce to put on the chicken is really super.",
   "Stopped in for a work lunch...name sparked my interest. The nachos are AMAZING! So many flavors coming together.",
   "Heard so much about this place. Salsa was great, food and service was ok, but the a/c was out and apparently had been out for a while because there was a portable unit up front by the reception area. Will have to try it again when that problem is solved.",
   "I've been a frequent at Little Donkey since it opened a few years ago. Overall, I've never had a bad experience. The staff is always cheerful and a pleasure to be around (even when my two 2-year-old twins are going crazy). \n\nThe food is delicious, creative, and a good price. By far some of the best places in Montgomery. We will continue to come here so long as they don't mind the occasional flipped drink from a 2-year-old. \n\nKeep up the good work!",
   "Casual, bright atmosphere...good choice if you are shopping in Eastchase or passing through  Montgomery (right off 85). REALLY enjoyed the guacamole...would have been happy making a meal off of that! Tight quarters in the restaurant but they do have outside seating. Nice beer and cocktail options (I enjoyed the \"sparkling\" margarita with added Prosecco 😊). Will be going back for a second visit!"
  ]
 },
 {
  "name": "Pies & Pints - Montgomery, AL",
  "address": "7216 Eastchase Pkwy Suite D-31, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4b9bde28-9332-11ea-81c6-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "food",
   "food",
   "delicious",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=8997323688595546127",
  "source": "GoogleMaps",
  "reviews": [
   "Beer and pizza. Really GOOD beer and really GOOD pizza. Whats not to love? Huge offering of local and national craft beers on tap plus a nice list of bottled beer. They have some great specialty pizzas like the Hot Mama and Steak and mushroom. Loved it.",
   "I absolutely love Pies and Pints! Great beer selection and the option to sample and order half pours. The bartenders are friendly and knowledgeable. Food is delicious and service is outstanding. I recommend Pies and Pints to anyone who loves beer and pizza!",
   "One of my favorite places in Montgomery so far. It was a fun atmosphere. Fair prices, awesome server with a sense of humor and yummy food! I couldn’t ask for much more than that.",
   "Truly awesome pizza. Perfect crust. Not as greasy as other joints. Sauce is not too hot but has bold flavors.  The Cuban sandwich was delicious also.huge difference between now and the last time that we ate there. Definitely returning.  The service was spot on also.",
   "I'm a huge fan of the draft beer selections and the pizza is pretty good too! My one and only complaint might be the time it takes to get your order to the table makes it difficult to bring my kids. Other than that, love the place!"
  ]
 },
 {
  "name": "Island Delight",
  "address": "323 Air Base Blvd, Montgomery, AL 36108, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4beb36f8-9332-11ea-925b-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12921083067687176916",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of the best rated restaurants in Montgomery and it certainly deserves it.  The food is spot-on authentic.  It pains me every time having to choose between the jerk chicken and the ox tails.  Veggies are also great, as are the plantains.  They also have a great selection of Jamaican sodas.  If you haven't eaten here, definitely give it a try.",
   "This is one of my favorite places to eat.  The food is fresh and they have a 99 sanitation rating.",
   "Google said opened on Saturdays and they were closed! This place is highly recommended but the place is always closed.",
   "Very good food for a great price!",
   "Fantastic jerk chicken. So much flavor! Rice and beans were great, along with the plantains and potato salad. Very nice people. They clearly love their food, as it was exceptional"
  ]
 },
 {
  "name": "San Marcos",
  "address": "61 N Burbank Dr, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4c37a98a-9332-11ea-85bd-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=15415279012182426625",
  "source": "GoogleMaps",
  "reviews": [
   "Great food, staff is totally amazing. Food is always cooked to perfection. I moved to Alabama from San Diego, CA and i was searching for some authentic Mexican food. I tried many places, ( which i will not name ). San Marcos hit the 🎯. Thank you!!❤",
   "The staff are all very nice! I love the food. Some of the best Mexican food I have ever had! The cheese dip is my favorite. Very clean place. Very attentive waiters. 10/10 would recommend!",
   "Good Mexican food with great lunch prices. Everyone is always friendly and the food is quickly at your table. The chips are thin and crispy.",
   "Good Mexican Cuisine at an affordable price. The salsa is little spicy, but I prefer it that way. The decor of the place needs a little sprucing, but the customer service outweighs that minus. I will visit again.",
   "Placed a to go order, came back wrong. Went back and remade it and still wrong. Not the first time this has happened. Simple orders they can't get right. I don't have time to run back and forth on my lunch break.  I'm done with them."
  ]
 },
 {
  "name": "La Zona Rosa Hillwood Mexican Cafe",
  "address": "2838 Zelda Rd, Montgomery, AL 36106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4c7d8c24-9332-11ea-b5ec-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "affordable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9435696144912387378",
  "source": "GoogleMaps",
  "reviews": [
   "I've definitely had better Mexican food at a hole in the wall place...Where do I start!!!Well the salsa was too hot  I mean I like spicy foods but whatever. I ordered a taco salad and had to pay extra for everything that should have come on the salad.And my server barely understood English.. I still left a tip but I definitely won't be returning",
   "Incredible!!! Grear tacos. Fish, shrimp, steak taco all incredible. Great guacamole! Chips fantastic. Salsa is grade A. You will not be disappointed! This place is fabulous! Great service. Cool atmosphere. I had 3 different tacos and guacamole and chips and salsa and it was all fantastic. I will be back!!! One of my favorite Mexican restaurants if all time!",
   "The whole family LOVES La Zona Rosa! The food is fresh and exciting and the menus are constantly updated. If there's something you missed on the old menus, La Zona Rosa's staff will dazzle you with a mountain of suggestions but if that doesn't suit then they are more than prepared for those picky eaters 😁",
   "Called in 5 orders and they were ready for me when I arrived 15 minutes later. Everything was bagged according to order and correct. Affordable prices. Great atmosphere. Friendly service. I will be going back.",
   "Great service and I think one of the best Mexican food restaurants in Montgomery. Everyone should give this place a try, you won't be disappointed. They also offer a Military Discount."
  ]
 },
 {
  "name": "Sundown",
  "address": "3416 Atlanta Hwy, Montgomery, AL 36109, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4cc2d2a8-9332-11ea-a41d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "family",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18362290330943333437",
  "source": "GoogleMaps",
  "reviews": [
   "Seriously delicious food, and great service! We were just driving through and decided to stop based on the reviews. We were definitely not disappointed. If they aren’t busy when you get there, don’t take it as a bad sign. I promise it’s tasty!",
   "Enjoyed my lunch. Meat & 2. Roast beef/gravy, rice/ gravy, butter peas, Texas toast & sweet tea. (Tea is good... but if you're a lover of pure sugar water ... then you probably will be adding sweetener to tea. Tea or water comes with lunch specials. ($9.99+ tax) a little high for meat & 2... my opinion, was good. Wasn't a big fan of butter peas due to seasoning used when cooking. Food was hot, tasted fresh & server was attentive & asked several times if I needed anything.\nI've gone to this \"same building as a restaurant\" for over 25+ years & watched it change. By far this is the best physical condition I've ever seen in. 1st meal today since its changed owners so can't compare food to the old Sundown East. They are different, yet still serve some of the main items that Sundown\"EAST\" was the best at cooking. Excited to see it reopened & feel it too will be around for a long time.",
   "Special for Vegan and British foods. Their authentic food taste is loved by the customers. These foods are extremely delicious. Some of their popular dishes are Fish and Chips, Meat Pies, Beef Pies, Vegan Massaman Curry, Sausage Rolls, etc.",
   "My family and I ate breakfast there Saturday, February 15th, and we all got food poisoning, doctor verified food poisoning. The only foods we had in common were the eggs and grits. \nWe did enjoy the food and service but we will not be returning.",
   "Newly remodeled due to having new owners and super delicious. The service is spectacular, prices reasonable, and the food is very good. Had the opportunity to try their hot onion rings as a new product and they were spectacular. The menu is your Montgomery rotational meat and three but above average quality. Highly encourage you to revisit this location if you have been away."
  ]
 },
 {
  "name": "Mr.Chen's",
  "address": "5461 Atlanta Hwy, Montgomery, AL 36109, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4d0d23b8-9332-11ea-a663-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4994267241778344766",
  "source": "GoogleMaps",
  "reviews": [
   "Really good Chinese with a few authentic dishes in the menu. The attached Asian market has everything and anything you need. Come get some great Chinese from this place Montgomery!",
   "This place is awesome! It’s a well stocked grocery store with all things Asian and it has a fantastic restaurant. There is no buffet here because everything is prepared fresh. Our kids liked the sweet and sour chicken and loved it. My wife got beef with vegetables and I got pig intestine, and I actually liked it. The intestine was steamy, squishy and digested well.",
   "Food was really good! Best egg drop soup I've ever had. It is also cool to look around in the store and find new snacks and candy to try. Try a slushy! You won't be disappointed :)",
   "Best kept secret in town. This oriental supermarket / Restaurant has the freshest Chinese food around. Mr. Chen’s is legit for authentic Asian food and at great price.",
   "Very nice restarunt and an Asian market. It was neat too look around the market before eating. Very good service as well. We got our food really quick and it was delicious!"
  ]
 },
 {
  "name": "Mellow Mushroom",
  "address": "75 Commerce St Unit A, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4d543eee-9332-11ea-af55-14b31f159f22.png",
  "tags": [
   "free",
   "unique",
   "eat",
   "food",
   "kids",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10757840396433955313",
  "source": "GoogleMaps",
  "reviews": [
   "I really enjoyed going to this restaurant. The pizza was good, but, what really made this place great for me was our server. It was this dirty blond haired guy with long painted fingernails and he was awesome. We ended up having a decent conversation with him and, because we stayed so long, he gave the person I was with a free lemonade right before they closed. He was so funny and so friendly. I wish waiters everywhere would be like him.",
   "Eat at the Mellow Mushroom. \n\nThis place was a unique experience that I did not regret. They had a nice range of beer selection, a reasonable sized menu, and just phenomenal service.  When I hear about co-workers coming to Montgomery, this will be on my list of musts. \n\nI live in Europe, and love the pizza there. The crust, the sauce, the overall composition deliver a flavorful bite everytime.  The Mellow Mushroom gives an American version of that very same idea. The toppings were a lot more plentiful, but every bite was an explosion of flavor. \n\nThe service was great! The bartender was incredibly helpful and recommended the half and half option when I asked about two different options.",
   "We've been 3 times now and never been disappointed. Fantastic pizza and decent service by a somewhat young staff (generally younger staff have lesser professionalism.) So far, we have enjoyed ourselves each time and have no complaints. Not a home-run but a decent triple.",
   "I love stopping in for a quick bite at the taco bus anytime I find myself in Huntsville. I don't know why being on a bus makes it better... but it does. You board the bus, go to the back and put your order in. There are a few seats inside or you can sit in the covered area outside.  The portion sizes are substantial, the food is fresh, the flavor is great, the service relatively quick if you don't have too large of a group! It's a win-win situation.",
   "Great food and great Atmosphere! Our server Debra was AWESOME and a few of the other servers remembered us from our last visit, which made my family and I feel AWESOME! Debra even played a few games with the kids while we waited for the rest of my family to arrive!! If you ever go ask for Debra!!"
  ]
 },
 {
  "name": "Jan's Beach House Grill",
  "address": "850 Eastern Blvd #850, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4db32812-9332-11ea-bec2-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "family",
   "music",
   "eat",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2462310607542847483",
  "source": "GoogleMaps",
  "reviews": [
   "Food was fantastic, spiced just right, and extremely flavorful. Had a live band playing great classic music. Good vibes and a down home type of place.",
   "My wife and I 1st time and we enjoyed. Now we have to go back with the family... I know my mom would love it.",
   "We  asked to be seated at a different table than the hostess wanted (wanted to see music). She was rude and had an attitude. We wanted to order alcohol so she would send over a waitress since she was underage. She never explained that and seemed to get more rude when we were at first confused . No one came, never acknowledged that we were even in the restaurant. I believe the hostess set this up with the waitresses. After 30 minutes of no one making eye contact or speaking we left. Other people who came in after us were waited on. When I approached the hostess about getting some service she just stared at me.  Life is too short to be treated so rudely on a special night out. Jubilee Seafood got our more than $100 tab and were more than gracious. Needless to say we won’t be returning to Jans Seafood.",
   "Checked online at 11:00 am for daily lunch special, roast beef was one of the meats. Arrived at Jan's around 12:15 and roast beef was crossed off as one of the meats for lunch special. Took 10 minutes before waitress came to take order. We placed order and received salad in about 5 minutes after another 15 minutes waitress came over and told  us they were out of the mash potatoes we ordered that was it!! We left!! The roast beef that was online as a lunch special meat that wasn't available, then out of mashed potatoes!! Jan's has gone down hill since it first opened. Hadn't been there in a couple of months because service was slow last time we went now running out of food. Jan's is crossed off as a place to eat. 11/12/2019",
   "Thank you so much for making my great -Aunt’s 99th birthday wonderful! We had so many family members and your waitresses were able to take care of everyone in a timely manner.  We appreciate everything so much!  Your food was delicious!"
  ]
 },
 {
  "name": "NYC Gyros",
  "address": "15 Commerce St #3502, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4df624ae-9332-11ea-b251-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "eat",
   "eat",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16313375668845090305",
  "source": "GoogleMaps",
  "reviews": [
   "The food here is pretty awesome. However, the prices are a bit high. Gyros are budget friendly when you travel the Middle East! Not sure why they price them so high here!",
   "I went with a group of friends to eat here for lunch. The special gyro burger is really good. It's a meat patty topped with lamb meat. It is delicious! Ordered some chicken wings which was not to my liking because it smelled like chicken however it tasted good. It's a nice place to grab a quick meal. Satisfied!",
   "We got a chance to eat here . I must say dont let the interior turn you away.  When i walked in,  i literally forgot that I was in Alabama,  as they really did a good job embodying the essence and culture of New York!  The staff were all very kind and food is made fresh !",
   "The food was GREAT!! If you need a quick bite for good prices, come here. You will leave happy and full. There seems to be limited seating tho so be wary of that. 10/10",
   "Excellent food!! Love the gyro burger and falafel. All their food is prepared well and very tasty. The staff is very nice and polite. They also have a food truck that travels around Montgomery. If you're in Montgomery and don't know where to eat go to NYCGyro and you won't be disappointed."
  ]
 },
 {
  "name": "Chris' Hot Dogs",
  "address": "138 Dexter Ave, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4e3c2e90-9332-11ea-ad6d-14b31f159f22.png",
  "tags": [
   "history",
   "food",
   "food",
   "historic",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13293187732322567120",
  "source": "GoogleMaps",
  "reviews": [
   "Surprised me how good this was. I guess there is a reason its famous. I was skeptical...the place is a true dive. To be honest, it didn't look very appetizing either. The famous hot dog is chili and sauerkraut. I reluctantly took a bite. Turns out it is very tasty!! I have been to famous hot dog joints all over and this one is right up there. Set your expectations tho. This place is the definition of \"dive\".\n\nOne more note. The staff was super sweet and that surprised me. I expected them to be indifferent like these kind of places often are but they weren't. The owner (manager?) chatted me up, asked where I was from, etc. - the counter help (woman), made sure I had what i needed.\n\nI am impressed. I was very skeptical but if the place is good enough for Presidents and celebrities...well it was worth having an open mind.",
   "Chris’ Hogs was absolutely amazing. It’s a small hole in the wall with good food and great service. My Husband and I was visiting Montgomery from Charlotte, NC and stop by for a great hot dog and to visit the historical restaurant that’s been around 103 years. The servers greeted us with a smile and the owner came out to introduce himself and tell us about the history of the restaurant. Love this place.",
   "Outstanding food from a place that has served everyone from hank Williams to sitting presidents. The chili sauce is a bit sweet but balances perfectly with the salty dog and sour kraut. Do yourself a favor and ignore the cleanliness and enjoy some good food.",
   "It's an old historic place. A different twist on hot dogs and burgers..  a little messy, but it was good food. \n\nThe staff members were polite and my server went above and beyond what I expect from a server even in up scale places.  I was please with the experience.  No complaints",
   "Amazing food and amazing staff! They were so friendly even though we came in late and they were probably ready to go home! Our server was fantastic and made sure everything was up to par! The burger I got was the best I've had in a while! Congrats on 100 years!"
  ]
 },
 {
  "name": "Osaka Sushi Bar",
  "address": "8860 Minnie Brown Rd, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4e85489e-9332-11ea-8f49-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15464373520956929100",
  "source": "GoogleMaps",
  "reviews": [
   "Best dumplings ever!   Combo fried rice is delicious.  Can't wait to try something new on the menu.   We will be back!!!! Worth the drive across town.  Waitress was super friendly.  Got our drinks right and kitchen was on time with appetizer and entrees.  Kudos to every one that worked today!!!!",
   "Best sushi around. Great service and good food!",
   "Osaka is the bomb. I've never been dissatisfied with the food or the staff. They are very friendly and their food is as good as any place in the city. I highly recommend them.",
   "Amazing food with good service and decent prices. The rolls were presented very nicely. I had the volcano roll (front), spicy tuna (back right), and philly (back left).",
   "I always enjoy my time here. The food is always delicious and the staff is always super nice."
  ]
 },
 {
  "name": "Kabuki | Japanese Steakhouse",
  "address": "7834 Vaughn Rd, Montgomery, AL 36116, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4ecd2754-9332-11ea-bdef-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17504221154302754534",
  "source": "GoogleMaps",
  "reviews": [
   "Took my sister for her birthday. Very entertaining and fun! Fantastic customer service that went above and beyond from “Happy”.  He definitely made us happy! Highly recommend, especially for a celebration!",
   "One of my most favorite places! Great food. Entertainment. Great food at great prices! I love the habachi shrimp and chicken.",
   "Really good food...you get what you pay for",
   "Enjoyed the food here.  Service was good.  The restaurant was clean and looked nice.  I did not do hibachi but sat in the dining room.  Food came out fast.  Had great flavor and portions for the cost.  Will be back",
   "Service was great as usual. Chef was very entertaining. Food was good, although nothing spectacular. As a matter of fact, I believe this time around it was slightly over-seasoned. The filet that was requested medium temperature was well-done and had a mushy texture to it. The rice had a slight char to it in places. But overall it was pretty good."
  ]
 },
 {
  "name": "The Seafood Bistro",
  "address": "1651 Perry Hill Rd, Montgomery, AL 36106, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4f130a18-9332-11ea-a5c8-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14054275689658139602",
  "source": "GoogleMaps",
  "reviews": [
   "For the amount of food you get, you cannot beat the price. The staff was very knowledgeable and friendly. This place is simply amazing for the seafood lovers!",
   "Food was great as always. Miss the old location tremendously! Owner's friendly & awesome to chat with.",
   "I ordered the royal red bag and whitefish platter and OMG was so good! I paid online and they brought it out to my car. Glad they are open, my new favorite seafood place",
   "The food here is always great. However, since they've moved we have had poor experiences over and over again. The wait staff is always changing. There seems to be no consistency, only new faces. I'm open to change and willing to adapt, but with new help comes training. It seems they are in a perpetual training state. Our orders have been continually incorrect due to this. Despite making this known to management it, coupled with generally poor service, it continues to happen. Not only this, but they are inconsistent with how they honor their commitment to the discount cards. Myself and many co-workers have had this continual experience in which there is nothing posted anywhere or exclusion on the Bear discount card (that I purchased mainly to give SB more business) to say you don't get the discount on a lunch special. I'm continually disappointed as are many I work with. Until Paul changes things, we'll have to remove this from our lunch rotation.",
   "Lots of food and it was really good!  Owner was very nice and came by to check on us.  Good atmosphere."
  ]
 },
 {
  "name": "Lek's Taste of Thailand",
  "address": "5421 Atlanta Hwy, Montgomery, AL 36109, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4f5e1d0c-9332-11ea-867c-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10771883423395658681",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent little restaurant in Montgomery.  I stopped by there late Monday evening.  They are located in a strip mall off the main road.  They are easy to find.  I had the chicken satay which is awesome.  The sauce and the cucumber salad was very good.  I also had the chicken massaman which was also very good.",
   "My family and I have always enjoyed Lek's. I have had Pad Thai at multiple restaurants in different states and it has never been as good as Lek's. I'm addition to that the spring rolls are also amazing. To top it off the staff is very friendly and attentive. Every time we visit Montgomery, Lek's is a must stop for our family.",
   "We absolutely enjoyed everything. The restaurant was full and looked like they had quite a few regulars. Service was prompt and wait staff were very friendly. \n\nWe ordered and the food was brought to the table quickly. \nI ordered the red curry, medium spicy with chicken and Thoroughly enjoyed every bite. \n\nThe chicken was very tender and I was impressed with how large the chunks of white meat were. \n\nMy father had the basil with beef and very much enjoyed the flavor and consistency of the brown sauce. \n\nWe also ordered two cups of the coconut soup with shrimp and were so impressed at the freshness of the shrimp. The soup had amazing tangy flavor and each cup came with three large shrimp! \n\nWorth the money for sure.",
   "The staff was very friendly and answered our questions and helped us decide what to order. I got the spiciest curry option they had, but personally didn't think it was super spicy. It was very delicious though. I really liked the Thai Tea as well.",
   "A dining experience! I read the reviews and had to check this place. My daughter and I stopped in and were asked if we had reservations. We said no and were told they would have no openings for another 2 hours, but that there were two openings at the bar. So we headed to the bar.When you read the menu, your taste buds will start to dance. Everything sounds amazing. We ordered drinks and a few apps. When the food was served, now your eyes are dancing."
  ]
 },
 {
  "name": "Shashy's",
  "address": "1700 Mulberry St, Montgomery, AL 36106, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4fa6bf0a-9332-11ea-a2f7-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13352713547122493383",
  "source": "GoogleMaps",
  "reviews": [
   "Really good bakery that has standard breakfast fare as well as some surprise specials. The corned beef Benedict was a bit salty and the poached egg was over cooked. Service was slow. I’d give it another try and hope for the best though.",
   "Shashy's Bakery and Fine Foods is the best around town. \n\nI have dependably visited this present Shashy's Bakery and Fine Foods to eat bread and different cakes. I truly love simply hanging in here drinking some espresso with a bread as an afterthought. \n\nShashy's Bakery and Fine Foods have in every case new and hot breads and baked goods regular. They are scrumptious and I cherish them. Best bakeshop around the local area. They keep the espresso decent and basic however despite everything I like it. \n\nThe place is additionally astonishing. The landscape and the aroma. It truly loosens up you when you go there. The place is likewise pleasant and slick. The staffs were astonishing. They were decent and pleasing. Not surprisingly for a bakeshop. \n\n5 stars for Shashy's Bakery and Fine Foods. Will truly prescribe this bakeshop to my companions.",
   "Stopped by for breakfast while visiting from out of town. It was fantastic! The food was fresh and delicious. I could believe how quick the food was ready. Service was great. The cheese biscuits were to die for! Not to mention they have a bakery full of mouth watering pastries. I had to grab a cookies and cream cinnamon roll on the way out. Wow!",
   "The real star of this restaurant is the bakery. The baked goods are amazing. We ate breakfast here for the first time recently. We both got Western omelettes. I felt my omelette was a bit undercooked and had weird vegetables in it. I expected onions, green peppers and maybe mushrooms. There were orange peppers, red peppers and not much cheese instead. The cheese grits were good and the homemade white bread was terrific. Our waitress was the sweetest, kindest young lady, and very efficient, even though she was basically running the restaurant alone. The cook appeared to berate her, where we could hear, for allowing us to substitute the cheese in our omelettes. Maybe I heard wrong, but she definitely was arguing with our poor waitress. They have an extensive lunch menu I'm looking forward to trying.",
   "Breakfast Thursday morning was great. Food cooked just right. Service was friendly and helpful.  Thank you Bo. Lunch Monday was even better. Loved the Silver Dollar sandwichs with fried Green tomatoes / bacon and the  smoked pork loin. Shrimp Gumbo was awesome! Loved that I got to met the owner, thank you for the wonderful service. Atmosphere was calming but busy. Desserts, I can't say enough. They are awesome! We'll be stopping by again. "
  ]
 },
 {
  "name": "Wasabi Japanese Cuisine",
  "address": "117 Coosa St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5001b074-9332-11ea-a20b-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=11897070175115107877",
  "source": "GoogleMaps",
  "reviews": [
   "This is quaint little restaurant. They have great sushi and one of the best soft shell crab appetizers I've ever had! The service is really nice as well. And if you're ever in the mood for sake, this is a great place to go!",
   "I asked a server at the Aviator if this place was any good. She said it was excellent so I decided to give it a try.  Not too bad, but not great either. The sushi rolls are small for the price, but pretty good. The sushi (2 piece per order) are tiny for the price.  Overall, food quality is good, though. The service is akin to a Chinese buffet. I was asked what I wanted to drink even before I sat down and as soon as I sat down I was asked if I needed a couple minutes to look at the menu. So overall it’s not bad, but not good enough to come back.",
   "I went during lunch. Got the chicken and shrimp combination hibachi combo. It tastes really good but I paid $15.30 for maybe a cup of food. Kobe in Eastchase gives you 3 times more food. I will never go again to Wasabi! What a rip-off",
   "Awesome restraunt. Everyone was nice and eager to serve you. Try one of everything you will not be disappointed. Nice bar selection and Sapporo on tap.",
   "Friendly service, delicious sushi and miso soup and hibachi. Wouldn't recommend a cocktail unless you order something very specific. The cuisine, atmosphere, and service made for a good experience."
  ]
 },
 {
  "name": "Davis Cafe",
  "address": "518 N Decatur St, Montgomery, AL 36104, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/504b3cd0-9332-11ea-9140-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "family",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8794786388480815683",
  "source": "GoogleMaps",
  "reviews": [
   "The food is GOOD!😋You have to try the Potatoes salad, it's homemade. You can tell that everything is made with Love and attention. I try everything on my family plate. We even took desserts home.",
   "The food was just like going to my grandmother's house. Awesome, simple southern comfort food at it's best! The menu is simple and changes daily. We had the fried chicken and vegetable plate. Perfectly seasoned and very tasty. Very clean, simple decor, and family friendly, welcoming atmosphere.",
   "Absolutely loved the place, most aunthintic down-home style fried chicken, corn bread and fixins I have had in a long time. Extremely friendly staff and welcoming atmosphere as well. Dont pass up this one, these places are almost all gone.",
   "Delicious! I didn't have to add anything to it, though customers with a sweet tooth might want to add sugar. I got it with almond milk (they have soy as well) and it's very creamy and smoothI highly recommend Cafe 153 if you're in the Bridge Street area!Right off, my five star review does not include their bagels or croissants or waffles",
   "Believe the hype! We took a chance and went here on a trip to the Equal Justice Initiative museum (which is fantastic too!) and we were blown away by the amazing food. It is so so good!"
  ]
 },
 {
  "name": "LongHorn Steakhouse - Curbside To Go Available",
  "address": "4095 Eastern Blvd, Montgomery, AL 36116, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/508f23da-9332-11ea-bdb3-14b31f159f22.png",
  "tags": [
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18132444949318423116",
  "source": "GoogleMaps",
  "reviews": [
   "I ordered by phone and the lady on the other end did so well she made ordering easy and pleasant. She said once I get to the restaurant to call and she would bring it out. I ended up going in because I wanted to and both ladies on the inside were excellent and when I got home the steak was excellent as was the potato and salad. I was and am so pleased that I just had to write about it.",
   "Had a great experience here. Service was great. I had the Parmesan Crusted Chicken which is always great here with a decent portion size. You can choose from the 9oz or 12 oz. The sweet potatoes were piping hot as well. Most of my experiences at this particular location are always good. Sometimes you do have to wait a little longer during peak times.",
   "My experience was pleasant. I ordered the seasoned steakhouse wings to go, the guy that took my order was professional and had mannerism. Once I made it home I only had 7 wings...I thought it was suppose to be a 10 piece...I called the store and made them aware of my issue. Apparently it was supposed to be only 8 wings. The manager showed genuine concern and offered me to come back and immediately redo my order or receive a gift card through email. I will DEFINITELY revisit this establishment again....good customer service goes a long way!!🥰",
   "Visit the restaurant during lunchtime with coworkers. there was a lengthy wait in the lobby due to lack of staff? After sitting Our Party of 9+ we were immediately greeted by the waiter who swiftly took our drink orders. He explain that he is the only person working the floor with several large parties and would be as attentive as possible. Our food was brought out as cooked my steak was cooked perfect to request.... the waiter was so good we could not believe that he was the only one on the floor but clearly noticed it when you’re bringing food and drinks to the table.",
   "Very nice experience. Sirloin was tender and cooked perfect. Steamed broccoli was likewise.  Good prime rib sandwich but the AU juice was in a small container. Prices were good on everything and the staff and manager were exceptional."
  ]
 },
 {
  "name": "Texas Roadhouse",
  "address": "7525 Eastchase Pkwy, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/50d46a64-9332-11ea-b013-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3011665333133458635",
  "source": "GoogleMaps",
  "reviews": [
   "Service was great. Food was awesome. The willingness of the server flirting in a dirty manner with the table next to us was not. I understand it's the individuals fault not the establishment so I gave 4 stars.",
   "If you are looking for one of the most tender, flavorful steaks at reasonable prices, you can’t go wrong with Texas Roadhouse. I am a steak lover and I have found that many of the high class steak restaurants I’ve been to before are a disappointment when you realize how much you’ve paid for a sub-par steak. Not at Texas Roadhouse. While you can choose a tougher cut of steak that may not be as good, the 8 oz. Dallas Filet is now my “go-to” on every trip here. It’s always cooked perfect, tender and flavorful. The baked potatoes are always fresh and fluffy and their salad that comes with the meal is chock full of cheese, chopped eggs, tomatoes and croutons. Unlike many other restaurants that fling iceberg lettuce in a small bowl and throw it on your table. Our visit this night was about a 20 minute wait for two people which is expected on a busy Friday night. Many people with larger groups did have to wait considerably longer. Though they have a large parking area, it stays busy and can sometimes be difficult to find a space. Our waitress was cordial and professional, got us what we needed when we needed it but was not necessarily that friendly like most waitresses we encounter. They have there tasty roasted peanuts to curb your hunger while you wait. As with many, the delicious, hot rolls are something to die for when served with their cinnamon butter. This location has consistently been good with their food and service and I highly recommend them for a great meal. I had already started in on my meal for the photo but the presentation of both the salad and main course were on point.",
   "Stopped by on Saturday for a bite on my way home. Couldn't decide what I wanted so I had the sampler appetizer. It was dry, bland and anything but exciting. My last two experiences here left me shacking my head. I probably won't be going back.",
   "Fabulous dinner. Porterhouse and filet were perfectly cooked. Steamed broccoli perfect. Salads were fresh and in chilled bowl. Waitress was top notch. Personable and did a great job. Will definitely return.",
   "The service has always been good to me here and I love the food. I would HIGHLY recommend the fried sirloin steak plate. It's fantastic! The atmosphere here is friendly and fun and a great place for a group of 1 to 100. I would highly recommend this restaurant to anyone who enjoys \"cowboy food\" as my family calls it!"
  ]
 },
 {
  "name": "Kobe Japanese Steakhouse and Sushi Bar",
  "address": "7760 Eastchase Pkwy, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/51106236-9332-11ea-8ac9-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11078453572529861427",
  "source": "GoogleMaps",
  "reviews": [
   "Eaten at this location twice in the last week.  Staff is very friendly and accommodating! There is the normal hibachi area for larger parties, a section with regular restaurant tables, and a bar area.  \n\nMy first experience was take out.  My second was in-restaurant at a table for lunch (did not use hibatchi).  Both times, it seemed like I should have had soup according to the menu, and both times I did not get it.\n\n** PS. I have eaten here 3 times.  They said they no longer serve soup - suggest removing that from the menu or adding another side to compensate.\n\nOtherwise, it is a good place to eat.",
   "Food was delicious but heavy on rice. Fried rice was not typical. It had less flavor and lacked additional ingredients such as egg and carrots and peas. Salad was watery but dressing was still good and portion was a bit small. Would prefer more salad and less rice. Vegetables and meat were the star for sure. Tender and tasty, fresh, hot, and little to no wait. We definitely go back. Service was kind too.",
   "Excellent food! War Eagle roll was delicious. Steak and shrimp habachi was great! Child friendly atmosphere. Will return!",
   "Went there for the first time to celebrate my birthday. The amount of food you get is incredible. Everyone uses carry out trays. The food was\"good\".",
   "Excellent tepenyaki steakhouse. The food was wonderful with the seasoning just right. The sashimi was great. The service was top tier."
  ]
 },
 {
  "name": "Hibachi Sushi",
  "address": "181 Eastern Blvd, Montgomery, AL 36106, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5155a8b0-9332-11ea-995d-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8153181297905781829",
  "source": "GoogleMaps",
  "reviews": [
   "Very Excellent food. Excellent service. Big buffet. I never expected they are bring this much of big buffet and more options. I give 5 ⭐️💫.",
   "One of the nicest buffet restaurants so far. Foods are fresh (we arrived around 11am) and  clean. Price is ok and gives military ID discount.",
   "I really enjoy coming to this restaurant. There's an incredibly large selection of food and not all of it is Asian food. There's a few different types of pastas, crawfish, a place where you can get steak, and many other options that most smaller Asian buffet style restaurants don't have. The price is also very reasonable. I believe it's between $8 and $12 depending on when you go and if you very a drink.",
   "Best place in town. They have everything! Even pizza, fried chicken, roast, yeast rolls and ribs. My favorite part is that sushi bar, very clean and kept up. Great staff! My mother love the ice cream",
   "This eating establishment is GREAT! Their staff is very helpful and friendly. They have just about anything you want to eat there and all their food tastes great. I especially like their selection of sushi."
  ]
 },
 {
  "name": "Itta Bena Restaurant",
  "address": "1801 Eddie L Tullis Rd, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/519f0e02-9332-11ea-8d78-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=576619263907082117",
  "source": "GoogleMaps",
  "reviews": [
   "Me and the wife had a wonderful time. Good music good food. BBQ shrimp and crab cakes were wonderful.I had the land and sea which was tender steak, red snapper, and shrimp. My wife had a shrimp noddle dish. Probably the best restaurant in Montgomery. Pricey, but worth a good time with the wife.",
   "Beautiful place. Service is amazing & the food has always been delicious. We had a good evening & we got engaged 😍",
   "The atmosphere was great. Staff was wonderful. Food was yummy. Only complaint was the menu was a little limited, especially for my husband, who is allergic to shellfish. Otherwise, we loved it!",
   "Date night with my fiance. We enjoyed everything. GREAT SERVICE👌👌",
   "It was a nice atmosphere and the beet salad was good, but the entry was not so good and also the desert I had was not prepared good."
  ]
 },
 {
  "name": "SHILLA Korean Restaurant",
  "address": "5215 Carmichael Rd, Montgomery, AL 36106, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/51e3b848-9332-11ea-9d97-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "free"
  ],
  "link": "https://maps.google.com/?cid=5319268918966924066",
  "source": "GoogleMaps",
  "reviews": [
   "The food was pretty good. We were grateful  to have it next to our hotel while traveling through. Not much atmosphere,  but the service was good. The only issue was there was one thing in our seafood hot pot that turned our stomachs a little, (they called it \"fish eggs\" but I'm pretty sure it was some type of testacles- you can see it in the photo) but hey,  it's authentic,  right?  Otherwise, no problems and the food was good and reasonably priced.",
   "We found this place on accident, but glad we did!  Daughter loves kimbab, and it was amazing.  Food is a little pricey for dinner, so we might try lunch next time.  Very clean and service was excellent.",
   "Very friendly, and clean and food was amazing, I ordered octopus stirfry ☺️🐙❤️",
   "Just take a look at my pics from the place and how good it all looked. I have no complaints whatsoever.",
   "Always delicious. I love the small (free) appetizer plates they bring before your meal arrives. Poor table next to us were first timers and that they had to make their own soup out of it."
  ]
 },
 {
  "name": "Sommer's Place",
  "address": "7972 Vaughn Rd, Montgomery, AL 36116, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/522862ae-9332-11ea-a733-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3459600740535506207",
  "source": "GoogleMaps",
  "reviews": [
   "This restaurant was so good. I wish it was closer to my house. Food was hot, delicious and brought out quickly. I highly recommend the Seafood! Service was friendly and helpful. Thanks for a wonderful meal!",
   "I wasn't expecting this place to be anything special, but I was surprised! I ordered the grilled pork tenderloin with a sweet potato. It was a simple, yummy dish. My friend ordered the fried pork chop with mashed potatoes and fried okra! Her dish was amazing. The pork chop was beautifully breaded. I wanted to eat her food too! The customer service could have been better, but our server was likely just overwhelmed by our large party. It's a must-visit spot. \n\nIt should be noted that I was able to stay in Whole30 guidelines and eat at this restaurant.",
   "Nice place. Great staff. Have eaten here many times and never had a bad meal. You may have to wait for food or table if they are busy, but that's anywhere. Food is good and very reasonably priced.",
   "Food was good. Service was even better. Great atmosphere. People are friendly and have great attitudes. Server was amazing!",
   "Good meat and three . The type everyone likes in Montgomery so there is a line waiting on Sundays."
  ]
 },
 {
  "name": "Sinclair's East",
  "address": "7847 Vaughn Rd, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/526f7ddc-9332-11ea-b7d6-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14265428020886891601",
  "source": "GoogleMaps",
  "reviews": [
   "It was my first visit and it was amazing! The atmosphere was very lowkey and inviting. Our server angie was awesome. I had crab claws, and chicken carbonara. Everything was cooked to perfection. This is definitely a new go to spot.",
   "We were assigned two waiters and a waitress in the Private Party Dining Room. They were superb!!!",
   "I am from Arkansas but came here after church on Easter with Amy fiancé, I cannot begin to explain the incredible vibe inside, I felt like I was in a big city in the 80s, possibly early 90s and this place is like a time capsule, I felt so comfortable, the place is very clean, and relaxing, white cloth on the table tops, very romantic atmosphere, candles lit in the corners, dim lights. Wonderful! The food.... absolutely incredible!! Even my daughter loved it all!! She couldn’t stop eating my wings, and I couldn’t stop eating her Brie bites.  The artichoke dip needs a little more flavor. But everything was incredible and I’ll definitely be back.",
   "The service here is pretty good. Everyone is friendly and helpful. I was impressed with that aspect of it. Sinclairs has a designated smoking section and also a lower level for large parties. The menu is pretty diverse. it is just not burgers but also pasta dishes and a few other different items. The prices are reasonable for what you get. The food is about average in taste. I would go back to try a few more items on the menu.",
   "We were there for an after graduation dinner for my niece. Very nice quiet and private room. The food was delicious. I had a turkey sandwhich with bacon and avocado. And I tasted my wifes shrimp quesadilla and my daughter's pizza. Rven the coffee was great. I cant wait to go back to Montgomery for a visit."
  ]
 },
 {
  "name": "Top China",
  "address": "9160 Eastchase Pkwy, Montgomery, AL 36117, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/52c4a30c-9332-11ea-8202-14b31f159f22.png",
  "tags": [
   "food",
   "learn",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9999732926105990503",
  "source": "GoogleMaps",
  "reviews": [
   "Honestly they weren't the friendliest people but they were polite. Now for the real important part!!! I ordered dumplings and honey wings with white rice. Food was awesome!! The dumplings were so good my eyes closed while eating them for some odd reason. The honey wings were cooked to my liking and just plain great. I gave them 4 stars because of their food. Took a star off because customer service is important! Please smile more makes your customers feel more welcomed.",
   "I hated it.  The rice was super greasy and was not good.  I couldn't believe that it was bad as it was.   They need to learn from the American deli employees  (who aren't even Chinese ) how to fry rice.  Very basic part of eating Chinese food..... decent rice",
   "Food was a little bit above standard. I ordered shrimp and broccoli with heavy sauce. I got 3 shrimp exactly and a ton of broccoli with no extra brown sauce as requested. Egg roll was perfect and crispy without being too thick and hard like some places.",
   "One of the best chinese places I've eaten from in Montgomery thus far.The portion and prices are EXCELLENT!IT'S A MUST TRY !",
   "Great food. Always made fresh to order. Love the House Lo Mein!"
  ]
 }
]