[
 {
  "name": "Hubbard Park",
  "address": "400 Parkway St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5310795e-9332-11ea-a258-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "historic",
   "walking",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=8638774064399199318",
  "source": "GoogleMaps",
  "reviews": [
   "Magical winter wonderland in Montpelier, VT. Be sure to stop by if you ever visit Vermont. We were in awe at all the beauty of this fabulous forest covered in snow. Definitely recommend a visit to this place.",
   "Beautiful trails lead from downtown to historic towers to deserted forests, there is a trail for every ability level, and friendly knowledgeable locals with their great dogs",
   "Love walking the different trails watch out for the snakes love the wild life and so close to town",
   "Great park. Plenty of space for a game, a walk, or even just a place to get peace and quiet. Some days have more dogs than others. As long as I've been in town I haven't seen any litter in this park.",
   "Hazel and I love Hubbard Park! We've been walking here for years. Enjoyed the jack o lantern filled path last week."
  ]
 },
 {
  "name": "Vermont State House",
  "address": "115 State St, Montpelier, VT 05633, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5355bfe4-9332-11ea-b274-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "learn",
   "tour",
   "free",
   "food",
   "free",
   "history",
   "tour",
   "free"
  ],
  "link": "https://maps.google.com/?cid=17607935545156782352",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of the coolest places I have ever been to. Visiting from Canada, the tour was excellent. Learnt a lot about the history of the Legislature. Our tour guide was excellent and he was really funny too. He really cracked us up and made the tour interesting. This is one of the places that if I visit Vermont again, I will surely stop by again.",
   "Magnificent capitol, both from the outside and inside. It's quite picture-worthy, especially at night when the building is lit nicely.\n\nThe free guided tour was very informative. Definitely join one if you are visiting. I was quite surprised to learn that the legislature only meets for about four months in a year, during the first quarter! We were able to visit the legislative halls since there were no on-going sessions. At the end of the tour, visitors can stay and head to the cafeteria for food and drinks. All the staff we encountered were very friendly and helpful, especially the ladies at the gift shop.\n\nIf you don't have time for the tour, you can check out the virtual tour on their website.",
   "Visited here during a weekday, and the entrance was free! We were given audio devices and maps the explore the whole House. Beautiful architecture!",
   "Quintessential building with history lessons in every step. Well worth the visit.",
   "I loved visiting the Vermont State House! When I arrived on Saturday, I wasn't expecting to be able to go inside or take a tour, but I'm glad they were open. The docent was outstanding and the building, beautiful! I recommend stopping if you have free time."
  ]
 },
 {
  "name": "Vermont Historical Society Museum",
  "address": "109 State St, Montpelier, VT 05609, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/53ac1d6c-9332-11ea-a00b-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "free",
   "history",
   "history",
   "tour",
   "art"
  ],
  "link": "https://maps.google.com/?cid=1677152199741322580",
  "source": "GoogleMaps",
  "reviews": [
   "Nice small museum. It will be great to see that even this museum dosen't charge any visitor fee like other Museums in US.",
   "We got in for free during an event day offering free admission which was really great for us. We travel full time so paying for tons of museums and outings can add up. It’s a small museum but decently done. I do wonder if there could be a little more local vermont history or more detailed history Added around. Some was more broad and general stuff that most anyone would know. Sure sheep and cows and such were used for farming. But I would have liked a little more in depth history on things and how things were done in vermont compared to other states. How roads were carved and built in and through/around the mountains. History of covered bridges, maple farms, quarries etc. but I also admit I was a bit rushed on a time crunch before closing so it is possible I rushed pass some of these things without realizing. \n\nOverall it was a nice museum and laid out in a horseshoe so it was easy to walk through. But this is a huge building. It would be nice to have more floors of history to explore. Looking at the pricing it seems fairly priced for what is here. $7 an adult, $5 kids and seniors and under 6 free, $20 for families. \n\nI also bought some nice postcards in the giftshop.",
   "Small, but really well done museum describing Vermont history from the time of early human settlement to the present day.  I found the section on colonial and early American history especially interesting, especially given the complicated and often strained relationship that Vermonters have had with New York, New Hampshire, and the Crown.  Takes about an hour to go through and it is well worth the time and money.",
   "Nice visit to add along with a tour of the state house.",
   "Thoughtful and interesting historical displays.   Lots of historical artifacts arranged in relevant groups to illustrate Vermont's rich heritage: colonial settlers, land disputes between Grant's and Yorkers, native American heritage, wars,  industrialization,  railroads, everyday life and art... and much more.  Wish we left enough time to visit more than just the first floor."
  ]
 },
 {
  "name": "North Branch Nature Center",
  "address": "713 Elm St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/53f2eaa2-9332-11ea-8973-14b31f159f22.png",
  "tags": [
   "nature",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=10774325807907678240",
  "source": "GoogleMaps",
  "reviews": [
   "Went to a foraging class and it was AWESOME!!! We're going to take the mushroom one too and keep looking for other events. It's about 40 mins from us but it was such a great day it's worth the drive!\n\nInformative, exciting, fun, kind, funny! Just great staff and a GREAT class!",
   "Great trails for cross country skiing!",
   "We were here for the Express purpose of swimming in one of the swimming holes.  This is such a beautiful place. Swimming was hard because getting into the water was difficult for me. No sand beach areas.  And for the record clothing was optional, found that out accidentally but who cares",
   "We love NBNC! Great place for bird watching, hiking and enjoying nature. Events are amazing!",
   "Very knowledgeable, friendly staff.  Extensive trail system that crosses the Winooski River, with plenty of spots to take s dip to cool off."
  ]
 },
 {
  "name": "North Branch Vineyards",
  "address": "82 Trillium Hill Rd, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/544bb964-9332-11ea-9604-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "winery",
   "winery",
   "tasting",
   "winery",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=59281714095628527",
  "source": "GoogleMaps",
  "reviews": [
   "Great experience/introduction to Vermont wines. You're missing out if you don't stop!",
   "We had a great time today visiting this winery at the owners home. We tried a superb variety of white and red wines. The owner was very interesting and  knowledgeable  on wine making.  He introduced us to some tasty hard apple cider with a delicious wine jelly on crackers.",
   "Our experience here was incredible! A small, off-road adventure just a few miles from downtown Montpelier led us to one of the best wine tastings we’ve had in New England. The owner gave impeccable descriptions of his wine and took such pride in the making of it. It’s rare to find people who have followed their true passion and I can say this owner certainly has! As Californians we have high expectations for wine tasting and this winery met all of them. If you’re even passing through Montpelier it is worth a stop!",
   "Not only is the wine and cider awesome, but the owner is extremely informational about winemaking. He also has a very interesting background. This winery is definitely worth the trip! Also, don't be put off by the fact that it's run out of a house :-)",
   "We visited John at North Branch for a wine-tasting on a Friday afternoon and he spent almost an hour talking to us about his wines and vineyards, and then gave us a detailed tour through his wine-making operation. It was a very enjoyable and informative experience, and the wine is absolutely phenomenal."
  ]
 },
 {
  "name": "Fresh Tracks Farm Vineyard & Winery",
  "address": "4373 VT-12, Berlin, VT 05602, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/549d5bde-9332-11ea-a368-14b31f159f22.png",
  "tags": [
   "tasting",
   "food",
   "winery",
   "winery",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=10207883754090465929",
  "source": "GoogleMaps",
  "reviews": [
   "I really enjoyed this place. The building is beautiful. Went and had a wine tasting, get six pours and a complimentary wine glass. I had the sweet flight tasting and it was great. I think my favorites were the maple wine and the mapple wine. We also ordered cheese and crackers and it did not disappoint. They also allowed us to bring in our outside food and that was really nice of them.",
   "Love this winery! Jenny is fantastic and full of positive energy! The wines were excellent and the location is beautiful. Thank you for being a HH!",
   "One of our favorite vineyards!  The staff is always friendly and the wine is awesome.  Highly recommend visiting.  On one of our initial visits we got to meet Arthur.  As dog lovers, it made our visit that much more special.",
   "Very friendly staff and great price! We left with three bottles and would definitely come back. Good wine and beautiful place.",
   "Beautiful winery and tasting room with friendly, helpful staff. A pretty good selection of reds and we enjoyed them enough to bring a few back to Delaware with us."
  ]
 },
 {
  "name": "Hope Cemetery",
  "address": "201 Maple Ave, Barre, VT 05641, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/54eba32e-9332-11ea-a255-14b31f159f22.png",
  "tags": [
   "creative",
   "wander",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7093548888910807971",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful experience! Beautiful gravestones with astonishing details. Also several beautiful epitaphs and tributes. Definitely worth spending the afternoon, or even just driving through for a quick look. Highly recommend it!",
   "Amazing place to wander around and check out all the intricate and creative gravestones",
   "Beautiful monuments. A true showcase of talented artists.",
   "Beautiful as always.",
   "Historical site in Central Vermont. Clean, safe and well maintained.\nLearning about Barre history has never been so easy.\nGo Visit!"
  ]
 },
 {
  "name": "Vermont Granite Museum",
  "address": "7 Jones Brothers Way, Barre, VT 05641, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/55350876-9332-11ea-b29e-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "practical",
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=3651386835907380371",
  "source": "GoogleMaps",
  "reviews": [
   "The Vermont Granite Museum is a cute little gem in Barre City. It was a good venue (sound was a bit echo-y) for our small conference. The venue does an excellent job highlighting the importance of granite to Vermont.",
   "Amazing display of the granite industry.. And the folks that work there.. Super knowledgeable and helpful",
   "We were greeted by a very nice man that asked us some questions relating to the history of granite in Barre, he then explained the .most practical way to view the museum.  Great displays of how the granite industry was made in Barre VT.  Lots of displays, pohotos and old news articles.",
   "This is an extremely cool place if you are looking to see the history of the granite industry in the Barre area. This gives full scope look at the the industry back in the early days to present day including (if you time it right) being able to watch actual sculptures at work",
   "Great place to get history of Vermonts granite mining..."
  ]
 },
 {
  "name": "North Branch River Park",
  "address": "58 Barre St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/55815406-9332-11ea-a329-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=14239624479806014667",
  "source": "GoogleMaps",
  "reviews": [
   "Nice trails by the river. Gets muddy especially in spring.",
   "Fun to run the dog out here",
   ""
  ]
 },
 {
  "name": "Wrightsville Beach Recreation Area",
  "address": "369 VT-12, Middlesex, VT 05602, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/55dd08e2-9332-11ea-a880-14b31f159f22.png",
  "tags": [
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7650761285267454689",
  "source": "GoogleMaps",
  "reviews": [
   "For a second year in a row, my family had visited this amazing place to swim and play at the beach and gave left with very fond memories! \n\nCLEAN! SERINE! DAY TRIP DREAM!\n\nParking is abundant and the gravel roads are very smooth.  It's not a long walk to the service booth or activities. \n\nBring your charcoal and grill a lunch under the trees but bring a trash bag for your mess. Swimming and frisbee golf had a reasonable fee but it's obvious the money goes right back into maintaining the grounds! \n\n The bathrooms are pretty plain with a concrete floor and some old but well maintained bathroom fixtures. If you need modern accommodations, the restrooms may leave you dissatisfied but we found them clean and well maintained. Some funding toward bringing this area will lock in the five star rating. \n\nThank you to the people and organizations that maintain this area so well; I'm looking forward to many more trips here and feel this place has set the bar high as a standard other places to model.",
   "Has bathrooms and a small snack shack for the little ones.  Quiet and peaceful",
   "Very well up kept and clean great for a day at the beach and boat rentals.",
   "Clean beach  nice place",
   "Nice little beach. You can rent Kayaks oder Canoes. Has changing rooms and toilets."
  ]
 },
 {
  "name": "Cabot Farmers' Store - Waterbury",
  "address": "2657 Waterbury Stowe Rd, Waterbury, VT 05676, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/56295448-9332-11ea-8a18-14b31f159f22.png",
  "tags": [
   "family",
   "tasting",
   "eat",
   "food",
   "family",
   "free",
   "tasting",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6327301972916181470",
  "source": "GoogleMaps",
  "reviews": [
   "This is a can't miss location for great food, incredible cheese tasting, other food tasting, great education, craft beer and wine and just all-around fun. the big Epiphany for us was how many of the Cabot cheeses, the aged cheeses, are lactose-free. Westaff did a great job educating usabout cheese differences, the process for making cheese and what each member of the family could eat without having to worry. It's great to be supporting this co-op of family farms and the great staff here. Looks like a specialty grocery store (and it is) but it's also a fabulous tourist stop. Come in and delight the entire family!",
   "Very friendly and inviting, the owners treat you like family, Free tasting of all the cheese's they sell as well as most spreads and dips, Their selection of syrups and Honey had a wide variety of tastes and uses. There also is a very Large selection of higher end specialty items. A very nice visit Recommend to all.",
   "This is a great place to stop and try the best cheese in Vermont. Sample almost all of their cheeses, plus some dips. Great variety of other items in the store, including a nice selection of wine and local beer, as well as other tasty treats.",
   "How can you go wrong with all the cheese?!? Taste them. Buy them. Eat them. Repeat. Cabot makes the best and that's that. My 3lb block of cheddar will be my longest relationship, haha! \n\nGo to Cabot!",
   "Love this store! Love cheese!!! Didn't want to go all the way to the factory so this was an awesome consultation! I spent way all of my spending money on the food! So many choices of cheese, dips, crackers, maple products and Vermont-made items, I couldn't resist! Great staff too! Very helpful! And I appreciated the cleanliness especially around the samples."
  ]
 },
 {
  "name": "Morse Farm Ski Touring Center",
  "address": "1168 County Rd, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/56702148-9332-11ea-aafd-14b31f159f22.png",
  "tags": [
   "learn",
   "family"
  ],
  "link": "https://maps.google.com/?cid=203576181324472978",
  "source": "GoogleMaps",
  "reviews": [
   "Nice little gem that is pure Vermont! This is what CT is all about. Showcasing what sugar makers can do and providing a quality product.\n\nMaple syrup is competitively priced against peers.",
   "Great spot for tourists or locals. Get the meal deal with a pickle a donut sugar on snow and a hot beverage. Great place on a snowy day too. Downside is how popular it is because it’s very crowded.",
   "Learn about how maple syrup is made from a very old family run business. Taste all the different grades of syrup.",
   "Not just for leaf peepers and tourists! This place is visited by most locals as well! Try the orange Sunkist maple creamer float. Sounds weird but really good!",
   "Great selection of vt products. Friendly and helpful."
  ]
 },
 {
  "name": "Mount Mansfield State Forest",
  "address": "175 Pleasant Valley Rd, Underhill, VT 05489, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/56bbd09e-9332-11ea-82eb-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=9185436332713741552",
  "source": "GoogleMaps",
  "reviews": [
   "Just make a quick drive up to the Notch, park and have a short little hike!  The drive up is entertaining in itself, go slow near the top and be courteous , it lets enjoy the scenery more!  The parking fills up quick though, but you can improvise park most anywhere it seems haha.",
   "What a view! We decided to hike to the top, what a terrible yet rewarding idea. It was not easy, I had to lay down multiple times, but we made it and it was worth it. Riding down on the way back was also an excellent decisions. The staff is very friendly.",
   "What an amazing hike. Highly recommend taking the laural trail first even though it's the most strenuous it's all worth it. Once you get to the top it's some of the best views in New England. The loop back down sunset ridge is breath taking and much easier",
   "I loved my hike through and up Mount Mansfield. The paths are well laid out and maintained its a fairly gentle hike (sunset ridge) with only a few steep sections. Take your time and expect to spend around 5hours going up and down on this hike - much more rewarding than taking the gondola up!",
   "The views we're gorgeous! We hiked the long trail south to the chin and back down. That route was definitely rough on the body. There are shorter trails and a gondola to take you to the top as well."
  ]
 },
 {
  "name": "Seyon Lodge State Park",
  "address": "2967 Seyon Pond Rd, Groton, VT 05046, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/57116ad2-9332-11ea-a1dc-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13733232968093573129",
  "source": "GoogleMaps",
  "reviews": [
   "Cozy lodge with amazing food and helpful staff. Absolutely worth the trip.",
   "A wonderful place for many activities, terrific staff, lovely food, all in all  venue greater than the sum of it's parts.",
   "My cousin got married here...it was such a beautiful setting for a wedding!",
   "Great food, friendly service and cozy accommodations. Will definitely be coming back.",
   "Beautiful spot"
  ]
 },
 {
  "name": "Morse Farm Maple Sugarworks",
  "address": "1168 County Rd, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/576138be-9332-11ea-8de4-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "history",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11766277201857334504",
  "source": "GoogleMaps",
  "reviews": [
   "Great place. It was my first stop in Vermont. Easy to get to and great scenery. Do yourself a favor and walk the grounds and read about the history. I picked up a few gifts for the family. It goes without saying the syrup is a must. Enjoyed the different varieties but #4 was my favorite.",
   "Some of the best maple syrup products I’ve ever had. The maple ice cream is delicious! Fun and educational displays and videos too. Plus enjoy the spectacular view on the back patio.",
   "Great destination for Maple products and something to do.  They also carry beef, hamburger, steak, and pork.  As well great knickknacks for gifts!",
   "Love that place...Best ice cream cone. Very friendly staff. One of Morse family lady ensured that we see the maple making video and she took us in a video room. It's really a best place to enjoy ice cream cone with a lovely mountain views.",
   "Perfect stop to experience the Vermont maple tradition. Ice cream was excellent."
  ]
 },
 {
  "name": "Groton State Forest",
  "address": "Plainfield, VT 05667, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/57a790d0-9332-11ea-b859-14b31f159f22.png",
  "tags": [
   "free",
   "nature",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=3009964931810418972",
  "source": "GoogleMaps",
  "reviews": [
   "So many beautiful views. \nGreat trail systems",
   "A gem of the New England outdoors. I came up here after Labor Day to enjoy some pre-season foliage, weather was perfect for mid September. Very few hikers on the trails! My hiking loop was from New Discovery to Groton Lake and back. Trails aren't super well marked at the trail crossings.",
   "Spruce Mountain is a great afternoon of hiking, 2.2 miles up to a beautiful view at the top is always worth it. The trail is rocky but kept in check, wear some heavy boots. A few landmarks along the way include caves, swamps and streams and a very wild and free feeling at the top of the firetower. Great way to spend an afternoon and good for all ages.",
   "Groton State Forest, what a great place to go and commune with nature again.many campsites available where you can go and spend a couple nights either in a tent or small RVs. Nature lovers are going to love this arium many places to go lots of animals small lakes. Many small areas to go kayaking and canoeing.",
   "One of my favorite places to be. Quiet, rural, serene. Whether visiting just for the day to hike and swim or staying for a week camping, this place is awesome!"
  ]
 },
 {
  "name": "Cold Hollow Cider Mill",
  "address": "3600 Waterbury Stowe Rd, Waterbury Center, VT 05677, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/58005f68-9332-11ea-94d3-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "free",
   "delicious",
   "food",
   "delicious",
   "free",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=15170275416244382059",
  "source": "GoogleMaps",
  "reviews": [
   "What a unique and beautiful place! Fall is definitely the time to visit. It certainly gets you in the mood for fall 🍁🍁🍁🍁 I was impressed with how much there was to choose from! We bought delicious Vermont cheese, peanut butter cookies, maple syrup and jam. The doughnuts and cider were a delicious breakfast the following morning ❤️ I would highly recommend this place and make a future visit as well!",
   "My husband and I visited here after snowmobiling with Snowmobile Vermont (amazing time!). Snowmobile Vermont gave us a coupon for a free apple cider donut so we decided to check it out. \n\nThe store is absolutely beautiful anything Vermont related items you can think of they had it and the apple cider donut was one of the best I’ve ever tasted! \n\nI took away 2 stars because the cashing out experience was lacking. The woman that assisted us didn’t greet us at all or acknowledge us standing there waiting to be checked out. Finally we get called over and we’re cashing out (we purchased about 20 dollars worth of stuff). I showed her the coupons and she looked like wasn’t happy about seeing the coupon. She just took them scanned them and gave us our items. Customer service plays a big role in any business and I do feel that in this area it was inadequate.",
   "Those apple cider donuts are just one of the many incredible things offered by this place. Food and baked goods are just so hearty and yes, fresh. We liked their coffee and sandwiches. The different Vermont goods offered are so delicious and tell a story. A must visit place and an experience",
   "Cold Hollow Cider Mill is worth a visit for delicious apple cider and cider donuts. You can watch how the crushed apples are made into cider through a window for free. Cider (not hard cider) samples are also free and self-serve. Souvenirs and food products (e.g. maple, honey) are also sold here. Definitely a great shop for gifts. \n\nThe cider donuts  was delicious, denser cake-like donut. Best enjoyed with some apple cider. \n\nMy friend used a purchase of $25 voucher to get half a dozen donuts. We chose to just get 3 donuts, since we wouldn’t be able to finish it.",
   "The store is a wonderful place to visit for cider, maple syrup, jam, and other lovely quintessentially Vermont products.  HOWEVER, and it is a big however, there is a working heating stove on the floor in the middle of the store, which was extremely hot the day I visited this past weekend.  The stove is sitting directly on the floor blasting heat with no screen, gate, or other protection for the customers.  \n\nI had no idea the stove was even there when I was walking around the store with my toddler son.  He was not running or being disruptive and was never more than a few feet away from me.  We turned a corner and before I even noticed the stove on the floor, my son has walked a few steps and put his hand directly on the hot glass, which again was not blocked or protected by anything.  He immediately screamed and took his hand off the glass, but by then he had received second-degree burns on all of this little fingers.  He has suffered greatly this week and remains at risk of infection. \n\nGranted, we left the store very quickly to take him to an urgent care clinic, but no store employee approached us to see if he was ok.  I then called the store this past Monday to inform them of the accident and kindly request that they place a screen or some sort of gate in front of this extremely hot stove easily accessible by anyone walking through the store and at perfect child height.  I was told I would receive a call from the owner the next day, but have not yet received one. \n\nI remain shocked that this stove is left unprotected out in the open of a very family-oriented store and at the lack of care the staff and owners have showed us.  Needless to say, I won't be returning, and I urge visitors, especially with young children, to watch out for the stove."
  ]
 },
 {
  "name": "Little River State Park",
  "address": "3444 Little River Rd, Waterbury, VT 05676, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5852ec82-9332-11ea-95af-14b31f159f22.png",
  "tags": [
   "walking",
   "hike",
   "history"
  ],
  "link": "https://maps.google.com/?cid=4075214022775714022",
  "source": "GoogleMaps",
  "reviews": [
   "This campground is everything you could ever want in a state run park. It's gorgeous and heavily wooded, situated on the shores of the Waterbury Reservoir. Most sites have waterfront views and some even have water access. They sell firewood and ice (block and cubed). If you have exact change you can help yourself any time of day. Super friendly staff, very helpful. This is now my go to car camping park in Vermont.",
   "Absolutely beautiful place to camp in the fall , I drove up here to celebrate my 30th birthday all by myself . All the sites have what I would call a great view , bathrooms in walking distance and the shower takes quarters , and the pressure and hot water both work great! Picnic table and fire pit on site , more private sites are available for anyone interested. I can't wait to try this place in the summer !",
   "Little River was a fantastic camping place! You can buy firewood and ice from the site. Each camp site has it's own fire pit, many have a grate to make grilling or cooking over the fire easier. We were in spot 51 that had a really pretty view of the water but we were kinda close to neighbors on each side. Would definitely return to camp again. Theres so many trail hiking options as well.",
   "Hiked only. The trail we were on was in good condition even though it was not blazed .  Drove around the campsites and made us want to camp again.  This place is pretty awesome, though around the rivers, it can get very buggy. Employees were very friendly. FYI, It does take awhile to get to this park from the main road even though it is only 3 miles off it, it’s mostly a dirt road.",
   "Best state park. Best. Cabins are particularly nice, and each of the car camping spots feel private and wild, despite being numerous. The History Hike is a favorite, and the Stevenson Brook Trail has some really cool water and rocks. The springtime high water is pretty impressive as well, and makes for tough crossings where required and where no bridge is present."
  ]
 },
 {
  "name": "Vermont Historical Society",
  "address": "60 Washington St, Barre, VT 05641, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/58b2cc12-9332-11ea-8280-14b31f159f22.png",
  "tags": [
   "history",
   "free",
   "history",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=7601201492891138206",
  "source": "GoogleMaps",
  "reviews": [
   "Small museum with limited exhibitions, affiliated with the Vermont Historical Museum in downtown Montpelier. If you visit that other museum first, they'll give you tickets for admission to this museum. Not sure if the same is true if you visit this one first.\n\nThe only exhibition during our visit was on the history of auto racing in Vermont, with cool vintage photos, memorabilia and artifacts on display. There is also a game that lets you virtually drive a race car in use during the early years. Our visit lasted half an hour.",
   "VHS offers a wealth of historical and genealogical information, some of which is not available elsewhere. All staff were helpful and made us feel welcome. There is a small fee for non-members visiting  the section of the site which supports genealogical research. Other areas are free. Parking is on street at no cost. The building is handicap accessible.",
   "Clean , friendly , great racecar exhibit.",
   "Home to Vermont  history and a few great libraries",
   "Wonderful historic collections and exhibits"
  ]
 },
 {
  "name": "Mad River Glen Cooperative",
  "address": "57 Schuss Pass, Waitsfield, VT 05673, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/58f632e4-9332-11ea-9b70-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=745859636161530375",
  "source": "GoogleMaps",
  "reviews": [
   "The greatest Vermont mountain you've never heard of. Incredible snow quality (all natural) with superb glades and plenty of moguls to keep you busy. I love that all trails converge at one base area and all lifts take you to the top. The single chairlift is also a plus - definitely a throwback. A humble, quaint mountain with serious terrain. I highly recommend.",
   "I have previously rated this place. I've been coming here for 20 years. Shortly after I learned to ski. The ownership by co-op gives the mountain a down-home feel. Mad River Glen has continued to provide a haven of natural beauty and a variety of technical and enjoyable terrain for any skill level on skis.",
   "Cannot say enough good things about Mad River Glen the terrain in great. And the environment in so original.",
   "Perfect in every way. Love the vibe. Love the challenging terrain. The snow was perfect. It’s Vermont’s best kept secret. Don’t tell anyone! ;)",
   "The best there is, the finest kind. It’s old school and perfect with lots of tight trails, squirrel paths, quick decision abound! This place is truly special for core skiers, enjoy"
  ]
 },
 {
  "name": "State Owned Historic Sites",
  "address": "National Life Building, 0001, Montpelier, VT 05620, USA",
  "avg_visitor_review": "",
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/59416266-9332-11ea-b1f8-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=6536348349194756540",
  "source": "GoogleMaps",
  "reviews": []
 },
 {
  "name": "Waterbury Center State Park",
  "address": "177 Reservoir Rd, Waterbury Center, VT 05677, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/59849464-9332-11ea-8e4e-14b31f159f22.png",
  "tags": [
   "free",
   "family"
  ],
  "link": "https://maps.google.com/?cid=8959398834329855703",
  "source": "GoogleMaps",
  "reviews": [
   "This is a very hard park to find.  Drive slowly along Rt 100 and you will see reservoir road and tucked back about 200 yards is the park entrance.  Great swimming and boating.  Amazing views.   There is a small fee to get in but it is very worth the money.",
   "Amazing view!\nIt's free to get in! Not so easy to park, there's no parking lot.\nThere's a place to do barbecue with your friends with a beautiful view!\nYou can swim, the water is very clean and the park is very clean too.\nIt's pet friendly, you can bring your pet here!\nIf you go to Ben & Jerry's factory you have to come to this park, it's only 6 minutes from the factory.",
   "Went Kayaking here and family had a blast! Dog friendly and even rented some paddle-boards from the little shop. Would definitely visit again.",
   "Nice spot to go for a swim! You pay per person in the car to enter. There were quite a few people there for a Monday, maybe that's just what peak season is like.",
   "This is as picturesque as it gets.  Beautiful setting, lawn, lake, kyaks ets.  Just glorious."
  ]
 },
 {
  "name": "Bolton Valley Resort",
  "address": "4302 Bolton Valley Access Rd, Richmond, VT 05477, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/59cd0a5e-9332-11ea-931a-14b31f159f22.png",
  "tags": [
   "food",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1577549672104140220",
  "source": "GoogleMaps",
  "reviews": [
   "Skiing/ snowboarding on Monday was an awesome deal for us who have never skied before. We rented the equipment and lift tickets at a great price. I started out on a snowboard and then switched to 🎿 for only $5, so I was able to try both. Personal I had more fun on the snowboard, but thought the 🎿 would be easier for me because they are for most people. Only about 30 minutes from S. Burlington and was easy to find. Would love to try the trails when I get more experience under my belt, but still had fun learning how to 🎿 on my own...",
   "My son had his wedding at The Ponds which is just down the hill a ways from the ski resort. One hundred+ of our wedding guests stayed at the Bolton Valley Inn on Fri and Sat nights. We had fun night skiing on Friday and had our Welcome Party at the Village Cafe. Everything was lovely, the food was great and the staff friendly. Nice Mountain for children and teens. Ski terrain is limited but there is something for everyone. Lots of green and light blue on the lower half of the mountain.",
   "Bolton employees were extremely friendly and helpful.  My group arrived in an RV. We called Customer Services and they sent out one of the employees out to greet us. We were granted 'RockStar' parking considering it was temporary for the day. The skiing/snowboarding is most challenging in the glades.  The glade area closed at 3:30 so you have to make certain you have the plan and time to do it!  Highly recommend.  The view from the top is amazing!  Overlooking Lake Champlain and NY State was gorgeous.",
   "This mountain is a little gem. I've been skiing the east for 40 years and somehow managed to miss this place. Probably because it is so close to Stowe. I will say it is worth taking a day off from the larger places to check out the sweet cruiser glades of Bolton. I would have given 5 stars if the staff were better. Everyone seems like they are doing you a favor by taking your money and the ski school almost killed my daughter's desire to ski, but other than that, I really liked the mountain.",
   "Let's go, Chipmunks!\n\nExpect 9 am crowd at ski school registration. Kids start as Chipmunk and are upgraded to Moose, Raccoon, and all the way Coyote. \"Boats\" is my girls' coach who is fun, attentive while challenging them in a safe environment. Bolton may not be the biggest or the most famous around, it is just the right one for family with young kids。"
  ]
 },
 {
  "name": "Ben & Jerry's Flavor Graveyard",
  "address": "1281 Waterbury-Stowe Road, VT-100, Waterbury Village Historic District, VT 05676, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5a29d874-9332-11ea-9172-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "kids",
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=12000988987895425323",
  "source": "GoogleMaps",
  "reviews": [
   "Its a good experience for kids specially. Definitely you get some free ice cream at the end of the tour.\nCool views to how they make the cream we love so much. \nDefinitely recommend the tour.\nVery close to I-89.",
   "This is such a cool idea! This is a graveyard of all the ice cream flavors that didn’t make it. They have some very unusual flavors and it is fun to just explore.",
   "So much fun - see how the best ice cream is made!",
   "It was so inspiring to see the flavors that have passed before our very eyes. It truly is a monument to great ice creams and to those who love it. Please pay all of your respects to these giants of ice cream history. Hope this helps!",
   "My only problem was the snow (late March). The headstones made me laugh and I sent some photos to family for them to enjoy too. I appreciated the offering of spoons instead of flowers by one of them. 🤗"
  ]
 },
 {
  "name": "Allis State Park",
  "address": "284 Allis State Park Rd, Randolph, VT 05060, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5a7080c0-9332-11ea-a94f-14b31f159f22.png",
  "tags": [
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=14872508134608813780",
  "source": "GoogleMaps",
  "reviews": [
   "A Vermont State Park hidden gem! Come for a quick hike, beautiful views from the fire tower, a picnic, or if you need to host a gathering- rent the pavilion! There is camping onsite as well. The fire tower has a lookout guide inside so you can really get a great idea of what you're looking at!",
   "The ranger and the park volunteer are superb in welcoming guest. The park is extremely clean and it is very quiet.  You can hear the trees blow in the wind and the comfort is the best I have experienced!  This State Park is really a must for anyone seeking to relax and enjoy!",
   "great view from the firepower. 360 degree view of surrounding mountains. short hike. nice trails.",
   "Love the 360 views from the fire tower.",
   "Came for the fire tower - stayed for the horseshoes"
  ]
 },
 {
  "name": "Cabot Creamery Visitors Center",
  "address": "2878 Main St, Cabot, VT 05647, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5abca634-9332-11ea-8076-14b31f159f22.png",
  "tags": [
   "field",
   "tour",
   "tour",
   "delicious",
   "tour",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=16061096873589511379",
  "source": "GoogleMaps",
  "reviews": [
   "I went with my grandson Kevin’s field trip to Cabot this morning.  I had a wonderful time and enjoyed the tour.  I tried several types of cheese and my favorite was Vermont Sharp.  \nI bought a coffee cup and a T-Shirt from the gift shop.  The cashier was very friendly and asked if I needed the cup wrapped in bubble wrap which I did.  I would recommend this tour to anyone traveling through Cabot VT.",
   "One of the iconic places to visit while in Vermont. You can't tour the factory anymore due to FDA regulations. They have an abundant amount of cheese flavors you can sample. These also have a good amount of other things to try from other farms like syrup, peanut butter, pudding, etc. It's located in a very small and quaint town which is also nice.",
   "I love Cabot. It is a great little town in the Vermont country side. The staff is friendly and knowledgable. The tours are fun and the atmosphere is warm and welcoming!",
   "Awesome selection of cheddars to sample, short video of the company story, no tour but there’s a lookout window to the plant. Located in a beautiful village. Not busy when we came so they let us sample some of the preserve pairings. Everything was delicious.",
   "Very nice, but small visitors center.  Eat as many samples as you like!  Unfortunately, the creamery does not give tours anymore due to federal health regulations, but the do show a nice video and hold a short question and answer session afterwards.  The staff was friendly and very proud of their products.  Plan on spending 1 to 2 hours here."
  ]
 },
 {
  "name": "Boulder Beach State Park",
  "address": "2278 Boulder Beach Rd, Groton, VT 05046, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5b056bac-9332-11ea-9d40-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1518461129099669213",
  "source": "GoogleMaps",
  "reviews": [
   "Had a lot fun today with the grand kids",
   "Super nice sandy beach with a good grassy area, play structures. The water and the land were both clean. There's a snack bar there (candy, ice cream bars, microwave burritos etc - nothing particularly high quality, but not over priced either), changing rooms, and flush toilets. There's even free sunscreen at the snack bar",
   "Beautiful view, clear water, sandy beach.",
   "Boulder Beach is a great place to spend a day with your family. We have been many times. Last week we went and once again remembered just how lovely it is. The view, the concession stand, the changing rooms, and of course the lake itself, all great pieces of the whole picture.",
   "Slightly inconvenient boat launch, but nice place to paddle with classic lake houses all around the shore. Playground and picnic areas as well."
  ]
 },
 {
  "name": "Elmore State Park",
  "address": "856 VT-12, Elmore, VT 05661, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5b52a468-9332-11ea-b6f2-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "kids",
   "family",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=10893406646951878688",
  "source": "GoogleMaps",
  "reviews": [
   "We arrived in the rain for a tent camp, and were delighted to discover they had Lean-tos available for that night! The attendant upgraded our accommodation without hesitation, and was helpful and courteous.\n\nThe lean-to was sturdy, spacious, clean and dry, with a front porch overhang. It was a tad cold in the morning, but it was October!. The view from our site was beautiful, and the campground wasn't busy, so we had a lot of undisturbed quiet time.\n\nThe bathrooms were clean, though a little run-down  and outdated. The were electric lights inside, some plug outlets, and one coin-operated shower.\n\nWe bought 2 bundles of firewood, but couldn't use the wheelbarrow provided to take them back to our site since the front wheel was totally kaput.\n\nWe had time to do the short nature walk before leaving for our next destination. It was well laid out and signposted. The forest and river trail was beautiful.\n\nWe'd definitely go back and stay here again.",
   "This is a great state park. Wonderful sandy beach with a great beach house with restrooms, concessions, classroom space, and a huge fireplace in the big lobby seating area. Great hiking up to the top of Elmore Mountain and lower loop trails as well. The camping sites are nice, too.",
   "This place is so well taken care of.  The locals are wonderful and nice.  There's a great corner store that has all the essentials and even some surprises.  The lake, roads and trails are well cared for.  And the view...it's pretty amazing.  If you're renting a house, be sure to get one facing the mountain.  And with a hot tub if you can.  Nothing better than jumping out into the cold water then back again.  The park itself has a great hiking trail to firehouse tower.  If you're afraid of heights, it's a touch scary but totally worth it at the top.  The beach is a great place for kids and family.",
   "Need a quiet place to relax and take a dip in a lake, this is it!!",
   "Great hike. Amazing views.  Fire tower still open"
  ]
 },
 {
  "name": "Warren Falls",
  "address": "3919 VT-100, Warren, VT 05674, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5b9d677a-9332-11ea-9fa4-14b31f159f22.png",
  "tags": [
   "hike",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=7948819797766962918",
  "source": "GoogleMaps",
  "reviews": [
   "Without a doubt, one of Vermont's finest plunge pools. Part of the Green Mountain National Forest, the emerald green water is breath taking. Swimming here takes top priority as well as hiking and picnicking. Can get busy at times, just find yourself a pool to take a dip. Come on in the water's fine. Everyone's friendly, remember to take your garbage with you. Incredible waterfalls. Totally beautiful while visiting during autumn and fall foliage. Kindly click like if you find this post and my photos helpful.",
   "Gorgeous place. My favorite swimming hole so far...The cliff jumps were super fun! Highly recommended",
   "Beautiful! Went during the summer and looked for random spots to adventure to. This place is popular, some parking along the road, short 2 or minute hike in, and the water is beautiful! It is cold! Beware!",
   "This spot is beautiful! My wife and I really enjoyed just soaking it in and enjoying the sound of the water. Makes a great break when driving the 100.",
   "One of the best parks i ever visited, the shear size and amount of waterfalls is incredible. Plenty of deep water holes to jump in and swim, with natural rock slides to water slide down too. Great place to take a dip and swim in the spring water! Highly recommend visting warren falls you will not be disappointed! Such an amazing place!"
  ]
 },
 {
  "name": "Fairbanks Museum & Planetarium",
  "address": "1302 Main St, St Johnsbury, VT 05819, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5bebee80-9332-11ea-afbb-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "historic",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1027613722304234793",
  "source": "GoogleMaps",
  "reviews": [
   "A fairly small, but wonderfully eclectic museum in a historic building. They've retained much of the buildings original features, making the architecture just as fascinating as the exhibits. The planetarium is newly remodeled and very interesting. Something for everyone, a bit of this and a bit of that. Staff is enthusiastic and very knowledgeable. They take obvious pride in their museum.",
   "This place is gorgeous. From the extensive collection of taxidermy, to the incredible architecture, to the fun and unexpected planetarium show, the Fairbanks is a gem. We went once and it surely wasn’t enough, can’t wait to go back and bring visitors with us. My toddler was a little antsy, but between the animals and the science area, my kid had a great time.",
   "A MUST visit. Great place to take the kids. Lots of interactive displays to entertain them for hours. The pieces in the original museum were very interesting. The highlight of the visit was the planetarium. The presentation was very compelling and the presenter was very enthusiastic and passionate.",
   "Visiting is a must when in the area. The staff was very friendly and happily willing to answer any question. Very cool and amazing collection!",
   "Natural history at its best showcasing a wide variety of specimens in well light up displays. With prices so low I couldn't believe my eyes seeing the breadth of the collection and the fact that they are so well maintained. Touring the museum took so much time I couldn't get to see the planetarium."
  ]
 },
 {
  "name": "Huntington Gorge",
  "address": "Dugway Rd, Richmond, VT 05477, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5c3ef0e2-9332-11ea-9b77-14b31f159f22.png",
  "tags": [
   "nature",
   "walk",
   "kids",
   "daring"
  ],
  "link": "https://maps.google.com/?cid=15461094542753197609",
  "source": "GoogleMaps",
  "reviews": [
   "Great chill places at the top of the Gorge with spots to sit in the pools ..",
   "Magnificent spot to contemplate on the force of water and the beauty of nature.",
   "We come here a lot to just chill. It's really pretty, usually nobody is there, and there's a small trail to walk on. Use caution, it's not a safe place. I wouldn't bring children here, careful with dogs, and wear good shoes if you plan on the trail!",
   "Don't let the small scale fool you - the Gorge is as gorgeous and breathtaking as it is dangerous and capable of taking lives. Use caution and enjoy!",
   "I grew up very nearby to the gorge. My friends and I swam there ALL THE TIME, because it is such a beautiful local treasure. If you're into 10-30' cliff jumps, the gorge has got some 'daring' options. Water is super clear, and very refreshing. \n\nUpper and lower gorge is recommended for kids and inexperienced swimmers. The risk of undercurrents is almost nonexistent. \n\nThe heart of the gorge is the danger zone. \n\n This place is not for everyone. You need to be hyper aware of water level, and monitor currents as you swim around. I've seen someone drown here. From what I remember, someone has died here almost every summer.\n\nThat being said, in my hundreds of times swimming in all areas of the gorge, I have never experienced a stronger current than I could handle.\n\nBe smart, all will be well"
  ]
 },
 {
  "name": "Knight's Spider Web Farm & Cabinet Store",
  "address": "124 Spider Web Farm Rd, Williamstown, VT 05679, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5c9aeb52-9332-11ea-8f5e-14b31f159f22.png",
  "tags": [
   "art",
   "tour",
   "active",
   "unique",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=8371086869301495411",
  "source": "GoogleMaps",
  "reviews": [
   "Oh my gosh!  I loved this little roadside detour.  We watched a web be be harvested right in front of our eyes.  Fascinating!",
   "A friend told me about the spider farm when I was driving through Vermont and decided to make an impromptu stop. I am so glad I did! The guy who owns it is in his 80s I think. His son helps him with the \"farm.\" The spider farm was featured in Obscura — a book and a magazine. \n\nThey feature many different size webs for sale so you will be sure to find something in your price budget. And he told me how they started to make inexpensive wooden items for families with children :-)\n\nIn an adjacent barn, they have windowless panes hanging where the spiders 🕷 build webs. They spray the web with paint and then pass a board through thus capturing the web as art. The spiders are also hanging out in the shop which is pretty cool. So don't jump too high if you see one. Haha!\n\nHim and his wife have been doing this for 40+ years. He was a sailor back in the day and he showed me a bunch of rad tattoos that were over 50 years old. \n\nI was thrilled to get a piece of spider web art from the farm!",
   "The owner gave us a very informative and interesting tour (plus she was very charming). There is a very impressive collection of wonderfully preserved spider web masterpieces! It was inspiring to see someone's clear passion and dedication to something they love. PLUS - This HAS to be the world's only Spider Web Farm... How cool is that?!",
   "Awesome spot to visit. Unique, for sure. Ignore the bad review. Realize, spiders aren't always active and enjoy the experience.",
   "Super cool!!! Neat way to preserve nature!!!"
  ]
 },
 {
  "name": "Cochran's Ski Area",
  "address": "910 Cochran Rd, Richmond, VT 05477, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5cf594f0-9332-11ea-9f0f-14b31f159f22.png",
  "tags": [
   "family",
   "learn",
   "kids",
   "kids",
   "historic",
   "affordable",
   "learn",
   "family"
  ],
  "link": "https://maps.google.com/?cid=15122602674639415633",
  "source": "GoogleMaps",
  "reviews": [
   "What an amazing family run ski area!!! I cannot say enough about the customer service we received AFTER skiing at Cochran's. After a race, our daughter left her jacket and pants out by the deck. Marilyn found them and put them in a safe place. \nShe followed up with lost and found the next day, tracked us down, and even delivered the items to us an hour and a half away WITH a wonderful story to tell our daughter about one of her racing experiences. Some day our daughter will be sure to pay this forward. \nSmall ski hills are hard to find. Customer service like this is nearly impossible. Thank you Marilyn!!!! We will definitely be back to make some turns when we are in the area.\nSteve",
   "Best place for kids to learn to ski.",
   "Went in the fall for a wedding. There were tons of cars there for mountain biking. Looked great but I didn’t bike and it wasn’t ski season. Beautiful spot. The building is a bit older but very cool.",
   "\"Daddy, I want to win a gold medal like Barbara Ann.\" 30-year Cochran's skier here. Come with the right expectation. Cochran's is about kids first, racing second, and everything else third. If you want to tear up steep and deep woods, Cochran's 350' vertical drop isn't for you. But you won't find a cheaper place to ski, thanks largely to the outpouring of community support that Cochran's receives. If you are learning to ski, teaching others to ski, or just like hanging out with Olympians in a historic and convenient and affordable family-friendly environment, then Cochran's is definitely for you.",
   "Great family skiing, they care about the area youth and want to see them learn the proper techniques so they may improve."
  ]
 },
 {
  "name": "Birds of Vermont Museum",
  "address": "900 Sherman Hollow Rd, Huntington, VT 05462, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5d3ed2fe-9332-11ea-869a-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "art"
  ],
  "link": "https://maps.google.com/?cid=7434929470128082990",
  "source": "GoogleMaps",
  "reviews": [
   "Interesting. Some of the bird carvings aren't very realistic but give you a good idea of the coloring of the birds. Workshop was very interesting. Nice touch was there buttons at some bird carvings that played the sounds of the bird when pressed. Too hot to walk the trails the day I was there.",
   "It's great if you like looking at hundreds of wood carvings of birds.",
   "Had a fantastic time here back in August 2019. The bird carvings are incredible! Very very detailed. Lots of love birds to see in the area and nice trails to hike on all around the museum. It’s well worth the trip out!",
   "Amazing! Part wildlife experience part art museum. This place is great for people who love birds and also for people who don't. The wooden carvings are intricate and well done and super interesting to look at. The bird calls were fun to go through and see which ones I could recognize. They also have hiking trails and extremely helpful staff who is attentive and patient. Loved it here.",
   "This is a really special place, built by someone who loved it and it shows."
  ]
 },
 {
  "name": "Northfield Falls Covered Bridge",
  "address": "Cox Brook Rd, Northfield, VT 05663, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5d8fb24a-9332-11ea-9e46-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=18302513875809038281",
  "source": "GoogleMaps",
  "reviews": [
   "Was on our way to Vermont when we saw this beautiful place calling us to admire the love around it. The fall Bridges with a canal running beneath it, surrounding covered in snow with ponies looking at you is all you need to be in love.",
   "This is one of three Covered Bridges on the same road.  These bridges are still in use today and are in great shape. Easily accessable to capture many photos. Part of Vermont and American history. So happy Vermont takes care if them .",
   "It’s a nice bridge, I would recommend visiting in the fall.",
   "Historical bridges, water, and pleasant store.",
   "Lovely old bridge, one lane still in use.  The Northfield Falls are near by."
  ]
 },
 {
  "name": "Waterfront Park",
  "address": "20 Lake St, Burlington, VT 05401, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5de73aa4-9332-11ea-a11c-14b31f159f22.png",
  "tags": [
   "hospitable",
   "kids",
   "walk",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=1700173413674695957",
  "source": "GoogleMaps",
  "reviews": [
   "We were here for the new year's eve fireworks and bonfire and fire jugglers. It was a very memorable experience for us. We visited the aquarium and Skinny pancake nearby to finish off our night. \nThe people of Burlington are very hospitable. \nThe parking is very convenient.",
   "Beautiful place. I'm excited to see what they have in the summer. The skateboard park is near and I cant wait to take my kids on the bike path near by!",
   "My room, was standard. The view in my room of the harbor was beautiful!! The desk attendants as extremely helpful, professional and friendly as well as the valet staff. I felt very welcomed, however, room service and the restaurant was awful. There was a 2 hour wait each time, they forgot my meal when I was dining in the outdoor area. Took 1.5 hours. They did apologize and tried correct the problem. But b/c this was the third time, I gave up and decided I would not come back to the hotel. It’s convenient to the airport, I’m constantly traveling and wanted a permanent convenient location when I’m in the area but due to the extra long wait times three days straight, I will not return. Hopefully they’ve fixed their issues for the purposes of other guests.",
   "Beautiful place to walk along the lakefront. Bernie Sanders organized the purchase of the land, insisting that the waterfront belonged to everyone, not just a few rich people, when he was mayor Burlington.\nHe was a social Democrat, and Burlington is economically healthier because of his socialism. Everyone wants to live here.",
   "Gorgeous during fall. Lots of people taking walks or using the bike lanes near by. No bike traffic next to the lake. Burlington, Vermont is vibrant and simply beautiful during the long colorful Falls! Use the swings if you get there!"
  ]
 },
 {
  "name": "Shelburne Museum",
  "address": "6000 Shelburne Rd, Shelburne, VT 05482, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5e3e5d3a-9332-11ea-aa95-14b31f159f22.png",
  "tags": [
   "family",
   "walk",
   "knowledgeable",
   "historic",
   "family",
   "history",
   "walking",
   "art"
  ],
  "link": "https://maps.google.com/?cid=11149652520686680577",
  "source": "GoogleMaps",
  "reviews": [
   "Visited yesterday: a couple of buildings are open during October-May. \n\nThe highlight was an expert introduction to the American paintings in the Webb museum by Karen, who was working there. She was incredibly generous with her time and knowledge and we came away thrilled by the many insights she gave us. Thank you Karen!\n\nThe photographic exhibit was also powerful and  captivating and altogether, the visit which took us 2 hours, was well worth the $10 admission.\n\nHope to be back some day...",
   "Wonderful museum, huge campus. lots of different interests and subject matters to keep anyone in the family entertained. What a jewel for Burlington!",
   "Perfect place to visit with the whole family. Beautiful, historic, knowledgeable staff that enhance the experience as you walk through each exhibit. Can’t recommend the Museum enough.",
   "I loved that you were able to experience history from all over the state of VT in one location. We spent the whole day walking around outside, in and out these educational structures. The building where you buy your ticket, is also a store. I bought a beautiful fleece walking coat and a scarf while there. It is worth the time to browse through for gift ideas or for yourself! Be sure to check their hours of operation, since the actual historical structures are closed during the winter.",
   "Outstanding compound of buildings and galleries containing fine and folk art with beautiful view of Lake Champlain. Amazing."
  ]
 },
 {
  "name": "Mt. Philo State Park",
  "address": "5425 Mt Philo Rd, Charlotte, VT 05445, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5e8a5a1a-9332-11ea-9674-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "historic",
   "hike",
   "kids",
   "walking",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=7194368874730142217",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely views. Nice place to come for a short hike on a paved path. Shallow incline, won't take most people more than an hour to get up and down it (unless you picnic at the top). Philo gets pretty crowded in the spring and summer, but it's pretty vacant in the winter months. Great for older, smaller, or less in shape dogs!",
   "A lovely spot for a hike or a picnic. Many awesome vistas and photo ops. Camping here looks nice also. Some great facilities for larger groups and gatherings. A lovely and unspoiled forest and historic artifacts are there to be seen. This is Vermont's first State Park and has been enjoyed by many generations.",
   "On Christmas day my buddy and I went for a hike up Mt. Philo. It was fun and beautiful and I was so surprised at the amount of ppl who came to hike. A wonderful day, beautiful views. I'll be spending more time there in 2020",
   "Took a bag lunch to summit. Enjoyed glorious fall colors from picnic table. Wonderful! Lots of people walking dogs, even passed a group of home-schooled kids w/ parents. Hiking trails in the woods. A few campsites available. Adult day pass $4/person.",
   "We weren't quite prepared for the ice and snow but the views were worth it when we made it to the summit. Guessing it would be much easier climb on a dry path or with spikes. Worth the drive to check off 'hike' from our Vermont weekend bingo card."
  ]
 },
 {
  "name": "Great Vermont Corn Maze",
  "address": "1404 Wheelock Rd, Danville, VT 05828, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5eda9c30-9332-11ea-9e1d-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1038988122239339125",
  "source": "GoogleMaps",
  "reviews": [
   "Fun family experience. This was one of the best mazes we have went through. The kids were excited to ring the completion bell. There is also plenty to do when the maze is done. We would go back again when visiting Vermont.",
   "This is definitely a great activity in a scenic area (especially if you’re lucky to visit on a mild autumn day). It’ll take quite some time to complete, so those with children may want to reconsider this depending on your respective children’s tolerance levels. The staff members are friendly and helpful. \n\n(BTW: A relatively short span of the road(s) leading to the maze is quite rough & bumpy so please drive slowly & carefully.)",
   "It took us 4 hours to get out and we were frustrated by the end, but I guess that’s partly due to the fact that it’s a true “maze” - no map, just trial and error.... and it’s massive! Just when you’ve spend 90 minutes and think you’ve been everywhere, you realize you’ve only touched probably 10% of it. It was very satisfying to finally complete it.",
   "SO MUCH FUN! The maze took us about 2 hours, with some hints, the property was great, clean, great production value, well worth the ticket price! All ages fun and a GREAT day with friends! We even volunteered a week later at Dean North and we can't wait for next year!",
   "This is the one thing that we always plan to do every year as a family. It never disappoints. Plan on spending the whole day and come prepared with hiking gear and a sense of humor!"
  ]
 },
 {
  "name": "Quechee Balloon Rides",
  "address": "1 Village Green Quechee Vermont, Box 1010, Quechee, VT 05059, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5f2e3ad2-9332-11ea-ad0e-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "family",
   "family",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=985644083423121178",
  "source": "GoogleMaps",
  "reviews": [
   "What a great experience! Chris was knowledgeable, competent, and friendly, and we felt like we were in good, safe hands.  His mom and friend, Chris, rounded out the team as chasers and did a marvelous job.  The ride was incredible on a beautiful day-- I highly recommend if you're in the area and have never ballooned!",
   "What an experience.  Chris and his family made this adventure all, and more, than what we thought it would be.  If you have never taken a hot air balloon ride then this is the one to take.  Highly highly recommend",
   "Chris is amazing at what he does. I contacted him to help me create the perfect proposal and he was extremely helpful throughout the entire process. He and his family did a fantastic job of making the moment perfect and they got us tons of pictures to remember the morning! It is clear he really loves what he does and he works hard to make sure his passengers have a great experience. Highly recommend!",
   "From the moment my husband contacted Chris and even after we left, the level of professionalism gave us the highest level of comfort. I am afraid of heights and at no point in time I felt the need to worry. The most important thing for Chris is the experience and safety of his passengers. The sights were outstanding, the ride was a calming experience, and the mimosa and delicious pumpkin bread (prepared by his mom) upon arrival were a wonderful surprise. I would do it again and again.",
   "If you want an adventure, take a flight with us.  You will never forget it.  Should you have any questions please give us a call and we will be happy to go over everything and any special arrangements you may have.  Happy flying. "
  ]
 },
 {
  "name": "Kettle Pond State Park",
  "address": "4239 VT-232, Groton, VT 05046, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5f7c33ca-9332-11ea-8a68-14b31f159f22.png",
  "tags": [
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7162820952686621324",
  "source": "GoogleMaps",
  "reviews": [
   "Great overnight camping options on the remote sites. Short, but rocky/muddy walk along the lake shore. No mosquitoes this time of the year!",
   "Total peace and serenity love it here!",
   "A little water at the beginning but we were able to get around it and have a nice walk around the pond. Markings are terrible and you just pop out at some random lean too sites with  o si eage for an exit. All and all was a good time",
   "Great place to take a #winterhike with the pups",
   "Breathtaking views of the lake in the fall."
  ]
 },
 {
  "name": "Bristol Falls a.k.a. Bartlett Falls",
  "address": "24 Lincoln Rd, Bristol, VT 05443, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5fd0bc78-9332-11ea-8045-14b31f159f22.png",
  "tags": [
   "kids",
   "adventurous"
  ],
  "link": "https://maps.google.com/?cid=2480405474852906937",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful place! I've been visiting these falls ever since I was a baby. I have yet to be disappointed. This particular visit was different from any other trip. Some organization was holding a kayaking competition. It was absolutely fascinating watching the kayakers maneuver the main falls. It was definitely a day to remember.",
   "It's absolutely beautiful, but unfortunately lots of dirty needles found in the area. 😭 I brought my kids and came back to a broken window and stolen items, after our first and last visit. The actual spot is beautiful, however the jerks that hang out there make it a *@#t hole instead of a water hole!",
   "Nice views just off the main road",
   "Clear, clean water, and a beautiful waterfall. There are areas of calm, shallow water - perfect for young'ns, and deep pools with high rocks that are perfect for jumping - for those looking for an adrenaline rush. I travel an hour to come here, and it's worth it every time.",
   "A chill way to spend a sultry summer afternoon! Cool rocks, refreshing stream water, very Vermont. This place is popular with local and tourists alike - we send our adventurous happy chill guests there all the time June-September. Be forewarned: there are no lifeguards or any such nonsense. You are responsible for your own safety. The way it should be."
  ]
 },
 {
  "name": "Montshire Museum of Science",
  "address": "1 Montshire Rd, Norwich, VT 05055, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6038cd90-9332-11ea-9ce5-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "kids",
   "nature",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6086738548983945033",
  "source": "GoogleMaps",
  "reviews": [
   "New exhibit opened today! It is very thoughtful designed for the preschooler set. Safe, attractive and, given the enthusiasm of a room full of toddlers, very interesting too. Comfortable seating for watching caregivers. Climbing and crawling structures, stacking blocks, various interesting ways to roll balls, a bucket on a pulley to fill and empty endlessly, a telescope, puppets, magnets.... We really enjoyed it. Then of course we went over and got covered in soap at the bubble exhibit, as always.",
   "This is a great place for younger kids. Probably in the 8 to 10 range is the best.\nMuseum is large enough so the kids can really enjoy exploring but small enough that they don't need to be supervised 100% of the time. Parents don't have to tag along with their children they can take a seat at the base level on the provided benches and catch their breath while the kids have fun",
   "I've been going here since I was a kid in the 90s. Now I take my kids here. They're always putting up new exhibits. Whether you're 5 or 25, there are things here to catch your interest for hours and teach you new things. Prices are reasonable and staff are friendly and helpful. I recommend this place.",
   "An amazing place for kids and adults. The new Wonder Woods play area for young kids is great, and the rest of the museum is so much fun. Nature trails are fun to explore, and the water features outside are great on hot days.",
   "Perfect place for kids! Fun and stimulating.  Better than Boston Children's museum for slightly older kids(my son is 8 and we found that Boston Children's Museum was a little too young for him.)"
  ]
 },
 {
  "name": "Vermont Ski and Snowboard Museum",
  "address": "1 S Main St, Stowe, VT 05672, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6083f39e-9332-11ea-963f-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=1191630609923118491",
  "source": "GoogleMaps",
  "reviews": [
   "Cool little place 5 dollar donation encourage d, but didn't seem to be required. About 20 minutes of stuff to look at. Definitely worth stopping in.",
   "Great place to go with the Grandmother!",
   "I recommended to everyone.",
   "A must for all ski enthusiasts",
   "Quaint but none the less very interesting. They have a wide range of antique ski gear/exhibits for being so small. There's a small gift shop, too."
  ]
 },
 {
  "name": "Waitsfield Covered Bridge",
  "address": "Bridge St, Waitsfield, VT 05673, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/60d01cb4-9332-11ea-9775-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=6611802994060715982",
  "source": "GoogleMaps",
  "reviews": [
   "Another must visit Vermont Covered Bridge. Known as the Great Eddy or Big Eddy Covered Bridge, is a wooden covered bridge that crosses the Mad River in Waitsfield, Vermont on Bridge Street. Built in 1833, it is one of Vermont's oldest covered bridges.",
   "The covered bridge is a great swimming spot by the river that I’ve grown up coming to for over 15 years now. Great for kids and dogs alike. There are a few jumps into the river from the cement. One about 3 feet high, one about 10 feet high. Then you can also jump out of the widows of the catwalk on the other side of the bridge. Amazing spot 10/10.",
   "It was beautiful and was accompanied by multiple very cool stores and food stops. Jumping off into the river from the side of the bridge seemed to be a rite of passage for the locals and was extremely fun the become a part of.",
   "Historic bridge, easy to find, definitely worth driving by!",
   "We enjoyed seeing & driving across many of these old bridges in VT.  We were in VT for 6 wks.  We never tired of seeing the countryside, the beautiful old homes & farms with their HUGE BARNS.  Many had been taken care of & then some HUGE ones were be repair & that was sad."
  ]
 },
 {
  "name": "Vermont Teddy Bear",
  "address": "6655 Shelburne Rd, Shelburne, VT 05482, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/61247728-9332-11ea-9a54-14b31f159f22.png",
  "tags": [
   "tour",
   "kids",
   "tour",
   "family",
   "kids",
   "music"
  ],
  "link": "https://maps.google.com/?cid=840934735665024188",
  "source": "GoogleMaps",
  "reviews": [
   "Really disappointed.  \n\nI ordered a Vermont Teddy Bear for my wife on 2/12 and paid extra for guaranteed Valentine's Day delivery.  I received a receipt along with a tracking number and Vermont Teddy Bear pulled the funds out of my account.\n\nMy wife never received the bear on Valentine's Day.  I contacted Vermont Teddy Bear support and this is precisely what they told me:\n\n\"Hello Jeff! Looking at this order, there doesn't appear any indication to me as to why the shipping would display \"Canceled by Sender\", but I do absolutely see that is the case, and the package did not go anywhere.\"\n\n\"We would be happy to issue a reshipment, if that's something you would still be interested in, and we can absolute have your shipping costs refunded. Would this still be going to the same recipient address that's listed in this order?\n\nThat's it.  That's all they did to correct the situation.  My response:\n\n\"It's not Valentine's Day anymore.  Please issue a refund. Really disappointed. I can't trust you again.\"\n\nI absolutely do not recommend Vermont Teddy Bear.  If there was a way to give them zero stars I would.",
   "Wonderful tour of the facility. Our entire group of adults and kids had a great time. The gift shop was well stocked and so was the snack bar. Restrooms were clean and big enough that there wasn't a line to use them on a busy holiday weekend. Overall really wonderful positive experience.",
   "It took 50 minutes to get a hold of customer service (its valentines so that's not horrible) and the lady I spoke with was very kind and helpful. HOWEVER they lost my order and FOUR HUNDRED other orders on VALENTINES DAY. so now my surprise teddy to my S.O's office wont be delivered until 4 days AFTER valentines day...\n\nLastly if your calling customer service use option 3 and then 3, because option 3 and then 1 leads to a dead line after 6 minutes of waiting on hold.",
   "A must stop during a trip to Burlington. Cute bear cutouts for photos just outside the factory building. The tour is informative and you get cute bear buttons as well as little fur bears to attach. The tour is short so it's great for little kids with short attention spans. They even get to hold bears during a part of the tour. The store was fun too, so many bears to choose from. I got a teddy bear 30 years ago on a family trip and it was so nice to bring the kids to get teddies of their own.",
   "So disappointed.  I ordered on the morning of 2/11/20 and still haven't received a tracking number.  It was supposed to be delivered today (Valentine's Day)  which obviously it won't be.  So glad I paid for the upgraded shipping.  Worst of all if you try to call after 8 minutes the music stops and the phone seems to go dead.  I understand they are busy for the holiday but don't say it will be delivered by x day if you can't make sure it is going to be there."
  ]
 },
 {
  "name": "Stillwater State Park",
  "address": "44 Stillwater Rd, Groton, VT 05046, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/616ee92e-9332-11ea-95ae-14b31f159f22.png",
  "tags": [
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7199855907058183762",
  "source": "GoogleMaps",
  "reviews": [
   "It's alright.. The only thing is they tell u 930 no noise and kids get told not to talk if they laughing. Water is amazing lean-to and rent sites are great.",
   "Great state park with tons of hiking, motor and paddle boating, fishing and biking. There are some great tasks and it's very family friendly.",
   "Quiet park. Wonderful stay and experience.",
   "We rented a tandem kayak here and had a blast on the lake! Now that we got a chance to scope out the campsites, I would definitely stay here! So much room for activities!",
   "Park of the year. Best lakeside camping anywhere."
  ]
 },
 {
  "name": "Shelburne Farms",
  "address": "1611 Harbor Rd, Shelburne, VT 05482, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/61bf0ae4-9332-11ea-b50c-14b31f159f22.png",
  "tags": [
   "historic",
   "walk",
   "food",
   "historic",
   "free",
   "cheap",
   "eat",
   "tour",
   "walk",
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=11593567088107247235",
  "source": "GoogleMaps",
  "reviews": [
   "Shelburne Farms is a nonprofit education center for sustainability, 1,400 acres (570 ha) working farm, and National Historic Landmark on the shores of Lake Champlain in Shelburne, Vermont. The property is nationally significant as a well-preserved example of a Gilded Age 'ornamental farm', developed in the late 19th century with architecture by Robert Henderson Robertson and landscaping by Frederick Law Olmsted.",
   "Shelburne Farms is magical. First of all, it's pretty cheap to get in. It's less than $10 per person to spend an entire day here. Once you get your ticket, you can walk to the farm or get transported by a tractor. Since the property is HUGE, I'd wait to be transported.\n\nOnce you're at the massive historic farm that looks more like a castle, you'll be entertained for hours. They have chickens, rabbits, cows, donkeys, horses, sheep...so many animals that you can pet. They have programming throughout the day. Our daughter loved the chicken egg hunting! \n\nThere's a farm-to-table food truck there every day serving burgers, sandwiches, etc. \n\nIn the back of the property is the inn, which is beautiful. \n\nThere's a general store at the entrance/exit that sells jams, honey, and cheese. THE CHEESE! It is AMAZING! Eat all the free samples plus more.",
   "This is a beautiful and outstanding working farm with so many programs going on.I took the cheese tour which showed us all the steps of making their famous cheeses, plus seeing the cows and babies and milking operation.I love how they are committed to sustainable humane clean agriculture and will now buy their products.\nThe farm barn is a beautiful incredible building!",
   "Wonderful place to walk around, enjoy the relaxing time in the park, many events for kids with animals. Taking tracker(shuttle) was also great fun. Having drinks at shelburn farm watching the beautiful sunset was super cool. I appreciate my friends who took me here. We had such great time here.",
   "Such a beautiful place... lots of open spaces and trails to walk. Plenty of great views and places to explore. If you are visiting Vermont, this is definitely something you want to schedule on your itinerary."
  ]
 },
 {
  "name": "Smugglers Notch State Park Campground",
  "address": "6443 Mountain Rd, Stowe, VT 05672, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/620d04ec-9332-11ea-a9ff-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=12284656257689714226",
  "source": "GoogleMaps",
  "reviews": [
   "This place is absolutely stunning. Plenty of trails to choose from with varying levels of difficulty. There are mountains and waterfalls all in one place. Can’t wait to go back!",
   "Beautiful drive through the area on 108 with several hiking areas along the way and parking area/clean bathrooms at the top. If you're from out of town, the road gets very narrow... tractor trailers and camper drivers don't do it!",
   "Friendly staff! Secluded camp sites with the sound of a Brook running nearby as you wonder off into a peaceful tranquil land of green. Many places to see within a 10 mile radius. Many short hikes. Many more long hikes.  The weather was perfect for hiking (70's) while my fiance and I were visiting. June 9-11. Little chilly at night (40's) but it was not to cold for us in a tent with a hefty sleeping bag. Overall had a very pleasant stay at this camp ground and would certainly return for another visit.",
   "Don’t miss the drive from Stowe up to the Smugglers Notch State Park. \n\nIt’s perfect for summer and a dream during fall. Most suitable for foliage viewing and leaf peeping!",
   "Small, clean and comfortable campground. Just far enough outside of Stowe to be quiet and remote while not too far from the center to be inconvenient. Staff was friendly and helpful. This campground books up quickly, so reserve early."
  ]
 },
 {
  "name": "Killington Ski Area",
  "address": "3861 Killington Rd, Killington, VT 05751, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/62618e94-9332-11ea-a369-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "parks",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1520986826401966269",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome place to ski! Fresh trails, delicious food, great staff, stuff for everyone in the family to do if they ski or not. For example they have a roller coaster, a pool, and much more for non skiers to do.\nFresh trails, delicious food, great staff, stuff for everyone in the family to do if they ski or not. For example they have a roller coaster, a pool, and much more for Family members that don’t ski. For skiers you have so many options of trails, any ski school lessons for old and young, and amazing chair lifts To keep you warm on the way up the mountain. It is my favorite ski place I’ve ever been in my life.",
   "Skiing Killington in Vermont is the some of the best skiing I've ever experienced. The glades were the best I've ever skied. The downfall was how huge the mountain was (as crazy as that sounds) it was hard to become intimate with the mountain because it was so big. There were so many options, but it was hard to remember where specific glades were or where you were even on the mountain. It took us all 3 days to finally figure it out! Overall though no complaint the people were great, great snow, good lifts and the scanner makes lines a thing of the past. There were 2 great terrain parks while I was there, made by Woodward and Burton! My buddy was hoping they had their big park done when we went (mid January) but due to a warm winter they were just getting started on it. There were great options for all ski levels. Highly reccomend this place. I'm looking forward to comparing east coast mountains to west coast next year (hopefully). Stay tuned... Overall I give this ski mountain a 26/30 only because if you're not there for a couple days you will be lost (there are plenty of maps but you just end up not where you were expecting to be)",
   "I’ve been skiing 3 times so far and I’ve only ever been here. Go big or go home, right? 🗻🎿 The mountain has trained me well, I’m already frequenting the blue square trails! 🟦 Absolutely love the life of this place, super friendly staff, killer mountain and loads of fun all around! It’s an amazing environment, we’ll be back next weekend for sure!",
   "All the recent improvements have added to the skiing experience. Much safer and better for the beginner and intermediate skier. The construction of tunnels has changed the safety of all skiers. The long Great Eastern trail is great for beginners, intermediate and fun for more advanced skiers. The lodges offer excellent food and “reasonable “ prices. Efficiency at food services excellent. The new lifts have greatly improved the wait times. I truly believe the Killington experience is the best in the East! Jaykap",
   "Visited for the first time this past weekend and had an amazing experience from the rental facilities, ski lessons, customer service, bar service, and more. The lift lines moved quickly and many of the slopes were well groomed even on the warmer days. \n\nOur group had beginner and intermediate skiiers and everyone could find a trail or slope to keep them challenged but not overwhelmed. The efficient shuttle system from the lodge to the hotel was also a huge plus.\n\nAt one point someone in our group left a bag in one of the gondolas and the staff were eager to help us recover the lost articles and ensure we felt taken care of.\n\nWould definitely recommend a trip for anyone interested in a day or weekend on the slopes."
  ]
 },
 {
  "name": "ECHO, Leahy Center for Lake Champlain",
  "address": "1 College St, Burlington, VT 05401, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/62a22eca-9332-11ea-b6b5-14b31f159f22.png",
  "tags": [
   "kids",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=643415752018676613",
  "source": "GoogleMaps",
  "reviews": [
   "Was interesting, but definitely  more geared to/ fun/more to do for toddlers. We are one adult and a 12 and 10 year old. Was finished in about an hour, and that was pushing it. So almost  $50 bucks to all get in was way waaaaaaay over priced for what you get. Should be 5-6 bucks a person, absolute MAX...Not 14 and 17!  And that doesn't even give you full access.  :(\nYou Would  better off going out to a movie and all get snacks and drinks for that price.... and would  last longer.  \n\nThe more I think about how much I spent the more peeved I feel... as  this only occupied us for an hour.  at least it supports the animals they keep, who seem responsibly cared for.",
   "It's our local haunt. Present exhibit is butterflies. Very cool. Older kids are not going to find as much to do for repeat visits. But you've kids will love it again and again and again. Great place to go to get out in the winter. Break the cabin fever.",
   "Great aquarium and marine science center. There are exhibits that work for a good range of ages (including adults). They have a small movie theater as well as seasonal exhibits. We were able to see the butterflies this time. The membership applies to multiple places throughout the US.",
   "We visited this museum looking specifically for the butterfly seasonal exhibit and we got a lot more than we expected. Unbeknownst to me, this museum also has a specific focus on turtles as well, which are my wife's second favorite animal after butterflies(which she says are animals, don't blame me). What more is there to say about a museum? It was clean, informative, and fascinating with plenty of interactive exhibits to entertain even my adhd-addled brain. Certainly worth a visit if you find yourself able to make the trip",
   "Nice educational tour to understand the wildlife of Lake Champlain and surrounding area. We spent about 2.5 hours there and were entertained most of the time. We saw an Eel feeding and played with all the interactive exhibits. It was nice to see a wide variety of marine and reptile life up close.\nWe would recommend ECHO as a stop for anyone coming to Burlington for more than a day. See my funny face with a Muskie."
  ]
 },
 {
  "name": "Lake Champlain Chocolates Factory Store",
  "address": "750 Pine St, Burlington, VT 05401, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/62ec8fd0-9332-11ea-a2db-14b31f159f22.png",
  "tags": [
   "delicious",
   "tour",
   "knowledgeable",
   "delicious",
   "delicious",
   "drink",
   "tour",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=12785912609415022152",
  "source": "GoogleMaps",
  "reviews": [
   "Chocolate shop and factory. It's a quick stop. They do tours on the hour. The tours are a short lecture overlooking the factory floor. When we visited they did an ad hoc your for us as we were there on the half hour. You get samples at the end of the tour - delicious! You can buy \"factory seconds\" at a discount. Worth a quick stop.",
   "The best place for chocolate lovers!! Their chocolate tastings allow you to test out a few flavors before making your final purchases. They have everything from chocolate bars to truffles to seasonal specialities and even a coffee bar in the back. The staff is very knowledgeable and nice. Mostly, I love that they are a B-Corp and really care about making a bigger impact!",
   "Such a yummy place! The chocolates are amazing and there are so many options to choose from. The ice cream is delicious as well. Try the butter pecan, best I've ever had and I'm picky about my ice cream. Vermont cows and milk really make a difference!",
   "So delicious. The tour was a video and watching the bakers through the glass, but still interesting and the host was really good about keeping my dairy allergen in mind. Go to the drink bar and get some drinking chocolate. One of the best cups I've ever had. There's a discounted section of \"reject\" chocolate with some good deals.",
   "Chocolate tasting on Sundays.  Yummy!  The factory is closed on Sundays.  If you want to see them in action, don't go on Sunday.  If you do go on Sunday, they have chocolate tastings.  win-win 😁"
  ]
 },
 {
  "name": "Pinnacle Meadows, Stowe Land Trust",
  "address": "Pinnacle Heights Rd, Stowe, VT 05672, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6331fde2-9332-11ea-8ca6-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=13244279224414423162",
  "source": "GoogleMaps",
  "reviews": [
   "Nice hike, steady climb, rock scrambling near the top.  Beautiful 360 degree views!!  Well worth the climb!",
   "Mixed terrain with some rocky sections. Pure fun for youth but a bit more challenging for those of us not so young🥴.  Great views at the top. The two labs were special.",
   "Awesome view! Steep climb.",
   "Very cool hike, there were dogs at the top.",
   "Quick beautiful hike."
  ]
 },
 {
  "name": "Oakledge Park",
  "address": "Flynn Ave, Burlington, VT 05401, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6387596c-9332-11ea-93f3-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "parks",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=1663988844157307000",
  "source": "GoogleMaps",
  "reviews": [
   "Such a beautiful park, so many hidden and tucked away spots in the trees, to enjoy the beauty of lake Champlain. I like people alright, but sometimes a peaceful moment alone is good for the soul. Visit early morning to early afternoon, or late night. This special place can get quite bustling at times.",
   "Wow, what a great park.  An older style playground that is still fun, with a new accessible playground being built.  Has a great bike trail, ledges for sunbathing, a beach, fields and courts, and a tree house?  Kids loved it.",
   "I absolutely love this park. There is plenty of parking. Volleyball and tennis courts, easy access pavilions with bathrooms in the summer. A few grills to cook on, with plenty of beach space. It is one of the best sunset parks in the area. Not as busy and crazy as waterfront park while still having similar amenities. The only feedback I have is that I wish they cleared/plowed the bike path that goes through it during the winter time. If its winter, walk at your own risk the path gets incredibly icy.",
   "One of my favorite parks. The Earth Clock has special meaning to my husband and I. We were engaged here. There is a small beach and trails around the area, and it's along the Burlington Bike.",
   "Oakledge Park is the ultimate getaway, especially in the summertime. There are plenty of things to do in the park, like play on the swings, use the tennis or shuffle ball courts, or relax by the water along the rocky cliffs and take a quick dip. The summer sunsets here are perfect and the cooking/eating areas are well-kept. The perfect spot for anyone visiting Burlington!"
  ]
 },
 {
  "name": "Boyden Valley Winery & Spirits",
  "address": "64 VT-104, Cambridge, VT 05444, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/63d1bd78-9332-11ea-b866-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "winery",
   "knowledgeable",
   "tasting",
   "tour",
   "tasting",
   "delicious",
   "family",
   "tasting",
   "unique",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=13879612589525640629",
  "source": "GoogleMaps",
  "reviews": [
   "Loved everything we tried here. There was a lot of variety (in wine varieties and other things such as cider), and Jamie was a personable and knowledgeable host. Also greatly enjoyed the well done cheese board and chocolate boards with a glass of wine on their patio.",
   "My girlfriend and I visited Smuggler's Notch area this past weekend and stopped by at Boyden Valley Winery. \n\nWe instantly liked the atmosphere and enjoyed the knowledgeable wine tasting with Tina. \n\nAfter that we sat on the patio and enjoyed each one of our favourite wines from this winery. We loved this place very much. Definitely worth a visit.",
   "Great tour and tasting. Picturesque setting. Highly recommend.",
   "Excellent vineyard with delicious dessert wines. It is always a place we take friends and family. The tasting is wonderful but I was personally disappointed the tasting fee wasn't waved after spending several hundred dollars purchasing 8 bottles of your product.",
   "Just an excellent experience with a great variety of unique wines.  The Cranberry wine is quite unusual.  The staff is very friendly and the tour of the compact but modern facilities was very informative, especially for us engineer types."
  ]
 },
 {
  "name": "Three Penny Taproom",
  "address": "108 Main St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/641a866e-9332-11ea-905e-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "delicious",
   "hike",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6534903462561019340",
  "source": "GoogleMaps",
  "reviews": [
   "The food is absolutely delicious. I’m vegetarian and ALWAYS struggle to find a good homemade veggie or black bean burger so I never get them. I ordered a black bean burger from TPT and it was the most scrumptious burger I’ve ever had! The fries are crispy and delicious and the variety of beer on tap is delightful. My partner got the pork sandwich and ate every bite. The waitress was kind and attentive. The atmosphere was home-y and relaxing. The prices are reasonable for the quality and quantity you get. It’s a bit far from where I live but I will definitely make the drive out there again to eat their food. Not a single complaint!",
   "I came here after a long hike and had a delicious meal and beer here. I ordered the braised pork sandwich with fries and cheese. It was DELICIOUS! The pork had a nice flavor but the bun really made it a great taste; it was burned in a perfect way that created a smokiness for me that I enjoyed. The cheese fries were delicious and went well with the beer I had. Friendly service and a beautiful downtown area!",
   "There are 24 craft beers on tap about 12 more in cans and bottles. Good selection of regional and popular craft beers. The food was decent, tried the poutine and enjoyed the flavor - it was a little bit on the salty end though. I prefer the wings with sauce already on them, but the chili flavor gave a positive bite at least. Friendly staff. Conveniently located in downtown Montpelier.",
   "My boyfriend and I met here, everyone there is so friendly and I love that they keep their products local. Everyone is so nice that works there, we make it a point to come back at least every six months. Thanks guys!",
   "Best bar food around, hands down!! They have a guy who is a Pickle freak and he does all the pickling for the joint, and let me say that I dont eat pickles, but tore them things up, plus they have pickled pumpkin. I order the Chicken Liver Mousse and I didn't know what it was,but it was freaking Aaamazing!!!!#@$@@#"
  ]
 },
 {
  "name": "Sugarbush Farm",
  "address": "591 Sugarbush Farm Rd, Woodstock, VT 05091, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/64643a74-9332-11ea-8c23-14b31f159f22.png",
  "tags": [
   "delicious",
   "tasting",
   "delicious",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=15926595486231202960",
  "source": "GoogleMaps",
  "reviews": [
   "We’ve stopped at Sugarbush farm a couple times now and had a great experience every time. The people who work there are super friendly and very helpful. We’ve tasted a ton of cheese (all delicious!) and maple syrup (so interesting to taste how the syrup changes depending on when it’s collected). We just visited in the dead of winter and my three year old got to pet goats (extremely social) and see bunnies hopping around which she loved. Then we all ate a ton of cheese and left very happy with a three year cheddar and a gifted bag of ends. Can’t wait to go back again.",
   "Such a cute place to stop! Off the beaten path but not too far out of the way. We sampled a bunch of fresh cheeses made at the farm, homemade maple syrup and then they had a little store section of other dips/jams/etc to sample. The cheese was so good we ended up purchasing some to take home. Really kind, cute place.",
   "The cheese here is incredible!! Best cheese I've ever tasted!! Not only that, they also have a large tasting room full of other goodies to sample like syrups and jellies and honey and hot sauces! Along with an amazing gift shop! The drive out to the farm is beautiful and serene. This was my favorite stop in Vermont during our Fall East Coast road trip.",
   "Loved our visit there! Got to learn about the manufacturing process of their delicious maple syrup. Wonderful staff - well worth taking the time to visit.",
   "Awesome! So much VT in one spot. They really make the farm and maple sugaring an accessible experience. Also the cheese is fabulous."
  ]
 },
 {
  "name": "Slaughterhouse Covered Bridge",
  "address": "Slaughterhouse Rd, Northfield, VT 05663, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/64c8c852-9332-11ea-b8f0-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6668864659542204664",
  "source": "GoogleMaps",
  "reviews": [
   "Nice little parking space. Off the beaten path. + a bonus tire swing (in season)",
   "Beautiful covered bridge right down the road from Norwich University.",
   "My favourite covered bridge in the area",
   "Beautiful setting with easy walk down for river view",
   "I grew up here."
  ]
 },
 {
  "name": "VINS Nature Center",
  "address": "149 Natures Way, Quechee, VT 05059, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6517f9e8-9332-11ea-8986-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "family",
   "kids",
   "walk",
   "knowledgeable",
   "walk",
   "free",
   "organized",
   "history"
  ],
  "link": "https://maps.google.com/?cid=83579834052231198",
  "source": "GoogleMaps",
  "reviews": [
   "Great outdoor adventure for kids and the family.  You enter and exit through the gift shop.  From there you head out on to trails with artwork and fun places to stop.  Along the way there are buildings that host presentations on wildlife.  Presenters are informative and fun - and kids like seeing wild life up close.  There are also areas where you can view birds and other animals.  There are bathrooms in buildings along the way.  Our favorite part is the canopy walk that goes up into the tops of trees.  The fencing had wire mesh over the boards, so I wasn't worried about my toddler going between slats.  😊 A fun day visit.  But there is enough to do that you could come back at many points and find something new each time.",
   "We stopped here once in 2008 out of curiosity. Since then this is always one stop on our vacations. You will be in awe of not only the raptor but their staff is caring and full of info. Now every time we look to the sky we challenge each other on what type of raptor we are seeing. Please go bring the kids you won't be disappointed.",
   "VINS provides an amazing experience for everybody at all ages.... The staff is very professional, friendly,  and knowledgeable. The aerial walk is simply a structural wonder and so much fun!!!! The cause for rehabilitating birds who have been injured and releasing them back to the wild if possible (or providing a home to birds who otherwise cannot live in the wild on their own) is a very admirable one and they do an amazing job! We highly recommend this place and we will be back yet again.....",
   "Canopy sky walk is fantastic! I'm afraid of heights and I still loved it! The viewing area for the owls and raptors is wonderful as well and I can't wait to walk the trails next time. You can borrow snowshoes free of charge...great day out",
   "This organization does great work for ornithological preservation and history.  The overall atmosphere and energy is very friendly. Intelligent. Clean. Well organized. The new skywalk is wonderful. A must visit place when you're in the area."
  ]
 },
 {
  "name": "Marsh-Billings-Rockefeller National Historical Park",
  "address": "54 Elm St, Woodstock, VT 05091, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/657730d0-9332-11ea-89d8-14b31f159f22.png",
  "tags": [
   "family",
   "history",
   "walk",
   "history"
  ],
  "link": "https://maps.google.com/?cid=16322990254290822522",
  "source": "GoogleMaps",
  "reviews": [
   "Nice farm and history. The place has staff around that informed you of the history and we're dressed for the period. Well kept and clean, great for a family outing. If you grew up around farms maybe not so interesting. Plenty to see though, would recommend on a nice weather day.",
   "A walk back into Vermont history.  Displays how three successive families lived in the upper Connecticut River valley.  Tours conducted by the National Park Service so you can enjoy every detail of life lived over the past 200+years. Don't miss it.",
   "Really cool farm in the middle of nowhere really. Lots of cool animals. My son loves the animals and petting them. If you’re around go here for sure.",
   "Although historically interesting with beautiful architecture, this is a wonderful place to just get outdoors.  There are lots of tree covered carriage roads and hiking paths that weave the property.  We hiked up to the Pogue, which is a beautiful pond, especially this time of year (fall) with the foliage peeking through.  \n\nParking is convenient and plentiful across the street.  There is no entrance fee to the park, but if touring the buildings, there is a charge.  Reservations are suggested for the house tours.\n\nThere are lots of activities everyday, so check online for the schedule ahead of time.",
   "This is a very cool national park, built on the idea of sustainable conservation. Definitely worth a visit!"
  ]
 },
 {
  "name": "Kismet",
  "address": "52 State St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/65c30776-9332-11ea-9b22-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8137942710106196870",
  "source": "GoogleMaps",
  "reviews": [
   "There are places that are blah and there are places that are good... KISMET isn’t either of these!! I was here 3 weeks ago and haven’t been able to get this place off my mind. From the food and drinks to the service, it was beyond excellent. If I lived close I would be a regular here. \n\nPictured is the Smoke on the Water 🍸, Bread Pudding, and Seared Beef.",
   "Fantastic little restaurant near the State Capital. They unlocked the door to let us wait inside as it was about 2 degrees outside and we were a little earlier than expected which was greatly appreciated! Staff is very friendly and seemed to know about three quarters of the guests that arrived on a saturday morning. Nice casual and almost homey atmosphere. Food was excellent I had the sausage and biscuits which was enough that I couldn't even finish the whole thing, had an interesting flavor to it as well that made it stand out in a good way! Will definitely go back here when I am in the area and in need of a delicious meal that is locally sourced and very filling.",
   "Brunch is excellent! They had such fun cocktails (like a ginger mimosa!), a variety menu and great service. It's a smaller restaurant, while we only had to wait maybe 20 minutes for a table at brunch I can imagine this place fills quick for dinner. I will definitely be back!",
   "Absolutely perfect food and wine list, in a lovely atmosphere with beautiful humans! I can't wait to go back. 10/10 will dine again!!",
   "Best Restaurant in Montpelier! Pork was exceptional, French onion pudding was great, fish was good, breakfast was exceptional. We went three times in our short stay! Go, enjoy, make reservations ahead of time though!"
  ]
 },
 {
  "name": "Sarducci's",
  "address": "3 Main St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6608753a-9332-11ea-a213-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "free",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2772418855636953042",
  "source": "GoogleMaps",
  "reviews": [
   "HOLY SMOKES IS THIS PLACE EVER GOOD!\n\nPrices are very reasonable. $20 for one of their nicer meals and I promise you couldn't be more satisfied.\n\nGo get some delicious Italian food. You won't regret it. \nI'm from the coast of Maine and even I think the seafood here is absolutely delicious!",
   "If I had to judge this restaurant based on my last visit I probably would question myself on whether I would go back or not. I have been there three times before.  Twice for dinner with reservation, and my last time was for lunch. Both times for dinner were a great experience. I would recommend this place for dinner because it felt 100% different during the evening than it does in the daytime. My last visit was for lunch, we were sat on a table with the water view, our first 15 minutes after sitting down we were greeted once and barely payed attention to. The sun was beaming through the window so hard I couldn't see anything from the reflection off the table and silverware, I had to move seats and sit the opposite of my friend in order for us to not be blinded by the light. The soda I ordered was extremely flat it tasted like sugar water, when I told the waitress she got me a different soda and it still tasted the same. I was upset I even paid a couple dollars for that. The service at that time was very mediocre, the waitress wasn't very attentive or happy. The one thing that shocked me the most about this place and I'm not sure if it was the time of the day or because we were sitting by the window where we could see the silverware well, but they were not polished at all, in-fact they looked really gross and dirty. My friends spoon was very greasy as well. Overall I was not impressed with the cleanliness and the service that was received on my last visit, it changed how I feel about this restaraunt. The food was very tasty though every single time I have been there and I would still recommend this place for a nice evening time dinner.",
   "Very good , very Italian food, very helpful service. Could use a few more vegan options but they've adaptable. We love it!  Not inexpensive but no more than any truly good VT restaurant. One of my favorites!",
   "First, I was amazed at their gluten free sections, WOW!  My daughter has Celiac and going out to eat can be a bit scary, especially Italian food.  \n\nThe food was delicious!  The portions were perfect and the staff was outstanding.  I really can't think of a single thing that was fantastic about this place.",
   "Solid choice with great menu options from salads, to pastas and pizza.  The mussels with tomato broth were excellent.  The Apple salad and Caesar were the perfect size for dinner."
  ]
 },
 {
  "name": "Wilaiwan's Kitchen",
  "address": "34 State St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/665bc574-9332-11ea-9174-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "art",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4391229086071969547",
  "source": "GoogleMaps",
  "reviews": [
   "Best Thai food I've ever eaten, hands down. Worth the visit every time and undoubtedly some of the most flavorful food on the East Coast. Stop in Montpelier and bring cash!",
   "Awesome food. Get here early!",
   "My wife who is from far away loves this food,way to hot for me,always crowded so I give 5 stars because what do I know,I think if there were lower levels of heat I would love it also.Great flavor just before my tongue went numb.",
   "You won't find more authentic Thai food anywhere around here for miles. They only offer a few dishes each day, so you have to keep visiting to fully appreciate what they have to offer.\n\nOh, and cool art for sale too.",
   "All the items in the menu tastes amazing! Love Khao soy, Massaman curry and Yam gai krob. You can check their Facebook page to see the menu. Every week menu changes. And they accept either cash or check"
  ]
 },
 {
  "name": "The Blue Stone - Montpelier",
  "address": "83 Main St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/66a2f41c-9332-11ea-b6ef-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=12245750658173211070",
  "source": "GoogleMaps",
  "reviews": [
   "Great pizza. Nice crust and great selection of local brewed beers. Small space so you may have to wait especially on Fridays and Saturdays",
   "Visited The Blue Stone for my first time tonight. Went with my wife and brother. A very nice atmosphere. The smaller dining area makes way for a comfortable and less crowded and noisy atmosphere of other local restaurants. Steph, our server, was very courteous! Always had a welcoming smile and was super attentive. It was only when we were leaving that we learned she was serving alone. Didn't notice, she was such a delight!!! Didn't come across stressed or overwhelmed once (I hope her manager reads this). The menu selection was huge! Lots of unique delicious choices. Will be frequenting this spot as one of our new favorites for sure!",
   "Cozy pizza shop with a great street view. Seating is limited, but the pizza is delicious. We got the 10 inch namesake plus two sodas for $20, or you can also get a deal for $8.50 with two big slices and a soda. The bartender was friendly and attentive. Highly recommend!",
   "Cozy bar, friendly staff, stellar draught selection and wicked tasty pizza.",
   "It's a good place for a quick pizza"
  ]
 },
 {
  "name": "Pho Capital",
  "address": "107 State St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/66ee2de6-9332-11ea-bb80-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "affordable",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1296776772318308115",
  "source": "GoogleMaps",
  "reviews": [
   "This place is wonderful! I have been there a few times and always recommend it when I go to Montpelier. The food is delicious and very affordable. And the portions are just the right size. The place is small but cozy. The staff is very attentive. Definitely check the place out you won't be disappointed.",
   "Vietnam never tasted so good.  Great flavored foods.  Dumplings were very good.  Soups are very tasty.  A very nice place to eat.",
   "The food hit the spot! The pho in particular was perfect on the cold day of our visit. Service was friendly and reasonably speedy. The only issue was there was no customer service staff when we arrived so we didn't know if we could just grab a table or wait to be seated. We stood for about 5 minutes before someone emerged from the kitchen. A sign at the entrance would have been nice.",
   "My husband and I have eaten great Vietnamese food in many parts of the world and we both would rank this restaurant very high. Not only is it very reasonable in its prices but the food is delicious. We ordered the lemongrass stir fry and the spring rolls and both were outstanding. We will come back again for sure. Also, the service was great and our waiter was so friendly and efficient..",
   "I will refrain from using words to describe Pho Capital as this place is a must go and  don't be deceived by its location as great things are usually found in unexpected places."
  ]
 },
 {
  "name": "Royal Orchid Restaurant",
  "address": "38 Elm St #1, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/673410a4-9332-11ea-9fd3-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14865577791156249704",
  "source": "GoogleMaps",
  "reviews": [
   "The food is delicious.  I had the seaweed soup which was pretty good, although I personally like the tom yum better.  As for my entrèe, that was absolutely amazing.  Perfect level of spice, fresh and crisp veggies, the egg noodles had a perfect texture, and the chicken was of better than average quality.  \n\nThe service was where this place lacks a bit.  It was slow and there appeared to only be one waitress and one bartender, but several tables full of customers (so we figured the food must be good).  I personally work in the service industry and it seemed that this place may be a little understaffed, but the food was worth the wait and they definitely make sure it's done right before it gets sent out.\n\nI know how it gets in the industry, so I gave them the benefit of the doubt and still left a decent tip.  I will be back and I will be recommending this place to my friends!",
   "Clean food. Great taste. We arrived 4:30pm on Saturday. Seating filled by 5:15pm.",
   "Amazing food. Outdoor seating available and they are pet friendly. They even brought a bowl of water for our dog and he enjoyed having lunch with us here. I will definitely recommend this place and will visit again. Bean vermicelli dish was out of the world",
   "A nice surprise. Authentic Thai food in Montpelier. Food is well prepared the right way. I will definitely return when I'm in town again.",
   "Delicious, flavorful Thai food. Happy to adapt for vegan and vegetarian."
  ]
 },
 {
  "name": "Mad Taco",
  "address": "72 Main St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/67810c9a-9332-11ea-a9f4-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "food",
   "food",
   "brewery",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=14565175299965479294",
  "source": "GoogleMaps",
  "reviews": [
   "Cramped space, bench seating at shared tables. Loud, locally-hip crowd. Small bar with drink specials. Slow service, short staffed, but friendly and working hard... the food was pretty great. Cubano sandwich was fantastic! On house made bread. Everyone enjoyed their food, maybe slightly more for the wait, hunger being the best spice. No parking... local clue; park behind city hall and fire department ;) Easily visible from the street. I'd give 3.5 stars if possible... not quite 4. Not super keen on the dog in the restaurant. Pretty  sure that's not cool with code... Overall, the nonchalant attitude, rough presentation, and delicious eats make a reasonably authentic experience. Worth a visit for sure, just don't go if you're already hangry.",
   "Loved it. Tasty tacos and fair in downtown Montpelier with a certain local feeling of deliberate attention to food prep. Deliberately devoid of fanciness but full of elbow to shoulder taco fans patiently waiting their turn to pay and enjoy. Follow the locals to this favorite destination for a New England serving of grub and beer you won't regret.",
   "Good options. Meal looked a little small when it first came out but was surprisingly filling. Flavor was great. Would definitely come back.",
   "This is an excellent place to get tacos in Montpelier. They have a wide selection of beer, including Heady Topper and Focal Banger from the Alchemist Brewery. They also have an assortment of about half a dozen hot sauces that are rated on a 1-10 scale. My favorite are the Kimchi Tacos with the Shallow Days hot sauce.",
   "really delicious and fresh made tacos! bonus for draft beers and great service. small spot, basic with no frills counter service."
  ]
 },
 {
  "name": "J Morgan's Steakhouse",
  "address": "100 State St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/67c73ef4-9332-11ea-8974-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "unique",
   "walking",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6563772200011100807",
  "source": "GoogleMaps",
  "reviews": [
   "Food is very good but prepare to wait a LONG time. Service was good as well. Food took just short of an hour. We ate a wide variety of menu items and they were all Very good. Ourselves and everyone around us waited a very long time to get our meals. I will return again because the food was good and see if they have gotten better and then raise my stars if so!",
   "The steak burger was good, and I really like the fries that come with them. The decor was great and it was a nice atmosphere. The food was a little more expensive than I expected but still not too bad. The service left a little to be desired, but considering it was a holiday I won't really hold that against them. I would come back here to try more of the menu when I'm back in the area.",
   "This place is so wonderful. Walking in and seeing the miniature trains going on tracks above the door and the bar area is so unique and brought me great joy. The whole restaurant has a beautiful layout and the tables are made to seat large parties. We had a group of 9 and the environments allows for great conversations. The staff was wonderful! I had the wagu and shrimp special and it was so good! Finished the meal off with a brownie sundae and an expresso. This is by far one of my favorite steak houses!",
   "All of the food was fantastic, and the service was impeccable. \n\nThe Caesar salad was one of the best I've ever had, they put the right amount of cheese on it, and it was completely chilled. The steaks were of course amazing, cooked perfectly. My rare was rare. \n\nAnd because it was our anniversary, they gave us a beautiful desert which was absolutely delicious.",
   "Great brunches and big buffets. The hotel has antiquated rooms but my wife and I thoroughly enjoyed our stay and meal. Also the movie theater is 50'away!"
  ]
 },
 {
  "name": "Buddy's Famous",
  "address": "15 Barre St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6815aff8-9332-11ea-9654-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=10932837386056127787",
  "source": "GoogleMaps",
  "reviews": [
   "Great spot! Cheesesteak and cheeseburgers were very good! Fresh fries & awesome shakes! We will be back for sure!",
   "What a great place to eat!! We stumbled upon this eatery while driving to NH.  What a find!  It was extra clean, courteous,  helpful staff.  The food was great! French fries were amazing!  The hamburgers were juicy and perfectly cooked.  There were many condiments for the food.\nWe haven't had milkshakes for a long time but got them here and we were very pleased!  \n\nThe prices were very reasonable, and we will definitely stop here another time.",
   "Excellent food safety, careful preparation, order fulfillment and delivery. Tasty burgers that make me feel like I'm at home. It's not local, but what can you really ask for during the greater depression?",
   "Delicious, Flavorful, Filling burgers. Great fair price for a lot of food. Excellent staff who are friendly and a clean inviting dining room. Buddy's is the spot!!",
   "This was a gem of a find. Parking is not plentiful, so you may need to pay a meter like us, but it was worth it. The burgers, grilled chicken sandwich, and grilled cheese were great. The chicken strips were good, but I couldn't tell if they were fresh or store bought. The fries were fresh and relishes, and the tater tots were super crispy and delicious. We also had a variety of shakes from peanut butter cup to oreo to oreo with peppermint, and all were delicious."
  ]
 },
 {
  "name": "Pho Thai Express",
  "address": "54 Main St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/685c569e-9332-11ea-85f8-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9676228601103993608",
  "source": "GoogleMaps",
  "reviews": [
   "Enjoyed the food here. Very flavorful and filling. The man at the counter was friendly and helpful with suggestions. Dining area is kept clean and tidy. Highly recommended!",
   "My family went to this restaurant yesterday October 21, it was horrible experienced we ever have encountered for Asian restaurant. The  MOST RUDEST PERSON EVER and he is the owner ( which you can see his photos on the wall inside that restaurant.\n\n1) We entered My husband, our son and I... we went direct to the counter to checked the menu, but my husband was rushing to the restroom... immediately that man stopped my husband from going to the restroom in the rudest way.\n\n2) He was rushing us ( our son and I ) to order which we were still thinking of what we feel like eating that moment. \n\n3) After we order the chi curry ( which he forced us to order in a quick decision )..... then he immediately asking us to pay it right away which I was still looking at the menu.\n\n4) When my husband came out the restroom.... he said to us “ maybe we should just eat here instead in a car as it maybe messy to eat in that car! .... that man immediately said we should have told him right away as he already put in the container. We even say not to worry about changing into a plate we will just eat it direct from the container..... he was so extremely rude ..... we couldn’t stand his rudeness, so we decided to leave.\n\nWE WILL NEVER EVER ORDER IN THAT RESTAURANT EVER AGAIN! \nTHE FOOD IN NOT EVEN THAT GOOD.",
   "Love their soups. I do them as take out. Never disappoints.",
   "It was just ok. Not much options for pescitarians. The broth used for the pho was ok. Servings were big.",
   "Food is great and the owner Sam is awesome. He always makes an effort to remember his repeat customers and is super friendly!"
  ]
 },
 {
  "name": "NECI on Main",
  "address": "118 Main St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/68a4aa18-9332-11ea-9fdc-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1597515171916063430",
  "source": "GoogleMaps",
  "reviews": [
   "Cutest dining room in Montpelier right now. Downstairs hidden gem. Craft beer, cider, cocktails made from scratch. Local spirits and great selection of whiskey and bourbon. Chef Adam Noe created menu.",
   "The meal was great. The staff/students were very attentive and pleasant. They went above and beyond to ensure our large party (20+) was satisfied.",
   "Hoity toity tasty food!",
   "Unfortunately the restaurant is now closed!",
   "Great food, very good wine selection, quiet, classy environment.  It is run by a culinary school, must try it.  And the pricing is reasonable.  Good value."
  ]
 },
 {
  "name": "Positive Pie Inc.",
  "address": "22 State St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/68e50e88-9332-11ea-948a-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13663029892949242955",
  "source": "GoogleMaps",
  "reviews": [
   "Great food, and awesome tap list. Prices vary: A slice and a switchback for ~$8 at the bar, but full specialty pizzas get expensive quickly. Lots of other great meal options on the menu too. \n\nThe place for pizza in Montpelier",
   "Tomato Sauce is Red,\nCheese is White,\nPositive Pie Pizza, \nIs Outta Sight !!!!\n\nThe guy at Positive Pie in Montplier VT went out of his way to speak and introduce himself and offer a complimentary slice of pizza. OUTSTANDING HUMAN - OUTSTANDING GESTURE!!! In these weird times, it is people like this that hold our community as a whole together and offer light at the end of the tunnel.\nGratis!!",
   "Heard tale of this pizza place since we moved here from Tennessee. Finally got the chance today and I was not disappointed! The white garlic sauce was amazing! Will go back here again.",
   "Really great food and atmosphere, the staff is very friendly. The only reason I'm giving 4 stars is for the prices, it's good but maybe not that good for the price.",
   "First time visiting the Mont and this place looked welcoming to me, so I figured what the hell? Inevitably, it was a great choice because I was hungry! Also, having the Alchemist's flagships on hand may or may not have played a major role in this review..."
  ]
 },
 {
  "name": "Bagitos bagel and burrito cafe",
  "address": "28 Main St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/692a06fa-9332-11ea-a625-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "music"
  ],
  "link": "https://maps.google.com/?cid=9398805507676460731",
  "source": "GoogleMaps",
  "reviews": [
   "Good food and service. Live music and beer too! Bagels could be chewier. Super confusing choice to serve bagels, sandwiches, tacos, burritos, and Indian food- maybe a more focused offering would be more successful? The restaurant is up for sale for $66k all in if you're interested. See attached pictures for full menu",
   "The beauty of this place is the openness to other languages and musical traditions. Live traditional music from Ireland or Italy are some of the events that are presented. Perhaps a bit of cleanliness would make the place better. Also, there are crates at the entrance offering books for exchange. They only had newspapers. I just had a cup of tea at this place whose forte are bagels...",
   "This place was really cool. I walked in on an early morning for a bagel and there was a folk violin group jamming out. Bought a bag of cinnamon bagel chips too. They were fairly good. The bagel itself(everything) was ultra fresh and good.",
   "Great niche place with a relaxing vibe and interesting concept (bagels and burritos). Friendly staff and tasty burritos.",
   "Very good bagels and cream cheese! Awesome coffee too. I love this place."
  ]
 },
 {
  "name": "Wayside Restaurant, Bakery & Creamery",
  "address": "1873 US-302, Berlin, VT 05602, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6974f2fa-9332-11ea-8b4f-14b31f159f22.png",
  "tags": [
   "affordable",
   "tasting",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2689403234250832647",
  "source": "GoogleMaps",
  "reviews": [
   "Took my friend down memory lane today. She used to take her Mom here every Mother's Day. Good eats - even took home a dozen rolls to enjoy. Good service. Good selection. Good prices.",
   "A good ol' greasy spoon diner. Friendly staff and affordable pricing. Oh, and the donuts are amazing!! Things to know: Saturday and Sunday brunch times are very busy. Easy to seat 1to 4 people. If you have a party bigger than 4, expect to wait. Few tables for big parties. All in all, a great place!",
   "This 102 year old restaurant was a treat to go to. Our waitress was very pleasant and accommodating. The food was good and came out in a reasonable time. We also tried Moxie for the first time and she brought us tasting cups for everyone at the table.",
   "Always a good time at the Wayside!! This place opened in 1918 I believe if that tells you anything. The food is incredibly good comfort food at a more than fair price. There is a cool old Vermont feel and the staff is always great!! This is where the locals go.",
   "You're safe if you stick with burgers or soup, easy items. I am sorry I ordered scallops. They were in a dish full of hot butter, no taste and rubbery. The coleslaw or whatever it was was swimming in bottled Italian dressing. The rolls were good. Will order something safer if I ever get stuck there again. Cannot believe how packed the place was, and always is. Shows how few good restaurants there are in that area."
  ]
 },
 {
  "name": "The Hippie Chickpea",
  "address": "41Elm St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/69c0f122-9332-11ea-8e20-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "eat",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7428349476862665921",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of my favorite restaurants in Montpelier! We visit usually once a week, and everything is always perfect. The food is delicious, and the coffee and hot chocolate are incredible as well. Not only is everything delicious, it is consistently good. Some restaurants around here are very hit or miss, but we have never had a bad visit here. I can always trust I'll get a good meal when I come here. The owner is incredibly sweet as well. She is so kind and always smiling, and she gets to know her regular customers. Love this place! Check it out.",
   "I visited Hippie Chickpea many times... I am glad they opened here in Montpelier. I am looking forward to eat new cuisines here from a long time! Their Gyro, hummus are amazing... I am extremely happy with the taste. Will definitely recommend",
   "We enjoyed our falafel and breakfast taco mid afternoon during a relatively quiet time. Ingredients were fresh, the flavors wonderful, the amount of food was perfect, and the free, clear water was refreshing. All for $20. We'll certainly return for more!",
   "Excellent addition to the Montpelier dining scene! The falafel small plate was spectacular and the dynamite mushrooms very good.  We also enjoyed two of the gyros; great pita and everything tasted so fresh! Friendly service and good prices. Highly recommend!",
   "Stopped here for a quick takeout lunch and WOW! Super friendly service, and it was the best falafel sandwich I've had in VT! \nThey know what they're doing."
  ]
 },
 {
  "name": "China Star",
  "address": "15 Main St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6a1d6840-9332-11ea-b0d7-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1284027624223037557",
  "source": "GoogleMaps",
  "reviews": [
   "Our group, made up mostly of teenagers on their way home after a competition and mentors, arrived at closing time. When the owner saw us, she re-opened and took our orders patiently and with care. The food was tasty and hot.",
   "Good food and fast service.\nIf you are in the mood for Chinese takeout then this is not a bad option, especially with being in the middle of VT.\nI know most people won't agree but Chinese food is comfort food to me, always reminds me of NYC.  \nPS. NYC Chinese food is #1 in my opinion.",
   "Nice “no frills” simple place like anywhere in Southeast Asia or Greater China!!  Nice Owners!!\n\nSeems mostly a takeout joint. I come here to take/out dumplings and then we make a great soy-vinegar-chili sauce at home to go with a glass of wine (as they serve no beer or wine here). \n\nThe food is quite decent and freshly prepared at each order!! The hot & sour soup is excellent and so is their shrimp with lobster sauce.",
   "Fast, good and friendly. All the greatest things for a local restaurant.",
   "Good food, freshly prepared and fast service"
  ]
 },
 {
  "name": "Langdon Street Tavern",
  "address": "14 Langdon St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6a637236-9332-11ea-b47c-14b31f159f22.png",
  "tags": [
   "music",
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7895067731750466122",
  "source": "GoogleMaps",
  "reviews": [
   "It’s open late, for Montpelier, and has a easy going vibe. The beer is cold, the music is easy, and the guys working here are cool. The patrons are locals, who all seem to know each other, it’s a nice place. \n\nI had this wild rendition of Chicken and Waffles. If you’re a Chicken and Waffles connoisseur, check it out.",
   "Absolutely delicious food and their wings are amazing, make sure to order more than you get eat, their leftovers are still a treat the next day.",
   "Great people and great food. Solid beer list, with regular updates. Definitely popular with the local crowd. They have food specials that keep us coming back. A hometown favorite!",
   "They have the best sweet potato fries and chicken wings wow, awesome service. Valerie she is an amazing waitress!",
   "Between my husband and I we had a burger and a fried chicken sandwich. Best fried chicken in Montpelier! Excellent fries and onion rings. Excellent service. Overall, very happy with our experience."
  ]
 },
 {
  "name": "Bear Naked Growler",
  "address": "186 River St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6aa9ca58-9332-11ea-af06-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "knowledgeable",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=9743812769989233335",
  "source": "GoogleMaps",
  "reviews": [
   "Very friendly service. My fiance and I decided to try the bar for the first time and we loved it. We had a stout beer called the Gunner's Daughter. It was not surprisingly strong and had a nice flavor. The pub food was air fried which is slightly healthier but delicious. We will be visiting here again!",
   "The beer here was pretty good however the prices were extreme and the food was disappointing considering we had went for dinner and spend way more than it was worth. It was cool to see the growler stations, and if I remember correctly they accept all growlers even if it's not from them.  They had many on tap but I would of liked to see more local beers or even more house made brews",
   "Great beer selection and very knowledgeable owner",
   "Amazing hidden gem. Great selection of local brews. Perfect pub menu. Owner is wonderful. Knowledgeable, friendly, and a great Vermonter to chat with. Thank you!!",
   "This place is awesome. Tons of great choices on tap, seats at tables or the bar, and a couple of really nice guys working there. Not much more you could want!"
  ]
 },
 {
  "name": "J morgans",
  "address": "147 Main St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6af07052-9332-11ea-9f29-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family",
   "kids",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10786738541871633623",
  "source": "GoogleMaps",
  "reviews": [
   "We decided to get married at the hotel specifically because of how good the food is at J Morgans!  The atmosphere in the restaurant and bar is awesome too.  And the service has always been top notch. And they now validate for parking in the back lot, so now searching for on street parking!",
   "Ambience was really good. Our waiter was friendly and the food was served well. Overall worth a visit",
   "Called ahead and got a reservation for my birthday.. asked for a table off to the side, got a great table. O ordered the fillet mignon and my husband ordered a ribeye. Mine was perfect, Bob's was so over done that he sent it back. ( He never does that) ..I waited for his meal to come back, knowing it would take a bit. In the meantime he ordered another drink,it never came!! Finally he got his steak and I asked about his beer,and she finally got it.  Desert.. I paid for..not one thing was comp.  Definitely not happy .. always bragged about J. Morgan's..not sure if I will again. As my family goes there for Easter and mother's day!! Really disappointed.. it was a special occasion ( my birthday) .\n Waitress was great, tipped her over 20 percent,as it wasn't her fault!!😭",
   "Good food but definitely not the J Morgans of old. Service was slow, Bread is now a menu item ($3), Salad is extra (even with a $46 steak), Menu is paired down compared to what it used to be and the seafood selection leaves something to be desired. Too bad really, our family, kids included, used to look forward to a nice dinner together here. Time to find a new spot I guess.  I will qualify that the food is still good but everything else has really changed for the worse.",
   "Mouth watering food. Great for special moments in life or treat yourself daily."
  ]
 },
 {
  "name": "Sweet Melissa's",
  "address": "4 Langdon St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6b3f2e34-9332-11ea-9277-14b31f159f22.png",
  "tags": [
   "music",
   "delicious",
   "food",
   "music",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8140416435079122628",
  "source": "GoogleMaps",
  "reviews": [
   "Edit!!\nI've been a few times now and wow. Talk about a good time. Melissa runs a great joint with the community behind her! The live events are great! There is something for everyone if you keep up with what is going on and that is a lot!!\nKeep it up Melissa! \nSweet neighborhood dive. We would've stayed longer but the political vibe of the band Umlaut was very off putting and put a dent into our enjoyment.. If we want to go to a politically themed rally we could have done so elsewhere. But we came to enjoy ourselves to good music and we're looking forward to the drag show that was planned that night. Unfortunate that we felt the need to leave before the show.. We will be back another time for sure. We did meet Melissa, nice owner, she's got a good gig there...played a round of billiard as well.",
   "Drinks are always good, they have games you can play there too along with pool. Everyone that works there is welcoming! We went one one of our first dates there, so every six months or so take a trip into town and we have to stop there!",
   "Excellent service every time! Good beers on tap. Ger the stoner wings and feel happy",
   "The food was excellent!!! The fish and chips was crisp and delicious!! The fried pickles too!! The music was good and the staff was friendly and attentive! Love this place!!",
   "This place is very comfortable and casual. It's always been fun when I've been there. They have a sea shanty sing along night, live band karaoke on another night, other live bands, food deals, and enough drink variety for a small place. It can be packed at times, but friendly enough for that not to be a problem."
  ]
 },
 {
  "name": "Bohemian Bakery",
  "address": "78 Barre St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6b80f142-9332-11ea-a499-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "drink",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=15731518194553844062",
  "source": "GoogleMaps",
  "reviews": [
   "This a French style croissant bakery. To say the least it is amazing. Very friendly clean and welcoming. The croissants are so buttery and delicious.  There are other items which are equally tastie.  If you are in the area you have to stop by. There are places to sit inside and out. So buttery. Note that they close early.",
   "The cutest little cafe in Montpelier! After driving four hours up to VT from Massachusetts, I stopped into Bohemian for a snack and a drink. Loved the atmosphere and the food was delicious! This would definitely be my usual haunt if I lived closer.",
   "This place is amazing. I absolutely love their baked goods. I am so grateful to live so close!",
   "Wow. Go. Go now! Superb pastries and delicious coffee.",
   "Was working in the area for 9 weeks. My off days I came here for a bite and an Americano. Great, warm and friendly staff."
  ]
 },
 {
  "name": "The Skinny Pancake",
  "address": "89 Main St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6bc65e78-9332-11ea-b8dd-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=2386875802476068281",
  "source": "GoogleMaps",
  "reviews": [
   "We had the breakfast monster and another crepe. In general, we really liked the vibe of the place and found the breakfast to be filling and delicious. It was a good amount of food and too overwhelming, while still very filling, and inspired us to consider making crepes at home in the future. Even though this is a chain, it did not feel like it.",
   "Good food. It was my first wxperience with crepes as a dinner item. I was quite please.\n They are ready for people who sit on the patio with dogs. If you don't see a water dish, ask. They keep bowls around.",
   "Food is very delicious. Portion size is excellent.  Prices are very reasonable. Service is friendly. Subtracting a star due to the slowness of prepping the orders. Ordered an add on 5 min after the group and it took at least a half hour to receive the extra items. I would recommend this place in a second but only if you are not in a rush!",
   "Very tasty pancakes. Really love that they serve real maple syrup with them. Coffee is quite good. Charming little place.",
   "I used to love Skinny Pancake.  I have been out of the area for three years and decided to visit my old haunt.  I ordered the Henrietta Crepe with seitan on a buckwheat crepe.  $11.  The crepe was cold, and the spinach was raw.  It should have been wilted.  And the salad was sparse, like three small leaves of lettuce.   I remember the salad while not large could be considered more than garnish and the crepes were warm and delicious.   Next time I am in town, I will go somewhere else."
  ]
 },
 {
  "name": "Domino's Pizza",
  "address": "25 Berlin St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6c14f3fa-9332-11ea-93a6-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "cheap",
   "family"
  ],
  "link": "https://maps.google.com/?cid=4382052612555714021",
  "source": "GoogleMaps",
  "reviews": [
   "Really like the employees here. Consistent experience every time. My only complaint (all dominos locations) is that the pizzas are way overpriced if you call. I can call and order a pizza and it’s 2 times the price of the app for the exact pizza. I think they should have consistent pricing no matter how you order.",
   "Forks but no knives? Sad face. Otherwise great food and service",
   "I always use the app to order and whether I'm picking up or getting delivery, the wait is short, and my order is always right. Not to mention the employees are super attentive and nice. Thank you guys!",
   "Definitely needed to review this place.  Just moved in from Boston and moved to a new apartment which I didn’t know the address to yet apparently  (I had made a mistake in address while ordering) and the delivery guy still had the pizza there before our three year old could even whine about how there was no pizza yet. When we received our order the delivery guy even after my mistake was uber friendly and courteous and welcomed me to the neighborhood.  To boot, it was the best pizza I’d ever had from a dominos the ones in Boston have notoriously bad pizza.  Cheap, friendly, quick and delicious.  What more could you ask of a pizza joint? 🍕",
   "Dominos actually has decent pizza and if you do online ordering you cant go wrong because you can almost always get big discounts.  Last week my family and I got 4 pizzas half price!"
  ]
 },
 {
  "name": "Bagitos",
  "address": "26 Main St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6c6e85cc-9332-11ea-963c-14b31f159f22.png",
  "tags": [
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10069682414541588458",
  "source": "GoogleMaps",
  "reviews": [
   "This place has the best bagels",
   "Had a good quesadilla, nice Irish live music. The whole place felt unclean, especially the tables, so I wouldn't come back.",
   "Had a perfect bagel this morning. Will have to try a burrito sometime soon",
   "Great place, lots of choices. Who doesn't like New York style begals with their Tex Mex food!?",
   ""
  ]
 },
 {
  "name": "Café Anna",
  "address": "36 College St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6cb700e8-9332-11ea-8fd7-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=12700662957450084634",
  "source": "GoogleMaps",
  "reviews": [
   "It's a cute little Cafe, the entrance is from behind the college. Prices are reasonable. Ordered chicken salad sandwich, avocado toast which are good but the hot chocolate was not so good",
   "Café Anna is a beautiful little cafe, with very friendly staff! I recently attended my first game night there (Tuesdays) and it was so much fun, I intend to go back as often as I can! Thank you to staff Jae and Autumn and to fellow guests for welcoming me and my partner. I intend to try out Craft night (Mondays) upcoming weeks as well. These events really fill a void of fun weekday evening activities in Montpelier, and I'm so excited that the new staff at Cafe Anna is bringing that here!",
   "Reasonable prices and pretty good food!  The sandwich I got had some extremely salty lettuce.  Okay for me, but I imagine some people would find it too much.\nI'd definitely come back.",
   "Charming atmosphere, excellent sandwiches, and they're starting to do more evening/social events like game and craft nights.  It's quickly becoming one of my favorite spots!",
   "Quick and yummy. Lovely atmosphere."
  ]
 },
 {
  "name": "Panera Bread",
  "address": "1450 Barre-Montpelier Rd, Berlin, VT 05641, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6cf6c940-9332-11ea-b70d-14b31f159f22.png",
  "tags": [
   "walk",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13940452176463835487",
  "source": "GoogleMaps",
  "reviews": [
   "New summer salads are wonderful!",
   "I go in here two days a week while my little girl is at school.  Everyone of the staff is professional, friendly, kind, and know me at this point.  When I make a mistake it's never a problem.  I love going here and look forward to it every week.",
   "You are mistaken. Yes l was parked near there cause it was the only parking spot l could find. But laws over at pizza hut having lunch with my friends. That's what you get for trying to follow me every where. Next time l.willpark my car at. Burger King and walk over to pizza hut. To have lunch with my friends. Just so you can say l visited. Burger King for lunch. I think l need to buy a different car so you wont know. Where l go to eat or shop. You know to much about where l go  already.  Where do you go to eat all the time. McDonalds or wear. Many thanks. Pamela.",
   "Great food and friendly staff who always provide great recommendations.",
   "I love this place, service is fast and efficient"
  ]
 },
 {
  "name": "Cornerstone Pub & Kitchen",
  "address": "47 N Main St, Barre, VT 05641, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6d3e32f6-9332-11ea-8412-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8565207484125236239",
  "source": "GoogleMaps",
  "reviews": [
   "Nachos had very little cheese, almost no beans, salsa was low quality, chips were decent.  For $12 the nachos were not hearty at all.  Turkey club was pretty good but not meticulously assembled.  We ordered 2 and they were average at best. Good atmosphere.  Nice waitress. Food is a little random.",
   "The local fine dining establishment that does very well because it's the only game in town.  Greasy and salty, but admittedly tasty.",
   "Excellent service. Great bartender. The most delicious blue cheese burgers and the fries are yummy. Great atmosphere.",
   "A hopping little place. We stopped by on a whim just passing through town. After a 15 minute wait we seated at a high top. Food was good, prices were reasonable. The waitress could have stopped by our table a little more often. It was busy that night, so I guess it can be expected. Overall, I would return. It was a good experience.",
   "Great food, best mac & cheese I ever had, with maple bacon & fish & chips were good too. Very nice restaurant and staff was great too."
  ]
 },
 {
  "name": "Asian Gourmet",
  "address": "276 N Main St, Barre, VT 05641, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6d865f38-9332-11ea-b2f6-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13970065002268374553",
  "source": "GoogleMaps",
  "reviews": [
   "Good sashimi & rolls. \nA little bit pricy for certain items, but well worth it.",
   "Always good. When you eat there the service is always good. Fresh Sushi and good drinks. Not over priced at all. Highly recommend.",
   "I made valentines reservations at 7pm and we waited for our table for 10 min. Now it's 7:50pm and no one brought us water or even took our order. Also the hostess broke a water glass on the floor and didn't clean it up and her and customers slipped and a customer wound up cleaning it up themselves.  Now we left at 7:50 after waiting and never even got our order taken.  I've been here before and I liked this place but now I don't know why it went so down hill with the service. Someone could have atleast told us sorry for the wait or stopped us while we left. It would take a lot of me to come back to this place. How unfortunate! I'm very upset! Ruined Valentine's Day! :(",
   "Delicious. Fresh sushi.. Best I've had in a while. We went for a Christmas work dinner and it was great! Nice area in the back for parties and waitress was friendly.",
   "Sushi are nice, sashimi are not super fresh it's more frozen fish, but some like salmon was fresh. But overall food was good and atmosphere too"
  ]
 },
 {
  "name": "Ladder 1 Grill",
  "address": "8 S Main St, Barre, VT 05641, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6dc911c2-9332-11ea-8c96-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1855327756448880103",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I stopped in for a late lunch. We had the spinach and artichoke dip and burgers with fries. The food was hot and delicious.  Our waitress was very polite. We had a great lunch with a wonderful atmosphere.  It is worth the drive to this beautiful restaurant.",
   "If a fancy Italian restaurant and a greasy pizza joint made love and had a baby, this would be it. I mean that in the best of ways.  We had the garlic bombs which were great and the marinara sauce that came with them was phenomenal, however they served us 7 of them. This type of thing bothers me so much because there's always one extra and it creates this awkward social situation at the table. Just give us 6 or 8.  Pizza was good, very traditional Italian inspired flavors and the dough was very good. Nothing to write home about but it was a good meal. It should be said that the atmosphere was awesome, really nice decor and the whole firehouse history is pretty cool.",
   "Went here with a party of 9 last time. Not one complaint from the table. In fact I have been here several times with no complaints. The menu has everything you could imagine on it. The only problem I ever have when I go is what do I get this time?",
   "Great fare at even better prices. The attractive woman who owns the place is so sweet and very gracious. I highly recommend trying this place!",
   "Absolutely a must see for the firefighter. Ladder 1 grill is the best restaurant around, amazing food. Completely amazing how they turned a old fire station into a grill that has different items on the menu from firefighter around the area. Tons of firefighter pictures and tee shirts and more on display."
  ]
 },
 {
  "name": "Si Aku Ramen",
  "address": "237 N Main St, Barre, VT 05641, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6e105452-9332-11ea-bf17-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "delicious",
   "food",
   "family",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15000119967631201799",
  "source": "GoogleMaps",
  "reviews": [
   "First time going there tonight. It was delicious. The owner/one of the cooks (not sure which roll he had) came out and explained what the different dinners and specials were. All sounded good. And the one I picked was pretty darn amazing. Everyone who worked there were very pleasant!",
   "Always delicious ramen. My go-to is the Spicy Korean Ramen and it is wonderful. Flavorful, fills you up, and fresh. The Singapore Curry Ramen is also good- typical a special on weekends. This restaurant adds great cuisine variety to Barre. Go support them!",
   "This restaurant beats expectations and is a great place to stop. To my knowledge there isn't much like this around Barre, and I hope that works to their advantage. It's a small restaurant with not much seating, but it's worth stepping into. The owners are very friendly and willing to accommodate for vegan diets and allergens. They make you feel welcome and promote a great dining experience. If you're looking for a good bowl of ramen try this place and you're sure to like it.",
   "Beautiful presentation, absolutely delicious food. I will definitely be eating here again.",
   "Food is pretty good but service and hospitality is phenomenal. They are a family business run by a bunch of super nice guys. Offer you extra bowl with tonkatsu broth for sharing ramen, extra hot teas, and even free steamed dumplings as they cooked extra."
  ]
 },
 {
  "name": "Basil's Pizzeria & Restaurant",
  "address": "20 S Main St, Barre, VT 05641, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6e6d68a2-9332-11ea-beb8-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6634753443588750291",
  "source": "GoogleMaps",
  "reviews": [
   "If you happen to get your order right, congrats to you.  Simple order..substitute lettuce for onions on my gyro!  \" oh I'm sorry sir, I'll try to do better next time\"  well how does that make up for this time? \"Well I could give you a couple dollars off your next order\"  how about you give me my meal next time? \"Well I cant do that without asking a manager\" \n\nSo like really, i need to tell you to talk to your manager to give me what I just asked for?  So I'll just post this for all to see!  I simply wanted lettuce instead of onions!  Oh!!!  And this is not medium cooked!!!!   Looks like it's time to get people who know the menu, And people that know how to cook!!!\n\nUpdate:\nRecalled after an unsuccessful first attempt wanting to speak directly to manager or owner.  Was able to do so and made the situation whole!  Thank you.",
   "Good food. One of the few options for delivery in the area. Usually comes within half hr/45 mins. The Calzones are so big it’s like folding a large pizza in half over itself. The portions on a lot of items will leave you with some midnight snack leftovers. Definitely recommend giving this place a try!!",
   "My family loves Basil's, we used to go to Vespas in Essex, but now they have been surpassed by the Basil's! Wooh!",
   "I love their food. they do pizza right. I had a great lunch. great staff.",
   "Good food, delivers, local, friendly staff"
  ]
 },
 {
  "name": "Julio's",
  "address": "54 State St, Montpelier, VT 05602, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6eab87a4-9332-11ea-a1e8-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "delicious",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11626830625276409186",
  "source": "GoogleMaps",
  "reviews": [
   "Arrived before a Sunday dinner \"rush\" and was met by welcoming staff. The menu was apparently new and the waitress couldn't answer a couple of questions about it but it wasn't a huge deal. What threw me off was the number of times a waitress went by and none of the cups on my table were getting refills. Flagging someone down for a water refill isn't common but I attribute that to a fairly young or new staff.\n\nThe food was exactly what I wanted! Crunchy tacos and burritos made to order. The tacos are surprisingly expensive. Three crunchy tacos are basically the same price as a fully loaded burrito that has five times the amount of food inside. The chocolate toffee mouse cake was delicious - but had a negligible amount of toffee.",
   "Nice Mexican restaurant in a small town which surprised me. The food was great & the staff were pleasant. I would definitely go back if ever in the area again.",
   "Everything was delicious. I highly recommend the tamale fritters. Big thanks to Nile for suggesting the summertime white sangria. Street tacos were perfect for lunch.",
   "I’ve only been to Julio’s a handful of times, but every time has been a great experience! They play fun music, their food and margaritas are delicious, and I’m super impressed by their customer service!! I had Tabitha as a waitress tonight, and she is so attentive and fun. Highly recommend for amazing salsa and a fun night out!",
   "Tasty food at a great price and a good selection!"
  ]
 },
 {
  "name": "House of Tang",
  "address": "114 River St #2, Montpelier, VT 05602, USA",
  "avg_visitor_review": 3.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6ef0a292-9332-11ea-9fd8-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "kids",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13235075483911925607",
  "source": "GoogleMaps",
  "reviews": [
   "This was without doubt the worst Chinese food I've ever had. In fact it was kind of impressive. I would recommend to lower your standards and humble yourself.",
   "Always a fabulous experience!",
   "Great service and even better food. A nice quiet atmosphere. You got the fish tanks to look at also.",
   "Went on a weekend evening. Place was not that crowded but the buffet was virtually empty of food. New food would come out of the kitchen but at an extremely slow pace and in small batches. Honestly,  everything tasted off.  Final straw was having to wait for clean ice cream bowls for the kids. When they finally arrived, the ice cream machine was empty.  Feels like they are really struggling and cutting any and all corners to stay open.",
   "Great food and service."
  ]
 }
]