[
 {
  "name": "Grand Ole Opry",
  "address": "2804 Opryland Dr, Nashville, TN 37214, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6f388bf6-9332-11ea-b074-14b31f159f22.png",
  "tags": [
   "walk",
   "learn",
   "tour",
   "history",
   "music",
   "walk",
   "tour",
   "music",
   "tour",
   "historic",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2845966795787791477",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing place. Went for charity foundation concert. Atmosphere great and seats comfy. We were up in the balcony but view was good. All artists excellent and sound quality fab. Stayed locally enough to be able to walk. If you get the opportunity to go, take it and enjoy.",
   "Very nice! As someone not familiar with country music, the Opry, Nashville, or even the South in general (California-Colorado girl here), it was an absolute pleasure to learn and familiarize myself with such a rich history and culture! Definitely made our trip fabulous! (We did a backstage tour, as well as a Saturday live Opry show the day after.)",
   "We can mark this one off our bucket list! Opry is a must see! The tour lead our group to all the behind-the-scenes secrets. The wall of inductees, the dressing rooms, and we even got the option to have our photo taken on stage in 'the circle' that I've only heard about over the years growing up. What a wonderful experience, to be given the opportunity to relive and walk with country music!",
   "We did the backstage tour and loved it. I'm not even big country guy but I still found the tour very informative and engaging. Getting to go backstage at such a historic venue was very cool. If you can't see a show here, I highly recommend checking out the tour.",
   "An experience we will never forget! History was made by the Grand Ole Opry on the radio and on TV. We felt like we were a part of that history with the many talented musicians/bands that played. Saw about 10 or 11 acts, each playing two songs for about 2.5 hours total. Worth every penny!"
  ]
 },
 {
  "name": "Nashville Zoo at Grassmere",
  "address": "3777 Nolensville Pike, Nashville, TN 37211, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6f7b2cdc-9332-11ea-b367-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "history",
   "walk",
   "kids",
   "nature",
   "walking",
   "knowledgeable",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17729384407095934438",
  "source": "GoogleMaps",
  "reviews": [
   "I loved this Zoo. I love that the animals were well taken care of and they were not on cement but in actual enclosures with grass and dirt. Place was so clean and every employee that we talked to there was very knowledgeable and answered our questions we had. I got to know the history behind the zoo and to find out that they are only using not even half of the hundred and eighty acres of land they have gives them even more space to grow. Would definitely love to come back if I'm ever in this area again",
   "This is a beautiful, clean and well maintain zoo. It has very attractive enclosures and great landscapes. It has a rope bridge over a river which is a lot of fun. They have areas for petting animals, including a kangaroo petting zone. A kangaroo petting area is something I hadn't seen before. It is a great place to take the kids or for adults that want to go for a walk and enjoy nature.",
   "The Zoo was amazing loved seeing all of the animals. Walking around “Peru” to see the Guinea pigs and the bear was an experience! Loved the atmosphere. They put so much time and detail in making the exhibits. Their gift shop is also full of cute knickknacks and souvenirs I couldn’t pass it without buying something.",
   "Absolutely LOVE going to this zoo! We go often and still stay ALL DAY when we go! They have so many great programs *you can view a list online* and really good ADMITTING prices for this Mommy of 5! You can purchase year round passes or even donate to the Zoo online. The food is a little expensive there, but you are welcome to bring in your own ALSO with a hand stamp you can leave and come back anytime that day. Great staff! Very knowledgeable about the Zoo's history and the  animals! I Homeschool my children *so it's definitely a perfect learning experience for my little ones. Always enjoyable!",
   "I love zoos and this one was one to love. So many animals it was hard to get through all of it but we did it. There is an interesting inside exhibit with tons of wildlife. I like that many of the animals they had in captivity were endangered and the aim was to preserve the species. Kangaroo garden was my favorite part."
  ]
 },
 {
  "name": "The Parthenon",
  "address": "2500 West End Ave, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6fc2849a-9332-11ea-9f03-14b31f159f22.png",
  "tags": [
   "free",
   "library",
   "structure",
   "history",
   "structure",
   "walking",
   "tour",
   "art",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=8139362955125514662",
  "source": "GoogleMaps",
  "reviews": [
   "$6.00 is probably the cheapest (but awesome) experience in Nashville. It is the only one in the entire world that is fully restored and built in scale. The bottom entrance is where the gift shop and ticket sales are. If you are around downtown I would def recommend visiting it. Everyone is friendly and the guides are free. They also over tours at 2 PM.",
   "I was in the area with my best friend so we went to take a look.  Its existence is magnetic and filled me with curiosity. I could not help comparing to the original in Athens, so it’s placement, so low to the ground, was very deflating. \n\nThe visitors, were mostly quite cheery, but I had a hard time calming my curiosity, to actually appreciate the structure. It was fun, it provided an activity, and something to do, nevertheless, the awe factor was missing. It appears small, yet it may have been be duplicated to scale? The Athena statue inside is painted and not beautiful. \n\nIt has great potential, and is certainly a note worthy undertaking, yet I did not sense an intended outcome. It felt very cement like and I kept thinking it would be a sweet,  Greek revival,  public  library. I really don’t know what to say, really.\n\nI give this site a four stars because it provides a lovely activity in a lovely setting. Although, I personally struggle with understanding it’s artistic place in the world, I do feel that it is a heartfelt offering that has provided a really wonderful place to visit.",
   "This is an awesomely large structure. We didn’t do the tour, but walked around the outside. Very pretty walking path. The Athena may be only a statue to some but I can tell you, the spirit of a goddess most certainly dwells there. As I went before the goddess and bowed I was flooded with her presence to the point my face burned red hot and I was moved to tears. For a few moments I knew nothing else but that presence, everything around me simply melted away and I was wholly connected to the goddess. It is a once in a lifetime experience. I could not more highly recommend you visit. But come in reverence because you will be in the presence of a goddess. The history of the building and pictures of the original exhibition that this was built for was far more interesting than expected. There is also a small art gallery and the enormous statue of Athena to see as well as the building itself. It is worth a visit but not too much else round the area to see.",
   "I enjoyed the location. It was a very muggy day but seeing this monument/museum was pretty cool. I thoroughly enjoyed taking photos and video of the location there was a lot of construction going on so I was not able to get really good photos. The construction made it very muddy though so I’m giving it three stars when I come back and everything is completed hopefully I can add the extra two stars.",
   "Was under construction when we visited but still very cool. If you are into Greek Mythology it is definitely worth paying the price to go inside the Parthenon. But also a great park to just walk around and enjoy the lake and flowers. Nice place to find in an Urban environment"
  ]
 },
 {
  "name": "Ryman Auditorium",
  "address": "116 5th Ave N, Nashville, TN 37219, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/70092340-9332-11ea-9ca0-14b31f159f22.png",
  "tags": [
   "history",
   "music",
   "music",
   "free",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7133835491838936491",
  "source": "GoogleMaps",
  "reviews": [
   "I understand why this is such an acclaimed spot for live music.  Besides the history (which alone is cool), every seat in the house is a good seat.  All seating are church pews and the entire venue is pretty small.  The acoustics are great and the music really does sound amazing no matter where you are listening.  The balcony is great to see a band and even if you're in the back you are still close enough to really see the action.",
   "If you love live music, you have to see a band here. Sound quality is close to perfect. Some seats have a pole in front of you. But that ends up being a non issue since you will probably be standing up anyways. Staff is courteous and helpful. Look for a band you like or even marginally like and see them here. You won't be disappointed.",
   "Beautiful historical Nashville landmark.  Venue allows for excellent views of performers from many seats.  Our favorite is balcony middle, at least 4 rows above edge of balcony, so please don't buy our seats 😅😂🤣 \n\nSeating is on wooden pews without cushions.  Inflatable cushions are prohibited. (There's no prohibition against coats.  A fiber filled coat folds into a nice cushion.)\n\nIf you have difficulty with stairs, there are seats at the top of the balcony.  Excellent provision for those in wheelchairs or assisted-walking devices.\n\nVenue staff are very helpful, so feel free to ask them your questions.\n\nSecurity screening is conducted BEFORE entering the venue.  ABSOLUTELY NO POCKET KNIVES of any size.  The staff prohibited a Victorinox Swiss Army Classic knife which has a tiny 32x6mm (1.25x0.25inch) blade, so leave ALL blades in your vehicle.",
   "Came here for the Josh Gates show. Our family all had a great time. The venue is small, so as long as your view is not obstructed by the pillars, your seat will be good. The bar inside is outrageously expensive, so if you want drinks I would highly recommend you go somewhere else before the show. Sound and lighting are always great. The ushers are super helpful and very nice.",
   "WONDERFUL place to see a show and the history there is unbelievable.  Our 2-year old son attended his first physical concert here (1st concert was when my wife was 2 months pregnant with him at the same location to see the same band!) and the staff was so sweet and kind to him.  We will make a trip here every time we're in the Nashville area.  Highly recommended!!!"
  ]
 },
 {
  "name": "Centennial Park",
  "address": "2500 West End Ave, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/70699d4c-9332-11ea-9855-14b31f159f22.png",
  "tags": [
   "art",
   "food",
   "walking",
   "free",
   "history",
   "art",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=17541516360761870548",
  "source": "GoogleMaps",
  "reviews": [
   "One of the must see destinations for visitors to Nashville but also a great weekend standby for locals. Gorgeous park, great space for walking with your dog or just relaxing on the lawns. Often times there are great food trucks, but it's also nearby a ton of excellent bars and restaurants. Start your weekend here and take your pick of where to go next. Having relocated out of Nashville, this is the place we miss the most. Visitors should your inside of the Parthenon at least once, but they do rotate the exhibits in the art gallery which rewards repeat visits.",
   "The park is free but the Parthenon is $6.00 and probably the cheapest (but awesome) experience in Nashville. It is the only one in the entire world that is fully restored and built in scale. The bottom entrance is where  the gift shop and ticket sales are. If you are around downtown I would def recommend visiting it. Everyone is friendly and the guides are free. They also over tours at 2 PM. Looks like they are getting ready to expand  from all the gated off spots and equipment. It wasn’t crowded at all on Sunday around 12:30.",
   "Loved visiting here. So much history, so much fun in one place. The staff are generally helpful. Many photo opportunities. Centennial Dog Park is right there in the same vicinity making bringing your furry friends easy. Enjoy your visit. . . We sure did!!",
   "The park has a beautiful lake that is home to ducks and Canadian geese. There are flower gardens & a neat stacked stone bridge that make great photo spots. The Parthenon is also here. It is a replica of the original & houses an art gallery & an impressive 41 foot gold gilded statue of the goddess Athena.",
   "Was under renovation last time we visited. Was breath takeing perfect place to being a date for a walk. Would be nice if the added areas to picnic and maybe a dog park. Nice reflection pond. It's in a good area. Traffic is kinda rough but the parking is very close."
  ]
 },
 {
  "name": "Bicentennial Capitol Mall State Park",
  "address": "600 James Robertson Pkwy, Nashville, TN 37243, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/70b770f8-9332-11ea-b5c6-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "walk",
   "learn",
   "free",
   "walk",
   "food",
   "unique",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=10113675880784199210",
  "source": "GoogleMaps",
  "reviews": [
   "Highly recommend this park, especially the guided ranger hikes. The evening hike with Ranger Wayne was extremely informative. Pleasant walk up the capital steps and around the capital building. Nice views of the city during the sunset, and the buildings at night. Also included information on the statues and displays around the campus.",
   "Far exceeded expectations!  It's flat out wonderful.  It's free with much to learn, much to see and much to do. It's very pretty and certainly as educational as u can get. It's a close walk to the state Capitol and close to downtown Nashville.  I'd go there again and again!",
   "This is a very interesting park with lots of historical appeal. I found the wall of TN events fascinating and the massive map of TN capture my attention for a considerable amount of it. It's also just a pretty area right in the heart of Nashville. I thoroughly enjoy it.",
   "I love this area because of the vast amount of things you can do. There's a food mall, marketplace, spots to picnic, and lots of space to walk, jog, or ride a bike. What makes it even better is that it's right next to the city area where it's a bit more busy.",
   "This park is a real treasure and unique in our state parks system.  I think every one of our large Tennessee cities need to plan for an urban state park such as this one.  I could tell this park is well used, well maintained,  and well appreciated by downtown workers and visitors to the city.   The farmer's market located adjacent to the park enhances the outdoor experience.   I bought fresh turnip greens and acorn squash--locally grown--and wish I had bought a basket of apples."
  ]
 },
 {
  "name": "Lane Motor Museum",
  "address": "702 Murfreesboro Pike, Nashville, TN 37210, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/710607d2-9332-11ea-9b52-14b31f159f22.png",
  "tags": [
   "unique",
   "unique",
   "walking",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9859121989056358689",
  "source": "GoogleMaps",
  "reviews": [
   "This museum is nothing short of amazing. It boasts America’s most extensive collection of European vehicles, and that is evident. Housed in the former Sunbeam bread factory, the clean, open space is full of cars, scooters, bikes, and other assorted vehicles, including two cars propelled with airplane like propellers.\nI ran across this hidden gem while researching the Tatra car company of Czechoslovakia, and I was elated to see several beautifully restored specimens. The beauty and oddity did not stop there, though. Just observing the Ingenious approaches to locomotion filled one’s imagination with the hours and energy invested into the unique designs.\nRex and Jessie were top notch guides. Their knowledge and enthusiasm made conversing about trends, engineering, and styling a true pleasure, and seeing all these magnificent examples tickled the imagination.\nI am blind and was loaned some cotton gloves, so I could caress the exhibits. Rex and Jessie took the time to make me feel like an honored guest and cheerfully pointed out the unique aspects to each of the vehicles we viewed.",
   "Fantastic treatment of these unique and important autos. These are loved and it shows. And the building! Fantastic. Excellent staff treatment and conversation. Made for an excellent destination with our Harley riding group. Worth the visit, and will be coming again for sure.",
   "I just spent 4 hours walking around nonstop. This place is fantastic! To my delight it had brilliant additions like bicycles, motorcycles, mini cars, airplanes, and so many items I've never heard of! If you have some time definitely do this one!",
   "Really enjoyed seeing rare cars, bikes and other vehicles and learning some cool facts as well. Fun for the entire family and a must see for any automotive enthusiast. (Sidenote: Was really impressed with how clean the bathrooms were!)",
   "I honestly don't even care about cars, but this place had me gawking at them for four hours. It was a huge surprise and a good one. Such an amazing collection of history, and vehicles of almost unbelievable design. It's also worth mentioning that there is a pretty cool mini museum of bicycles inside as well."
  ]
 },
 {
  "name": "Frist Art Museum",
  "address": "919 Broadway, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/714cc652-9332-11ea-abca-14b31f159f22.png",
  "tags": [
   "art",
   "kids",
   "art",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=16659808873053781659",
  "source": "GoogleMaps",
  "reviews": [
   "To be honest, the place could be much bigger. But that has more to do with the really well made exhibits. I've been to a few of their exhibitions now and I can say that it is worth going to because they are well coordinated and thoughtfully curated. They use the digital aids kinda sparsely; like the touch screens, but they do it to a point and its apparent when you experience it.",
   "We have enjoyed the Frist Art Museum several times and this visit was just as great. We loved the Eric Carle exhibit very much, along with the Native Indian Women art exhibit. The museum itself used to be the Nashville post office. We have enjoyed each exhibit we have encountered there. There is a pay-lot for parking. If you are traveling to Nashville be sure to make time for this museum.",
   "Excellent place for Children ages 2-5 maybe 6... I went during the Eric Carl exhibit which was geared towards kids to begin with. However that was not the best part. The activity center for kids was excellent. They had art activities, camera and motion stuff. My daughter had a blast and the staff was very friendly.  We will be returning. I will admit we have not attended during an exhibit geared towards adults but I look forward to doing so.",
   "This museum is AMAZING and the price is great. Kids 18 and under are free which is always great. College students are 10 dollars and free certain days. The museum offers rotating exhibits. This month was Eric Carle and it was cool. They also have a whole area where you can do arts and crafts and other activities. I will definitely be taking the kids back.",
   "Loved the Eric Carle exhibit! The Frist is open late on Thursday and Friday, so it's a great place to go after work and unwind. There were a few events there and lots of people - great vibrant atmosphere! The college student discount is an excellent deal too. Parking is $2/hr, thanks to the museum discount."
  ]
 },
 {
  "name": "Adventure Science Center",
  "address": "800 Fort Negley Blvd, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7195b3e8-9332-11ea-8e1f-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "family",
   "creative",
   "kids",
   "family",
   "kids",
   "music",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2346075252042315831",
  "source": "GoogleMaps",
  "reviews": [
   "I actually signed up to be a member of Adventure Science Center last year, and will probably keep renewing indefinitely.  \n\nMy son has the best time running around and playing with their exhibits, be it the new features that change every few months or the static exhibits (some of which I played on when I was a kid, and don't worry they reflect current science, and I mean real science with evidence and whatnot). \n\nThere's a tower to climb with slides and neat interactive features, each of which constructed to impart some focused learning as the kids explore.  The planetarium has cool shows that also change regularly.  On that note, it's not all for kids.  There are monthly events after hours for adults, and laser shows set to various musoc features.",
   "Our family had a blast visiting this science museum! It seems like it's for kids on the younger side (similar to the children's museum we are used to in MN), but had things for all ages. Our 4-year-old had so much fun he didn't ever want to leave. We especially enjoyed the planetarium show in addition to the interactive exhibits",
   "The imagination runs wild for young and old alike. Wonderful, clean, friendly environment that ignites curiosity, creativity, and involves all senses. Fabulous place for kids and adults alike. Creative, interactive displays involve kids and inspire one to consider the inner workings of everything from the human body to sound and light waves to outer space. The planetarium is a favorite as well and with good reason. It's truly an educational and beautiful experience. Overall, and outing with o the Adventure Science Center provides education, fun and exercise for the whole family on a rainy day. Kids can run around the multilevel playground to burn off energy as well. In addition to all of this, there are spectacular views of downtown Nashville from the large, North facing windows. Highly recommended.",
   "Wonderful child-friendly museum with a great set of hands-on exhibits and displays that introduce kids to music, science & engineering, animals and the human body. Definitely one of the best places to take your children on a rainy day if you live in the greater Nashville area. Prices appear a bit steep at first glance but buying an annual membership is the way to go. Some of the stations or activities are a bit dated but the museum is undergoing a long-term renovation that’ll only improve the experience for families.",
   "This place was so much fun. We took my three children (all under 10) and they had a blast. There was plenty to see, touch, and do. The place was clean and crazy busy. We went during the week and there were multiple school groups there. My only complaint was the school kids were pushy and at times obnoxious. The teachers with the groups didn't seem to mind or were over extended and couldn't pay attention. I was annoyed after the third child that was three times the size of my toddler took things out of her hands. It the facility could somehow help monitor the school groups it would be a five star \"adventure.\" We didn't try the cafeteria so I can't comment on that."
  ]
 },
 {
  "name": "Radnor Lake State Park",
  "address": "1160 Otter Creek Rd, Nashville, TN 37220, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/71e7b842-9332-11ea-bda5-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "nature",
   "walk",
   "free",
   "walking",
   "hike",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=14214199913383126306",
  "source": "GoogleMaps",
  "reviews": [
   "I'd give 5 stars, but parking may be difficult to come by. Even with as few parking spots as there are there's still a lot of people here. It is peaceful, serene, and a decent hike for beginners (if you take the hills), but ultimately it's just a nature walk. The animals will let you get close. Great photo ops if you're actually looking for them.",
   "Really nice place to walk.  A surprise close to the city! Parking lot wasn't very big for as many people who wanted to visit, but it was free. Great place for a long walk, watching the turtles, or frogs, or leaves. Very quiet and peaceful.",
   "Super friendly rangers, neat to see electric charging spots offered, clean and interesting snippets of local wildlife inside - but get out on them trails, our large group loved the day and went around the lake. Really great place!",
   "Idyllic and easy to fit hikes into any schedule as long as parking cooperates. Made a full loop around the lake in an hour and a half (walking a leisurely pace).\n\nWatch out for wildlife-- beginning of February but we already saw a copperhead coiled up not a foot from the trail edge.",
   "When visiting Nashville we wanted to take the opportunity to visit some of the nature versus being in bars/museums all day and night. Well worth it! We saw two Bald Eagles as well as at least 15 wild turkey on our hike."
  ]
 },
 {
  "name": "Cheekwood",
  "address": "1200 Forrest Park Dr, Nashville, TN 37205, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7230e0a6-9332-11ea-b691-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "art",
   "eat",
   "walk",
   "family",
   "art",
   "walk",
   "learn",
   "history",
   "music",
   "tour",
   "walking",
   "tour",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13992208353136058915",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful property.  While its not quite spring yet and most plants in the gardens were not in bloom,  it was still nice to visit and walk around.  The mansion had beautiful art galleries filled with gorgeous orchids throughout the place.  Must visit if you are ever passing the area. There is a gift shop and cute cafe with courtyard to sit outside and eat.  There is even areas in the botanical garden for children to enjoy. So whether it's date night or family time out, there's something to be enjoyed by everyone.",
   "The lights were very pretty for the holidays and well done. It is great that you also get access to the museum and art works with your ticket. I would definitely recommend this as well as the Nashville Zoo for things to do at night in the winter. It is great for a date night or a time out with family and friends. My favourite part were the lights over the ponds that reflected back. It takes about an hour and a half at least to walk through if you wanted to stop and see everything and even had deer for the holiday season.",
   "It is so beautiful & pleasant here! Great place to get a good walk in for exercise. We went on a Sunday morning & met Dr. Cindy for Tai Chi in the garden. We loved it so much we signed up for her classes at Vanderbilt. There's much history to learn and a wide variety of plants, trees, flowers, etc to learn about. Various eateries to choose from, some offer live music ranging from folk to classical. It's a lovely place to visit!",
   "Christmas Tour:  Beautifully decorated estate and mansion.  Paved walking paths throughout the grounds.  Spectacular light display.  Takes a couple of hours to do the entire self tour.  Worth every penny!  Can't wait to go back in the Spring.",
   "The Christmas lights were wonderful!! And the fact they have the house open late to also tour it was great. Loved the history of the family & the grounds just as much as the festive decorations outside!! The train/toy room in the basement was definitely a favorite."
  ]
 },
 {
  "name": "Musicians Hall of Fame and Museum",
  "address": "401 Gay St, Nashville, TN 37219, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/72c4475e-9332-11ea-99f6-14b31f159f22.png",
  "tags": [
   "cheap",
   "music",
   "music",
   "music",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9963223541041595752",
  "source": "GoogleMaps",
  "reviews": [
   "Hard to find parking and it wasn't cheap to park. Entrance to the museum was in a strange place. It was fairly pricey to get in, but if you are into the musicians side of music... it is a very enjoyable museum.  We spent 2 hours and weren't bored. People working there were very nice too.",
   "Country music is not my particular flavor of music but I enjoyed very much learning and appreciating this music.  This Country Music Hall of Fame is worth a visit.  Very fun museum. The hands on, interactive Grammy gallery was my favourite part! I didn't think I would spend nearly 3 hours here. Music lovers should come and jam.",
   "Pricey but so interesting and fun. My teenagers and I had a great time here. The interactive exhibits were amazing. We spent hours playing instruments, learning to drum with Ringo Starr, pretending we were in a recording studio and more. The Jimi Hendrix exhibit was my favorite.",
   "The exhibits ranged in quality a bit. Many of them were interactive, which was fun. Overall, I felt it was overpriced. This place would be best for very serious music lovers and for people who are primarily interested in older musicians. Very contemporary artists were represented only minimally. Street parking at a meter is $2.75ish per hour and this museum can be easily explored in it's entirety in less than two hours.",
   "Great place. Was uncertain whether this would be suitable for our kids or not (11, 9, 7 years) but they loved it even more than my wife and I did. Great place with a whole lot to do for the entire family. Lots of interactive stuff where you can test your vocals (karaoke and recording studio) and dj skills. Also pretty good selection of articles from numerous artists. Highly recommended!!"
  ]
 },
 {
  "name": "John Seigenthaler Pedestrian Bridge",
  "address": "Nashville, TN 37213, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7318b858-9332-11ea-9a31-14b31f159f22.png",
  "tags": [
   "music",
   "walking",
   "walk",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=9447779123025571320",
  "source": "GoogleMaps",
  "reviews": [
   "Always a fun spot to visit, I often take out of town guests to visit the bridge for good views and photos. I’ve had friends get engaged on the bridge and usually there are some folks playing music that lends to a fun atmosphere. Overall a great little piece of Nashville. There’s also good places to park near the bridge and Nissan stadium as long as there isn’t an event, as always though pay attention to signage to avoid trouble.",
   "A fantastic view of downtown Nashville!   EPIC sunsets!   And the perfect place to spend on a date with your special someone.    \nEvery time we visit Nashville, walking the bridge is on our bucket list.   There are always lots of people and plenty to see.  \nIf you're visiting Nashville, this is absolutely a great spot!  \nPerfect for couples getting engaged or just wanting romance for the evening.",
   "It's a nice place to spend the afternoon, but they could just keep it clean it would be better. When you walk you can smell urine. It was kinda shady too but the city view was nice.",
   "One of the best views in Nashville aside from the roof top bars! It's a great place to walk and look down the river and see the city. It does have a fairly steep incline going up the bridge, so I advise those that are handicapped to use the elevator if possible. It is a very hot spot for tourists to take photos. The views are just amazing!",
   "Wish I would have known about the parking lot before emptying my wallet at other parking lots. Parked there twice now, once during the day and once at night and as far as I can tell, you don’t pay to park there. It’s a 5-10 min walk to broadway from there. At nights it’s an excellent view"
  ]
 },
 {
  "name": "Nashville Symphony | Schermerhorn Symphony Center",
  "address": "1 Symphony Pl, Nashville, TN 37201, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/736056e4-9332-11ea-81d3-14b31f159f22.png",
  "tags": [
   "performance",
   "music",
   "music"
  ],
  "link": "https://maps.google.com/?cid=4053383899035965594",
  "source": "GoogleMaps",
  "reviews": [
   "An exquisite evening of culture right in our own backyard! Go to the conductor's discussion before the performance.  It is the perfect orientation to the music you will hear during the evening, especially if you enjoy an occasional evening of classical music but aren't an expert. So much talent! Highly recommended.",
   "This was the perfect venue. It was beautiful and the sound was perfect! I could only dream of performing there. There were nice people at every turn to guide us to our seats. The Getty concert was absolutely wonderful. We plan to return next year.\nAlso, the parking was really close and protected. Great experience!",
   "Beautiful! The venue felt a little bit like a Jane Austin era building with 1920s amazing lamps and velvety chairs. They were narrow on my well endowed hips, but many people left at intermission so there was plenty of room. We were on the back row of the highest balcony and it felt closer to the stage than the closest balcony at the Atlanta symphony. Each level had its own parlor for intermission with wine, water and soda available. I did not order any wine because it was 12 dollars for a glass. But my friend did and said the red was very good.",
   "I just went and saw Star Wars: Return of the Jedi with the Nashville Symphony playing the soundtrack. It was great! Even though the orchestra was right in front of me, I would forget they were there. The music was perfectly in sync with the movie. It was a really cool experience!\n\nAnd a note on the Schermerhorn: it is an absolutely beautiful building!",
   "Great first experience here seeing Foreigner play with the Symphony! There are truly no bad seats in the building. The sound was incredible. The staff was friendly and helpful. I definitely want to go back!"
  ]
 },
 {
  "name": "Madame Tussauds Nashville",
  "address": "515 Opry Mills Dr, Nashville, TN 37214, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/73a17f2c-9332-11ea-84be-14b31f159f22.png",
  "tags": [
   "history",
   "free",
   "eat",
   "music",
   "cheap",
   "free",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1620238348461011238",
  "source": "GoogleMaps",
  "reviews": [
   "As with all Madame Tussauds, this place delivers!  Loved the history in this Madame Tussauds.  Very fun - but wish they had something extra like NYC with the hand molds.  Maybe offer a microphone with your favorite singer embedded or something?  The shop is a bit small with not too much to offer.",
   "Very fun place, free parking and all the options to eat. The museum with all of the wax figures is awesome, whit a lot of music, and if you go to the museum in important dates probably the figures changes its clothes. You can also take photos with the figures and clothes, touch it and make fun photos and selfies with your favorites singers. The wax figures aren't only of country singers, they also have pop and rock famous artist. This experience is one of the best being in Nashville",
   "Very fun and realistic people. You can get free tickets by paying for the old trolley bus ride or the hop on hop off bus. They have a gift shop that’s pretty cheap and they take your pictures in one of the rooms. Would definitely recommend.",
   "Omg I absolutely love this place. Me and my wife had so much fun here. Will be coming back again when we visit.",
   "This was a lot of fun. I loved that there were guitars hanging on the wall to really add to the experience. It was fun for the whole family."
  ]
 },
 {
  "name": "Historic RCA Studio B",
  "address": "1611 Roy Acuff Pl, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/73e53f90-9332-11ea-bc0b-14b31f159f22.png",
  "tags": [
   "music",
   "music",
   "learn",
   "tour",
   "history",
   "music",
   "knowledgeable",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1274770268346624433",
  "source": "GoogleMaps",
  "reviews": [
   "This was an awesome addition to the regular country music hall of fame museum. I would highly recommend everyone to do it if they have the time. It really has a lot of lore and why wouldn't you want to be in same building as the king of rock once was!?",
   "If you have thoughts of where a lot of the great music from country to rock n roll was recorded, well it's a must see. From the hotspot- where they would stand and sing to the actual piano where all the greats played (ELVIS and so on) which is still been used today. Wow!",
   "I was an inspiring recording engineer back in the 70's, it was nice to visit one of the famous recording studios.  Only 4 stars as there was too much emphasis on Elvis. Also, we were told about taking a photo of a blue star.  No one in our group saw it and nobody knew why it was important.",
   "I can’t recommend this tour enough. Our guide was amazing. Probably the best guide I’ve ever had at any place of interest. \nThis place has so much amazing history. If only walls could talk. It’s never a boring tour. \nMy wife really isn’t in to any of the music produced here but she loved it. \nIncredibly interesting. You learn so much.",
   "This tour offered so much history. The actual piano that held a special place in the heart of Elvis was housed here and we were even given the chance to see touch and get pictures with it. The tour host was so knowledgeable and enthusiastic about the rich history of this building."
  ]
 },
 {
  "name": "The Johnny Cash Museum & Cafe",
  "address": "119 3rd Ave S, Nashville, TN 37201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7435aa00-9332-11ea-bc9e-14b31f159f22.png",
  "tags": [
   "history",
   "music",
   "music"
  ],
  "link": "https://maps.google.com/?cid=12701666461124076277",
  "source": "GoogleMaps",
  "reviews": [
   "Husband - 5/5, I would rate 3/5 stars. \nPositives: Did a great job clearly breaking down his life. Lots of cool items to see. Like how they included June Carter as much as they did. Great if you love history and/or country music\nNegatives: If you don't like history that much, it is crowded and small.",
   "Surprisingly good museum. I really did not expect it to be as large or well done as it is. Tickets were worth it.\nBy the way this is coming from someone that never listened to a single Johnny Cash song before going into this. I only went because a friend was really into it at the time. And I still enjoyed myself a lot.\nThat guy was a genius.",
   "We really enjoyed our visit! I grew up listening to Johnny Cash as my parents were huge fans. The museum does a wonderful job of taking you inside of his world. I got a little misty eyed a few times because of the moving tributes. You won’t be disappointed!!",
   "This museum has a few interesting pieces and memorabilia. They do a pretty good job of displaying everything and giving a good view of it all. The museum itself is fairly small and, in all, there doesn’t seem to be a whole lot there. It may be nice just to see the specific pieces they have that others don’t.",
   "This was a pleasant surprise! Interesting items displayed lots of document to read and headphone for listening to music. We learned a lot of good things about Johnny Cash. He was way ahead of the idea of prison reform. And a great support of American Indian rights totally worth it and the tick was fairly priced"
  ]
 },
 {
  "name": "Nelson's Green Brier Distillery",
  "address": "1414 Clinton St, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7482914c-9332-11ea-8d7e-14b31f159f22.png",
  "tags": [
   "family",
   "learn",
   "knowledgeable",
   "tasting",
   "history",
   "tour",
   "tour",
   "family",
   "tasting",
   "history",
   "tour",
   "tasting",
   "knowledgeable",
   "learn",
   "tour",
   "tasting",
   "history"
  ],
  "link": "https://maps.google.com/?cid=11422430528601746454",
  "source": "GoogleMaps",
  "reviews": [
   "Great tour led by a very knowledgeable employee. My wife and I enjoyed a chance to hear about the history of the distillery and family as well as get a chance to step out on the production floor and into the barrel house. As a big bourbon fan, I found it interesting to learn about the differences between Tennessee whiskey and bourbon. The tour also included a tasting of the Tennessee whiskey (which I thought was an excellent product so I even bought a bottle), a few Belle Meade bourbons, and a liquor. Great stop if you're in Nashville and want to experience a distillery without leaving town!",
   "This place is fantastic! My sister and I took the tour and they had such a great story to tell about the family history. The tasting was outstanding as well. Would highly recommend.",
   "Short and simple tour about the distillery. We had Dylan and he was super informative. Even though the tour was short, my group and I learned a lot. The tasting was good, and a great experiences for whiskey lover or beginners.",
   "Harry did a fantastic job touring the distillery a wonderful time.  Great bourbon a must stop if visiting Nashville.  Very friendly professional and knowledgeable.",
   "The distillery tour was super informative and we got to see the behind the scenes distillery and learn about the history and process of distilling whiskey. The tasting was also pretty good with pretty big tasting pours. I overall enjoyed visiting Nelson's Green Brier"
  ]
 },
 {
  "name": "The Escape Game Nashville",
  "address": "510 E Iris Dr, Nashville, TN 37204, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/74ccba7a-9332-11ea-be0a-14b31f159f22.png",
  "tags": [
   "unique"
  ],
  "link": "https://maps.google.com/?cid=6413247128859262961",
  "source": "GoogleMaps",
  "reviews": [
   "Had a team building exercise. I'd suggest watching a few videos on how to play before going. I didn't have a clue what was going on just kinda along for the ride until everything started coming together in the game. I'd do it again. It's a lot if fun and let's adults feel like a big kid. I'd suggest eating a snack before hand and maybe bringing a water with you. 5 stars.",
   "This was my first experience with the The Escape Game. We had the best time. We had a big party so we took up all the slots. The staff was super friendly and their energy was awesome. It completely surpassed my expectations and we are already making plans to come back for another game. I would highly recommend going with a group so that you all know each other because it is definitely an activity that requires you to interact together. If you are shy, this might not be the thing for you. Come in cool clothing as the rooms can be somewhat confined.",
   "We did the Spec Ops room and it was great! It was very well decorated and had lots of clever puzzles we had to solve. I would gladly come back for new rooms!",
   "We came up from Charlotte, NC to play all the rooms at The Escape Game’s Berryhill location last Saturday, 2/22/2020, and we were not disappointed. The rooms at The Escape Game are some of the very best I’ve played, 426 rooms played to date, and Kyle went above and beyond to make sure our experience was the best it could be. You better believe we’ll be coming back here the second they open a new room.",
   "We did the ruins, mars, and heist rooms all within 24 hours. After booking our first one the other two were 20% off and they even closed out the rooms for us. We were late to our last one because a party member had gotten sick and they even let us use the full time and were willing to refund the sick player. The games themselves had puzzle types that matched the themes of the rooms and each hint-giver we had would point us in the right direction if we were having issues with a puzzle. Very fun and friendly. High quality and unique story-based puzzles."
  ]
 },
 {
  "name": "Tootsies Orchid Lounge",
  "address": "422 Broadway, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7510c7d4-9332-11ea-83ee-14b31f159f22.png",
  "tags": [
   "unique",
   "music",
   "drink",
   "music",
   "performance"
  ],
  "link": "https://maps.google.com/?cid=2575564174631023828",
  "source": "GoogleMaps",
  "reviews": [
   "Very cool bar. Has a unique atmosphere. The rooftop was very nice. The band playing during our visit was really good and the place just had a party feel to it. Very fun place to have some drinks and listen to music.",
   "Tootsies is my favorite bar to watch some of the best musicians perform while trying to find that one thing that puts them on the map.  Stopped in yesterday at 1:00, got to see three different bands and didn't leave until 7:30.  I Love This Place",
   "You have to visit this rooftop bar.\n\nGreat music and views from the rooftop.\n\nDrinks are reasonable for Nashville.\n\nThe staff were extremely friendly and very quick to get drink orders when busy.\n\nWe had a fun time listening to the live music and catching some sun on the rooftop.",
   "Gather a few of your friends n go.   Listen.   Check out the vibe and then try and stump them with a song request.  4 join forces and pitch in $20 to completely change genres.",
   "2 performance stages.   Preferred the one in the back.  Just a great authentic vibe in this bar.    Quality performances for the couple of hours I spent there.  Will definitely will be visiting again when I'm back in Nashville."
  ]
 },
 {
  "name": "Honky Tonk Party Express Bus",
  "address": "208 Broadway suite b, Nashville, TN 37210, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/756550ec-9332-11ea-b1a1-14b31f159f22.png",
  "tags": [
   "free",
   "music",
   "drink",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=12316249276690398972",
  "source": "GoogleMaps",
  "reviews": [
   "Our bachelor party had a great time. Cat was our bartender and was very friendly. They let us suggest song requests and mostly let us enjoy ourselves. They took us by the stadium for great pics and did everything they could to make us comfortable. There are many options but we were very happy with our experience. Thanks!",
   "Will DEFINITIVELY  be booking with this company again ! WE HAD A BLAST !!! Our Bus driver Was the absolute most sweetest lady !! Booking the event was So easy an stress free . It was literally like I just told the company the day I was coming an they took care of EVERYTHING else !",
   "Did my wife’s 40th this weekend with honky tonk party bus!  It was a great time.  Kimberly,  drive us around and she was great!  Kelsey, had the music on point and drinks full the hole night.  We will have those memories forever.  Everyone should try this and drive around downtown in the bus!  Thanks again to everyone!  The communication was awesome..\n\nThanks",
   "Told our large group we could bring a few people under 21 as long as they didn’t drink and then once we arrived they told us they could not come on the bus or get their money back. Pretty much lied to us, refused a refund, and told us to leave our friends or all lose our money. Extremely rude the whole time and tried to start arguments. If you’re trying to have fun in nashville these are not the people try a different bus there are a bunch!",
   "My best friends Bachelorette party just became the best experience of my life because of Honkey Tonk Party Express! RJ was super funny and awesome.  Our bartender/DJ, Dana, was amazing!  She was the most friendly, most fun person to have on the tour with us.  We all had a blast and will never forget the memories we have created!!"
  ]
 },
 {
  "name": "Honky Tonk Highway",
  "address": "Broadway, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/75ad2f4c-9332-11ea-a0a1-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "music",
   "family",
   "music"
  ],
  "link": "https://maps.google.com/?cid=1815400073359395367",
  "source": "GoogleMaps",
  "reviews": [
   "We ate up on the patio where one of the garage doors was open, nice fresh air.  The food was very good. Home made breads and an eggplant tapenade was fantastic.   We had the calamari.   Just a touch of red pepper flakes and just the right amount of marinara sauce.\n\nThe brick oven meatball pizza just melts in your mouth.  Definitely a place to check out.",
   "Always a great time. They seem to get some of the best bands in Nashville! Great service. Haven't eaten here yet...",
   "Had an amazing first time experience. Would love to come back without the kiddos next time. But they enjoyed it as well.  Had some lunch at The Diner which was really good.",
   "A walk down Nashville's Broadway Street and you can't help but hear the bands from at least two or three dozen bars playing music.  If you want to experience what I call a Honky-Tonk Bake-off then this is the place to do it. Jump from bar to bar, listening to band after band, drinking at each stop ALL DAY.",
   "This street was super fun. High energy! Bar after bar with live music wafting into the street. This place is always full of people day and night. Many places even allow children during the day so you can bring the whole family and enjoy the afternoon."
  ]
 },
 {
  "name": "The Escape Game Nashville",
  "address": "162 3rd Ave N, Nashville, TN 37201, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/75fc1434-9332-11ea-a548-14b31f159f22.png",
  "tags": [
   "unique",
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=4404428304195323860",
  "source": "GoogleMaps",
  "reviews": [
   "LOVED the rooms!  Very cool and unique games/puzzles.  Prison Break is very challenging and something you must try.  We’ve done quite a few escape rooms, and this one has some very interesting and unique features.  We also did Gold Rush, which was also a lot of fun.  Well worth your time and money!",
   "The place is just great and they have around three different rooms. They are very kind and explain the whole process to you im case that you are scared. Besides having an amazing service the location and rooms are perfect. I recommend the game to anyone in case that you are close because you can have a great experience.",
   "This place was amazing! It was our first time playing and we did the Prison breakout. It was so fun, luckily we were paired up with another group and they were great. We almost made it out but not quite :( Everyone who worked there was so nice and helpful, we will definitely be back! Special Thanks to their employee Jacob for a great prison break experience!",
   "Seriously, lots of fun. We had a group of 8. We ran the Gold Rush option. And it was not easy but not too hard. \n  Previously, I’ve played a lot of escape room board games. I’ve often had to ‘cheat’ to figure out how to use the clues I was given. \n  My group did have trouble with some locks that didn’t work smoothly. During the game you have the option to get clues. And we were able to use them to figure out that we had correctly solved a puzzle but had to work the locks more. \n   The puzzles and challenges were satisfying. They weren’t cheap. And there were a number of surprises along the way. Definitely worth it. Great group activity. \n  I will be going back to run the other options. Just awesome.",
   "What an absolutely fantastic escape room company. We visited today to do The Heist, Nashville and Gold Rush and had a wonderful experience. The staff were incredible and we were made to feel very welcome. In over 300 escape rooms that we have done around the world, Gold Rush is up there with my favourites. Can not recommend this very professional company enough. Jacob, Libby and Kim took such good care of us. We are heading to the Berry Hill location tomorrow to continue the fun!"
  ]
 },
 {
  "name": "Patsy Cline Museum",
  "address": "119 3rd Ave S, Nashville, TN 37201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/763dff40-9332-11ea-928b-14b31f159f22.png",
  "tags": [
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=5331235669228123855",
  "source": "GoogleMaps",
  "reviews": [
   "I learned so much from this museum.  There was so much of Ms Patsy inside. To see some of her belongings was priceless.  You wont regret it.\nThe gift shop has so many beautiful things and at an affordable price. You have to go see for yourself.  It's an amazing place for an amazing woman. ❤💋💃",
   "Wonderful experience especially if your a fan like me!",
   "Incredible to see and nicely done. Such an important figure for female country artists everywhere.",
   "Although the museum is relatively small, they had done such a good job putting together her successful carrier, as a wife, mom and artist. I was impressed by all the information , the authenticity of her personal belongings, furniture they gathered for our delight.",
   "Patsy Cline Museum is WONDERFUL. Friendly staff, amazing personal items of Patsy's. Small museum but MIGHTY!!  What an amazing Patsy. RIP."
  ]
 },
 {
  "name": "The Escape Game Nashville",
  "address": "523 Opry Mills Dr, Nashville, TN 37214, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7682cf6e-9332-11ea-ba33-14b31f159f22.png",
  "tags": [
   "unique"
  ],
  "link": "https://maps.google.com/?cid=5450094686206779407",
  "source": "GoogleMaps",
  "reviews": [
   "My time here was unimaginably great. I think it's one of my favorite things to do at the mall, and the games are always well put together, very cohesive. My game guide was Clari, and she was extremely caring about our safety needs, and celebrated our win with the same pride we felt!!",
   "The Escape Game at Opry was so much fun that I forgot we were inside a mall! The clues were so unique and clever and kept us on our toes.  Better than any other escape room companies I’ve seen.  Will definitely book again!",
   "We had a group of 5 adults and an infant. Our guide was Anthony. This was a first escape room experience for all of us. We did the Gold Rush one. It was soo fun! We finished with 17 seconds left! It was challenging and thrilling! I definitely recommend this escape room and location. The staff was friendly and encouraging and it was so much fun! Will do more of these in the future.",
   "I came on my birthday and did the Special Ops room with some friends- it was SO MUCH FUN! Courtney S. was our game guide and made the experience that much more “Special”! I’ve also been through the Gold Rush room and that room was also a lot of fun. 10/10 would recommend (or I guess 5 stars....)!",
   "Played the special ops mysterious market game and it was a ton of fun! Highly recommended! We escaped with seconds to spare!"
  ]
 },
 {
  "name": "Nashville Convention & Visitors Corporation",
  "address": "150 4th Ave N G-250, Nashville, TN 37219, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/76ccd11e-9332-11ea-9609-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=12288124331729079046",
  "source": "GoogleMaps",
  "reviews": [
   "had a great time spent Easter Sunday.",
   "We are from Indiana. We were visiting Nashville. When we stayed at Gaylord Operland hotel but parked for 6 hours in one of your parking areas onAugust 15, 2019. We had dinner and went to a concert at the Bridgestone arena. We had 2 separate charges one for $30 and one for $45 same night. ..a total charge of $75 for 6 hrs of parking. I contacted you about this situation and asked if one charge the lesser could be refunded since we were charged twice for the same time and same parking lot. You said you couldn't do it but would give us a certain percent off on the next time we parked there. Again being out of town this is not an option since we do not use this parking. Way to go for fleecing visitors Nashville and Premier Parking.",
   "I visit this attraction numerous times a week do to work detail it's a great place to attend if you're out of state or you're touring the facility",
   "If you need ANY information about Nashville, this is the place! This organization is a huge part of what makes Nashville...Nashville. The staff was incredibly helpful and informative. They are passionate, hard-working, and constantly creating new plans for the City of Nashville.",
   "This is the best place for a short weekend mini vacation. People from all over come here,  especially bachelorettes/ bachelor.   There is no better party place than here. Even people from Vegas come here to party. If you're not into drinking and clubs, TN is a huge state that has lots beautiful scenery that can be seen at Chattanooga or pigeon forge at the smoky mountains. There are tons of shopping malls and outlet stores, and of course a vast variety of food. Can't leave TN before you try out the barbecue!"
  ]
 },
 {
  "name": "I BELIEVE IN NASHVILLE Mural",
  "address": "2702 12th Ave S, Nashville, TN 37204, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/77109106-9332-11ea-9490-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=1092149867514856123",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely mural to find on our mural hunt.\n(Cropped myself out the pic because I don't like it lol)",
   "Such a cute area of nashville! Attracts a lot of tourists, so you may have to wait in line for a photo. There are lots of other wall murals in the neighborhood, though, so you can just walk around and check those out. There are also a bunch of different stores and restaurants that you can try out so that your trip to this mural isn't completely useless.",
   "That was one of the places you definitely have to visit , nice murals all around,  be ready to take one of the time pictures,  I love Nashville!!",
   "Today was my lucky day! \nI founded a dinosaur in front of the Mural",
   "Nice mural to have your picture taken.  There is always someone around to take your photo.  It's located between buildings, right next to Reese Witherspoon's Draper James store.   Nice area to walk around and shop or have something to eat.  Near a residential area so you can find street parking easily."
  ]
 },
 {
  "name": "Belle Meade Plantation",
  "address": "5025 Harding Pike, Nashville, TN 37205, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/77662b34-9332-11ea-9d03-14b31f159f22.png",
  "tags": [
   "tasting",
   "history",
   "winery",
   "tour",
   "brewery",
   "tour",
   "tasting",
   "field",
   "learn",
   "history",
   "tour",
   "tasting",
   "delicious",
   "tour",
   "historic",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7244420887945079455",
  "source": "GoogleMaps",
  "reviews": [
   "This place was so much fun for my boyfriend and I. Mary Jane did a fantastic job with the bourbon tasting and explaining the history of the winery and brewery. We also did a mansion tour which Sarah did a great job explaining the history of the plantation. The grounds are absolutely beautiful and everyone was very friendly. I would definitely come back to see more.",
   "Had a great time. We went as a large group of 14 and did the tour which was awesome and super informative then got explore the grounds a bit. At the end we did the wine tasting and bought wine and other fun stuff to take home. I have recommended this place to anyone thinking about taking a trip to Nashville. It's a nice change of pace from the night life there.",
   "Will always remain one of my favorite places. I went here the first time as a girl for a school field trip and absolutely fell in love with the entire place. It is definitely a good place to go to learn a little about Tennessee's history and to connect with the past. I believe my favorite little bitty about this place is the playhouse. It always fascinated me that its the same one the girls played in when they were little. Silly but its one of my favorite things about the place. The grounds are kept beautifully and the way the rooms are displayed is lovely and accurate. Lets not forget about that main stair case! It is absolutely beautiful.  Always feel like royalty when im on it. Love this place and love the way its represented. A gem you must see.",
   "We visited Belle Meade with a group of 14... booking was simple, and after one cancellation they were very understanding and were able to refund the ticket. I have been to the Hermitage, so I was interested to see how this would compare. The grounds were smaller, but the decorations stayed true to the time period, and as we were told, many were original. Our tour guide was able to answer all our questions and provided excellent information. The weather was chilly and rainy but didn't have a negative impact on our tour. The wine tasting at the end was a great addition to the afternoon, and I must note the gift shop was one of the better ones I've seen, and if I didn't have a carry on suitcase I would've purchased at least a bottle of wine and six souvenirs. Highly recommend!",
   "My husband and I are in no way horse racing enthusiasts but we both found our visit to Belle Meade Plantation completely fascinating. It is a lovely property, steeped in interesting history. After our tour we had a delicious lunch at the on-site restaurant.  We only had time to visit one historic property on our trip and were not disappointed at all with our choice of Belle Meade."
  ]
 },
 {
  "name": "Cumberland Park",
  "address": "592 S 1st St, Nashville, TN 37213, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/77b499b4-9332-11ea-9437-14b31f159f22.png",
  "tags": [
   "free",
   "free",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10936636824793438057",
  "source": "GoogleMaps",
  "reviews": [
   "Parking on the south east side of the pedestrian bridge was free when I went, which was a Thursday afternoon. No event was going on at Nissan Stadium, so more than enough parking was available.\n\nI liked the park, the bridge was nice, the view of Downtown from across the river is very pretty, and it seemed very well kept/little to no garbage around. Would definitely go again.",
   "Love this park!! We've been going here alot over the past 4yrs, since my daughter was born. She loves it, & so do her dad & I. Great place to go year round, but definitely more fun in the warmer weather months. 👍",
   "The Pedestrian Bridge and Cumberland Park are a definite must-do in Nashville. Whether you're a tourist or a resident, it's a beautiful spot to be in. Park near Nissan stadium and easily access Honky Tonk district and the Riverfront. It's definitely one of our favorite places in the city.",
   "Fun little public splash park right downtown. Safe place for families and FREE.  Perfect for a hot southern day.  There are also slides, climbing ropes and a kid sized rock climbing wall if they don't want to get wet.  Outdoor stage sometimes had small shows. Check it out!",
   "Fun place for kids to blow off steam. Safe, conveniently located and well designed."
  ]
 },
 {
  "name": "Tennessee Agricultural Museum",
  "address": "404 Hogan Rd, Nashville, TN 37220, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/77faf2ba-9332-11ea-9d27-14b31f159f22.png",
  "tags": [
   "free",
   "learn",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2740608718618082925",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice museum, great selection of displayed items to view, even cabins and a one room school",
   "I've been a number of times. It's free so it is a great place to explore when you are looking for something to do. Occasionally they have special events.",
   "Informative and family friendly opportunuties to learn about different machines and items from a different time.  Lots to explore outside and inside.",
   "This place was totally awesome kids absolutely loved it. Loved looking at all the old stuff and tractors and visiting with the horses staff was very friendly ",
   "Beautiful place to work on a sunny Friday!"
  ]
 },
 {
  "name": "Percy Warner Park",
  "address": "50 Vaughn Rd, Nashville, TN 37221, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/78540e6c-9332-11ea-8ebd-14b31f159f22.png",
  "tags": [
   "nature",
   "walk",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=5032905476192483345",
  "source": "GoogleMaps",
  "reviews": [
   "The best place to go to get close to nature! It has so many options for walks from paved roads to trails. There are so many different level trails available, check out the maps to know where to best access each trail. Take water and enjoy!",
   "What a special place we have here in Nashville. I grew up going to this park and have many great memories (except Steeplechase ‘86 but that’s a long story). Anyway, do yourself a favor and walk, run or hike a trail, have a picnic, play some ultimate frisbee or just drive one of the scenic drives. You won’t be disappointed.",
   "A Nashville treasure! Beautiful, hilly terrain with hiking trails everywhere. It's huge too. You could explore for yeah and not discover it all.",
   "Mossy Ridge Trail from the Deep Well entrance off HWY 100 is a little over 5 miles. Not a trail I would recommend for beginners, but a great hike not far from downtown Nashville.",
   "One of Nashville's prized possessions. A SECRET that many are not aware of. A BEAUTIFUL piece of paradise that can NEVER be destroyed by greedy people."
  ]
 },
 {
  "name": "Music City Walk of Fame Park",
  "address": "121 4th Ave S, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/78997bee-9332-11ea-8c46-14b31f159f22.png",
  "tags": [
   "music",
   "music",
   "kids",
   "family",
   "kids",
   "music"
  ],
  "link": "https://maps.google.com/?cid=11292262136222187955",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful place to honor musicians. The location across the street from the Country Music Hall of Fame makes this a must see. It is a great place to check out and take in all that is around you",
   "Well worth visiting while in the downtown Nashville area. Many of the big names in Country Music have a black plaque you can visit. Can be hard to take pictures, we went on a rainy day which made the plaques very shiny to take pictures.",
   "We enjoyed it even though we aren't a big country family. My kids love Elvis and Johnny Cash though!",
   "Give him what it is this park is sadly understated. Yes, all the stars are there. But there are also quite a few homeless sleeping in the park, people riding through the park on scooters - kids, yet, ignoring the rules.  It really could use some sprucing up, maybe some nice shrubs and plants and flowers. It is sadly kind of drab.",
   "Good photo op with some of the current and past country music star stars, nice little park \n\nCountry Music Hall of Fame and Museum across the street"
  ]
 },
 {
  "name": "General Jackson Showboat",
  "address": "2812 Opryland Dr, Nashville, TN 37214, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/78e1f864-9332-11ea-9482-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "food",
   "food",
   "music",
   "food",
   "performance"
  ],
  "link": "https://maps.google.com/?cid=6043919699323735081",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I were celebrating our 25th anniversary. We had a great time. The entertainment was phenomenal! They were all very talented. The food (chicken cordon blue, Mac and cheese, steamed carrots, prime rib just to name a few) was delicious. The wait staff was very professional and knowledgeable of everything. We'll be back.",
   "I had a great time on this mini cruise. The boat staff was wonder. We did the cruise where you meet the captain and take pictures and he was fantastic and patient with everyone.  The food and decor was good. I really enjoyed the music show. The whole experience was wonderful and I'd do it again. Highly recommend.",
   "So we did the Christmas Show in December of 2019.  Overall, the show was good, and the food was good, and it was definitely something a little different than the usual dinner and a show kind of evening.  The view of Nashville along the river on deck is quite beautiful. \n\nNow for the parts that I did not enjoy. The line to get in seemed to take a long time.  The wait at each of the bars to get drinks also took what seemed like excessive amounts of time.   The buffet line was also quite long.  Most of the waiting at the dinner table was ok because we had pretty good company...BUT that was by luck.  \n\nMy wife booked the evening for just the two of us, and it was not clear that we would be seated at a table of 10 with strangers.  Now it just so happened that we all got along after the initial period of uncomfortable silence, and I think we all wound up enjoying each others company, but I have to say that was pure luck. \n\nI would have rated this review a 4 or 5 stars if my wife and I had been seated alone.",
   "I like it... My wife and I enjoyed it we went for the Christmas special and it was great. They show fan appreciation for a young woman who always visit every year. However it might be very loud at something during the concert performance bring headphones if you are with someone who might need it. The view for outside was great and the ride was smooth.",
   "I will tell you that you better get ready for a show to knock your boots off. Service staff is very good and highly effective. Getting to watch the skyline of downtown come into view was breathtaking. Then the entertainment that was provided is great. Don't let me waste anymore of your time now. Buy the tickets and you will never regret it!"
  ]
 },
 {
  "name": "Andrew Jackson’s Hermitage",
  "address": "4580 Rachels Ln, Hermitage, TN 37076, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/792baa92-9332-11ea-8f0d-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "tour",
   "historic",
   "history",
   "walk",
   "tour",
   "history",
   "learn",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7186269056876293187",
  "source": "GoogleMaps",
  "reviews": [
   "It's American History that I've come to love. I imagine being there in period seeing all the activities taking place. Especially upstairs, visualizing all the visiting children running back and forth in the upper hall separating bedrooms. You know they had to get a peak downstairs at evening guests and during parties. Not for children or teens unless they are known to be mature and have a specific interest in American History.",
   "Wow. Such rich history here, some of which is heartbreaking. The grounds are gorgeous and very well-kept, and the tourguides (dressed to play the part) did great at bringing the past to the present and making us feel as though we had traveled back in time. I felt as though we had been transported to another world. A very eye-opening and visceral experience, and a trip to Nashville wouldn't be complete without stopping here. You won't regret immersing yourself in such a vital part of our country's history--the horrible aspects and all.",
   "Highly recommend this trip into our Historic past. From the first moment we drove onto the property until reluctantly leaving I was enthralled with the Hermitage. I went through the museum, the tour, then walked the paths reading about the history of the place. Very worthwhile!!",
   "American history at it's best.  The dual drama is well done.  The mansion is worth the wait in line.  We spent 3:15 and I wish I had about 45 minutes more really finish a walk of the grounds.  We spent about an hour in line to tour the mansion - we went on a Saturday at 1:00 in December.  If you go at a none busy time, if there is such a thing, maybe you could do it 3:00 hours.",
   "Love for what ever reason learning history about our past presidents and the how the period compares to the present period.  Seems like every era has its challenges.  Nice exhibits and an educational movie about A. Jackson's contributions to US History.   It was nice to learn he was the only President to pay down the the national debt to zero.  No other president can claim that award.  The guided tour of the actual house was excellent.  Jack our tour guide was very good at providing more history of the house, its contents and Andrew Jackson himself.  Lunch at the Kitchen Cafe was good as well.  Everyone we interacted with both at the cafe and the property were pleasant and helpful."
  ]
 },
 {
  "name": "Nashville Public Square Park",
  "address": "Union St & 3rd Ave N, Nashville, TN 37243, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/796928ba-9332-11ea-bdb7-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=17440414322437007396",
  "source": "GoogleMaps",
  "reviews": [
   "The observation deck here is one of the best views of the city at night. Truly wonderful spot to meet up to start a night out on the town!",
   "Thank you! Nashville for allowing people to enjoy the public square and make events under the safety and security of downtown. Blessed to be a part of it...",
   "Large open space designed for gatherings and festivals. Check out the observation deck high above on the East-side",
   "The park is a great public area right in the middle of downtown, north of Broadway. Love all the fun concerts and events they use the space for! We stopped by on sunday before our flight home and got to try some of the local food trucks as well, perfect way to end the trip. Super easy to get to via tide share as well, or scoot scooting.",
   "This was a nice spot for Live on the Green. The water features are really nice and all of the shade is lovely. If I lived or worked downtown I would definitely come on a regular basis. The festival security did check bags for drinks and they wanted me to pour out my ice water - the guy suggested I refill my bottle inside the park, saying something about a water fountain, but I was there several hours and didn’t see a single fountain at the park. Annoying, but I just bought a $2 bottle of water from the festival vendor which wasn’t too bad."
  ]
 },
 {
  "name": "Hatch Show Print",
  "address": "224 5th Ave S, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/79bacc68-9332-11ea-a864-14b31f159f22.png",
  "tags": [
   "history",
   "tour",
   "history",
   "learn",
   "unique",
   "tour",
   "history",
   "tour",
   "art",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9202142089970499160",
  "source": "GoogleMaps",
  "reviews": [
   "A fun place to get some more history while you visit the hall of fame.  They give a great history and examples of the different posters they printed over the year and you have an opportunity to make your print as a souvenir!  It's crazy this place has been using the same process for 140 years.",
   "Had NO idea the rich history of Hatch and the parts in history that it played with so many facets of life.  This is a real, living, working piece of history that still plays a vital role in the print communications world!  Very much worth the visit and tour!",
   "Unique tour. Get to learn about the history, process and famous posters created by the Hatch Print company. First half of the tour is in the printing room, second half is in a classroom/work room. You do get to complete a print to take home (the print is nothing special, but still a cool experience). \n\nYou get a 10% discount at the shop after your tour (don't forget to ask for the discount).",
   "We visited TN from FL and this was the only event I chose to book in advance. We bought tickets to the \"Block Party\" (which lands on the first Saturday of each month during the art crawl). This was really one of the highlights of my trip. We had a little mini history lesson (I could've sat and listened even longer if they let me) before getting to it. The options felt endless, however, we would have really benefited by extending the time at LEAST one more hour. I went home with a couple incomplete projects, but it was still such a fun experience. My husband enjoyed it greatly, as well, and we have since framed our prints. I've told everyone about the prints and the history behind the Hatch Show. I do wish we got a tour with our tickets, even as a voucher to use the following day, as I assumed I'd get to see the old equipment but didn't get to (so make sure to purchase them separately if you want to see that). However, this doesn't take away from the experience as its own entity. I'd even consider paying for smaller group or personal sessions to get to use some type blocks. Thanks for the memory, guys!",
   "A still-active print shop using manual typeface.  You can get behind-the-scenes tours where you can print your own poster! These pictures celebrated the Oscar Meyer Weinermobile and the printing convention going on."
  ]
 },
 {
  "name": "Tennessee State Capitol",
  "address": "600 Dr. M.L.K. Jr Blvd, Nashville, TN 37243, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7a0e69cc-9332-11ea-88b1-14b31f159f22.png",
  "tags": [
   "field",
   "history",
   "tour",
   "family",
   "learn",
   "history",
   "free",
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=1255106270164848382",
  "source": "GoogleMaps",
  "reviews": [
   "It was great here if you're a Guest. You can Explore Eveeything From Paintings to History. It will be Better if you're in a School Field Trip or A Private Group. In November, We Visited the Second Floor, It was a Great View! We Also went Inside of one of the Rooms Which They made Laws in Them. We Explored All the Floors. After all the Exploring, We went Outside to see the Things in one Path. It was a Much Better Trip than Going Anywhere. It's was the Best trip Ever!",
   "Today we headed to Nashville to advocate for our city. \nStanding for residents and professionals. \nCovering everything from broadband access to taxes to tax sales. \n\nThis year the Tennessee Blue Book is yellow !\nWhy,  because this year is the 100th year anniversary of Women's Suffrage.  Women were able to vote! African American men were able to vote 50 years later.  African American women followed. \n\nMeeting with Barbara Cooper (District 86),  Katrina Robinson(District 33),  Joe Towns ( District 84) \n\nThey have a lot of work to do. \nTHEY HAVE ALREADY ACCOMPLISHED  SO MUCH!\n\n******Let's support them as they promote us!*******\n\n#TnRealtorDayOnTheHill",
   "LOVED IT! If you are able to be there and take the guided tour do it! So so worth it and this is a beautiful building!",
   "This was a nice family friendly place to go and learn some of the history of Nashville and Tennessee. They do a free guided tour a few times a day and our guide was great.",
   "Very exciting to be able to tour the Tennessee State Capitol. Veterans Day on the Hill 2020"
  ]
 },
 {
  "name": "Centennial Dog Park",
  "address": "2500 West End Ave, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7a516634-9332-11ea-96c9-14b31f159f22.png",
  "tags": [
   "free",
   "free",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=18122273450532605042",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful park. Lots to do for all ages. The Parthenon was absolutely beautiful. And the paintings they had inside are amazing. Definitely worth the trip. And priced at $6 admission",
   "The dog park was awesome!! They were running around everywhere, but of course controlled. If you are there then pay the $6 to go into the Parthenon. It  is probably the cheapest (but awesome) experience in Nashville. It is the only one in the entire world that is fully restored and built in scale. The bottom entrance is where holly he gift shop and ticket sales are. If you are around downtown I would def recommend visiting it. Everyone is friendly and the guides are free. They also over tours at 2 PM. Hope you enjoy the pics. This, the park, and the Parthenon are all very close together.",
   "Very clean very nice and there's plenty of nice people to talk to! I love the fact they even have people who provide very good and helpful articles from the Bible. It makes you feel safe.",
   "Great ! Historical. Close to farmers market  and state capitol. Pretty, loaded with trees, monuments and a great amphitheater.   A very pleasant surprise!  Free!\nEasy to get free parking.",
   "Lovely dog park, varied terrain, plenty of benches, and a walking path throughout.  Overall very impressed with the condition, park is well cared for.  Within walking distance to Centennial Park (about 5 mins on foot/paws).  Separate area for smaller dogs.  People were all super friendly, and dogs were all well maintained/picked up after!"
  ]
 },
 {
  "name": "Adventureworks Zipline Forest",
  "address": "4129 Whites Creek Pike, Whites Creek, TN 37189, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7a9c7970-9332-11ea-a35b-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=15755300992462666270",
  "source": "GoogleMaps",
  "reviews": [
   "I feel terrible for not remembering the guides names, but one of our guides had dreads. Both guides were awesome! Professional, and funny. I've never ziplined before so after a few I was pretty comfortable. Line seven was easily my favorite. I'll be back!",
   "Brandon and Landon were the best bookers ever. We laughed great photos lots of fun. Must do . Thanks Brandon and Landon! Grandma from Florida",
   "Liz And Josh were fantastic zip guides. .. Did not realize this place is on the grounds of Barbara Mandrells mansion the Fontanell. Beautiful",
   "Great staff so friendly  \nBest time ever \nWould totally  do this again",
   "Place was amazing!! Had a blast! My family from Boston was in town visiting and we took them with us to do the zip line course. The staff was friendly and made the experience worth every penny!!!! I def recommend going and taking the zip line ride!! Knock it off that bucket list!!!"
  ]
 },
 {
  "name": "The Gulch | Nashville",
  "address": "Nashville, TN 37203, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7aec5812-9332-11ea-b400-14b31f159f22.png",
  "tags": [
   "eat",
   "family",
   "wander",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=5796384747231400398",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing area. I absolutely love the vibe there. All the streets are cozy with modern buildings (or renovated). The artwork on the walls gives a special touch. What I like the most is that this area has tons of great places to eat, from breakfast, brunch, lunch, dinner and even drinks at night. Plenty of coffee shops, some clothes shops etc. A must visit.",
   "You're missing our pic. Awesome wall murial. Tucked away in outskirts of downtown Nashville. Had a blast. I'll share the baby wing photo of our family fruitcake. Been traded annually for 15+years. I love Nashville.",
   "The Gulch has the cutest places to take pics. Head up to the rooftop bar at the Thompson Hotel. A great view with great drinks.",
   "A great area to wander around with a camera and take pics! Lots of places to grab a bite to eat and a few high end shops to browse in. Amelia's flower truck was parked on a side street with a beautiful assortment of pretties for sale.",
   "From a local point of view I love the way that is shaping up each and every day. I sometimes drive and feel like I'm on vacation because things have changed so much. I love my city."
  ]
 },
 {
  "name": "Fannie Mae Dees Park",
  "address": "2400 Blakemore Ave, Nashville, TN 37212, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7b30dc54-9332-11ea-988a-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "art",
   "historic",
   "history",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=14264875580919709699",
  "source": "GoogleMaps",
  "reviews": [
   "Best park in Nashville, hands down.It's the first park I took my son to. I've been frequenting this park since I was a kid and have loved seeing them transform while also preserving the beauty this little park offers. Take the kids and have a great time!",
   "Fannie Mae Dee's Park is a wonderful urban park for children. There is plenty to do no matter the age of your child, easy access to a variety of sizes picnic tables for packed lunches, and a wonderful dragon mosaic art piece that's impossible to miss! There are swings for big kids as well as bucket seats for infants.",
   "A GREAT PARK for all! Have a picnic, play on the jungle gym, or play at the fort. Don’t forget the historic dragon. It’s a phenomenal piece of history. Ask someone local about it.",
   "Great spot for kids of all ages.  Newly renovated Dragon sculpture is beautifully done and a favorite for the kids to climb on and around.",
   "This was a great park! Very neat, free thing to do. Super cool dragon!"
  ]
 },
 {
  "name": "Escape Experience - Nashville Escape Games",
  "address": "501 Union St, Nashville, TN 37219, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7b897bf0-9332-11ea-aa67-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=2377775606260814407",
  "source": "GoogleMaps",
  "reviews": [
   "It was a great experience! Wish we would have had a little bit longer on the time considering it was the hardest room but otherwise it was a great experience outside the box world things to do on the weekend. Thanks!",
   "We loved this experience....tried to break out of the cell but failed!  Made it about 65% through the escape (just 2 of us).  Would definitely recommend.  Side note....the creativity/realism is simply awesome.",
   "Escaped with under a second left! We had a ton of fun!",
   "Very good escape room experience. We did the C-Block escape and really enjoyed the experience. It had varied puzzles and room to move. \n\nI wouldn't suggest going with the full 8 person capacity as it may be a bit cramped.",
   "A fun experience for my son and I!  Some interesting puzzles but we didn't escape in time."
  ]
 },
 {
  "name": "Treetop Adventure Park",
  "address": "Nashville Shores, Hermitage, TN 37076, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7bd0b9a4-9332-11ea-9b6f-14b31f159f22.png",
  "tags": [
   "family",
   "drink",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3686760555477748963",
  "source": "GoogleMaps",
  "reviews": [
   "We really enjoyed this. Felt comfortable and safe. Great adventure!  I feel for a 53 and 55 year old, we did great! Teenagers loved it. It really makes you push yourself to do things you think you can't. When you up there, there's no backing out unless you give up and I'm not a quitter.",
   "AMAZING experience! We took the whole family and every single person enjoyed it. Such a great workout while having a wonderful time! You can stop at any time and go at your own pace. The courses are exhilarating and challenging. The staff was all friendly as well. So much fun!",
   "It is totally irresponsible for you to continue to do business (In MARCH) during this health crisis while we need people to isolate to SLOW this virus down. You put your staff, your guest and the community at risk even with all the disinfecting you are doing. You cannot possibly harness a guest properly or help them into their harnesses without getting up close and personal, much less assist or rescue them.",
   "Park and office staff is great but, cooperate is not they denied my claim for a tree falling on my truck so I need to give a 1 star  its unfortunately we planned to go it least 2 to 3 times year because we enjoyed it so much but sad to say we will not support a company that dont support the customer thank you Gary Denlea Naples Fl",
   "I posted pics of the kids course and the adult course. Our family of seven went zip lining here on vacation and we all loved it. Our seven and nine year old did the kids course, and the guide was nice enough to accompany our seven year old on the course. Our grandparents took pictures from the ground. My other sons ( ages 12 and 14) and mother and uncle (both in their 50s) enjoyed the adult course. The two older adults got off at the half way point for a drink and then continued and finished the entire course. We were there for hours and to top it off, we ended the day by all going on their huge zip line course which was separate from the other courses. It was such a huge zip line that the other side was barely visible. This was worth the money and was fun for the whole family."
  ]
 },
 {
  "name": "NashTrash Tours",
  "address": "900 Rosa L Parks Blvd, Nashville, TN 37208, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7c35a8b8-9332-11ea-8c11-14b31f159f22.png",
  "tags": [
   "family",
   "history",
   "music",
   "history",
   "music",
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=18304919560061386250",
  "source": "GoogleMaps",
  "reviews": [
   "I laughed so much my stomach was sore the next day!!! \n\nThank you Jugg Sisters, Sheri Lynn and Brenda Kay, for a hilarious trip through Nashville! I didn’t know what to expect but they cracked us all up on the bus with their songs, their one liners, the history of music row and especially their zingers toward certain passengers. It was an enjoyable experience!  I would urge everyone to check them out.  Wish I had bought some merchandise so maybe next trip. 😘\n\nAnd most of all thanks to John and Darryl for the fantastic idea of getting family and friends together before your wedding.  ❤️",
   "Very disappointing. The reviews state it would be run by two women and it was non stop laughs. That was booked so we opted for the pip show. We got a history lesson on music row,  barely any singing , and very little laughs. It did not match the description or the reviews. It was so bad we got off the bus when there was a break and did not get back on.",
   "The BEST Nashville comedy tour! Pur group of 8 had a blast. Non stop laughs.",
   "Just went on the Nash Trash tour with the Jugg Sisters and I have to say HYSTERICAL.   We started laughing even before we boarded the bus.  If you want two hours of fun it’s definitely a must see",
   "Great ....would recommend to everyone !"
  ]
 },
 {
  "name": "Riverfront Park",
  "address": "100 1st Ave N, Nashville, TN 37201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7c8008f8-9332-11ea-bcf4-14b31f159f22.png",
  "tags": [
   "music",
   "walk",
   "walk",
   "food",
   "parks",
   "music",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=8929440521236858735",
  "source": "GoogleMaps",
  "reviews": [
   "Although usually a hot destination for tourists, living here affords me the opportunity to catch moments like this when one of the most beautiful and scenic locations in Nashville, is basically all mine! Riverfront Park is home to a very large portion of CMT Fan Fest every summer, as well as many of our great city's major events. In the past it was home to our NYE celebration, and served as home to the 2019 NFL Draft. Be sure to check out our annual 4th Of July celebration here when one of the nation's largest fireworks display is accompanied by the Nashville Symphony along with some of the biggest names in country music!",
   "Nice walk, but some spots can be a little keep your guard up.",
   "I LOVE THE RIVERFRONT PARK. I GO IN THE DAY TIME TO JOG OR WALK THERES LOTS OF PEOPLE AROUND, I FEEL SAFE... I RECOMMEND 💥💥💥💥💥",
   "We were in Nashville Tennessee and we loved it!! Museums, parks , good food and good music. Ready to go back.",
   "One of the neatest urban area parks-complete with a splash pad and rock wall. The old steel bridge is a walking bridge and there are great trails all around to get there by bike."
  ]
 },
 {
  "name": "Warner Park Nature Center",
  "address": "7311 TN-100, Nashville, TN 37221, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7cd7eae6-9332-11ea-b845-14b31f159f22.png",
  "tags": [
   "parks",
   "nature",
   "learn",
   "hike",
   "nature",
   "walking",
   "hike",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=3637014716590459896",
  "source": "GoogleMaps",
  "reviews": [
   "From hiking trails, to the Steeplechase, and all the playgrounds and pavilions in between, Warner Parks never fail to satisfy. We spent our day in the pond behind the nature center, catching tadpoles and salamanders (gently!), and had a blast. Thanks for yet another great day in nature Warner Parks!",
   "Wonderful place to bring children to learn about nature and to hike around. Lots of great trails and a nature playground. Highly recommended. We have been coming here for over 15 years. Lots of memories.",
   "Bring your bike or walking shoes, lots to explore! Well maintained area and it feels safe.",
   "Decent hike if you are looking to just get some exercise in nearby Nashville. There are certainly some pretty spots, but no summits or challenging hikes. It bothered me that I could continuously hear traffic, schools, etc. throughout the hike.",
   "Love this park! The hiking and running is great and the Nature Center is a quaint way to spend an hour!"
  ]
 },
 {
  "name": "Germantown | Nashville",
  "address": "Nashville, TN 37208, USA",
  "avg_visitor_review": "",
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7d29b1f6-9332-11ea-a6b3-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=5680490591613282469",
  "source": "GoogleMaps",
  "reviews": []
 },
 {
  "name": "Fort Negley Park",
  "address": "1100 Fort Negley Blvd, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7d81303e-9332-11ea-aa69-14b31f159f22.png",
  "tags": [
   "walking",
   "historic",
   "history",
   "tour",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=10247717189385349106",
  "source": "GoogleMaps",
  "reviews": [
   "This is a fascinating place to visit, however the fort itself is in ruins and what little stonework is visible is walled off with wooden barriers. If you're visiting for the (excellent) view of the Nashville skyline, take the left part of the loop and the trail up to the top of the hill. There are several wooden outlooks built at the top of the fort and with a few shade trees there as well.",
   "Great program presented by  AAHGS of Nashville. Runaways, Coffees and Fancy Girls featuring Bill Gary (book by the same title). Visitors' Centering was easy to locate (Near Adventure Science Center). Nice walking trail that leads to historical markings about the park. After walking the trails, I decided to become a friend and hopefully get involved in the restoration project. I encourage others living in Nashville or visitors to the area take some time to drop in. They also have a staff member on the property to answer questions and programs.",
   "This park is cool and historic, has really cool views of the city. I really enjoyed coming here. I was pretty disappointed though when we arrived and the park was in some significant disrepair. Some of the decking was in really bad shape, and because of that some of the paths and viewing spots were closed off to visitors. Which could totally defeat the reason for coming to the park in the first place. I hope that can be fixed soon.",
   "Cool place but not much to see. Alot of area was blocked off. Rich with history. Great view of the city though.",
   "Really cool and historical civil war era fort. Unlike many other civil war sites in Nashville, this one has it's own modern visitors center, complete with a small theater, gift shop, and exhibits. The fort itself has a well maintained trail around and inside of it. There is plenty of historical signage and information along the way. The views of downtown and surrounding Nashville are the best you'll find anywhere, especially on the north side of the fort. Such a cool site, and as the largest inland fort built in the civil war I am especially glad it has been preserved and can be visited today. This is a great place to bring kids, or history buffs. Also is a must see on the Battle of Nashville driving tour."
  ]
 },
 {
  "name": "Nashville WhatLiftsYou Wings Mural",
  "address": "302 11th Ave S, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7dd98446-9332-11ea-9538-14b31f159f22.png",
  "tags": [
   "unique",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=17920472479372343476",
  "source": "GoogleMaps",
  "reviews": [
   "Tourists love this thing. I don't recall what we were doing in the area but I'm tired of fighting Google about whether I was there. Everyone has their picture taken in front of the wings. Awesome. Have a great time. Enjoy yourselves.",
   "These wings have a very strong reputation in Nashville and around the country. Really cool to see but to wait an hour or more with so many other unique things this town has to offer it is a bit overrated. Fellas, let me help you get some time back because your significant other may be one of those that HAS to get this picture... head across the street and get one in 2 minutes... or you can wait in line. Overall this is cool to see but spending more than 20 minutes there feels like a poor choice of time spent in Nashville.",
   "I went during a slow period of the day, but these wings are too cute! You gotta get your picture with them.",
   "Be prepared to stand in line - but not for too long. We loved how kind others were - taking photos for us and we returned the favor. Located near a parking garage entrance/exit so if you are with children be mindful of that!",
   "One of the most amazing cities I've ever visited have gone back twice since first time and then have a third visit planned for the future if you ever get a chance to visit Nashville you should jump on that wagon and ride it all the way down town such a beautiful beautiful place so many attractions close by I mean too many attractions to name off I mean for crying out loud to take you an hour just to walk downtown just just looking around not even going in anywhere museums culture centers just loads and loads and loads of stuff to do what a great little town I really enjoyed visiting definitely going back"
  ]
 },
 {
  "name": "Music City Escape Room",
  "address": "2416 Music Valley Dr #135, Nashville, TN 37214, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7e240b76-9332-11ea-b093-14b31f159f22.png",
  "tags": [
   "family",
   "music"
  ],
  "link": "https://maps.google.com/?cid=9103216569132983595",
  "source": "GoogleMaps",
  "reviews": [
   "Me, my brothers, and my dad JUST finished the wizard and spells room! Best experience of my LIFE! I would DEFINITELY recommend this place to ANYBODY who likes thrills, has a sense of adventure, and is looking to have lots of fun with family and friends! Our hosts were Jessie and Antonio. They're super nice!",
   "Great escape room. Olivia was \"super\" great host we felt like real super heroes when we escaped the room with 20 seconds left on the timer. She was great for the time we booked our time to the finish.",
   "I went with my colleagues as part of our management team builder. One half of us did the Japanese horror room (which starts before you get in the room), and the other half did the superhero themed room.  Neither team got out (we were on the very last puzzle), but we had a great time and felt silly when we saw how easy it was to get out. Olivia was our assistant and she was really helpful.",
   "I've done around 20 different escape rooms all over the country. This one is way too basic and too easy. In all ways, choose \"The Escape Game\" over this!! The price is very similar but the value is not even close! It feels like Music City Escape rooms are just capitalizing on a trend for profit and not putting their heart into making a great experience. The production value was so low and puzzles simple.\n\nI would only go back to try the other rooms if it was $8 per person max.",
   "This was super fun! We didn’t finish our puzzle but it was still a good time."
  ]
 },
 {
  "name": "Fort Nashboro",
  "address": "170 1st Ave N, Nashville, TN 37201, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7e6cacc0-9332-11ea-ab8f-14b31f159f22.png",
  "tags": [
   "history",
   "music",
   "learn",
   "history",
   "historic",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=7378062788924654031",
  "source": "GoogleMaps",
  "reviews": [
   "Cool to see the replica of the fort which was actually not in the same location but close. Didn't care to see all the garbage below the fort on the edge of the river. Hope the city of Nashville takes some pride in their riverfront and cleans it up.",
   "Nashville is a must see! A small city with a plethora of character and charm.  This beautiful little city has an abundance of music and architectural landscaping. The history of Nashville and it’s deep rooted musical connections are something everyone should see. For me, This year, it was Christmas is Nashville. \n\nMerry Christmas to all and to all a Happy New Year.",
   "We arrived to find all the buildings closed and locked. Don't know if it was a scheduled shut down or what, there were no signs to that effect. But we walked through the fort and read all the signs and enjoyed ourselves regardless. Being in the fort makes you feel like you're stepping back in time. Also got a great shot of Nissan stadium. So definitely put this on your list, just call first 🤣",
   "Nice enough to learn about the local history of the area. Just be mindful of some of the homeless that hang there.",
   "This is a cool little stop off of the beaten path of Broadway. There isn't much there except for the historic log buildings. But, its really cool to have a little piece of history that survived and still being maintained in the downtown area. Its probably not something that I would go to downtown to visit, but if I am walking around it is a nice little side distraction to the hustle and bustle of the city."
  ]
 },
 {
  "name": "Shelby Park",
  "address": "Shelby Ave & S 20th St, Nashville, TN 37206, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7eb7ddfa-9332-11ea-ab6f-14b31f159f22.png",
  "tags": [
   "walk",
   "active",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=10520346930638352838",
  "source": "GoogleMaps",
  "reviews": [
   "Loved this park! Great for long or short walks. Nice black topped trails, with grass side trails. It was too muddy to try the side trails on our walk, after much rain. Easy to find and close to downtown.",
   "Big and beautiful park. Parking was easy. Everything is green. People from our group could play various active games at same time just by splitting and waking to near locations.",
   "An excellent place to go on a walk and to see the community. The pond in Shelby Park is a place people congregate to fish and chat. There are great walking paths although some turn into roads that are shared by cars. Beautiful wildlife including herons, ducks, fish, and of course everyone’s dogs.",
   "I'm here know doing video and photos.",
   "Kind of a scary once it starts getting dark... Watch about three drug deals go down by the railroad tracks and had two guys on bikes kept circle my husband and I.. will not go back to this park... Bonus it was very beautiful maybe just got there at the wrong time..."
  ]
 },
 {
  "name": "Cumberland River Pedestrian Bridge",
  "address": "Cumberland River Pedestrian Bridge, Nashville, TN 37214, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7f0f9798-9332-11ea-b054-14b31f159f22.png",
  "tags": [
   "walk",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=8788674925971289696",
  "source": "GoogleMaps",
  "reviews": [
   "Breathtaking view. When you take gps here it takes you to a neighborhood, make sure you park across at the Two Rivers Park and walk under freeway to get here. Its about 1 mile, .5 here and .5 back. Worth the view.",
   "Great place for a hike, recommended for all ages, bring your bike and helmet, if you are hiking bring a hat and water as it gets hot and humid on summer.",
   "Pretty cool place to check out and great view of downtown fireworks.",
   "it was hard to get here from my hotel however it seems like it's a very nice park.I was only able to see part of it because one of the bridges is closed.",
   "Very nice and beautiful ride watching the General Jackson roll under us. Be prepared for the ride back up over the bridge."
  ]
 },
 {
  "name": "Country Music Hall of Fame and Museum",
  "address": "222 5th Ave S, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7f567592-9332-11ea-b9e6-14b31f159f22.png",
  "tags": [
   "history",
   "music",
   "art",
   "music",
   "learn",
   "history",
   "music",
   "historic",
   "history",
   "music"
  ],
  "link": "https://maps.google.com/?cid=11941312864776359527",
  "source": "GoogleMaps",
  "reviews": [
   "The Country Music Hall of Fame and Museum in Nashville, Tennessee, is one of the world's largest museums and research centers dedicated to the preservation and interpretation of American vernacular music.\n\nThis was a very pleasing visit into the past of our country music. I think any trip to Nashville to explore the roots of country music could not be called complete without a visit to this wonderful museum. \n\nWe really liked this museum. The audio option provides good explanation of exhibits. Provides great overview of country music history. We enjoyed seeing Elvis's \"gold\" car and piano.\n\nWell worth the money.",
   "Super cool place, but you need alot of time to really see everything.\nWe were there just for a couple hours before closing, and couldn't get to see the top floor of exhibits in time. They have several interactive exhibits throughout that were pretty fun, like making your own music recording and CD cover art :)\nWe probably took over 100 photos and weren't even able to get to all the areas. Can't wait to go back one day",
   "One of the main attractions of Nashville and it does not disappoint. There is something for everyone to admire and learn about. My most surprising was Willie Nelson. I got such a kick out of the elaborately embellished suits that the men performed in and such bright colors which I found ironic because we had black and white TVs but it wasn't for us as home...it was for their audience. There is so much more to enjoy here.",
   "What a great way to spend several hours. A whole day could be spent there if you were really into country music. Took my teenage children and they enjoyed the new were displays, however they did enjoy looking at the history of country music. Not only the music, but the cars, instruments and clothing that the artists were during that time. We are intriguing.",
   "Certainly the best place in the world to experience the history of country music, and even if you are not a country music fan, it's worth a visit. You'll see hundreds of historic instruments - the ones played by the legends - as well as costumes, personal belongings, and other memorabilia. Beautiful building and conveniently located in the heart of the downtown entertainment district."
  ]
 },
 {
  "name": "Shelby Bottoms Nature Center & Greenway",
  "address": "1900 Shelby Bottoms Greenway, Nashville, TN 37206, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7fa1b1b0-9332-11ea-ac66-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "family",
   "nature",
   "active",
   "walk",
   "kids",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=5402378312337459223",
  "source": "GoogleMaps",
  "reviews": [
   "This is AWESOME!!!! Photos may not interest you... get out and take a walk in this Greenway!!! Love it....",
   "Beautiful Nature park with an abundance of trails along the East bank of the river. Walk, jog, bike, and roller blade. You can finish or start your ride on the pedestrian trail and rent a bike at the nature park to ride to the Cumberland pedestrian bridge. Nice green and plush with flora and fauna...I saw rabbits and a family of deer on my bike ride.",
   "Wow!  Super happy to have found this great park!  Great opportunities for hiking and biking. They even have rental bikes so if you are from out of town you can still enjoy a ride.  It’s was really pretty and very spacious, plenty of parking, etc.  get out and stay active while you are on vacation!  Super easy to do it in a place like this!",
   "Nice quiet place in the midst of the hustle bustle of the city. Beautiful views. Walk. Run. Rent a bike. Catch a ballgame (summer) the pond is gorgeous. The river is breathtaking. The nature center is beautiful but I’ve not been inside. The added hands on park for the kids is something I wish were there when mine were smaller. \nIt’s worth the stop. Bring a picnic. It’s Nashville at its finest. Plenty of parking.",
   "Great location for photoshoots. This park is an awesome place to get out of the city of Nashville while still basically being in the city.   Some of the trails feel pretty remote.  My friends and I love hiking out there."
  ]
 },
 {
  "name": "Nashville Shores Lakeside Resort",
  "address": "4001 Bell Rd, Hermitage, TN 37076, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/800455ca-9332-11ea-b5c1-14b31f159f22.png",
  "tags": [
   "economical"
  ],
  "link": "https://maps.google.com/?cid=1674821185632899988",
  "source": "GoogleMaps",
  "reviews": [
   "Good place to have alot of fun",
   "Great size waterpark. Fun for all ages. Season pass is the way to go and the souvenir cups are very economical. Best days to go our during the week when school is out. Weekends are always packed...",
   "Funnel cake wasn't good. It was a big soggy donut that wasn't even cooked all the way. Needs improvement. \nBought 2 of our tickets through Groupon deal. That was the cheapest we found.\nThen additional tickets on their website.  Cheaper than buying them at ticket counter.\nNice visit, we enjoyed it! \nFix the Funnel cake situation please!",
   "The ropes course was awesome, all the people working were very friendly and patient with my 8y/o that had never done anything like this. Everybody received quality personal equipment And a sufficient amount of training to feel comfortable in it. The extensive course give you many thrills and a fairly good workout too, I do recommend this to a lot of people to give it a try you won’t be disappointed.",
   "Water park!"
  ]
 },
 {
  "name": "12South Nashville",
  "address": "12th Ave S, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/804adffe-9332-11ea-8af8-14b31f159f22.png",
  "tags": [
   "food",
   "walking",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=9585246209574363227",
  "source": "GoogleMaps",
  "reviews": [
   "Great for walking and shopping. Trendy shops and yummy food choices. It’s a great place to spend some time walking, chatting and enjoying life. It’s easy to get to. Can be crowded depending on the time of year but usually quite manageable and fun!",
   "This was my first time in Tennessee and I was definitely surprised by 12South. It was a very cool strip with a lot of interesting shops. Parking was a little challenging, but walking around was enjoyable.",
   "It's a good thing I don't live near here.  Best ice cream I've ever had! Large variety of inventive flavors.",
   "My old haunting grounds.  Pedestrian friendly and many good choices.  Try out the Muslim center for something different.",
   "Good neighborhood, great people! Easy to navigate and awesome shops to pop you head into! Edleys BBQ was great, excellent place to use the bathroom and refuel!"
  ]
 },
 {
  "name": "Downtown Presbyterian Church",
  "address": "154 5th Ave N, Nashville, TN 37219, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8095a4e2-9332-11ea-b8e5-14b31f159f22.png",
  "tags": [
   "art",
   "history",
   "tour",
   "history",
   "structure",
   "music"
  ],
  "link": "https://maps.google.com/?cid=17886522476630530516",
  "source": "GoogleMaps",
  "reviews": [
   "The 95th Holiday Waffle Shop was today and it was awesome.  Waffles with Nashville hot chicken were a favorite of course.  Silent auction and a bake sale too.  Looking forward to next year! \n\nThe church is so rich in history and the Egyptian Revival architecture is fascinating.  A great church to visit on Sunday or during the Nashville art crawls.",
   "An excellent example of the early architecture of Nashville. I was once given a guided tour by a good friend who worked there. They were very detailed in the explanation of the construction and even more detailed when describing the the future plans for the management of the beautiful and well maintained old structure. And of course there were the other stories\n... Actual local truths that had occurred and in some way or another had an impact on the church... Or those almost a little too far fetched and possibly a tad bit frightening at the same time, ones that you sincerely hope are entirely fictional, but know full well in the back of your mind that there is a little bit of truth in every story 😬😳\n\nOf course i don't recall any of it really it was an awful long time ago... And i was a lot younger and maybe didn't pay as much attention as i should have to the truely beautiful and interesting things in life like the history behind the Downtown Presbyterian Church. \n\nSo go see some of the old architecture when you're here. They're like a well-kept local secret hidden in plain sight. And please people we've already convinced the poor tourists that peddle taverns are a good 💡 idea, do we have to have a Party 🎉 Fire 🔥 Truck 🚚? Yeah I saw it. 😕It's as real as any of the other constructs in this dimension anyway. 🤷🏽‍♂️ 🤷🏻‍♀️\n\n👽👻👾🤪",
   "For the past few years Everytime we go to Mom's Demand Action Against Senseless Gun Violence in America this amazing church and the volunteer coordinator have treated us like WHAT LOVE LOOKS LIKE! THANKS FOR THE LOVE ❤️❤️💗❤️💗",
   "Beautiful sanctuary. People very warm and friendly.",
   "Good pipe organ music and beautiful  small choir singing on Sunday service at 11:00am. Before service, you can have a cup of coffee to warm up."
  ]
 },
 {
  "name": "Off The Wagon Tractor Tours - Nashville Party Wagon",
  "address": "533 Lafayette St, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/80e67d82-9332-11ea-876f-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "tour",
   "drink",
   "tour",
   "music",
   "drink",
   "tour",
   "music"
  ],
  "link": "https://maps.google.com/?cid=8960403765813111607",
  "source": "GoogleMaps",
  "reviews": [
   "SO FUN! Off the Wagon Tours was the highlight of our bachelorette weekend! Everyone had a blast and I would recommend the tour to anyone coming to Nashville! Ivy was our bartender/DJ and she was absolutely AMAZING! The staff was friendly and fun and we did not want to tour to end! We drank, danced, played games, and explored the city in style!",
   "Absolutely incredible experience! If you’re looking for a fun time, this is it! Celebrated my best friends birthday and rang in the new year Off the Wagon! We even ended up extended our tour because we were having so much fun! Ivey is amazing and great DJ listens to all your requests. 10/10 recommend and absolutely would do this again next time I’m visiting!",
   "We had a bachelorette weekend for my best friend a few weekends ago and we reserved this Tractor Tour and boy are we glad we did! This was such a fun experience and made our first day in Nashville a day to remember! Shout out to Ivy! She's the best bartender/DJ/photographer ever!!",
   "Off the Wagon Tractor Tour was fantastic!  We had a party of 9 people, was  a perfect way to cruise around the city, drink beer, and listen to great music.  Cory and Ivy were awesome!  Would highly recommend!",
   "We used \"Off the Wagon\" Tours for our friend's bachelorette party, and although I don't have photos, I can say in confidence that they showed us a great time! We could drink and get a tour of the best areas of Nashville. We played music, danced, sang, and had such a fun time. We will be back to use them again if we come into town."
  ]
 },
 {
  "name": "Music City Crawler",
  "address": "122 3rd Ave S, Nashville, TN 37210, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/81284018-9332-11ea-8c4a-14b31f159f22.png",
  "tags": [
   "music",
   "tour",
   "tour",
   "music"
  ],
  "link": "https://maps.google.com/?cid=5822619441388847403",
  "source": "GoogleMaps",
  "reviews": [
   "Hunter and Maggie for the win! We booked this on a whim after seeing one of the street, and we can't have been more pleased with that decision (and very happy yours was the first we saw!)! It was so cold the night we went out, but after a few minutes, laughs (and of course drinks) I don't even remember the temperature (hehe). I can't say enough good things, and I hope we get to do this again some time! In the meantime, sharing our wonderful at the Nashville airport with anyone who would listen will have to do! Great job guys, our group of four thoroughly enjoyed ourselves!",
   "James and Ottis were the best in the world, we would hang out with them off duty in a heart beat ;) !!! Started early and spent the morning having the best time ever!! Thanks for making Jen's bachlorette part the best ever!",
   "Hunter and Maggie made the experience incredible for us!! Their energy and positive vibes were infectious. We had an amazing time touring the city, playing our favorite beats and drinking our favorite drinks. Maggie made our music wishes happen, and made sure that our cups were never empty! Would highly recommend this experience to anyone looking for a great time, and I will definitely repeat this if I find myself in Nashville again!",
   "This tour was the highlight of our girls weekend! Hunter &Maggie really amped up the fun for us. They seem to have great chemistry and it looked like they are having almost as much fun as we were. While the reviews seem to indicate they are like this with every tour, they made us feel like we were the best group they had ever had! So much fun and I would go again in a heartbeat next time we're in Nashville!",
   "DO NOT USE THIS COMPANY! \nSo unprofessional and rude! \nWe had a reservation for a tour this past weekend, and we got a phone call three hours prior saying they had to cancel due to \"mechanical issues\" with their bike and they did not have a backup. However, then we saw the SAME bike we were supposed to be on out on Broadway at our scheduled time. When the lady called me to cancel she was SO rude and unapologetic about the entire process. She did not once offer a discount for a different time or day. If you don't want your Music city plans ruined, then  DO NOT use this company!!!!\n\nTo your response: You gave me an option for a party bus with no discount, AT ALL. I was never once rude or did not hang up on you. I asked you multiple times if there was any other time to reschedule to and you made it very clear there was not and there was nothing you could do other than a refund. I am sorry that you are upset for the terrible review, but giving a rude reply is also not the answer. If your customer service was better then this review would have been different."
  ]
 },
 {
  "name": "Etch",
  "address": "303 Demonbreun St, Nashville, TN 37201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8179bb6c-9332-11ea-a4f4-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "delicious",
   "drink",
   "food",
   "adventurous",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6005516580883070453",
  "source": "GoogleMaps",
  "reviews": [
   "We had an fantastic meal here with friends. The service was outstanding, our waiter was very knowledgeable of the food preparation and menu. They have numerous gluten-free options and the waiter help us navigate this. They have a nice wine list, I had a glass of red with my meal. We started with the GF rolls and cauliflower plate, this cauliflower plate was a treat. I had scallops that were good, the combination on the plate was not my favorite, but the presentation, food, overall experience here is worth a visit.",
   "One of the best dining experiences in Nashville - easy Reservation, lovely atmosphere, fabulous cocktails and delicious culinary creations. Service was attentive. As couples in our 30’s who enjoy fine dining, we did feel the vibe was slightly older and not as trendy as other Nashville spots. We would definitely return if desiring a wonderful meal in this quieter / refined atmosphere.",
   "It's rare that I'll ever give a place 5 stars. Tonight was one of those times.  \n\nI can't complain about any part of my experience.  From the stellar service we received from Jennifer, to the app, to the entree, to the dessert...everything was 100% on point.",
   "Took my wife this past weekend on a long overdue date night. Was greeted promptly by the host. We had reservations at 8pm, we arrived at 730 and was seated within just a few moments. Not expected, but appreciated. We knew that we would have to wait, that would have been fine. The server did  a fine job with the menu review and keeping us \"topped off\" and tending to any needs. The food was excellent from the starters to the dessert. No complaints at all. Very good. However, and this is on me for not checking the bill closely enough at the end of the meal. There were a couple items added on to my bill that I know we did not order...one of which was a cappuccino. (Neither my wife or I drink coffee). So there was an additional $15 dollars place on my bill that is unaccounted for.  We would go back, just will know to check the bill a little more closely.",
   "Our go to for anniversaries and birthdays. The food quality is always on point. The drinks are perfect and the setting is cozy and intimate. Love how adventurous the chef is and how diverse the menu items are. We always get something different and love it all."
  ]
 },
 {
  "name": "TENN",
  "address": "118 7th Ave N, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/81bd064c-9332-11ea-a252-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walk",
   "food",
   "food",
   "art",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11618221002982865441",
  "source": "GoogleMaps",
  "reviews": [
   "Well, well, well..we should have gone to TENN for a meal before our last day in Nashville. We stayed at the Holston House Sunday - Tuesday and had a great experience. We loved this hotel the best out of 3 we stayed in on a 5 day trip around Tennessee. My daughter said that was the best biscuits and gravy we had on our trip - and I really enjoyed my two scrambled eggs, toast and potatoes plus a side of bacon that Matteo said was from a local farm nearby. I am so mad we didn't go into the restaurant at this hotel sooner!",
   "Food was amazing,  staff was friendly and welcoming our server was Breck she was so sweet. The omelet was filled with delicious spinach and goat cheese, potatoes were delicious. My husband avocado toast he said it was the best he has had! The bacon is local and so thick and flavorful. Definitely a hidden gem.  The only reason I would not give a 5 star is the coffee is not that great it definitely does not match the quality of food.",
   "Stopped by this restaurant because it was a convenient walk around the corner from our hotel. Making this a MUST whenever we're in town! We had the restaurant to ourselves and go to talk one-on-one with our server, Ricky, and manager, Chanel. They were amazing people to get to know! I can't stress how amazing the service was. I'd come back just to say hi to them. The food to die for — gave you that comfort food style of the south mixed with an elegant flair! Can't recommend this place enough!",
   "I ate here twice while in town and loved the food. The staff was great too!\nIt’s a great little spot.",
   "A must-try while you're downtown! Service was friendly, ambiance has a cool art deco meets comfy modern feel, and the food is phenomenal. I had possiblity the best meatloaf sandwich I've ever had."
  ]
 },
 {
  "name": "Lockeland Table",
  "address": "1520 Woodland St, Nashville, TN 37206, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8207a40a-9332-11ea-a3d9-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "drink",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=13236255427409060361",
  "source": "GoogleMaps",
  "reviews": [
   "Food, service, ambiance, food, drinks, food...all just great. What a perfect place for a dinner with friends. We ordered a lot, and split everything. The spicy pig ears were a standout as well as the pork chop, and the yeasty rolls were magical. I should have opted for the chocolate chip skillet versus the chocolate olive oil cake, but next time! We came here on a Saturday evening and was seated right away in an off small room the ambience was nice the service was average and the food was delicious. Ordered the pork chop & steak with fritters and had a scoop of ice cream. Would definitely come back.",
   "Food was amazing. Had the red Thai curry mussels...they were incredible. Pizzas were also very good. And then dessert. ...oh my. We were a group of 6 so we shared the strawberry shortcake and the bananas foster bread pudding. They were both delightful!! Would highly recommend for a fantastic dinner experience!",
   "A welcoming and casual environment that is serious about food, service, and drinks. Everything we ordered was excellent, but we especially enjoyed the pappardelle pasta and the duck breast entrees. Service was attentive, professional, and friendly. Our only regret was that we didn't leave room for dessert. An excellent dinner!",
   "Lockeland is consistently excellent! Every dish or drink we order is on point and we love! This is our first choice for a random date night and it's never disappointed.",
   "We had appetizers and a fabulous dinner here for a party of five just before Christmas. We arrived about 20 minutes early and checked in. The hostess was super friendly and had our table waiting.  It was cold outside so we were removing our coats when our server offered to take them.  I thought wow now this is some service! The restaurant was already full and bustling with activity by 630. The interior is well decorated, clean and cozy.  We ordered wine and cocktails the server and service was quick and responsive.  For appetizers we ordered the bone marrow, pate, scallops and mussels. Wow! each app was like a favorite to different folks around out table. All were delicious and a couple could easily substitute for and entree! For entrees everyone but one got the ny strip the chef’s specialty. We split the steak and it was plenty for two. Our other party had the duck breast and it was fabulous too.  I believe our servers name was Kelsy. She did a fantastic job serving a five top of foodies!! \nWe’ll definitely be going back!\n\nUrban Cowgill \nDecember 2019"
  ]
 },
 {
  "name": "The Catbird Seat",
  "address": "1711 Division St, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/82501ed8-9332-11ea-b0cf-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "hospitable",
   "food",
   "music",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4955667124652886318",
  "source": "GoogleMaps",
  "reviews": [
   "This was an amazing, must-do experience. It was unlike anything I've ever experienced. It's like a series of colorful fireworks displays for your tastebuds. The kitchen staff worked like a well-oiled machine, everyone appearing to work in perfect harmony with one another. The food was exquisite and interesting. From the moment we arrived, every minute was full of surprises.",
   "Oh.my.goodness. What a ridiculously exquisite meal. I wish I could remember every item in detail, but I was too busy savoring every bite to focus on descriptive copy. The entire staff, from host to chef & everyone in between, were kind, skilled, hospitable, fun and delightful. They made our anniversary dinner so special. It was amazing to watch a 12 course meal prepared right before us and they graciously modified a few items to honor my dietary restrictions. If you love food and want a unique & magnificent dining experience, you must dine at The Catbird Seat! It was worth every penny! The music mix was eclectic, yet mixed perfectly with all of the other elements. We will definitely go back.",
   "This was an amazing, must-do experience. It was unlike anything I've ever experienced. It's like a series of colorful fireworks displays for your tastebuds. The kitchen staff worked like a well-oiled machine, everyone appearing to work in perfect harmony with one another. The food was exquisite and interesting. From the moment we arrived, every minute was full of surprises.",
   "The most exceptional meal I have ever had.  A symphony of flavors, textures, techniques, cuisines. A dining experience.  The elements of molecular gastronomy add to the theater of the evening.  \nChefs Liz and Will  won best rising chefs  James Beard Award on 2/26 . I dined there the evening before the announcement.  I wholeheartedly agree.  Kudos",
   "Great food, atmosphere, and experience. New chefs Will and Liz have put a new touch on the Catbird Seat concept and made it a unique environment. They were happy to cater to the vegetarian and dietary needs of our party. Incredible attention to detail! Can't wait to go back. (Picture is before and after dessert \"egg\" was broken)"
  ]
 },
 {
  "name": "Husk",
  "address": "37 Rutledge St, Nashville, TN 37210, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/829cb864-9332-11ea-889d-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "food",
   "creative",
   "food",
   "creative",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=163690886611976298",
  "source": "GoogleMaps",
  "reviews": [
   "Husk restaurant was amazing. The old house is a perfect spot for a restaurant, so beautiful. Atmosphere was so nice. Location was perfect from our hotel, only a 10 min walk. Food was fantastic. The Shrimp and Grits was to die for. One of the best things I’ve ever eaten. Our server, Logan, was very professional, polite and attentive. We live in Canada, so it may be a while before we return, but if I lived in Nashville, I’d visit this restaurant regularly.",
   "I have been to Husk Nashville a few times, but have also been to the Husk in Charleston. For loving Charleston's food scene so much, I can honestly say I like Husk Nashville more. The building itself makes the dining experience a little different than a normal restaurant, which I personally find very nice. The happy hour is great. You have to sit at the bar, but it's a cool space. The burger is one of the best burgers I've had. Cooked perfectly, with all the right toppings. I have also formally dined here a few times. The menu is constantly changing, with options for everyone. There's usually a vegetarian option too, which is helpful. If you're looking for a special occasion meal, or just to try something new, I definitely recommend trying Husk.",
   "Absolutely incredible! Everything from the service, to the atmosphere, to the food was downright perfect! The dishes were all elevated comfort foods with a signature twist, and my mouth is watering again just thinking about them. The bar area is cozy, and the cocktails were creative and went down easy!! Even the restrooms were spotless! 5 stars all around!",
   "Located in a gorgeous old mansion where there are essentially three rooms: what might have been a small parlor immediately to the left of the front door contained just five tables, a larger room on the other side (kitchen's in back) and a large area downstairs. Best I could tell on my trip to the WC (downstairs), all the tables are four-tops but for two narrow two-tops in the dimly lit parlor area already described.",
   "Subtle and delicious flavors. Creative chef. Parker House rolls are to die for. Very satisfying yet we weren't overly full after. The best meal I've had in a long time."
  ]
 },
 {
  "name": "Jeff Ruby's Steakhouse, Nashville",
  "address": "300 4th Ave N, Nashville, TN 37219, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/82f36434-9332-11ea-9259-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9749053997957150805",
  "source": "GoogleMaps",
  "reviews": [
   "We made reservations to eat here for New Year's Eve. It was packed! Great restaurant with such a cool ambiance. The bar area has a piano on it with a live band. The service was friendly and quick. The food was simply delicious!! Prices were fair and portions were plenty. The Godfather roll was one of my favorite appetizers. The mashed potatoes and mac & cheese were great table sides. The surf & turf was the best part! We will be back.",
   "I have been to a lot of steakhouses in my time but by far I really enjoyed the steaks at Jeff Ruby's. It was well-cooked it was good quality meat and it was very seasoned well the food is was prepared exactly the way that I liked it. We had a 36 ounces ribeye together and appetizers we had main course we had drinks and we had dessert for a couple of 2 under $150. It was my birthday thank you Jeff Ruby's.",
   "Loved everything from the first step through the door to the last crumb on my plate.  They have a fabulous truffle butter and bread to start which is to die for!  The sushi is super fresh and smaller so it's easier to take in 1 bite.  Great wine list to accompany any meal which was nice.  I got the lemon chicken which was perfectly cooked and moist.  I left super full and had amazing service.",
   "Tremendous experience. Food, atmosphere, drinks, and staff were all top-notch. The raw bar was excellent as well. If you go to Nashville and don't eat here you are messing up.",
   "This is a beautiful restaurant!!  Very upscale and the service was great.  We had the seafood tower and the petite surf and turf.  Both amazing meals, however, the best part was the dessert.  If you go to this restaurant you'll have to try the powdered donut holes with incredible dipping sauces.  Nothing short of amazing!!!"
  ]
 },
 {
  "name": "Maggiano's Little Italy",
  "address": "3106 West End Ave, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/83415d36-9332-11ea-8464-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10803388429374629302",
  "source": "GoogleMaps",
  "reviews": [
   "This was our second visit to Maggiano's Nashville. We enjoyed this visit more than the last. We had a reservation and although early the table was waiting for us. Staff are attentive and helpful, drinks and food are all served promptly. The food was very well cooked, presented and tasty. Ambiance was very good and the whole restaurant was very busy. Choices were good and well priced, we even got meals to take home included in the price of the original orders. Well done to everyone here. We had a great visit and hope we get to come back soon.",
   "This was our second visit to Maggiano's Nashville. We enjoyed this visit more than the last. We had a reservation and although early the table was waiting for us. Staff are attentive and helpful, drinks and food are all served promptly. The food was very well cooked, presented and tasty. Ambiance was very good and the whole restaurant was very busy. Choices were good and well priced, we even got meals to take home included in the price of the original orders.",
   "This was our second visit to Maggiano's Nashville. We enjoyed this visit more than the last. We had a reservation and although early the table was waiting for us. Staff are attentive and helpful, drinks and food are all served promptly. The food was very well cooked, presented and tasty. Ambiance was very good and the whole restaurant was very busy. Choices were good and well priced, we even got meals to take home included in the price of the original orders. Well done to everyone here. We had a great visit and hope we get to come back soon.",
   "Good Italian restaurant. I have been here a few times and the food has been good. (The reason I keep gong back). I would recommend signing up for their email and you get periodically an email offering $10 off $30 or $20 off $50 so grab a friend and go. They have good lunch specials-complete meal for $10.50 and of course the buy one and take one classical pastas. What I like about that is the pastas that you take are not heated so they are not dried from overheating when you get home. For me, I can easily split a pasta dish and be filled.",
   "Wonderful experience in Nashville. Excellent option if you are staying in one of the nearby hotels. Our server was named Samantha and she had the sweetest demeanor. She was respectful and observant to our cues. On some of the pasta dishes, they send you home with another dish, compliments of the chef. Overall very happy with the experience."
  ]
 },
 {
  "name": "Rodizio Grill The Brazilian Steakhouse - Nashville (Dine-In Open May 13)",
  "address": "166 2nd Ave N, Nashville, TN 37201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8388c6ee-9332-11ea-a4a0-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "drink",
   "food",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=11974468864369029861",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great place for people who love to eat. Chicken, lamb, and many different cuts of steak are just some of the different meats that they offer. They also have many sides, gourmet salads and a desert bar! Come hungry because it is an \"all you can eat\" experience. Fabulous food and excellent service from Lamon!!! He was super attentive to all of our needs! You won't be disappointed!",
   "I have eaten at numerous Brazilian grills but I have to say that this one was disappointing. It started when we walked in and we could see many open tables but it seemed like a challenge for the hostess to find us one. It went downhill from there. We were finally seated and waited, and waited, and waited. Finally we were greeted by a staff member that asked us if our waitress had been over to take our order. She was very apologetic and got us drinks and explained the process of the red and green notifier. We went to the salad bar. It had a pretty good selection and everything there was great. Back to the table and we were asked again by the same young lady if our waitress had come to introduce herself. Again we said no. She apologized again and refilled our drinks for us. Unfortunately that was the last time we saw any waitress. The meat selections were pretty good, but considering the cost we were disappointed with the quality compared to other Brazilian steakhouses we have eaten at. I had to go to the waitress station to get my check and pay it as we were tired of waiting. Overall a disappointing experience. Fortunately this was the first disappointing experience we have had dining in Nashville this week.",
   "An out of town experience for me, I'm from Portland, Oregon. We have a place just like this in Portland, and the food here is better. All the meat was cooked perfectly and seasoned with perfection. A great all-you-can-eat menu for sure. \n\nI only took off 1 star because the service, while fast and accurate, was pushy. We had less than 30 seconds with the drink menu before she asked us what we wanted. When we said we needed more time, she was back in about 1 minute. With 5 people sharing one drink menu that doesn't work. \n\nAlso, the server was poking fun at us for not eating as much as she thought we should have. I'm sure it was meant to be friendly, but it didn't really come across that way.",
   "Great place for a special occasion or a group of friends! I dined for brunch and it was amazing. Endless meat choices carved at your table! A great selection at the salad bar as well!!! Also breakfast favorites at the breakfast bar! All for around 27$. Great location! Perfect place to leave full and walk it off downtown...",
   "Definitely one of the better restaurants downtown. I love that they have valet parking. The place gets a little busy due to it being in an area where a lot of tourist frequent but if you make a reservation, you shouldn't have a problem getting a table. I love the whole concept of the service. It's like a fancy buffet with servers bringing different types of meat and seafood until you say, I quit with your little green and red block. Definitely a favorite of mines in Nashville."
  ]
 },
 {
  "name": "The Stillery",
  "address": "113 2nd Ave N, Nashville, TN 37201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/83da4270-9332-11ea-a1df-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "music",
   "food",
   "music",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12561200058311051231",
  "source": "GoogleMaps",
  "reviews": [
   "We traveled to Nashville to celebrate a birthday, so I was looking for a place that could accommodate a party of 14, wasn't super pricey, and of course, had amazing food. For such a large party the service was prompt and accommodating. The mason jar cocktails were delicious, my favorite being the Stillery Sour, and the Blackberry Lime was popular around the table as well. Three of us ordered the Hot Chicken Mac n Cheese, and honestly we could've all split it...delicious but very filling, and lived up to the hype. I can't handle spicy food so I ordered the mildest option, but it was still too hot for me. The wings were very spicy as well, but the catfish was tasty. Since we were upstairs, live music began during our dinner...very interesting type of music on a Thursday night. Overall, it was a great choice, everyone enjoyed the food & drinks, and the service was excellent. Recommend!",
   "Love the drinks options and the hot chicken pizza. The Mac & cheese is a must have but share with the group since you get plenty! There are two floors and both have live music. It's a great way to enjoy the Music City Vibe and try some different food. Great place for locals and tourists.",
   "Great food, good drinks, friendly staff. All the components for a memorable experience. Our server recommended the food and we couldn't have been happier. Catfish was the bomb and my burger was 2and best that I've ever had in my life.",
   "Enjoyed a variety of foods - fried pickles, deviled eggs and ragoons for appetizers. All were very tasty. The last (2) had a mild bite to them, but not \"Nashville\" hot. Food was great, the moonshine drinks were very tasty, and the service was awesome. We stayed and chatted with our friends for a long time, and even though they were cleaning up - allowed us to continue enjoying our conversations. Great experience, and would definitely go back again.",
   "Good hangout and busy! I had the pizza and it was way too doughy for my liking. Then I ordered the Mac and cheese and it was way too salty. Service was good and drinks were on point. The deviled eggs were very tasty. If I came back I’d get a burger most likely."
  ]
 },
 {
  "name": "Midtown Cafe",
  "address": "102 19th Ave S, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/84215d9e-9332-11ea-bdd5-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13203967795068645626",
  "source": "GoogleMaps",
  "reviews": [
   "A real jewel and a rear find! Delicious food, fantastic menu prepared to fine dinning standards.  All the staff we encounter were experienced, cordial and more than accommodating. The Lemon Artichoke Soup is legendary in it's own right!\nBe aware that sitting is limited and reservations are recommended. Valet parking is still complementary and a great bonus.",
   "I have been coming here for years. I don't go here a lot, but we always seem to find ourselves coming back when we are in town. The food is always wonderful and they offer a shuttle to events downtown. I ordered the Scallops with Lobster Mac and Cheese, which was amazing. My mom had the Shrimp and Grits, which she liked. We shared a bread pudding, which was good, not great, in my opinion. I am a pastry chef and am a little picky. We didn't have a reservation, but we were able to sit at the bar. One thing that most people might like, was that our food came out about 5 minutes after we ordered. We were hoping to enjoy a nice meal there and wish that it hadn't been so rushed. We hung out a while, then ordered dessert, I still gave them 5 stars because we had great food and the bartender is super friendly and attentive. I would certainly go back, since the food is consistently great.",
   "I have been coming here for years. I don't go here a lot, but we always seem to find ourselves coming back when we are in town. The food is always wonderful and they offer a shuttle to events downtown. I ordered the Scallops with Lobster Mac and Cheese, which was amazing. My mom had the Shrimp and Grits, which she liked. We shared a bread pudding, which was good, not great, in my opinion. I am a pastry chef and am a little picky. We didn't have a reservation, but we were able to sit at the bar. One thing that most people might like, was that our food came out about 5 minutes after we ordered. We were hoping to enjoy a nice meal there and wish that it hadn't been so rushed. We hung out a while, then ordered dessert, I still gave them 5 stars because we had great food and the bartender is super friendly and attentive. I would certainly go back, since the food is consistently great.",
   "If you are Nashville and tired of the bar food, looking for a decent meal...this is your spot. Service was perfect...from host to waiter Carlos and nice bartender from New Jersey. Drinks were delicious. Food was outstanding. I had specials (salad and halibut)...delicious!!! We were a party of 10. We appreciated that were very accomodating. And the prices weren't bad. Around $50 a head for cocktails and great food",
   "Well-priced, traditional American cooking in a homey setting. \n\nI stopped by around lunchtime on a weekday, and the place was bustling but not packed. Friendly, efficient staff. Good quality food at yesteryear's prices. The chicken tenders (pictured) were some of the largest and best-tasting I've had, and that's one of my standard pub-grub dishes. Definitely recommended for breakfast/lunch, I'll be back next time I'm in Nashville."
  ]
 },
 {
  "name": "Rolf and Daughters",
  "address": "700 Taylor St, Nashville, TN 37208, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8464814c-9332-11ea-9b5e-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "family",
   "food",
   "knowledgeable",
   "food",
   "creative",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11966876047554416366",
  "source": "GoogleMaps",
  "reviews": [
   "Our family was looking for a nice dining establishment for our last night in Nashville. The meals are very good but are basically a-la-cart. They will suggest ordering a green, protein, and dessert. Depending on how many adults are at the table it can add up with multiple greens and proteins in a hurry even sharing the dishes. However, our server was very nice and knowledgeable of the ingredients in the dishes we ordered. It is more like a neighborhood type restaurant and is moderately small. We enjoyed our evening and the food was very good.",
   "Great, local ingredients drive the menu at this hip standby in Nashville. All of the flavors of the South are present and wonderful without the expected heaviness of the region. The outdoor patio has a nice atmosphere, and the nearby greenery adds to the freshness and feeling of being connected to the local flavors. Service is relaxed yet serious, with a great knowledge of what's happening in the kitchen but in no way forced on the diner.",
   "The meals are very good but are basically a-la-cart. They will suggest ordering a green, protein, and dessert. Depending on how many adults are at the table it can add up with multiple greens and proteins in a hurry even sharing the dishes. However, our server was very nice and knowledgeable of the ingredients in the dishes we ordered. It is more like a neighborhood type restaurant and is moderately small. We enjoyed our evening and the food was very good.",
   "We enjoyed our dining experience! Took an Uber, and were promptly seated - atmosphere was very hip, as an open air space it can get loud. We all enjoyed our selections - it is a little pricey for what you get. Cocktails were amazing and creative. Wonderful to see so many unique, homemade pasta options on the menu and the culinary wisdom to pair with selected proteins, herbs and flavors. Definitely glad we went off the path to dine here!",
   "A very nice atmosphere and some yummy food. I really liked this place and would recommend it for a date night. The pasta entrees were nice but I enjoyed the beet dish most of all.\nMy partner and I did make reservations, but were asked to sit at the bar when we got there. The price point and portion sizes were a bit off."
  ]
 },
 {
  "name": "Margot Cafe & Bar",
  "address": "1017 Woodland St, Nashville, TN 37206, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/84b1de48-9332-11ea-a610-14b31f159f22.png",
  "tags": [
   "food",
   "affordable",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7039934944988334645",
  "source": "GoogleMaps",
  "reviews": [
   "The food and service is always pretty good here, yet if you really want to go somewhere they'll make your celebration special you might want to go elsewhere. We were happy to get a last minute res for our 20th anniversary on a Sat night, and the girl on the phone when I called knew that's why we were coming. So to only have this mentioned when we asked the server to take a pic, is somewhat surprising.",
   "Place was great, we were the last seating of the evening and had a little bit of a issue getting seated at our reservation time. Kaelyn our server was knowledgable about the menu and had great recommendations. Quality was great and price was affordable. Overall great experience and would recommend it to anyone.",
   "Concierge Matthew recommended this quaint little restaurant. It was delightful and delicious. Server Kristin took excellent care with good wine and entree recommendations. We had olives to share, local lettuce, pear and feta cheese salad, salmon with butternut squash and jalapeño jam pork belly with carrots, hazelnuts and greens. Everything was exquisite! We would want to return our next time in Nashville.",
   "This place is an amazing little gem.  French food is hard to find prepared right.  This place does it.  It's a true atmosphere for a classical restaurant in France.  Nice to have a place like this one in East Nashville.  And bonus the menu changes daily.  Brilliant",
   "Great atmosphere, amazing service. Great food"
  ]
 },
 {
  "name": "Monell's",
  "address": "1235 6th Ave N, Nashville, TN 37208, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/84fbdfb0-9332-11ea-9eec-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "family",
   "family",
   "tasting",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5824665683740858933",
  "source": "GoogleMaps",
  "reviews": [
   "Fabulous breakfast with the best homemade cinnamon rolls and biscuits I have ever eaten. Both are baked to perfection, I could have just eaten those and called it a meal. The rest of the breakfast was just as wonderful with grits, eggs, meats, fried chicken and corn pudding. I don’t think I have ever eaten a more delicious breakfast. Highly recommend!",
   "Fabulous breakfast with the best homemade cinnamon rolls and biscuits I have ever eaten. Both are baked to perfection, I could have just eaten those and called it a meal. The rest of the breakfast was just as wonderful with grits, eggs, meats, fried chicken and corn pudding. I don’t think I have ever eaten a more delicious breakfast. Highly recommend!",
   "I love fried chicken. I saw that Monell's served it Family Style as one of their tasty sides for all their daily seatings of breakfast, lunch & dinner. We were passing through Nashville on vacation on March 14, 2020 and thought why not. We found this \"hidden gem\" to be located in an old converted residence in part of N. Nashville that appears to be under some rehabilitation and definitely affected by their recent bout with devastating tornadoes.",
   "It was great. Met some friendly people. It truly lives up to its motto \"come as strangers leave as family\" about 10 people around a table passing food around like Thanksgiving day, getting to meet each other, laugh, and enjoy great tasting food. From ribs to friend chicken cornbread bread pudding potato salad greens etc... the staff was very friendly and helpful. This place a quite the experience and worth the price.",
   "Fun, family style place! Be careful, I ate so much I still don't feel good! Great pricing for what you get, you'll have some fun meeting new people and friendly staff. We're from Minneapolis, met a local and a couple from Chicago and China. All of the food was amazing. Great southern food. My favorite was the catfish. Fresh and not fishy, cornmeal breading was dry and crispy. Great sides and leave room for dessert!"
  ]
 },
 {
  "name": "Henrietta Red",
  "address": "1200 4th Ave N, Nashville, TN 37208, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/85414d52-9332-11ea-94b6-14b31f159f22.png",
  "tags": [
   "art",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18137338139233472862",
  "source": "GoogleMaps",
  "reviews": [
   "One of my favorite restaurants in Nashville! Unfortunately didn't have a chance to try their raw bar menu but the cooked dishes were phenomenal. We had the wood roasted oysters with green curry, the seared sea scallops and the the red snapper. Really liked the kick that the green curry added to the oysters. As for the scallops, they were seared to perfection and the butternut squash ribbons paired delectably well. The red snapper was meaty and tender. The orange butter was super flavorful. Portion size is on the smaller end but I guess it would just allow you to taste test more of their fantastic menu!",
   "We sat at the bar. Matt was great. Cocktails were perfect. Every dish was like a piece of art. Just took in the view before being blown away by the flavor.",
   "The waitress will tell you that you need at least two dishes per person to 'share' and that does make for a fun night, but you need to be really hungry if you order both a first course and an entree to share with a dinner companion. I would start small and add more as needed...their service is super quick. We would have had just oysters and our first course options if we had thought ahead. It can be pricey...but it is just plain good.",
   "Attentive service, good food. Very loud place. Stand out was sunflower seed risotto, even better than the nice red snapper. Octopus salad is delightful. Homemade potato chips were made right, crisp not soggy with very light whipped dip.",
   "Loved the brunch! The eggs and beans dish was incredible and everybody else at my table really enjoyed what they had as well. Not my favorite bloody mary, but it wasn't bad. The mimosas looked great, though. Monkey bread was also amazing for sharing with a group of 5."
  ]
 },
 {
  "name": "Butcher & Bee",
  "address": "902 Main St, Nashville, TN 37206, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8588ddee-9332-11ea-9d37-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "drink",
   "knowledgeable",
   "food",
   "creative",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=18196430105044398388",
  "source": "GoogleMaps",
  "reviews": [
   "Went for Valentine's day dinner with my girlfriend. Really nice vibe and decor. Friendly service and one of the server explained a dish for us as well. The main dishes were good and appetizer was surprisingly delicious! The portion was what you expected at a more chic restaurant: nice but leave you wanting a bit more. The dessert was underwhelming for the occasion. Felt like it could be done for a while and served without much plating. Decent drinks with generous pour. Overall good experience but could be better. Would recommend~",
   "Me and my wife enjoy this place due to the changing menu and that it feels like an experience. We've never had a dish that made us go, \"eh it's okay.\" It's always been amazing and we look forward to the next trip every time we leave. This isn't a place you go to massive portions but rather reasonable ones full of flavor. We love it here.",
   "To start this a Mediterranean-style restaurant - \"The Mediterranean diet is rich in lean proteins, like chicken, fish and legumes; fresh fruits and vegetables; whole, unprocessed grains; seeds and nuts; healthy fats like olive oil; and a limited intake of dairy and red meats.\" The environment boasts a slick interior that screams \"Hip and Cool\", which comes with a premium in price. And the food is bomb. I had the Hummus and Avocado Crispy Rice (added the shawarma chicken thigh to the rice dish).",
   "This was overall a really good experience. Bar was set really high and it delivered on most expectations.\n\nThe restaurant itself was beautiful.  Really nice overall package here. Highly recommend sitting at the open kitchen.\n\nService was good. Our server was really knowledgeable on the menu and pretty attentive.\n\nDrink menu was also really good. So much to choose from.\n\nFood itself was excellent. Presentation was good. We liked about 2/3 of what we ordered, which is really good. Whipped feta is a must.",
   "Wow, what a creative menu and space. Menu changes and has a Mediterranean fair, we had roasted cauliflower, Israeli fried chicken, and roasted carrots. Everything was delicious with lots of of different seasoning. The fried chicken was the star, super crisp and moist and not your Nashville hot chicken! Drinks are also very creative with lots of different flavors. We'll be back!"
  ]
 },
 {
  "name": "Skull's Rainbow Room",
  "address": "222 Printers Alley, Nashville, TN 37201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/85d17ff4-9332-11ea-9399-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "drink",
   "food",
   "music",
   "drink",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=16599841109210531003",
  "source": "GoogleMaps",
  "reviews": [
   "Simply amazing food and service...not to mention music!  I ordered the duck and it was perfect.  Crispy skin and oh so tender and flavorful.  The lobster bisque was silky and had tons of flavor.  \n\nI sat at the bar and the service was attentive but not overbearing, friendly and helpful, and felt like I was at a neighborhood bar. \n\nGreat band playing ad well and it generated a vibe throughout the entire place.",
   "We had such a wonderful experience! The management team should be proud! Tori, got us in on a cancellation reservation and we had what I think was the best seat in the house for the show. The food was amazing, our server was incredible. The entire staff helped each other out. I received food and drink recommendations and was checked on many times. The show and music was amazing. Keep it up, you guys are amazing. BEST IN NASHVILLE",
   "We stopped in here for a drink as we planned to sample the bars along Printer’s Alley. We were not disappointed. We walked in and it was dark and sultry, and a pianist was playing some awesome jazz. We were able to stand near the bar, get a drink, and absolutely enjoy everything around us. The sights, the sounds, the smells - the food looked amazing!! I can’t wait to go back!",
   "I completely cherished everything about this spot! The nourishment decisions are restricted, however it's well justified, despite all the trouble. I was unable to pick between the pork hacks and the fish extraordinary of the day (sword fish with shrimp) and I requested that our server shock me. I'm happy she picked swordfish for me since it was totally flavorful. I would prescribe reserving a spot. We had 8PM reservations on a Sunday and was situated promptly, and wound up remaining until near to 12 PM. The mood is in no way like what you would consider when you consider going to Nashville yet it is a GREAT change from Broadway. I'd go to Nashville again and avoid the entire Broadway strip to come directly to the back street and eat at Skull's Rainbow Room. Our server's name was Sarah and she offered remarkable assistance!",
   "We wandered into Skull's one night after midnight. Most of the dinner guests had departed but the action around the bar was still shakin'. Within minutes of getting our drinks we felt that we had known the bartender and bar back for years. Both Levi and Pearce had just the right amount of confidence, hospitality, smoothness and sage wisdom. Not every bartender wants to serve every guest. I could easily read between the lines that Levi was a professional and even if you were an a**hole he would treat you right."
  ]
 },
 {
  "name": "M",
  "address": "209 10th Ave S #223, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/861a6fe2-9332-11ea-9b80-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8778699558001504304",
  "source": "GoogleMaps",
  "reviews": [
   "I had the pork shank and wife had raviolli (with chicken due to allergy)... both were great. Staff was attentive but a little slow. We were there right when they opened so they were still getting it going for the night but it was good. Alex was our server and he was great. Bread pudding was to die for...go just for that and it is a great night.  Meals were exceptional, outstanding wine selection, very comfortable atmosphere. Highly recommend for a relaxing dinner!",
   "As a Nashville Native this place has seemed to be around for forever, so we decided to give it a shot since we’d never heard anything from anyone we knew about the place. And it was a very good decision. It seems much more like the Nashville originals of yesterday (and that is a huge compliment). Our service was very good and attentive along with delicious food. The ambiance is a bit open but still comfortable. We had the bone marrow app, I had the paella and my friend chose the vegetarian dish. They were all delicious! We will be back. A great place for couples/groups as well.",
   "Where do I begin? I will start with the food since that is the first thing people look at. Everything was exceptional! We had the following - Hot Chicken and Waffles, Fried Green Tomatoes, Shrimp and Grits, Crab Cakes, Seven Fish of the Sea, Tortellini sub Chicken as the meat, a special request Reuben, and chocolate creme brûlée. \n\nThe shrimp and grits were by far our favorite. I am a bit picky after having what I considered the best in Charleston until I found this place. I highly recommend everything on the menu, but especially the shrimp and grits. The hot chicken and waffles were such a great starter. It had a perfect heat and sweetness. The fried green tomatoes also had a light heat and blend of flavors and perfect crunch. \n\nI can’t say enough great things about the food. You can’t go wrong here, and don’t be afraid to ask your server for something special. The Reuben is only on the menu for lunch, and our friend wanted chicken on the tortellini, which was also fantastic, and our waiter was extremely accommodating and had great suggestions. The chef and manager also came over to make sure everything was perfect. \n\nThis was an all around amazing experience. We will be back!",
   "As a Nashville Native this place has seemed to be around for forever, so we decided to give it a shot since we’d never heard anything from anyone we knew about the place. And it was a very good decision. It seems much more like the Nashville originals of yesterday (and that is a huge compliment). Our service was very good and attentive along with delicious food. The ambiance is a bit open but still comfortable. We had the bone marrow app, I had the paella and my friend chose the vegetarian dish. They were all delicious! We will be back. A great place for couples/groups as well.",
   "Meet Nashville's Newest Rock Star in the Culinary world. Head Chef Frank Tidwell  at M. Restaurant and Bar in downtown Nashville gives you an ALL IN experience. Great service, great vibe, and the food is beyond words.  You can taste every ounce of passion that is used to create these delicious and unforgettable dishes.  So come in relax and let Chef Frank and his All-Star staff take your taste buds on a Roller Coaster ride of pleasure they won't soon forget."
  ]
 },
 {
  "name": "Sperry's Belle Meade",
  "address": "5109 Harding Pike, Nashville, TN 37205, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/865f8fac-9332-11ea-a1ed-14b31f159f22.png",
  "tags": [
   "food",
   "cheap",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=17950265732363292155",
  "source": "GoogleMaps",
  "reviews": [
   "Great service paired with fantastic food. Reservation are definitely recommended. We were seated immediately and the staff was very attentive. Steak was cooked perfect for my taste (medium rare). My wife ordered the halibut and it was tasty as well. This is a place that I would recommend for special occasions as dinner bill can get expensive, but every bite is worth the price.",
   "The food here is excellent.  They are by no means on the cheap side but you get what you pay for here. The salad bar is long fresh with multiple selections.  It can get loud as the place is small.  The servers here are top notch and we have never had an issue with service.",
   "It's a must to try the their steak when you are in Nashville and the food is great. One serving is enough for two person and you can split it.",
   "I would like to thank Mark, the manager at Sperry's Belle Meade. There was a mistake on our take-out order and the person who was taking the order was not apologetic and had no idea what he was doing. Mark, however, handled the situation very well. He knew what he was doing and he was so apologetic and kind for the mistake that happened. Honestly if it wasn't for Mark I would not be going back to Sperry's at all. Thank you Mark for doing your job exceptionally well!",
   "One of my favorite restaurants! I love the ambiance, the service is impeccable and the steaks are melt-in-your-mouth delicious. Reservations are a must. Parking is tight, but  valet parking is available. Dress is casual, but definitely not messy. I wore jeans and a nice sweater. Even if you don't normally order dessert, have their signature peppermint ice cream with chocolate sauce! It's the perfect ending to a delicious meal."
  ]
 },
 {
  "name": "The Wild Cow",
  "address": "1100 Fatherland St SUITE 104 11/22, Nashville, TN 37206, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/86b074b6-9332-11ea-a44a-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "delicious",
   "food",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15931984662883328265",
  "source": "GoogleMaps",
  "reviews": [
   "I myself am not fully vegan, but my girlfriend is, so I brought her here as a treat and BOY HOWDY was it! Heck, I think I liked my French dip sandwich way more than any non-vegan ones I’ve ever had! The service was great and kind, and the space is laid back. We even had a bit of a spill and one of the servers, Ash, was super sweet and gracious to us. Definitely hope I find myself there again some day!",
   "Today I went on a lunch date with my friend and a friend and boy did we have the surprise of our lives! We shared the Nacho appetizer and it was to die for! We each had a different entree and my friend did not want to talk the food was so good! What we experienced today was healthy food with out of this world flavor x 10! The only regret that we has was not coming sooner! Thank you Wild Cow, you are my new go to vegan establishment!",
   "Wild Cow is my favorite restaurant. I live in Portland, OR but luckily I have family in Nashville. When I visit we always make a point to go. I’ve never been disappointed in anything I’ve ordered here. Last time, my mom and I both ordered the beans and greens bowl with tofu. Now we’re each trying to recreate it at home.\n\nWild Cow, please come out with a cookbook! Or maybe post a few recipes on your website? \n\nThe new location is more spacious and comfortable. We love it!",
   "As a vegetarian trying to become vegan, I need more places like this closer to where I live. The food is absolutely delicious. And not even compared to regular meat and cheese. Just delicious period. Paired with a friendly atmosphere and kind staff, this place is a must for vegetarians and non-vegetarians alike!",
   "Ate here twice during a recent stay in Nashville.  The server (I cannot remember her name unfortunately) was fantastic during our first visit!  She answered all of our questions about the menu and made recommendations.  She was clearly very knowledgeable about the menu and veganism in general and was extremely friendly and helpful.  She definitely made eating here a pleasant experience.  The food was fantastic!  Generous portion sizes and great flavors.  There were lots of options to choose from and many gluten-free choices too, which is fantastic.  The restaurant itself also had a lively atmosphere and was clean, bright and modern.  I can highly recommend this restaurant for the health-conscious vegan or otherwise as there is something for everyone.  Wish there were more restaurants like this in the States!"
  ]
 },
 {
  "name": "Darfons Restaurant & Lounge",
  "address": "2810 Elm Hill Pike, Nashville, TN 37214, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/86f8a15a-9332-11ea-b3b0-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4111325315517867543",
  "source": "GoogleMaps",
  "reviews": [
   "This is one constant for excellent food and service. Get there early as lots of other foodies know this place. Had a wonderful old fashioned to begin. Luke was server and right on time with suggestions and service. The wine by the glass selection here is tops! Decided on the grouper special, it was excellent. nice Chardonnay by the glass and another wonderful experience was in the books.",
   "We were on our first trip to Nashville And when we were driving to our hotel we got the munchies and decided on this place because of good overall Google reviews.  The service was good..  Everyone we interacted with helpful.  The food was plentiful so you may want to split a dish if you are not too hungry.  In our case, we took the left overs back to our room and ate the rest as another meal.  As you can see from the picture the food was delicious.  I would recommend the fried chili garlic grits if you like grits or even if you don't.  Recommend this place for a nice delicious meal and good service.",
   "You enter into a relaxed environment where the mood is set to lead to a great evening.  \nFine dining feel and the food to match the vibe, the drinks were also delicious.  The menu changes often, so prepare for a new and great experience every time.\nWe had appetizers, steaks, a touch of everything and not one person at our table left unhappy or displeased.\nDelicious experience start to finish.",
   "This place has been here forever and it is clear to me why. Our friends invited us out and it being their fave we decided to give it a try. WOW!  Greeted at the door by friendly staff and seated quickly. Atmosphere was relaxing, warm, and comfortable. Waiter, Josh, came by quickly and took care of us with skill and care. The food was amazing.  Will put it on our GoTo places to eat.",
   "Steak prepared perfectly, loaded potatoes a must, with grilled asparagus.   A real taste treat for all the senses.   Service was top notch, too.  Hector went the extra mile to help the bartender prepare a Smith and Kern's after dinner liquor.  The perfect way to end a perfect meal."
  ]
 },
 {
  "name": "Bakersfield Nashville Temporarily Closed",
  "address": "201 3rd Ave S, Nashville, TN 37201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8746e8b8-9332-11ea-b6ba-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "active"
  ],
  "link": "https://maps.google.com/?cid=5554820453192343508",
  "source": "GoogleMaps",
  "reviews": [
   "Bold flavours!\n\nThe tacos at Bakersfield were some of the best I’ve ever had outside of Mexico! The flavours were bold & bright, and the tortillas were authentic. The margaritas were great as well, nice & strong! I really appreciated the service platter that the tacos came out on, it made the meal feel more communal. The only downside was the lack lustre service, but it was busy so that was likely a factor.",
   "Really good mexican food in Nashville. We can here for early lunch and our bartender, Marshall, was just awesome. He really made the meal fun for us and provided great recommendations. It's always better sitting at the bar when the bartender is able to bring an element to the experience. Definitely recommend!",
   "Hot spot for elevated tacos. Enjoyed the hongos taco as a vegetarian option. Roasted cauliflower was delicious. Fairly priced. Excellent service and food was delivered very quickly after placing order. It's typically busy and a bit noisy so maybe not the best for quiet conversations but great for pretty much any other occasion.",
   "Do you see these tacos? They are just as delicious as they are photogenic. The drinks were stellar. I had the spicy pineapple margarita - whew...first couple sips open your sinuses but after that it's smooth sailing. I love the atmosphere of this spot. Community tables. Very chill. Love the decor and the service was great! Will definitely come back.",
   "Great bar staff! Thank's for the stellar drinks, and awesome recommendations on where to execute our super fun rooftop bar crawl. And we returned later for the great taco menu.  Bakersfield is modern,  relevant and active Nashville! Must go!"
  ]
 },
 {
  "name": "The Chef And I on Ninth",
  "address": "611 9th Ave S, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8793d6e4-9332-11ea-b24c-14b31f159f22.png",
  "tags": [
   "unique",
   "tasting",
   "food",
   "organized",
   "delicious",
   "tasting",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14001715934347532670",
  "source": "GoogleMaps",
  "reviews": [
   "A fantastic experience for any food fanatic. The food was all A++. I highly recommend the 5 or 7 course tasting and sitting at the chef bar on your first visit. The experience is like having a personal chef prepare your meal in front of you. The atmosphere is unique. It is a blend of bar and fine dining. The service is also top notch. Everyone there is super friendly and attentive. All of the dishes were well explained and brought at well timed intervals. If you like trying new things, experiencing fine dining, or want a unique experience then this is the place to go.",
   "Although I have been to The Chef and I, my friend has not . This place is always packed so I planned ahead and secured a spot for two at the counter. This is entertainment and dining all rolled into one. He enjoyed watching the organized chaos of the chefs and their kitchen dance - you can be interactive and ask questions about techniques and ingredients as the meals are cooked . I had sable fish over pearled couscous- a first time for this fish and it was fabulous . Although there is technically kit a “bar” the servers are very attentive and make sure your glass is never empty. This is a lively place and has good energy .",
   "Make sure to make a reservation. We came here on a Friday night and sat at the chef's table. We had the taquitos and crab and lobster bisque for app, both were delicious and portions we're generous. I wish I had stopped at that since I was full at the end of our app course. Then for the main dish we ordered the short ribs and the duck. They were both phenomenal dishes. The short ribs was super tender and delicious with lots of meat (10+ oz) and potatoes. The duck was made just perfect with pink hues all inside and crispy skin on the outside. The duck came with a large portion of potatoes+cheese combo, so you'll for sure be full just eating this dish alone. Eating at the chef's table is a must since it's entertaining and a fun date idea.",
   "Some of the best food you can eat. Seriously. Strongly suggest you sit at the chefs counter in this open kitchen concept as you'll enjoy the amazing skills the chefs show as they make your food. \n\nThe cocktails are awesome and made to perfection. The 5-7 course tasting menu is a must and will give you a good idea of the range they have to offer. If you're in Nashville be sure to make reservations!",
   "I liked this place a lot. It is very small and I understood that they are doing a course menu if you would like to sit facing kitchen and you have to reserve your spots. Their menu is very easy to understand. One of the most memorable appetizers and awesome presentation was Cauliflower with goat cheese! Elk tenderloin was very good too."
  ]
 },
 {
  "name": "Marché Artisan Foods",
  "address": "1000 Main St, Nashville, TN 37206, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/87e0dc30-9332-11ea-b9dd-14b31f159f22.png",
  "tags": [
   "unique",
   "family",
   "food",
   "family",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1783963493126300719",
  "source": "GoogleMaps",
  "reviews": [
   "This is a real gem in East Nashville. I love visiting this place for brunch. It’s local, unique, and packed full of flavor. They are always changing up the specials which I enjoy that keeps me wanting to go back. Get there early or expect to wait, but waiting is totally worth it.",
   "This place is amazing, a gem away from tourists with amazing service, ambiance and food; best find in Nashville. Jessica our server was amazing, a beautiful lady, super patient (as i had foreign family with me which required translation). Quality of foods and beverages was phenomenal. Feels like you are in a little french bistro.",
   "This place is amazing, a gem away from tourists with amazing service, ambiance and food; best find in Nashville. Jessica our server was amazing, a beautiful lady, super patient (as i had foreign family with me which required translation). Quality of foods and beverages was phenomenal. Feels like you are in a little french bistro.",
   "Marché is always amazing. This time I had the sweet potato which was incredible with two eggs on top. The crispy bacon side is excellent and I love greens in the AM. \n\nThe Americano was perfection. \n\nIt does get noisy inside, so if you’re looking for a quiet place, this isn’t it. \n\nI’ve also had oatmeal here and breakfast type sandwiches. \n\nNo one is ever disappointed. \n\nThanks !!",
   "This place is amazing, a gem away from tourists with amazing service, ambiance and food; best find in Nashville. Jessica our server was amazing, a beautiful lady, super patient (as i had foreign family with me which required translation). Quality of foods and beverages was phenomenal. Feels like you are in a little french bistro."
  ]
 },
 {
  "name": "Puckett's Grocery & Restaurant - Downtown Nashville",
  "address": "500 Church St, Nashville, TN 37219, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/884395fa-9332-11ea-9cde-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "walking",
   "eat",
   "music",
   "food",
   "music",
   "library",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=6052646246245675915",
  "source": "GoogleMaps",
  "reviews": [
   "Ordered a Piggy Mac and some other stuff including sides of mashed potatoes. The pork that was in the piggy Mac was dry and tasted like it was days old and the mashed potatoes were terrible. It tasted like they were making the mashed potatoes with water instead of milk. Been working in restaurants for years and I could tell there was no milk in them. That’s absolutely disgusting. During these tough times you should be raising standards and giving your best possible product. Not lowering standards and cutting corners to make an extra buck. Very disappointed. Better places to spend my money right now.",
   "Philly brisket sandwich was awesome! Good thing I don't live here or that would be my go to! Ordered that and a greens salad with chicken salad added. Chicken salad was also awesome. Size of greens salad was questionable.  Very small for 10 bucks. I saw someone eating a salad at the bar and it was a huge bowl of greens. The portion I got was not.\nI ordered food at the bar,  while I waited I had a beer. The people on either side of me had there food before I got mine and they sat down 15 or 20 minutes after me. The bar tender apologized for the delay, but never offered any compensation.  It would have been a courtesy to comp my beer or something small to make up for my 45 minute wait for my food.",
   "Puckett’s is amazing. It’s the feel of Nashville that’s family friendly and always hits the spot. They have a dog friendly patio on a nice street downtown. The food is great and they have Yazoo beer (a Nashville local and favourite beer). They are always busy, because they’re great so be sure to call in advance to put in a reservation. They also have late night live music which we haven’t yet seen but notice when walking by at night. This is always our very first spot to eat when visiting town.",
   "Thought the idea of a grocery store turned restaurant would be cool to see, so I went.  It was alright, but nothing special.  Was loud and when music started, even louder, which would be expected, so that didn't really bother me.  The music was not good the night I was there.  I am sure that's hit or miss.  Food was so so.  Overall, the experience was average.   I don't see me going back.",
   "Southern comfort food without all the pretentiousness and high tourist prices. Reece was our server. He was courteous; food come out in record time, which was great because we were hungry.  Highly recommend it, particularly if you are staying anywhere close to the library as is within walking distance."
  ]
 },
 {
  "name": "Peg Leg Porker BBQ",
  "address": "903 Gleaves St, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/88905698-9332-11ea-b760-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15494490959652767891",
  "source": "GoogleMaps",
  "reviews": [
   "Missed reviewing Peg Leg Porker BBQ. All of the barbecue places we visited while in TN, were based on what the internet gave as the best reviews according to customers, magazine articles, etc. \n\nPeg Leg Porker BBQ is a very casual place with informal seating and self service, in that you go in, order your food, pay, get a number, and pick it up at the counter when your number is called. You sit where you like while you wait, though the wait is brief. The bar is at the opposite side of the room, and you order your drinks to bring them back to your table. There seemed to be a regular customer clientele seated here. \n\nOn my companion’s quest for great barbecue while in TN, this was on the must visit list. We ordered a rack of ribs to share and the mac and cheese side along with crinkled fries. The dry rub and the ribs were good. The sides were average. Tables with students and seniors appeared to be having a good time whether eating ribs, pulled pork or wings. The prices are reasonable. \n\nThere is a lot of brand merchandise for sale for customers who love this place or visitors who choose this as a destination place. Worth the visit if you're visiting multiple barbecue places to find what you consider the best. \n.",
   "Stayed at the Hutton Hotel (excellent) and the valet suggested this place. The ribs were served dry which \"let's the meat speak for itself.\" It did and what a statement. The meat was tender, juicy and tasty. This place is a keeper and next time through Nashville I will be there again. Take friends with you. They take reservations for groups. Beats the wait in line. Ran out of ribs but the chicken was great. Pork was also outstanding. Mac and cheese and smoked green beans are a must. Sat upstairs and apart from the nachos taking awhile the service was great.",
   "Basing this off of a single delivery meal of ribs, beans and slaw, but it was that good. While there a some other good bbq shops here (Central, Edley's & Martin's), this is among the best I've had in Nashville. I will definitely be ordering again to try more of the menu.",
   "This place had a line of 20 people when it opened at 11am!!! But after eating here I know why. The pulled pork was the best I’ve ever had... no fat and perfectly cooked pork. My husband had the ribs and they literally fell off the bone. Prices are reasonable and portions are generous!",
   "Our office has ordered catering from all of the BBQ Restaurants in Nashville.  As much as we like all of them, we keep coming back to Peg Leg Porker.  As a matter of fact, all  of our employees prefers Peg Leg. The food is always delivered HOT, as well as, top-notch quality and the quantity is always plentiful.  They always provide more than enough food.  Their catering service is also top-quality.  They never disappoint.  If you are looking to have BBQ catered to your home or office, I would highly recommend Peg Leg Porker.  Believe me, you will not be disappointed.  Plus, they are a family owned establishment, not a chain, and it's always good practice to promote our local restaurants."
  ]
 },
 {
  "name": "Five Points Pizza East",
  "address": "1012 Woodland St, Nashville, TN 37206, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/88ef66e8-9332-11ea-b4a8-14b31f159f22.png",
  "tags": [
   "walk",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=13254743005423165438",
  "source": "GoogleMaps",
  "reviews": [
   "We went a bit too late to try the Stromboli and garlic knots. We did order a few slices from the walk up menu after 11:30pm on a Monday night and it was quick. We ordered a pepperoni slice and a meat lovers. I only have a picture of the meat lovers because we both devoured the pepperoni. It was our favourite! I wouldn’t be lying if I said that the pepperoni slice is in my top 3 all time best pizza I’ve ever had! Good job!!",
   "Hands down my favorite pizza place in Nashville. The crust is always the perfect consistency and cooked to perfection. The flavors are great. Perfect for any night or get together. Great location in a fun neighborhood. Service is also great. Can’t wait until I come back!",
   "No photos because we were so hungry 😋. My daughter doesn’t like BBQ so on our way back to Chattanooga we stopped at this place that was recommended. We went to the take out side and ordered three slices. In a few minutes we were back on our travels and ate yummy pizza. The cheese was excellent and dough soft. We will be traveling back to Tennessee in a few months and will visit their sit down location soon!",
   "Terrific pizza\nWe saw customers buying takeout pizza as soon as the store opened at 11 am so we had an inkling that the pizza was good.  We went back at lunch time and ordered just a slice to try.  That one slice became three slices, arugula salad and garlic knots with hot marinara sauce.  It was just delicious - thin and crispy base with minimal toppings!",
   "Went there short line. There was a guy that had ordered a head and was waiting for his name to be call, but didn’t know apparently you have to get in the order line when you arrive then move to pick up line. Very confusing and the guy was not thrill. The order taker was nice. The guy that called my name and lay my order on the pick up was unfriendly. Also, I heard another employee say “ Tony bologna.”  As my name is Tony. First, I started to say something real ugly but I let it slide. The guy was ugly as hell and look like some Bologna. I would have went in on him for being ignorant."
  ]
 },
 {
  "name": "The Standard",
  "address": "167 Rosa L Parks Blvd, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8936b6b8-9332-11ea-be48-14b31f159f22.png",
  "tags": [
   "history",
   "food",
   "unique",
   "food",
   "food",
   "music",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4298314143845771189",
  "source": "GoogleMaps",
  "reviews": [
   "I've been to a lot of good restaurants and I have to say this one is one of the best I've been to. The service was top notch, ton of history, great ambiance and amazing food. Rarely write reviews but felt compelled to after a great experience here. Our waiter Sean was amazing and the hostess Mrs. Smith was such a sweet heart. Highly recommend",
   "I dropped in for a members luncheon in February and had the distinct privilege of meeting Josh and Jerry and hanging out at The Standard that afternoon. What a fantastic place, truly unique and the food was absolutely incredible! This is a MUST STOP for anyone visiting Nashville!!! I will not be back to Nashville without first making a reservation here! Truly the BEST OF NASHVILLE!",
   "One of the most amazing experiences.  If you have not tried this gem, it is a must.  First off you are greeted by the most amazing hostess I have ever met.  Such southern hospitality.  She is such a mom, which makes the experience so beautiful as it was.  We were greeted and introduced and taken to the bar to sit before we had dinner.  The bar atmosphere is so beautiful.  The whole restaurant is breath taking to begin with.  I have not even gotten to the food.  We were seated, and she kept checking on our dining experience the whole time.  The food melts in your mouth.  A must when you come to nashville!!  Many know about it, our first time.  I would come back...just to experience \"mom\" again.  Such a beautiful soul and thank you for making my birthday so amazing as you did.  I felt I was at home.  13,000 sq foot facility...looking at the front of the home you would never know.",
   "This is a must visit while in Nashville! \n\nThe bar has a great selection of whiskey and wine. It’s a cozy bar with a fireplace, unfortunately live music wasn’t an option the night I visited. \n\nWas too busy eating the rest of my meal and didn’t get more pics. The sampler appetizer isn’t listed on the menu but it’s a must order; fried green tomatoes, calamari and the low country shrimp. The Standard Filet....  nothing more to say, order it and thank me later!",
   "What a great place! Great food (with an accmpanying price!) great atmosphere, great service, and a unique location. The Standard is located at the Smith house and is the oldest building in Nashville. There are tons of cool nooks and crannies, including a hidden room behind a brick wall!\nExcellent place to go for dinner, drinks, or just to relax. Highly recommended."
  ]
 },
 {
  "name": "Arnold's Country Kitchen",
  "address": "605 8th Ave S, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/89778250-9332-11ea-9666-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "food",
   "walk",
   "food",
   "food",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17433571359055614162",
  "source": "GoogleMaps",
  "reviews": [
   "We were scared away by the long line at Biscuit Love, so we took a short walk over to Arnold's. All members of our party were weary and hungover, and the food absolutely hit the spot. The pulled pork, mac and cheese, and fried tomatoes were to die for and were served cafeteria-style by helpful and cheery employees. The whole plate and a large sweet tea cost ~$13, a great value. Loved it!",
   "Hands down some of the best Southern food I've had. The experience was just fantastic. Staff and customer service: hands down what food service should be. Now the food...the banana pudding was pretty sinful. And I can't tell you the last time I had fried catfish but I guarantee you it didn't taste like this did. It is worth the line. It doesn't take long. They move very quickly and diligently with ordering. Trust me. Just try it.",
   "We were scared away by the long line at Biscuit Love, so we took a short walk over to Arnold's. All members of our party were weary and hungover, and the food absolutely hit the spot. The pulled pork, mac and cheese, and fried tomatoes were to die for and were served cafeteria-style by helpful and cheery employees. The whole plate and a large sweet tea cost ~$13, a great value. Loved it!",
   "This place is awesome. The food was top notch. Went late at 1 pm to avoid crowd, didn’t happen. Huge line all way out the door. Bbq chicken sold out while I was eating. Recommend this place and going early!!",
   "We found this restaurant on an episode of Diners, Drive-Ins and Dives and saw it had thousands of 5 star ratings. It was humble but the ratty parking lot was full even though it costs $5 to park. We were greeted warmly and told how to order (cafeteria style - grab a tray and walk through the line). We tried foods like collard greens and grits and loved them both. The fried chicken was amazing. It is quite possibly the best food I have ever had. I also enjoyed the cafeteria seating sitting next to smiley strangers at long tables in the crowded room. No one gasped when we prayed over our food. We will be back!"
  ]
 },
 {
  "name": "Josephine",
  "address": "2316 12th Ave S, Nashville, TN 37204, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/89b94d66-9332-11ea-b035-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "walk",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=10140286639077536837",
  "source": "GoogleMaps",
  "reviews": [
   "What a great Venue, since the moment we sat down until our departure. \nService was on point. Our meal was just amazing. One of the best meal I had in Nashville so far. Wine, drinks and most of all food. Good job Abbey 😊\nComplementary valet parking or pay to park around the corner. We left talking about when can we make our next visit. Cheers!! 😁🤙🏼🤙🏼",
   "Delicious food, great atmosphere. My wife and I had brunch there on a Saturday, late morning. The pistachio sticky buns we're sticky and tasty. The leek and mushroom quiche was twice as high as expected for \"one\" slice and tasty, too. But the dried cherries and orange brussel sprouts were awesome!! Hope to go again when we go back to Nashville.",
   "So much to love. Surrounded by a beautiful restaurant you'll be treated well by a welcoming staff. Food is delicious. Couple of highlights are the beef tongue, and papperdelle. Chicken for 2 was filling and fantastic. The place has the whole package and I'm excited to return.",
   "Josephine has one of the top teams in Nashville.  From the time you walk in the door you feel welcome and relaxed.  The lighting is perfect and the setup is cozy yet chic.  The menu has a some staples, one of which is the chicken for 2 which is always spot on.  The seasonal additions are always a fun way to try something new.  Each dish is beautifully prepared and there is a good balance of veggies with every entree.  Dessert is a great addition with both seasonal specials and classics like the apple cobbler.  I feel right at home when I have dinner here and always look forward to the next visit. And don't forget your ginger snap cookies which are a special treat handed to you on the way out!",
   "Beautiful setting and trendy neighborhood.  Had the Winston cocktail which was a good bourbon based old fashioned drink. Had the beef tongue; good flavor with the caramelized onion.  Though I expect the beef tongue to be slices instead of shredded.  I would be more impressed if it was sliced and sear.  Scallop was perfectly cooked but the okra was a bit overcooked which was hard to chew.  Overall great place but not blown away."
  ]
 },
 {
  "name": "Peninsula",
  "address": "1035 W Eastland Ave, Nashville, TN 37206, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8a013bee-9332-11ea-9415-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "unique",
   "adventurous",
   "delicious",
   "food",
   "creative",
   "unique",
   "family",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=9236165273464804656",
  "source": "GoogleMaps",
  "reviews": [
   "We were thrilled with the pacing of the dishes! We have been to a number of tapas restaurants here and in other parts of the world, and have usually been disappointed in many dishes brought out at the same time. Maybe because they're so small, they can really take care of the customers, and this care shows and is so appreciated! The cocktails are tasty, and if you're a G&T fan (I'm not), there's a large menu just for those. Yes, the food portions are fairly small, but the tastes are fantastic! I won't list the dishes we had, since they'll always be changing. We're definitely going back, probably seasonally, to continue to enjoy their culinary magic. Service was so friendly and attentive - loved it!",
   "Such an amazing place. If you want a dining experience and not just eat dinner, this is it. We were really impressed that Craig brought his passion for this place to the front of the house!\n\nLoved the shared dish style of service. The Grouper with horseradish foam was our fav, but the rabbit, and pork cheeks were super tasty as well.\n\nKiller cocktails that blew away our pre dinner drinks at Attaboy. Great G&T menu. The housemade amaro was super tasty.\n\nWe rarely get to double back on places to eat/review, but this would be one of those places.\nSAVOR- 5 out 5",
   "Such an unique experience.  Make sure to check out the BTB wine list... for an amazing collection of old and new, interesting and special wines. \"Peninsula\" for the Iberian peninsula, bringing extraordinary bites from Portugal and Spain with an experienced twist.  Absolutely a must for the most adventurous among us!!!",
   "Peninsula is divine. Well thought out wine list, amazing cocktails and the food is off the charts. Get the rabbit stew...you will not be disappointed. Delicious. And save room for dessert.",
   "Exceptionally unique and beyond delicious dishes. All dishes came in a form that we weren't expecting at all.  The chef here deconstructs and rebuilds the dish a unique way. We were pleasantly surprised with the form of almost everything. \n\nThere should be a popup store that sells only the rabbit stew + toasted croutons. That dish still has me dreaming about it.\n\nOn the negative side, I really didn't care for their take on pan con tomate. It has this heavy aioli/mayo that really weighs down the start to a meal, and the sesame seeds annoyingly get stuck in your teeth without adding much to the dish. \n\nWe loved the lobster, adding bonito on top gives a great umami and the crunch of the cracker contrasts the otherwise soft elements. \n\nThe cauliflower was really one to noodle on. Would have expected the scallop to be the main component but it's dried and ground almost as a  breadcrumb on top. The flavors were so spectacular, definitely order this. \n\nMy wife is still glowing about the crema catalana ice cream. Sweet, salty from the potato chips and caviar, crunch from the bruleed sugar. It was everything. \n\nHighly recommend this place, so happy to see creative cooking in Nashville as opposed to the monotony of southern family style cooking restaurants."
  ]
 },
 {
  "name": "Chauhan Ale & Masala House",
  "address": "123 12th Ave N, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8a498a0c-9332-11ea-803d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "cheap",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15598054295373222350",
  "source": "GoogleMaps",
  "reviews": [
   "We really enjoyed the food and ambiance at this restaurant. We love Indian food and weren't disappointed by this more modern take on traditional Indian food. The decor, lighting, and atmosphere were very soothing and relaxing. Not overly loud so could easily hold a conversation with my friend (LOL). We had appetizers earlier so wish we had ordered one meal to share because we were going to a show and could not take any leftovers with us. The portions were very generous, the huge chunks of lamb were perfectly cooked, and the sauces were moderately spiced and very enjoyable. Honestly, we nearly had an entire meal left and were disappointed to leave so much great food. All of the staff were friendly and engaging. Would highly recommend and look forward to returning and eating ALL of our food on our next trip to Nashville.",
   "We really enjoyed the food and ambiance at this restaurant. We love Indian food and weren't disappointed by this more modern take on traditional Indian food. The decor, lighting, and atmosphere were very soothing and relaxing. Not overly loud so could easily hold a conversation with my husband (LOL). We had appetizers earlier so wish we had ordered one meal to share because we were going to a show and could not take any leftovers with us. The portions were very generous, the huge chunks of lamb were perfectly cooked, and the sauces were moderately spiced and very enjoyable. Honestly, we nearly had an entire meal left and were disappointed to leave so much great food. All of the staff were friendly and engaging. Would highly recommend and look forward to returning and eating ALL of our food on our next trip to Nashville.",
   "Absolutely delicious. Just perfect. It's not cheap food but it shouldn't be because there is a lot of care put into it. Ambiance is cozy and lovely. Service was flawless. Can't say a single bad thing.",
   "I've been wanting to try this for months, so my birthday seemed like the perfect time. The staff was so friendly and the service was great. When my husband made the reservation he informed them of my onion allergy and they accommodated me and took it seriously (rare).I had the lamb chops, so juicy and flavorful. All 5 of us loved our food and cocktails. The cheesecake was also fantastic. We will definitely be back!",
   "Great appetizers and wonderful ideas about Indian fusion cuisine.  The main courses were less than what we expected. Very mild, even sweet.  Their duck was sweet, the meat & three was made up of sweet vegetables and just edible chicken.\n\nNo need for dessert once you finish your meal.  \nThe staff was very nice and helpful."
  ]
 },
 {
  "name": "Barcelona Wine Bar",
  "address": "1200 Villa Pl Suite 110, Nashville, TN 37212, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8a908580-9332-11ea-ab80-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=10640080568784493123",
  "source": "GoogleMaps",
  "reviews": [
   "The food here was amazing! All of the tapas we tried were great and well made. We ordered 4 to share and paella for 1 split between two and the chicken pimientos. While the paella was truly amazing and everyone was very happy with it, the chicken pimientos truly stole the show. The sauce was amazing and they offered bread to sop up the extra because everyone generally loves it so much. Will be returning for another fine dining night",
   "I am in town for the weekend to attend classes at Vanderbilt, and had the pleasure of starting my trip with dinner at Barcelona with 2 colleagues. My last experience at Barcelona was in CT for my baby shower 12 years ago, and this latest adventure did not disappoint. We enjoyed each dish more than the next -- the empanadas, the Brussels, the spinach chickpea deliciousness, and the Spanish tortilla. And a piece of magical cake... I don't know what it was, but it was wonderful. The restaurant manager went out of his way to make us feel welcomed and attended to, especially when there was a mix-up on our food. Total home run, would go back again.",
   "With a bit of a rustic feel, we enjoyed our time and meal here. The service was good considering the size of group (16). \n\nNote there is valet parking available but it was difficult to spot.  Their stand is on the sidewalk and there were cars parked in front of it. Either way, there was easy parking in the pay lot less than a block away.",
   "Tonight we celebrated Valentine’s Day with our 8 month old Daughter tagging along! The whole staff was so sweet per usual and the food was incredible. Fourth visit, ordered different items each time and have yet to eat something we didn’t thoroughly enjoy! Special shout out to the General Manager Dan G. for making our night out with the little one extra special. He checked on us multiple times to make sure that we were being taken care of. His professionalism and hospitality is over and beyond. It makes perfect since why quality and service is top notch here with a GM like that!!",
   "My fiance and my favorite restaurant in Nashville! We have not had one item that wasn't delicious from the menu; and the wine list is excellent. Do not hesitate to come here! The ambiance is great, but try to get a reservation for dinner cause it gets busy."
  ]
 },
 {
  "name": "etc. restaurant",
  "address": "3790 Bedford Ave, Nashville, TN 37215, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8ae200ac-9332-11ea-b4a4-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16379723182526134513",
  "source": "GoogleMaps",
  "reviews": [
   "My family visit the restaurant for Sunday brunch. The food was great. The atmosphere was good as well. It was quiet and quiet intimate. Only complaint is the restaurant isn't family friendly. We had a 3 and 4 year old and they do not have any type of kids menu. We were able to put some things together for them but that wasnt ideal. They offer complementary valet and he was amazing.",
   "I don't know how to go back to normal food after this. It's too delicious. \n\nAlso, Bret is an amazing server. Super passionate about the food and wines he serves. Makes the experience that much better. :)",
   "Last night was Date night. The etc. was marvelous. The staff, the food, and atmosphere was perfect. We met the chef and she is awesome. Thank you etc. for making such an perfect night. You can not go wrong with etc. You will have an glorious time and great food.",
   "I think it's kind of funny that a restuarant like this is in Nashville. Deb and her team would easily get a Michelin star if they were in New York or something. \n\nEverything on the menu is fantastic and you'll have a great experience. If I have one complaint, it's the limited wine list, but honestly that doesn't matter. Recommend checking to see if Deb is in the kitchen during your visit -- you've got to meet her!",
   "Hands down one of the best filet's I've had in quite some time!! Amazing presentation as well. The service was OK but it seemed like the server was just robotically doing his job. No personality or warmth. The valet service was excellent though!"
  ]
 },
 {
  "name": "Bastion",
  "address": "434 Houston St STE 110, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8b2a5502-9332-11ea-adf2-14b31f159f22.png",
  "tags": [
   "drink",
   "unique",
   "food",
   "drink",
   "unique",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=16881045256164078770",
  "source": "GoogleMaps",
  "reviews": [
   "This is a must try dining experience when you’re in Nashville (if you can score a reservation).\n\nThe restaurant itself is almost a secret entrance of sorts connected to its sister bar. It’s gorgeous inside and everyone (for the most part) sits at the chef’s counter.  You basically get 1 on 1 service from very skilled chefs. The ambience was so unique.\n\nOverall service was some of the best we’ve had. It was so nice chatting to the chef about places he’s tried and to see how passionate he was about food—it was amazing. \n\nDrink menu was top notch. So many good cocktails, wine and beer that it’s tough to make a choice.\n\nFood was incredible. Bold flavours and great portion sizes. Did not leave there feeling like I needed to be loaded with a forklift but I was plenty full.  The menu layout was so unique and we loved it. \n\nIt was just such a great experience. Will 100% go back when we are in Nashville next time.",
   "This is a fantastic dining experience in a `secret` room off from the side of the bar.  The staff was absolutely top notch, answering any question you might have, and providing a very welcoming environment. Instead of choosing, we just did the Bring It All and Fly Blind combination. At the end, don't miss the private bar inside as they have a top notch bartender and selection of whisky/drinks.",
   "Went for our daughter’s birthday. Did the entire tasting menu plus wine pairing. Everything was exceptional. Portions are small but every bite is meant to be savored. Truly a delight for epicures. If you value quantity for the price, this is not the place for you. If you enjoy experiencing new and unusual, yet remarkable tastes, bastion is a great destination. Staff is friendly, helpful, attentive, and unpretentious. Atmosphere is unique. Take time to get a drink at the private bar before dinner.",
   "I am just speechless. Every dish was perfectly balanced. They put together ingredients that I individually dislike and made them taste beautiful. What a wonderful meal. The drinks and the service were incredible as well.",
   "Got a last minute reservation at 9:30pm and went straight here from the airport on day one of vacation. We sat at the bar and had a great dinner. Seems like they're just a bunch of really talented, dedicated young chefs who enjoy making really amazing dishes. Staff heard we were visiting and wrote out a bunch of other dining spots we should check out."
  ]
 },
 {
  "name": "Folk",
  "address": "823 Meridian St, Nashville, TN 37207, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8b6eef12-9332-11ea-9d78-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "family",
   "food",
   "delicious",
   "adventurous",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10384373980952784748",
  "source": "GoogleMaps",
  "reviews": [
   "We loved the contemporary, casual setting. Also, it is wonderful to see a menu that doesn't have only the expected fine-dining fare. While a conservative diner can find traditional dishes, there's also interesting options for the adventuresome. We went family style and sampled an unusual pizza with great ingredients, a delicious salad and a chicken dish.",
   "This was our second time at Folk, we had the same waitress and both the food and service were phenomenal. This is quickly becoming our favorite restaurant in Nashville. This is owned by the same folks who own Rolf and Daughters. It's family style food that will fill you up but not leave you feeling heavy. Do make a reservation!",
   "This trip was my second visit here, and both times were incredible. I'm from out of town or I would be here regularly. The food (including dessert) is delicious! The clam pizza is a must if you like clams/seafood, or if you're feeling adventurous. Service was especially good this time around (I believe our server was Hannah.). I will be back the next time I'm in Nashville.",
   "Such a great place with super staff. Everyone who works here has extensive knowledge of the menu and they serve very well. I always recommend!",
   "Our new favorite restaurant! The pizza is to die for - best dough in the city. Cocktails were great. Everything else on the menu was fantastic but the pizza was definitely the best. Will come back many times to sit at the bar and get a pizza with a couple of drinks."
  ]
 },
 {
  "name": "Merchants",
  "address": "401 Broadway, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8bb5d83a-9332-11ea-88f1-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "food",
   "delicious",
   "delicious",
   "food",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=5493754643826672356",
  "source": "GoogleMaps",
  "reviews": [
   "We sat at the bar for lunch on a Saturday here. Our bartender was excellent and made a fantastic Bloody Mary. Our food was great, we just ordered sandwiches but they were very tasty. Even the free popcorn they hand out at the bar was delicious! We ended up spending more time here than we expected just because it was such a great atmosphere. We would definitely come back.",
   "First off, I got a genuine smile from every person on staff when I walked in. And it just got better from there. My waiter Jimmy was friendly, fun, and gave me an excellent whiskey recommendation! The fried catfish sandwich was straight up excellent. Real, home style cornmeal fried catfish with a house made tarter sauce that puts it right over the top. This was the best place I went to on my entire trip to Nashville! Great job guys!",
   "I had a WONDERFUL evening! I spent my 3 year anniversary here with my boyfriend and we both had a great night! We made reservations online, and when I called to verify my reservations we told them we were celebrating three years together. All of the staff made us feel very welcomed and special on our night. They all signed a card for us too! My waitress was very sweet and always made sure we had refills. She even told the chef to make my chicken, which was so delicious, into the shape of a heart! We will definitely be spending our 4th anniversary here!",
   "Unbelievably wonderful staff at Merchants! A hand made Birthday card was presented to me after our meal in lieu of dessert. Went way out of their way for my gluten intolerance. Food was absolutely delicious too.",
   "Excellent food and affordable for Broadway.  Party of five seated quickly upstairs on a Saturday night.  Good pours.  Spotty service though.  Manager was very helpful.  Our personal server was so so."
  ]
 },
 {
  "name": "Hattie B's Hot Chicken - Midtown Nashville, TN",
  "address": "112 19th Ave S, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8bfb24d2-9332-11ea-b18a-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11608428533289486235",
  "source": "GoogleMaps",
  "reviews": [
   "We went to the Melrose location, the was a small line, but we only waited maybe 20-30 minutes from when we got there until we were served our food. We both went with sandwich’s. My friend isn’t big on spicy so he went with mild which he said was very enjoyable, just a hint of spice that builds a little. I like spicy but was too chicken to get the hot, which is the fourth spicy option, there are two levels above hot. The Medium was a nice amount of heat without being uncomfortably hot. Looking back I should have gotten Hot. The chicken was moist all the way through. The collard greens were good and the red skin potato salad was average. Overall very good chicken!",
   "Line was long but only had to wait about 40 minutes to get served. The chicken was absolutely amazing. I did the medium and it was just spicy enough for me. Macaroni and crinkle fries were great sides I had with it. I should of ordered small dark instead of large dark. Way to much food, got a to go box and will be able to enjoy some chicken tomorrow. If you get to Nashville it’s a must go to restaurant. The staff was awesome also, friendly and always had a smile on their face.",
   "Tried it for the first time today and it was amazing. My husband and I both got the same thing. 3 chicken tenders which are good size and it comes with two sides. We got fries and the pimento mac n cheese. I'm not big on pimentos but you couldn't even taste that. It was all VERY good. I got medium spice and my husband got hot and it was perfect. Good spice level if you like spicy and good flavor at the same time. Will definitely be back. The guy working the register was super helpful and nice as well. Great customer service!!",
   "A number of us went to the restaurant. People got the chicken sandwiches and chicken tenders with all 4 types of heat you can put on the tenders. Everyone enjoyed their sandwiches, a few stating they were better than others they had experienced in chain restaurants. We got the mac and cheese and fries as sides which were very good. I got the Gluten Free chicken tenders, no sauce due to food allergies, they were cooked just right, moist and tendrer.",
   "A must visit! This is hands down the best run out of the group. The line was long but went fast and totally worth the wait. Super clean and friendly. The mild chicken tenders did not disappoint and the Mac and Cheese is the BEST! The greens are big, leafy, and tasty. Local craft beers are on tap and very cold. I don't care how much of a hurry we are in we always have time for this Hattie B restaurant."
  ]
 },
 {
  "name": "Tailor Nashville",
  "address": "1300B 3rd Ave N, Nashville, TN 37208, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8c413ef0-9332-11ea-837e-14b31f159f22.png",
  "tags": [
   "unique",
   "family",
   "food",
   "family",
   "unique",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17333623771404454860",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great introduction to course meals that aren't the typical American or French we have so much of in the US. I enjoyed all the courses we tried but none stood out as anything world changing. If I was from the area I would consider coming back frequently, it's very good.",
   "Our table of 4 was anticipating the experience and we were not disappointed. We loved the way the food was presented and explained by the wait staff. But even better, Chef Vivek Surti then tells a story of how this dish made it to the menu as related to a childhood memory or a family member. We really felt like we had been invited to his home to dine. Definitely a unique experience.",
   "What an incredible evening! I think Heather manages the front of the house, and she was extremely accommodating due to a loss in the family on my girlfriend's side. I couldn't be more grateful to her and the restaurant for their help. When we visited this past weekend, myself and everyone in our party was blown away! The flavors, wine pairings, service, ambiance, etc, etc, etc was absolutely perfect! The atmosphere was very welcoming and unpretentious and we loved Chef Vivek's explanation of each dish. The price was more than reasonable and we finished without feeling overly stuffed or hungry. There is so much thought that goes into each course and each pairing and the execution shines when left with the experience. I will definitely be back.",
   "Chef Vivek hosted a wonderful dinner, felt like I was at a friends place! Can't wait to go back! Beverage pairing was on point! Mom was correct can't be desert without chocolate!",
   "Excellent & unique experience, great stories, and great service. Everything was so well balanced and a great blend of Vivek's family history to his current memories."
  ]
 },
 {
  "name": "The Mockingbird",
  "address": "121 12th Ave N, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8c896b94-9332-11ea-a6c9-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "drink",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11229118178080628253",
  "source": "GoogleMaps",
  "reviews": [
   "I love mockingbird! The vibe and decor is so nice. Not too loud, but great energy. Loved the waitress we had. Super cool and funky feel to everything. You gotta get the punch! Comes in a bag with a fun straw. The punch when I went was blackberry something(?) and it was to die for. I love the chicken and mashed potatoes, Mac and cheese, and French fries. Portions are pretty huge, so be",
   "Love this place! The staff were very friendly, and the location and decor was unbeatable. Parking is a little hard during busier times, but it is available. We came for Taco Tuesday and loved all of it. The drinks were excellent, the food was delicious, and service was great. We will definitely be back!",
   "Hands down my favorite restaurant in Nashville. Every single dish I’ve ordered is delectable. My favorite small plate is Don’t Worry, Brie Happy. The atmosphere reminds me of the Great Gatsby. I’d feel comfortable there for both a special occasion date or a casual after work drink. Brian and Mikey have done a fantastic job building a staff of friendly front of house and a menu with staples and rotating dishes. I highly, highly recommend this restaurant to everyone in Nashville!!",
   "Food was good. Not all meals came out at once. I had to sit and watch everyone else eat for a little. We had a large group to manage. No complaints on the food. Their cinnamon roll dessert was delicious.",
   "Went to celebrate Valentine's Day. Such a great dinner. The brussel sprouts as an appetizer were a great start. The pork schnitzel was AMAZING and I can't wait to go back to get it again! Seriously one of the best dishes I've ever eaten. The chocolate cake had this nice crispy crust to it that kind  of made it a cross between a cake and brownie. So good. We also moved mid meal  (at our suggestion) to accommodate a larger party next to us. The manager brought us glasses of champagne as a thank you which was a great way to toast to a fantastic date night."
  ]
 },
 {
  "name": "Hathorne",
  "address": "4708 Charlotte Ave, Nashville, TN 37209, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8cd23040-9332-11ea-99a9-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "history",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9808566195725993643",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing happy hour menu and cocktails. Highly recommend the Audrey cocktail. The food was exceptional and reasonably priced. Also, plenty of sharable items. I will definitely be back to try more of the cocktails!",
   "The service was very kind and attentive, “joyful hour” was amazing in the fact that it is Monday- Saturday 5-7 and had wonderful deals, and the atmosphere was really great for a date or a group. The veggies, starters, and sides we ordered were all wonderful but sadly both of our meat dishes were overcooked and the flavor wasn’t outstanding. I would come back for Happy Hour and for the sides but not for the entrees. Overall a good experience though, which is where the 4 stars comes from.",
   "Incredible hospitality. Owner came over and offered some drinks for our anniversary (we also know him through someone else). But they were so kind and complimentary and made sure everything was great, and it was. Will definitely be back and excited to bring friends. Highly recommend the Brussels, cocktails, and chicken! Also had a delicious cheese and chocolate plate which was divine.",
   "It was our first night ever in Nashville and what a  wonderful introduction!! The food was amazing, the staff were lovely and attentive and the owner was both charming and helpful. He went the extra mile giving us tips on enjoying the weekend and the history of the building/church. A top ten dining experience for me. Highly recommend!!",
   "This was an EXCELLENT experience! The food just kept getting better and better with every dish they brought. I'm a vegetarian so we only ate off the left side of the menu, but it was very filling and so tasty. I don't think anything was bad at all. Titus was of server and he was very attentive and was on the spot everyone we needed anything. The atmosphere was great and there is a real missed vice inside and kinda of laid back. They also have an excellent drink menu is that is your thing."
  ]
 },
 {
  "name": "Martin's Bar-B-Que Joint",
  "address": "410 4th Ave S, Nashville, TN 37201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8d15a1a2-9332-11ea-b257-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "walk",
   "food",
   "delicious",
   "food",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7874948438422664866",
  "source": "GoogleMaps",
  "reviews": [
   "First visit was great. We came in with a large group (at least 20) and were still able to get seated very quickly given the crowd they already had. The staff was awesome! very friendly. Our food came out quickly and everything was really good. My daughter had the chicken tenders I had the pork sandwich they were delicious. Atmosphere was great. Not one person from our group had a single complaint. The prices were reasonable, the portion sizes were perfect. Ordered a drink from the bar, it came out quick, well made and not overpriced. It’s short walk from the convention center. I would highly recommend to anyone in the area.",
   "I haven't had proper BBQ in what feels like years. This was my first time visiting Nashville and I had to get myself some ribs. Absolutely top notch. Famous Dave's used to be my favorite BBQ place, but Martin's ribs are so much better. Their deviled eggs, baked beans, and wings are really great, too. I definitely left a very happy trucker!",
   "This place is GREAT. We got the big mama's platter which had brisket, ribs, pulled pork, and a couple sides. We also got wings. It was enough to feed 4 hungry women. Our bartender gave us some suggestions on what to order and which sauces to get and she was spot-on. Everything was moist, flavorful, and delicious. We then went upstairs and listened to a band in their backyard garden space. It's a great spot for a casual hangout. Would return 100%.",
   "Good food! Lots of seats so bring your friends 😉 line to order can get long so be ready to wait. They do a good job at keeping the line moving through. It can be loud. It is kid friendly.  They have a upstairs area as well with some games. They have a full bar so lots of drinks to choose from.  The staff is very nice and do there best to help you.",
   "I was lucky enough to visit 3 weeks ago (yes, this was VERY necessary and overdue).\nFood was SO good!!! Atmosphere and staff were so awesome. Bartender was knowledgeable of drinks and was very kind. Next time I visit Nashville I will DEFINITELY revisit Martin’s 💕"
  ]
 },
 {
  "name": "Pita Plus Gyro",
  "address": "12 Arcade Alley, Nashville, TN 37219, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8d6c3bc6-9332-11ea-9217-14b31f159f22.png",
  "tags": [
   "food",
   "nature",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=16175404157850831651",
  "source": "GoogleMaps",
  "reviews": [
   "I've eaten at Pita Plus Gyros a couple of times during my visits to Columbia and the food is really good. I've had the grilled chicken plate on both occasions and it was wonderful. The staff is outgoing and friendly and the food is wonderful! It's a hidden gym that you definitely need to try when you are in Columbia, TN. We go here regularly for lunch from work in downtown Columbia. Has to be the best Greek I have ever tried. The spinach pie is the best.",
   "Great authentic-tasting gyros right in Nashville’s Arcade.",
   "A comfortable, speedy, and mindful restaurant run by the most amicable Kurdish people. They offer crisp and hot Mediterranean-style nourishment for a stunning worth, and beat a large number of the other encompassing diners on nature of nourishment.",
   "A cozy, quick, and attentive eatery run by the friendliest Kurdish folks. They offer fresh and hot Mediterranean-style food for an amazing value, and beat many of the other surrounding eateries on quality of food.",
   "The woman who took my order would give Chick-Fil-A’s staff a run for their money. She was SO kind and spoke to everyone as if she’d known them forever. She’s just so friendly and chipper!\n\nThe gyro plate and pistachio baklava were both very delicious as well."
  ]
 },
 {
  "name": "Lyra",
  "address": "935 W Eastland Ave, Nashville, TN 37206, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8dba9ea4-9332-11ea-8ace-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "unique",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13977836910845121369",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious food. Eclectic menu.  Friendly service in a welcoming environment.  Drinks overpriced but otherwise an enjoyable dining experience.",
   "Went with my aunt who was in town. My wife and I had never been before. We were all so happy with our dinner experience. The food was great quality, the flavors were marvelous, and the cocktails were incredible. This is now our go to spot to take people who visit us. Incredible place.",
   "Make Lyra regular dining experience, because if you're like me, you'll never leave disappointed. I've loved every experience I've had here, from when I was formerly on the business to business side selling to Liz and Hrant and as an East Nashville community member who loves elegant dishes with exciting flavor enjoyed in a thoughtfully designed, community restaurant/bar on a mission to showcase flavors from Eastern Europe and the Middle East using Southeast regionally-sourced ingredients! Not to mention the wine selection is consistently intriguing. I'm not sure if there is any other spot in Nashville offering Bulgarian, Turkish or Lebanese wines on the same menu with beautifully curated selections from France, Spain, Italy and United States? Their draft beer is local, and their cocktails offer a unique twist with balanced flavors that mirror the philosophy of the food menu. They're always playing great music, and the menu pricing offers amazing value considering the level of quality of food and beverage.",
   "Good restaurant,  good service. We tried the kibee and the cauliflower.. kibee was good, missed a lime to add some flavour. Cauliflower was too sweet for my taste.",
   "This is one of Nashville's best restaurants by far. I have been around 10 times and the service is always great, the food is always fantastic, full of flavor, and interesting. Their hummus and pita is a game changer, their cocktails are always wonderful, and their rack of lamb is unreal. I love Lyra so very much and I am so glad Nashville has this gem."
  ]
 },
 {
  "name": "Butchertown Hall",
  "address": "1416 4th Ave N, Nashville, TN 37208, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8e0a8362-9332-11ea-9d69-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16596743898666201672",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent service. Meal was delicious. Two thumbs up from this Texan on the brisket. Awesome cocktails. The decor is a delightful combination of farmhouse and industrial. Will definitely be back!",
   "Blown away by the butchertown hall. Really good food overall, the appetizers were devoured by the table. The drinks were great too and the service was quick and friendly.\n\nThe lone slight disappointment was the brisket that happened to be a little dry that day. Not a huge deal but hope it isn’t that way every day",
   "Best food we have had in Nashville, hands down. Amazing meat dishes with a really varied menu. We weren’t drinking so the handmade sodas were an extra bonus. Also commend the great service. Final thing was the beautiful restaurant space. Couldn’t recommend more.",
   "All the way from Florida and hands down the best food I have ever had 10/10 and I have had good places but this one hits very different, the surroundings and everything was perfect. I would definitely drive 8 hours again just to eat here",
   "Awesome service and unbelievable food. In town for two days. We had brunch here the first day and loved it so much that we went back again the second day."
  ]
 },
 {
  "name": "The Farm House",
  "address": "210 Almond St, Nashville, TN 37201, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8e576c80-9332-11ea-b1a5-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "drink",
   "food",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=9749908023053790209",
  "source": "GoogleMaps",
  "reviews": [
   "Pimento cheese beignets were amazing. Short ribs were excellent, and the sides that came with were good (above average). The meatball with spaghetti squash was good and the Brussels sprouts with pork belly were great. Everything was fresh and beautifully presented. Portions were not huge, but we were plenty full with no room for dessert. Atmosphere was quiet and elegant but friendly and comfortable. Great, knowledgeable service; our server checked on us just enough.",
   "I stopped by on a Wednesday evening while travelling for work and ordered the half chicken. Overall, it was pretty good. The pumpkin, carrots, potatoes served with the chicken were excellent. I found the chicken breast came out a little dry, but the rest was great. \n\nI enjoyed the casual atmosphere, and the staff was friendly and attentive. There was a large group and the service was still quick.\n\nOverall, I'd recommend giving it a shot. I enjoyed it, and liked their menu, which focuses on locally sourced ingredients.",
   "Great place to dine while in Nashville. I locally sourced restaurants and this place did really good. Homey atmosphere and great chearful staff. The chicken was well prepared and very moist. I loved the turnips and was wanting more. Very good portions. I think the $31 price was a little high for half a chicken but it was a hearty and filling dish. The deviled eggs were simple with a mustard base (I'm partial to mayo) but were still tasty. At $8 for 5 eggs though I was hoping for a little more flavor WOW. I would recommend this place as it's a great example of evolving seasonality type menus and supports local producers.",
   "Was a fun night out with the husband. Food was good but not great although the cornbread was worth the wait. Brisket entree was filling but my favorite part was the broccolini (not the brisket). Service was nice and drink selection pretty awesome. Took a yummy dessert home - cheesecake - that was so good. Fun one time experience, likely wouldn't return.",
   "Pimento cheese beignets were amazing. Short ribs were excellent, and the sides that came with were good (above average). The meatball with spaghetti squash was good and the Brussels sprouts with pork belly were great. Everything was fresh and beautifully presented. Portions were not huge, but we were plenty full with no room for dessert. Atmosphere was quiet and elegant but friendly and comfortable. Great, knowledgeable service; our server checked on us just enough. Meal with an appetizer and a couple of beverages was about $90 plus tip. We want to go back for the beignets and to try something else."
  ]
 },
 {
  "name": "Geist Bar + Restaurant",
  "address": "311 Jefferson St, Nashville, TN 37208, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8eaf3746-9332-11ea-b17d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6283827871733972836",
  "source": "GoogleMaps",
  "reviews": [
   "Everything we ate was delicious. The atmosphere here is wonderful: candles everywhere, comfortable seating, refurbished wood... the only concern we had was that it was a little dark! Our waiter brought us extra candles which helped, but I wish there was just a smidge more light! It is a little on the pricey side, but the food was definitely artfully curated. Probably not a place I can go often, but a nice place for a special meal",
   "Place is super cute. Had a reservation but didn’t get seated right away, had to wait 30 minutes.... but they made up for it and gave us a few complementary appetizers so I was okay with it. Food was GREAT, drinks were great!",
   "What a wonderful discovery! An exceptional service and everything was good for a reasonable price. Their carpaccio is a trip to paradise, like, out of this world. The best ever! We, as in epicurean, food lover and world travellers, we recommand Geist. A very enjoyable moment of pleasure. Great place! Food options were limited but on point. Everything ordered was prepared and presented well and delicious. The night we visited was chilly but will come back to dine in outside patio.",
   "My friends and I found this to be a completely delightful restaurant.  We sat at a table in the bar area where many regulars were watching a football game. Our server was friendly and knowledgeable.  The entire place was intimate and cozy.  We all enjoyed our dinner.  My filet was cooked perfectly.  There was a very nice wine selection.  If I lived in Nashville, I would be a regular.",
   "The place is absolutely lovely. We went on a rainy day for brunch. We were sat in a cozy corner where we could watch the rain fall, the food was fantastic and our server was amazing. Highly recommend."
  ]
 },
 {
  "name": "Pancho & Lefty's Cantina",
  "address": "104 5th Ave S, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8ef82aa2-9332-11ea-835b-14b31f159f22.png",
  "tags": [
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8883562713907783455",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing little spot! We enjoyed DELICIOUS tacos! We both got the “any two tacos” - crispy pork and hot chicken on corn tortillas. Crispy pork ones were the best! The onion straws on top made the taco. The salsa is made with fire roasted tomatoes and was so so so good. I also had the cosmic cactus - wonderful! We loved being able to chill for a few during lunch and people watch. Definitely recommend!!",
   "Oh my goodness was this by far the best tacos, nachos I have ever had. Delicious,fresh,creamy. You must not contemplate this choice just go!! And be sure to ask for Steven on the roof top!",
   "Overall, we had a great experience.\n\nEveryone enjoyed their food and the service was superb. We did come in right before close, so the food could have been a little bit better but the service more than made up for it. The margaritas were very good. They use their own in house juice for the margarita mix. I would definitely recommend this place.",
   "This was my first time eating there and I have to say I was impressed. It is open sitting on the first and third floors (third floor is roof top). The tacos are regular sized soft shells but they stuff them very full. The ground beef is seasoned well. Nice atmosphere.",
   "Great street tacos. Highly recommend the chicken. Service was friendly too."
  ]
 },
 {
  "name": "Hattie B's Hot Chicken - West Nashville, TN",
  "address": "5209 Charlotte Ave, Nashville, TN 37209, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8f4141e4-9332-11ea-9895-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17419417628829805716",
  "source": "GoogleMaps",
  "reviews": [
   "The food is amazing. We ordered takeout tonight and you guys killed it. We just parked and food came in less then a minute. They gave us all the sauces, utensils, and ketchup. The best takeout experience ever. Thank you for your attention to detail,  Kellen! 5 star service!",
   "Always love eating here when I'm visiting. Of all the chicken places, this is the fastest and the most consistent in quality. The sandwich is delicious and massive. The heat levels have plenty to offer for everyone. Their mac and cheese is great and helps cool down your tongue while you're sweating. Still crossing my fingers they open a location in Knoxville!",
   "AWESOME chicken and great sides!  I visited once 4 years ago and was an immediate believer!  I'm in town for 4 days and have already eaten there the first two.  Don't be scared off by a line out the door... they're efficient at getting people through.  It's totally worth a wait.  Only Negative... They haven't yet opened a DC location!!!  Come to Northern VA PLEASE!!!",
   "Hot, fast chicken! Service is excellent. The staff is super friendly and attentive. Don't worry... The line that leads down the side of the building is very deceptive. It moves fast and customers rotate quickly out to make room for more. If you are weak like me, get the lowest heat possible. My husband liked the hottest level but I don't enjoy tears or sweat in my food even if it's my own. Oh, and get the mac n cheese!",
   "So.good. I got the chicken breast, hot with black eyed pea salad and red skin potato salad. The salads were super fresh and the chicken was PERFECT! So juicy and the seasoning was amazing! The hot was the perfect level of heat and still very tasty! Would go back again and recommend to anyone!"
  ]
 },
 {
  "name": "Sunda Nashville",
  "address": "592 12th Ave S, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8f89638a-9332-11ea-8a3f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17266092914237703789",
  "source": "GoogleMaps",
  "reviews": [
   "This is my new favorite restaurant. Our server was attentive and friendly, the food was delicious to say the least, and the atmosphere is beautiful. This is a great spot for a date or a long night out to really have a dining experience. And when I say the food was delicious, all of it was! The appetizers, main course, and dessert! Perfect evening, I will definitely return. Oh, also they have quality old fashions here (no cherry, they use one good ice ball, not tons of ice cubes like amateurs).",
   "My first visit to Sunda was great. We sat at the bar and were seen to immediately for brunch. The interior is lovely and very clean. I was impressed with the menu - not too much but still a lot of variety. Overall very pleased with the service and the food. I will definitely be coming back for dinner service.",
   "Unfortunately while the waitress was very nice she clearly was stretched too thin. Very simple small dinner took well over 2 hours. Food was fine but not impressive. Nice atmosphere.",
   "Very popular place with nice seating, large eat-at bar, and great atmosphere. Good service and delicious food. I had spicy shrimp sushi which was packed with tasty ingredients. Also had an Old Fashioned which was very good! Reservations recommended since it was really crowded.",
   "I am not a big fan of paying a whole lot for food. Four of us went to ready there and my meal with scrambled egg whites was bland. It was also the least appealing of the meals served. There was a good portion of it which was nice, however, that doesn't really make up for overpriced bland food that could easily have been seasoned better."
  ]
 },
 {
  "name": "5th & Taylor",
  "address": "1411 5th Ave N, Nashville, TN 37208, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8fd4c4ac-9332-11ea-815d-14b31f159f22.png",
  "tags": [
   "drink",
   "drink",
   "drink",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=4075074709462803969",
  "source": "GoogleMaps",
  "reviews": [
   "The beef cheek stew and beer can kitchen was amazing! The ambience was incredible and the service was great. I also enjoyed the cocktails as an old fashioned is one of my favorites and it was impressive. A small drink for my liking but the flavor and alcohol content was spot on. I’ll definitely be back to take the wife on another date. Great scene. Make a reservation though.",
   "Wonderful place for some new American cuisine. The beet salad, scallops with gooseberries and popcorn reduction, grouper and cookie pie were amazing start to finish. The drink selection was stellar as well. Nice ambiance in the dining area although I sat at the bar.",
   "From cocktails to desert, spectacular! Steaks cooked to perfection. Drink was incredible try the gin drinks, steak tartar, mushrooms wow! One of the best dinners I have ever had. Thank you for a wonderful dinner! Nick & Carmen ❤",
   "The atmosphere, the upscale tastes at reasonable prices...it's the perfect date night or special occasion getaway. If I could eat the Beef Cheek Pot Roast every day of my life, I would die a happy man. Simply perfection. The specialty drinks, the huge selection of favorites, multiple pleasures for every palate...they really can do no wrong. As a side note, if you want to make someone extremely happy, send them a gift card from 5th & Taylor. It will make you a hit! I promise.",
   "Wow. Awesome atmosphere, excellent service, tasty vittles. Each dish had it's own character, with surprising bursts of flavor scattered throughout. The duck wings were really special with a slightly sweet tang. Even the mashed potatoes were marvelous, with a creamy butteriness that was ever so smooth. Highly recommended."
  ]
 },
 {
  "name": "The Treehouse",
  "address": "1011 Clearview Ave, Nashville, TN 37206, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/902025d2-9332-11ea-8e4c-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "food",
   "delicious",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11647371867141015089",
  "source": "GoogleMaps",
  "reviews": [
   "Outstanding food and service. Interesting, unique flavors. It was a slow Tuesday night but it seemed like every staff member came to our table and checked on us at some point. The coffee rubbed carrot appetizer was great. The potato fritters were unlike anything I’ve ever had. And the pork with parsley was so moist and fresh. We were blown away. I loved watching the chef remove a slice of chess pie out of the oven, rather than a microwave. It’s details like that that make all the difference.",
   "Everything was fantastic. Service was perfectly timed. Food full of wonderfully blended flavors. Awesome culinary experience. Deeply rooted and out on a limb by itself. Highly recommend!",
   "The food was great.  The service was good.  \nOur server Chris was distracted and not very attentive, but the greeter Michael was awesome.  He engaged with us and ensured everything was taken care of in Chris' absence.  He deserves high praise.  \n\nWe were there for East Nashville Restaurant week and the servings were teeny tiny.  I know serving sizes are usually smaller for restaurant week...but this was crazy.  Rabbit stew was literally only 4 tablespoons of stew.  For $18...that's approx $4.50 per spoonful!",
   "Really enjoyed our meal here. We popped in for a late dinner (around 10 pm) and were pleasantly surprised! So many late night spots have great drinks and mediocre food, but Treehouse has great food and drink. The food was interesting, delicious and light enough that we could sample several dishes, and the drinks were tasty and novel. Staff was friendly, and the restaurant is cute. Definitely worth checking out, even if it's not late.",
   "We really like this place because of the atmosphere and especially the drinks. The menu rotates so it isn’t always the same. We had the asparagus, potatoes, & cheese plate. Nothing disappointed! We couldn’t finish it all. The cocktails were really good, didn’t have anything we didn’t like. I highly recommend the cheese plate— the honeycomb goes really well with all the options. We will absolutely will be going back!"
  ]
 },
 {
  "name": "Redheaded Stranger",
  "address": "305 Arrington St, Nashville, TN 37207, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/90674246-9332-11ea-b91f-14b31f159f22.png",
  "tags": [
   "adventurous",
   "food",
   "creative",
   "family",
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7641312763392378610",
  "source": "GoogleMaps",
  "reviews": [
   "Fresh tortillas paired with both classic and adventurous fillings makes this one of my favorite places to get breakfast tacos in Nashville. They have a bar and serve coffee for whatever you are in the mood for. The have an array of fairly hot hot sauces to pair with your tacos. I do wish their home made Hot sauces were more salsa like. I will definitely be coming back.",
   "This will be my new favorite restaurant for a very long time. The brisket taco with egg and cheese was outstanding. Fresh, homemade tortillas and salsa compliment this amazing food. I’m coming back for the green chili burger and more brisket!",
   "Loved this place!! My brother and I came in from out of town to watch a Houston vs Tennessee football game and this place felt like home ❤️ The tacos were exceptional and reasonably priced. The service was wonderful and very friendly. I also really appreciate that they were willing to accommodate certain dietary restrictions without questioning. Our only complaint was the coffee tasted a little weak, but we're very particular about our coffee ☕",
   "Some of the best tacos in Nashville. The tortillas are out of this world, the house hot sauces are so creative and delicious, and the overall ambiance of the restaurant is great. This is a staple in my family for sure. Please go check them out!",
   "I found out about Redheaded Stranger via Instagram recently and decided to check it out on a day off from work. I ordered 3 tacos and they were much bigger than expected. I left stuffed! All were delicious. I also had a good Mimosa. The atmosphere is nice. It's super cute. All staff was very friendly. I'll definitely be back!"
  ]
 },
 {
  "name": "The Southern Steak & Oyster",
  "address": "150 3rd Ave S Ste 110, Nashville, TN 37201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/90b4510c-9332-11ea-ae71-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "music",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9196215542020637725",
  "source": "GoogleMaps",
  "reviews": [
   "This place never disappoints! My mom and I ate here and we had so much fun! Our waitress, Amanda, treated us wonderfully! She recommended yummy oysters, fabulous wine and even helped me to decide between 2 entrees. A great waitress, great good and great wine! We have eaten here many times but this was by far the most fun I have ever had and will always be my most remembered! Oh yeah, pick up some of the yummy ketchup they have for sale, while you are there!",
   "Wow. I was extremely impressed by this place. Outstanding food, the oysters are among the freshest in town with a variety available. There is a happy hour special where you can get a dozen for $20 between 3pm-6pm. The smoked eggs were delicious and arrived in moments.\n\nThe Southern burger was seriously one of the best in town. Great bacon, juicy burger, tasty crispy straws, and the pimento cheese really set it over the top. \n\nThe service was totally on point. Sat at the bar and they all were friendly, warm, and efficient. Overall layout was easy to navigate, and it had a nice laid back touch among the hustle and bustle of downtown Nashville. A++",
   "The Southern Steak and Oyster restaurant/bar is conveniently located in the heart of music city Nashville! This very popular eatery serves traditional southern dishes, as well as a wide variety of other breakfast, brunch and dinner dishes, and a huge oyster menu! Gluten options are offered as well! The prices on food and drinks are moderate, and the service friendly and prompt! Private meeting rooms are available upon advanced reservations! This landmark restaurant is a must to visit!",
   "Exceptional!!!  Great atmosphere and very attentive service by the staff.  The Oysters and Gumbo were both excellent starters and my Wind from the South salmon was fabulous.  Those in our party of 8 that had steak raved about how good it was.  We were all so full that none of us ordered dessert so cannot testify about that part of the menu but have to believe they are delicious if they are anything like the rest of our meal.  The bar selections are awesome so you can get pretty much anything you want from the full wall of bottles.  Great atmosphere, great service, & great food....just can't say enough good things about The Southern but can highly recommend it!!",
   "My wife and I came here for dinner on our vacation. We ordered the hot chicken salad, dry aged steak, and a dozen oysters. The kitchen lost our ticket, which the waiter admitted to, and said we'd be \"compensated\" for our wait and apologized that he hadn't brought out the biscuits yet. The biscuits never came, he must have forgotten about them. The manager came by and hand delivered our oysters and brought out a complementary side salad we didn't ask for. \n\nEverything was good up to this point, although, my wife didn't want a side salad since she ordered a salad for dinner. The hot chicken salad she had was incredibly spicy, too spicy for the average person. The dry aged steak was fatty and undercooked. At the end of the night, we got the bill and when we looked to see what our \"compensation\" was, nothing was taken off the bill. The side salad we didn't ask for was our \"compensation.\" There was no explanation from the waiter, no final apology for our long wait for the food, no acknowledgement that we were inconvenienced. \n\nIt gets a star for good drinks and atmosphere, but we were unhappy with our food and service experience."
  ]
 },
 {
  "name": "Kayne Prime Steakhouse",
  "address": "1103 McGavock St, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/910001a2-9332-11ea-89df-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "food",
   "delicious",
   "walking",
   "affordable",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=3468578607035259348",
  "source": "GoogleMaps",
  "reviews": [
   "Took my sister to Nashville for her birthday and the loved the city. Upon a recommendation from the Hotel Hutton we had her birthday dinner at Kayne Prime. We were sat promptly and not only was the staff great, but the service was EXCELLENT! A must try is the Popcorn and movie butter lobster bites. The steak was spot on and the birthday dessert that was complimentary to my sister was in her words AMAZING.",
   "Get the A5 Wagyu! Totally worth every penny. Getting that out there first. The progression of NY strip is also the way to go. Favorite side was the potato gratin, hands down. Service was exceptional from the host to the bartenders to our server (very knowledgeable and had the perfect recommendations). Every one of the staff made it a better experience than we expected. Easily our favorite dinner during our vacation in Nashville.",
   "The food is absolutely incredible. The service is top notch and the drinks are hand crafted. Very nice atmosphere even around the bar area. Finally got to try the Japanese A5 waygu and it was worth every penny!",
   "Took my friend to Nashville for her birthday and the loved the city. Upon a recommendation from the Hotel Hutton we had her birthday dinner at Kayne Prime. We were sat promptly and not only was the staff great, but the service was EXCELLENT! A must try is the Popcorn and movie butter lobster bites. The steak was spot on and the birthday dessert that was complimentary to my wife was in her words AMAZING.",
   "Service was phenomenal. Had a drink at the bar which has a fantastic view before we were seated. The steak was perfectly cooked to medium rare with a nice outside char. The wagyu filet was melt in your mouth delicious with an affordable price at around $60. There is a dress code so while you are enjoying dinner you don't have to see people walking by in shorts or hats. The service, food, and atmosphere makes the price of dining well worth it."
  ]
 },
 {
  "name": "Monell's At the Manor",
  "address": "1400 Murfreesboro Pike, Nashville, TN 37217, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/91445436-9332-11ea-af28-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "family",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1125099886339603403",
  "source": "GoogleMaps",
  "reviews": [
   "Food was amazing. Family style/home cook meal food. For first timers like myself, you pretty much sit down and they bring in tons of various southern dishes. Dinner is $22. I highly recommend yo go with family or friends.",
   "Great experience taking in true southern hospitality. The staff were all very friendly here and the food was excellent. We visited for brunch and the food was plentiful. We had a variety of southern comfort foods including fried chicken, corn pudding, cheesy grits, biscuits, cinnamon rolls, scrambled eggs, pancakes and many other delicious treats. Felt more like a local spot which we enjoyed. Food was great and is served family style. I usually do not enjoy this style but it was excellent and a great experience! Check it out while in Nashville.",
   "Sit down and make a friend. The hostess specifically tells you to turn your phone to silent. In a world where we are so concerned with our phones and not talking with people this place is a welcome breakfast spot. We were forced to have a conversation with some strangers that turned out to be very pleasant. The food was real home cooked goodness. We’ll be back here for sure.",
   "We were in TN visiting my daughter and son in law, they wanted to go somewhere special for my birthday. They made reservations at another restaurant, but I remembered going to Monell's years ago and so we changed out plans. Wasn't disappointed. The food was excellent and it just kept coming. So glad we chose this place. (A big of a ride from Clarksville, but well worth it.)",
   "Great southern food and lots of it. We visited with friends and chatted and ate for hours. The staff was very nice. The interior is beautiful."
  ]
 },
 {
  "name": "Pastaria",
  "address": "8 City Blvd, Nashville, TN 37209, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/919364b6-9332-11ea-9ad0-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=6717253363176468627",
  "source": "GoogleMaps",
  "reviews": [
   "This place is delicious!! Get everything on the menu because I have never had a bad meal here!! Great staff and quality food",
   "Excellent! Our waitress Kara was sweet and great. We sat at the bar by the pizza oven and made friends with Dustin. His fennel salami pizza is AWESOME. Almost worth moving for.",
   "The food is always very good and the place itself has a nice feel. But too often the service is not very inviting or professional. Servers seem too concerned with looking cool and casual than being nice, at least that's how it seemed to me. I felt very lonely, rather than welcomed, and I dine alone all the time where this isn't the feeling I get. They know their regulars, though. I did notice that.",
   "One of my favorite happy hours in town for my favorite wood brick oven pizzas and drinks. I love eating here and the pastas are delicious. Amazing Brussels sprouts too.",
   "Wow. Just wow. This place is INCREDIBLE. They had a calzone that was a temporary menu item and it was heavenly. The service was excellent (Nate was one of the best servers I've had in Nashville). I can't recommend it highly enough."
  ]
 },
 {
  "name": "Black Rabbit",
  "address": "218 3rd Ave N, Nashville, TN 37201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/91dde00a-9332-11ea-a660-14b31f159f22.png",
  "tags": [
   "tasting",
   "eat",
   "music",
   "comforting",
   "food",
   "comforting",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6598156990594838723",
  "source": "GoogleMaps",
  "reviews": [
   "This was our first visit to Black Rabbit & we both LOVED it. This place has a great vibe, great live music, & incredibly skilled bartenders/mixologists. We typically stick with our regular drinks, but we branched out & tried 4 different drinks while there, 2 of which were on their cocktail menu, & two of which we asked for them to invent right there in front of us after they asked what we liked & didn't enjoy tasting. It was so very impressive! I am quite choosy about my spirits & the folks their simply know what they're doing & they were absolutely killing it with their skills & their imagination. We enjoyed ourselves so much that we're already planning on going back in a few weeks. \n Unfortunately,  we did not eat there, since we had just visited there right after having dinner. We definitely will eat there next time b/c the rabbit rolls that my bar neighbor had looked & smelled outstanding. He kindly offered to give me a bite, but I was already stuffed from dinner. Next time,  I am going in hungry.",
   "Black Rabbit is always an awesome choice you will not be disappointed. Great place to meet coworkers after work and get buzzed on a Tuesday or a wonderful choice for dinner before a Printer's Alley burlesque show on a Saturday night like we did. The ambiance is great. The food and service are comforting and professional. Thank you for always providing a great experience",
   "Black Rabbit is always an awesome choice you will not be disappointed. Great place to meet coworkers after work and get buzzed on a Tuesday or a wonderful choice for dinner before a Printer's Alley burlesque show on a Saturday night like we did. The ambiance is great. The food and service are comforting and professional. Thank you for always providing a great experience",
   "Wonderfully cozy and intimate atmosphere off the beaten path of downtown. I loved the fireplace and the variety of seating options. There's seating available right by the stage - up close and personal. The live band on Saturday night was delightful. I didn't find the music too loud in this establishment as some reviewers mentioned. It's hard to converse while any band is playing live anywhere so it is to be expected. I will return again.",
   "Just to preface this, I went here as part of a corporate event so it's possible we didn't get the full experience. \n\nThat said, the decorations were interesting (frosted stripper mirror and top hat hanging lights) and the space was cozy. Comfortable couches, fireplace, lots of tables and standing areas near the bar.\n\nFood wise, I just wasn't impressed. The only thing I had that was above average was a slice of sour dough bread buttered with some flake salt. It was quite good. \n\nThe corn tostada had some hummus that had some zing not not really any taste I would go back for. The tortilla wraps had a pulled pork and shredded beef that was relatively bland even with hot sauce. Dessert was a slice of citrus pound cake. It had a decent glaze but still nothing to write home about. \n\nIf you're in the area and want a darker, upscale but cozy vibe with some friends, this might be a good spot for you. If you're just looking for good food, there is so much in the area, this probably won't be at the top of your list."
  ]
 },
 {
  "name": "Acme Feed & Seed",
  "address": "101 Broadway, Nashville, TN 37201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/922fd2d8-9332-11ea-9835-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "music",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7044471688452009327",
  "source": "GoogleMaps",
  "reviews": [
   "Acme was recommended to us by a local who said it was one of the better places along Broadway. We stopped in just for drinks, but decided to have lunch after being tempted by the sushi on the second floor. They have a nice craft beer selection. Sushi was tasty and fresh, but the wings we also ordered came out lukewarm. Service was great and quick. The lower level and rooftop area were both slammed with people. We were grateful that the second level was not nearly so busy. Would be a great place to come out for a party.",
   "Acme was recommended to us by a local who said it was one of the better places along Broadway. We stopped in just for drinks, but decided to have lunch after being tempted by the sushi on the second floor. They have a nice craft beer selection. Sushi was tasty and fresh, but the wings we also ordered came out lukewarm. Service was great and quick. The lower level and rooftop area were both slammed with people. We were grateful that the second level was not nearly so busy. Would be a great place to come out for a party.",
   "Nice simple consent. Order your food at the front entrance area, food runner runs food out to you. I wasn’t expecting much but the food was pretty good. Live music was a nice touch! So close to the Pedestrian bridge which offers a nice walk and view after your quick bite.",
   "Acme Feed & Seed is a great restaurant! I really enjoyed the live music; instead of just a typical loud country cover band, they had a really cool string band performing. Very good atmosphere, not too many drunk people in there (which is rare for Broadway!) and the food was simple but still great.",
   "Fantastic place, food was really good and service was great. they went above and beyond to take care of us even though they were super busy. Band was really good and we enjoyed their set. Second floor was a chilled jazz lounge and then we went on the roof for a great view of the river and the lights wonderful place."
  ]
 },
 {
  "name": "The Melting Pot",
  "address": "166 2nd Ave N ste a, Nashville, TN 37201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9279a9f6-9332-11ea-9def-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "delicious",
   "learn",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5868718001000996950",
  "source": "GoogleMaps",
  "reviews": [
   "Great for celebrations!\n\nMelting pot totally exceeded my expectations. We visited the Nashville location for a friend’s birthday, and I was blown away! The fondue broth for the meats & veggies was tasty and there was well enough food for everyone. The desert fondue flambé blew my mind & was so rich as well!! Service was fast & funny, I really appreciated the waiter’s suggestions about the area when he found out we were visiting from out of town. \n\nIt was a super smooth & memorable dinner, I’ll definitely be back!",
   "The food, the atmosphere were excellent. Made even more so by server Michelle. She took the time to explain the various choices, made great recommendations and was totally attentive to our every need. We cannot say enough how happy we are with our choice to dine at The Melting Pot. This is a place for a special dinner when you're not in a hurry. It is a wonderful experience! Lacy took care of us so well and was able to answer all our questions and make helpful recommendations.",
   "Our server was very friendly and helpful with the menu. We tried the grilled option for the first time for the main course and we loved it. We will order it again the next time we go! I ordered my favorite dessert fondue, the bananas foster, have had it before. The food, the atmosphere were excellent.  We definitely left full and satisfied.",
   "The food, the atmosphere were excellent. Made even more so by server Michelle. She took the time to explain the various choices, made great recommendations and was totally attentive to our every need. We cannot say enough how happy we are with our choice to dine at The Melting Pot. This is a place for a special dinner when you're not in a hurry. It is a wonderful experience! Lacy took care of us so well and was able to answer all our questions and make helpful recommendations.",
   "This was a wonderful experience. The waiter was professional, talkitive, enjoyed helping us learn the ways of the dinner. The food was AMAZING. Cheese fondue was awesome, salad was very good, and dinner was great. We especially liked the different sauces they give you to dip your meats in. Dessert was delicious as well, with lots of choices of things to dip in the chocolate you choose."
  ]
 },
 {
  "name": "Trattoria Il Mulino",
  "address": "144 5th Ave S, Nashville, TN 37203, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/92c2d99a-9332-11ea-bbeb-14b31f159f22.png",
  "tags": [
   "walk",
   "eat",
   "food",
   "food",
   "family",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3212241208059713192",
  "source": "GoogleMaps",
  "reviews": [
   "If I could give Byron & team 10 stars, I would!\n\nMy husband & I were in Nashville for our 4 year wedding anniversary. Side note: we did eat at a different location that, at the time of the reservation, we did share that it was our anniversary trip. This establishment did not acknowledge it at all. However, we chose Trattoria Il Mulino for our actual anniversary dinner and BOY did they deliver!\n\nThe space itself is beautiful, a bit darker, and more intimate but the service for the whole night was, in a word, exceptional. We knew we chose right when we were seated & found a hand-written card wishing us a Happy Anniversary & signed by the entire staff! Our server Byron was so charming, attentive, and humorous as were the other staff members who took care of us. The food was also fantastic (try the ricotta meatballs!) and as if the date could not get any better, Byron told my husband of a shortcut from the restaurant (through the glass doors by the bathroom) through the Hilton right next door, to the street, to the pedestrian bridge for a romantic walk and dance on the bridge by night. \n\nMy husband & I managed to have a *perfect date* and Trattoria Il Mulino, with it's wonderful service, food, & ambiance helped make it so. Thank you Byron & everyone working 7/24/2019--we look forward to seeing you again!",
   "The food was amazing!!!! The service was great and I really enjoyed the complimentary appetizer spread with fresh bread. You really feel welcome and are able to enjoy the evening. It's near all the action but yet just far enough away that you heat the for traffic. Must add the bathrooms are extremely clean (",
   "Wonderful meals!! Amazing allergy friendly options and the service was THE BEST and everyone was very polite! I ordered gluten free pasta (as shown below) and would highly recommend this dish to anyone, even without allergies. They also had plenty of options for another family member who is dairy and nut free. Overall one of the best restaurants I have ever been to!",
   "Outstanding restaurant.  The ambience is nice like others.  It is the service and the food that sets this restaurant above others.  The managers and servers work together making this restaurant exceptional.  Pasta is made on in the restaurant.  I highly recommend the lobster over pasta.  Wine selection is impressive with floor to ceiling wine rack as pictured.  Prices are appropriate to the quality of the food.  Try it.  We celebrated our anniversary and they gave us a nice card.",
   "Went on for a company dinner. Great options for vegetarians.  Descent cocktails, and good wine. The atmosphere is nice as well. Not sure if the prices, so make sure to check in advance."
  ]
 }
]