[
 {
  "name": "Oklahoma City National Memorial & Museum",
  "address": "620 N Harvey Ave, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/931a6fac-9332-11ea-961f-14b31f159f22.png",
  "tags": [
   "history",
   "walk",
   "history"
  ],
  "link": "https://maps.google.com/?cid=4635276338053722639",
  "source": "GoogleMaps",
  "reviews": [
   "This is a sad event that has been remembered to the fullest by the memorial and museum. The museum is a must to truly understand the impact of the damage, the incredible response, and heroism on multiple levels. I remember the quote by, I believe, the judge preceding over the final Nichols trial. He said something to the affect that this nation that you hate is strong enough and big enough to let you escape the death penalty. That was the second time for Nicholas according to the museum display. Definitely recommend a stop if in the area.",
   "Friendly, welcoming and helpful staff. Probably the best museum I've ever visited! Incredibly touching, beyond informative, and most of all, gives insight and understanding on the people of Oklahoma. Would love to come back for additional visits, in addition to the 4+ hours that I spent there. Absolutely agree that this is one of the \"Top 10 Museums in America\"!",
   "Never forget April 19, 1985. My husband worked on the 8th floor of the federal building. We love our MEMORIAL and all the people who came to help everyone, love the survivors and we remember those who were killed. We shall never forget. It truly is a beautiful place. What was once a place of horror and death is now a place of peace and remembrance. God bless Oklahoma City. ❤",
   "One of the better memorials we have visited. We spent about two hours there and could have stayed longer had we read every piece of available information. Interactive screens make learning more engaging for children & adults. The victims are respectfully honored here and visitors can expect complete information from the history of downtown OKC to the verdicts rendered. Having gone at 2PM on a Saturday, it was busy. I would recommend arriving in the morning on a weekend day!",
   "Such an incredible,  somber experience. The grounds are breathtaking. A beautiful memorial for the lives lost. The reflection pool and 9:01 and 9:03 towers are amazing. If you have the opportunity to walk through and see the history of this site, please do so. It's hard to walk the grounds without getting emotional."
  ]
 },
 {
  "name": "Myriad Botanical Gardens",
  "address": "301 W Reno Ave, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/93629c74-9332-11ea-b7e8-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "walk",
   "nature",
   "music"
  ],
  "link": "https://maps.google.com/?cid=10363530004578021372",
  "source": "GoogleMaps",
  "reviews": [
   "Stunningly beautiful and a family favorite! Fun areas for the dogs, the kids, and the adults! \n\nWe actually had our wedding ceremony and reception here because we love it so much! \n\nThe park is beautiful and the staff is passionate about their profession. The botanical gardens truly are one of the best things about downtown Oklahoma City. I highly recommend you check out the up coming events or just stop by for a stroll any time of the year!",
   "Nice area to go for an early morning run before people start showing up. It’s an oasis of plant life downtown.  Good place for landscaping inspiration.  Plants are labeled so it’s easy to get ideas for what to plant at home. The children’s area has some interesting educational exhibits and a fun play area as well.",
   "Pretty place to walk around, enjoy nature, take pictures and watch wildlife. We didn't go into the actual garden exhibit, but we did walk around outside and view the scenery. The outdoor theater is pretty neat, saw a show there once.",
   "I went to the light show here just before Christmas and it was absolutely lovely. The way they had it set up was amazing to see with the pretty lights, the atrium, and the music. I hadn't been inside it until then and being that it was my first time seeing all of that, it was definitely eye catching. I loved it. I was visiting the city and ended up finding that, and that definitely ended my night in the city perfectly.",
   "The main section of the garden in indoor and well maintained. The butterfly section has been moved outdoor and is seasonal. The tulip decorations were amazing, although few items like fish pond could have been better maintained. Overall, worth a visit."
  ]
 },
 {
  "name": "Oklahoma City Zoo",
  "address": "2000 Remington Pl, Oklahoma City, OK 73111, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/93ab658a-9332-11ea-8e49-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=5013321368135377402",
  "source": "GoogleMaps",
  "reviews": [
   "Love, love, love the zoo. The membership is reasonable and even a bonus with children!!  I only wish I could go more often. There’s always remarkable and beautiful renovations and additions, it’s always new yet my old favorites remain and keep getting better. You haven’t seen Oklahoma if you haven’t been to this zoo and botanical garden.",
   "We love the Zoo!! There are tons of animals, all in a comfortable space and taken care of. There are food options in multiple locations around the zoo and several areas for kids to play. My son loves to climb on the animal statues and have me take his picture. There's lots of greenery and maps posted everywhere. You can pay extra for things like camel rides, giraffe feeding, elephant shows, etc. There's also a tram for $6 I believe. And of course bathrooms and a gift shop. You can rent strollers as well. We have a family pass that lasts a year and we will be renewing it for next year as well.",
   "Second time here. Lorikeets are awesome. Zoo is making serious headway in a modernization effort. Everything is well maintained and clean. Staff were all very friendly and informative. There is something to see and do for all ages. Great playgrounds and picnic area when it's time for a break. Easy to see why it's one of the top ten in the country. We will come again.",
   "Amazing experience! We loved all the animals. The staff is very friendly and helpful. The park is clean, the restrooms are clean. A variety of foods, concessions, and souvenirs are available for decent prices. We love the photo booth pictures that are available several places around the park. The animals seem to be well taken care of, and the zoo keepers post notes on the exhibits if there are any medical concerns about the animals. There's also several different opportunities to feed or interact with the animals throughout the zoo.",
   "We can’t express how grateful we are for the Oklahoma City Zoo.  They have given my Son so many opportunities to grow and engage with beautiful world we live in.  The elephant experience is worth hike to see the whole gang, then stop by to see the rhinos!  The monkeys never disappoints.  And it’s always necessary to take the back route to see the giraffes.  The Oklahoma trail to by our favorite, to come up close and personal with so many wonderful creations!"
  ]
 },
 {
  "name": "45th Infantry Division Museum",
  "address": "2145 NE 36th St, Oklahoma City, OK 73111, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/93f9f1c0-9332-11ea-8d9d-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "history",
   "tour",
   "tour",
   "free",
   "history",
   "walk",
   "cheap",
   "free"
  ],
  "link": "https://maps.google.com/?cid=2703340389080433531",
  "source": "GoogleMaps",
  "reviews": [
   "It had a ton of cool exhibits and artifacts. The outdoor area was very cool with many different vehicles and artillery units. Our tour guide was very knowledgeable and had served in Vietnam.",
   "So many memories...so much History... SOo many beauty Boys and Up standing women. To be remembered here. \"Never for get those that made the way... So that you could be here today\"- T.I.",
   "On our way back from the Softball complex we stopped in to view the display of tanks, guns, and military vehicles. I am a Vietnam Veteran, and I got to see first had a lot of the equipment that was in use during my tour overseas. I enjoyed being able to go unclose to look at the various pieces of equipment. I really enjoyed being able to explain a lot of the equipment to my grandson. He's seen picture and film of the gear, but had not seem it up close. It is an impressive display. The grounds are well cared for, and the equipment is clean, presentable, with great explanation of what they items are. Good job.",
   "Free. Can't beat that. Lots of awesome history on display. Fascinating stuff. Go at your own pace or we ever had a volunteer take us on a bit of a tour as our guide. Highly recommend you visit.",
   "Amazing collection and knowledge of all the legendary wars going back to the civil war. Was fascinated with all the world war II axis and allied rifles machine guns metals uniforms etc, just amazing!\nFree to get in but please don't be cheap, donate a little something at the desk when you walk in keep this place up and running and these timeless pieces available for viewing"
  ]
 },
 {
  "name": "Museum of Osteology",
  "address": "10301 S Sunnylane Rd, Oklahoma City, OK 73160, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9441a982-9332-11ea-a905-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9091622308725140297",
  "source": "GoogleMaps",
  "reviews": [
   "I love the Museum of Osteology. For a small building, it is packed full of bones! They even display their bone cleaning process when you walk in. They provide a scavenger hunt for kids and multiple educational experiences. While I have yet to be able to cash in on one, I hope to do one soon. Great for kids, but also adults!",
   "I brought two kids here looking for an easy way to spend part of a day.  There was enough here to entertain a 3 year old and a 5 year old for quite a while.  They got a scavenger hunt paper to work on, the prize was some candy.  I enjoyed it as well.  It is a small building,  so it's not overwhelming.   I really enjoyed it.",
   "Such a neat, educational place! Always a fun trip! I really enjoying staying up to date with their social media. They always post really neat things!",
   "Very cool and informative. Loved seeing the morphological differences in the different  dog skull’s, but the hippo skeleton was probably my favorite. Definitely a place to check out of you are in to science or have kids.",
   "This place is amazing. I'm not even big into astrology and I had an absolute blast here. Also the gift shop is fairly price and of course the owl pellets are awesome."
  ]
 },
 {
  "name": "Science Museum Oklahoma",
  "address": "2020 Remington Pl, Oklahoma City, OK 73111, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9494367a-9332-11ea-8287-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=11678503685854338412",
  "source": "GoogleMaps",
  "reviews": [
   "I used to come here as a kid and love bringing my toddler here when we visit. There are so many types of exhibits for children (and adults) of all ages with different interests. Love that there is a separate toddler area with a door to keep them from getting run over by the older kids and there’s even a nursing room inside the toddler area. Great place to visit!",
   "Wonderful suggestion by the hotel staff. This place is huge and it has so much stuff for the kids to see and plenty of hands-on activities. The kids could have easily stayed all day. \n\nI also LOVED the cycling exhibit!",
   "I remember visiting the museum when I was a kid and having a blast. I met one of the employees recently (Barry) and he recommended I take my kids, I couldn't believe this was the same place, it's so much better now. My kids had a great time and we will definitely be back. I highly recommend the Science Museum to anyone.",
   "It's a spacious place to hang out with friends and do some cool ( and educational ) activities. I can imagine a family easily spending a whole day here. It's always nice to see when they bring in new interactive displays and update material. It's definitely worth a visit if you're in the area with a young family and looking for something to do.",
   "very very fun place for kids to go to. has all sorts of cool stuff kids could do. if their board this is the place to take  them. you wont regret taking them here. awsome place ! thanks ! - sunshine"
  ]
 },
 {
  "name": "Will Rogers Gardens",
  "address": "3400 NW 36th St, Oklahoma City, OK 73112, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/94e90fdc-9332-11ea-9cee-14b31f159f22.png",
  "tags": [
   "unique",
   "tour",
   "knowledgeable",
   "family",
   "nature",
   "walk",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7664107588336218919",
  "source": "GoogleMaps",
  "reviews": [
   "A charming utopia overflowing with botanical beauties. I popped into the cactus garden area on a whim. Then, after wandering for a bit, was invited to see the inner greenhouses. A very knowledgeable curator showed me their current projects. It felt like a unique private tour. I will be back to volunteer.",
   "Since leaving and now returning with to visit family in the Metro area, I am discovering all the wonderful things the north side of Oklahoma City has that I never knew about growing up here. This is another one of those. It is a wonderful little place to go for a stroll. The buildings were closed on the day we were there (Christmas Eve, they are closed all city holidays), but the outdoor spaces were nice on such a pleasant December day. I am sure it would be an amazing place in the spring.",
   "Beautiful place to go! Excellent for taking beautiful pictures! 📷 I really love to go here to observe nature and relax. Spring time is when most beautiful it is! It also has a flower garden named Iris Garden within the Will Rogers Garden. They are connected.",
   "Beautiful Gardens and fountains. Trail/sidewalks to walk. Laces to stop and sit to rest. Very nice",
   "We love going to this park to take pictures of our kids or just walk around. It is always lovely no matter what time of the year. I do wish they were open past 5 some days for when we are trying to take pictures."
  ]
 },
 {
  "name": "Oklahoma City Museum of Art",
  "address": "415 Couch Dr, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/953d239e-9332-11ea-8323-14b31f159f22.png",
  "tags": [
   "art",
   "free",
   "art",
   "cheap",
   "art",
   "organized",
   "art"
  ],
  "link": "https://maps.google.com/?cid=8893055763500774585",
  "source": "GoogleMaps",
  "reviews": [
   "I loved my day at the Museum today.  There is a wide range of different types of art;  Also, places where you can add your own artistic touch. I added some pictures to convey what I enjoyed most.",
   "I really enjoyed this museum. We went when they had the Great Depression era art which was somber yet deep and very enlightening. Also, this museum has a permanent installation of Dale Chihulys glass exhibit which was beautiful and not crowded at all when we went. The museum is a good size, only about 3 floors and you can get through it pretty quickly and efficiently. If you have a Bank of America credit card you get in for free.",
   "Loved the chihuly exhibit. Truly stunning! Inexpensive rates and the hallway is gorgeous. I am in love with the space and visit it every few months. Be sure to check the days before you make the trip though",
   "I loved the Chihuly Exhibition! A very easy to maneuver museum and it adheres to a variety of tastes in art, there is a little something for everybody! The pictures below are from the minimalism exhibition and the Chihuly \"Magic and Light\" exhibition. Very calm and quiet and the entire museum is very clean and organized with simplicity in mind. The arts are spaced in a strategic manner which allows you to really take in each peace without interference of another work. Pricing is cheap also and college students get a discount which is a plus!♡",
   "Great experience for my son and I. He is one little and young artist. He was amazed by all kinds of art we saw, from abstract to the art made by a simple pencil. \nWe love it."
  ]
 },
 {
  "name": "Will Rogers Park",
  "address": "3400 NW 36th St, Oklahoma City, OK 73112, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9580474a-9332-11ea-ae03-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walking",
   "walk",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=8759584489510296945",
  "source": "GoogleMaps",
  "reviews": [
   "I dont see any pictures here but there are \"fairy trees\" popping up all over the park. Adorable and great for kids to look for as they walk through the park. They have cute colorful tiny doors on various trees, down low and higher up on the tree. Some have windows or steps. Kids love it!.. Great job ! To who ever is in charge of creating this project.",
   "I spent time inside the pavilion the greenhouse pavilion. every year we have a Valentine's party in there and that part is nice. the park is nice as well in the spring but sometimes it can get a little raunchy with all the geese there that just makes messes. and then sometimes the summer months make the flowers look dead and I think they just need to be watered a little better. But overall I think it's a nice park.",
   "This place is so beautiful! 🙌 The natural landscape is great for pictures. I actually had a first date here and loved it so much I started walking my dog here.",
   "The daffodils and crocuses are blooming in early spring, so the gardens are beautiful.  The park is well maintained. My favorite part of my visit was finding the little fairy houses and doors throughout the park!",
   "Such a beautiful park! I had no idea of all its beauty. A great stop for a relaxing and tranquil walk in nature. An immersive escape from the hustle bustle of your day to day...\nSome of my photography below...hope you enjoy this virtual and photographic journey...😎📸"
  ]
 },
 {
  "name": "Centennial Land Run Monument",
  "address": "200 Centennial Ave, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/95cf03b6-9332-11ea-9d2b-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "walking",
   "family"
  ],
  "link": "https://maps.google.com/?cid=18279960551545149272",
  "source": "GoogleMaps",
  "reviews": [
   "Really neat monument with some interesting history information scattered throughout the walking path to provide context. I would recommend taking time to walk the river path and stop by the monument.",
   "The statues are just beautiful. There are quite a few of them. Brings back the old west.",
   "What an awesomely extraordinarily Beautiful Family experience. U know U can't imagine how Large and Exceptional the Quality of these Bronze Statues are until you are in their Presence. What Beautiful craftsmanship and true to Life they are. WOW I mean WOW. Thanks Oklahoma city for the Maps project. Finally a GREAT place for BOTH Family and friends. Shalom SHABBAT",
   "Life like portrayal of the land run. Beautiful work by the artist.",
   "There are 45 larger-than-life bronze sculptures that capture the moment just after the starting gun fired signaling the opening of the Oklahoma Territory. Frozen in time are the images of frenzied citizens rushing to claim land as a wagon dropped it's load, a rider on horseback stumbles, dogs race to catch up, hats fly, rabbits scurry to get out of the way, carriages race to catch up, horses balk at the a water crossing, etc... This beautiful sculpture wonderfully catches the motion and chaos that ensued that day. It's a great place to chat with a friend and wonder about the back stories of those who participated that day. We spent and hour here and I could have used about 20 minutes longer. It's really worth seeing."
  ]
 },
 {
  "name": "Frontier City Theme Park",
  "address": "11501 N I- 35 Service Rd, Oklahoma City, OK 73131, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/961582de-9332-11ea-b7fa-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "parks",
   "kids",
   "eat",
   "family",
   "food",
   "parks",
   "drink",
   "kids",
   "free",
   "kids",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7374031908058551867",
  "source": "GoogleMaps",
  "reviews": [
   "It's a really fun little park. It's very small as far as theme parks go. Pretty sure there is price gouging going on here. I understand it's a theme park and high prices are to be expected, but it's taken to a new extreme here. The service you get is minimal. Most employees in the food service parts are very rude. Just be prepared for that. Definitely eat before hand, you'll save at least 40 to 70 dollars depending on your family. The rides are a lot of fun, they have various sorts of small coasters to ride on, and plenty of things to do for the younger kids. It has a western theme that is really neat to experience. Overall a fun little place to go and spend the day with your family. Just make sure your have enough money to pay for food if you plan to eat there.",
   "This is a great place to introduce kids to rides! The main rides aren't as thrilling as others I've rode in the past, but they are fair and since my kids like them; we can ride together.  I prefer other Six Flags parks myself, but since they've recently purchased this park I hope they introduce new, more thrilling rides. \n\nThis park has a great children's area with better than par children's rides, a massive playground city, and a huge water area for everyone to splash around and cool off in the summer.\n\nThe food in the park is what you'd expect from a theme park. They seem to have a few better options than other parks I've visited -   loaded brisket french fries, for example.  Super salty, but very good until you can't bare the salt anymore. Burgers, pizza, corn dogs, and chicken tenders are the norm otherwise.  I recommend the meal plan if you intend to visit more than once. It pays for itself quickly.  If you upgrade to deluxe, you get a refillable drink bottle good for the entire year. Even when most of the food places have been closed in the past, the lines weren't too long so it wasn't inconvenient.  \n\nThe park is always clean which is a contrast to the park in Arlington (even though Arlington has better rides).  I recommend this park for a fun day with the family. Season passes for those who live nearby will prove advantageous for something to do on the weekends, evenings, or when they host concerts.  The best part is they're good for all Six Flags parks.",
   "This place is a lot of fun. To get the best parking and to get to the rides quickly, it is best to go when they first open.\nIf you buy your season tickets and meal passes when they start running their end of season specials, you can save a bunch of money. \nThis year the specials were for the rest of 2019 and all of 2020. We went enough this year to more than cover what everything combined cost so next year is going to no added cost. \nBTW, the end of season specials also included free parking so that alone is $20 a trip",
   "The price is high (for what is offered), but overall a nice place. Since Six Flags bought the park, the season tickets are much more valuable in my opinion. \n\nThe festivals (Holiday in the park, Haunt the Park) arr great times to take kids since the park is just do lit up and festive. \n\nWithout a season pass, it is harder to recommend. But if you are going to go, just buy a season pass since it is only like $30 for the season ticket.",
   "We had a really enjoyable time with all the Christmas decorations. Didn't have to wait too long in most lines. Some of the rides were down, but there were plenty open. The food is super expensive here, so eat before you go."
  ]
 },
 {
  "name": "Bricktown Water Taxi",
  "address": "111 S Mickey Mantle Dr, Oklahoma City, OK 73104, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/966e5164-9332-11ea-8b06-14b31f159f22.png",
  "tags": [
   "walk",
   "tour",
   "knowledgeable",
   "tour",
   "history",
   "walk",
   "family",
   "knowledgeable",
   "history",
   "tour",
   "eat",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=15867250462326680403",
  "source": "GoogleMaps",
  "reviews": [
   "We were a little skeptical about this tour because of the mixed reviews, but I am glad we did it. The taxi and clean and comfortable, the river walk is nice. Our tour guide Penny was so kind and funny. She explained a lot of historical facts about the city and the river walk. The horse statues were impressive. I will recommend to do it around 5pm so you will see everything and also the lights that go all over the river. \nIt was a 45 minutes tour. This is a must do I. Oklahoma City.",
   "Wonderful experience and a fair price.  I was so favorably impressed with the Bricktown Canal and all the beautiful scenery, birds, restaurants, hotels and businesses in the Bricktown, Oklahoma City area.  The Bricktown Water Taxi is THE way to take it all in and enjoy the beautiful surroundings.\nThe quality of the tour guides varies with some being very knowledgeable about the history of Oklahoma, the Oklahoma City downtown and Bricktown itself while some \"boat captains\" are obviously rather new to the area and still learning.  But nevertheless, I highly recommend the Bricktown Water Taxi.",
   "Our family enjoyed getting on the water taxi and hearing a little of OKC's history.  The tour guides are very knowledgeable about their city.  Some of them are also very funny.  You can take the whole ride and listen to the tour.  You can also get off at any stop along the way.  Your ticket is good for the whole day.   You can buy them via the mobile AP or at a ticker booth. There are numerous places to eat along the canal.  There is also an arcade and a mini golf course.  This is a great way to see the canal without having to walk all of it.",
   "A very cool canal ride through Bricktown.  The 45 minute ride is narrated.  Expect details descriptions of murals, sculpture, construction of the canal, history of the area/canal and information about all the restaurants and establishments you pass.  Enjoyable and educational.  Fare is reasonable and is good all day.",
   "Gave me a San Antonio feel. Tour guide was great. We were able to take really nice pictures along the route. Just wished it was a little longer."
  ]
 },
 {
  "name": "Wheeler Ferris Wheel",
  "address": "1701 S Western Ave, Oklahoma City, OK 73109, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/96c37680-9332-11ea-91cf-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=17884200248491719821",
  "source": "GoogleMaps",
  "reviews": [
   "The Ferris wheel is pretty cool. This is probably the coolest thing at Wheeler park. \n\nThe views are cool. You can sit at least 4 people in a bucket, so this is fun to do with another person or a couple extra people. \n\nI think going on the Ferris wheel is worth doing at least once. Try to go during a good time for views like sunset. This is a decent spot for part of a date. \n\nThis is worth checking out at least once.",
   "I read all reviews on it before visiting this place last week and many of them told its best to visit during night.well, its good little place for kids and adults to enjoy,with play area and swings. Only issue was, the place is at a remote location and the entrance road is very narrow with no lights in the parking area which creeps you out..! I wish we would have visited during day time.",
   "The weather was perfect and it was just a really great experience. I Donely six dollars for a ride and $20 for a season pass, it’s a really great value too. The employees are super sweet and it is dog friendly, even on the Ferris wheel. It was absolutely wonderful. It was a little busy, so I will come back again and see if I can’t get into one of those hammocks.",
   "love this place kids friendly we had alot of fun. love the ferris wheel you can see all okc through.. highly recommended",
   "Hosting large events at Wheeler Park is a great idea. There is plenty of parking, the view is great, and it's so close to the walking and riding path by the canal. I was there for the American Cancer Society event and it was the perfect venue."
  ]
 },
 {
  "name": "Oklahoma History Center",
  "address": "800 Nazih Zuhdi Dr, Oklahoma City, OK 73105, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/970588b0-9332-11ea-a9e1-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "kids",
   "family",
   "history",
   "free",
   "kids",
   "walking",
   "tour",
   "organized",
   "history",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=9204641149663086976",
  "source": "GoogleMaps",
  "reviews": [
   "So much to learn here! It's set up in such a way that it shows history as more than just facts and figures but as a relevant story. And the story is about the state as whole throughout decades and centuries. It includes the different cultures of Oklahoma as well with the Native American exhibits, the vintage kitchen, the horse-drawn carriages, the television displays, and even a Sonic display. I thought it was really neat being able to learn about things about towns I've grown up in and traveled to. It's definitely worth a visit.",
   "Thoroughly impressed. Under $20 for a family of 7! We stayed having fun and learning for over 3 hrs!! Great for kids with lots of hands on learning. Even a small gift shop.",
   "Okay, here's a free trick, as you enter the center there are two feedback portals on either side, be sure to give the feedback after you finish the tour and Before you get into the gift shop, you get discounts upto 10% 😉 You're welcome! Now the Center itself is Extensive and Beautiful. Book a Whole Day! Take the Kids definitely. There is so much for them to do with the Center's \"Hands in History\" initiative! I was tired from walking around the Indoor exhibits only! And then there's Outdoor exhibits. You donot want to miss this one. The Gift has such beautiful items, Do get yourself a Dreamcatcher! Or the Chiming Hearts!",
   "The Museum is large, and has several galleries to explore on a few floors. The Exhibits are fantastic. Everything is laid out and organized well. In some rooms, there was too much stuff, but we did come out learning quite a bit about Oklahoma. We enjoyed the quick glimpses and the overview in all the rooms, but we particularly liked the exhibits devoted to OKC’s commercial history, the Vietnam War and the local soldiers, the 39 Tribal Native American Tribes, the Steamboat “Heroine”, and the oil and gas industries. The airplane “Winnie Mae” and the Helicopter hanging on the ceilings were intriguing.",
   "I had fun visiting this place. My favorite part of the museum was Tribes. The staff was very friendly and everything was clean and organized."
  ]
 },
 {
  "name": "21c Museum Hotel Oklahoma City",
  "address": "900 W Main St, Oklahoma City, OK 73106, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/97415988-9332-11ea-afef-14b31f159f22.png",
  "tags": [
   "unique",
   "free",
   "tour",
   "art",
   "unique",
   "free",
   "food",
   "walking",
   "free",
   "art"
  ],
  "link": "https://maps.google.com/?cid=17065123194900493200",
  "source": "GoogleMaps",
  "reviews": [
   "What an amazing place this is! It is such a gem that needs to be shared. The bottom floor is a FREE museum that had amazing art. The tour by the art director was phenomenal - I would highly recommend doing it! \nOur room was incredible. Because it's an old manufacturing plant, there are windows everywhere and the natural light is wonderful, especially as we had a corner room. It has such unique and thoughtful aspects throughout, such as carpets that resemble tire tracks (a nod to Ford building cars there) & the faucet handles are the same design as Model-T steering wheels! \nThe staff was INCREDIBLE during our stay! There was a little hiccup but they more than compensated us for our trouble, which wasn't really trouble at all!\nIt's a bit in the pricey side but it's not just a place to sleep at night. You get an incredible experience. So if that's what you're looking for, this is it! I can't wait to return in the future!",
   "I had really high hopes for staying here, but it really was just okay. Yes the hotel is very cool, modern and artsy, but was it worth the price? Probably not. We had a pillow in our room that was noticeably dirty like actual mud looking spots. Had we noticed this before coming back to our room close to 1 am we probably would have requested a new room, but it was Valentines Day and we were tired. That pillow was moved to the floor. The bed and remaining pillows were less then comfortable compared to all the other hotels we have stayed at. It was a fun experience but we wouldn't stay there again. Also - I should have said something to the staff about the room being dirty when we saw or checked out, but I don't like confrontation.  =/",
   "A wonderful experience! The hotel is unique I'm that the first floor is a museum with rooms on the other 3 floors. We stayed in a corner suite for Valentine's Day and our room was fantastic and reminiscent of an apartment in NYC. We received a free voucher for breakfast in bed the following morning which was also very good. Excellent service and a great location to walking distance of several bars and restaurants including Joey's Pizzeria which had outstanding Italian food!",
   "Love Love Love this place!!! If you've never been to a 21C hotel, put it on your list. This is a diamond in the rough. From the moment you arrive, you are greeted curb side by the valet crew lead by Simon and Caleb who go out of there way to make sure you have anything you need to make your stay enjoyable. Hotel has a free shuttle that will take you anywhere in the downtown area and pick you up when you're done. \nThe Building is an old Ford assembly plant from the turn of the century that has been painstakingly preserved to capture the essence of the era. First floor encompasses a top notch restaurant and full service bar and the remainder floor space is the 21st Century Art Museum. \nThe next three floors house the 135 rooms that range from double queen to a variety of King Studios all the way to 2 bedroom Suites.\nThe rooms are enormous with ceilings that exceed 15 feet.You will not be disappointed by the size of the rooms.\nThere are currently 11,  21C hotels in the works throughout the states so be sure to check there website and find one near you.\nOklahoma City is an up and coming city that young millennials are flocking too. Great new restaurants abound and micro pubs popping up everywhere. If you are looking for a place to live or just passing through town, put this must stay on your list.",
   "Outstanding! I loved this hotel!! The artwork was phenomenal and our rooms were very nice and roomy!! The customer service was also above expectations. We ate and indulged in adult beverages that were impressive! You will not be disappointed!"
  ]
 },
 {
  "name": "National Cowboy & Western Heritage Museum",
  "address": "1700 NE 63rd St, Oklahoma City, OK 73111, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/97823326-9332-11ea-8b13-14b31f159f22.png",
  "tags": [
   "learn",
   "knowledgeable",
   "history",
   "tour",
   "art",
   "walk",
   "kids",
   "tour",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=4849781199640138445",
  "source": "GoogleMaps",
  "reviews": [
   "This is really a wonderful place to go. There is so much history here of our nation. And what better place to have it than in Oklahoma! Our tour guide was very friendly and knowledgeable. The art there is really something to behold. I have very little interest normally in art but this was different. It really was great. Such wonderful scenery in the paintings. Besides art there is so much about the west here as well. It’s basically an untold story of cowboys and the west and the museum does a perfect job of explaining that history. Definitely a place to take your out-of-town friends and even go yourself if you’re a local. Guaranteed, you will learn something new.",
   "Woody, Jessie and Bullseye were riding a stage in the first hallway. This is a great place to take kids. Teach them our recent past and they will be better equipped to build the future. Sit in a stagecoach, walk the boardwalks in an old west TOWN! They are adding on! It is only going to get better. If you haven't been, shame on you. It is an Oklahoma jewel.",
   "Would Highly recommend.  This was one of the best Museum's I have ever been to.  This Museum is HUGE and has an outside area to view as well as inside.  This place is so huge you can definitely get lost.  You will definitely need to set aside about 2 hours as there is so much to see.",
   "Lots of History and exhibits inside.  Spacious atmosphere.   You can take a tour or go off on your own, which we did.  We loved the self pace of it.  A Beautiful place to visit.",
   "This is a great museum. There were very impressive exhibits in here. I liked one on the Western movie posters throughout history. Film highly interests me and seeing how the posters evolved over time allowed me to feel like I was involved with the history for having seen some of the films.\n\nMy other favorite part was the Western town recreated in immersive details. If you’re thinking about going here, go! I saw a lot of things I didn’t even know I wanted to see."
  ]
 },
 {
  "name": "Crystal Bridge",
  "address": "301 W Reno Ave, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/97d66df6-9332-11ea-9993-14b31f159f22.png",
  "tags": [
   "free",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=13567845653920207189",
  "source": "GoogleMaps",
  "reviews": [
   "Was hoping there would be more to see around the bridge building itself, but they had plenty of neat plants to see and signs telling you about many of them. Steps take you under a waterfall and up to a elevated walkway with even more plants to see. Pricey to visit here, but it was nice.",
   "The Crystal Bridge at Myriad Gardens in Oklahoma City is a great place to warm up on a cold, dreary day.  Especially if you like tropical plants and waterfalls.  Although most of the areas are easily accessible, climbing stairs will give you a better view of the interior of the building.  Outdoor grounds are free but there is a fee for the indoor gardens.",
   "Great place for photos. Several other people in the exhibit at the same time. Lots of neat flowers and botanicals.\n\nFront desk staff was super friendly. \n Cost was $17 + for 2 adults\nOnly bummer was the elevator was out...but I didn't mind taking the stairs. (Calorie burner)\n\nBathrooms had changing station - awesomeness!!!\n\n Very clean and picked up rain forest. \n\nStaff was friendly!\n\nKeep up the good work.\n\nRespectfully,\nBryan\nYukon, Oklahoma",
   "Very nice place to visit. The price is a little high if you aren't going to be there long, but the experience is quite pleasant. Nice to walk amongst so many levels of flora. Not wheelchair/stroller accessible, though there is an elevator with limited accessibility. Would recommend.",
   "Well worth the time and price. One of my favorite things we did when we traveled to OKC."
  ]
 },
 {
  "name": "Riversport Adventures",
  "address": "800 Riversport Dr, Oklahoma City, OK 73129, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/98210b9a-9332-11ea-b709-14b31f159f22.png",
  "tags": [
   "family",
   "knowledgeable",
   "tour",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=67775759065489666",
  "source": "GoogleMaps",
  "reviews": [
   "Love, love. First time we did all the land adventures. Excellent chalkenges for the whole family, all ages, skill levels and sense of adventures!  Second visit did all the water. Rafting was excellent, guides were friendly, amazing and fun! Great for the whole family and all ages! Definitely will be back for years to come!",
   "The skipper was awesome and was interactive with my young 4 and 1 year old and was knowledgeable of the area as he was giving a tour. The deckhand, not so much (glasses and shaved head). He was very creepy and was on his phone the entire time. I could tell he did not like kids and even shut the door on them. The experience was great though, we still had a great time.",
   "The facility itself is amazing. Hoping management can make some changes for a fun and helpful staff and to make a way for things not to be closed down all the time. Be sure to call ahead before you buy a day pass because there could be a lot of things shut down. A friendly and excited staff would be a great change for this place! It has the potential to  truly be an OKC gem.",
   "The whitewater rafting is awesome. Our guide Ricky was upbeat and made sure we had a great time. The zip line, however, took forever. It took over 2 hours. The food is expensive but that was expected. Definitely plan on renting a locker. Fun to go one time to experience it.",
   "You know when you see this place from the highway it looks cool but when you get there and see it all up and close it's more than amazing. There's so many things to do so many activities great place for families"
  ]
 },
 {
  "name": "Orr Family Farm",
  "address": "14400 S Western Ave, Oklahoma City, OK 73170, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/986763b6-9332-11ea-879f-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "family",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=4420107481637178731",
  "source": "GoogleMaps",
  "reviews": [
   "A great place to be a big kid or play with your little ones. Lots of fun outdoor activities including tricycle racing balloon bouncing and painting for crystals. Petting zoo with goats and sheep. Feed cups for only $1 a piece. \nmy only complaint is that there was no attendance at the tricycle racing and there were a lot of abandoned bikes out on the track. as much as we spent to get in the door you think they'd be able to afford someone to keep up with that.",
   "My kiddo loves coming here.  It's a must fall family tradition.  Lots of great fun, and photo opportunities.  Even when it's very busy it never feels overly crowded and there is so much to do that you are never just standing around waiting.  Almost everything is included in the admission price, and the add-on prices are very nominal.",
   "We took our grandsons to enjoy the beautiful fall day. We had never been here before, but had heard a lot of wonderful things, so finally got the chance to try it and we had a wonderful time. The price is very reasonable for what you get and our eight year old grandson had a wonderful time and was completely worn out by the time we made it home. He enjoyed the carousel, the train, playing all of the various activities that they have. The park is really in great condition and the staff is very friendly and helpful. Would highly recommend for a day with the kids! We will be back when they are here for a visit again!!!",
   "So much fun! We went and despite the poor weather there was so much fun to be had. Everyone was really friendly and my daughter had a great time. If you haven't been. Orr family farm is a must visit.",
   "Great Place for a Fun Family Day! Lots to do for kids and adults alike!"
  ]
 },
 {
  "name": "American Banjo Museum",
  "address": "9 E Sheridan Ave, Oklahoma City, OK 73104, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/98bef9a8-9332-11ea-ae63-14b31f159f22.png",
  "tags": [
   "history",
   "art",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13599348543735893275",
  "source": "GoogleMaps",
  "reviews": [
   "A lot of fun. Great history. Amazing craftsmanship on some of these banjos. We had fun timing through there. Military discount! Pretty good gift shop where you can even buy a quality starter banjo and books. Great location near Bricktown. Definitely recommended.",
   "Took advantage of the Smithsonian Day to finally see this well-presented display. We are not musicians, but it was enlightening to see the history and development of the instrument showing its changing role in American culture. So many of the banjos displayed are works of art in themselves. Beautiful. The text actually enriches the understanding of what is seen and the videos and sound bring the museum to life. Glad we got to see the Jim Henson exhibit and the Jim Bollman Collection, as well. Just an overall great afternoon.",
   "awesome musuem! loved learning about banjos and I got to see the amazing craftmanship of these instruements...",
   "Fun history and some neat banjos.  Their traveling exhibits were fun.  I wish they had more ways to hear and see famous performances listen to examples etc.  There were a few QR codes but not every one has a phone QR code reader or knows how to use one.",
   "Great and informative. Much to read and many, many banjos. Great place to pass the time."
  ]
 },
 {
  "name": "Oklahoma Firefighters Museum",
  "address": "2716 NE 50th St, Oklahoma City, OK 73111, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/99032edc-9332-11ea-8240-14b31f159f22.png",
  "tags": [
   "historic",
   "organized",
   "knowledgeable",
   "free",
   "kids",
   "history",
   "knowledgeable",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=11054332177086469262",
  "source": "GoogleMaps",
  "reviews": [
   "Great little Museum.  Would highly recommend to see.  Was not busy and had plenty ofnitems to see and loved the outside Memorial.  Does cost $6 to enter the inside Museum but is well worth it",
   "Great museum! I’ve driven by for years but I had never been in before, glad I finally stopped to look inside. Wonderful collection of patches from fire departments from all over the world, nicely organized. Beautifully restored historic fire engines & other memorabilia 👩‍🚒 🚒 . I enjoyed my visit 👍🏻",
   "This was a great place to visit!  The price was reasonable and the visit was well worth it.  The docent was very knowledgeable and seemed to enjoy talking about different things in the museum and answering questions.\n\nMy 11 year old daughter loved it, my 9 and 7 year old daughters had more fun playing on the playground.  While we were there we saw a couple of younger kids that were thrilled seeing all the older fire trucks inside!\n\nThere is a memorial, small playground and a couple of old fire trucks outside that is free to see.",
   "Cool little museum to visit with lots of history. The guy working the counter wasn’t very helpful, but I enjoyed the experience!",
   "This hidden gem near the zoo is full of information, everyone was so kind and helpful as well as VERY knowledgeable! Admission is inexpensive and there is a playground out front for the kids. Great way to spend some time learning and playing."
  ]
 },
 {
  "name": "Paseo Arts District",
  "address": "3022 Paseo, Oklahoma City, OK 73103, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/994e9002-9332-11ea-9e2f-14b31f159f22.png",
  "tags": [
   "art",
   "food",
   "unique",
   "art",
   "music",
   "walk",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=15221160838904738290",
  "source": "GoogleMaps",
  "reviews": [
   "This place is hopping on First Friday. Some food and other services limited due to crowds. Many or maybe all Art Galleries open. Street performances and vendors. Parking is at a premium. Suggest bicycle or ride share services",
   "There are a ton of doggy friendly businesses in Paseo, it was fantastic. My little Bat-Dog (Buster) and I had a blast going around the different places and everyone being so friendly to all of the dogs around. 10/10.",
   "Great place to go for quality live performances, shop custom creations & enjoy unique cuisine.",
   "We were in the area for the Arts Festival and had an amazing time. We loved the booths, the live music, the outdoor art, and the permanent shops. Looking forward to returning during non-fest time to try out some of the restaurants and definitely want to return to Literati Press Book Shop where we picked up some new reads.",
   "Great place to walk around when you don’t want to sit home. Lots of cute shops and places to eat."
  ]
 },
 {
  "name": "Earlywine Park",
  "address": "3101 SW 119th St, Oklahoma City, OK 73170, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/99ac8ecc-9332-11ea-bcd0-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walking",
   "walking",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11488186801211006766",
  "source": "GoogleMaps",
  "reviews": [
   "The park is well maintained and has plenty of space for activities.  There are tennis courts and soccer fields along with a 1.5 mile track around the park.  There are playgrounds and even a water park, which is open during the summer months only.  There is also an facility that houses a gym.  This is a very nice park that is utilized by people from all age groups.",
   "Earlywine Park is a nice place to be able to go if you want to bring the kids to enjoy the playgrounds, or if you want to enjoy the mile and a half property sized walk track. There's also the miniature water park with a few automated slides and the local YMCA. It's an enjoyable place to go",
   "The 6 lane pool is perfect for laps, walking, or deep water exercise. I like the showers with curtains and a bench in each stall, spacious locker room and bathrooms, plus clean towels. Lots of options for exercise classes and an updated gym area.",
   "Nice park with a paved walking path which indicates the distance you’ve gone.. it’s a fairly small park, but has a nice playground area, lots of shade trees, a picnic shelter. The downside is the limited green space. There’s a swimming pool though.",
   "As a family we love this place.  We live in Mustang and wish it was closer. There is a nice track, many fields for soccer, football, baseball, frisbee, whatever needs wide open spaces.  We have used the YMCA that is in the middle of the park and we love that place as well.  They have put on a US Triathalon Assoc. Youth swim and sprint event that our kids participated in and really enjoyed. The only main complaint or suggestion that we would have for the park is: MORE/BETTER restrooms!!"
  ]
 },
 {
  "name": "Martin Park Nature Center",
  "address": "5000 W Memorial Rd, Oklahoma City, OK 73142, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/99fea6b4-9332-11ea-9bc2-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "walking",
   "parks",
   "nature",
   "nature",
   "kids",
   "nature",
   "kids",
   "pets"
  ],
  "link": "https://maps.google.com/?cid=9715724291787303274",
  "source": "GoogleMaps",
  "reviews": [
   "Super fun with family and kids. They have a kids playground and lots of trails. I wouldn't run here and it's not stroller friendly but my 2 & 4 year old love walking around. The route are easily made shorter for kids. Make sure you wear bug repellent especially for ticks. There is a visiting center with lots to do. They have a story time every week. It's also fun to go for a day date or just walking alone.",
   "The perfect little oasis in the suburbs!  This parks gives you a  tastes of everything nature could offer.  An incredible park, with activities for all ages. And a Beautiful trail that allows for you to explore and enjoy your surroundings!",
   "Small wildlife ecosystem which is sweet and simple, very pure and has good nature spots. Best time to visit is in the morning around sunrise to avoid crowds and enjoy wildlife. It has lots of deers, armadillos.and many bird species which can easily be sighted during dawn/dusk.",
   "It's an AWESOME Place! Me and the kids where one with nature. We saw all sorts of critters , fish (tons) and birds all around us. COMPLETELY SUBMERGED IN NATURE AND LESS THAN A MILE FROM MERCY HOSPITAL... UNBELIEVABLE!!! YOU HAVE TO SEE THIS PLACE. 😃",
   "An absolutely beautiful park with trails in N OKC. A small visitor's center with some cool exhibits and a playground for kids. The trails are well marked and easy to navigate. Several bird watching areas and so many beautiful water spots. I highly recommend. No pets allowed."
  ]
 },
 {
  "name": "Harn Homestead",
  "address": "1721 N Lincoln Blvd, Oklahoma City, OK 73105, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9a5664ba-9332-11ea-9af2-14b31f159f22.png",
  "tags": [
   "family",
   "field",
   "knowledgeable",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3301123276952546558",
  "source": "GoogleMaps",
  "reviews": [
   "The entire property is very large. It consists of a few homes, a large Barn, a pretty gazebo, a small school, and several beautiful metal sculptures scattered all around. We walked around and found everything very interesting – the original buildings, the furnishings, the artifacts, clear labeling, and informative placards. We were also impressed by the efforts of the Oklahoma City Historical Preservation Commission to preserve everything as nicely as possible.",
   "Very lovely place to step back into time! I remember coming here as a child on a field trip and now as an adult with my homeschooled children. Very friendly staff. Knowledgeable on their history of the Harn family and the plantation. Recommend this for anyone. (Involves a lot of walking.)",
   "Beautiful venue in the heart of OKC! Very picturesque and rustic. We attended my brother in law's memorial here and it was the perfect place to have a celebration of life party.",
   "Wonderful. Many buildings were closed for the land run. I would like to go back when they are open as well.",
   "Not much of a museum but several interesting and hands-on exhibits of 89er time. Well worth a stop."
  ]
 },
 {
  "name": "Stockyards City Main Street",
  "address": "1305 S Agnew Ave #2427, Oklahoma City, OK 73108, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9aaebd26-9332-11ea-8150-14b31f159f22.png",
  "tags": [
   "free",
   "eat",
   "walking",
   "family"
  ],
  "link": "https://maps.google.com/?cid=13526817862722862240",
  "source": "GoogleMaps",
  "reviews": [
   "Stockyards Stampede Saturday October 20th, 2018. What a great event it was started off with stampeded through Main Street, awesome gun fights on streets, free foods and many cowboys on horse and guitar singers to entertain spectators. Good restaurants and Western wears to eat and shop while you wait in between events.",
   "Visited several businesses and all the staff we came in contact was friendly and courteous.",
   "It's a fun place, but I'd be careful at night walking alone.",
   "What family friendly fun! Who doesn't love a Christmas parade that kicks off with Oklahoma long horn steer?!?!",
   "Not sure what the problem is here, but the business folks are not friendly, in general. Sure, I'm sure some of them will smile at you on occasion, but on my last visit to this neighborhood, I couldn't tell if I was welcome at these establishments or not."
  ]
 },
 {
  "name": "Oklahoma Railway Museum",
  "address": "3400 NE Grand Blvd, Oklahoma City, OK 73111, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9aeeac86-9332-11ea-b2da-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "kids",
   "family",
   "free"
  ],
  "link": "https://maps.google.com/?cid=15454060272610611984",
  "source": "GoogleMaps",
  "reviews": [
   "We took our kids on \"The Polar Express\" over Christmas.  My 11 and 8 year old absolutely loved it.  My 15 year old liked it more than he would let on.  It's an expensive event but very memorable.   The museum itself looked very interesting with lots of old equipment and memorabilia.   Hope to travel back there this summer and see all they offer during the regular season",
   "I liked it but most of the train cars were locked so couldn’t go in them but I’ll probably go back when the weather warms hope so hopefully they’ll be open then. \n\nGreat collection of trains & looks like they have train cars you can rent for Birthday Parties & special events so that’s pretty neat if you know a train enthusiast. Admission to the museum was free but looks like they have events at other times that have ticket prices attached to them. I’ll try again later  in the year when you can ride one of their trains. Still a fun place to check out on an afternoon 👍🏻🚂",
   "This place was amazing for kids. They perform the Polar Express Movie around Christmas time. They were phenomenal while performing. Would highly recommend. They give the kids the golden tickets, hot chocolate, and cookies all while performing. Amazing hands down.",
   "Train ride was entertaining, the crew were friendly. Santa spoke to each one of the children & there were a lot of them. Also liked that they had a warm place to wait before boarding the train.",
   "Free museum to see and go inside trains. Seasonal train rides offered with a ticket purchase. Really neat place and great for the family!"
  ]
 },
 {
  "name": "Lake Overholser Park",
  "address": "9398-9000 S Overholser Rd, Oklahoma City, OK 73127, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9b36d970-9332-11ea-98f1-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "walk",
   "walk",
   "walking",
   "walk",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=13345590610054369473",
  "source": "GoogleMaps",
  "reviews": [
   "We like to go fish here sometimes as well. I like to walk around on the trails or on the dam! It’s usually kept pretty clean and it’s usually pretty quiet. Lots of people but not crowded at all. Plenty of parking all throughout the park. It's a great place to visit and get away from the everyday grind of business. It's one of my personal favorites! Lots of dog walking and we have an array of water fowl that pass through at varying times of the migratory year. This one is the big open area with trees and the soccer fields. Okay so of Sand bass used live Shad or live minnows only.  A wooden bridge across the pond. Lots of cleared land for flying kites or whatever you want to do! It's so beautiful and peaceful!",
   "Stopped to walk around while passing through.  Beautiful park, no nice bathrooms though unless you're renting the place out. Portable toilets present though",
   "This is a nice lake with an intermittent walking path, that varies between paved, dirt, and the road. I estimate the path to be somewhere under 10mi. The paved walking areas are very convenient and feel safe, when the paved area ends you have to share the road with the cars, who for the most part are courteous. There is varying amount of foot traffic depending on the time of the day, and a number of people fishing, but overall a quiet peace walk. There is an area that does rentals for  activities such as canoeing and the like.",
   "It's always so beautiful to just drive around and park.  Very romantic especially when the moon is full and you find a good spot to see it reflect on the water and there are lights reflecting off it too.  We like to go fish here sometimes as well.",
   "Fun place to sit quietly and meditate in places. Trails to walk, fishing all over, and theres a kids park and skate park on the west side. Good family fun for all."
  ]
 },
 {
  "name": "Oklahoma Sports Hall of Fame",
  "address": "20 S Mickey Mantle Dr, Oklahoma City, OK 73104, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9b860afa-9332-11ea-93bb-14b31f159f22.png",
  "tags": [
   "free"
  ],
  "link": "https://maps.google.com/?cid=12562508795526603302",
  "source": "GoogleMaps",
  "reviews": [
   "I spent two hours here looking at exhibits and never saw everything it was awesome",
   "There are a lot of really well curated areas honoring athletes from Oklahoma and elsewhere! It’s free, but has very little female representation.  Great views of the Chickasaw Bricktown Ballpark",
   "I work at the Oklahoma Sports Hall of Fame and am uploading photos of the interior of the museum at the new location at the Chickasaw Bricktown Ballpark",
   "Attended an event there wasn't impressed with the cleanliness.  Realizing they are remodeling but they still could have at least swept the stairs.  The wait staff were not very pleasant.",
   "Veey awesome place to visit"
  ]
 },
 {
  "name": "Oklahoma State Capitol",
  "address": "2300 N Lincoln Blvd, Oklahoma City, OK 73105, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9bc7a7f0-9332-11ea-bbc5-14b31f159f22.png",
  "tags": [
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=1430115524182233952",
  "source": "GoogleMaps",
  "reviews": [
   "Went here to present for a high school project. The artwork inside the building that lines the interior walls is a great tribute to the Tribes and their culture, as well as to the history of the state of Oklahoma. The place wasn't very crowded on the particular day I visited, and there was plenty of space to look around. I had the opportunity to sit in the Senate Chamber, which was also a cool experience to have. The people there were nice, and I'd definitely recommend visiting if you haven't already.",
   "Building was under construction so couldn't see it all.  Front area wasn't the nicest.   There was an old oil tower right in the middle of the front view which kind of blocked it and didn't look nice.  Also big parking lots out for Senate etc....instead of park/grass/landscaping like many other Capitola have.  Inside was nice.  Cool dome and replica statue of dome topper.",
   "The Oklahoma State Capitol is a nice place. You can spend nice time in front of the capitol building. There are plenty of parking spots here.",
   "Even through the construction the building has plenty to see. Ralph is an affable and courteous tour guide. Thanks!!",
   "Lots of renovations were going on while we were there. It was our first time so we didn't know what was new or old. We toured the chamber with our district's senator and sat in on a session. I reccomend it if you visit when session is available!"
  ]
 },
 {
  "name": "The American Pigeon Museum & Library",
  "address": "2300 NE 63rd St, Oklahoma City, OK 73111, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9c194ad2-9332-11ea-a4e9-14b31f159f22.png",
  "tags": [
   "learn",
   "unique",
   "history"
  ],
  "link": "https://maps.google.com/?cid=10137669357230281010",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic museum that really highlights how pigeons have served in the military and their accomplishments. Clean building, friendly staff, and adorable pigeons. (Pigeons were brought inside because of the rain and soon transported back to their home, normal cages are much larger). Excellent museum overall that is a great place for any pigeon or military enthusiast.",
   "Am incredibly well kept and informative little museum. Much more than I expected",
   "This is a very cool place to visit and learn about the American Pigeon.  What a great unique place to spend some time with your children.  Don't miss this OKC gem.",
   "Very nice. Lots of information and pictures. Did not know the incredible story about the passenger pigions.",
   "My friends and I had time to spare and came here. There is no entrance fee! We thought it would boring. It was actually really interesting! The live pigeons were off display temporarily, but they still made a way to allow us to see them. This place seems great for boy scouts, homeschoolers, history and war buffs, families, and animal lovers. I highly recommend this place. You won't regret coming here."
  ]
 },
 {
  "name": "Lion's Children's Playground",
  "address": "9050 Lake Hefner Pkwy, Oklahoma City, OK 73120, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9c5fa29a-9332-11ea-8ba7-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7549611057785433425",
  "source": "GoogleMaps",
  "reviews": [
   "So calming and fun things for kids and adults you can walk around, fish and play though I haven't been in a boat they also have those and much more I found a place a peace absolutely love it here",
   "Why we are just now visiting the park by Lake Hefner, I have no idea. Sitting on the rocks by the lovely waves gave us a moment of peace and beauty that we appreciated so much! Thank you to those who keep this place clean - visitors/tourists like us really thank you. A nice park for families is nearby, and our restaurant was a short drive over. Perfect.",
   "This is our go-to park. My kids love bringing a picnic or their kites out here and playing. Beautiful view of lake hefner.",
   "I'm from Florida and when I go to OKC on business, Lake Hefner just let's me relax. The restaurants on the lake are good, the jogging path (short and long) are nice. You feel safe at the lake because of the nice people around there. I enjoy Lake Hefner.",
   "Nice park for children located right on the water."
  ]
 },
 {
  "name": "Oklahoma Contemporary Arts Center",
  "address": "3000 General Pershing Blvd, Oklahoma City, OK 73107, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9cb36824-9332-11ea-aab6-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=14521753845111903797",
  "source": "GoogleMaps",
  "reviews": [
   "The exhibits here were top notch and the space itself is beautiful. Definitely worth a visit if you are in the Downtown Dallas area.",
   "Once they move into their new downtown building this will be the art center to beat all others. I look forward to the amount of classes you can take, and multi-purpose artspace there will be!",
   "Can't wait for this to open! Looking forward to taking some art classes here.",
   "They hosted an art show and the place was SPOTLESS, not what you would expect from the state fair grounds. Loved it.",
   "I came to Oklahoma Contemporary with my class at OCCC at we were there when Speak to Me was and it was amazing. The staff was really nice and knew their information and you can tell they enjoy what they do. I'm excited to go back and see new art sometime soon."
  ]
 },
 {
  "name": "Saint Joseph's Old Cathedral",
  "address": "307 NW 4th St, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9cf4b74c-9332-11ea-8151-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=3723703350406001075",
  "source": "GoogleMaps",
  "reviews": [
   "Very Welcoming Church, nice service. They have a 4 pm Saturday Mass which is nice for travlers",
   "Beautiful little Catholic Cathedral. Lovely stained glass and awesome Stations of the Cross. They have a nice bookstore on the lower level.",
   "Beautiful Church.  Lovely service. Nice friendly people. Love it here!",
   "We love the old Cathedral, we always make it a point to go when staying the weekend in OKC.",
   "Beautiful, and welcoming. What a beautiful reverent celebration of the Mass. Really made this Texas girl happy even though I wasn't with my parish family back home 💜"
  ]
 },
 {
  "name": "E.C. Hafer Park",
  "address": "1034 S Bryant Ave, Edmond, OK 73034, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9d39d69e-9332-11ea-b237-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "walk",
   "kids",
   "walking",
   "parks",
   "nature",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=2633511566572246196",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice, family friendly place. Plenty of play areas for the kids. The pond is very nice as well. It has a lot of geese and ducks there, all begging to be fed. The only downside is that the drinking water fountains were turned off. I understand that it was the middle of winter when I visited but Oklahoma winters can be pretty mild. It was quite warm that day so it would have been nice if they were on.",
   "This place is an AWESOME place to spend a couple of hours or make a day out of it, especially with the kiddos.. My daughter loves it. They have 2 playgrounds, A duck pond with a pavilion that overlooks it with easy access to allow feeding the many hungry ducks. \n(DONT FORGET TO BRING BREAD OR CRACKERS !!!) The kids will love it.\nThere are clean public restrooms, picnic tables and benches to rest your legs after taking a nice walk on the walking path that wraps around it all. Pet friendly just don't forget your leash. Handicap parking & access to it all. \n\nSo' what are you waiting on ? Put that device down, turn the TV off and come enjoy the park.. We will see you there.",
   "This is one of my favorite parks and walking trails. I love that it doesn’t have the busy sounds of a road, and has sections that really pull you back into nature. The water element is perfect, and there are many great spots for hammocks to be set up, and to play ultimate frisbee, or simply bring a blanket and books and relax in nature.",
   "Good place for barbecue and hiking. I went on January and it was still pretty, I cannot imagine how it will look during the spring. Definitely will be visiting again soon.",
   "Serene and kept up well, this park was a nice change for my walk.  It was also nice to have varying rises and drops along the length of the path, while the path surface itself was mostly flat and even (unlike dirt paths at some other places I've walked)."
  ]
 },
 {
  "name": "Mat Hoffman Action Sports Park",
  "address": "1700 S Robinson Ave, Oklahoma City, OK 73109, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9d86e574-9332-11ea-871d-14b31f159f22.png",
  "tags": [
   "kids",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=5375301038302280689",
  "source": "GoogleMaps",
  "reviews": [
   "Great time at this skatepark! We took our scooters and had a blast! The park has a lot of various skill level ramps, perfect for beginners or advanced.",
   "Not too bad unless you're just starting out then I'd recommend another skate park. Bowl is good but limited lines and the \"street course\" is limited. It's pretty good.",
   "Awesome park. Small flow for longboards. Only thing.. there’s glass EVERYWHERE. More a reason to not fall.. 😬😊",
   "Of all the good action sports parks in the Metro, this one is my favorite. It always has very talented skaters and bikers and everyone is very kind to all ages of kids and levels of skill. Great place...well built. Always improving with new investments. Well maintained.",
   "For those of you that like riding in bowls you would like this skate park."
  ]
 },
 {
  "name": "Schilling Park",
  "address": "601 SE 25th St, Oklahoma City, OK 73129, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9dc945be-9332-11ea-a349-14b31f159f22.png",
  "tags": [
   "parks",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=14083701133798855252",
  "source": "GoogleMaps",
  "reviews": [
   "Great clean park. It was a great place to meet up with community partners and volunteers alike for the national Sound the Alarm campaign that is led by the American Red Cross. This campaign has saved over 500 lives nations wide. Park was clean. Accessible, safe, and up to date. Kudos to Oklahoma Coty’s pars and recreation department for all that they do- this park (like many other city parks in Oklahoma City) was top notch.",
   "It's peaceful nobody's there to cause any problems my family love it.",
   "It's really nice out here today and my daughter is enjoying yourself..",
   "Love this park! Several different things the kids could. Plus very private at night.",
   "They are adding so many new things ...hope it turns out amazing"
  ]
 },
 {
  "name": "Andy Alligator's Fun Park & Water Park",
  "address": "3300 Market Pl, Norman, OK 73072, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9e0ae2d4-9332-11ea-b7cf-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "kids",
   "kids",
   "family",
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6897734949341699100",
  "source": "GoogleMaps",
  "reviews": [
   "We went for my grandsons birthday and had as great time! He loved the miniature golf and loved watching his grandmother climb the rock wall!!🤣 We rode the go carts and played tons of video games. I had fun bowling with my niece and playing air hockey while they kids did laser tag. The food was mediocre but the staff were amazing.",
   "This is our second time coming here for birthday parties and both times our host was Ariel. She was awesome! She made our experience amazing! She is amazing with the kids as well! I loved it both times and would love to come back again. Thank you so much!",
   "We were greeted by Marc when we arrived. He was so informative and showed us around the whole place. My kids were fully informed on all the exciting options before they picked which fun things they wanted to do. We had a blast as a family. We look forward to coming back!",
   "Well how to even start this review.. This Sunday 01/05/2020 me and my family went to have a Sunday funday, and this was not the place to go for that. we wasn't there that long because of how some of the employees were treating some of their customs. I'm a business man  my self and i believe in treating your customers with respect. My family was playing in the arcade and i was out at the go carts watch a couple kids go around the track. the go karts are slow and the kids were probably around 7 to 8. In the middle of the race they stopped the go karts told the kids they were kick off for the rest of the day. the father got upset and I got confused.  they might have bumped a little but nothing crazy (i was actually videoing so i could  show my wife they wasn't that fast and i didn't see how our kids could hurt them selves) went on about my business  to go show my wife and there was a commotion with the father and the manager about the incident. Apparently because the go karts bumped each other they weren't able to ride and were ban from the karts. and really that's what most people enjoy the most. instead of the business making them take a break and explain to the kids what they did wrong the straight kicked them off. i could see the fathers point of view and instead of the manager  trying to talk civil to their customer she was actually pretty rude. after the incident the father left the i over heard the manager and some long haired guy speaking to each other saying something about they didn't belong there or even in the country! I guess its because they were Spanish or some other race! I grabbed my kids and  wife and left!!! This isn't  what the world needs right now at this moment with everything going on! Being the manager of a place means doing whats right and what they did on this day was very wrong! I will not be going back to this place because of the lack of training of employees and the racist comments made!",
   "We will not return. We came for a birthday party. The kids get cards to play the games with, and these cards retain your ticket balance for prizes later. When we went to do my sons, no problem, and he had 3 tickets left. My daughter wanted his 3 tickets. The guy tried to combine the cards. He deleted them. She had over 540 tickets. He wouldn’t do anything about it. Nothing. Needless to say, I left there with a crying 8 year old, $200 out of my pocket spent on top of what they spent on the party, and then treated like crooks. Never again!"
  ]
 },
 {
  "name": "Arcadia Round Barn",
  "address": "107 OK-66, Arcadia, OK 73007, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9e5ab0da-9332-11ea-bff5-14b31f159f22.png",
  "tags": [
   "unique",
   "family",
   "history",
   "music",
   "history",
   "kids",
   "music"
  ],
  "link": "https://maps.google.com/?cid=16589420776416964630",
  "source": "GoogleMaps",
  "reviews": [
   "We took our son and daughter-in-law from Charlotte, NC here today before dropping them off at the airport. Great visit for everyone in the family, even those of us who had been here before. So cool to stand in the middle of the barn and near the cool acoustic effects. Weekend music sessions must be great to listen to. \nEnjoyed wandering the souvenir shop below and learning about the history of this unique attraction. Even picked up an ornament for the Christmas tree this time around. \nStaff was friendly and informative. Definitely recommended taking the time to stop by when in the area.",
   "We take weekend road trips and decided to go  to Arcadia to see the round barn.\nBelieve me, if you are a history buff, this is a great day trip to take. Not only is the round barn very interesting but it is filled with amazing pieces of history and information. They also have some nice items for sale.\nIt was well worth the drive.",
   "This is such a fun place to stop and a must-see Route 66 landmark if you are interested in that kind of thing. The barn itself is beautiful, especially the upper level.",
   "Interesting place, very cool to take the kids when driving by.   The echo is awesome.  Not a lot of interesting items in the gift shop but that's ok.",
   "Very cool to see. Great music being played live. Worth checking out."
  ]
 },
 {
  "name": "Bluff Creek Park",
  "address": "N Meridian Ave, Oklahoma City, OK 73162, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9e9f28e4-9332-11ea-a977-14b31f159f22.png",
  "tags": [
   "unique",
   "parks",
   "walking",
   "walking",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=1559565554729670411",
  "source": "GoogleMaps",
  "reviews": [
   "This park is well worth our 20 min commute from Midwest City OK. We recently got a dog from an animal center and have been looking for parks all over Oklahoma City. This park is animal friendly with trash locations and bags. There are two main trails. One on concrete which we walked on, but there’s also one for mountain bikes. That one goes through the trees and around the creek and really is unique looking. I did see people running and walking on that trail too if you prefer curves rather than a big pavement trail. There is also a wetland area on the NW side where my dog jumped in for a swim. Definitely would recommend and maybe you’ll be lucky and spot deer. We saw 3 good size ones just jumping across the trail.",
   "Truly a great park for anything outdoors. I typically utilize the bike trails here and they are always a great time. The trails are just technical and long enough to make this a really fun ride the whole time. The park itself is always clean and seems well taken care of. Love coming out here to enjoy my weekends.",
   "This park is large, quiet, and pretty. There is a port-o-potty in the parking lot, lots of running/walking trails, and a family-friendly playground. There are also trashcans placed throughout the park and it is very clean. Dog-friendly (with leash) as well! Love coming here",
   "They have a lite workout on one of the trails, walking AND bicycle trails. We saw deer!!!! Nice & clean. My only concern was the portapotty in front of the bridge has a broken lock, the winds keep blowing the door open.",
   "Great walking and dirt biking trails. Duck ponds towards the back. If you go in the late afternoon, deer will walk almost up to you."
  ]
 },
 {
  "name": "Stars and Stripes Park",
  "address": "3701 S Lake Hefner Dr, Oklahoma City, OK 73116, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9ee7b7e4-9332-11ea-b1c6-14b31f159f22.png",
  "tags": [
   "kids",
   "parks",
   "walking",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16012526237037472583",
  "source": "GoogleMaps",
  "reviews": [
   "I like this spot! There were a lot of people out and about today due to the beautiful weather. People with their kids, out walking dogs, bike riding... But we humans are messy creatures!! The trash cans were at capacity so there was trash on the ground around the trash cans. But that's not the parks fault! Get outside. Enjoy the day. And do all that stuff at this park.",
   "I posted a picture of the rocket ship that was there in the 70s when I grew up. It was huge, all metal, and with multiple sections. Many times it was with fear that I did, or did not, go down the curvy side. \nThe sounds of footfalls on the textured metal ramps, with the wire mesh fence jangling, gravel being pushed around and doing its own slide, and of course high-pitched voices in playground ecstasy. Definitely the best toy of my childhood. (MAYBE the minibike, well, bicycle, too). \nLove the setting of Stars and Stripes park, too- at least Lake Hefner is still there! Beautiful.",
   "There are many features to Stars and Stripes park. Firstly, there are multiple large playground equipment pieces. They are suited to various ranges of children 2-12. The park uses those wood chips as \"impact material\" so no sand. There are also 6 swings and 2 baby swings. So for a playground, it is well stocked. \n     There is ample parking as well as handicapped parking and access.  Binges provide lots of seating for supervising the children as well as stopping along the sidewalk. There are public bathrooms in the brick pavilion as well as multiple porta-potties. There are many concrete picnic tables and grills. The pavilion is covered, and there are a couple other covered picnic tables also. There are lights spread throughout the park.\n     Aside from the playground equipment, there is also a basketball half-court. They installed a fitness section which has built-in equipment to do various exercises such as lunges, box jumps, speed drills, and pushing and pulling exercises. They have also added a skate park, with a large bowl and a few ramps, stairs, and railings.",
   "They always host Puggerfest here in October and boy it's so much fun. With food trucks and lots of cute puggy faces to love on. Never disappointed and the lake view is really nice! The park is kept clean and tidy and even for a park bathroom I have seem worse",
   "Beautiful in summer, quiet in winter. Good place for small children. Converted pavilion for parties and picnic tables with charcoal grills for chilling."
  ]
 },
 {
  "name": "99's Museum of Women Pilots",
  "address": "4300 Amelia Earhart Ln Drive, Oklahoma City, OK 73159, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9f49a2cc-9332-11ea-8ea4-14b31f159f22.png",
  "tags": [
   "walk",
   "tour",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7374522594407652441",
  "source": "GoogleMaps",
  "reviews": [
   "Truly a gem of an aviation museum a short walk away from Tulsa International airport.  Not very well known, but so very worth the visit. Small but interesting gift shop. The office personnel down stairs will open up the museum upstairs and it's a self guided tour through many well documented display case. Entire history of women's aviation is covered. A must visit stop for all history buffs and aviation enthusiast",
   "The museum was very interesting. It contained many photos, newspaper clippings, articles, and artifacts honoring women in aviation. It gave the history of the 99s organization from its beginning to the present time, and detailed their story of how and why these brave women started the renowned 99s group. I would recommend a visit to the museum to those living in Oklahoma and anyone who loves to fly.",
   "Incredible hidden gem. Tells the story of a cheeky group who could've been rivals, but instead decided to uplift one another. Feminists, take note.",
   "Love the museum. Has really changed over past 1-2years. Got to see, a gem.",
   "Very nice museum. If you are ever flying in or out of will Rogers, give yourself 30-40 minutes to stop in an see all the displays. Follows women flying since the 1920's up to early 2000's. Very good write ups in the display, especially the air race."
  ]
 },
 {
  "name": "Hefner Park",
  "address": "3301 NW Grand Blvd, Oklahoma City, OK 73116, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9f89ff7a-9332-11ea-a66f-14b31f159f22.png",
  "tags": [
   "walking",
   "parks",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=13049540999767255439",
  "source": "GoogleMaps",
  "reviews": [
   "This park has beautiful views and today it was 58° and somewhat windy. Lots of birds to see, many of which were huddled together like friends, even though they were different kinds of birds. I thought that was pretty cool.😎 Enjoyed walking the well maintained trails. My only complaint would be that someone in the city needs to empty the trashcans. They were all full. 😕",
   "Great park we all have a moral responsibility to help keep our local parks clean. Do your part and help by simply cleaning up after yourself ppl!",
   "Great views and restaurants.  New to oklahoma?  Trails walk dogs ride bikes this is a really cool local OKC area",
   "Basketball court and plenty of room the basketball ball goals need work though",
   "So beautiful, a great place for the family!"
  ]
 },
 {
  "name": "Regatta Park",
  "address": "701 S Lincoln Blvd, Oklahoma City, OK 73129, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9fd684cc-9332-11ea-89f1-14b31f159f22.png",
  "tags": [
   "walk",
   "parks",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=17331222082644119765",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to take a break from life and take a walk around a clean lake scattered with wild life.",
   "I love working out at this place!  The boat tours look super fun but I'm all about the calisthenics parks!  Overall  it's a great place to spend a day!  Dont forget the checkout all the boathouse district has to offer, child friendly clean fun and a little.more thrill than your probably used to!",
   "Very beautiful River and I like to walk around the river. Sometimes I come here to get extra refreshment. Really I enjoy here!",
   "Maybe I was lucky but when I went I was the only person there. It was lovely.",
   "Beautiful place. The surrounding is well maintained. People usually love the walk around the lake. Also the boat house have facility to accomodate small get-together and events."
  ]
 },
 {
  "name": "Ride OKC",
  "address": "152 S Walker Ave, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a028f29e-9332-11ea-bde2-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "knowledgeable",
   "tour",
   "history",
   "brewery",
   "learn",
   "knowledgeable",
   "history",
   "tour",
   "art",
   "knowledgeable",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=18024973689982219789",
  "source": "GoogleMaps",
  "reviews": [
   "We did the breweries tour.  It was a fun experience.  Ryan, our guide was knowledgeable, friendly, and safe.  He gave us a briefing on road rules, etiquette, the law and tips on making it a fun and safe ride event.  I would  highly recommend this tour.  We even got interesting information on what buildings were and saw some architectural gems!  We plan to comeback.  So much fun!  Thank you!",
   "I’ve been on three rides with Ryan. Very entertaining and knowledgeable. If you live in, move to, or visit OKC, this is a great way to get to know the City.",
   "We had a great time doing the brewery bike ride. Along the way Ryan (the guide) gave us insight on architecture and some history of downtown OKC. I would recommend this to anyone! We had a blast and we definitely will be doing another tour.",
   "My mom was in town from Southern California and I was looking for something to do. We found RideOKC and it couldn’t have been any better. Ryan was our tour guide for the Art & Architecture Tour. What a wonderful way to see OKC and learn about it’s incredible history. I will definitely be biking with BikeOKC again for some of their other tours. You won’t be disappointed with this Tour Company! Ryan even took photos of our group. He is very knowledgeable about the history of OKC.",
   "Everything about this tour was great. Our guide, Ryan, was knowledgeable, friendly, and experienced. It was just my husband & I on our tour, so he even changed the route to take us to a place we hadn't been. The meeting place was easy to find & the ride was easy. I definitely recommend this tour company & the craft brew tour!"
  ]
 },
 {
  "name": "Oklahoma Hall of Fame",
  "address": "1400 Classen Dr, Oklahoma City, OK 73106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a07df54c-9332-11ea-aec4-14b31f159f22.png",
  "tags": [
   "unique",
   "historic",
   "art",
   "cheap",
   "kids",
   "history",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=12507301924787316266",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely beautiful historic building with a wonderful collection representing Oklahomans who have contributed to the betterment of the world in a variety of capacities from sports, entertainment, civil rights, medicine, education & business. \n\nEvery inductee has their portrait or picture somewhere throughout the museum with their name, City & general contribution plus the year inducted into the Oklahoma Hall Of Fame. I think an added touch would be a longer synopsis of what each person did in more detail but I’m the curious type of person that will look them up to find out more information 👍🏻\n\nThere is an art gallery where the artist exhibits rotate periodically. The current exhibit “Spirit Of Color”, just started and runs to April 30th, 2020. Beautiful art that you can contact the museum about purchasing the items. \n\nOriginally built in 1926 for the Mid-Continental Life Insurance Company. I love that every door handle still contains the Mid-Continental emblem. The building is absolutely gorgeous, grand staircases on every floor & marble everywhere! You can even rent the location for private events & weddings. Unique venue with lots of beautiful photo opportunities. \n\nThis was my second time here. It’s a nice way to spend an hour or two browsing around.",
   "Great and relatively cheap. A little less exciting since its mostly portraits, but there are more interactive and engaging videos and a little play area for younger visitors.",
   "it was great. they had Christmas activities for the kids. I enjoyed walking viewING all the great history about Oklahoma. I will visit again next year.",
   "It was very facinating and interesting to see the people who arose from Oklahoma.",
   "Friendly nice place my kids love the event"
  ]
 },
 {
  "name": "Red Earth",
  "address": "100 N Broadway Ave # 2750, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a0c2785a-9332-11ea-981c-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=17644614799541869161",
  "source": "GoogleMaps",
  "reviews": [
   "Simply breathtaking home for the Native American art. Lots to look at such as paintings and pottery. The Red Earth company is located in downtown Oklahoma City and the staff is very welcoming. Plus you have access to the underground just a few feet away.",
   "The Treefest exhibit is visually appealing. The trees tell about the traditions of each tribe. Highly recommend.",
   "I've not been there yet but the red earth pow wows are always amazing. Hoe ever I drove 2 and 1/2 hours to find out there not open because there doing some work. Wish they would have said not open since there not",
   "\"Great Native American Art Gallery\"  a must see ! Many art items you can buy.",
   "My husband and I took our kiddos to see all the Christmas trees from different Native American tribes in Oklahoma. It was great for our kids to read a description of each tree and why they chose the specific ornaments to decorate with. Highly recommend checking it out."
  ]
 },
 {
  "name": "Dolese Youth Park",
  "address": "5105 NW 50th St, Oklahoma City, OK 73112, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a10c04ae-9332-11ea-8800-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=15736370327146326173",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful park for a diva golf course with well-marked stations and a handful of elevated baskets, making the play for interesting. There will be a handful of baskets near to the pond and major roads, adding another level of interest. There are two different courses on site if you are up for two rounds of 18-holes. For a break, there is a shaded area near the parking lot closer to NW 57th Street. You enter the park from NW 50th Street and the road will lead you pass the pond and a baseball field.",
   "Love this place everytime we go. Kids have so much fun and the adults get to play games too!",
   "Beautiful baseball facility! Fields are lovingly manicured, staff friendly and welcoming.  Great first impression.",
   "Most rate this course a 5 I suppose.  The insane mosquito population here, especially in the densely wooded areas annihilates my ability to focus when throwing.  Otherwise such a variety of holes to throw and during off (skeeter) season it's probably the best option to throw at after heavy rains make most other parks overly muddy.  The 'island' at the start is mostly sand.",
   "Great place I am a official for baseball and did the varsity teams two games, Lawton Vs  Grant."
  ]
 },
 {
  "name": "Milk Bottle Grocery",
  "address": "2426 N Classen Blvd, Oklahoma City, OK 73106, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a15ff13a-9332-11ea-81b2-14b31f159f22.png",
  "tags": [
   "unique",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11225642925013323827",
  "source": "GoogleMaps",
  "reviews": [
   "this is very cool! really enjoy seeing things like this! the gold dome shaped areana was also very cool, and really enjoyed the veteran's war memorial as well!",
   "A storic insign of an old grocery, now one of the Oklahoma city symbols. Nice spot just for some pics.",
   "Another cool photo op",
   "Currently an architecture office so it's not in to the public. Exterior is a unique triangle building planted in the middle of an intersection.",
   "When my family first moved to Oklahoma in 1941we rented a room not far from here. This building was then a place where you could buy magazines, newspapers, ice cream treats and pop. There was a playground behind the store then and my mother and I would go to the store for Eskimo pies then to the park. Very fond memories for me."
  ]
 },
 {
  "name": "South Lakes Park",
  "address": "4210 SW 119th St, Oklahoma City, OK 73173, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a1aba5e6-9332-11ea-ae4d-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "walking",
   "walk",
   "kids",
   "kids",
   "family",
   "walking",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=14666010017009772083",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic public venue. The public event center is available for semi-formal events and fundraisers.  It is an older facility, but maintained enough to be functional. The size of the park is significant.  The playgrounds are great. Lots of fun for older and younger kids. \n\nPublic field can host a large outdoor event.\n \nSoccer club promotes lots of activities.\n\nThe walking trail is less crowded than Hefner or some other high traffic public venues.",
   "I like this park a lot. Its a nice space to walk your dogs, watch ducks, let the kids play etc., The play ground has two play \"areas\" one for smaller kids and one that's for kids a little older. The only downside is how many people don't pick up their dog's waste.  Its not that hard! Also, the people that go on walks and don't have their dog leashed.",
   "Excellent Park in OKC. It has everything you could ask for in a park. Soccer fields, Playgrounds, walking paths, fishing ponds, and a skate Park. The playground is a little dated but there is plenty variety. Kids of all ages can enjoy it. Definitely recommend it for the whole family.",
   "Fun place , good atmosphere. Descent fishing spot",
   "This is a really safe secure and dog friendly park. Me and my wife come here either every morning or at night before they close. At this point there is some green Algae on the water so don't let your dogs drink it or they could dehydrate to death. But this stuff is on a lot of body's of water right now not just here. And if you are going early or at night I would suggest bringing a flash light for safety at night around the long end of the tracks for there are no lights."
  ]
 },
 {
  "name": "Eldon Lyon Park",
  "address": "7400 NW 36th St, Bethany, OK 73008, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a205c992-9332-11ea-a242-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "kids",
   "walking",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=5225371439870869575",
  "source": "GoogleMaps",
  "reviews": [
   "Clean park with restrooms and plenty of trash cans. Nice basketball court and play ground for kids.  Plus they also host a great 4 of July celebration every year.  Go here and have a fun day!",
   "Love how it has a perfect circle to walk around and how it is marked how far you've gone",
   "Great park, concrete walking path, swimming pool, tennis courts, basketball court, little kids play ground. Just a great park.!!",
   "Best place to walk! Smooth sidewalks, a little elevation at times...and the trees are super cool.",
   "Great park with a 2 mile walking path around it. Trees provide good shade in the morning."
  ]
 },
 {
  "name": "North Pole Adventure",
  "address": "2215 W W Interstate 240 Service Rd, Oklahoma City, OK 73159, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a270fda4-9332-11ea-b18c-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "family",
   "kids",
   "family",
   "walking",
   "kids",
   "free",
   "cheap",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=11149312216696314220",
  "source": "GoogleMaps",
  "reviews": [
   "The kids love it, what else matters? It hasn't been the same since moving out of Cross Roads... This year was a big improvement. Real reindeer are back and the kids loved shooting the Grinch with nerf guns.\n\n2 stars because our tickets, which were purchased through ticket storm, had the wrong address. We ended up in the middle of nowhere, and when we called the OWNER he laughed. He acted like we were lying, said he's sold over 4,000 tickets and that's never happened. I don't care how many tickets you've sold, mine had the wrong address.\n\nWould be 4 stars if the owner would have shown a little professionalism. 5 stars if the storage area leading to the restrooms didn't smell like an ashtray. Smoke outside.",
   "Family fun night was great North Pole adventures. My kids loved the snow room and of course the reindeer. I think it's definitely worth the money.",
   "This magical place has lost some spark over the last few years. 2019 was our 3rd time going, we missed 2018 so not sure of that's when they moved again, but we loved this place so much that we were so excited to go again and share this experience with our 11 kid visitors from out of state. Unfortunately so much has changed that its lost a lot of his warm and inviting atmosphere. The computer letters were really disappointing because christmas is all about that letter to santa and the little kids were unable to engage in that activity at all. At least with letters they can write their name or scribble their cute little version of a note to the special man. I love that the santa hasn't changed but the scene was dark and the picture quality was a joke this season. \nThe best part was by far mrs clause who was so warm, friendly and inviting. Unfortunately the only other staff that could be  classified that way was the Santa workshop elves who also did Amazing. The kids all got a stuffed animal to keep this year that they 'made' with the elf. I do kind of miss how yall did it in previous years because it gave the kids a little taste of Christmas and sharing that magic with other kids by donating it. I think this was a way of cutting cost because they used to have a wooden toy you made with the elves and a stuffed animal you made for charity but this year was only the stuffed animal. \n I would honestly give 2 stars if it werent for the fact that I've been previous years and it was amazing those times. I'm not sure if my family will go back next year just because it wasnt as friendly as it used to be. It used to be my favorite thing about the season hitting. I loved the wood floors like we were walking into an actual village/workshop and loved the explanation of the reindeers, yall just got rid of too many of the amazing things you used to have. \nI've added 2 screenshots of pictures from 2016 to show what it used to be. Now it's just a maze in a warehouse with little to no elf involvement umlike previous years.",
   "We have been coming here for a few years now and have always enjoyed it. However,this year we have a new baby and had to pay full price for her. She is 9 months old and the lady at the register told me only 7 months and under are free. I thought this was absolutely ridiculous. She sat in her stroller the entire time. And why 7 months and under? Makes no sense. I've never been anywhere in my life that made you pay for a baby. If it weren't for my other kids we would have left. This will be our last year attending.",
   "My baby still believes in Santa because of this place!!!    We have been going to the North pole for Years!  Santa is always nice and jolly, Mrs Clause always has hot fresh cookies and there are Real reindeer walking around doing reindeer stuff.   The Elves looked a bit exhausted,  but all in all a great place to take kids .  They make a toy and play in snow too.    Wish they had a train.   Bring your wallet,  it's not cheap."
  ]
 },
 {
  "name": "Edmond Dog Park at Bickham-Rudkin Park",
  "address": "379 E 33rd St, Edmond, OK 73013, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a2caddc6-9332-11ea-a4fa-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "drink",
   "active"
  ],
  "link": "https://maps.google.com/?cid=16442623112282946553",
  "source": "GoogleMaps",
  "reviews": [
   "Nice dog park but lots of dogs$$t all over.  Should have volunteers to take care of it.  You  should know that the lake area is NOT fenced in so when you go out the  gate your dog can run like hell. If not for the lack of pickup by dog owners would be 5 star.",
   "We stopped at this dog park on our way through Oklahoma on a road trip and our dogs loved it! It’s well-kept inside the park and it has a gate out to the lake area. I don’t believe the lake area is fully-fenced so you have to keep an eye on the doggos if they are walking the shore (but both of our dogs are off-leash trained so it didn’t make any difference to us). There is running water to full dishes and some obstacles to play on. We will definitely be stopping here again!",
   "My babies loved to play here. You feel apart of the community as soon as you walk into it. The lake is a perfect addition and the girls made new friends and so did we. It is a place to connect and have fun and the facilities are perfect. Its large enough for your first babies to run as much as they want. The water bowl in the middle is perfect placement as there is so much going on that it is nice to have a designated place for them to drink. I appreciate this place so much.",
   "Great dog park. It's huge, and very well designed. Concrete slabs with drains and pumps for the water, so there's no mud puddle, and flagstones around the trashcans so they don't turn into a morass either. I will definitely be back.",
   "Everyone there was friendly and attentive to their pups! Grassy but also muddy on wet days! I think it's a great and active dog park! Great for socializing your pup since the dogs are so friendly!"
  ]
 },
 {
  "name": "Stinchcomb Wildlife Refuge",
  "address": "Yukon, OK 73099, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a31c40d2-9332-11ea-bfd6-14b31f159f22.png",
  "tags": [
   "nature",
   "family",
   "eat",
   "nature",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=16862425980734090786",
  "source": "GoogleMaps",
  "reviews": [
   "Nice for a January 90-minute stroll (no leaves, and everything's dormant, but no bugs or heat either ☺️). Saw an armadillo, and lots of birds. Peaceful. Birds chirping and sun sparkling on the water. Wear shoes you don't mind getting muddy and bring a bag to put them in after, and a change of shoes. Then you can explore all the nice little trails through the woods and you don't need to go on the road at all. Good to get away from buildings and roads for a while, get some fresh air, and clamber over (and on) fallen trees.",
   "Our favorite local nature escape. Lots of area to explore if you're willing to venture off the road. Heartbreaking to see trees damaged by hatchet-happy hikers. Extremely helpful to have topography GPS when exploring off the main road. A few good places to relax and enjoy a fire by the river.",
   "Used to like going down river to cast net. Bait for the lake. Now according to the game ranger they changed that. It's now pole fishing only all the way to the power plant. Still a fun place. Sometimes there's a few weird people that find their way down there. So stay aware.",
   "a place where I like to come to relax with my family and take some photos of Nature; away from the noise of the City, crossing Stinchcomb Wildlife Refuge is the best, you can take from 2:45 to 3:00 hours to cross if you stop to eat a sandwich and enjoy nature, I love it, I recommend it 100%",
   "I go to shinchcomb often and every time it surprises Mee with dense forests where you might find yourselves in the midgest of birds with all the funny activies(off the trail) swarps and walking with the flow of river with best sunsets and sunrises, with wildlife and today I saw an otter in my life, stars.✌️🧐😁"
  ]
 },
 {
  "name": "Pat Murphy Park",
  "address": "4500 W Hefner Rd, Oklahoma City, OK 73162, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a36b1e7e-9332-11ea-999a-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "family",
   "music",
   "kids",
   "walk",
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4676323904034882323",
  "source": "GoogleMaps",
  "reviews": [
   "This is a wonderful park for the entire family! There are separate play structures. One is for children ages 2 to 5 The other is for ages 5 to 12. They also have a wonderful percussion music section which is basically indestructible. There are four swings, two for babies and two for older kids. There are a couple covered picnic tables as well as a few more stone picnic tables out in the open. There are multiple benches to sit and watch your children play. \nThere's good parking with a couple of handicap spots as well as a bicycle repair stand. There are automatic lights that light up the parking lot, but not the playground itself.  The playground is wheelchair accessible, but the equipment is not. There is also an open field next to the park where people play cricket and other sports.\n\nThere are no public restrooms.",
   "By far one of our favorite spots for a beautiful day!  Opportunities for big and small kids to play.  From an assortment of slides, balancing activities, to even musical instruments. This park has it all.  There is covered picnic areas, restrooms as well as plenty of shade.",
   "Pros:\n1. Clean\n2. Walk and bike path\n3. Dog friendly\n4. Not too crowded\n5. Play area for kids\n6. Good amount of parking\n7. Good amount of space\n8. Wild deer\n\nCons:\nN/A",
   "Nice park for kids and adults. Great trees for hammocking too. They have nice hiking trails and picnic areas, plus a covered pavilion.",
   "So much to do! The kids loved the drum and bells part."
  ]
 },
 {
  "name": "Wheeler Park",
  "address": "1120 S Western Ave, Oklahoma City, OK 73108, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a3b3c1ec-9332-11ea-bad5-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4675246627282614261",
  "source": "GoogleMaps",
  "reviews": [
   "This park is so beautiful. I recommend riding the ferris wheel and checking out the food trucks.",
   "So much fun! Great place to go if you like relaxing walks or even if you wanna laze around they have hammocks! Pet friendly and fun fun fun! The ferris wheel has an amazing view and so does the whole trail! Could walk for miles and not get bored of the view! Love this park!",
   "Wheeler park is interesting. \n\nOn one hand it's kind of out in this random area all by itself, with no substantial trees and feels kind of desolate a lot of the time. \n\nOn the other hand, it has a great view of downtown, the giant OKC is cool for taking pictures, the Ferris wheel is fun and has great views and if you go here with a bunch of people this is a pretty cool spot. \n\nThe context in which you visit this place will greatly color your experience and opinion of this place in my experience. \n\nThis is a good place to host a work event or party. \n\nOverall, pretty cool and worth checking out. I'd recommend going when other people will be here, like evenings, especially on the the weekend.",
   "Very nice place, we enjoy going there to kick back enjoy the hammocks, swings, usually food trucks and especially the ferris wheel from Santa Monica Beach right on the bank of the Oklahoma River day or night is nice.",
   "Lots of space. Play ground, kite flying space, good parking, concrete path, bench seating, etc."
  ]
 },
 {
  "name": "Buck Thomas Park",
  "address": "1903 NE 12th St, Moore, OK 73160, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a4098334-9332-11ea-ab42-14b31f159f22.png",
  "tags": [
   "walking",
   "kids",
   "family",
   "walking",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=13701592146103086508",
  "source": "GoogleMaps",
  "reviews": [
   "Hands-down our favorite place to play softball. Best facilities by far and breakfast served by concession stands on tournament mornings is incredible. Youth baseball fields are great areas for skateboarding walking or jogging soccer fields and everyone is always friendly. Whether you have children or not you need to check Buck Thomas Park out.",
   "The family and I love this park. Plenty of stuff to do for all ages.\nThe only  thing I do not like about this park is, the people who drive through the park. They just fly through the parking lot. Like hello our kids are playing. Definitely needs bigger speed bumps, to slow people down.",
   "Nice playgrounds and ball fields, good place to run around too if you like jogging.",
   "Great baseball fields, paved walking paths, very convenient, and a nice little skatepark. Worth a visit if you are close.",
   "This has always been one of the better ball parks in the OKC metro area for little league baseball.."
  ]
 },
 {
  "name": "Individual Artists of Oklahoma",
  "address": "706 W Sheridan Ave, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a45e81b0-9332-11ea-a336-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=5012693949761991254",
  "source": "GoogleMaps",
  "reviews": [
   "If you like art the you need to make it a point to visit. IAO put together some of the best art shows in the city.",
   "I've been here for a couple of events and decided to have my wedding/reception here. It is the best wedding venue. Reasonably priced. There's art so not much extra decorating to do, and they had all of the tables and chairs we needed. Everyone was super helpful and accommodating.",
   "Great place to see an be involved with local art and artist",
   "Very nice venue for a fundraiser!",
   "I went to a fiber arts show there. A great display of diverse works. Very interesting pieces."
  ]
 },
 {
  "name": "Oklahoma City's Adventure District",
  "address": "1 Remington Pl, Oklahoma City, OK 73111, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a4aace28-9332-11ea-940c-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=1843350712156680558",
  "source": "GoogleMaps",
  "reviews": [
   "Love the Southside having more things for locals to do",
   "",
   "",
   "",
   ""
  ]
 },
 {
  "name": "McKinley Park",
  "address": "1398 NW 13th St, Oklahoma City, OK 73106, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a4f097d2-9332-11ea-b793-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=6105150936951713728",
  "source": "GoogleMaps",
  "reviews": [
   "It's a great place, to meet up with friends that have kids. So they can play together! The community center is a really nice place for kids after school!",
   "Needs more outdoor facilities, like a water fountain and bathrooms. I might have missed them but didn't see it.",
   "Fun is the word for me at this park even running around as long as you're moving",
   "I Live next door to it! Wonderful for soccer, basketball, running & walking. Great Water park & playground. Indoor gym & other activities.",
   "Nice. Splash pad, playground, pavillion for picnic. Historic structures closed or closed for season. Maybe WPA or CCC"
  ]
 },
 {
  "name": "OOZIE Mediterranean Restaurant",
  "address": "1211 N Shartel Ave STE 102, Oklahoma City, OK 73103, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a539d614-9332-11ea-b664-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "drink",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9674664148378169478",
  "source": "GoogleMaps",
  "reviews": [
   "I’ve pretty much tried all the Mediterranean restaurants in OKC and this is undoubtedly the best I’ve had. Starting from the ambience to the service, hygiene... it’s all great. The food tastes awesome and portions are huge. Charlie the owner and his family are awesome human beings and creates a very friendly and warm environment. If you’re looking for good and quality food, this is the place to go!!!",
   "Great food!  Picture is the Hashwa Plate Special and comes with a drink.",
   "I just found this place, and you should too. Traditional Lebanese dishes as well as American. Small place, don't expect big, and without adult beverage service at this time. But the owner, Charlie has a ready smile, and is very accommodating.  If you can\n...support he and his family. Once you try it....you'll return!",
   "Excellent Mediterranean food. I could not find the restaurant at first. Then I realized it’s inside this building on the 1st floor. Staff is very friendly. Place is clean and bright. Priced right.",
   "This place was good, I got the chicken shawarma"
  ]
 },
 {
  "name": "Cheever's Cafe",
  "address": "2409 N Hudson Ave, Oklahoma City, OK 73103, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a5788ce4-9332-11ea-9a44-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "eat",
   "history",
   "family",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=217247908140213911",
  "source": "GoogleMaps",
  "reviews": [
   "The chicken salad with fruit was very good. Excellent service every time. The ice cream ball is beyond wonderful, and it's complementary if it's your birthday! It can get noisy when it's really busy, so go at slower times if that's a concern for you.",
   "Celebrated our wedding anniversary here and had a great time. Food was delicious, must try the chicken fried steak, best I've ever had. The portions were large, my wife and I shared one serving. The waiter Will was awesome and made the night very enjoyable.",
   "Excellent experience from the time we got there until the time we left. Very prompt attention and Service from the minute we walked through the door. The hostess was very pleasant and greeted us immediately. The waitress was very attentive and accurate. The food was amazing from the first bite until the last. My wife and I both tried the chicken fried steak and I cannot even express in words how amazing it was. 5 stars +. Cannot wait to go back!",
   "Brandy was absolutely amazing! It was a beautiful day so my cousin and I enjoyed the patio tables. They were accommodating with us bringing a dog. Everyone who worked there was very pleasant. I was happy to eat there and will be telling my friends.",
   "I will say this, this is a cool place to eat. Service was amazing and the food was very good. The chicken fry was really good. You get two mind you and it w fill you up. The steak was great as the veggies and pico were awesome. You must save room for the chocolates cake as that will finish you lunch or dinner off with a smile. The decor was very cool too. An old flower shop that was owned by a local family. The details are on the menu so take time to read the history. Will be back."
  ]
 },
 {
  "name": "Charleston's Restaurant",
  "address": "2000 S Meridian Ave, Oklahoma City, OK 73108, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a5c1f21a-9332-11ea-9bc6-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9995273657061437338",
  "source": "GoogleMaps",
  "reviews": [
   "Fresh food. Great taste. Good quantities. Amazing salads. Excellent service. I honestly can't think of a single negative thing about my visit here. I don't think you could go wrong with anything on the menu. They were very accommodating to dietary requirements, too!",
   "Absolutely amazing! Everything was just about perfect! It was clean. The wait-staff was very attentive. The food was beyond delicious. I honestly don't have one criticism about any of it. I had an excellent experience and would definitely make this a priority dinner stop in the future! Highly recommended!",
   "Absolutely fabulous from the time we walked in the door! Greeted with a smile, seated right away at a very clean table with menus. Our server came over right away for drink orders, then promptly brought them & took our order. The marinated rib eye was the best I've ever had! The salad was fresh & had everything including my favorite dressing. The croissant served with salad was divine!  Even though full from dinner, it was my husband's birthday so we got the Apple cobbler a la mode❤\nI can't say enough positive things about Charleston's. Definitely will be back!",
   "Our server was great.\nFood was good. \nThey sat five of us at a small table. Barely room for food and drinks. A few times we had staff literally reach between my husband and his plate to deliver drinks, without warning. Spilled some on him.  Hoping they were new staff and training in their near future.",
   "We visited while on a business trip and were pleasantly surprised. Definitely lived up to the high reviews. Drinks were good, the shaved roast beef on the French Dip was perfectly pink and added great flavor. It was a little pricier than we thought but was worth it."
  ]
 },
 {
  "name": "The Mule",
  "address": "1630 N Blackwelder Ave, Oklahoma City, OK 73106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a6173e4a-9332-11ea-a649-14b31f159f22.png",
  "tags": [
   "delicious",
   "kids",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1204916378356047324",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic sandwiches! Grilled cheese are my all time favorite and theirs are absolutely delicious. My kids love the mac and cheese too. Everything in this store is inviting, really great place for some comfort food. Will definitely come back for more!",
   "The reviews were good for the Mule so decided to try it for lunch since I was in the area for the day. It's a rustic little joint but food was delicious. Chose the special of the day, the Rowdy Cowboy which was brisket & bacon in a very cheesy cheese sandwich with onion rings. I would go back in a heartbeat!",
   "Good spot well hidden in OKC.  Known for good vibes and soled drinks, this place is worth a stop.\nThe menu is well thought out.",
   "Great service. Wonderful bar and the bartender (Josh) is awesome. Soup and salad were great too! I'll be back on my next visit! Looking forward to trying a new cocktail next time too!",
   "Absolutely great service, different hipster kind of atmosphere or frequenters anyhow. Easy parking for customers. Always busy but they take care of you timely. 10/10 would recommend on cleanliness, friendliness, quality, choices, pricing. Everything here is a win. If you needed a review to decide, you've taken entirely to long to get in here, go now!"
  ]
 },
 {
  "name": "Whiskey Cake Kitchen & Bar",
  "address": "1845 Northwest Expy, Oklahoma City, OK 73118, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a661b634-9332-11ea-a585-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "unique",
   "food",
   "delicious",
   "food",
   "delicious",
   "family",
   "unique",
   "food",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=8459922730774628772",
  "source": "GoogleMaps",
  "reviews": [
   "Great food and even better cocktails! I like that the menu changes up a bit depending on the season, and the cocktails are fun and unique. The bill can rack up quick if you aren't paying attention, but if you're go in prepared for that, it is a nice experience. The service is always great. Sunday brunch has a fun build your own bloody Mary bar. And you have to end your meal with a whiskey cake for the table, because celebratory reasons aside, it's in the name!",
   "Love this place! The food is as farm to table as it gets. They have locally grown suppliers so their menu is seasonal and always changing. Their cocktails are phenomenal! The cheese board had been excellent and unique every time. But the deviled eggs..... always amazing!",
   "The food was delicious, I just think it's overpriced.  The atmosphere was pleasant, industrial/farmhouse simple, we were there for early afternoon, I bet night time is the right time.  We ordered the deviled eggs.  I really enjoyed their take/presentation on a classic picnic food (fresh basil/salami).  I had a burger.  It was a little too much bun, and the cheese was rich, but great flavor.  My husband ordered their chicken and waffles... that had an interesting flavor, bacon in the waffle batter, and a rich gravy over the chicken.  My absolute favorite was the Whiskey Cake recommended by our hostess.  Fresh whipped cream, vanilla ice cream with sponge cake soaked in bourbon and caramel topped with pecans.",
   "Celebration of a promotion in the family. Start with the deviled eggs, it's a must! My daughter and I shared the pickled Rachel and the three little pigs (BBQ pork sliders). We loved them both! Our table also had the switch up and the double double. The chips are seasoned to perfection. Everything we had was super delicious. The staff was delightful from the time we walked in the door. The server was wonderful and it was just an overall great experience.",
   "My second time here in a week.  Both times the food was really good. Not sure if Whiskey Cake is a chain, if so this place he feels so unique like it’s one of its own kind. I had the Turkey burger with a side of the blackened Broccoli with cashews and Parmesan, the second time I had the Pastrami sandwich with the blackened Broccoli, and my daughter and I shared their Whiskey Cake for dessert. Ran into a minor issue the first visit and the Managing Partner (Robert) took care of us. The staff is knowledgeable and pleasant. Ten for ten will patronize Whiskey Cake again. Thanks Robert and team."
  ]
 },
 {
  "name": "Red PrimeSteak",
  "address": "504 N Broadway Ave, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a6ad6464-9332-11ea-bcc6-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6467600683930735618",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to eat! A+ atmosphere A+ food and A+ service. The entire staff takes great care of you! Brooklyn does a great job of waiting on you! She explained the menu and options to a tee! Highly recommended place!!!",
   "We absolutely LOVE red prime! It's a little on the pricey side- (you get what you pay for!) so we only get to go a few times a year for special occasions. They never fail to disappoint! The wait staff is always very attentive and the food always comes out perfect. The prix fixe menu is a good deal, and so so much food! Try the chop house salad you won't regret it!",
   "Hands Down The Best Steak In Town! \nIf you want one of the best steaks in Oklahoma City, come here! It is on the high end as far as price but it is worth splurging once and a steak cooked to perfection. Highly Recommend this place!",
   "Best steak my wife and I have had in a long long time! I took her here for New Year's Eve. We will definitely be back in the future! Be prepared, it is a little pricey but, the food is to die for and absolutely worth the price! The wait staff was amazing and very helpful as well as very attentive. The bartenders had good conversation and amazing drinks while we waited on our table. Highly recommend for a nice date night, I also recommend getting a private booth if you're going on a date, it made the evening that much better!",
   "We had Jason as our server. He was top notch and and super friendly guy. The food was pretty good as well. Not a bad place honestly. The blue crab lump crab meat was super good."
  ]
 },
 {
  "name": "Redrock Canyon Grill",
  "address": "9221 Lake Hefner Pkwy, Oklahoma City, OK 73120, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a6ef7668-9332-11ea-998c-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "family",
   "food",
   "kids",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18024707086159946252",
  "source": "GoogleMaps",
  "reviews": [
   "This place is absolutely fantastic! Not only was the food absolutely to die for, I CAN NOT emphasize the phenomenal service my family and I received, enough! It was completely packed due to it being Valentine's Day but they never wavered. One hostess even showed my mom to the restroom despite of how busy it was. Mason was not only very knowledgeable, he was friendly and welcoming. Three service team works together to make sure you have everything you need, regardless if you're they're table or not. Our food arrived at our table quickly and it was delicious. The atmosphere and the ambiance along with the lakeside view are superb! I would highly recommend this location to any and everyone!",
   "1st time visitor. Got the pork chops as is from the menu. I requested well done. It was done well, not dried out, not tough. Completely done and still juicy, very flavorful. It came with mashed potatoes and whole green beans. The worst thing on the plate was the mashed potatoes and they were still quite good. We got a lakeside table with a gorgeous view of the lake as the sun went down. Also an interesting view of the chickens roasting on a large spit. The entire waitstaff portrayed joy in their jobs and made sure that the experience was awesome. One of the managers checked on us twice, once early in the meal and once again after we had had a chance to really determine if it was as good as we 1st thought it was. It is a little pricey for us but comparative to Charleston's for the same meal, but better flavor and better ambiance.",
   "I just went last night and I want to go back! Nice casual-upscale restaurant. You could go dressed up for an evening date, but you could also bring the kids. I have a younger kid and a toddler and they liked all of the food we got! Even the house salad, they really liked the Adobe dressing. They don't usually like salad! Very large portions, my husband eats a lot, and he had to share his meal with the kids (who liked his entree better than mine) and still had enough for himself.  I think I have enough leftovers for two meals. Service and staff were awesome; never had an empty glass in front of me and waitress/hostess were friendly.",
   "We enjoy eating here but we dont do it too often because of the limited menu and the cost is on the higher side. The food is always good and the atmosphere is nice if you want to look out at the water. The service is always attentive and friendly, always a great group of young people. It was a nice place to have a Valentine's Day dinner, we got there early to beat the crowd.",
   "The venue is gorgeous, staff attentive, and most importantly the food is sensational. Every side, every element of my meal was cooked to perfection. Definitely somewhere I plan on going for a long while to come."
  ]
 },
 {
  "name": "Hideaway Pizza",
  "address": "901 N Broadway Ave #5810, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a73fb99c-9332-11ea-9fef-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "affordable",
   "delicious",
   "walk",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7548167414766575503",
  "source": "GoogleMaps",
  "reviews": [
   "Everybody loved the pizza, both the one with red sauce and regular crust, and mine with Alfredo sauce and a cauliflower crust. The wife liked her salad as well.  The garlic knots we got as an appetizer were a hit as well.\n\nFriendly waitress (December, who was tipped well for the excellent service), nice clean restaurant, decent craft beer selection. We ate here on a whim, since we weren't familiar with the area, and we were not disappointed. Will definitely be back again next time we're in OKC!",
   "Great Food, Great Service, Great Environment. \nThe fried mushrooms are delicious! And super affordable. I ordered the \"Capone\" and I'd highly recommend it. Every ingredient was fantastic and cooked well. Madison, \"Madi\" was our waitress + she was awesome. The mudslide dessert was great too!",
   "We went to Hideaway Pizza on a Friday evening. We were able to find a parking spot and walk right in and had to wait a short time to get a table. We ordered friend ravioli which is delicious and a Maguerita pizza. The pizza was good. The French fries were good too",
   "I went with a work group and this place was fantastic. The food was amazing and the atmosphere was great. They can also do half and half on any size pizza with any of their speciality pizzas. And if you get a drink other than water, they give you a cup that you can keep at the end. Definitely recommend.",
   "OMG this place has perfected pizza I live near the one in Fort Smith Arkansas 3-4 hours away and let me tell you they are both great. So 5 stars everyone I would highly recommend you try every one of their pizzas I have lol. And they are all 👌"
  ]
 },
 {
  "name": "Trapper's Fishcamp & Grill",
  "address": "4300 W Reno Ave, Oklahoma City, OK 73107, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a79294ba-9332-11ea-823b-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "delicious",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6680793768954862087",
  "source": "GoogleMaps",
  "reviews": [
   "This was a pleasant surprise. Of course the atmosphere was great, outdoorsy, camping / fishing feel to it. They were very accommodating as came with a group and more people showed up than we thought so we needed to move tables!  \nThe catfish was great along with the creole potato salad as a side. The service was outstanding as well.",
   "The waitress Ashley was a great server. It was very attentive and I had a good sense of humor. She was very knowledgeable in the menu. That's working in the restaurant industry for over 20 years. It was nice to see somebody that know that they're doing a good job. Thanks, Ashley. Next time we come to town we will stop in.",
   "Beyond delicious.  Love the Prime Rib. I am giving 5 stars ... Because we have eaten here many times and this is the 1st we had bad bar service.  Super nice servers  Feel good ambiance and the food was outstanding.  The quail legs little, but delicious.  ... Although we suffer a bit of bad service with the food service at the bar... Still a Quaint space and location w/ a proper bar. An easy favorite for the OKC area.",
   "One of the best places in Oklahoma City to eat. The crab cakes are amazing and the shrimp on a shingle is some of the best shrimp you will ever eat. Their blackened prime rib is the best you will ever eat. Same thing with the blackened redfish. Everything on the menu is top-notch. To many things to list. And many different kinds of food on the menu for any kind of appetite. I eat here all the time and highly recommend it to anyone.",
   "We have been here 3 different occasions as we've come into OKC from the Tulsa area and have loved it each time we've been. Found it completely on accident, the first time and we're so glad we did. The food has never disappointed and neither has the service. It has always been wonderful, timely and the atmosphere is great also. We will continue to come back when in town. Our server Matthew C. was a delight on our 3rd visit as well."
  ]
 },
 {
  "name": "Ranch Steakhouse",
  "address": "3000 W Britton Rd, Oklahoma City, OK 73120, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a7e3e976-9332-11ea-a47f-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "knowledgeable",
   "food",
   "food",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9330039975159806164",
  "source": "GoogleMaps",
  "reviews": [
   "The place is perfect for a luxury date night. The steaks were cooked beyond perfect and the cocktails were deliciously blended. The butter for the rolls was so sweet and delicious I had to have more rolls.\nThis place is pricey with the lowest entrees being $30 and going as expensive as a $80 steak. All steak toppings are extra. The sides are all a la carte family sized portions for $10. But the service and quality are top notch as the atmosphere is wonderful for a date or family gathering. \nI would highly recommend trying this place for yourself if you want to feel fancy.",
   "We have lived in Oklahoma City for 18 years. The finest steaks have been served by Ranch, Mahogany and Red Prime during that time. When the Mathis Brothers took over, a clear improvement was made in management and execution as well as quality of items served. Now, I would suggest Ranch is one of the best steak and seafood restaurants in the nation. At this point, I take all my out of town guests there, and no where else. It’s actually amazing how consistent the quality has been over the last 2 years. Bravo!",
   "Good food. waitress was very knowledgeable and made it easy to help me know what to order as a first time steak eater. You get what you pay for and don't even think of going if you're not ready to spend at least $100.00 . This wine was amazing $15.00 / glass. We Will go back after we win the lottery.",
   "The steak is good. The place is nice. The prices are expected. I would only come back on special occasions. The ambience is much like I would like a place titled “the ranch” should be. I felt immersed in the experience of my food. \nThe four stars come from comparing steak houses in Oklahoma City. RED - another steak house in Oklahoma City has comparable prices and ambience however the steak melted in my mouth and was much more buttery in texture than The Ranch. If the provider of the meat is the same then it is an issue that can easily be resolved in the kitchen. If, on the other hand it is a different provider then I would simply recommend RED if you live closer. \nIf you live closer to The Ranch it is not worth the drive. Going to The Ranch will fulfill your palates craving in full.",
   "Wow, just wow!  I ate dinner here recently and was honestly the best restaurant experience I've ever had.  \n\nThe food was absolutely out of this world.  Their grilled shrimp just incredible, Wagoo like nothing I've ever tasted before, mac &cheese with crab just amazing and finally, a steak which was incomparable to anywhere else!\n\nJustin was our waiter and if you make a reservation, ensure he's your man; just an incredible guy.   Super knowledgeable about the product, where it came from and can recommend complimenting foods like you wouldn't believe.\n\nThe restaurant itself has a fantastic upscale vibe.  Very aesthetically pleasing, and plenty of seating.  There are also a couple of private rooms and an awesome outside area.\n\nThere is easy parking out front, and it's easy to spot from the main road.  I cannot WAIT to go back.  Incredible."
  ]
 },
 {
  "name": "Charleston's Restaurant",
  "address": "5907 Northwest Expy, Oklahoma City, OK 73132, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a82b7a34-9332-11ea-a4d2-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "delicious",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6903457512811478067",
  "source": "GoogleMaps",
  "reviews": [
   "I love to come here for the prime rib. You can choose raw or creamy horseradish and they cook it perfectly to your liking. They also have the best LITs. They also have awesome baked potato soup.",
   "Great food and service. It's far from where I live, but their service really impressed me, especially with the manager double-checking on us because of a few minute wait for some of our party's food to be ready (they ordered something that took longer to be cooked). Our waitress was also more attentive than most other restaurants I've been too lately, which was refreshing. Definitely made us feel like valued customers. I was pleasantly surprised by the service. Great food for the price level/tier. I'm not sure if their food is unique, but it's good for the genre of food that it is. If you're in that part of town, I'd say it's definitely worth going to. Their salads, flatbread pizzas, and steaks are usually what we get. I can't speak for their other food, or their seafood (?), but the usual food we order we have liked.",
   "Moved here from Seattle, read the reviews on this restaurant and decided to try it.\nI read there was a favorite sirloin that was marinated in soy honey and ginger and asked about it because it was not on the menu.\nThey were out of that particular steak on this Sunday eve but my waitress Patty said they did have a marinated Hawaiian ribeye (also not on the menu) and I chose that.\nIt definitely was an up-sale $ from the menu sirloin but it was totally worth it.\nI ordered my steak pink and juicy inside which I consider medium and it was perfect.\nI also read a review that their carrot cake was scrumptious so I ordered that for dessert and I have to agree it was delicious!\nMy waitress Patty deserves kudos for being one of the best servers ever.\nI also have to mention Michael who continued to keep my water filled and made sure to ask if everything was to my satisfaction. The service is totally upscale and this fast became one of my favorite restaurants in Oklahoma.",
   "Great food. GREAT SERVICE!!!! Amazing drink. I had the salad. The roll was sweet and light. Just enough salad dressing. My sister had the chicken fried chicken, the mashed potatoes were tasty.  The catfish was pretty good as well. We took the carrot cake with us.",
   "This place is always so good and worth every penny. They have the best service and are always so accommodating. I've been coming here for years. All the Hal Smith restaurants are amazing and if they aren't they will make it right! I highly recommend this place for any occasion."
  ]
 },
 {
  "name": "Pearl's Crabtown",
  "address": "303 E Sheridan Ave, Oklahoma City, OK 73104, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a86e76b0-9332-11ea-aa37-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2874844818997370892",
  "source": "GoogleMaps",
  "reviews": [
   "Convenient fix for the location. The staff and management were very welcoming. The Appetizers were satisfying(I had the fried calamari and wings). I’d compare the seafood platters to your average seafood buffet style. Mixed cocktails carried a slight punch especially for only $5.00, overall would return to order plenty of appetizers and drinks.",
   "We just finished eating at Pearl's Crabtown Bricktown location Dine In. It was Awesome! Staff and management followed all safety procedures. It was a great and a relaxing experience.  Food wonderful. Everyone be sure a dine in. They are top of the line in food service.",
   "1st time visiting here. Came on our son’s recommendation and was definitely not sorry. Gumbo was excellent and very good. If I had a way to get it home, I would have taken a gallon with me!!!  Red beans and rice was good as was the jambalaya. Service was great and fast. Will visit again when we are in town.",
   "The waitress was great. Dishes were dirty, had to send them back several times, finally asked for plastic cups, the food doesn’t taste Cajun and they serve it With Old Bay which is Baltimore not Louisiana seasonings. I’m from Louisiana and the food didn’t have any Louisiana spices on it. Drinks were great. 1 hour wait to sit and about an hour wait in the food and my crab cakes cake out one at a time. I will never eat here again. I spent $$$ at this place and I will not be recommending this place to anyone.",
   "Outstanding oysters! Best I have ever had, and we frequent coastal restaurants! Our convention-training partakes of Pearl's  every first week of March. The only issues are they always run out! We love this place!"
  ]
 },
 {
  "name": "The Drake",
  "address": "519 NW 23rd St STE 111, Oklahoma City, OK 73103, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a8b591cc-9332-11ea-882e-14b31f159f22.png",
  "tags": [
   "food",
   "knowledgeable",
   "food",
   "unique",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11040252358071247719",
  "source": "GoogleMaps",
  "reviews": [
   "Take a step back to a more elegant time. The dining room is at first a jolt to the senses,as it is very open in stark contrast to the visually busy street outside. But that jolt is fleeting as your senses absorb the beauty and aromas of the atmosphere inside. \n\nAs ample as the space inside is, and as open and airy as the room feels upon first entrance, the seating brings you in comfortably close. The booths provide you with a cozy \"snug\" which somehow magically envelopes your group making for ease of conversation regardless of how full the restaurant is, in no small part to their ability to block out sound from around you.\n\nEach element of hardware, material, flatware, furniture, and decor are masterfully paired with one another culminating in the most cohesive and coherent story being told through design. \n\nThat story is undeniably, \"Welcome back.\"\n\nNot just welcome back to the restaurant,  but rather welcome back to a time when elegance, service, and product mattered.\n\n When style with a smile was in.\n\nTo say the service was phenomenal would be a disservice to the level at which the people here hold themselves. They deserve a standing ovation for the level of detail the amazing people here achieve in even the smallest interactions with the guests.\n\nThe food meets that standard and more. Voluminous portions pair with stratospheric  flavor. There is value in what you partake of here. Every dollar counts toward the end product of what can only be described as an occasion. \n\nOf the many places one could choose to treat your palette, The Drake is by far the greatest and only choice for me.",
   "The ambiance was great, the service was wonderful, the food and drinks were superb! We had a bigger party than initially expected, but they were very accommodating and more than willing to make sure everyone fit comfortably. Our server was very pleasant and knowledgeable, she made great recommendations and was willing to go above and beyond for all our requests and concerns. We had the lobster roll, the crab cake - avocado special, and some oysters and were genuinely pleased with everything we were served. We’ve been on an “OKC food tour” and have been disappointed over the last few months but The Drake restored our faith in the food scene. We’ll definitely be back to try one of the private cubicles!",
   "Great service and unique menu. The family style paella was the best and a favorite each time I visit. Overall a great place for seafood dishes that are different and more fusion type cuisine.",
   "Valentine's dinner. Had reservations...got the tiniest table. Everytime the waitstaff brought something we had to juggle for space. They apoligized over and over for the tiny table. We had to put the bread plate on the bench seat. Crazy tiny! Dinner was mostly great. The grilled and chilled shrimp were tough. For $19 they should be cooked correctly. Clam chowder did not taste like clams. Tasted like potato soup. Calamari was terrific. Crab cakes delish.",
   "Our waiter was fantastic! Very sweet and courteous. Food was amazing. Oysters were very fresh! Drinks were phenomenal! I recommend the Cucumber Margarita and the Bloody Mary. I'm extremely picky and they were made to perfection!  Our first time there. We will be back."
  ]
 },
 {
  "name": "Patrono",
  "address": "305 N Walker Ave, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a90119da-9332-11ea-b04b-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "family",
   "food",
   "food",
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=3857102245885592138",
  "source": "GoogleMaps",
  "reviews": [
   "I don't have to go to New York, San Francisco, or Dallas for truly unique food. It is right here in Midtown OKC! Simple elegant food with tremendous flavor. A one of a kind restaurant that provides a wonderful dinning experience.",
   "My family and I love this place. We live close by and are somewhat of regulars there. Every time we go, we are always greeted with smiles, hugs and “good to see you” from the entire staff. The food is incredible, the drinks are stellar and the ambiance is soothing. Highly recommended.",
   "Great ambiance and service. My food was too spicy for me, so I didn't enjoy it much, but that was more personal preference than food quality. On the flip side, a few of my friends with me didn't enjoy their food very much either, so mixed reviews overall. As with many nice restaurants, portion size seems small given the price for them, but with the bread they brought before the meal, I was comfortably full. I'm not, however, in any hurry to go back.",
   "Wonderful dining experience! I had the mushroom risotto with a chicken breast on the side. They were excellent. The chicken almost melts in your mouth. Service was exceptional too. Definitely will be back!",
   "Fantastic pork chop, butterscotch pudding was ok, veggies in both my and wife's dishes were perfect.  They were accommodating to my wife's allergies and were super friendly.  Service was quick.  Not cheap, but appropriate for the quality."
  ]
 },
 {
  "name": "Vito's Ristorante",
  "address": "7628 N May Ave, Oklahoma City, OK 73116, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a9466078-9332-11ea-89b8-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "food",
   "delicious",
   "eat",
   "food",
   "delicious",
   "food",
   "walk",
   "family",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8118139888053110020",
  "source": "GoogleMaps",
  "reviews": [
   "I travel often and try to eat local as much as I can. Do yourself a favor and eat here! You walk in to an intimate dining area, and are immediately greeted by the family members that own the spot. I got my food to go, and it was a fast turn around. Everything was delicious. From the included bread, to the creamy potato soup and savory entree. I stuck to the classics, spaghetti with meatballs - large portions, and absolutely amazing flavor. If you've ever had authentic Italian home cooking, you'll appreciate this place. I'll be back anytime I'm in town! Highly recommend, both in taste and service.",
   "Extremely friendly service.\nFood was tasty and well-priced.\nFairly small eating establishment compared to most other restaurants.\nWould recommend.",
   "A+++ service! The food was delicious. From the salads, to the entree, to the suggested wine pairing, to the lemon creme cake for dessert. Clean restaurant and restrooms but still quaint and casual. Again, I can’t say enough about the service. We will definitely be back.",
   "This is a really small, quaint restaurant that is very welcoming. Think small space, small menu, big welcome. The moment you walk in the door, you are greeted like family and they joke about pulling up a chair for you. It really is small, so if you go during peak hours, consider making reservations, and good luck finding parking. (There is a little overflow parking at the shops next door.) The chicken carbonara was a bit bland/not full of flavor, but it would appeal to most. We came at a peak time, without reservations, and there was a race being held in town that weekend, so they were totally packed. We still managed to be seated immediately, but the service was very slow. The waiter was scattered and seemed rattled. He forgot several items, and dropped a couple things. Otherwise, it was a pleasant atmosphere.",
   "I'm from South OKC, and this is the best Italian I've ever had in the state, and frankly this might be the best food in the state. I judge ever Italian restaurant by their red sauce, and Cathy's Sugo is the best red sauce I've ever tasted. And everything was delicious! We dined at Vito's on a whim, and we were pleasantly surprised by the service and the atmosphere. The place was small, yet it teemed with life. People old and young and everywhere in-between were made to feel welcome. The staff were all incredible and very friendly. It's a rare treat to be taken by surprise by such a splendid restaurant. We even ordered extra for carry-out so we'd have ample leftovers. We'll be sure to make trips up north just so we can eat at Vito's again."
  ]
 },
 {
  "name": "Nonesuch",
  "address": "803 N Hudson Ave, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a98d549e-9332-11ea-a7db-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "music",
   "food",
   "food",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10104868002421906392",
  "source": "GoogleMaps",
  "reviews": [
   "Such an amazing and unforgettable experience. \nEverything about Nonesuch was enjoyable. \nThe staff was incredibly knowledgeable and attentive. \nEach course was timed perfectly. \nMy cup was always full. \nThe food was sensational. \nThe music was something of a heavy metal and was superb. \nThe best part was the fact that they were able to create 100% vegan options.\nThe vibe of Nonesuch is upscale and laid back blended into one. \nI highly suggest giving Nonesuch a try.",
   "The perfect place for a date night. Nonsuch is a GREAT restaurant.  From the moment you arrive, you can feel that the atmosphere is nothing you've even experienced before. The entire staff are consummate professionals. It's a sensory overload of sight, sounds and aromas.\n Be flexible with your dates because you will most likely need to book months in advance",
   "This is a great place.  It is small, and the service is wonderful.  It has a set menu that changes seasonally.  The food is exceptional and very different.",
   "We dined at Nonesuch last evening and were blown away by the amount of effort they went to in creating visually stunning micro dishes.  Unfortunately, most of the courses lacked depth of flavor and they were tiny.  We felt like we spent way too much money for a tiny amount of food.",
   "Nonsuch’s tasting menu is a great adventure to say the least. The presentation, service, and staff are fantastic to say the least. Some courses worked great while others fell short. The experience was nice but the portions are quite small. You will definitely go grab some food after this tasting menu."
  ]
 },
 {
  "name": "Grey Sweater",
  "address": "100 NE 4th St, Oklahoma City, OK 73104, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a9d4335c-9332-11ea-ba51-14b31f159f22.png",
  "tags": [
   "delicious",
   "approachable",
   "food",
   "delicious",
   "delicious",
   "art",
   "food",
   "tasting",
   "eat",
   "delicious",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6145057713340276705",
  "source": "GoogleMaps",
  "reviews": [
   "Hands down the best dining experience we have had in the Oklahoma City Metro area. Every course was delicious and beautifully plated. The wine parings were excellent, two in particular were perfect. However, what really stood out was the customer service. Everyone throughout the entire experience was exceptionally kind and attentive. I am not sure we have ever had this caliber of a meal presented with this kind of warmth. It is the perfect spot for a special occasion.",
   "My husband and I went to Grey Sweater for our anniversary dinner on November 30, 2019. We had a reservation on the early side and were the first guests that evening. We were seated at the counter so we were able to see all the prep and interact with the chefs/staff throughout the evening. Every single person we interacted with was friendly, informative and so enjoyable! \n\nShortly after making our reservation, the restaurant called and asked a handful of questions. In answer to one, we told them we honeymooned in Germany. During the course of dinner, they brought out a German beer as a gesture to personalize our experience. It was so appreciated! \n\nTwice throughout the evening, Chef Black came over to chat with us and to make sure we were enjoying ourselves. It's always a pleasure to interact with the chef! Chef Black was so friendly and approachable, and when we left, he genuinely thanked us for choosing Grey Sweater and wished us a happy anniversary. \n\nIn addition to the second-to-none service, the food was INCREDIBLE. Every single course was something special and new. We dine out often and love coursed dinners like this one. We chose the 7 course dinner (for our 7th anniversary), and all seven courses were so special. \n\nSome highlights: \n- The sous-vide parsnip (first course) made me wonder why I didn't LOVE parsnips all along! The texture and flavor were unlike anything I've had before. \n- The scallop was my favorite course \n- it was the most delicious and perfectly cooked scallop I've ever eaten. I could have eaten ten of them! - The sea bream in a carrot top \"chimichurri\" was my husband's favorite - with a subtle but certain background heat. \n\nThe wine pairings were perfect (we did the silver pairing) and the amaretto they finished with was another welcome surprise (who knew I loved amaretto?!) Overall, this night was perfect and we cannot wait for a repeat very soon!",
   "My significant other and I dined here last night, and let me tell you - it was a phenomenal experience. Each course was tantalizing and delicious, but the real standouts (for me at least) were the dessert and the scallop. Absolute bliss. If you're planning on visiting this restaurant, definitely spring for the wine pairing. My significant other isn't a huge fan of wine (but I am), and let me tell you the sommelier knocked it out of the park with each and every course and earned both of our stamps of approval. She was also exquisitely pleasant to talk to and it shows that she takes pride in her work. \n\nThe only thing I would caution the staff (and patrons)  on is to pay very close attention to allergies. In my reservation I mentioned being allergic to peanuts, peas, and lentils (what can I say, legumes and I just don't get along) and the menu was adjusted so that I avoided the Thai peanut sauce, but in another course I was served a sauce with peas in it. I'm not extraordinarily allergic to legumes (plus I don't like making a scene), so I didn't say anything at the time, but for those with more serious allergies it could be a larger issue. It didn't stop me from enjoying the course by any means. \n\nAll in all, if you are looking for a place to celebrate a special occasion (or just enjoy seeing where the art of food can be taken) I would enthusiastically recommend Chef Andrew Black's Grey Sweater. I look forward to visiting Black Walnut very soon, as well.",
   "Overall, the experience was average. We have been to Nonesuch, so my expectations were very high. The 7 course tasting menu was good, but does not even come close to Nonesuch’s 10 course tasting menu  (which is cheaper than grey sweater’s 7 course tasting menu, by the way)...I am also not a picky eater, but there was a pear/ice cream dish (not the dessert) that I did not eat because it was not worth eating. We went for my boyfriends birthday and he was poured a significant amount more wine for each pairing...we weren’t going to mention it, but when he brought this up to the sommelier, we were told that “we had been poured more wine than normal the entire night”. After this awkward comment, he brought me two more tastings of the same wine and told me I “didn’t have to share with my boyfriend” if I wanted more wine. I felt that the entire experience was not worth the cost and if anyone wants an exceptional tasting experience, 100% go to Nonesuch.",
   "So somehow I got an invite last night for the preview of a new restaurant soon to open in OKC!!?!!!!!? @greysweaterokc is so awesome. The drinks we had and the food tasting was amazing! I am already a huge fan of @blackwalnutokc and now @chefandrewblack has his new venture with @greysweaterokc This is sure to be a warm, inviting and delicious."
  ]
 },
 {
  "name": "Mahogany Prime Steakhouse",
  "address": "145 W Sheridan Ave, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aa1a6264-9332-11ea-8e5c-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "delicious",
   "food",
   "kids",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7575512012842773360",
  "source": "GoogleMaps",
  "reviews": [
   "Had high hopes for a great meal, however, there signature lobster appetizer was like eating a salt block. In fact everything was way over salted. Steak was which was a bone in felled was very tender and tasty minus the top  layer of salt. The salmon was to salty to eat. The tuna appetizer was very good and cooked perfect.  For desert the key lime pie was good. Not the best I’ve ever had but still very good. The cappuccino was served in a large mug and seemed watered down. The service was great however and the manager did take the salmon and lobster appetizer off the bill so I was treated fairly. Take away is chef just needs to lay off the salt and let the flavors of the food come through.",
   "This steakhouse has excellent service and great food. Our server was very accommodating, and our food came quickly. I would recommend this restaurant to anyone looking to celebrate a special occasion. The parking was a little tricky.",
   "My girlfriend took me to Mahogany for my birthday this year. I had very high expectations, and Mahogany met them easily. There was a birthday card waiting at our table that was signed by the staff that night. This was very thoughtful. Both waiters were polite and educated on their menus and services. All staff members that checked on us wished me a happy birthday. The crab cakes and wedge salad were great, but the real prize was the NY strip and lobster mac n' cheese. Thank you again Mahogany, it was an excellent experience!",
   "Our experience was outstanding. The service was spot on, not annoying but my glass never got low, very friendly, attention to detail! The food was excellent, may be the best steak I've ever had; I've ate at Ruth's Chris, the Cattleman's, and other chain steakhouses, this steak was better by far! The lobster cargot is a must try if your a seafood fan. The dessert was the \"icing on the cake\"! Delicious and presented well.",
   "One of the best steak houses I've been to in any city. The food is incredible, service is top notch. My kids and I come to OKC every year to see a couple Thunder games and they ask to eat here after every game. They do a great job catering to Thunder fans and the atmosphere after a game is very lovely, while doing it in a very classy setting. Great place"
  ]
 },
 {
  "name": "Kitchen No. 324",
  "address": "324 N Robinson Ave, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aa68a8e8-9332-11ea-8d62-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12215222866662422624",
  "source": "GoogleMaps",
  "reviews": [
   "I adore this place! The wait staff was amazing, the food is great, and the decor is so perfect! It's a great place to go to celebrate a big occasion or just to get together with a few friends. You HAVE TO try the chicken pot pie! It's the best pit pie I've had!\n\nAlso, the extra big pancake is freakin' out of this world. If neither of those foods are up your alley, try any of the burgers or sandwiches. They are all pretty good. The fries are a little expensive for what they are, but the spicy mayo that comes with it is almost worth it. If you wanna spring the $5 bucks for an okay side of fries you won't be upset with the dipping sauce. \n\nGive it a try! Its all tasty!",
   "Been in here twice...has a modern feel.  The first time the service was not that great and they were out of a lot of items.  However the second time was better service and the food is great!  The pancake is one of the thickest I have had but manages to stay light and fluffy.",
   "A terrific find!  Seasonal offerings for reasonably-priced but up-scale dining in an attractive and polished setting.  The menu is has offerings for carnivores and vegetarians.  Service is helpful and attentive, without being overbearing.  In our party of four, each ordered something a bit different than and each came away convinced that we'd made the best choice.  The thing that we all agreed on was our hope to return the next time we find ourselves in Oklahoma City.",
   "Hidden Gem ~ the sweet potatoes were super delicious! My favorite ever! Friendly, attentive waiter, patient w/my substitutions. The manager checked how everything was when we were done. Chatted w/us a bit & was super sweet. Highly recommend this simple, elegant little place 👍👍",
   "Cozy and elegant. Amazing wait staff. Most importantly, the food is always excellent. The cauliflower bread pudding was one of the best things I've eaten in a long time. Parking can be a bit of a hassle here, but it's manageable."
  ]
 },
 {
  "name": "The Manhattan OKC",
  "address": "210 Park Ave Suite 150, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aaae6a34-9332-11ea-937a-14b31f159f22.png",
  "tags": [
   "drink",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10748705277705668075",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped by after the OKC Museum thru a google maps search and couldn't have chosen a better place. \nNot too far of a walk..maybe 10 minutes. \nGoogle directions were spot on.\n It has  a casual elegance.... ages maybe 30 - 60 crowd..  lunch menu had an awesome selection.. we chose sandwiches as lighter fare...and got there just after 3. \nGreat drink selection and Manhattan's  on tap.. severely types.. thus the name. Drinks are  what you'd expect to pay in a nicer place. $$\nService was excellent\n Attentive ... sociable and warm. \nHad to call my daughter who lives in OKC and tell her about this gem in the city. For a sophisticated but not stuffy or too noisy date night... this is a good stop!\nAsk for Brae as a server.. hes great.",
   "Absolutely phenomenal service and the food is Spectacular. Everything is just so fresh and delicious. I love this place",
   "Staff is amazing.  Owner is very attentive and an all around good dude.  Never had a menu item I didn't like.  The bar has all the standards and rotating seasonal cocktails all of which are generally awesome.  My go to place for cocktails with clients downtown.",
   "Nice little upscale bar and grill. Food is excellent and beer prices are good. Small place but wait staff and bartenders are excellent.",
   "Great service and the chicken wraps are amazing and the food has amazing flavor"
  ]
 },
 {
  "name": "Cattlemen's Steakhouse",
  "address": "1309 S Agnew Ave, Oklahoma City, OK 73108, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ab037b7e-9332-11ea-bba2-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16503287899146177443",
  "source": "GoogleMaps",
  "reviews": [
   "Can’t say enough good things about this steakhouse. We decided to go for breakfast and oh my the amount of food you get!  We ordered the ham and cheese omelette and the western omelette. They came with your choice of hash browns or home fries, biscuits or biscuits and gravy. Biscuits (homemade) were nice and hot so the butter melted. Our drinks were kept filled the whole time. Unfortunately, we couldn’t eat it all. We left full and extremely satisfied. \n\nSince breakfast was enough to get us through the day, we decided to return for dinner. The dinner steak is a top sirloin that was cooked to perfection and melted in your mouth. The prime rib was the same. Meals came with salad, your choice of potato and hot rolls (they were huge). We ordered an appetizer which was unnecessary, however, we didn’t know at the time that we would just roll out the door and to our car. Service for both breakfast and dinner was superb!!  \n\nThank you for making our little getaway special.",
   "By far the best steaks every time I have eaten here!  Having been born and raised in Texas and in the middle of cattle country, i have the authority to make this claim.  But beyond the excellent food, the quality in offering the best experience possible is unsurpassed! I had the pleasure of having Kim wait on me.  Gotta  tell you that lady gives the best service ever! I will surely return again and again!",
   "The BEST of the BEST!! Servers and staff are friendly, fast and professional. They really do treat you like family! Food is always delicious and priced reasonably. Love this place so much! If you’re new to OKC or visiting look no more- come here!!",
   "This is an Oklahoma tradition for great steak. \nWe arrived between lunch and dinner and had only a short wait for a table. The prizes were surprisingly reasonable and good portion sizes. We had a great waiter who chatted with us and made sure we had an amazing meal.",
   "Id say 3.5 stars. Steak and potato good.  Salad needs a Little work. They should offer onions in the salad. I was told the house dressing was like a garlic ranch.  Maybe i got a bad batch but there wasnt really any garlic in it. Tasted mostly like buttermilk. Yuck"
  ]
 },
 {
  "name": "The Jones Assembly",
  "address": "901 W Sheridan Ave, Oklahoma City, OK 73106, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ab57681c-9332-11ea-8f57-14b31f159f22.png",
  "tags": [
   "drink",
   "unique",
   "tasting",
   "eat",
   "delicious",
   "delicious",
   "knowledgeable",
   "eat",
   "food",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=206338142797659122",
  "source": "GoogleMaps",
  "reviews": [
   "This place is so unique. You can order an appetizer of the cheese and fruit pairing and it comes with established connections of pairing that are fantastic. So different but good tasting. This place is a little fancy for the look and pricing, but the atmosphere is great. Servers are very helpful and friendly as well. Great selection of beers and drinks as well. Worth trying if you are in the downtown area and want a new place to eat or hang out for a drink.",
   "I got to enjoy a lovely evening with my Mom at Jones Assembly for dinner. And let me tell you.....what a fantastic experience! The atmosphere and the service were excellent. My mom got the cheese platter and I the Buddha Bowl. Both of our meals were absolutely delicious. I went ahead and paired my Buddha Bowl with their Moscow Mule, it was very refreshing, and complimented so nicely with the Bowl. \nI will say the Buddha Bowl can be shared between two people.",
   "Everything our (large) group tried here was fantastic! The food was beautifully presented and tasted absolutely delicious. The wait staff caring for us was very knowledgeable and struck the perfect balance between being available without pestering. There was a slight mix-up in our reservation (technically our group's fault, not the restaurant) which the manager handled quickly for us.\nI would eat here again without hesitation. I highly recommend this place.",
   "Great place! \nThe dips and spreads app was great, as was the steak. The Nashville chicken was good, and seemed popular, but I think there was plenty of other options that were even better!\nDrinks were also good. Dixie Dagwood is worth a try.",
   "Quite a happening place! Lots of pretty people and a great bar scene. Also a great dining area that is remarkably quieter than you might think when you walk in. Food was hearty and quick with excellent service.  Specialty drinks were over the top!"
  ]
 },
 {
  "name": "Yummy Mummy",
  "address": "Bay#9 Food Court, 119 N Robinson Ave, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/abcc3c92-9332-11ea-99db-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "family",
   "food",
   "food",
   "food",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=17999303994551423820",
  "source": "GoogleMaps",
  "reviews": [
   "What a wonderful new place! So, if we share common interests in Egypt and food, you should love it here as much as we did. We were greeted by such a warm smile in a clean and comfortable place.  The food is amazing! It's not just the delicious flavor or the scent or the beautiful presentation that we remembered while talking about but the feelings it brought on not simply full but something more.  Satiated and happy we were sent home smiles on our faces and delicious baklava in a box to share the memory over later this evening.",
   "Perfect visit from start to finish. Excellent food. We ordered mixed Shawarma and chicken strips/fries. Food quality and temperature...thumbs up. Great service. My family member and I sat in the dining area for a long time talking. Staff were awesome...making sure we had what we needed. They weren’t put out that we sat so long at all! Parking is a little tricky (restaurant is in a crowded strip mall on a busy street) but not impossible. Definitely going back to support this establishment.",
   "The best Mediterranean food. I love the Chicken Fatta. Staff very friendly",
   "The food is excellent.  Very friendly service.  I believe that they are primarily a lunch place, but they are open for dinner as well.",
   "Unique flavors to please."
  ]
 },
 {
  "name": "Ludivine",
  "address": "320 NW 10th St, Oklahoma City, OK 73103, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ac161402-9332-11ea-8f79-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tasting",
   "knowledgeable",
   "food",
   "food",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=1170870104693708589",
  "source": "GoogleMaps",
  "reviews": [
   "Where do I start?  Wow, wow...wow.  The restaurant was beautiful and the staff was friendly and very knowledgeable.  The chefs killed it.  The chef's tasting menu was out of this world.  Local, fresh and amazing.  Well done Ludivne!",
   "This place is an absolute gem. ✨\nLudivine has a stunning, relaxed yet sophisticated vibe. \nThe drinks are awesome, the staff was great and incredibly knowledgeable, and it was immaculately clean!\nThey also have a great patio. \nI have not tried the food yet, but am excited to return in the near future.",
   "More of an upscale place and not really my taste. More geared to the millennial generation imo. Service was great and the food was interesting, not bad just interesting. If you want something different this is the place to go. Just not the typical place I’d visit again.",
   "Lovely Sunday evening experience with the tasting menu. We had two vegetarians and one no-seafood plus me (who eats everything), and they were able to customize the tasting menu per person. Wonderful service, amazing wine list, superb service... a gem on our trip to Oklahoma City!",
   "The new location is amazing! I enjoy several things on the menu but the bone marrow is unbelievable! Great drinks and fantastic service! Great date night spot or dinner with friends!"
  ]
 },
 {
  "name": "The Melting Pot",
  "address": "4 E Sheridan Ave, Oklahoma City, OK 73104, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ac5e8ea4-9332-11ea-95fa-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "delicious",
   "food",
   "unique",
   "family",
   "food",
   "cheap",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14929088845263865912",
  "source": "GoogleMaps",
  "reviews": [
   "The Melting Pot is a wonderful fondue experience for anyone looking for an unique twist on traditional dining. The 4-Course option is by far my favorite choice on the menu. You never leave the Melting Pot hungry or unsatisfied!",
   "We had the steak lovers 4 course meal again. We grilled our food this time & it was great. We had the loaded baked potato cheese fondue again because we like it the best. We tried the original chocolate fondue this time & I definitely like it the best of all we've tried. It brings out the flavors of your dippers instead of competing with them. Service was wonderful.",
   "Delicious! We sat in the bar area; if you want the other area, make a reservation. But we were very comfortable! The 4 course meal will feed 2-3 people. Great service, great food! Fun experience.",
   "Great service...be prepared to cook your own food and spend at least 2 to 3 hours here to get through the meal. It is definitely a unique experience, fun if you want to spend an evening out, would be fun for a family.",
   "Mary Peacock Smith this may not be the popular opinion but it is my honest one.  I did not like it AT ALL. I didn’t do any research before I went so shame on me for coming unprepared. I knew it had cheese and chocolate fondue and you dipped things in it and that is all I really knew in advance. I heard it was pricey and nice for special occasions. I did not know for $120 that I would have to cook my own food. Sorry but I work a lot and when I go out I want to be pampered. I could have cooked some cheap steak, dry chicken and 3 shrimp at home. Part of the appetizer is dipping bread into fondue. Cheese tasted scorched. Our waiter told us it was his first day and we were his second table so I tried to be patient with him not having much knowledge about the menu or cooking options. He said if we were ordering steak then he recommended the cast iron skillet cook.  No oil and absolutely no seasoning. The skillet started smoking and everything charred and stuck to the skillet because it was so dry. If looks could kill when he first brought us the raw food and set it down and I found out I had to cook it. 😒.  Then he tells us that we only get one choice of dessert because they set us at a table that only had one burner.  The dessert did taste good. I thought I was on a hidden camera show and someone was going to pop out and tell me I had been Punked. My daughter said it was an “experience”. Yes it was a memorable experience. Worst $120 I ever spent. I want to “experience” being pampered. I could have this experience at home. 🤷🏻‍♀️"
  ]
 },
 {
  "name": "Café Cuvée",
  "address": "First Floor of Ambassador Hotel, 1200 N Walker Ave, Oklahoma City, OK 73103, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aca8b758-9332-11ea-84cb-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=136258656525985544",
  "source": "GoogleMaps",
  "reviews": [
   "The staff was very friendly and welcoming! It is a small, intimate and warm environment. The food was absolutely delicious and the portions were good! We shared the chocolate mousse. It was just like s'mores and the three of us all loved it. But the way, the valet parking is complimentary if you're eating in the restaurant! I give it 2 thumbs up.",
   "Pretty cool place. Nice atmosphere. Staff was great. It was clean, good noise level. Food was good but I wasn’t overly impressed for the money. I’ll give it another shot some time, I’d still recommend this place to others.",
   "Great brunch, fresh fruit, delicious coffee, and the chocolate mouse is to die for. The atmosphere is elegant, comfortable and satisfying. Easy to share in conversation.  We will return, for sure.",
   "A very comfortable environment. The lunch menu was varied enough to suit the tables tastes. The service was good. The food was excellent. Had a TABS sandwich and tomato basil soup. (tomato,avocado,bacon & swiss). Best of all it was reasonably priced.",
   "Our waitresses were top notch.  I had the Tuna and it was cooked to perfection but what knocked me out was the vegetables that came with it.  OMG. Delicious.  I also enjoy the French flashcards on the table.and were pleased by the friendly and attentive waitstaff. The atmosphere is warm and inviting and prices are reasonable. I look forward to returning."
  ]
 },
 {
  "name": "Charleston's Restaurant",
  "address": "224 Johnny Bench Dr, Oklahoma City, OK 73104, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aceeac24-9332-11ea-99fe-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "tasting",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9009827844233979254",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing Staff. Great food. Beautiful. \n\nThe food was great and the restaurant is run smoothly. We never had an empty cup and every staff member moved in unison. Table assignments didn't matter, you received quality service and everyone worked together. I was impressed with the seamlessness of the operation. We were visited several times from different staff members. Christian and Joe stand out the most.",
   "Had lunch there today. Food was very good and the service was great!  I wasn't loving the side dish I ordered and was gladly offered another one which was very good. Pricey for lunch but we made the most of it and stayed almost 2 hours😀",
   "Good food and friendly staff! The croissants were absolutely delicious!",
   "I own two popular restaurants in another state, so I'm fairly critical. This restaurant was wonderful. The servers were attentive and courteous, with great presentation. I would hire any one of them in my restaurants. The food was perfectly prepared. We were in Oklahoma City to see a play with 2 other couples and stayed at a nearby hotel. We first chose Charleston's because it was so close to our hotel. The experience was so positive we went back the next night. The first night I had the Hickory Burger. Most delicious tasting burger I've had in years. The second night I had the chicken tenders, mashed potatoes and carrots. Amazing! The tenders were soooo tender! We all were 100% impressed and pleased with the service, the food and the atmosphere. I'll definitely return if I should be back in Oklahoma City in the future.",
   "The food here is so great. I had the rib dinner and the dynamite shrimp. So amazing. The place was nice and chill. The server was attentive. Thanks I'll be coming back."
  ]
 },
 {
  "name": "Mahogany Prime Steakhouse",
  "address": "3241 W Memorial Rd, Oklahoma City, OK 73134, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ad38283a-9332-11ea-83d1-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6052219944289353941",
  "source": "GoogleMaps",
  "reviews": [
   "Wow!\nWhat an experience. Service was the best. From the fresh ingredients to the attention to detail in the presentation of food was great. Taste of everything we had was the best I've had.",
   "I love this place. I have been here twice and will return again and again. If you are searching for not only a good steak, but the best steak you ever tasted, this is the place. The staff is always looking out for you and making sure you have a great experience while you are enjoying your food. Check out what’s on their nightly specials. What ever you order, you will not be disappointed. Try the bacon wrapped scallops. Wow.  Enjoy your time here, you will be like me and say, ‘I’ll be back!’",
   "Really awesome food and service! I'll go with my boyfriend and we'll share dynamite shrimp (my favorite part, sooo delicious) as an appetizer. For entrees, he gets the steak while I get the salmon, both really great options. Overall a nice experience each time, it's his favorite steak place by far and definitely a good choice for a romantic dinner together!",
   "Service was exceptional, food was fantastic. This was an enjoyable steakhouse that I'd be happy to recommend",
   "My sister and I came here for her birthday with my grandparents. Everything was going okay, until half way through my meal I found a piece of black hair about 1 inch long mixed in with my food. I told the waitress, who brought over the manager. He proceeded to mock me and tell me there was \"no way\" that was from the kitchen, it must have fallen in there some other way. My sister and I have long brown hair. My grandparents have white hair. The hair obviously did not belong to us. He then proceeded to bring out a new dish, and handed me a small flashlight so I could \"make sure my hair didn't fall in their again.\" They charged us for the meal, no discount. I was so disgusted I couldn't even eat the new meal, and was truly disappointed by the poor service from the manager. \n\nGo eat somewhere else. There are plenty of places that won't treat you poorly after THEY leave hair in your food."
  ]
 },
 {
  "name": "Mary Eddy's Kitchen x Lounge",
  "address": "900 W Main St, Oklahoma City, OK 73106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ad7eb91e-9332-11ea-9fac-14b31f159f22.png",
  "tags": [
   "delicious",
   "art",
   "eat",
   "food",
   "drink",
   "art",
   "food",
   "unique",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8050400883676854430",
  "source": "GoogleMaps",
  "reviews": [
   "Please don´t come and expect great food. There are plenty of other restaurants in Oklahoma City that offer a higher culinary experience for half the price. \nThe drinks and desserts are great! Fair price and great flavour. \n\nThe ambience was fantastic on the evening I attended as there was an art show inauguration which allowed for a post dinner show. We went as a large party and the service to the table was quick and effective. The cocktails ordered, flights of scotch and whiskey were all great which is why they deserve 2 stars.  \nThe baby scallops and ravioli were served with a cold sauce. The ravioli pasta was tasty however if thinner would have cooked better and allowed for the taste of the filling to be present. \nThe burger had a bun that seemed to have been just taken out of the bag. The meat was cooked to order and tasty however this is not superior to any specialty burger you could get at other restaurants. \nThe chocolate tart was presented beautifully. The vanilla sauce combined with the strong chocolate flavour was exceptional. It was inviting to eat and delicious throughout. \nThe drinks had great flavour and well priced. \n\nAll in all I will not come back for any food unless there is a drastic improvement. I will come back for drinks and dessert as the ambience was great for these.",
   "This place is always good! And the atmosphere is amazing. The restaurant is past the bar upfront. Outdoor seating is beautiful. Menus is nice and does change a little. Burgers seem to always be amazing! Good drink! It is a little pricey but for what you get it’s worth it. Fun spot and worth a stop. Sounds funny but you must go to the restrooms! Always a mini art exhibit on the way.",
   "We had the Valentine's Day Menu here. I loved the atmosphere and the experience of going here. (We also stayed at the 21C Museum and Hotel), but that being said I felt like the food should have been exceptional for the price we paid. The food was just good. We liked it, but not in a hurry to go back.",
   "Every time I have been here, I take a mental note to remember to come back asap. Every dish I have tasted here has been above my expectations and this time for brunch was no exception. The brunch menu is amazing and the migas, fried chicken sandwich and biscuits and gravy were par excellence. The fried chicken sandwich is unlike any I have ever tasted with unique flavors that are a secret recipe, which makes it all the more intriguing. Whether day or night, this space is to be experienced and the cocktails that are on the menu are all worthy of trying! Put this on your agenda post haste.",
   "Mary Eddy’s just debuted a new menu and it’s everything. \n\nI have a nightshade allergy, which tainted my experience before as I couldn’t even order the cheeseboard without some sort of nightshade on it. I always alert the staff, so it was very disappointing to have a dish show up covered in peppers. Truthfully, I had given up and started just going for cocktails only.\n\nLucky for me, they have tweaked everything and I feel like they really listened to diners on what needed to change. As soon as we sat down, the waiter asked who had the allergy and said they would help me with whatever I needed to have a safe dining experience.\n\nThe Chef kindly came out to introduce himself and talked through the allergy as well and said he would let me know any dishes that couldn’t be changed/modified. After that, there was only one time where a server who was just running food didn’t know if the plate he served was allowable for me- we flagged down the waitress and she helped us out, so no foul. I was able to eat an entire meal, including their divine sides (those Brussels sprouts!) and enjoyed a few delightful cocktails! Everything I had was delicious, but my favorite was probably the risotto- it was mouth-watering delicious.\n\nWe capped the night with their desserts and cotton candy, then toured the gallery of course! It was a delightful evening and fully redeemed all of my past experiences. I can’t wait to go back! \n\nLesson: Always give restaurants a second chance, especially when they present a new Chef!"
  ]
 },
 {
  "name": "Paseo Grill",
  "address": "2909 Paseo, Oklahoma City, OK 73103, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/adc5bfa8-9332-11ea-a051-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "family",
   "food",
   "knowledgeable",
   "kids",
   "delicious",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=14700858340821713894",
  "source": "GoogleMaps",
  "reviews": [
   "We had a wonderful time here for my family birthday celebration. Previous to this visit, I had only had catered food from Paseo Grill. I was excited to finally be trying it at the location to experience the full service.\n\nFrom the get-go, it’s a little confusing to determine where you should go to be seated. We walked in what felt like the back door and lingered inside. Quickly, someone came to seat us.\n\nThe booths in this section all have sheer black curtains enclosing the space. Though it’s a little hokey, we appreciated the extra element of privacy it created.\n\nThe craft cocktail choices were varied and seasonal. I happily chose a rhubarb drink which everyone agreed was just delicious. \n\nThe onto the meals. Wow. Everything was perfectly seasoned and flavorful. My favorite part was the cooked carrots.\n\nService wasn’t extremely consistent, there were some competing large parties in our section, but was friendly when they were at our table.\n\nI highly recommend this restaurant. I can’t believe it took us so long to dine here.",
   "The staff were all so warm and welcoming and friendly. They were very knowledgeable and helpful when ordering. You have to save room for desserts if you go there; everything except for one thing is a house speciality and their house-made whipped cream is amazing. They were also very sweet to my little one. Some places who don't have a lot of kids coming to their location can be kind of aloof or cold towards them but they were so sweet and thoughtful. Highly recommend them!",
   "Very nicely decorated.  Food was delicious and well prepared. I ordered the sirloin steak in a coffee rub with brown butter spinach and a jumbo shrimp on top. I also wanted to try the cheese platter but it never made it to the table? All in all Ixwould come here again.",
   "Lauren was a great server! We only ordered apps / drinks & dessert and we were made to feel welcome and were super comfortable. This is our second time here and always leave happy. Thank you for the great service and experience. Will return for all of our celebrations and holidays!",
   "Outstanding!  I Had the bison special for the night...  just ridiculously good!  I eat at steakhouses often while traveling and this was easily one of the better cuts of meat I have ever had! The stuffed scallops were amazing as well.  Highly recommend"
  ]
 },
 {
  "name": "The Mantel Wine Bar & Bistro",
  "address": "201 E Sheridan Ave, Oklahoma City, OK 73104, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ae0d7d52-9332-11ea-bc1f-14b31f159f22.png",
  "tags": [
   "food",
   "free",
   "food",
   "drink",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=339134446247775106",
  "source": "GoogleMaps",
  "reviews": [
   "Initially we got sat right at the entrance and by the kitchen, where it was a little noisy. We politely asked the host if we could change seats as it was special occasion and there were open tables throughout the restaurant. Initially she was very busy, but once we were moved they gave us complimentary champagne for our wait. The service and food was perfect! Very grateful for our experience and will definitely be back!",
   "We went on a double date with friends and my friend's salmon was mushy in texture rather than flaky as it should have been. The rest of our food was great! They brought her out a blackened chicken breast to replace the salmon, comped her meal, AND gave her a free dessert! Excellent service from our server Dillon too he was just the right amount of attentive and didn't give any attitude about replacing my friend's food. Atmosphere was relaxed and didn't feel stuffy like some other high-end restaurants. We had a very nice time!",
   "Amazing, attentive staff. They really cared about our whole experience. A very relaxing ambiance with good drinks (cocktails and wine). Very friendly, personable manager who walked around making sure everyone got the most out of their meal, they even brought us some complimentary mashed potatoes for the 2 year old with us.",
   "Decided to give them a try for NYE with my wife. Easy parking, greeted at the door, and seated quickly. They had a set menu for NYE, which is understandable. Nice variety on the menu. \n\nService wasn’t too great. I don’t know if the built in tip had anything to do with it, but it took forever to initially take our drink orders, then our food orders. Had a glass of wine and I believe they forgot I ordered it. Waitress blamed it on the bartender and then brought a bottle to pour the glass. Waitress also seemed to know a larger table of guest and went over to chat it up a couple of times. I don’t mind that, but her tables were waiting on things. \n\nFood was pretty good. Not exceptional, but was good. My wife got an 8oz filet and I got the duck. Thought it was pretty decent. Not $75 per person decent. \n\nWe may go back when there is a full menu and to see if the service is better.",
   "Very disappointed... my husband and I go to The Mantel every year for our Anniversary. This year we wanted to spend NY Eve there. So I booked a reservation. Today I get a call from a young lady wanting a credit card and to charge $160. I’m out Christmas shopping and can barely understand what she is saying. My first thought is who is this calling requesting my credit card. In this fraudulent time... handing out my credit card is a little unnerving. I have no idea who is calling. So I request they call me later. When I get home I decide to call the restaurant. I explain what happened and for them to explain to me what they needed. The young lady who answered had a total attitude. Explained we need a card because it’s the busiest time. 5pm on NYE is the busiest. Really. They need a card and to charge $80 per person. The whole situation was weird but then when I call to ask questions and get attitude I was done. I am coming to eat at your restaurant. I don’t have too. Please cancel my reservation! Customer service and phone etiquette do not exist anymore. I love The Mantel but I will go elsewhere."
  ]
 },
 {
  "name": "Rococo Restaurant & Fine Wine",
  "address": "2824 N Pennsylvania Ave, Oklahoma City, OK 73107, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ae4fb6ac-9332-11ea-a432-14b31f159f22.png",
  "tags": [
   "drink",
   "family",
   "delicious",
   "food",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6484959665016757882",
  "source": "GoogleMaps",
  "reviews": [
   "Classy a true hidden gem!! Rococo is a perfect restaurant for a romantic date night, family together, after work drink, or carry out. Excellent food,service and beautiful decor.",
   "Get the crab cakes, for the love of God get the crab cakes. Excellent cocktails. Great risotto. The lobster was perfectly prepared. A six star ⭐️ dining experience. TY Natasha",
   "The food was amazing. The staff was friendly. The only complaint was from my husband. He wanted to order the lamb but they were out. I had the rib eye and mashed potatoes and my husband had the veil with linguine noodles and a side of their fancy mac n cheese. Food was delicious! Great atmosphere too.",
   "The crab cakes are to die for!!! I could have this as a meal!! My husband had the duck and I highly recommend it. Excellent wine selection as well as other cocktails. The servers are very knowledgeable on entrees and helpful on recommendations. I love to sit by the fisktank but not A bad seat in the house. I like  A great Sunday brunch meet up, date night place, reunion or friends night out!!",
   "We ate here for Valentine’s Day. Which also happens to be my birthday. Which my husband told them when making the reservation and confirming the reservation. We sat at the table for 10 min before a waiter even acknowledged us. Then we had to wait for 50 min for our food. About 40 min in, I asked for some bread because I was really hungry. They never brought us bread. We finally got our food. The mashed potatoes were bland. My husband found a hair in his food. They finally brought us bread after we were almost done with our meal (after I asked again). Oh. Ya. And no one ever mentioned anything about my birthday. The only thing the waiter said all night was “we are really slammed tonight.”"
  ]
 },
 {
  "name": "Parlor OKC",
  "address": "11 NE 6th St, Oklahoma City, OK 73104, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ae971f0c-9332-11ea-9b07-14b31f159f22.png",
  "tags": [
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2685851809614868300",
  "source": "GoogleMaps",
  "reviews": [
   "This place is getting four stars from me due to the difficult location and the parking mess. Other than those two small complaints, the customer service is great and everyone in the building is kind and caring. They are willing to answer your questions with ease, even if you ask a million. \nIts self serve, you can leave a tip at each individual restaurant or bar and it's got a real upper Midtown feel. They have a ton of space and an upstairs and downstairs area. They also have an outside area with fire posts to keep you warm. I would recommend trying this place.",
   "A little on the expensive side,  ordered 3 tenders and fries. Fries were really good and seasoned well. Would of been a lot for $3 but adequate amount for $4. \nTenders flavored well but a little on the dry side. I'd say average size tender, not large though compared to price. They say served with slice bread. Its just that. Not toasted or anything. And a few pickle slices. Had to pay extra for dipping sauce. Overall I'd be happier if about $3 dollars cheaper total.",
   "It’s a better version of The Collective, or I suppose the Collective could be a knock off Parlor OKC. \nOur server was Paris and she was amazing, as was every other staff member that took care of us. \nEvery drink we tried was superb, especially the Tastes Like Fall margarita, it was like an applesauce margarita with real lemon and lime, not a sweet and sour mix. \nThere were limited vegan options but they are working on more. \nOne of our new favorite places, we cannot wait to bring our friends in!\nThe food, drinks, and service were amazing, the place was clean, the OU game was on, and staff was top notch. \nI HIGHLY suggest going in to enjoy the amazing patio, or to hang out inside with the relaxed yet upbeat atmosphere.",
   "Parlor OKC experience was pretty good. You have multiple fast casual restaurants all at one place. Pizzas, Mexican, fried chicken, Italian, grilled and more. Ambiance was good, staff was friendly. Definitely worth a visit. Definitely recommended.",
   "Went with a group midday on Saturday, and it was really nice on the patio. Good selection of foods. It would be fun to get small plates from each location to share."
  ]
 },
 {
  "name": "The Pritchard",
  "address": "1749 NW 16th St, Oklahoma City, OK 73106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aee03762-9332-11ea-9c50-14b31f159f22.png",
  "tags": [
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10534661012901103648",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped in during happy hour on a whim during date night. Bartender was great. Environment was really classy but welcoming. Drinks were really good and priced fair. We'll definitely come back.",
   "Exceptional restaurant in the Plaza district. Enjoyed the happy hour. Mussels in a white wine/cilantro broth was excellent.l The broth alone was delicious and came with toasted bread. Also had the fried chicken thighs and a charcuterie board which was also really good.Good wine and beer options. Check their website out. Highly recommended.",
   "We have been here many times and it never disappoints. It is a great place to grab dinner on a date or with girlfriends. The truffle fries and scallops are both excellent.",
   "From the second I heard the name I suspected this might be a good place. Of course I have a friend who has an uncanny ability to suss out local gems. Loved it. Tried the Jetsetter. A local concoction of white Sangria and Aperol. Then the charcuterie. We had two. Everything was perfect. Loved the charred cauliflower and Brussels sprouts.",
   "A gem, I tell you! If the decedent cuisine and artisanal cocktails aren’t enough for you, then perhaps the baritone voice of the ever-so-polite server will soothe you into contentment. I guess what I’m saying is they make good food."
  ]
 },
 {
  "name": "Charleston's Restaurant",
  "address": "1429 W Interstate 240 Service Rd, Oklahoma City, OK 73159, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/af26dd14-9332-11ea-91f2-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "kids",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3708637666095535479",
  "source": "GoogleMaps",
  "reviews": [
   "Enjoyed the elegant and relaxing atmosphere and had great service this delicious meal was worth the money",
   "ALL of the staff was helpful. Management gave us a complimentary app because the app we ordered took longer than expected. You must try the shrimp cargot. Simply amazing. If you're a rum person, get the Rum old fashion. Its a good, strong, smooth drink. Other than that, everything was awesome. Kids and wife enjoyed their food. Our cups were always full. Great job as usual.",
   "We had the pleasure of being served by Carson this afternoon. My wife ordered the Ruby Red Trout and I had the chicken tenders. The vegetables are cooked very well. The tenders were scrumptious and the trout was quality. My water glass was almost always full. We also had the spinach artichoke dip which was a great appetizer.",
   "Great service at the bar!  If you're looking for a higher end  mid-range dining restaurant, this is the place for you.  Will come back.",
   "We love taking our customers out for dinner at Charleston's! This is always a great place to go for any occasion because of the awesome food, fabulous service. The atmosphere is wonderful! We also take our grandchildren there because they're definitely kid-friendly. Having a great menu for the children."
  ]
 },
 {
  "name": "Charleston's Restaurant",
  "address": "5608 W Memorial Rd, Oklahoma City, OK 73142, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/af71c992-9332-11ea-ab1c-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "family",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17583160907117921524",
  "source": "GoogleMaps",
  "reviews": [
   "Went to the Memorial Road restaurant for a week day lunch. Got there 11:30 ish. Party of 3, got seated right away and had our order taken quickly. Service was good. Food came out timely and as usual, it was great. Had loaded fries as an appetizer. 2 Walt’s champagne salads, and pork chops, 2 sodas & 1 water. Tab was over $70.00.\n\nKinda pricey for lunch. \nWith all that said, we will go back.",
   "Appetizers, side dishes and main meal were good.\n\nUnfortunately, we were seated at a dirty table, given a drink in a dirty glass (food caked on the outside) and given a dirty menu.\n\nOnce we were able to get our waitresses attention, it was quickly addressed.\n\nSeveral if the individuals bringing out the food to our table looked and acted like they didn't want to be there.",
   "I really like Charleston’s for a simple date night, dinner with friends, or even a nice lunch. My husband and I will often order from the curbside pickup and service inside the restaurant and out is great. I try something different almost every time I’m here and am rarely disappointed. I’m not a fan of their baked beans, but everything else I’ve had there (prime rib, chicken, soup, salad, catfish, etc) has always been really good. My husband is absolutely obsessed with the salmon Caesar salad. It’s his favorite! The baked potato soup is also very good. I would definitely recommend coming here!",
   "Charleston’s has several locations and they are always good! I do wish they would offer some more options, but they have many staples that are always good. \n\nSpecifically, the croissants, glazed carrots, mushrooms, and roasted chicken tend to be my favorites. The dynamite shrimp is a nice appetizer as well!",
   "I primarily go for after work drinks with friends at the bar.  The restaraunt is consistently good food with good service, a bit pricey for a family dinner.  THE BAR is excellent.  Ask for the Tito's Vodka Press with fresh pineapple and strawberry mulled in, then not sweet or sweet.  Happy hour food is great.  Bar service 👏.  I like my drinks strong, and they get about a 2.5 on 0-5 scale for me, with 5 tasting strong."
  ]
 },
 {
  "name": "Firebirds Wood Fired Grill",
  "address": "1320 W Memorial Rd, Oklahoma City, OK 73114, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/afb892ba-9332-11ea-8c7d-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "knowledgeable",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11110493026369972462",
  "source": "GoogleMaps",
  "reviews": [
   "Service is top-notch. Absolutely the best I’ve probably ever experienced. The server was funny, friendly, on-point, and in the bustle of a Saturday night, didn’t miss a beat. \n\nThe food was alright. It’s pretty pricey for the quality though.",
   "Went to meet friends there on Friday night... Very busy but was able to get a table on the patio fairly quick. Our waitress Tracy was absolutely awesome... Always smiling and very attentive.  My wife ordered a grilled chicken sandwich which was a little dry and the French fries not very hot. I ordered the BBQ Chicken sandwich which also was dry and overcooked... It didn't have much taste other than the BBQ sauce which was good. My fries were also lukewarm at best. Our friends ordered the prime rib which came out great and they loved it.  Fairly expensive for chicken sandwiches with a spare amount of lukewarm fries!",
   "We had a great experience! Food was fantastic, staff was prompt, kind and knowledgeable about menu items. Moderately priced and great atmosphere. Two seating sections reservations both ambient lighting and walk in table tops! Great service all around!",
   "Amazing upscale steak restaurant. It's fairly new so we had been wanting to go here for some time. The restaurant is spacious and feels very comfortable with warm colors and high ceilings. Enjoyed the atmosphere and especially the perfectly cooked steaks. It's a bit pricey but not too bad. My wife and I went pretty much all out and it was about$120.00 including 20% tip. Food was worth every penny. Nice wine list and great service. Will definitely be back.",
   "Just ordered take out and we got the family meal deal grilled chicken, salad, mash potatoes and dessert. Food was amazing and the packaging was phenomenal. We appreciate you guys being open and serving great food during these trying times!!! I also have a review under northsider66 but wanted a separate review for your takeout."
  ]
 },
 {
  "name": "Panang Thai Restaurant S Penn",
  "address": "9022 S Pennsylvania Ave, Oklahoma City, OK 73159, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b010532e-9332-11ea-9406-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "tasting",
   "food",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9999973629773087776",
  "source": "GoogleMaps",
  "reviews": [
   "By far my favorite Thai food restaurant in Oklahoma City. Huge portions at a great price. The food comes out quickly. The staff is super attentive. Sometimes I almost feel bad with how often they come around refilling drinks. The food is top notch. You can choose your level of spice ranging from 1-5. 5 being the hottest. 10 out of 10 would recommend. I go at least once a week if not twice a week.",
   "Pretty good Thai food. Not great by any stretch. The calamari was too heavily breaded with a rough crust. Pad Thai was good. Portions are large. Wait staff is friendly and service was prompt.",
   "Was able to get seated without a wait on a Monday at 1200.  Staff took little time to get our beverages to us.  Their was a little bit of a wait for the food we ordered.  Everything came out tasting well.  Portions were good sized for the price.  Staff kept drinks always full.  \n\nWe had looked at other location that were closed before settling on this place.  I am glad we did stop at this location and I will go back.",
   "I love their service and their food. My food has never been wrong. I usually order for pick up, but ate in today with my husband and son. We asked to have our son's order served in a to go box in case he refused to eat. He has autism and had eaten a sandwich not too long before. They happily obliged (and he ate his chicken sate). I love their pineapple fried rice with tofu and vegetables.",
   "Very clean restaurant. Nice staff, and the food was delicious. I highly recommend the eggplant stir fry."
  ]
 },
 {
  "name": "Barrios Fine Mexican Dishes",
  "address": "1000 N Hudson Ave, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b059b97e-9332-11ea-845a-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "food",
   "music",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16286819874815699063",
  "source": "GoogleMaps",
  "reviews": [
   "The nachos are the stuff dreams are made of, also a plate to share that will have you saying, these are nachos (not yours!)! The plating of the fish taco was a feast for the eyes and mouth and the crema on some of the other dishes is magical. I love the ambience and care and detail of the food and flavor combinations. Definitely a guilty pleasure of mine and my family's! Even our to-go orders in the past have left us dreaming of our next Barrio's visit.",
   "The service was phenomenal and the food was delicious. I have been there twice and both times it's been great atmosphere. It's perfect for date night or just a night out with the girls (or boys).  It is also perfect for family dinner. The last time I went there was a business meeting, a family dinner and a girls night all happening at the same time. \n It's medium price but the quality is great. I had a cocktail the first time and it was delicious. The only thing that would make it more amazing is if they had live music. I highly recommend it and look forward to going back soon!",
   "It is a trendy place to get American style Mexican food. I had the beef skirt Adobo fajitas.  The meat was pretty good.  The guacamole was amazing!  A bit pricey so be prepared to spend a bit more.  The salsa is a warmed salsa.  I think it was OK, but I tend to prefer cold salsas.  Parking is a bit hard to find in peak hours so show up early, park at Jerky's or the next block over.",
   "Lovely atmosphere. Good service. The chips were thick and the salsa roasted and fiery. Get the fajitas, mixed - the slaw is interesting and worth slathering down on your taco.",
   "The perfect place for upscale Mexican food. The restaurant was very chic and cute. Service was exceptional and staff was friendly. I ordered the sangria which was good, very refreshing to pair with me meal. I ordered the mushroom tamales with sweet corn, coleslaw, and brussel sprouts with sweet potatoes. I enjoyed everything about my meal. I would definitely recommend!"
  ]
 },
 {
  "name": "La Baguette Bistro",
  "address": "7408 N May Ave, Oklahoma City, OK 73116, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b0a60454-9332-11ea-b44e-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15740031153461714322",
  "source": "GoogleMaps",
  "reviews": [
   "The little pieces of Persian eatery in OKC.  From the escargot, steaks and the oh so famous chocolate cake- there isn’t anything you can go wrong with.  Besides the delicious restaurant, you must stop in the bakery!  With their incredible cakes, pastries and so much more.  But it doesn’t stop there!  Their meat market is by far one of the best!",
   "Such a cute \"French style\" atmosphere. The food is delicious, the bread on the French dip slider is amazingly fresh and crisp, some of the best I have had.  The brunch menu is a lovely selection and the bakery has a wide selection of chocolates and other dessert.",
   "Liked the place, very good food and good customer service. There is a table size compromise been done to accommodate more people which made the table to be a little smaller than usual types. Other than the space issue everything is good.",
   "So, when it comes to the food, I'm all in. Their pastries and other selections for desserts are great. You can't go wrong here. \n\nHowever... they charge $4 a slice for your cakes from the take out area, and $7 a slice if you want to sit in the restaurant to eat it. That's quite a difference especially considering you are paying for drinks and a tip.",
   "They have excellent pastry. They made a magnificent carrot cake and a red velvet cake for my mom's 90th birthday. We also went to brunch the next day. The selection is extensive. The only problem was trying to decide what to order. Highly recommend."
  ]
 },
 {
  "name": "Cajun Corner",
  "address": "9200 N Council Rd ste a, Oklahoma City, OK 73132, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b0f07bd0-9332-11ea-9f58-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=175148386921407426",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for lunch! The service is fast, and staff very friendly. The food is amazing anytime I come. Never a bad experience! The loaded blacken chicken is where it is at. Also the seafood gumbo is very good!",
   "Had to see what all the hype was about! Will definitely eat there again! Tried the loaded blackened catfish (kind of spicy). The chicken strips and seasoned fries are good. Also had the Cajun fried gizzards. They are not Krispy King but they’re okay. The okra was fresh and crispy and seasoned well. Fat Tuesday specials every Tuesday and a full bar. Also there’s a fire pit outside with seating and a rooftop bar with plenty seating and a great ambience and view. Overall GREAT EXPERIENCE!! 👍🏾",
   "Absolutely amazing food!!! The loaded Blackened Catfish on Dirty Rice is exceptional. Almost everything is fresh and delicious, including the hush puppies. I would also recommend the Shrimp Po' Boy. Only draw backs are the frozen French Fries, not good at all. We will be making a trip back very soon and I will be recommending it to everyone.",
   "Blacken Catfish is amazing.  The Okra is good.  It is not good as homemade, but it is better than most place.  When I am in the town, I definitely coming back to try out all other foods on the menu.",
   "I love this place.  I love catfish and they serve up some great fish!  My all time favorite is smothered blackened catfish.  If you like catfish and shrimp you need to try this at least once.  You'll be glad you did!  It's spicy but you can ask for mild if you're not into spicy."
  ]
 },
 {
  "name": "Off the Hook Seafood and More",
  "address": "1920 S Meridian Ave, Oklahoma City, OK 73108, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b13489e2-9332-11ea-882f-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1430280889544854636",
  "source": "GoogleMaps",
  "reviews": [
   "I eat here often, weekly, to bi-weekly. I love the smothered fries. Catfish is fantastic. Love the gumbo too. Chicken is wonderful. Everything that I've tried is so good! The people that work there are wonderful. Please, please reopen. I'm missing you since the pandemic.",
   "What fun! Really enjoyed our meal and the great staff! The ladies explained how to order, offered suggestions, and explained the specials in a very helpful way. This was not like your typical seafood chain place. It's more lively and fun with excellent food. Fried chicken thighs were tender and crispy, and the grilled catfish was flaky tender! So good and yummy!",
   "Yummy! Our food was so good! I had the grilled catfish, shrimp and grits covered in lobster cream sauce with an extra side of collard greens it was 🙌🏾🙌🏾. My husband had the fried catfish and shrimp basket with okra. My boys had the fried shrimp basket with fries although they weren’t a fan of the garlic fries they loved the shrimp. The service was excellent from start to finish! If I ever visit again I’ll definitely hit up Off The Hook!",
   "Amazing food! I mean, these guys know how to do it! Fast, friendly service. And the food the delicious! Honestly, it tastes homemade!\nEveryone I've talked to raves about this place so I gave it a try! I was not disappointed!\nIt's definitely worth a stop, but it gets busy quick, so get there early!",
   "4 stars because of the wait but food is awesome!  Seafood wontons are good. You only get 6 for 9$. Smothered seafood fries. Yum! Lobster sauce needs dialed  down though   Would recommend and be back"
  ]
 },
 {
  "name": "The Press",
  "address": "1610 N Gatewood Ave, Oklahoma City, OK 73106, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b1789828-9332-11ea-a27a-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "walk",
   "food",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5078440206507297195",
  "source": "GoogleMaps",
  "reviews": [
   "Had a quick appointment in OK today and thought I would stop for some good food. Recommended the vegan nachos. Location was fairly easy to find, as it is nestled in the corner. Pretty open space upon entering. Immediately seated. Quick food arrival. The sweet potato fritters are just enough sweet. I felt like I was at the Texas Fair. Fried everything!!! Then the vegan nachos....😳🤤 By far on the top of the list for best nachos. Nothing left on the plate. They have a kid's menu too. AND portion size was legit. Left full and happy. Totally satisfied!!!!!!",
   "Well thought out menu, friendly staff, warm atmosphere. Can be a little loud... It's an open setting, a lot of tables and seating, so it might feel a little crowded, but honestly it was nice that we didn't have to wait, even though it seemed a bit busy. Food was delicious & a generous portion & very fair price. \nOnly thing I'd like to mention is that it is tucked away on a side street & you normally can't park right next to the building due to limited space, but the district is nice to explore & walk around especially in the warmer weather. So I would recommend getting the full experience & check out local shops as well.",
   "Nice place in the plaza district. Noticed it had a bar area. Fresh food. My husband had the breakfast bomb and I had the breakfast hash and a side of Mac and cheese. Large outdoor seating. The weather was nice today so the patio seats were getting full. Would definitely go back.",
   "During this social distancing time, we ordered the carry out Easter Dinner and it was so amazing! The glazed ham was so good and the scalloped potatoes were to die for! Best deviled eggs ever! Carrot cake was delicious!",
   "I’ve been wanting to try the food here FOREVER but the stars hadn’t aligned. I’d been in and had a cocktail but no food. I love the layout, it’s super cute and laid back. Finally got to try the food with a bunch of friends and it was fantastic! I got the nachos and my friends got the smothered hash browns and they were both great! I especially liked the smothered  hash browns (with chili). I got the buffalo Mac and cheese for dinner which was pretty solid. My husband got the chicken fried steak which he really enjoyed, and everyone else liked their food! I only have a couple criticisms: I got an old fashioned and it was SO SWEET. Maybe it’s just the style there but it tasted like it was laden with sugary stuff which just wasn’t very good. Also, I’ll give this place five stars when they stop serving straws without customers either asking for them or at least be given the option. It’s a huge waste and I always, always refuse straws when I’m out at restaurants. I don’t like not being given the choice, at least. Other than that, I definitely love the food and would eat here again."
  ]
 },
 {
  "name": "Mickey Mantle's Steakhouse",
  "address": "7 S Mickey Mantle Dr, Oklahoma City, OK 73104, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b1c4bd0c-9332-11ea-8183-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5413961080801820416",
  "source": "GoogleMaps",
  "reviews": [
   "From the minute we stepped out of the vehicle, our whole experience was amazing! New Years Eve with out of town friends... Dinner, drinks & dessert were beyond mouth-wateringly delicious. Awesome atmosphere... friendly, professional & efficient staff followed with a great band (Hypnotiq, if I remember correctly). I could go on & on in detail, but I'm leaving the rest up for you to experience! Mickey's definitely did not disappoint!",
   "Fantastic dining experience! A la carte menu so plan for that, but great steaks and chops.",
   "Simple atmosphere, deep in flavor. Dare I say a home run?! Sorry, had to...only complaint is they were out of vanilla ice cream which is how I generally round out my personal experience at any given steakhouse. The bar was quieter than the main dining room which extremely loud on this particular evening. The filet was simply delicious. Enjoy!",
   "We went for our anniversary, and our expectations where blown out of the water! It was our first time at a fancy place and we where completely lost, but our waitress was extreamly helpful in explaining everything and making us comfortable. It was probably the best meal we have ever had and we will be back again, no doubt in my mind. Made our anniversary that much more special.",
   "Pretty expensive, but the food was great. The service should have been better for the amount it cost for us to eat there. Could have just been the night, though. I have been here a couple other times when it was full of people and had great service. The filet mignon was absolutely perfect in flavor and texture. Highly recommend medium rare prep."
  ]
 },
 {
  "name": "Waffle Champion",
  "address": "1212 N Walker Ave #100, Oklahoma City, OK 73103, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b216ab46-9332-11ea-8348-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "unique",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7607993410541425409",
  "source": "GoogleMaps",
  "reviews": [
   "This a very popular Sunday Brunch spot. Definitely expect to wait a few minutes in line but it's worth it. I had the Migas and my friend had the Chicken and waffle. Both dishes were delicious and left us satisfied. The drip coffee was also great. We'll definitely be coming back.",
   "Good stuff. Have always Liked WC. I think they trimmed down their menu? Which is fine but it did feel a little limited. Food was fresh and quality, as was the food served.",
   "Lovely place to grab food, it is not all processed, the atmosphere is a cool kind of new aged industrial vibe.  There is just no sense of urgency or order when receiving food, so do not go here in a hurry.  The food is great, I recommend the avocado toast, it comes on a waffle, very unique.",
   "Pretty good, all things considered. Not quite sure if it was worth the price, but I am willing to try it again! Burger and fries and a soda will run you twenty bucks, but the food IS good. Just gotta figure out if the cost-to-yumminess ratio is a good fit for you. Otherwise, it has a good atmosphere and a simplistic menu that is good without being underwhelming.",
   "This place is worth the money! They’re portions are huge on their desserts and sandwiches! \n\nI love the fact that they’re open late on Friday and Saturday and that they have Maine Root as their fountain. The root beer is amazing! \n\nAlways gonna come back!"
  ]
 },
 {
  "name": "Bourbon Street Cafe",
  "address": "100 E California Ave, Oklahoma City, OK 73104, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b2660850-9332-11ea-b6fb-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "drink",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6800797688847770846",
  "source": "GoogleMaps",
  "reviews": [
   "Great service! Tyler our server made the dinner great! Food was good, but for the price I wouldn't say it was absolutely the greatest but not bad. Live band was good but a little loud for our party, we wanted to talk. But if you like New Orleans jazz, they were great!",
   "This was a very cool place. I showed up a little late, but they allowed me to still order an appetizer. I ordered the Bourbon Street Trio. It was Amazing. I also ordered the Moose Drool Brown Ale, very good selection. Smooth and easy drinking. Will definitely be making another stop in to this establishment. The bartenders were super friendly. If you make a trip to downtown OKC, do yourself a favor and stop into this one of a kind eatery.",
   "Wow! A little.slice of New Orleans in OKC. Absolutely loved it. Incredible service with friendly and accommodating staff. Delicious food and drinks. Will definitely be a regular spot for me! Kudos and thank you!",
   "I had a Po’ Boy and my boyfriend had pasta. Both delicious.  Good food made from good ingredients. Had to wait about 30 min to be seated, though it didn’t seem busy. Well worth it if you are in the area. I’ll be going back to try some of their other cuisine.",
   "Came here with family for our adult niece's birthday. We had a reservation for about 30. We were brought to our private room and seated. We had a couple of servers come in quickly to take our drink orders. I was glad to see we weren't cramped together as what's happened in previous places. \n\nI would like to say that our servers were on point. They were both working diligently to keep our glasses full and checked on us often once our food was out. Not a single person in our party had an issue with their food. Everyone was happy and full. They allowed us time to have cake that we'd brought in and open gifts. Overall this was one of the times we've had excellent service and great food. 10/10 would recommend."
  ]
 },
 {
  "name": "Tokyo Japanese Restaurant",
  "address": "7516 N Western Ave, Oklahoma City, OK 73116, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b2b02f06-9332-11ea-9220-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8836208357849378527",
  "source": "GoogleMaps",
  "reviews": [
   "It’s one of the best Japanese restaurants in Oklahoma. Goof food! Good price! Good service! I’ve been going there for a few years, n they never fail me one time.\n\nSuggestion: lunch specials are the best value.",
   "I am a trans woman. I know that seems unrelated, but the entire staff made every effort, and successfully so, to refer to me with the correct pronouns. Add in top of that the amazing sushi selection, and this is my new go to sushi place. I can't give 7/5 stars or I would",
   "We love love LOVE Tokyo. They've got fantastic sushi, and we enjoy exploring the sake menu while there. They've got something for everybody (who enjoys this cuisine) including non-sushi options... But we've never deviated, because the sushi is that good!",
   "Have been going here for years and they never disappoint. Sushi is fresh af, and the hot meals are always like a home cooked meal(but fancy!) I’m allergic to shellfish and the staff are accommodating for me when I let them know of my allergy. Come here for special occasions or as a treat, for yourself.",
   "Definitely best Japanese food I've had in Oklahoma. The sushi is great! Good vibes too. Can't wait to come back next time in in the area. 10/10 would recommend."
  ]
 },
 {
  "name": "Tucker's Onion Burgers",
  "address": "324 NW 23rd St, Oklahoma City, OK 73118, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b2f7e4a4-9332-11ea-9b23-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "delicious",
   "delicious",
   "kids",
   "music",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1889659751530392398",
  "source": "GoogleMaps",
  "reviews": [
   "If you like Oklahoma onion burgers then Tucker’s is a must! Premium black angus beef and local ingredients make this one of my favorite fast casual lunch spots in Uptown. They are often busy but their efficient ordering method moves things along very quickly! \n\nYou must try the fresh cut fries! They are fried in peanut oil to the perfect crispness. \n\nFinish it all off with a delicious lemonade (pink or yellow)!",
   "This was my first visit to Tucker's, overall I enjoyed the food.  First, we tried the vanilla, strawberry, and shake of the day. All flavors were good but I particularly recommend the strawberry shake, it was very thick and flavorful. The fries were fresh and delicious, but the burger was not as good as I expected.  I typically like a lot of toppings on my burgers so I ordered the burger with all the toppings except jalapeño, as well as I added bacon. It was way too much mustard on my burger and overpowered the other flavors. I tried my sons burger with less toppings and the burger tasted a little better. My main issue with the burgers were being overcooked, I prefer my burgers with a little pink these were definitely well done. I would try Tucker's again due to the delicious shakes and fries.",
   "A great place to have burgers. The onion burgers are a special and Tucker's does it really well. The burgers are well seasoned and  onions grilled well. Their portions are generous and their milkshakes are really delicious. The atmosphere is really nice too. I would definitely recommend! A great experience.",
   "This place looked like a little hip place to try out so we (my daughter, husband and I) went in to check it out.  From the car it already smelled delicious. They are known for their onion burgers so I ordered a single onion cheeseburger, my husband got a double onion cheeseburger and my daughter ordered a cheeseburger plain and dry. They don't come as meals so our french fries and chocolate shakes were an extra expense. She took down our order on paper sacks with each of our names at the top and was really quick at it. She had to be, this place looks like it stays busy as we already had a line formed behind us. We took a seat at one of the long tables by other people eating.  Besides the noise from customers talking, there's music playing from speakers, a woman's voice calling people by a microphone to come up and get their orders and loud noise coming from the kitchen sounding like pans clanking. Way too loud for me! I barely made out my husband's name when she called us to come up. The shakes were thick and required a spoon, the fries were a big enough serving for two people, so that's nice to know with fries costing $2.95 each. The onion burger was good and messy. I've had a better onion burger but this one was still filling, I had to take the fries home with me. For the three of us it costed $45.57, so more than $10.00 per person. This place also had a few children at the tables and there is a kids menu, but no highchairs around.",
   "My in-laws had never been so we embarked on the first time journey of Tucker's! (Right before we went to the Women's college world series)\nThey definitely have speed and customer service skills on another level at this place Craving the cookies and cream shake I saw advertised... and I was only slightly hungry... They fixed my hunger! The fries were hot. The staff got our family of 7 order out fast and accurate. The burgers were delicious! The price was just right. I was very pleased with this visit. When in the area again I will stop in as they definitely can fix hunger and cravings. Thank you for being in the right place at the right time!\nRespectfully,\nBryan\nMoore Oklahoma"
  ]
 },
 {
  "name": "Florence's Restaurant",
  "address": "1437 NE 23rd St, Oklahoma City, OK 73111, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b3414608-9332-11ea-afd6-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1552851540381994559",
  "source": "GoogleMaps",
  "reviews": [
   "5 Star Ambience; Service; Cleanliness; Kindness; and Food! \n\nAny list of top burgers in Oklahoma should include Florence's cheeseburger. It's a fresh beef patty, on a soft white bun, piled high with pickles, onions, lettuce, and tomato. It's simple and delicious! I could tell by the texture and delicious flavor, the hand cut fries are made with quality spuds.\n\nI plan to visit Florence's in the future, and try, what I'm sure will be another fabulous meal.",
   "I'm so glad we found this place today! My friend and I were looking for some good, home-cooked comfort food and that's exactly what we found! ❤️\n\nThe service was friendly, the restaurant clean, and the food was delicious! ❤️",
   "This place looks abandoned until it's lunch time. Man it was packed and I'll tell you why: this food was the freshest home cooked meal I've had in years. Moderately priced similar to chain restaurants but infinitely better food. I had the most tender and delicious chicken fried steak of my life. Fresh mashed potatoes. Green beans that had real green beans in them and were delicious. The only complaint is that they were so busy. Highly recommend, but if you are going for lunch I recommend calling in an order Togo.",
   "This was my first dine in experience at Florence's. My group was there for a meeting with State Capitol employee. Service was stellar, employees were considerate and made suggestions for the first timers. \nThey specialize in comfort foods like yams, collard greens and meat loaf with homemade corn bread muffins.\nFlorence's is packed with the history and culture of the black community. I'm was pleased to see those from all races and cultures participate in the tradition of breaking bread with your brothers and sisters.",
   "Food was awesome. I would recommend the food to anyone. I wouldn’t have normally picked beef tips, but it was the special and it was really good. The wait time was a little long for lunch. (40ish minutes) If you are on a timed lunch, this is not the place for you. If you have time to spare, you will not regret it."
  ]
 },
 {
  "name": "Off The Hook Seafood And More",
  "address": "125 W Britton Rd, Oklahoma City, OK 73114, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b3866b4a-9332-11ea-9429-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14830060982403190487",
  "source": "GoogleMaps",
  "reviews": [
   "This place is greatness. Soul food through and through. I got the blackened tilapia with shrimp and so tasty. I also got the collard greens and topped it all off with some bread pudding. Favorite was the fish and shrimp. Collard greens were very good but I could have used a bit softer in texture. I will go back anytime I am back in the area. They do this food right! I so love this place!",
   "Great food, cleaned the plate. Little heavy on the Cajun spice but was still great. Only reason I don't give 5 stars is there is a bit of a wait for your food and at least at the north location there isn't much seating. Our party had a bunch of different plates and none of us were disappointed. Take a trip, eat, but do keep in mind there may be more than a ahirt wait for your order",
   "Have been hearing about this place, and decided to give it a try. Got talked into the Melty Lobster and fries, and I was not disappointed! The place was busy and for good reason, the food is amazing. Fantastic flavors and guys service. And might I also suggest the strawberry lemonade! Wow! Do yourself a favor and stop by for lunch!",
   "This place is amazing!  I had visited the south location on a few separate occasions but had never visited the north location although it is much closer to where I live.  Once again the food was amazing!  We split the lobster melt and two orders of crab wontons along with the shrimp & grits.  It was so good!  This location even has a drive thru which makes it even better!  We will be back again soon.",
   "Only thing I can complain about is the hours. I'm not going to claim to be an expert on Cajun cuisine, but the food is always fresh and absolutely delicious. If you hit em during a busy time, don't be in a hurry to be anywhere. They're absolutely busy for a reason, though."
  ]
 },
 {
  "name": "Zorbas MediterraneannRestaurant Bar",
  "address": "6014 N May Ave, Oklahoma City, OK 73112, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b3cf3388-9332-11ea-a6ea-14b31f159f22.png",
  "tags": [
   "tasting",
   "food",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=12462064767383877129",
  "source": "GoogleMaps",
  "reviews": [
   "I just recently discovered Zorbas, and it has become a new favorite of mine. I went with a group for lunch. When we walked up to the menu, the owner came out to greet us. He introduced himself, asked us if we had been there before, and then gave us recommendations since it was our first time. He was incredibly friendly and his recommendations were amazing (I went with the Chicken Pesto sandwich with the tomato soup - fantastic choices). The place is incredibly clean on the inside with a fitting and classy motif. I definitely plan on making this a routine stop.",
   "I love this place! Atmosphere is very welcoming and as a vegetarian Mediterranean food has the best selection of dishes! definitely the best tasting in town!",
   "Honestly the best Mediterraneann food I've ever had. I got exactly what I ordered in a timely fashion with great service. Great atmosphere even if they are busy. Would love to go there again soon.",
   "Fresh, Clean, Greek inspired Mediterranean food. The Catalan Chicken was amazing. No need for a \"to go box\". I ate all of it! 😁 It was so good I forgot to take a picture. Sorry, you are going to have to try it for yourself. You will not be disappointed.",
   "It was delicious!! I had the Western  Giro with BBQ sauce with Greek salad. Our waiter Reza was excellent,  we never had an empty glass and he was checking to see if everything was good on a regular basis. The birthday message  on my red velvet cake was sweet."
  ]
 },
 {
  "name": "Pearl's Oyster Bar",
  "address": "5641 N Classen Blvd, Oklahoma City, OK 73118, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b4259270-9332-11ea-8d8e-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3271196064740340347",
  "source": "GoogleMaps",
  "reviews": [
   "The crab dip is amazing! I also tried the cedar plank salmon tonight. It has a nice sweet Asian flavor to it which nicely compliments the flavor absorbed by cooking it on the cedar plank. It does have sesame seeds, so of you're not a fan of those, be sure to order it without! And if you're a margarita person, be sure to order the Perfect Margarita with Patron - it's incredible! All around great dinner. And if you can sit on the patio, it's beautiful this time of year!",
   "Great service. Cody was nice and very helpful and payed great attention to us. My wife said it was the best Eggs Benedict she has ever had. The Blackened Pork Chops were EXCELLENT! I. Highly recommend Pearls or Trappers Fish Camp restaurants!",
   "Great service, atmosphere is nice, and the food is pretty good. My only down sides here are 1: The price sometimes feels a bit off and a little high. 2: The Lobster tail is hit or miss unless you order just the lobster entree. 3: The ultimate crab cake recipe has changed, maybe it's better to other people so fair enough, but for me it was my go to order with the old recipe!",
   "Seated quickly amazing food and service! I was a little concerned when they told us they didn't accept reservations but they seated our party of 10 very quickly. They gave us two waiters so all of our service was amazingly prompt! I definitely recommend this location for any special occasion. The food is a little pricey but very much worth it.",
   "To give some context to my review, I'm from Golden Meadow, LA and have been born and raised my whole life. Seafood is in my blood and I'm a Cajun by birth. So again, my review is biased. I got the Jambalaya with a side of red beans and rice. The Jambalaya was okay. Just requires more seasoning as does the red beans. They were both very bland in my opinion. Aside from that, the portion was a great nice size with leftovers easily. Little more seasoning and this is easily a 5 star review. Waiters were great and attentive."
  ]
 },
 {
  "name": "Stella",
  "address": "1201 N Walker Ave, Oklahoma City, OK 73103, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b4655af0-9332-11ea-af1f-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8605360974694929528",
  "source": "GoogleMaps",
  "reviews": [
   "Our first visit. It was very good. They did not have our favorite dish on the menu. But, the created for us. Awesome food and service.",
   "Had a wedding shower in their back room and it was wonderful. The staff was very attentive and helpful during the event. The buffet spread was very delicious. The flat bread pizzas were perfectly crisp and the Italian sausage gravy was almost life changing. The room was suitable for our party of about 30 without being too cramped.",
   "Nice atmosphere.  Met with 6 friends and the noise level was good most of the time so that we could visit.  Wait staff friendly and courteous.  The food was good.",
   "Very warm atmosphere, food was delicious, and my server was excellent! I had the Mushroom Risotto, and my wife had the Sauteed Shrimp (fettuccine). Price for 2 was $50, music was at a reasonable but, most of all the crowd was chill and diverse. Will definitely come back soon.",
   "Great & friendly staff and the food was great! Will definitely be coming back here again"
  ]
 },
 {
  "name": "Pizzeria Gusto",
  "address": "2415 N Walker Ave, Oklahoma City, OK 73103, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b4a9bac6-9332-11ea-bf9e-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "family",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6944109291632279098",
  "source": "GoogleMaps",
  "reviews": [
   "Came for a work function as it was suggested by coworkers. The place is nice if a bit trendy. The food is good but for me it was nothing special. It's also a bit expensive. They have a full bar with a lot of different drink options, including a happy hour from 4-6. Definitely stop by if you are in the neighborhood. Servers are friendly and helpful.",
   "This place is the first authentic Italian place I have ever been. They answered all my questions. All of their pizzas are twelve inches, but they are more than enough for two, to three people. The pizza is wood fired, in a stove, made in Italy and shipped to the USA. The crust is the key, it's light, airy, crispy, and cooked to perfection. The atmosphere is almost bar style, but is family friendly. With a weekly special and amazing staff, I will be back.",
   "I really enjoyed pizzeria gusto. It's a very hip place and the music is not incredibly loud which I really enjoy. This is a great place if you want to talk with someone. The food here is very good the wood fired pizza is really tasty and they have a lunch special for like $10 a person. another reason this is a great place for lunch is can get in and out pretty quick.",
   "Good place for lunch. Don’t miss the amazing deal for lunch you can grab fresh pizza and with the sides of salads. Worth the meal and worth the prize. Friendly staffs seems to bit busy, but you can book the table. They take reservations too. You have various options to substitute with sides too. Good job team for serving the amazing meal.",
   "Ate here for my husband and I's wedding anniversary dinner. The food was amazing and our server was super sweet. I'd definitely go back for another special event celebration."
  ]
 },
 {
  "name": "The Garage Burgers & Beer",
  "address": "1117 N Robinson Ave, Oklahoma City, OK 73103, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b4f46e92-9332-11ea-9094-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=377405669628120778",
  "source": "GoogleMaps",
  "reviews": [
   "Usually get take out from here but this is my favorite Garage location. It’s located in a nice part of Midtown, and the service is also 5/5. The final part that makes it 5/5 is how clean the location is. If you like burgers and beer, this is an awesome place. Their outdoor seating is also a very nice addition.",
   "Good service with variety of burger and drink options. The bar is pretty good as well. You know you can just go to the table and order drinks (no food) if you like to have some drinks only. That is what I do most of the time and then order food. Long story short, full bar burger place with TVs in Midtown.",
   "One of my favorite burger places around here, it's got a taste and style of its own, not like chili's or one of the other sit-down places for burgers. The fries are seasoned perfectly to give them a style of there own as well. The Garage downtown and the Garage in south okc and Moore have a 5 star rating with me! Highly recommended to everyone.",
   "off the bat, customer service was on point. they have very interesting picks on burgers. I got the double cheese burger and it was so bomb, the char on the burger was crispy and it was not drying, truly a good burger. Would recommend if you wanna get a decent burger for a decent price.",
   "Cool decorations, nice attitude at the front counter. Seemed pretty lively at the bar, great selection of games on the big screen. Food was great! Kitchen sink burger is bomb."
  ]
 },
 {
  "name": "Gabriella's Italian Grill & Pizzeria",
  "address": "1226 NE 63rd St, Oklahoma City, OK 73111, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b544635e-9332-11ea-9c23-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walk",
   "food",
   "cheap",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6000322265861139267",
  "source": "GoogleMaps",
  "reviews": [
   "Incredible food in an authentic atmosphere! We had a reservation for New Year’s Eve and weren’t disappointed at any point during our meal. The Italian nachos, mussels, and fettuccine Alfredo were all authentic and delicious. Would LOVE to come back.",
   "First thing's first. Make sure you get a reservation to this place before you walk in. Walk ins are accepted, but be expected to wait a while. \n\nEven with reservation, we waited maybe 15 minutes or so to get a table. They do have a sit down area for you to wait at, which is nice. \n\nThe atmosphere of this place is very romantic and intimate. The service from our server was amazing, and made us laugh the whole night, calling both of us babes. \n\nI had the home made lasagne and let me tell you, one of the best meals I've had in a long time. \n\nEnded the night with fried pizza ball donuts, which they call something else. They were pretty good, definitely something you'll want to share. \n\nLast is the price. Don't come here broke. This is a once in a while great date place, not all the time. The service and the mood of the place will reflect that. You'll be glad you came to this place!",
   "The food was absolutely awesome. For the first time in a very long time I can actually say that I left a restaurant pretty satisfied/content. However they could go a little lighter on the salt when it comes to the Tuscan Pasta, Especially when preparing it with seafood... But other then that! Excellent! Especially for as busy as it was 😊💞💕💞. Spinach artichoke dip🎆 bomb🎆 AF",
   "I came expecting a mediocre experience and was so surprised by the quality here! The staff was friendly, the location was great, and the food was incredible! The bread and dip are out of this world. Pizza and homemade ravioli are a notch above any other I’ve tried. Even the chocolate cake stands out. The prices are not cheap, but you get what you pay for and it is definitely worth it!",
   "Hands down the best Italian food in OKC! We had the toasted raviolis, 6 different entrees, and the Italian Wedding Cake, and every single item was amazing!  All of their sauces are what makes the dishes. Then add outstanding service, was an amazing awesome experience!"
  ]
 },
 {
  "name": "Nourished Food Bar",
  "address": "131 Dean A McGee Ave #115, Oklahoma City, OK 73102, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b58f7698-9332-11ea-8096-14b31f159f22.png",
  "tags": [
   "food",
   "free",
   "free",
   "creative",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10746661199417273094",
  "source": "GoogleMaps",
  "reviews": [
   "If there is a problem with nourished food bar, it is its accessibility.  It's also not a place to have a casual sit.  But if you're looking for a healthy alternative, and you find yourself dowtown, check this place out.  Terrific menu, and staff really seems invested in quality.",
   "First timer loved the GF place in OKC! Love supporting Gluten Free places!! Keep up the good work.",
   "I am gluten free so I was pumped to go somewhere where I could get a sandwich! The owners are very friendly. I got the chickpea mash sandwich and butternut squash soup. Tasty and healthy! The bread was good.",
   "Recently, I ate the special of the week tacos made with dehydrated taco shells, filled with veggies, cashew cheese, pepitas avocados and homemade salsa.  It was so delicious, I went back twice for more! Jamie is so creative with ingredients. His creations are pleasing for the palate as well as for the eyes with all colors and textures.",
   "Delicious!  I'll be back to try everything on the menu.  It's so nice to enjoy yum food and nourish my body.  :)"
  ]
 },
 {
  "name": "La Brasa",
  "address": "1310 NW 25th St, Oklahoma City, OK 73106, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b5f898a8-9332-11ea-b56d-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "delicious",
   "food",
   "music",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=3662497110115315957",
  "source": "GoogleMaps",
  "reviews": [
   "Great atmosphere for an evening meal. The food was awesome. My husband loved the club drink. A must is the creme brûlée.  Xavier was a great representative of the food and drinks.",
   "La Brasa is amazing, excellent service, a great atmosphere, music played at just the right level, and delicious food!",
   "This is a cool and upbeat restaurant.  Had a vibrant decor.  The food was really good also.",
   "This is such an interesting Peruvian-Korean fusion experience! I love eating here, from the boho chic vibe and delectable dishes, this is a gem in the OKC eating scene. Wine Down Wednesdays with 2 entrees and a bottle of wine for $45 is great! The Tacu Tacu is great, and so is their chicken that is marinated for between 24-46 hours. Definitely check this place out and enjoy lounging and eating well!",
   "Went for a date night, it was satisfying enough. Food is pretty good, and will satisfy your craving for South American cuisine. Had live music when we were there. Place turns into a club after the restaurant closes."
  ]
 },
 {
  "name": "Black Walnut",
  "address": "100 NE 4th St, Oklahoma City, OK 73104, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b6424c0a-9332-11ea-84e5-14b31f159f22.png",
  "tags": [
   "kids",
   "unique",
   "eat",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11873127967157574218",
  "source": "GoogleMaps",
  "reviews": [
   "Unique style and flavor. Atmosphere is an upscale urban environment. A bit pricey, but extremely large portions. Most meals could probably be shared. Smaller intimate setting, not ideal for large groups or kids (most kids probably wouldn't eat anything on the menu).",
   "Made a reservation but had to wait. Wasn't too bad since the staff was very friendly and accommodating! Food was very good and I'd definitely come back. Loved everything but especially the fried green tomatoes and mac and cheese!",
   "All I can say is WOW! I decided to try this place after it was ranked among the top 10 date night spots in OKC, and the Mrs. and I were long overdue for a date night of our own. Let me just say we were both blown away by how good the food is. The head chef even came out to ask how the food was. Spectacular is all I could say! The lamb ribs and hush puppy appetizer was amazing. And we had to go big so for our main course we went with the 28 day aged beef ribs that came with grilled veggies and out if this world skillet Mac and cheese! Flavor galore, good portions and fall off the bone tender meat! You won't be disappointed! Lastly, the garage parking is very convenient with the Deep Deuce area being short on available street parking.",
   "The food was excellent. We had the lamb ribs, english beef rib, lavender chicken, and walnut cake. I'd probably pass on dessert next time only because the appetizers and entrees were that good!",
   "My wife and I had a great time here.  Chef Black is such a super nice guy in addition to making some really great food.  Cool place with a nice vibe.  If you need a private room for a corporate event that’s coming too.  Really great space next door for entertaining.  \n\nThanks Chef for the hospitality.  We’ll definitely be back."
  ]
 },
 {
  "name": "Fuzzy's Taco Shop",
  "address": "208 Johnny Bench Dr Suite C, Oklahoma City, OK 73104, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b6978ef4-9332-11ea-acb3-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9089375004509851884",
  "source": "GoogleMaps",
  "reviews": [
   "I had the California Heat and a Shredded Brisket taco with some black beans and rice. \n\nThe California Heat was an insane flavor extravaganza! There's so much of nature's goodness going on there in that little package. It was divine!\n\nWe got the food to go. We got some bomb-diggity queso a generous and a generous portion of chips. \n\nI can't wait to go back!",
   "Tacos are DELICIOUS. I've had the same food at different Fuzzy's, but somehow this one always tastes better? Not sure if it's the location, the heavy throughput, or just the fact that I'm always having fun when I'm here, but the food is exceptional.",
   "The guy taking my order was very patient with me. It was my first time there and I asked a bunch of questions about the menu.  He was super sweet. Thank you. The food i did end up getting tasted really good. Definitely will return.",
   "It's kinda hidden but it's in a cute location right next to the water. The food was good, the atmosphere was wonderful and the guy taking our order was really cute. Would definitely recommend!",
   "I ABSOLUTELY LOVED this place when I was living in OKC. Just found out they have a fuzzys in Cincinnati and wow do they need to take notes from here! Missing this place so much! Loved the people and the menu was Great! Cincinnati needs to step up their game big time 😭"
  ]
 }
]