[
 {
  "name": "Brewery Park at Tumwater Falls (formerly Tumwater Falls Park)",
  "address": "110 Deschutes Way SW, Tumwater, WA 98501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b6f2a78a-9332-11ea-a08d-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "historic",
   "kids",
   "eat",
   "brewery",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=1839730380499273003",
  "source": "GoogleMaps",
  "reviews": [
   "This is an interesting park with more than just a beautiful walk along the river. Don’t miss the fish ladders, the bridge to a closer view of the historic brewery, and take a picnic so the kids can play hard at the playground. \nIf eating out is more your style you are in LUCK! Eat at The Falls Terrace restaurant, a local favorite. The views are impressive but the place is full of family charm. \nWhile this park is a great spot to bring your out of state company, it’s a local favorite!\nThere’s quite a bit of construction going on now so 4 stars- but when the trail is complete and other improvements done- I’ll be back to update.",
   "Lots to look at here! There is a fish hatchery (still under construction) that will be amazing. Trails are well maintained and there is an area set aside for native plants. Informative kiosks add to the experience.",
   "I have always loved the falls, I have been taking my children there since they were babies, they are now 36 and down. I absolutely love the new upcoming  improvements, so excited for the new fish hatchery!  That will be so fascinating and exciting to watch!",
   "Any time of year, Tumwater Falls is a wonderful place for a walk.  Today, even with the salmon gone and extensive construction going on, my guests and I still enjoyed the fabulous beauty of the Falls, with the moss covered rocks, which are like sculpture from years of tumbling water.  My (grown) daughter and I have even decided to come  every 3 months, each time she visits.  We love it that much.\n\nAnd during the salmon run, it's an unforgettable experience - like my first time there.  :~]",
   "This place is so nice to go to always. I really love waterfalls, just something about them is so soothing. It's a great place to take senior photos or prom photos. The trails they have their are nice as well."
  ]
 },
 {
  "name": "Priest Point Park",
  "address": "2600 East Bay Drive Northeast, Olympia, WA 98506, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b740b7e4-9332-11ea-8c8c-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "historic",
   "walking",
   "kids",
   "parks",
   "hike",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=12270329231691698766",
  "source": "GoogleMaps",
  "reviews": [
   "I have been coming to this park for years. It is a great place to run on the trails, walk your dog, or take your kids to play and explore. My wife and I got married in the historic rose garden. Very good memories here. Please go visit soon. You will not regret it!",
   "Excellent trail network. Well maintained and only a couple of places that get steep, but stairs are there to keep footing even. In general a bit technical and easy/medium difficulty.\n\nMany interesting sights to see in this park: bridges, a bay, birds.",
   "We always love walking the trails at Priest Point with Buddha (our Springer Spaniel)! Always find them in great condition and well manicured, plus, definitely some of the best sunset views around!",
   "Loved the trails and the size in general, it's beautiful and there's so much to do. Bring your kids to play at the play area, have a birthday party play at the beach area hike with your dog or s/o .... It's one of my favorite parks of Olympia period",
   "Great trails for all levels of hiking or just plain walking. There are trails on both sides of the bridge that you can cross over to. Wish there were more documented trails but if you got the time go take an adventure."
  ]
 },
 {
  "name": "Percival Landing Park",
  "address": "217 Thurston Ave NW, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b79cbb54-9332-11ea-a4cd-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=13861759370606166281",
  "source": "GoogleMaps",
  "reviews": [
   "Great sight seeing that makes you think \"wow, I live here\". \n..just don't turn around and notice all the issues the city has right now",
   "I come to Olympia about once a month, and this was the first time I made time to come to the waterfront. I'm glad I did, and if you come, you will enjoy a nice walk, stunning views of the water (I bet it's even better with better weather), and that marvelous feel of being by the sea. So many boats moored here, I got some great pictures. I'll come back, for sure.",
   "Nice area with lots to see but expect to meet all ☆sORTs☆ of people wanting something you may or may not have.",
   "Love to come down here for pokemoning. Can be a bit crowded at times but overall it is a lovely place for a walk by the water.",
   "I love walking along this waterfront. The boats are very iconic. Plus the playground has enough to keep the kids busy and the bathrooms are clean and well-lit."
  ]
 },
 {
  "name": "Hands On Children's Museum",
  "address": "414 Jefferson St NE, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b7e3bb94-9332-11ea-a31f-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "food",
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=11228844039598632616",
  "source": "GoogleMaps",
  "reviews": [
   "So much stuff to do! I don't think kids will ever want to leave! The activities are educational, great for a field trip. There are many activities that use imaginations, such as the \"food\" area where there is plastic foods that you can \"cook.\" I recommend going here.",
   "Awesome place to bring kids of all ages. There is always some educational activity going on. It can get pretty busy and crowded on event days so its good to get there earlier or later, but not at the peak times on weekends. Parking in the back can get a little crazy. There is so much to do and even a few water based activities. When the weather is warm, there's a bunch of outside areas set up too.",
   "This is really a neat learning environment for kids of all ages. We were happy to get a membership after our initial visit, but have regretted getting it ever since. Here's why: The problem is they have no limit on capacity numbers and it often gets way too overcrowded to enjoy anything. It basically becomes a Hunger Games-esque environment where it's every kid for themselves and they have to fight to get to explore anything. Additionally, there are several exhibits that don't have working buttons or fully functioning displays. Makes it quite disappointing. What are we paying for? Lastly, they never turn away visibly sick children! So, until they decide to monitor their capacity levels, fix ALL the broken buttons & displays, and refuse entry to visibly sick children we won't be back.",
   "This place is a wonderful museum in WA. It blows away the Seattle and Bellevue ones as well. The team is constantly cleaning and tidying up play areas to help keep the experience meaningful for the kids. Beautiful outdoor play area as well and a great cafe. Lots of parking too. The membership is worth it.",
   "My children spent a few good hours loving the fun filled adventures this facility had in store for them. Much fun. Many recommends. A"
  ]
 },
 {
  "name": "WET Science Center",
  "address": "500 Adams St NE, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b8290700-9332-11ea-bbe2-14b31f159f22.png",
  "tags": [
   "free",
   "family",
   "free",
   "tour",
   "free",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5523410932020984948",
  "source": "GoogleMaps",
  "reviews": [
   "We love going here! Great FREE programming for young people.  My son loves playing in the main area and has benefited from multiple programs held here on Saturdays.  The people working here are very kind and helpful.  Highly recommend.",
   "Awesome Staff! Great learning stations & activities for children! I had my 6y.o. Granddaughter & my 10 y.o. Grandson for the Weekend of 7/26-7/28/2019, we saw this place on the way to somewhere else and opted to go check out the Wet Science Center. My Grandbabies COULDN'T get enough of the Scavenger Hunt. We had did some cool artwork & before I knew it they had left the classroom rushing back to do more at one of the learning stations. 👏👏👏👍Kudos & Thanks so much for putting a smile on our faces. I love seeing children enjoy learning experiences.",
   "Staff is very professional, yet consice and clear. Cool hands on projects and tons of information. I enjoyed myself there, so if you haven't gone, take the whole family, all ages can enjoy this space, and give yourself at least an hour to explore.  And it's free!",
   "Fun place for adults and kids. The best part is that it is free! They often have special events on Saturday. There is also a tour of the plant each quarter.",
   "The gift that keeps on giving, and it's such a beautiful Jewel of Olympia, you must visit, you will not be disappointed."
  ]
 },
 {
  "name": "Marathon Park",
  "address": "1011 Deschutes Pkwy SW, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b87615d8-9332-11ea-a166-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "free",
   "walk",
   "eat",
   "food",
   "walking",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4759240188680897713",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to walk or run and think about anything. Bathrooms are usually clean. And only because they work hard to keep them that way. I just wish the water was cleaner. It would be nice to sit here and watch the kids fish. But still the best place to see the city at night with the lights dancing off the water.",
   "Excellent place for a jog. Well maintained, year round bathrooms and free parking in 2 lots.",
   "Great place for a walk, run, and all sorts of fun. Bring your dog, your kid, your wife, anyone. Don't be afraid to make eye contact with strangers and say hello. You might make a friend! You'll never know unless you go, yo.",
   "Small grassy area with a few picnicking tables over looking Capitol Lake and the Capitol Building. No bbq or grills so if you want to eat her bring food.\n\nRestrooms open till dusk. And is the start of a walking/jogging trail around lake. Ample parking, no gate at night well lit lot. The walking bridge is beautiful and runs parallel to the old railway bridge. \n\nIn springtime at night you can enjoy the local brown bag population.",
   "Nice, clean walking trail, with switch backs that go up to the Capitol campus. There is a lot of foot traffic there, so it feels safe to walk, if you're alone.  Great view from all locations, too! There are clean restrooms on either side of the Lake."
  ]
 },
 {
  "name": "West Bay Park",
  "address": "700 W Bay Dr NW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b8b6f29e-9332-11ea-b65d-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "family",
   "active",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=18143371462052501296",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful peaceful place to take  a moment to yourself or to get out for a walk with family and friends. I love how it was created for a peaceful place for people in the community to go and  enjoy themselves and  have the opportunity to meet new people... intentions were great when they made this park.... i love how there is a little spot for the kids to be able to be down on the beach like area and be able to touch the Puget sound.",
   "West Bay Park is a small, relaxed park. Its a good place to walk or play with your active dog and it provides a good view of the bay. I recommend dressing warmly because it always has a breeze no matter the weather, though this could be nice in the summer.",
   "Beautiful! I hadn't been to Oly for about a decade, so I never got to be on this side of the docks. Visited my best friend and had a wonderful time looking at all the crabs, barnacles, and ducks. I'll definitely be back!",
   "It was a beautiful overcast morning but everything was calm and peaceful. The park was well maintained and clean. The Rotary club provided a very nice lookout area, which is where I stood to take these photos.",
   "Clean and super beautiful. Nice little place to bring the pup and play with some baby crabs near the water."
  ]
 },
 {
  "name": "Washington State Capitol Building and Campus",
  "address": "416 Sid Snyder Ave SW, Olympia, WA 98504, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b8fc6d40-9332-11ea-97e1-14b31f159f22.png",
  "tags": [
   "family",
   "knowledgeable",
   "free",
   "tour",
   "walk",
   "unique",
   "food",
   "knowledgeable",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=4914174907933258522",
  "source": "GoogleMaps",
  "reviews": [
   "Had a really excellent experience checking out this place. There was so much beauty everywhere, and the architecture was amazing. The immense size of the main building blew me away. There is lots of room to sit down on all the grass lawns, and there is a beautiful fountain. I highly recommend checking out this place if you're visiting the area, you won't regret it! Super fascinating.",
   "Thank you, for giving me hope! Beyond the untruths and slanderous guessing, I have met you. Up close and personal I have learned about character that earned you stay in this place. The love of America, strength in a united family, and humility endures. Faithfulness to our higher power also makes you my neighbor. Thank you, for helping build a future for us all.\n\n+ The benefits from time in a conservatory greenhouse helps!",
   "So I was able to have a platform to speak out when nobody else would Lewis County...",
   "Oh man this was a perfect little stop for my wife’s and I. On our way way from Portland to Seattle, we said hey let’s stop here and it turned out to be perfect. The free tour was great and the tour guide very very knowledgeable! And of course the architecture inside the building was beautiful. A must see if you’re around the area!",
   "The Capitol building is a short walk from the visitor center parking lot. Very welcoming personnel and docents enhanced the visit. The extensive use of marble from five countries is astounding. Our docent was a former educator and extremely knowledgeable. Although there weren’t any sessions underway, we enjoyed seeing the areas and learning more about government processes. The rotunda and the unique Tiffany chandeliers are exquisite. Even if you don’t “need to go”, go into one of the restrooms for more marble craftsmanship. If you’re able, take the stairs for even more. There is a small cafeteria where you can get a beverage and food, but it is also used by employees. We went in late morning for a beverage before our tour but decided to pass due to the wait and our approaching tour time. I can imagine that during lunch, you might have a wait because many menu items are prepared as they are ordered. Fortunate for us, we visited on Potato Day. Staff and visitors were treated in the rotunda to complementary baked potatoes with numerous toppings to choose from plus beverages. We were told that the following day would be Ice Cream Day. Although there were four adults and no children on my guided tour, I did see materials designed for children and got a sense that the tour could easily be adapted to interest them"
  ]
 },
 {
  "name": "LBA Park",
  "address": "3333 Morse-Merryman Rd SE, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b944ca88-9332-11ea-8cbf-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "field",
   "kids",
   "walking",
   "kids",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=12051145418547576830",
  "source": "GoogleMaps",
  "reviews": [
   "I always love going here. I like that they keep up to date on everything there. Something that I found out a while back is that this park is much bigger than it appears. They have these trails in the forest then we found the actual property marker of the park. It was a pretty cool experience. I definitely recommend you check out those cool trails.",
   "Great park. Awesome playground with a zipline. Small kids and big kids areas. Covered picnic area. Sports fields. Walking trail that connects to forested trails. Two parking lots. But the larger lot had had trouble with burglary.",
   "What a fun park for kids! All kinds of great pieces of playground equipment and softball field. Beautifully kept grounds and walking trails.",
   "One of the best parks in the Olympia area with scenic trails, play ground, bike path and kids play yard. This park is for everyone from senior citizen to kidd since all of them can have fun here.",
   "It's very natural. Love the many trail's that are available"
  ]
 },
 {
  "name": "Port Plaza",
  "address": "701 Columbia St NW, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b997845a-9332-11ea-9fe9-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "tour",
   "kids",
   "eat",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6449898384018891342",
  "source": "GoogleMaps",
  "reviews": [
   "LOVE the atmosphere! Reminds me of some of the warfs in San Francisco.",
   "I was there for Olympia Harbor days, which is always fun. A lot of vendors, boats you can tour and food to eat. When nothing is going on, its still a nice place to take a walk, theres a playground along the way for the kids and food along the way too. It's a nice play to take in some of Olympia.",
   "Lots of festivals in the summertime.  Beautiful area.  Parking can be challenging which is why I gave 4 out of 5 stars.",
   "Always a great romantic walk on the good ol' Olympia waterfront.",
   "Always love coming downtown Olympia and the Waterfront is one of our favorite stops this park is always clip kept really clean and they often have events of some sort or possibly a festival we stumbled across the Wooden Boat Festival on this particular visit there's lots of parking around near as well as the farmers market is a close walk so you can do everything at once a great place to spend a few hours wandering around with beautiful scenery"
  ]
 },
 {
  "name": "Yauger Park",
  "address": "3100 Capital Mall Dr SW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b9daa800-9332-11ea-9c3b-14b31f159f22.png",
  "tags": [
   "nature",
   "parks",
   "walk",
   "family",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6923164142449358026",
  "source": "GoogleMaps",
  "reviews": [
   "Big well maintained park. Bathrooms, shelter area, trail, nature preserve, large playground and community garden. Theres a lot of homeless attracted to this area unfortunately, which can make you want to stay a little closer to the kiddos",
   "A one size fits all park. The parks and rec. Service staff are great. The ball fields are well done, as well as the 22 shoe pits.. the one missing things are parking in surrounding communies so the Senior pro shoe players can park 5th wheels, the prides Tripp. Half pipe , so skilled skateboard can stop playing in the swimming pool. Lastly the hanging gardens and running Creek into and out of the park . The parks and rec are, I say again great and the community is blessed...",
   "I love doing my daily walks here with the family. Also has a lot of poke stops for pokemon go and a gym which makes the walk fun for everyone",
   "I love this Park! Wonderful pond-things, ducks, ball fields, playground, restrooms, and tons of space. Great for a relaxing afternoon walk!",
   "Really nice park with lots of shade on a hot day!"
  ]
 },
 {
  "name": "Heritage Park Fountain",
  "address": "330 5th Ave SW, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ba3b62d4-9332-11ea-a72b-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6296563734125338053",
  "source": "GoogleMaps",
  "reviews": [
   "Super fun place for kiddos to play! Love the Capitol building in the background!  There’s lots of variety in the water splashing and even music/sounds off and on.  Benches need some repairing but plenty of grass and shade to sit in... would be nice to have restrooms nearby but can find those at the Park a few blocks away.",
   "I used to LOVE this splash pad and park but the day this photo was taken there was a bizarre fight/altercation and about 3 (adult) people were bathing and washing their clothes (and shoes) in the water where all the children were playing.  I don't know how I feel about that, but I have suggestions for the City: Clean up the damn park. Make it usable for tax paying citizens. Hire a guard or rent a cop to walk the grounds, fix the damn benches (seriously!) and keep the place tidy.  I recognize we have a homelessness issue and a drug addiction issue, but letting this park go to the wayside is only going to make it worse.",
   "I find that watching this fountain dance and watching the people play around it is a great way to clear my mind snd put me in a great mood. There have been times I have come here just to fo that.",
   "I love going to Heritage Park to do my thinking and crocheting and coloring",
   "It was great. Really nice on a hot day!"
  ]
 },
 {
  "name": "Wonderwood Park",
  "address": "5304 32nd Ave SE, Lacey, WA 98503, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ba86eb10-9332-11ea-a477-14b31f159f22.png",
  "tags": [
   "creative",
   "walk",
   "parks",
   "family",
   "structure",
   "walking",
   "walking",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=15082932218607535606",
  "source": "GoogleMaps",
  "reviews": [
   "I love this park. It's huge and has 2 park sections. One section has smaller big toys and has a little mini 1 hoop basketball area. I love going to this part, it's more secluded. The other section has much bigger big toys. I like the new stuff they put in it. Love the musical toys, it's so creative. They have lots of trails that you can walk through that all connect to each section. They also have a paved trail that connects the two park sections to each other. They have a tennis court. They have a full on basketball court at the bigger section. They have picnic table areas for eating. They have a covered area for eating like if you want to have a big group there. This is one of my favorite parks and always holds wonderful memories for me.",
   "Very pretty park! Well kept and the trails are so pretty and decently shaded for hot days! Good trail to bring family or dogs.",
   "This is a fun park.  We went in the morning and the shade was perfect.  I enjoyed how the play structure was nestled among trees.  Basketball courts, ball fields, and lots more.  Great walking trails as well.",
   "I ADORE this gorgeous park.  Never too many other ppl here and i always feel closer to my Higher Power walking amid the huge wonderful trees on the trails here.  Plus, periodically, the awesome folks from the Lacey Rocks hide the neatest painted rocks all over here and its like an unexpected easter egg hunt... SO FUN!! ❤",
   "Love this park. It's well kept and has a variety of activity to fit everyone in the family, no matter the age. Bathroom is clean. Has a few picnic areas, some more private than others. The walking trail is beautiful."
  ]
 },
 {
  "name": "Bigelow House Museum",
  "address": "918 Glass Ave NE, Olympia, WA 98506, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bad11124-9332-11ea-ae88-14b31f159f22.png",
  "tags": [
   "tour",
   "art",
   "history",
   "active",
   "knowledgeable",
   "family",
   "tour",
   "family",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=1435237882040243503",
  "source": "GoogleMaps",
  "reviews": [
   "Lots of great history , Ron was an awesome tour guide! Amazing pieces of art throughout the house",
   "Amazing, peaceful and clean place",
   "This was the first home built in Washington that was not a log cabin. It was built by Harvard alum, Daniel Bigelow around 1852 after he arrived in the area by crossing the Oregon Trail. After he married, he and his wife had 8 children and hosted a few important historical figures such as Susan B. Anthony. Mrs. Bigelow was very active in the women's suffrage movement. The house was added onto during the several years it remained in the Bigelow family or 1994. It became a state house museum shortly before that even when the last of the family was living there. Cheryl, our docent, was extremely knowledgeable and thorough. The tour lasts about an hour and is well worth the time. They only ask for donations; there is no set entrance fee.",
   "We were amazed at how many unusual historical objects they showed us as well as all we learned of the Bigelows and early Olympia. Imagine my surprise to discover this place when we moved here this year...my ancient kin...I am related back to 1620 or so...near as I can determine. I came away feeling very proud of this part of the family too!! They sound much like my side of the clan too...and it is a very well preserved place compared to others of like age we have seen in recent years. Highly recommend a visit here.",
   "Great place to learn about early Olympia Washington."
  ]
 },
 {
  "name": "East Bay Public Plaza",
  "address": "325 Marine Dr NE, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bb271dfe-9332-11ea-b6a4-14b31f159f22.png",
  "tags": [
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16177660600285010525",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for family and or solo people!",
   "Awesome place to get wet.  Kid friendly stream of water.",
   "The creek was a ton of fun. An Olympia treasure, and highly recommended destination for parents and children.",
   "This place is awesome! Perfect for toddlers on a hot day. Feels like being at a real stream, without any of the danger! There’s even bathrooms nearby, and a security guard who walks the perimeter. The way it’s landscaped, you really don’t feel like you’re in the middle of the city. And right next door to an awesome children’s museum if you need something else to do! Wish you could park longer than 3 hrs on the street though. :(",
   "It's nice, but the white haired elderly security guard is a jerk and will stare you down and follow you around like a criminal if you have a vape in your pocket. He gave me the creeps, wasn't doing anything wrong. Didn't vape around kids. +the kids museum was closed already and no kids around. Be warned the vape police will be on your tail if you have one.\n\nAnd for the record, there were no signs anywhere in this plaza saying that you could not smoke or vape there. So if that's the rule they need to get some damn signs saying so."
  ]
 },
 {
  "name": "Puget Sound Estuarium",
  "address": "309 State Ave NE, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bb6f23b6-9332-11ea-be02-14b31f159f22.png",
  "tags": [
   "learn",
   "cheap",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6376315828592709001",
  "source": "GoogleMaps",
  "reviews": [
   "Nice place great for the kid's to visit and learn about our sea and marine life we have in our beautiful city.",
   "Saltwater tanks and Estuary education! A wonderful place for children and scientist of all ages too. Look for the Discovery Speaker Talks during the fall/winter for additional Puget Sound Science Education at LOTT.",
   "So fun, can't wait to go back even he's a bit bigger",
   "Staff was super friendly and the content is really educational! Small but cheap and several stations for kids to be entertained.",
   "Fall thru on a weekend between 11am and 4ish pm for some awesome hands on exhibits, live marine life and informative chats with interpreters. A must see if you're in the OLY/TAC area"
  ]
 },
 {
  "name": "Capitol Lake Park",
  "address": "5th Ave SW &, Water St SW, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bbb71050-9332-11ea-b0d3-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=11207811607322520602",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful view, walk, bike ride, etc. Easy to access find. Spring has beautiful trees around. At night, the capital lights up",
   "It was beautiful! The water isn't very safe so don't go in! But my baby brother was very excited to see the ducks :) Its a really beautiful place so don't forget to check it out.",
   "It is a good place for visitors to stop-by.\n\nThere is trail available on the perimeter of the lake for people who want to spend more time. \n\nWashington State Capitol Building is also visible from the lake",
   "One of my favorite parts of downtown. Great loop trail around the lake. Plenty of spots to just sit and enjoy a beautiful day, on the grass or on a bench. Fall is the best, the trees lining the lake just burst with color. Great views of the capitol and some fresh air when you need to step out of downtown.",
   "This is one of the best places in Olympia to hang out and just relax. It overlooks a number of boats in the marina, so there’s definitely a majestic feel when you’re crossing by the bridge or passing through. I’ve even seen a number of seals on occasion which is pretty cool for just a park in the middle of the city"
  ]
 },
 {
  "name": "Tumwater Historical Park",
  "address": "802 Deschutes Way SW, Tumwater, WA 98501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bc0b4af4-9332-11ea-b945-14b31f159f22.png",
  "tags": [
   "walking",
   "parks",
   "brewery",
   "kids",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=2884629743879287871",
  "source": "GoogleMaps",
  "reviews": [
   "Fun park with river side view of the old Olympia Brewery.  This is one of those parks that for whatever reason the playground usually has more parents than children.  There are walking trails and covered areas.  Can get busy at times, but worth the visit.",
   "This park is great since it's updating. Kids love. The zip line is very popular",
   "Nice park. Part of it is wild with dirt paths. The kept up grass areas are very nice with interpretive history displays. Not nearly as impressive as the Falls park next door, but it is pretty and had a lot of additional history of the area on its displays.",
   "I love this place! Even when its crazy with a ton of people it's fun. The park is huge and worth a visit. Huge covered area, real bathrooms, good amount of parking, and fun for all. The only thing that could make this place literally perfect would be a baby swing!",
   "Amazing playground, and a great walking trail. The views along the water are nice. We saw tons of waterfowl and a bald eagle! Lots of Pokemon Go and Wizards Unite locations. :)"
  ]
 },
 {
  "name": "Yashiro Japanese Garden",
  "address": "1010 Plum St SE, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bc5bd980-9332-11ea-adb3-14b31f159f22.png",
  "tags": [
   "free",
   "music"
  ],
  "link": "https://maps.google.com/?cid=2317921489151077006",
  "source": "GoogleMaps",
  "reviews": [
   "I've been there and it was beautiful but today, Saturday, at noon it was closed but the sign said Dawn to dusk",
   "This Japanese garden is small, pretty and FREE entry. It has koi fishes in a pond and a very small waterfall. It is next to a busy road, so not zen unless you wear headphones and listen to instrumental music. \nOtherwise, worth a visit if you’re in the area.",
   "This is a cute city park. It's very small. Parking is a challenge as the lot is small. The paths are lined with flowers and the pond is very nice. The park is well maintained and clean. The spring flowers were just in bloom. I hoped to see a Sakura in bloom... there were some across the street.",
   "All the plants that were there were beautiful, but lacked in variety. Lots of the same bamboo and pine trees. And the koi pond was pretty stagnant. Lots of coins in the water, a little bit of trash and only one little fish that just wanted to hide by the waterfall.",
   "Cute little park. Small and appeared well kept."
  ]
 },
 {
  "name": "Schmidt House",
  "address": "330 Schmidt Pl SW, Tumwater, WA 98501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bcb2ac4a-9332-11ea-8c4e-14b31f159f22.png",
  "tags": [
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9529912501467946397",
  "source": "GoogleMaps",
  "reviews": [
   "Bob Crims private group tours are wonderful, with 60 years working on site, there's potential for a new story every visit. The building is beautiful and full of local history.",
   "Fun day with the family",
   "My wife and I got married here in 2008 so it holds a special place in our hearts. Great staff and a great venue for events.",
   "Beautiful venue but staff is cranky and unwilling to help.",
   " Nice place for events and weddings.  Nice rose garden. "
  ]
 },
 {
  "name": "Bigelow Park",
  "address": "1220 Bigelow Ave NE, Olympia, WA 98506, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bd116e62-9332-11ea-96e8-14b31f159f22.png",
  "tags": [
   "kids",
   "parks",
   "structure",
   "nature",
   "walk",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=2736765377011992727",
  "source": "GoogleMaps",
  "reviews": [
   "I have been going here since I was a baby (1990) and it is always so quiet. I have never once been where it was crowded. I love that they have a squishy rubber type floor under the play equipment. I don't worry as much about my daughter falling or tripping as I would with rocks or bark. The play equipment is appropriate for a large age range as well which is great. Many parks cater to either younger or older kids it seems and have little of one or the other.\n\n I have many great memories here. Though it is small, it is nice. There is however occasionally someone smoking pot or cigarettes too near the play area which isn't cool. That is never really a problem, though since we could always go explore the trees and stone structure off to the side.",
   "Nice park. I don't have anything really bad or good to say about bigalow. Nice place to take nature photos.",
   "Always busy with lots of neighborhood kids, and there are fun toys to play on... I love the flooring they use at the park, its so soft to walk on!",
   "Beautiful little park! Very remote but still a nice place to visit",
   "Wide open park in residential setting. Nice to live nearby and have access by walking. Gotta watch out for the druggies in the parking lot like every city park though"
  ]
 },
 {
  "name": "Kettle View Park",
  "address": "1250 Eagle Bend Dr SE, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bd6ad95e-9332-11ea-a3bc-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3175061164674292355",
  "source": "GoogleMaps",
  "reviews": [
   "Lots of covered areas a nice tennis court plus a soccer field",
   "I nice small park with good big toys. Entertaining for toddlers and bigger kids",
   "Nice little neighborhood park!",
   "Nice park for dog walking. Has a bathroom and a drinking fountain.  Also has a second path that connects for an extended walk behind the duplexes and a path that connects to another neighborhood where you can then walk to Barclift park. Love it here! Be really glad when the construction of apartments is done the noise is awful and disrupts the peace at the park.",
   "Awesome little park!"
  ]
 },
 {
  "name": "Watershed Park",
  "address": "2500 Henderson Blvd SE, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bdb9bcba-9332-11ea-8574-14b31f159f22.png",
  "tags": [
   "walk",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=10108432187696695608",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful Park. This is the park I was proposed to. Will always remember this park and I've got beautiful pictures from here. We come back every year on our anniversary. ❤️",
   "Awesome park! Even in December its kinda warm. They have like 20 little bridges over the creek and the trail is maintained by volunteers and they do a great job!",
   "Beautiful park with looping trails and multiple entry points. Leisurely walk with the dogs (leashed, of course) provided a nice little workout while enjoying the magnificent wonders of nature. Enhanced by a long time friend who I rather see these days.",
   "Great tail. Over a 3 mile long loop, with multiple exit points. Lot's of moss and little streams.",
   "Fairly accessible and à beautiful well kept area. Will be back for some trail running!"
  ]
 },
 {
  "name": "Olympic Flight Museum",
  "address": "7637 Old Hwy 99 SE, Tumwater, WA 98501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/be098aba-9332-11ea-bdc1-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "history",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=8627940498458084085",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to visit. The staff is very friendly and knowledgeable about all aircraft. They have plenty of stories to talk about. Volunteers are welcome. The air show is yearly in the summer. Open Tuesday through Friday 11-5 closed on Monday. They sometimes have special events. Book a wedding. The gift shop is pretty good",
   "Located at Olympia Airport. Parking out front. Mostly tended by volunteers. Interesting hangar with local nostalgia. A lot of work has gone into establishing this facility so drop by and drop in a donation. Enjoy a step back into history before we lose it.",
   "Great place to take the kids. It's small with only about a dozen aircraft. Lots of information and artifacts. There are two aircraft kids can climb into and around. There is also a mock control panel us use. Good customer service with a variety of discounted entry fees. Unisex restroom on site. Nice little store with something to interest most. Easy access and exit from the primary road.",
   "Docent was amazing spending time with our 12 year old grandsons explaining things.  Several aircraft for kids to climb in and experience.   Interesting displays along the walls to.look at.  A small museum, but well worth the visit",
   "Amazing exhibits and displays. 3 aircraft on site which you can climb in and get up close and personal with."
  ]
 },
 {
  "name": "Rainier Vista Community Park",
  "address": "5475 45th Ave SE, Lacey, WA 98503, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/be505806-9332-11ea-a316-14b31f159f22.png",
  "tags": [
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=18338516009946211503",
  "source": "GoogleMaps",
  "reviews": [
   "Nice park, it's pretty huge, has a large parking lot, and has a lot of things to use such as: playground area, basketball court, tennis court, baseball fields, soccer fields, skate park, and restrooms. Tons of open grass to utilize for volleyball nets or whatever you feel like using the open area for. There are a few gazebos and picnic tables as well, and a few park benches. Very few shaded areas though, not a whole lot of trees, so if you want shade then definitely bring your giant umbrellas or canopy's.",
   "3 sandy volleyball courts, 3 baseball diamonds, gihugic soccer area, kids' playground, 2 tracks, tennis courts, baskbetball... and an amazing skate park. Also drinking fountains & restrooms, and plenty of parkung. I don' even know what else, but what more could ya' ask for from a park that isn't on a lake and isn't a theme park other than what a lotta' kids call \"Skate Park\"? I'm told they even had a great fireworks display ( that I missed ).",
   "Wide open spaces accomodating many sports.  Paved trails for long walks and grassy areas, playgrounds and space for kids to run.  Plenty of parking.  I've never felt unsafe here.",
   "Beautiful park with lots of amenities. We took engagement photos this weekend and there was unlimited locations for fantastic shots!",
   "Such a nice park to have a get together. We had a cousins birthday here and it was peaceful and beautiful. Didn't see and bums hanging out was the best part!"
  ]
 },
 {
  "name": "Woodland Creek Community Park",
  "address": "6729 Pacific Ave SE, Lacey, WA 98503, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/be9a80cc-9332-11ea-b593-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "free",
   "walking",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7821802540628451891",
  "source": "GoogleMaps",
  "reviews": [
   "It was very exciting my grandson is almost two and the slides and play equipment was perfect for his age. They also have more stuff for older kids. One thing I didn't like was that they have bark for the ground so my grandson got slivers in his hand I wish that they had foam padding. We even got to see the Canadian geese.",
   "This community park has a very pretty little lake(Long's Pond), with migratory birds, fishing, BBQ areas, kids play areas, and level walking loops.   Swimming and boating are not allowed.\n\nThere is a very tidy community meeting hall that can be rented for parties, memorials, etc.\n\nParking:  Free and ample.",
   "This park is really neat. There is a big playground good for little and big kids, pond to feed ducks and geese, gazebo to sit under, community center, disk golf and trails to walk around. We took 6 kids ages 3-17 and had a blast. We even did some geocaching. Definitely will be back to this one.",
   "We attended the Lacey Fish-In at the lake here.  It was rainy but we had a fantastic time.  Fun park!  We were successful in catching a fish and would have stayed for longer if it wasn’t raining.  We will be back as we enjoyed our time here.",
   "So much to see and do.The llake for fishing all the room for running and great play structures. Covered tables for picnicking and benches to set and watch your children play. I just wish there were more swings ,children love to swing and it is very good for their emtions there is only like 2 swings there."
  ]
 },
 {
  "name": "West Central Park",
  "address": "1919 Harrison Ave NW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bedf2c50-9332-11ea-92b0-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=3773094526851475677",
  "source": "GoogleMaps",
  "reviews": [
   "Stunning example of what a dedicated group of community builders can accomplish with vision & grit.",
   "Building heart into the community.",
   "Amazing community park. Dang good vibes.",
   "Nice little park. It is very small, but well maintained. There is also an area with a stage where people can perform. I love waking here with the dogs.",
   "I go to relax it great"
  ]
 },
 {
  "name": "Pioneer Park",
  "address": "5801 Henderson Blvd SE, Tumwater, WA 98501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bf325418-9332-11ea-99cc-14b31f159f22.png",
  "tags": [
   "parks",
   "family",
   "kids",
   "walking",
   "walk",
   "field"
  ],
  "link": "https://maps.google.com/?cid=7029188531699424187",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely beaches and access to the river, there's a few different spots and they are all quite nice! It can be a bit cold but it's definitely worth a trip on a warmer day!",
   "One of my favorite parks of all time.",
   "Great to have a place that's close where the whole family can get out and appreciate some of the things we have in our own back yards. The river was refreshing with the heat, there's enough space for everyone without disturbing families or other people around you, and more importantly, the people were great and well behaved. My daughter loves it there and we will definitely be returning.",
   "I love this park because there are nice walking trails, its clean, and easy access to the river. Its a great place to go with kids to float in the summer! It takes about an hour the water is very mellow so you dont have to stress to much about anything bad happening.",
   "Cute park, with scenic trails. There are bathrooms, a playground, a volleyball area, and a baseball field. There is plenty of space to spread out/run around. Great place to walk your dog or hangout."
  ]
 },
 {
  "name": "Woodard Bay Conservation Area",
  "address": "Olympia, WA 98506, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bf7b6b3e-9332-11ea-bdb9-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "family",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=17364802412761869411",
  "source": "GoogleMaps",
  "reviews": [
   "We were invited out for an afterwork walk by friends and it was a wonderful experience. The trail is a gentle slope up a hill and the crest overlooks a lovely scenic view of the bay with two separate viewing areas a few dozen yards apart. It's a lovely, well maintained path and winds through some gorgeous greenery. I highly recommend for a short walk with a small group.",
   "Absolutely beautiful. Great place. Love to come and just clear my head. My kids also love it here. I think i also want yo go kayaking soon.",
   "This place has always been a family favorite! All year round! \n\nThe paved pathway makes it perfect for wheelchair access, and the hiking trail is awesome too! Bathrooms are at the end of the trail. Bring a snack, and always pick up your trash. \n\nCome in late summer to see the bats 🦇 fly out from the old rail road ties.",
   "Awesome and unique all in one.  Bats spend the warmer months in an old railroad bridge.  Seals can often be seen.  Boat ramp if you kayak/canoe.  Beautiful.  Thank you.",
   "beautiful area, nice Trail. Nice time of year to be out here watching all the seals and a large variety of birds"
  ]
 },
 {
  "name": "Sylvester Park",
  "address": "615 Washington St SE, Olympia, WA 98501, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bfc4f87a-9332-11ea-8614-14b31f159f22.png",
  "tags": [
   "eat",
   "walk",
   "music"
  ],
  "link": "https://maps.google.com/?cid=16829415841686182761",
  "source": "GoogleMaps",
  "reviews": [
   "This is such a nice quiet peaceful place a great spot to eat lunch.",
   "This is a great space in the city, downtown and close to the state Capitol, and you will enjoy the space.  It’s also recommended because it is not filled with people experiencing homelessness.  Lots of great restaurants around for a quick lunch or dinner.",
   "Olympia WA does not disappoint!  We went out from the hotel to walk the dog and heard music . . . Orchestra music . . . Phantom of the Opera music!  We walked to the park and found the amazing Music in the Park!  What an amazing city!  Beauty, Culture and Class! Wish we could stay!",
   "Very pretty park with the beautiful old capital building. Unfortunately there were a lot of homeless people sleeping there now unlike when I have been there in the past.",
   "With an absolutely gorgeous state building overlooking it, Sylvester Park is a beautiful little nook to go to in the middle of downtown. The grass is well kept and the squirrels are entertaining to watch. The only downfall is the traffic around it and the number of people that set up camp there for various reasons (although they tend to keep to themselves, it can be a bit crowded at times). From time to time, they have small events there at the gazebo in the center of the park which are amusing to attend, although parking can be scarce so be ready for a short jaunt from your car to get to the park."
  ]
 },
 {
  "name": "Friendly Grove Park",
  "address": "2316 Friendly Grove Rd NE, Olympia, WA 98506, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c0162588-9332-11ea-ab21-14b31f159f22.png",
  "tags": [
   "family",
   "walking",
   "walk",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13707587601260718403",
  "source": "GoogleMaps",
  "reviews": [
   "Cute neighborhood place to spend the afternoon. Clean! Let's keep it that way. People are nice to each other there. Perfect for family or walking your dog in the morning.",
   "Very Cool little park with nice walkways, playground, small skate park, basketball half court, soccer nets and more! My daughter Kk, son Wesley and I just got done playing here and it was great!",
   "Lovely park for everyone in the community. Dog friendly, with play areas for children, and picnicking areas to enjoy the well manicured lawns. Tennis courts also available for your volleying pleasure.",
   "A nice family park with kid's playground equipment and nearby restrooms. Plenty of places to walk around. They have a large house-like place to rent for special occasions that is quite large with plenty of room in the grassy area to have many tents and tables to seat and entertain your guests.",
   "Pretty park, especially great for younger kids and toddlers"
  ]
 },
 {
  "name": "Lions Park",
  "address": "800 Wilson St SE, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c061fbf0-9332-11ea-bd0e-14b31f159f22.png",
  "tags": [
   "kids",
   "eat",
   "kids",
   "field"
  ],
  "link": "https://maps.google.com/?cid=16074322448134318310",
  "source": "GoogleMaps",
  "reviews": [
   "There are a couple of things, like a rock to climb, for my older kids and they still have stuff for my babies!",
   "Perfect place to do and eat lunch. I loved sound the corner got several years and would bring the dog and play fetch for hours at the baseball diamond. The upgrades are amazing too",
   "This is a real centerpiece of the neighborhood. I remember growing up playing YMCA sports on these fields as a kid and now I'm seeing people my age with their own kids playing around on those same fields. It's kept up pretty well by the city. Has a nice playground for kids to mess around on and a covered bench area for a picnic or even a birthday party in the summer!",
   "Cute little neighborhood park in a great community. A fun playground for different developmental levels, a mini spray area to keep cool on hot days, tennis court, basketball hoop, a little baseball field and covered picnic area as well as quite a few picnic tables dispersed.",
   "Lions park is a nice little spot to hang out and have a picnic. The facilities in this park include permanent restrooms, a covered area with tables, a fenced tennis court and parking."
  ]
 },
 {
  "name": "Grass Lake Nature Reserve",
  "address": "814 Kaiser Rd NW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c0b2b40a-9332-11ea-bad3-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walk",
   "history",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=16448185558199977348",
  "source": "GoogleMaps",
  "reviews": [
   "I took my 4 grandchildren ages 12 to 5.  The walk was easy and we saw so many plants, berries, flowers, trees.  The kids loved the quiet.  They particularly liked finding the water.",
   "I enjoyed this excellent urban ramble in the woods. The beginning and end of the mile and a half Loop trail is an open Prairie. The remainder of it was Forest and it was beautiful. I was there on a beautiful cloudless day birding and enjoyed the cool cover of the forest canopy. I didn't get a look at the lake nearby, but the underbrush was pretty thick and I couldn't maneuver and close enough.",
   "It's a beautiful clean park. Great for dog walks",
   "It was beautiful aside from the pile of old bones at the beginning of the trail. If they have history I would like an informational plaque stating such. If it's illegal or unsafe I would like it removed. The lack of trail markers also confuses me it feels like I might walk into someone's backyard.",
   "Quick loop takes less than half hour to walk. Very flat. The forest if pleasant and feels secluded. No major views of the water as there is no real shoreline. However there are places you can see it if you follow some of the side trails. It's a good place to run in the summer. During winter the exposed tree roots are a bit hazerdous for running, at least for me."
  ]
 },
 {
  "name": "Tolmie State Park",
  "address": "7730 61st Ave NE, Olympia, WA 98506, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c10f2c30-9332-11ea-9806-14b31f159f22.png",
  "tags": [
   "kids",
   "nature",
   "walking",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=2634034747707728398",
  "source": "GoogleMaps",
  "reviews": [
   "Another great State Park in Wa State!\n\nThis park has wooded hills that roll down to the rocky beach. Trails cut through the woods and follow some of the tributaries as they cut through the woods heading out to the sound. See this park on high tide and low tide as the experience is a little different for each!",
   "Been here thousands of times. Trails are well kept, however beware of mud after rains. Beach access is easy and close to parking. Definitely worth the Discover Pass.",
   "Horrible atmosphere! Barking dogs everywhere, ready to attack each other. So unpleasant, especially when looking for a tranquil getaway with kids. Did not feel safe or relaxed. What a shame, bc the nature is beautiful",
   "One of my favorite places in the world. Beautiful beach. I almost always find sand dollars and oysters. Seen bald eagles. The hiking trails make you feel like you're walking in Jurassic park!",
   "This State Park is part of South Puget Sound. I love the bridge and hiking trails. Great place to explore  nature."
  ]
 },
 {
  "name": "Billy Frank Jr. Nisqually National Wildlife Refuge",
  "address": "100 Brown Farm Rd NE, Olympia, WA 98516, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c158436e-9332-11ea-8458-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "nature",
   "walking",
   "walk",
   "walk",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=7418867835967853703",
  "source": "GoogleMaps",
  "reviews": [
   "once you pay the parking fee at the kiosk, turn left and you have a choice of going on the raised walkway through the marshes, to the right at the fork. Or continue on and go left and find the gravel road way. This is good choice if you want to quickly get out to view the Puget sound.\n\nIt was such a beautiful clear day that we could see all the way to Olympic national Park and Mount Olympus in the distance.\n\nSerios photographers were out in droves on a beautiful day, with their large camera lenses, so it really is a great place for photography.  We saw a young little green frog scoot across the roadway and it seem to be learning how to jump.  Tons of geese seemed to be returning, and we enjoyed watching them land on the water. \n\nAll of this and we were only there for 45 minutes. We will definitely be back!  Great place to visit rain or shine if you are a nature lover for photographer.  Easy walk most of the way.  Probably not easy for wheelchairs because both the walkways and the gravel road are bumpy.",
   "A boardwalk that extends a mile into the estuary of the Nisqually River, set aside for gorgeous, sundry wildlife...  OF COURSE it's as amazing as it sounds!!\n\nThis place is just an incredible gift, easy to navigate, and great for all walking skill levels.  If you need a place to remember the peace and beauty of nature not too far away, this will not disappoint.",
   "Awesome walk! Great for bird watchers. A bearing pair of bald eagles flew over my party several times very closely! We had a wonderful time.",
   "Wow, lived here 10 years and our first time stopping here. Amazing place to walk and see birds, ducks, and possibly salmon on the nisqually river. The boardwalk loop is huge, also tons of other trails to do. Can easily spend half a day here.",
   "I love this place. It's so peaceful and has lots of great places for walking. Great place to take kids for walks. I love seeing all the different birds that live and migrate here."
  ]
 },
 {
  "name": "Washington State Governor's Mansion",
  "address": "Capitol Grounds, Olympia, WA 98501, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c1ba244c-9332-11ea-8565-14b31f159f22.png",
  "tags": [
   "tour",
   "free"
  ],
  "link": "https://maps.google.com/?cid=9604093358612642884",
  "source": "GoogleMaps",
  "reviews": [
   "Nice place.",
   "Excellent free 45 minute tour",
   "Walls and barriers don't work do they Mr. Inslee?  Why are they so prominent around your personal residence?",
   "You can't enter the grounds but it certainly is nice to look at.  It's set upon a hill on rolling grounds with a very nice manicured lawn. You can gain some decent vantage points if you stroll around the perimeter.",
   "The Governor never responds to my hand written, hand delivered correspondence! SAD!"
  ]
 },
 {
  "name": "Decatur Woods Park",
  "address": "1015 Decatur St SW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c20424ca-9332-11ea-9a74-14b31f159f22.png",
  "tags": [
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16845597319617156127",
  "source": "GoogleMaps",
  "reviews": [
   "Good park and little trail.  The playground has the foam feeling flooring, so no worries about bark or rocks getting in the shoes!  There is a loop trail that has learning signs as well. Plenty of shade, and the bathrooms are kept clean.  Additional parking is available (except on Sundays) at the church next to the park.  Great place to just sit back and relax in the shade too.  If you are into games like PoGo or WU, this is a good spot with a gym/fort and plenty of stops/inns!",
   "A great little play area in the middle of a beautiful setting. Has a small trail that loops around with activity cards for you and the kids.",
   "Nice little park has a track through the nearby forest and access to nearby apartments. The park has padded flooring which is nice and a restroom onsite that is well managed. There is even a basketball court nearby.",
   "Nice little park. Dogs love it.",
   "Very nice and fun to bring the kids and pups. Was a great place to do parties and also have some hiking trails too."
  ]
 },
 {
  "name": "Woodruff Park",
  "address": "1500 Harrison Ave NW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c25e5310-9332-11ea-b694-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4551200520918562699",
  "source": "GoogleMaps",
  "reviews": [
   "My 5 almost 6yo loves this place sooooo much.",
   "Cute park. Lots of shady areas to sit. Make sure to bring a chair or a blanket because the few benches get taken up fast. Would have been nice if they made the splash area a bit bigger. That being the first splash park in Olympia, it gets busy fast. Also parking kind of sucks a bit...but mostly due to the lack of it. All in all a nice place to cool down.",
   "My granddaughter absolutely loved it! A bunch of different water features. Some even being controlled by the kids. So many kids with huge smiles, laughing, and all ages playing together. Safe, clean, a perfect family park. A great find!",
   "Good place to take kids",
   "Awesome Park, I'm glad West Olympia is doing more for families!"
  ]
 },
 {
  "name": "Thomas W. Huntamer Park",
  "address": "618 Woodland Square Loop SE, Lacey, WA 98503, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c2ad5d90-9332-11ea-90b6-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=6739157309583302927",
  "source": "GoogleMaps",
  "reviews": [
   "It's a nice park, in a \"small\" business park. I'm happy Lacey puts effort into decorating it for the holidays.",
   "This is a small Park and grassy pavilion. The pavilions kind of nice. It's a place for skateboarders to hang out. It has sidewalks that just don't seem to go anywhere they just seem to wrap circles. One very odd things that they I've put picnic tables up effectively as barriers across the sidewalks.I'm not sure what the logic is for that but it does not seem to make much sense. It seems neither welcoming nor inviting.",
   "It's usually quiet. They know how to party in Lacey & this park a great spot for that! Beautiful Christmas lights & if you're a geocacher there's a nice hide here👍. Plenty of summer time events too.",
   "Nice quiet place to have a picnic with the family. No toys for children however.",
   "Love this park!  The lights look amazing right now!"
  ]
 },
 {
  "name": "Kayak Nisqually",
  "address": "4949 D Milluhr Rd NE, Lacey, WA 98516, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c2ff0040-9332-11ea-b19e-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "knowledgeable",
   "tour",
   "history",
   "knowledgeable",
   "tour",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=18114644025865657490",
  "source": "GoogleMaps",
  "reviews": [
   "This was my second trip with Kayak Nisqually and did the biolum tour.  It, again, was absolutely amazing and fun.  Sam has extensive knowledge of the area, history, cultures and eras, not to mention the science and ecology of what we were experiencing.   We were provided were equipped with safety info, lots of how-to and suggestions to make our time more enjoyable.  You don't have to go far to experience serenity and beauty - it's all right here.",
   "We had a fantastic tour with Kayak Nisqually.  So glad to see something available in the south sound.  Sam has a great aptitude for instruction and safety for all skill levels.  He is also very knowledgeable about the local environment and history.  It was an awesome trip.",
   "Sam was amazing with our various aged, various ability group.  We had a full group of 10 and we all came together after reading the novel The Highest Tide by Jim Lynch which was set in the Nisqually Delta.  Sam tailored his marine biology knowledge (and his knowledge of the novel) to our group.  We loved it and highly recommend kayaking with Sam!",
   "Had an amazing bio-luminescence tour with Sam. He’s very knowledgeable and passionate about the ecosystem. Bonus: got to paddle next to very curious seals 👌🏻Would highly recommend.",
   "Great experience with a personal touch very much above and beyond the typical “canned” tour. We got a lot of very cool information about the local ecology and history. Our guide took his time to get us up close to the wildlife; we saw lots of baby seals, eagles, and other cool birds. Our group had people of all different skill levels and our guide did a great job of accommodating everyone and making sure everyone had fun. Would definitely do a tour with them again."
  ]
 },
 {
  "name": "Nisqually Reach Nature Center",
  "address": "4949 D Milluhr Rd NE, Olympia, WA 98516, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c3555df6-9332-11ea-87bf-14b31f159f22.png",
  "tags": [
   "walk",
   "learn",
   "kids",
   "family",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=9538754439696548259",
  "source": "GoogleMaps",
  "reviews": [
   "A nice short walk from a nearby neighborhood. Lots of parking available. Discover pass needed. I saw a heron fishing for breakfast & this bald eagle swooped by me & landed in a near by tree to survey the scene. There’s also a boat launch ramp. I just may have to put my kayak in & check out the wildlife... when it’s a warmer.",
   "Wish there wasn't trash, maybe more life.",
   "Fabulous location.  Marvelous and knowledgable staff, including the amazing Director!  Great summer classes for students.  All around, tremendous contributions to the Nisqually Reach area.  Thanks for all you have done and are doing!",
   "This is a wonderful treasure that most folks may not know about.  A great place to learn about the amazing ecosystem we have in our back yards with the nisqually  delta.  Bring the kids.  Fun and interesting for the whole family.",
   "I love this place.  Dan is an enthusiastic educator. I hope a gift comes along soon to modernize this facility - it's an excellent place to learn about our Sound. Bring boots and plan your trip for low tide if you want the full experience. "
  ]
 },
 {
  "name": "Millersylvania State Park",
  "address": "12245 Tilley Rd SW, Olympia, WA 98512, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c3a5a11e-9332-11ea-8ddf-14b31f159f22.png",
  "tags": [
   "family",
   "nature",
   "walking",
   "food",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16202322118238320448",
  "source": "GoogleMaps",
  "reviews": [
   "Best camping place ever. Tent spots, trailer/RV spots, yurts, a cottage for rent, two swimming holes, concessions stand, kayak rentals, fishing dock, boat launch, trails for biking and walking, everything you want. Cell service is spotty but has improved these past few years. But that’s good because camping isn’t about being on your phone, it’s about being in nature and with the people you love. Our family has been coming here every single year for almost 40 years now. It’s known as Deep Lake to us because my grandparents started going to the Deep Lake Resort next door. Rangers are friendly and helpful. Reservations available online, book early because they fill up quick! They have showers and bathrooms accessible in multiple different spots around the grounds. They also have picnic tables and kitchens near the beaches. I just love this place with my whole heart.",
   "Rented the Environmental Learning Center for a group event...fantastic facilities and great support from the rangers and staff. Best equipped kitchen we've used at any park or other event space - top-notch with walk-in cooler, convection ovens, and Hobart dishwasher. Made our food prep and serving a breeze! The cabins are tiny but toasty warm, and the showers are totally reasonable for a camp. Highly recommended for large-ish (75-80 person) groups.",
   "Always a wonderful time at millersylvania State Park. Kids love and we love the peace and quiet. It happened to snow today which made the park look so cool.",
   "It was cool! In the summer I'm sure it's even better! Got my kids and their cousins pic done here and they turned out great!",
   "Great hiking trails. Be prepared for muddy spots if you go early in the year. Very beautiful."
  ]
 },
 {
  "name": "Overlook Point Park",
  "address": "1205 Barnes Blvd SW, Tumwater, WA 98512, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c3f19e42-9332-11ea-9c23-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=5598143248633979251",
  "source": "GoogleMaps",
  "reviews": [
   "Great view of Rainier. Killer!! The overlook is in a housing development in Tumwater Falls, which was not at all what I expected, but beautiful and kind of quirky.",
   "Very nice place to get a bird's eye view!",
   "Beautiful views",
   "Fantastic views of Olympia and the mountain! I only gave it four instead of five stars because it's tiny and you really can't do any walking around. It's meant for people to come and enjoy the view, which is totally worth it!",
   "Great views on clear days."
  ]
 },
 {
  "name": "Burfoot Park",
  "address": "6927 Boston Harbor Rd NE, Olympia, WA 98506, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c4347424-9332-11ea-9628-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=4576299213360726290",
  "source": "GoogleMaps",
  "reviews": [
   "Its beautiful on a summer day! Theres a great little hikeing trail to get there. The waters really clear and calm, my kids loved it! We found shells and cool rocks. Just a really great place",
   "Nice beach area with lots of little creatures to find under the rocks! Be sure to check the tides before visiting. Perfect location for large picnic parties with friends. There’s bathrooms located at the beginning of the trailhead. Play area for the kids, and many gazebos for parties.",
   "Just jumped in the water in feburary. It was cold. Found a cool rock shrine. It was cool. Very pretty place 10/10.",
   "Beautiful park! Plenty of space for throwing a frisbee around as well as great nature trails with informative signs and beach access! Well maintained. Trails to the beach can be a bit steep so keep that in mind.",
   "Absolutely love this place! They have lots of picnic and barbecue areas, playground is little small but the massive amounts of green grass areas make up for it. The trails down to the beach are very nice and my toddlers & tots do great on them with a hand or two! It's like jungle they say! Even nice to go when it's raining because the trees on the trails keep you covered for the most part."
  ]
 },
 {
  "name": "Nisqually Red Wind Casino",
  "address": "12819 Yelm Hwy SE, Olympia, WA 98513, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c488fcb8-9332-11ea-b629-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=17693607138720411002",
  "source": "GoogleMaps",
  "reviews": [
   "One can almost always expect to be greeted with a genuine friendly welcoming by the front door security department. They have a very large non-smoking area with a variety of slot games and a few table games.  In one of their bars they offer live music, food, and a great atmosphere. They have several non-alcoholic beverage stations that are above that expected when it comes to free! Their Players Club has combined with their cashier so you don't have to wait until lines to do different types of transactions. Most of the employees are very friendly which is hard to come by nowadays.",
   "This place is always great. It holds a special place as my dad worked there for 10 years he is too sick for anything now but some of my best adult memories of him where from there. Dressed in a suit he was head of security . So when I go it reminds me of him when he was well and that alone is worth going. However I also love to game there all my favorite slots are under that roof! Including copper dropper , stinking rich and the money machine ! Yet to hit any jackpot but I still enjoy the atmosphere it gets very busy and although it's goood for business its less fun for the player looking to okay their favorite machine .",
   "The casino itself is nice enough and the non-smoking area is one of the better in the state but the issue is rewards for loyal customers.  The Red Wind changed the way they give out rewards to loyal customers.  I have talked to numerous patrons and all have received significant reductions to nearly a third of what was previously received.  In the future I will drive to the Lucky Eagle which gives a much better reward and has a nice non-smoking area.",
   "Went for the Drawing every 1/2 on a Thursday. Ate at the Seafood and Steak House. My wife ordered Small House Salad with Huckleberry dressing and Crab Cakes. I ordered Chicken and Mushrooms Fettuccini. It came with soup or salad, l had Clam Chowder 👌. The complimentary bread is soft and tasty with whipped butter. We were given a tiny scoop of sorbet to cleanse the pallet 👍. Plenty of covered parking for the rainy season. We used our players Rewards card to pay for Dinner, too Cool. The slots let me play for a little bit 🤑",
   "Went here from a recommendation and was pleasantly surprised.  Plenty of newer games. Good table action.  The buffet was above average.  And the bar band Stir Crazy was one of the best cover bands I've seen.  Overall a great experience."
  ]
 },
 {
  "name": "Capitol State Forest",
  "address": "Olympia, WA 98512, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c4cae7d4-9332-11ea-854d-14b31f159f22.png",
  "tags": [
   "hike"
  ],
  "link": "https://maps.google.com/?cid=11748866134813664858",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to explore the outdoors. Ive seen lots of deer here. Ive been here a lot also. You will need a Discover pass. The road system is very good. You can drive for days. Google maps works very well here. Use it. It is easy to get turned around. Fill up the tank before you go.",
   "Lots of beautiful views once you get up high. We love cruising in our public lands",
   "I'm up there on Rock Candy Mountain all the time driving around and I kind of like it up there it's interesting and I learned things about the roads that they have up there so I'm going to give it all these stars all five of them that's what I think of it and thank you for letting me say something",
   "One of my favorite places to ride and hike. Camping at Middle Waddle Creek makes it so convenient.",
   "One of my most favorite places to ride quads, hunt and just enjoy the outdoors. Always clean too."
  ]
 },
 {
  "name": "Barclift Park",
  "address": "690 Barclift Ln SE, Tumwater, WA 98501, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c533200a-9332-11ea-9819-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "kids",
   "walking",
   "parks",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=10374418103572924607",
  "source": "GoogleMaps",
  "reviews": [
   "This park is really nice. It has a tennis court, a shaded place for a picnic, and the playground was in great shape. We walked, but there's a couple of parking spaces near by too. We went in the morning in late July so it was a bit too hot to play on for an extended period of time. Although, the trees look like they'd provide shade in the late afternoon.",
   "Nice neighborhood park with some unique toys. Kids really enjoyed it here. Also had a nice paved walk for walking, bikes, scooters. Paved path does have hills.",
   "Great park. Tumwater takes such good care of their parks.",
   "Nice quiet neighborhood park great for a dog walk. Only downside is no public restroom. Very pretty and relaxing some fun little paths through a small wooded area up by the neighborhood entrance. Love it here!",
   "Epic place to hang out with friends after going to 7/11"
  ]
 },
 {
  "name": "Monarch Sculpture Park and Art Center",
  "address": "8431 Waldrick Rd SE, Tenino, WA 98589, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c581416c-9332-11ea-894e-14b31f159f22.png",
  "tags": [
   "free",
   "free",
   "walking",
   "art"
  ],
  "link": "https://maps.google.com/?cid=8751339464768160384",
  "source": "GoogleMaps",
  "reviews": [
   "What a surprising delight! Had no idea this was so close to home, been sharing it with all of my friends, coworkers and customers. It's a wonderful place filled with a lot of emotion (if you're with an artist mindset). It's incredible, everyone has asked me where these photos are from and what the story is behind it. I'd love more details for each piece to understand the perception of the artist but I have no problem coming up with my own. Love this place and will definitely come back!",
   "Was free and very interesting sculptures. Think I missed some of the park, but was there for a couple hours looking around. Was awesome random find. Definitely a diamond in the rough!",
   "Great stop along the Western Chehalis trail. Parking for bikes or cars, porta potty and complimentary water. Nice walking trail through the park but could be difficult for strollers, walkers or wheelchairs as the trails are not paved and there are areas with incline. Great place for a picnic, they have picnic tables scattered throughout. The scenery and setting in the natural environment is just as beautiful as any of the sculptures.  The butterfly maze was not open as of memorial day 2019, but should be in July.  It is free to visit, but you should leave a donation to support this wonderful park.",
   "One of the coolest places I've been in Washington, it is way larger than I thought it was going to be! All of the art and sculptures are amazing, definitely worth checking out! I'll be back soon without a doubt",
   "What a cool place. Thank you so much for your passion and openness. The world is a better place for having this place."
  ]
 },
 {
  "name": "Medicine Creek Winery",
  "address": "947 Old Pacific Hwy SE, Olympia, WA 98513, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c5eb4cb6-9332-11ea-9824-14b31f159f22.png",
  "tags": [
   "drink",
   "drink",
   "winery",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=12065241598978847567",
  "source": "GoogleMaps",
  "reviews": [
   "when you step into this place, you'll fall in love in a heart beat. trust me on that",
   "Currently closed due to illness. Make sure to look at their calendar before attempting to go.",
   "Really amazing place.  Eclectic decor and fun staff.  Wine was surprisingly good.  Nothing like it within 75 miles.  Check it out.  Try a slushy wine.  Normally I would be highly against such a thing as a wine purist but it's refreshing and a fun drink for summer.  ",
   "What a lovely place! Sit in a beautiful rose garden on a comfy couch with your wine samples! Wow! You won't regret stopping here for a taste of their tasty wines. I especially liked their Stagecoach mix ( a robust red) Look at the pix, their bar and bar back are exquisite wooden pieces brought from England, it's worth stopping just to see the place even if you don't drink wine! And the proprietor is a delight as well, genuinely friendly, she loves what she does and it shows.",
   "About a month ago three of us paid a visit to this wonderful winery, this my second visit. They only make red wines which I appreciate because a small winery can't, in my opinion, produce fantastic wines if they try to make too many varietals. The ambiance is quite unique with a very friendly staff, contributing to an extremely enjoyable visit."
  ]
 },
 {
  "name": "Mima Mounds Natural Area Preserve",
  "address": "12315 Waddell Creek Rd SW, Olympia, WA 98512, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c641f880-9332-11ea-883d-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "walk",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=12766319788526325153",
  "source": "GoogleMaps",
  "reviews": [
   "I expected very little but with my 3.5 year old this hike/ walk is PERFECT. We brought his balance bike, and it is flat enough that I don't have to worry, but still has lots of small dips here and there for him to go downhill and practice risk taking. I kind of like that there are no trees because I can see everything, who's coming down the trail, animals, etc. It feels very safe for this mom of 2 hiking without Dad around.",
   "It's a nice place to take a walk and relax.  The mounds are pretty interesting to see, but it's not one of the places I go out of my way to visit.",
   "Loved this place but can't wait to go here in the spring and summer time. We went during the fall.",
   "Great place to visit with kids! Easy to get around with a nice paved pathway.",
   "Pretty neat geographic phenomenon.  The kids enjoyed debating what caused mound formation.  Not much to see other than the mounds but something all Washingtonians should see.  Must have a state park pass and be prepared for noise from a near by gun range."
  ]
 },
 {
  "name": "Old Capitol Building",
  "address": "600 Washington St SE, Olympia, WA 98504, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c69b154a-9332-11ea-bac9-14b31f159f22.png",
  "tags": [
   "historic",
   "family",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=12498775346977181784",
  "source": "GoogleMaps",
  "reviews": [
   "An extremely beautiful historic old capitol building. Great architecture and stained glass. Nice park in front of it. Unfortunately there are a lot of homeless people sleeping in the park in front of it now. It is still worth seeing.",
   "This place is so beautiful! Very peaceful, would definitely recommend to go visit this place with family or friends. Inside it’s amazing all of the hard work that was put into building this place is amazing. The town it’s safe is very small and quit. But definitely recommend to stop by and check it out if your driving by you won’t regret it! To park I believe it was $10 but to enter in we didn’t have to pay anything.  Also if your into photography it’s a great place to get some amazing pictures in.",
   "Beautiful building, I wish I could see it from inside. the type of people on the street around are not the type you want to meet.",
   "Visitors are allowed thirty minutes at this historical building. Well worth viewing some original features: 1. Original marble restrooms; 2. Fourth floor stained glass, surrounded by uncovered brick and stone materials; 3. First floor documents' vault (now an office); 4. Intricate architectural details throughout their multiple floors.",
   "this is the first time i see such a unique building."
  ]
 },
 {
  "name": "Regional Athletic Complex",
  "address": "Olympia, WA 98513, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c6f47a1e-9332-11ea-b388-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=14107892521019131399",
  "source": "GoogleMaps",
  "reviews": [
   "This is a very clean and accessible sports complex. Handicap parking is available,  concession stand, and bathrooms with working toilets. We were very pleased with this area. Only down side is its next to a mushroom farm so occasionally it stinks",
   "It was beautiful and clean. Easily accessible n fun.",
   "More than enough parking for softball tournament. Great playground for all ages. The fields we're turf in place of dirt. Tons of caged stadium seating. Lots of low maintenance restrooms. Snack shack sells kettle corn. Overall well maintained park!",
   "Lots of parking and good soccer fields. Dress appropriately and bring sunglasses! The wind whips across the fields pretty good.",
   "Great place to hang out with the kids...plenty of open space, handy dog waste receptacles all over, lots of shady places to hang out, walking trails and pathways, lots of bathrooms and parking, shelters (with grills and electrical outlets) that can be reserved for special occasions, and SO much more!!! It's worth the visit on any day of the week!"
  ]
 },
 {
  "name": "Frye Cove County Park",
  "address": "4000 61st Ave NW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c74f4354-9332-11ea-9dde-14b31f159f22.png",
  "tags": [
   "parks",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10794092310870641673",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best parks with access to the water in the local Olympia/Shelton area. Play equipment, shelters, toilets and grills.",
   "Hills/trails are kind of high and dark in the woods, but great experience. Great exercise!",
   "Grew up coming to this Park and it remains one of the most beautiful places I've been.",
   "Very nice place to relax, cool salt water experience, even saw a seal up close. Bath house was a bit old school. The one complaint I had was advertisment/signs or direction are no were to be found. The only reason I stopped was because I was looking for a place to fish which is very hard to do because everything on the water is private. Good for the rich lol....just not for me.",
   "Beautiful trails. Well maintained park. Family friendly."
  ]
 },
 {
  "name": "Sandstone Distillery",
  "address": "842 Wright Rd SE, Tenino, WA 98589, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c7ac9fd8-9332-11ea-b072-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "delicious",
   "sampling",
   "tour",
   "active",
   "tour",
   "tasting",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=13319507209858266107",
  "source": "GoogleMaps",
  "reviews": [
   "We had a great time at Sandstone! Everyone was knowledgeable about their products and very friendly. We got to try a great variety of liquors (one vodka, two gins, three whiskeys and a bourbon). I liked that they also carry a locally made tonic syrup and sipping vinegars (these were fascinating to try!). I also enjoyed how everything had a story and they weren't shy about telling those stories. Especially enjoyable: all of the ingredients are locally sourced, their processes are all very environmentally friendly, and even the spent grains have a useful home.\n\nI'd highly recommend this if you have a couple of hours to spare; get the tour, try some tasty booze, support a local business! Win/win for everyone.",
   "Awesome little small batch distillery! Stopped by since it was close to a wedding venue. Great little tour and delicious sampling flight. I actually liked their gin which surprised me. They also had a delicious coffee liqueur. Plenty of potential!",
   "We had an awesome experience as ‘Distillers for the Day’ with John, Justin and Randy st Sandstone. From grain to gulp, we were hands on in every step of the process working alongside the distillers and truly emerging ourselves in the science and sweat equity of craft distilling. It was fun, interesting, active and we had a lot of laughs along the way. I highly recommend Sandstone. Heart and hustle goes into everything they produce with a true local, sustainable and artisan theme throughout every drop of the final bounty!  The bacon whiskey is to die for!",
   "Great way to spend a Thursday afternoon! Thanks, John for the tour and tasting. Excellent product..awards are well deserved :0)   Kathy & Linda",
   "AWESOME distillery!! Great whiskey, great gin, great people! My husband and I were welcomed right in for a tour & tastings! Dont leave without trying their signature vinegars! Mind blowing stuff over here."
  ]
 },
 {
  "name": "Lake Lois Habitat Reserve",
  "address": "Lacey, WA 98503, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c7fd31d2-9332-11ea-a9a1-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=3340697135967133993",
  "source": "GoogleMaps",
  "reviews": [
   "The trails are not in great shape with several blockages. Overall it was a nice walk, not strenuous at all. If you were running the trail, you might need to be careful not to twist your ankle on the narrow unkempt paths.",
   "Lots of fun. Quiet place. No toys.",
   "Great little habitat reserve. Only downfall is there are a couple tents pitched throughout which already weirds me out.",
   "Small area kept up by the Boy Scouts. Nice and clean, just somewhat small. Excellent for young children and elderly",
   "Not too many people. For beautiful over the water."
  ]
 },
 {
  "name": "Exit Puzzles Escape Room",
  "address": "109 5th Ave SW, Olympia, WA 98501, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c859389a-9332-11ea-b4e7-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=11310057705896057084",
  "source": "GoogleMaps",
  "reviews": [
   "Did this with a few friends for my birthday. Had a fantastic time. This was challenging, but solvable. This was my first escape room, but I'll be back to do their other room soon. \n\nI cannot stress this enough, YOU SHOULD CHOOSE THIS ESTABLISHMENT if you are interested in escape rooms. Others in my group had been to other rooms, and this was by, BY FAR, their favorite. \n\nAnd our guide, Kyle, was awesome. I'd give this 7 stars if that were an option.",
   "We did the new puzzle, Museum of Curiosity, for a work team building activity. Lots of fun! We had done The Landlord previously and this one was even better. Highly recommend!",
   "I had so much fun! Highly recommend that you get a group of friends/family on this adventure. Communication is key and the puzzles are fun! Great for a team building exercise or even birthday outing. No adventure is quite the same. Probably the best escape room in the PNW!",
   "Amazing rooms! The second room, while much harder than their first one, is really well done with a lot of puzzles that everyone can work on - nobody is sitting around (u less they want to... I guess?)!",
   "Top quality puzzles.  Are you an expert?  Ask for the expert version.  You won't be sorry.  11 out of 10, would definitely go again."
  ]
 },
 {
  "name": "Long Lake Park",
  "address": "2790 Carpenter Rd SE, Lacey, WA 98503, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c8966d06-9332-11ea-b6b1-14b31f159f22.png",
  "tags": [
   "free",
   "family",
   "kids",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=16702983560327680477",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great place has free life vests, kayak rentals for a few, and life guards most of the time. But can fill up fast because it is small. Big trun around for large vehicles",
   "The dock is gone but the lake seems more family friendly now that the police have started having more of a presence here.  Last year there were far more people smoking weed and sneaking alcohol around the park.  From what I saw during our recent visit it was much improved.\n\n4 stars because the bathrooms reek like a porta-potty.",
   "Beautiful, safe and fun. There are bathrooms, concessions, police on duty and a lifeguard. Only bummer is there's no dock or anything for the kids to jump off of.",
   "Usually a lot of people when it's nice out but a pretty clean park nice dock on the water front clean bathrooms and nice green grass to sit on in the sun!",
   "First time here. The water is so clean and the view is absolutely stunning. There is a lot of parking and it's free. There is a very large area of lush green grass to throw a towel or picnic blanket down. I like that the water is divided into shallow and deep and the dock is a nice feature for the older kids. Minus one star because there is no sand here, just rocks."
  ]
 },
 {
  "name": "Hope Island Marine State Park",
  "address": "Olympia, WA 98502, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c8da56b6-9332-11ea-a0c5-14b31f159f22.png",
  "tags": [
   "family",
   "hike",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7072876872950307128",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful state park, really fun to paddle out to it. The apple orchard and the deer make it even more fun. I can't wait to bring my whole family out there.",
   "Really nice park, lots of trails and beaches between high tides. Accessible only by boat. Boat masters beware of unmarked large underwater rock at lower tides on the SW corner. Keep your eyes on the depth finder",
   "Amazing park. Quiet.  No electricity, no roads, no running water. Great place to canoe hike around the island and just relax. Pack it in pack it out and enjoy.",
   "A home away from home. Definitely worth seeing the sunset from the island on a clear day.  A great chance to paddle alongside with seals. If you go through in the correct season you can even see whales.",
   "Puget Sound paradise. Hope Island State Park is exclusively open for canoers and kayakers to camp on. My kids and I make it out here in the canoe every year. It's an adventure worth repeating year after year. The thrill of exploring the Sound in a canoe and then exploring the island doesn't get old. This is the preserved beauty of the Puget Sound."
  ]
 },
 {
  "name": "Sequalitchew Creek Trail Head",
  "address": "Sequalitchew Creek Trail, DuPont, WA 98327, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c932d71e-9332-11ea-9a07-14b31f159f22.png",
  "tags": [
   "active",
   "history",
   "walk",
   "walk",
   "field",
   "learn",
   "hike",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14265047178391742780",
  "source": "GoogleMaps",
  "reviews": [
   "Great easy trail going in and out. Can be a bit muddy, especially after rain, so be sure to bring your rough shoes.\nThis trail isn't a loop trail, but rather a hike-in hike-out-the-way-you-came type trail. Once you get to the end however it's great. Great history and a great view of the Puget Sound. Be sure though to stay off the big tracks at the end of the trail that run over the tunnel. These are very very active rails and high speed passenger trains use these tracks so be careful.",
   "Nice walk, maybe takes 20 minutes, perfect length for an afternoon picnic. Love all the train stuff and seeing the trains come by. Nice Pebble Beach to enjoy. Not much shade to be found at the beach. Nice little girl scape not to far from Lakewood, will be my new go to picnic spot.",
   "Short, wide, well worn, partially paved 1.5 mile trail through an evergreen forest, skirting a small creek and ending at the sound. Its fairly busy, you can expect to run into at least 5 or 6 other groups, possibly with on or off leash dogs. Occasionally requires a skip hop over muddy patches. Mostly level, but generally felt like it has a slow decline going out, and the obvious reciprocal incline going back. Good for a 1 to 5 mile run.",
   "Good 3 mile round trip out and back. Pet friendly. Partially paved but mostly unpaved. We did ok with a big tire stroller. The water views are amazing once you get to the end. Minus one star for no clearly accessible public restrooms we could see.",
   "Nice shorter hike, 1.5 miles to the water, just under the bridge, 3 mile round trip total. The path is part hard ball and part gravel but in good condition. The view at the end point is spectacular, and there is plenty of space along the beach there to walk, salvage, or just hang out. City Hall and the police/fire station is at the trail head if you need to use the bathroom or have an emergency. There is plenty of space to park in the field across the street if the lot ends up being full. Overall nice little hike and getting to learn a bit of local history via the signage they put up is a bonus"
  ]
 },
 {
  "name": "Horizon Pointe Park",
  "address": "5700 Ruddell Rd SE, Lacey, WA 98513, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c9895bc6-9332-11ea-9296-14b31f159f22.png",
  "tags": [
   "field",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7821296834778302288",
  "source": "GoogleMaps",
  "reviews": [
   "The park is conveniently located and accessible to the  neighbor community. There's plenty of grass for all kinds of activities.",
   "Small neighbor park with playground and covered picnic area and large grass field. Very pretty.",
   "Big grass area to run around!",
   "It was fun my boys played scorer",
   "Stopped by to check out the national night out thing. Seems kinda fun, lots of small vendors and smells like good food cooking. Will be stopping by again with the family"
  ]
 },
 {
  "name": "La Petite Maison",
  "address": "101 Division St NW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c9d7a310-9332-11ea-ab2d-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=9510779777960468328",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of the best hidden gems on the west coast. It’s literally a husband and wife. The service is amazing, wine list is great, and most of all the food is always great. Get the 5-course meal about $60/person and it will not disappoint. They are very accommodating. It’s fine dining without being pretentious. LOVE THIS PLACE!!",
   "Superb gourmet menu cooked and served perfectly. Chef/owners & servers are AMAZING—they go beyond expectations to make your dining experience exceptional. Go here for special occasions or for a wonderful glass of wine and appetizers. Cater your next special occasion with delicious selection.",
   "Had dinner here with my girlfriends. Everyone was astonished by the meal. It’s been years since I’ve been in, since I don’t live in the area. Absurd. This little gem is one of the best dining experiences in the world, and it’s in little Olympia. The wines by the glass were all beautiful, and we had many.  The service was incredible. I had a filet that was cooked to perfection. Every detail is executed to the fullest potential of the dish. Go here if you know food.",
   "Fantastic from the service to the food to the ambiance. Not a single complaint. Fantastic place for a date night.",
   "We always have an amazing experience. The dishes are delicious and service is with a smile. Thank you and we can hardly wait to be back!"
  ]
 },
 {
  "name": "Cascadia Grill",
  "address": "200 4th Ave W, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ca1ebe5c-9332-11ea-b2aa-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "food",
   "food",
   "music",
   "delicious",
   "affordable",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=13061463427351389189",
  "source": "GoogleMaps",
  "reviews": [
   "Very friendly staff and atmosphere.    Amazing food.   One of my favorite places to eat downtown Olympia.  Great job guys.    Keep it up.  We'll see you again soon.   :)))",
   "Friendly and welcoming environment! the outdoors theme was very fun to look at. The food was absolutely delicious! I enjoyed the southern fried chicken sandwich! And the fries are some of the best I've ever had! Definitely cannot wait to return!",
   "Fantastic service and amazing food. Went on a Tuesday night for a celebration and it was calm with delightful music. The best cheesecake I have tasted in my entire life! If you get anything here get the white chocolate raspberry cheesecake! The only thing I'd change is offering an entire cake of it! Perfect first introduction to this place.",
   "Amazing amazing! A vegan/vegetarian menu and regular menu. So much to choose from. I had the bomb creole fried chicken sandwich and the wife had the vegan version. The chilli cheese fries were sweet. Had vegan carrot cake to top it off. Will come back again",
   "I absolutely love this place, the vibes, the people, the menu, the music, the decor. Just a fantastic restaurant with great, personable service, good options of craft beer and delicious food, amazing desserts, affordable, and more. Conveniently located too! Highly recommend to all living in Oly or even to those passing through."
  ]
 },
 {
  "name": "Dockside Bistro & Wine Bar",
  "address": "501 Columbia St NW Suite B, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ca639124-9332-11ea-aedb-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10235541744689812248",
  "source": "GoogleMaps",
  "reviews": [
   "High Quality Takeout. During the virus restaurant shutdown order, I wanted to have a special dinner with my sweetie but was stymied until I heard Dockside Bistro was doing takeout, and what great takeout it is! I went to the website, looked at the menu and called in an order. The person who took the order was friendly and helpful. When I picked it up I was glad to see I could get it at the window on the boardwalk so did not need to go in. Laurie  greeted us pleasantly. I've been there before and felt good knowing the place is always super clean, and now it's even cleaner. As she brought out the order she cleaned her hands with bleach wipes and even had a clean pen to sign with, which then went in the used pens glass! The food was tasty, healthy, and beautifully presented, not your average takeout. (The fish tacos are awesome.) It wasn't cheap, but it was worth it. We took it home and had our special dinner on the patio. The only downside is that it took her longer than I expected to assemble the food and put together the bill, but, again, it was worth it.",
   "Slightly under seasoned... the duck and the stone crab soup were under seasoned and therefore underwhelming. \n\nHalibut was excellent.  \n\nOverall the meal was good, but not great. Certainly not the 5 star ravings you see on here.",
   "Best food I've ever had in my life. Those tea smoked scallops made me cry. Romantic but comfortable, excellent lighting, thoughtful service. I see you Olympia! We will be back.",
   "Picked-up items from their special menu (during pandemic/social distancing closure) and enjoyed some outstanding Dungeness Crab Chowder, Goat Cheese Salad & Lemongrass Chicken Skewers. While a wee bit pricey, you'd be hard pressed to find \"take out\" of this caliber anywhere else in town. YUM!!",
   "Very nice restaurant with a view of the harbor. Had the Elk which was very good. Parking was easy for the time we were there."
  ]
 },
 {
  "name": "Basilico Ristorante",
  "address": "507 Capitol Way S, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/caa4408a-9332-11ea-8fef-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7155437572213946173",
  "source": "GoogleMaps",
  "reviews": [
   "Little Italy in Olympia! Such a gem in food quality and presentation. Staff went above and beyond to accommodate our large party.  Large gluten-free selection and gluten-free bread for appetizers. Delicious pasta with vegetarian and vegan options available. Highly recommend.",
   "Authentic Italian food and lot of vegetarian and vegan options. Great selection of wine too.",
   "Celebrated our 1 year anniversary dinner at Basilico. Alexis was our server, she was awesome and the food and drinks were suburb.  Will definitely return and try other menu options.",
   "I can't recommend this place highly enough. I have eaten there twice and I have no idea why it hasn't been a lot more. The staff was very friendly. The food was amazing, the tomato bisque was probably the tastiest soup I have ever had. The meals we had were all very delicious and for dessert we had a chocolate mousse that I will be dreaming about for weeks.",
   "We have been to Basilico half a dozen times or more and each time it's been an amazing experience. This time we did the Discover Basilico 4 course experience. We had a full meal for leftovers tomorrow and the food was amazing! It gave us an opportunity to try 3 appetizers, 3 pastas, 2 entrees and 3 desserts. The entire experience was so amazing and the food was fabulous!! My husband ordered his favorite and he wasn't disappointed! This is the best Italian restaurant I'm WA state. My husband is Italian and he loves this place."
  ]
 },
 {
  "name": "Budd Bay Cafe",
  "address": "525 Columbia St NW, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cae8ea9e-9332-11ea-8dc0-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11513944704215179325",
  "source": "GoogleMaps",
  "reviews": [
   "One can see why this place is highly regarded by the locals. Hospitality is above all among the best. From hostess to server. . . the attention to our meal' s enjoyment was obviously important. Relaxing marina view ⛵ in the twilight hour along with good mix of music 🎶 genre playing in the background made for an enjoyable meal. \n          Costs are as expected of a marina location $$$ although not upscale since linen was napkin only no t-cloth. Bread/rolls was actually a part of the meal no extra charge ... wow that's old school classy. Food flavors were acceptable but nothing that stands out as different or original. However, each plate and appetizer ordered was served hot rather than just warm... meaning wait staff was on point. Lots of cheery folks warranting a return visit.",
   "We went to celebrate my fiance's birthday.  We had one of the best nights we've had in quite a while.  Everything from the appetizers to dessert was amazing.  We started during happy hour and the prices were very fair.  The food came out very fast and our server Trina was amazing",
   "I was in the area and i happen to google king crab eating. \nWell, this restaurant popped up, and after an hr or two spent on just  online researching and reading reviews overall on restaurants , seafood restaurant.\nI decide to go with this one. Very good food. Half a pound of king crab,  wanted to try the Dungeness crab .  They only had it served with salad. Or like a cocktail . Very good clam chowder and delicious oysters shots.\nAll and all, pretty good.\n\nBut now I'm going to the red wing casino for their buffet!",
   "FABULOUS dinner and awesome wait staff, Julia. A real sweetheart. Very thoughtful and caring. I was celebrating my birthday with a friend but I was pretty uncomfortable after a medical procedure earlier in the afternoon. She even brought me ice in a bag to alleviate some pain. Thank you.",
   "This place was so good we ate here back to back. ONE thing to note. SKIP The “jumbo shrimp cocktail” for $10 - they are not jumbo at all. Your better off ordering the shrimp scampi, as it’s like $16, you get way more food and the shrimp were the same size if not bigger. \nSo delicious. The blackened salmon was amazing. Loaded baked potato. Yum!  Bread to start. Friendly service. Great dinner."
  ]
 },
 {
  "name": "Gardner's Seafood & Pasta",
  "address": "111 Thurston Ave NW, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cb3b2980-9332-11ea-93e6-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12760696654341127521",
  "source": "GoogleMaps",
  "reviews": [
   "Thank you for such a wonderful experience. Food- phenomenal. Service- wow you ladies are amazing! We found the perfect bottle of wine on the wine rack up front so I recommend checking if you are a wine person :) Perfect lighting. Perfect music. Perfect.... Everything. I reserved a month in advance for Valentine's day and all that was available was 8pm. Regardless of what was surely a long night for everyone we were treated like the first customers of the night. Seating was right on time. We didn't feel rushed at all and we enjoyed a truly exceptional dinner. Kudos, Gardner's, you clearly have this figured out!",
   "Great ambiance,food and service.  Very romantic but comfortable atmosphere. We went for our anniversary dinner and they sent a candle with the dessert we ordered along with a card signed by the staff💗",
   "Fantastic meal! \n We haven't been here for a number of years so we decided to give them a shot... great choice! The ambience was lovely, the service was attentive but not overbearing and the food was terrific! We had the charcuterie appetizer which was a lovely mix of meat, cheese, fruit and veggies served with soft, warm pita triangles just slightly browned. Plentiful but not so much that it spoiled our appetite for our entrees. \n My wife had the pasta special, ravioli with Italian sausage and a ricotta/ goat cheese filling in a nice light but bright tomato sauce,  delightful. I had the scallop special and it was wonderful, four plump, perfectly prepared jumbo scallops served over a sweet potato puree that was really well done.  Dessert was a shared (huge) piece of dark chocolate layer cake with cream cheese frosting..yum!\n Thanks for seating us after a short wait without a reservation, we were lucky they were quite busy. I strongly recommend calling ahead and ensuring your spot here!",
   "Great staff, service, and food. Never disappoints. Made me sorry that I ruined my palate with a cocktail before dinner (rough week). Felt much better after a great evening with wonderful food and a relaxed atmosphere.",
   "We had an amazing Anniversary dinner here. Excellent service, exceptional food, lovely atmosphere. Recommend highly!"
  ]
 },
 {
  "name": "Anthony's Homeport Olympia",
  "address": "704 Columbia St NW, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cb81f6d0-9332-11ea-841d-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "drink",
   "food",
   "food",
   "cheap",
   "tasting",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=358017570694608466",
  "source": "GoogleMaps",
  "reviews": [
   "We brought our small school group and got treated to a great window table with a view of the Capitol dome. Our server Jose was professional, efficient and warm. The bread was delicious. We ate from the 3 for $25 menu and were pleasantly surprised by flavor and portion size. My students loved the lemonade. The calamari was a hit. The smoked.salmon dip comes with apple slices and was recommended. Ahi nachos were delightful. The Caesar salad was crisp and refreshing. I had a med rare sirloin and it melted in my mouth. Will definitely be back again.",
   "Delicious food, delightful drinks and a great waitress equals a wonderful night out! The roasted pear drink was fantastic and the Bailey's mousse was very tasty as well. You can't go wrong at Anthony's!",
   "Beautiful location, nice ambience and staff but those cannot make up of the lack of flavors in food. Everything we ordered was bland. Pan fried oysters, seafood fettuccini, steak.",
   "I couldn't believe how perfect it all was! The mellow water view, the literally PERFECT service, and the just-as-perfect food made it one of my best dining experiences in years! We traded bites and - except for the vegetarian not tasting the hamburger - had to just share it all, because we all wanted everything. I can't say enough about how amazing it was! It's not cheap - we spent $40 apiece - but we had an experience of perfection we'll remember for years...",
   "The complimentary bread was great.\nThe Wasabi sauce on the ahi nacho was delicious\nThe four course steak was charred on the outside with little to no flavor\nThe award winning clam chowder wasn't flavourful, it makes me wonder what year was the award given? \nService was mediocre, after the entree, the server didn't come to ask about our choice of dessert\nThe floor was wet with no \"wet floor\" sign"
  ]
 },
 {
  "name": "Pizzeria La Gitana - Olympia",
  "address": "518 Capitol Way S, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cbda52f4-9332-11ea-802e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "music",
   "family",
   "food",
   "delicious",
   "delicious",
   "food",
   "delicious",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=9185226193166221238",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent service, the owner is so kind and generous. We can’t wait to go back for the live music and delicious food! My pizza tasted like it did when we visited Italy. You can over indulge in this pizza without getting a stomach ache because of the natural ingredients. My new favorite restaurant!",
   "Our family of 3 enjoyed the food and atmosphere.  The service was a little off as we had to flag down servers for water, refills, and a kid color sheet that was mentioned/promised to our kiddo.  Pizza was our very quickly once we were able to place our order.  It was tasty and crust was thin (if that’s you’re preference).  We had a kid-friendly pepperoni and ham but there were lots of other fun options on the menu. Price was reasonable.  Atmosphere was very nice.  Street parking, only.",
   "My favorite place in Olympia, Tumwater, Lacey area. The staff is welcoming, friendly, and helpful. The pizza is fresh, hot, and delicious. The wine is poured generously and the ambiance is set effortlessly.  The owner and employees have successfully brought a piece of Italy to the streets of Olympia, WA. This is my home away from home.",
   "We went here for Valentines dinner.  We have been here a few times before and our visits have always been 4-5 stars.  They make delicious pizzas, salads, and pastas using organic food. They also offer many things that are not very common, like organic mushrooms, truffle oil, and delicious blue cheese.  This time we had a very nice antipasto board.  As usual, the management or owner is present and conversing with the customers. One negative, is their price seems to be rising rather quickly.  I realize their food is of a very fine quality, but their prices are what we would consider to be high for the area.  For the two of us, which included two wine glasses, a half antipasto board, two main pasta dishes, and a take out dish... Was almost $120.  This is high quality food, but I hope La Gitana doesnt price themselves out of business.",
   "I have missed Italian pizza since I was in Italy. Eating here is the closest I can get and it is incredible! The staff are friendly, the owners are great and the food delicious. I love their pizzas, the salad and just tried their pasta which was equally impressive. The environment is lovely and on some days they have live music which just adds to the overall feel!"
  ]
 },
 {
  "name": "Iron Rabbit Restaurant & Bar",
  "address": "2103 Harrison Ave NW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cc2e6ba4-9332-11ea-bdea-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=1306967486365099268",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food and wonderful service! The food was all top notch and generous portions! We all had something different so we could try more things and it was all fantastic. And try, if you can, to save room for the bread pudding!",
   "Two words delicious and accommodating. We have serious allergies in my family so finding restaurants can be difficult. So after reading a few good yelp reviews we decided to cross our Fingers and see what the Iron Rabbit had to offer. Right off the bat we were able to talk to the manager about allergies and it all worked out. Everything was handled with care and the results were delicious. My two recommendations are the drunken sailor and the chicken cordon who. Not only was the food great but also the building was nice too. It had a quaint hometown feel and had clean bathrooms. I would definitely recommend stopping by.",
   "I was on my way out of town and wanted to splurge on dinner so I decided to go here since it was in my list of restaurants to visit. I figured it would be a bit pricey since they don't have prices listed on the menu on their website. \n\nOverall the prices weren't too bad. I got the buffalo cauliflower to start with and it was amazing!!  Spicy and sweet with delicious chunky blue cheese dressing on the side. \n\nFor my main course I opted to get the Wagyu Top steak instead of a burger but I wish I hadn't. For $32.00 it was very disappointing. It didn't have much flavor, was really dry and also over cooked. I asked for medium, hoping for some pink, but it was more medium well to well.  \n\nMy service was good, the guy who took care of me was friendly and attentive but after he dropped off the steak he never came back to ask how it was or else I would have told him it was too dry and over cooked. In the end I just checked it up to being part of the adventure of exploring new restaurants while on vacation.  I will add that thw mashed potatoes were really good too!",
   "I had the seafood linguine & my wife had the drunken sailor.  Both excellent meals.  Why the 3 stars?  The deserts were horrible.  I had the bread pudding.  The back side had a burnt taste & the rest was too stiff & not \"pudding \" at all.  My wife had the chocolate raspberry cheesecake.  All raspberry, including seeds, with chocolate syrup spread around as garnish.  She was so disappointed.  We both had coffee & for $4.25 per, it was sad for coffee.  We'd go back for the entrees only if we were really in the mood.  Recommend skip their dessert & coffee.  Expensive mistake.",
   "The service is very good. Very friendly staff. Good for family's or alone. They have a fantastic homemade ginger ale and root beer that was very tasty. I had the unbeatable burger and the comdoments were very tasty. The vegetarian beet burger was dry and underwhelming. My companion had the fish and chips and they said it was serviceable. I'd go back for the drinks."
  ]
 },
 {
  "name": "Mediterranean Breeze",
  "address": "2302 Harrison Ave NW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cc74eac8-9332-11ea-989f-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "delicious",
   "family",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7176856521737331638",
  "source": "GoogleMaps",
  "reviews": [
   "Had a great experience, every item ordered was flavorful and fresh. While being served by friendly and attentive wait staff. The decor is tasteful and the seating  arrangement is comfortable and spacious. So with all these positives you do pay a price for a great eating experience, but well worth the treat to your taste buds.",
   "This is one of the best meals I’ve ever had and I love a wide spectrum of cuisines. This is authentic Turkish cuisine made from scratch! Lezzetli!Fantastic and knowledgeable service, amazingly tasty food, imported drinks from Turkey, clean and cultured restaurant. I cannot compliment it enough. And while it may come off as pricy, the generous portions are well worth the value. Highly recommend!",
   "My husband and I came here for the first time tonight. This restaurant is quite the treasure in Olympia. Food was absolutely delicious! Atmosphere was very pleasant and service was outstanding. I love the fact this place is family run, you can tell there is a pride in ownership by the quality of the food. Can't wait to come back and try something new!",
   "Wow, the meal was amazing! We had no idea what to expect, from a price or quality standpoint. Fair warning- Specials can be a bit pricey ($30-$35 )for the Olympia area but entrees ran a little lower cost. \nEverything we had was delicious. I had a sampler of 3 kinds of meat and it was fantastic. There were no leftovers. My wife had a more standard dish that utilized a sauce that came with mine; Iskender something.\nDecor is as expected, Turkish themed but not overbearing. The room is very spacious and the layout looked like it could accommodate larger groups as well.",
   "Nice presentation,service was less than acceptable.  Server disappeared and we never got refills of our coffee or tea and had to ask another waiter if we could have our bill. However the food was good and the one Turkish  coffee I received and the one Turkish tea my friend received was amazing, wish we could have ordered more."
  ]
 },
 {
  "name": "Waterstreet Cafe",
  "address": "610 Water St SW, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ccc1f976-9332-11ea-956e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=5548352494423082973",
  "source": "GoogleMaps",
  "reviews": [
   "It had been a long time since I'd gone to Waterstreet Cafe.  The atmosphere is very nice though on a Saturday night very loud.  If you want a quiet evening conversation during peak hours this would not be the place for you. .We chose three small plates to share, and aside from the food being delicious, I felt the portions were generous.  We also chose two of their specialty cocktails, and both were very good and well presented.  I would definitely recommend Waterstreet Cafe.  I have never been disappointed.",
   "Brought a cousin from out of town and she adored the outdoor seating and the quality of the food.",
   "I had a hard time finding a parking spot so from the get go it was wonky. The trees were covering their sign out front so I didn't immediately spot them. I ordered the antipasti, it was good but the calamari my friend ordered was way over salted and the waitress forgot my other friends salad. The waitress was spilling the water every time she refilled my cup and didn't bother to clean it up, she just walked away. Needless to say I was very unimpressed with my experience. There's many other restaurants within walking distance from them that have good service and incredible food.",
   "I ate the best salmon soup I ever tried! And the sandwiches are great! Totally recommend!",
   "Great little hidden away restaurant. Wonderful location, close to everything in downtown Olympia. With interesting varieties to choose from. Parking can be a chore though."
  ]
 },
 {
  "name": "Anthony's Hearthfire Grill Olympia",
  "address": "1675 Marine Dr NE, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cd0df6d8-9332-11ea-a6ad-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "drink",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16624453464118905311",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food and matching customer service. We went in a group of 6, and were expecting more people to come. The staff was very understanding and accommodating. The other didn't turn up but we were served with utmost courtesy. They even custom made a dish for he vegetarian member of our group without any issue. Highly recommended. The setting is beautiful with great views.",
   "Been here several times, and wanted to ackowledge the fantastic service and food being prepared by this place! The birthday dinner that I had with my friends. I had seen a menu item on line, but the menu on the table didn't have that particular item.  The manager came out and said they certainly could make the item I had requested, and I said at what price? She answered at the same price.  I was very impressed.  The meal was outstanding!  Then to top it off, she asked if I would like a complimentary desert for my celebration! I told her I was full but would love a chocolate martini!  She brought it over with a smile, and at no charge!!! This was by far the best service I have ever had in my life.  I am a senior, and wish I could give more stars.",
   "Amazing food and drink options. Love their sunset dinners. Happy hour is always a great time. Gets busy so call in advance for your expected rush times.",
   "Nice place right on the water (during high tide).  Lots of window seating to watch Hooded Mergansers, Buffleheads, various seagulls and...a rainbow!  I think the rainbow was a unique addition, but...it was unique!  Good food.  Went during the \"lunch\" menu so it was perfect for smaller eaters. I had the salmon and she had the roasted chicken (roasted on the spit) salad.  I wouldn't say the ambience is \"cozy\" but it's very nice and on clear days you can see the Olympic Mts.\n\nAs someone else said it's a nice place to take guests.\n\nEven got to watch a Dragon Boat crew work out!",
   "We really enjoyed the shrimp and steaks. The glaze on the steaks was awesome. Service and the staff was wonderful. Thank you for a very nice Valentine's Day dinner."
  ]
 },
 {
  "name": "Chelsea Farms Oyster Bar",
  "address": "222 Capitol Way N, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cd58466c-9332-11ea-a3c6-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "food",
   "eat",
   "delicious",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13838032258576994844",
  "source": "GoogleMaps",
  "reviews": [
   "What a great experience, we have been wanting to try this place for a little while now. Glad we did today, excellent service very prompt and friendly. And the oysters were so flavorful and fresh. Also a must have is the clam chowder and steamer clams.I highly recommend everyone try this place. More then just seafood as well here.",
   "Our visit was a nice lunch. We tried the shucker special which allowed us to try a dozen oysters. The oysters were amazing each pair  was a different experience.My wife had a lavender drop which she loved so much she had two! I tried a beer called black mountain it was delicious. For our entrees we had the shrimp and grits and the Mac and cheese with added crab. The only thing we would change was the cold crab on top of the mac and cheese outside of that this place was great! The restaurant was beautiful and the staff was very attentive. We will definitely be back to try the brunch and dinner menus. Thank you for a wonderful lunch!",
   "Came in tonight with my friend looking for some good baked oysters. Ended up being completely amazed by both the quality of the food and the incredible service! Lauren was super knowledgeable about the entire menu and extremely friendly.  All in all an incredible experience! Would definitely  recommend and will for sure be returning.",
   "Every time I come to this restaurant, I'm filled with so much joy because I know that I'm in for an absolute treat. With the new opening of their extended restaurant area, I love sitting at the bar and watching them shuck the oysters and create beautiful plates full of yummy treats. Even my husband, who isn't huge on seafood, finds yummy things to eat here.",
   "Delicious food and cocktails, reasonably priced - in a modern, light, sophisticated space.  We ordered every oyster on the menu (about 10 varieties listed with origin & tasting notes).  We were in shellfish heaven.  Look for their daily happy hour - called something like \"Shucker's Call\" for $3 oysters.\nThen came their fabulous clam chowder.  This is a more modern, light take on chowder. Not too heavy on the cream with the freshest clams, pork belly and potatoes.  Soul satisfying.\nThe airy space has large windows, with gray & white decor, mostly spare with a touch of whimsy.\nParking is easy - there is an adjacent parking lot for the entire complex and ample street spaces."
  ]
 },
 {
  "name": "Tugboat Annie's",
  "address": "2100 W Bay Dr NW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cda54d5c-9332-11ea-b853-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14504186467129292003",
  "source": "GoogleMaps",
  "reviews": [
   "Great views and delicious food!  Was recently here for a computer gaming event and had breakfasts both days!   \n\nCountry Fried Steak with Eggs and the Biscuits and Gravy.  \n\nGood flavor 👌 Just wish they had hash browns! 😁\n\nOn the nightside of the things, I ordered an adult Almond Joy shake.   It was tasty, just wished it had a little more punch to it.  😉\n\nLove coming here and looking forward to visiting again!",
   "Been coming here for years with a LAN renting the downstairs and sometimes on our own. Every time the drinks, food, and service have been exemplary. Breakfast, the clam chowder, everything is awesome. You can't beat the view and you owe it to yourself to visit, especially since it's a little off the beaten path (a big plus).\nGet some friends together and come to have some fun and maybe even try the Barge Burger. The biggest burger you've ever seen!",
   "Great views.  Good food.  Humble & Casual.  Amazing location to take a little break from it all.  Attentive folks and some innovative takes on classic American fare.  Honestly, one of my wife's favorite places here in the Olympia area.",
   "Hubby and I went to lunch at Tugboat Annie's! Was delicious! The crab and artichoke dip appetizer was yummy! I loved my shrimp and chips, and hubby  enjoyed his clam and chips basket! The service was the Best! Can't wait to go again. We will make it one of our favorite spots! I look forward to seeing what the harbor looks like at night! What a cool place!🐋🐚🐳",
   "Great place for a meal! The food was yummy and well priced.  They have a kids meal and my son had the grilled cheese.  I had the shrimp and my husband had the pulled pork, both were great.  Server was very friendly.  Super busy at dinner time but had plenty of parking and lots of tables/seating.  They have option to sit outside as well.  Great views all around the outside of the restaurant."
  ]
 },
 {
  "name": "Old School Pizzeria",
  "address": "108 Franklin St NE, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cdeda170-9332-11ea-b001-14b31f159f22.png",
  "tags": [
   "music",
   "food",
   "music",
   "family"
  ],
  "link": "https://maps.google.com/?cid=149374507855854686",
  "source": "GoogleMaps",
  "reviews": [
   "Old school is classic Olympia pizza eats. Buy by the slice or whole pizzas. Lots of fun decor on the walls. Sometimes nice staff sometimes a bit on the cold side, but it doesn't alter my experience. I love their pizza, they're one of the best in town.",
   "It's the best NYC style pizza in Olympia. Real thin crust, nice stretchy cheese and a good flavor to the sauce without being overpowering. If you like the sauce a bit more punchy, you can add parmesan, oregano, and red peppers. I find it perfect, maybe just a little shy in sauce flavor. It's not burned, but it gets a good char in a few spots like you see in my pics. The atmosphere is, well, old school. They nailed it perfectly, even down to the rad old school video games. If you're in your 40's and 50's, you'll probably love the place and feel at home. I love it. The music is loud, so this isn't the joint for a business meeting or romantic evening alone.",
   "This place is a breath of fresh air. I feel like a kid again. Endless drinks. Food is great. I had 2 slices of pepperoni. Lots of attention to detail. This place is a must visit!",
   "My childhood all in one bite. Use to go to this place all the time growing up in Olympia. Very happy to come back 10 years later and see it still up and doing well!! Serving out the best pizza like I remember back as a kid! Try their thick slice pizzas it was so yummy. \nJust came up from Portland on my way to Seattle and we had to stop for pizza. And I think I am going to have to stop again on the back home! My fave pizza place! Love the 80's vibe its got with rock and roll posters and old writing all over the walls. Cool music playing. Great vibes all around.",
   "I went 3 years ago when my son and his family lived there. They recommended it and I was not disappointed. Very tasty pizza and great selection of local beers. Cool and quirky place that I would definitely go back to next time I'm in the area."
  ]
 },
 {
  "name": "Lemon Grass Restaurant",
  "address": "212 4th Ave W, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ce418ddc-9332-11ea-8f32-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "tour",
   "eat",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=4203121760292307057",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome food made fresh. Friendly staff. Clean bathrooms.",
   "Excellent food and great service! Staff were very friendly and helpful! Nice atmosphere and tasty food! Prices are reasonable! I love and recommend  their Chinese Sausage Fried Rice!",
   "Straight-up, delicious meal! Fresh vegetables, quality meats, delectable sauces! MmmMmm...\n\nGlad we stopped here on our tour thru Olympia. 😁",
   "Outstanding, large menu. Extensive vegetarian options. Great cooking. Great staff. Tasteful decor and atmosphere. They have different options for how spicy you want it. The portions, however, were way too large. To-go boxes were necessary for everyone and it encouraged me to eat way too much all at once. I definitely will come back to try more.",
   "So incredibly delicious! Plus they can customize any dish, do half orders, customize your spice level etc. I ordered the Singapore noodle and it was SO good! Will definitely order it again and again."
  ]
 },
 {
  "name": "Vic's Pizzeria Wildwood",
  "address": "2822 Capitol Blvd SE, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ce8797a6-9332-11ea-846e-14b31f159f22.png",
  "tags": [
   "family",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=1888627346273258231",
  "source": "GoogleMaps",
  "reviews": [
   "Atmosphere was good. Pizza was pretty decent, not the best but pretty decent. Ordered two 18 inch pies and they came VERY slow. Customer service was not great either. They offered plates but never brought them, I had to go get them. I had to ask for a pitcher of water it was not offered and then I had to ask for ice as well. I would recommend ordering before arriving or calling for to go.",
   "The pizza is very tasty and they have a good selection of beer and cider.  The employees are very nice and efficient.  I will definitely be returning.",
   "Pizza tasted like pumpkin. I thought I was eating a Thanksgiving meal. Loads of cheese, big flop... Overall 4.7 out of 10. \n80% of the pie wound up in the trash",
   "Amazing as always!\nFriendliest staff and great family environment! Slices for a quick bite or full pizzas made to order... and the vegan pizza is by far the best around! \nLove this place!",
   "Amazing pizza & beer (including ciders) on tap. Revived our love of this place when my husband and I started eating vegan! Always delicious and so friendly."
  ]
 },
 {
  "name": "Mercato Ristorante",
  "address": "111 Market St NE, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ced0fd40-9332-11ea-b427-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=6699253718590460418",
  "source": "GoogleMaps",
  "reviews": [
   "Mercato is a casual restaurant with good food and decent wines. The staff are outgoing and accommodating. The food and service is very consistent.\nThe best value is the Kitchen Dinner served Sunday through Thursday 5 to close for $25. It's a 3 course meal with a good variety of choices for appetizers, entrees and dessert. \nHappy hour is 3 to 5 daily. \nI have personally had the pork tenderloin, the ravioli, the penne, and the the tagliatelle and all were excellent. The pear and Gorgonzola salad is very good.",
   "Went here during lunch around 2pm.  Sat outside on their spacious patio with umbrellas it was very nice. Check in with host to be seated outside. Service was perfect, prompt, professional and knowledgable.  They also have happy hour from 3 to 5 every day. We will be back to try the kitchen dinner 3 course meal.",
   "Never a bad meal at this unique Italian restaurant. If you can wiggle your way into Skylar's section, he will make your experience even better. These people provide excellent food while doing it with panache!",
   "My go-to restaurant. Great appetizers, entrees, pasta, pizza and of course desserts. Outdoor patio when it's warm outside, lots of free parking. Love this place!",
   "I’ve been here for quite a few team dinners. I like their cocktail options. It’s just that they have very limited vegetarian options. It’d be great if they can accommodate that in their menu."
  ]
 },
 {
  "name": "Dirty Dave's Pizza Parlor",
  "address": "3939 Martin Way E, Olympia, WA 98506, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cf1706cc-9332-11ea-b6fb-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "free",
   "affordable",
   "delicious",
   "food",
   "delicious",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3853128494219406715",
  "source": "GoogleMaps",
  "reviews": [
   "The images shows how delicious the pizza smelled when it was delivered to our table. It was half gone by the time I could take the shot.\nWe had a great time with only two pieces left.\nWhen I asked for foil for the two pieces, the server asked if it was going to be a late night snack. I told him that I'm a homeless advocate and the leftover was going to a man who has eaten virtually nothing but ramen for the last week.\nB4 we left, the server gave us a \"mistake\" to add to the food we were handing out.\nSo instead of feeding one, we feed three.",
   "Dirty Dave's is a genuine old-time pizza parlor, where you can find affordable pizza, beer, sandwiches, pasta.   Atmosphere is comfy and casual.\nA great spot for a quiet private party!\n\nParking is ample and free.",
   "The best pizza place in the area, by far. The classic pizzas use a thin crust, melty cheese, offer numerous toppings (including cashews), and are always delicious. The \"3D pizza\" is a pseudo Chicago Style pizza that really lives up to being a \"Pizza Pie\".\n\nThey do offer other food, such as pasta, but I've never wanted to get anything but their pizza.",
   "Get the family deluxe pasta bowl.  Huge portion as you can see for yourself.    Pizza is also delicious.",
   "Staple of Olympia.  Best pizza around in my opinion!! Sandwiches (The Jake) amazing. Salad bar, best around! Employee's are great and great family spot."
  ]
 },
 {
  "name": "Rush In Alaskan Dumplings",
  "address": "205 4th Ave E, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cf630714-9332-11ea-995d-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7451995105127019242",
  "source": "GoogleMaps",
  "reviews": [
   "Came here for the happy hour and was not disappointed. We had a beer and dozen dumplings. The beer was Alaskan Amber, so they don’t skimp on the promo. The dumplings we had were the Buffalo and Classic. They were both delicious with tons of flavor. The dumpling dough is thicker than other dumplings, but that wasn’t an issue. The sauces/broths were amazing, but we wish there was more bread served to soak it up! \n\nOverall, this is a great stop in downtown Oly that deserves your business. The gentleman who took our order was super nice and very attentive. He was the cook, cashier, and I’m sure everything else. Kudos to him!",
   "Took my daughter for dinner. The menu looks big on the board but it's really not. I like the simplicity. They could have a few more side choices. Didn't get one this time. We ordered the 18 dumpling option. The cook/one man show let me split it so we got two choices of filling. Daughter picked cheese and potato and I picked pork and beef. We both picked the loaded option for our toppings. I tried a couple dipping sauces. The garlic was too bitter (I love garlic). The Sriracha dip was better. Very filling for a great price. Seating is limited to about six or eight tables. Some are for two people. I'll go back.",
   "-Okay first off, so delicious. Everything. Every combination, everything. Yum yum! \n-Second, they'll mix and match fillings for you. It's like a surprise with every bite. Woohoo!!! \n-Third, such good service! The guy behind the counter is so polite, brings you food and drinks, and really appears to care about your experience. And his accent was beautiful.\n-Last but not least - the upstairs is delightfully warm and cozily lit. Which is fantastic in winter when you want to melt into a chair with your bowl of warm and cozy dumplings. \nEAT HERE!!!!",
   "This place was amazing! Such a cute and cozy place for starters. The food was also really, really good. Good portions for the price and the dumplings were tender and flavorful. I had the loaded chicken dumplings and it had just the right amount of sweet and savory. Definitely one of my favorite spots to go to now!",
   "This place is incredible! First, the owner is so kind and warm. Second, we ordered two rounds of food because it was so heavenly. We ended up getting the classic dumplings with pork and beef, the buffalo with chicken, and the Alaskan as a mix of everything. This is the perfect local spot to have an incredible experience!"
  ]
 },
 {
  "name": "Wayside Cafe and Deli",
  "address": "609 Capitol Way S, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cfa6f2c2-9332-11ea-828a-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "comforting",
   "tasting",
   "food",
   "delicious",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1831346973521255568",
  "source": "GoogleMaps",
  "reviews": [
   "Quaint and cozy location with delicious plant based meals. Plenty of different varieties from sandwich’s to bowls. From simple to complex something for everyone to enjoy. Local brews and kombucha available. Small made house desert options too.",
   "I love so many of their dishes. I could go on and on. My super favorite is their Cajun Chicken sandwich with a gluten free bun. So many gluten free choices like swapping their gravy with  cheese sauce on top of your mash potatoes and Mac and cheese!! Thank you Way side for making vegan gluten free available and deliciously fantastic!",
   "Fantastic tasting food, and i can't wait to go back to try more. I got the rib plate and all the sides were great. They were out of the mashed potatoes so i did the house slaw instead.  It was rather noisy from a fan but other than that it was a good experience, and it was very comforting not having to ask to make changes to the menu just to keep it plant based/vegan.",
   "Yum! Tried the rib plate, and it was delicious, and worth the wait. The portion size was good because I was pretty full after eating. I'm not vegan myself, but I like trying vegan dishes when I feel like it. Of course I wasn't expecting the texture to be the same as a real rib, but it was yummy nonetheless. I'd say maybe more salt in the mac n cheese, but perhaps I just like salt too much. Lol. I'll be back for the sweets and \"wings\".",
   "The almost famous bowl was delicious and exactly what I was looking for. My family isn't vegan but thoroughly enjoyed everything we had. The staffed was nice and extremely helpful. Our food came out very quickly after we ordered. The only thing I may not order again was the potato bites . The Mac and cheese was phenomenal 👌"
  ]
 },
 {
  "name": "Arepa Latin Street Food",
  "address": "728 4th Ave E, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cff86e4a-9332-11ea-ac20-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14753422760283390805",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food, carne arepa was great and really loved the tostones. It was very filling and it priced just right...",
   "I spent several years of my youth living in Venezuela in the late 70's.  I miss that food and Arepa gives me a bit of a taste of it, without having to risk my life going to Venezuela current day.  Cant say it is as good as when I was a kid, but my tastebuds today are much more profound than they were 40 years ago... Arepa is good, give it a shot.",
   "Food here was amazing, fresh, and very fast (though to be honest there was only one order ahead of me). Did the moderna puerco, very very tasty, pork was perfect. completely satisfied and the price was reasonable. If I lived in Olympia I would definitely be back at least once a week.",
   "I can’t believe I’m just discovering this food truck. I’m in love with their food. Escpically having a choice of sale or burrito for my favorite flavor. Portions are generous",
   "Carne arepa was good. The bread could have been a little more toasty in my opinion, but it was good regardless. Costs $8 but does have a lot of meat inside. Tasted like carnitas, which I love. The fried plantains were good too."
  ]
 },
 {
  "name": "Brewery City Pizza Lacey",
  "address": "4353 Martin Way E, Olympia, WA 98516, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d03f4fd8-9332-11ea-8eea-14b31f159f22.png",
  "tags": [
   "food",
   "brewery",
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7449722830393944196",
  "source": "GoogleMaps",
  "reviews": [
   "Very glad to have found this place. The pizza is really good. Hard to find a good pepperoni pizza in this town. Fair price and best I've found since they took one of my favorites away.. Will be returning for more..",
   "Great place to go out to dinner. From the amazing and friendly staff to the equally amazing food, you can't go wrong. I highly recommend the Athenian and Brewery City pizza. The Brewzer calzone was also a clear winner tonight.",
   "Cauliflower crust pizza was delicious!! I got the meat one with extra cheese and extra sauce and it was amazing!  Also i was hesitant to order the medium because i was going to share with coworkers but it fed 6 people",
   "Had it delivered.  $23.00 for a “medium” pizza!   It was supposed to be a large for $17.00.   We ordered half with onions, pineapple, and mushrooms, and the other half with just onions and pineapple (no mushrooms) they charged us twice for the pineapple ($5.00 total) and twice for the onions ($2.00 total) almost eight bucks for some skimpy toppings.  overall a ho-hum pizza. And If that’s their medium, I’d hate to see a small. Never again",
   "Just discovered this beautiful gem in lacey.   Our experience was awesome.  One of the best cesar salads i ever had.  Very reasonably priced.    The pida bread that was served with my tomato basil soup was delicious.    I will definitely be coming to try their giant pizzas.   Our calzone was to die for.    Great job guys.    We will see you again soon.    Oh they have Happy hour also.   Take advantage of it.   Just awesome guys."
  ]
 },
 {
  "name": "Martin Way Diner",
  "address": "2423 4th Ave E, Olympia, WA 98506, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d08a8b4a-9332-11ea-94bb-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "eat",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15187941862454365755",
  "source": "GoogleMaps",
  "reviews": [
   "Great locally-owned small greasy spoon diner.  Breakfast all day and open til 9pm. Friendly, casual staff. Lots of scratch tickets too, if you're into that! Great for kids.  Probably a good idea to call ahead if you have a large party.",
   "I had the All-American Breakfast and I was very surprised at the large portions of food that came out for the price. All the food was great and I left with a stuffed belly. The staff was also very friendly and helpful. Great spot local for Sunday brunch!",
   "It is always friendly with good service.  Popular place especially with many of the local seniors.  Has good music playing in the background but not so loud that you and everyone else in the restaurant have to talk extra loud to carry on a conversation with each other. Had the fish and chips.  The fish was crispy and well done.  The fries were good but nothing to write home about.  The coleslaw was a bit on the warm side on being served and wasn't very flavorful.  It was warm enough I was dubious about eating it so after a couple bites I figured better safe than sorry so didn't eat it.  Overall all was good and would certainly go again.",
   "Busy with locals. Menu was hard to order from. I wanted something fresh and it had a canned feel to it. Too landlocked to order seafood. Only had breakfast but not on my list to try again. Cinnamon roll french toast was great.",
   "I loved this place, the burger I got was amazing and cooked perfect. If your looking to support a local business this is definitely a place to go. Great food and fast service."
  ]
 },
 {
  "name": "Fujiyama Japanese Steakhouse",
  "address": "2930 Capital Mall Dr SW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d0d5640a-9332-11ea-8511-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15341356666407241646",
  "source": "GoogleMaps",
  "reviews": [
   "It doesn't matter if you make reservations, if it's not a big enough party to fill a whole table you will end up waiting. The cook we had was really funny and a great showman. The food was perfectly cooked, we had chicken, steak, shrimp and the lobster, which was not really fishy. Had one of the house mixed drinks which I would say was blah, stick with beer or wine. Would return.",
   "Best birthday experience! Uncle BJ is amazing!! Cant wait to come back. Best atmosphere, amazing food and the an unbelievable chef!",
   "This rating has nothing to do with the cook who prepared our food. He was great, we even left him a nice tip. Unfortunately we won't be back because the hostess was so rude. We literally almost walked out because of her attitude. I understand it was Sunday and they were busy. We did have a reservation and we were sat 30 minutes after our reservation time. Still no big deal but the way she interacted with not only us, but everyone else was uncalled for. I even smiled at her twice. She literally rolled her eyes lol. Obviously she doesn't know how to manage a floor or reservations and shouldn't be working with people. My family had another reservation for 2 weeks from today and we've just cancelled it. The bathroom smells horrible too.",
   "We had a great time. Food was good and the chef was very entertaining.",
   "Great food and entertaining cook. The fried rice is tasty and you get a large portion. You can't miss on anything on the menu. You should leave very full. A little pricey but well worth it."
  ]
 },
 {
  "name": "Sushi House",
  "address": "2000 Black Lake Blvd SW, Olympia, WA 98512, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d11a0e7e-9332-11ea-9e43-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2253419363891928265",
  "source": "GoogleMaps",
  "reviews": [
   "I came here cause our usual sushi place was closed early. Best decision ever! This is about the best sushi I've ever had. Plating is beautiful, good quality food, impeccable service, great atmosphere. All around a fabulous experience. If you like sushi or Japanese style food, come here.",
   "My absolute favorite sushi restaurant. I used to live close, but now it's a 3 hour drive to get there,  but I've made the drive several times.  I love it that much.  The crispy avocado appetizer and the dynamite rolls are to die for!  They're consistently fantastic! I cannot recommend this place highly enough.",
   "I was not expecting much, but I got hungry. Service and food was outstanding. It has a light and airy feel to the restaurant.",
   "So amazingly good!!!!\n\nThe scallop dynamite roll is absolutely delicious. Many rolls and appetizers were ordered. All fantastic. \n\nBaked teriyaki salmon was great. \n\nEverything was amazing. \n\nService wasn't great, but the food and atmosphere was so good I'm giving them 5 stars anyway.",
   "This is the best Japanese restaurant in Olympia (in my opinion) Excellent service. Excellent food. Just all around a must go to if you're a sushi lover!"
  ]
 },
 {
  "name": "Hotstone Authentic Korean Cuisine",
  "address": "119 5th Ave SW, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d15e1cc8-9332-11ea-8119-14b31f159f22.png",
  "tags": [
   "comforting",
   "food",
   "food",
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=71031544384326147",
  "source": "GoogleMaps",
  "reviews": [
   "Hotstone offers some amazing Korean dishes in downtown Olympia. With outstanding customer service and an inviting environment, this restaurant is perfect for a solo experience or large groups. I was very impressed with their portion sizes and attention to detail.",
   "Easily one of the best restaurants in town. Hot, perfectly balanced dishes. I've enjoyed all the many items I have ordered here. The food is savory and comforting.",
   "Wow just wow. The most authentic Korean food I have ever had. The server was very nice and professional. Also very respectful. I felt like I was in Korea having a meal. I would highly recommend this place for their food and service. I will definitely be back.",
   "Heavenly Beef Bulgogi.  All the sides come with. Sweet savory with classic spice.  If this place was in my hometown I'd never eat at home!!!",
   "I didn't realize Hotstone meant hot food. Very tasty, delicious and any other adjective you might want to use describe this wonderful place"
  ]
 },
 {
  "name": "Koibito Sushi Japanese Restaurant",
  "address": "1707 Harrison Ave NW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d1a70c7e-9332-11ea-9634-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=8097406868099444962",
  "source": "GoogleMaps",
  "reviews": [
   "Our favorite sushi place in Olympia. Every time we go we are served quickly. They have our favorite rolls and have good service. They are usually busy however and the restaurant is small. Not a good place for large groups but they'll make up a table for you.",
   "Very friendly wait staff and high quality sushi. I absolutely love the wide variety of sushi that they offer. They have a very detailed menu so that those who are new to sushi understand what they are ordering. They always offer a cup of miso soup while you are waiting for your meal. The sushi is always fresh and beautifully placed with wasabi and ginger on the side for flavor. If you want the full experience I would highly recommend ordering the chefs choice. It's a surprise variety. These pictures were also taken after I had traded my friend two of our sushi pieces so it doesnt look as pretty as it did when I first received the plate. If you love sushi or are new to sushi I definitely recommend coming here for an all around delightful meal. They also offer a wide variety of non sushi cuisine. I have had several other non sushi dishes there and am constantly pleased with the quality of the food. Definitely recommend 100%.",
   "Very good. Surprisingly good. I came in for lunch and MAN it was good. Service was FANTASTIC. I will definitely be back and i am definitely recommending this place!!!",
   "Kenny is the champion of sushi in Olympia.  All you need to know:  he takes fresh albacore, soaks it in a garlic/black pepper marinade of his own creation, and then casually places it on the menu for true sushi aficionados to spot.  You will not find this type of attention paid to most fish, let alone sushi on the west coast.  And yet a diamond in the rough awaits you at Koibito.",
   "Best sashimi I have ever had and the beef teriyaki bento was awesome,def going there for lunch again."
  ]
 },
 {
  "name": "Vics Pizzeria",
  "address": "233 Division St NW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d1f5dd0a-9332-11ea-92bc-14b31f159f22.png",
  "tags": [
   "kids",
   "eat",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=6289895780471313587",
  "source": "GoogleMaps",
  "reviews": [
   "Best New York style pizza in the county. Fold in half,start from the point. Always friendly staff,always clean. Perfect chewy crust, wide variety of toppings, great selection for slices to go. Order in with a pint,good IPA choice too. This place earned the 5 star.",
   "Nice place. They have whole pizzas and also pizza by the slice. Been here a few times and the staff is always friendly and the pizza is always good. They have some beer on tap, as well as crater lake root beer. Also like that there is a coffee to sit either inside or outside. The pizza is this crust and the slices are big, so if you have kids, you'll have to cut them smaller. Overall it's always a good place to eat.",
   "Really good pizza. It's a small little place, but usually pretty quiet, you order your pizza at the counter and they bring it to you. You get your own drinks. A pretty classic pizza place with delicious pizza.",
   "Easily the best all around pizza place in Olympia.  I have introduced many people to Vic's and once they try it they are hooked.  Don't sleep on the Vegan slices, meat eaters, vegetarians, and vegans all can agree that the vegan pizzas hold their own.  Fantastic flavors and creativity.",
   "Remember the pizza you used to eat, that was so amazing????\nVic's still makes it!!\nPlus you can buy a slice, and they always have some great vegan pizza slices.  It's informal dining , and it can be noisy at lunch or dinner time,  but it's a true neighborhood hangout,  and if the locals love it,  you might, too....."
  ]
 },
 {
  "name": "Kizuki Ramen & Izakaya",
  "address": "120 5th Ave SW, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d23927c6-9332-11ea-8a26-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "cheap",
   "food",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=15790689035430150591",
  "source": "GoogleMaps",
  "reviews": [
   "Good food as always but called and made a reservation for 5pm. It was confirmed with the person who took my call. We arrived early, but were told our reservation was at 5:30. On their books it looked like they had scribbled out 5 to put 5:30.\nThe food was wonderful as always, but their customer service left something to be desired.",
   "This place is great. Happy hour everyday from 4:30-6:39 and all day Sunday. The menu has types of ramen, rice dishes, and appetizers. My husband and I definitely enjoyed our time. Just know that you can't use Kizuki gift cards here only local sold gift certificates.",
   "Yes it isn't cheap, bit you get what you pay for. A wonderful environment, friendly staff, and delicious food. If you enjoy sake... Try to get to know the owner... Just saying... Thank me later",
   "Delicious ramen, had the garlic chicken one. Will be going back and can't wait to warm up my leftovers! If you eat all the noodles but still have broth you can ask for more noodles which is great! Can't wait to go back!",
   "Wow!! That is THE best Ramen I have ever had! Get the Garlic broth with pork belly. The egg in it was amazing! They marinate it for 12 hours before soft boiling it. Crazy good flavor! Even the bamboo shoots are something special! The squid was the bomb too! Will definitely be coming back. I read about the service being crappy, bull!! they were ALL sweet as can be! Even the chefs."
  ]
 },
 {
  "name": "The Mark Olympia",
  "address": "407 Columbia St SW, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d2847798-9332-11ea-947d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3413108485701231086",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food! The steak was a little tough but very tasty. Has to be one of the best  chicken dishes I've ever had. Staff were very friendly. This is no $$ place tho. This is more like $$$$. Dinner for two with two cocktails and a glass of wine came out to 110$. Very tasty tho.",
   "Really good food and drinks. Would recommend.",
   "Fantabulous food and service. Healthiest menu with local & organic meals.",
   "Great find on our way to Seattle. Limited menu but everything is on point. Wish pasta came with an option for meat but the flavors  are all there and locally sourced. Indoors has a weird setup but upscale.outdoor patio is chill and relaxing. Definately worth a try!",
   "Such an amazing dinner. The food is so fresh, flavorful and superbly prepared. The owner only selects what's in season and delicious. We had a wonderful evening. Thank you ❤"
  ]
 },
 {
  "name": "Eastside Big Tom",
  "address": "2023 4th Ave E, Olympia, WA 98506, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d2f25594-9332-11ea-b88e-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14675744782681890190",
  "source": "GoogleMaps",
  "reviews": [
   "The atmosphere was really awesome especially on a cooler summer day. The burger was better than McDonald’s but still nothing to rave about. That goo sauce reminds me of deviled eggs and kind of tastes like it too. The fries are like the ones you got as a kid for school lunch (not good) my husband got a chocolate shake it wasn’t stirred well they just pour chocolate syrup in, I got a banana milk shake it was not good. I would not go back. The lady at the burger stand was way more personable than the ladies who work at the main house or pay area where we got the milkshakes",
   "It had been over 30 years since I had a Big Tom's Burger. I'm thinking the last time was with my daddy, when I lived near there in 1981, before moving to Seattle. Now, I'm back in town, hit up Big Tom's and they make a great burger. If you're looking for just a simple but satisfying burger, minus all the extra mess, then Big Tom's is the place. Friendly staff, ready to assist you, and great strawberry shakes.",
   "The double burger was pretty good. The parking lot was insane though. Cars everywhere. The staff was really friendly. Might try eating here again when they are serving off their regular menu.",
   "Big Tom's is an Olympia original. I arrived during a peak rush about 6pm. There was a line backing up onto the street. My eyes instantly met the eyes of an employee directing me out of the line and to a parking area. The service was prompt, friendly and attentive. I didn't even wait long- even with the line. I saw employees scurrying about. All were engaged with customers. The Big Tom, tots, goop and milkshake were all yummy and live up to the reputation! Service and food both get thumbs up! Its a great drive through and worth your visit!",
   "Food was great. And I loved the atmosphere. My girls loved the dinosaurs! \nI'd love to come back next time I'm in the area."
  ]
 },
 {
  "name": "Da Nang Restaurant",
  "address": "116 4th Ave E, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d3419c86-9332-11ea-999d-14b31f159f22.png",
  "tags": [
   "free",
   "delicious",
   "unique",
   "eat",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=279934568093255561",
  "source": "GoogleMaps",
  "reviews": [
   "First time here and we will definitely be eating here again. I enjoyed the walnut chicken and will get it again. I will also be getting their walnut shrimp. Nice and friendly atmosphere and our waiter was great. They also do a punch card here so that is a major bonus. You buy a meal and get a stamp fill up the card and get a free meal.",
   "I love Danang. They have a full and unique menu. The biggest thing I appreciate about danang is there vegan and vegetarian options if you are looking for meatless.  Service is not overly attentive but always correct.  They have delicious hum bow and the yellow seafood curry is amazing!",
   "I used to be a huge fan. Lately, I've ordered delivery from this restaurant. I recently made a comment to my partner that Da Nang seems to be messing up our orders more frequently than not.\n\nOn the last few occasions, I ordered vegetarian \"almond chicken,\" which comes with deep friend imitation chicken and a sort of almond sauce to drizzle over the almond crumbles.\n\nThe sauce they've delivered is clearly old, as if they've made it earlier in the week and kept it refrigerated. However, the sauce is beyond edible and has separated into a sort of hard lump of almond and smelly old oil.  On top of receiving old, curdled almond sauce, I've received congealed peanut sauce for the spring rolls. I have a feeling they are not cleaning out their refrigerator as frequently as they should.\n\nIn addition to the gross sauces, the new delivery guy seems to chain smoke with the windows up in his car while delivering the food, leaving the food and packaging with a very strong stench of cigarette smoke.\n\nI'm not someone to leave bad reviews. I've given them at least 5 chances. Unfortunately, I no longer have an appetite for Da Nang. Dine-in if you eat here, so you can see the food before paying.",
   "The restaurant itself was clean and had a calming, peaceful atmosphere. The food was amazing. Since moving back to Olympia from the Seattle area two years ago, we've been looking for a great bowl of pho...found it. The spring roll was so delicious to the point my daughter tried it and loved it. This a must visit.",
   "Great service by staff, food was ok.\nPhở broth wasn't hot enough to cook the rare beef\nChili oil was really spicy and good. The chow fun and hone walnut shrimp was delicious."
  ]
 },
 {
  "name": "Hash",
  "address": "1807 Harrison Ave NW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d3901f38-9332-11ea-926a-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4156474038697984731",
  "source": "GoogleMaps",
  "reviews": [
   "Made it to Hash for Breakfast with friends. The food was amazing; so many mimosa choices. When they say the pancake is big enough to share; they mean it. Refer to the picture of my friends with his pancake for scale. Everything that we had was great. I will definitely go back.",
   "I got the chicken fried steak and my husband got the cornbread hash and our daughter got the pancakes. We waited an hour to be seated at 11, the chicken fried steak tasted funny not like in the south, the cornbread was like cake, the server was nice but not attentive there were people waiting standing up watching us which is awkward. The cornbread and pink butter was good, toast was good, eggs were good. It was $50 for breakfast which seemed extremely expensive",
   "AMAZING!!! Every item on the menu is fresh and delicious! The service is wonderful, very sweet and caring people! It's also family friendly. We love it there. It's our go-to breakfast restaurant after mass every Sunday!",
   "For the price, and the wait, should've gone somewhere else. The place has good food. I ordered the corned beef hash. The potatoes and hash browns were good. I even enjoyed the eggs, and the sour dough bread was amazing. The corn bread was too sweet for me, reminding me more of yellow cake. My 6 year old loved it, and kept calling the spread that came with it \"frosting\". Like I said, the place is good, but it took an hour to even sit. It's better than IHOP, but I was just done with the whole experience by the time I got seated.",
   "Excellent everything! The food is amazing! The staff is friendly and fast!  The ambiance is welcoming and earthy. Even the other patrons were friendly and talkative!  \nIf you like pancakes,  you have to order the monstrous blueberry and pistachio...OMG! \nAll around nice place to eat and enjoy a great meal. The price is a bit spendy but definitely worth it! My husband and I had breakfast \"a whole lot to eat\" for about 50.00"
  ]
 },
 {
  "name": "Far East",
  "address": "218 4th Ave W, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d3d8b39c-9332-11ea-8c79-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "affordable",
   "delicious",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1098042402252016060",
  "source": "GoogleMaps",
  "reviews": [
   "Just a quick public review! \nThai Restaurant: Far East in the heart of down town Olympia! \nI want this little husband and wife restaurant to have more exposure because they don’t advertise at all and I LOVE them! \nI religiously order \n1. Pad Thai w/ tofu\n2. Veggie Delight w/ tofu\n3. Broccoli w/beef \n4. Thai Tea! Best one I’ve ever ordered! \nYUM! \nThe wife has the best customer service, memorized all of my favorite orders and is just full of amazing energy, and her husband is the best cook! \nI’ve had other Thai food and yes it’s good but other places over sauce or use some sauces my tummy does not like, but they keep it fresh, simple, light, and delicious! \n10/10 my favorite place to get lunch!",
   "A quick, flavorful, fresh and affordable. Stopped in here on the way through town. Would definitely return.. yum!",
   "I'm in love with this secret food destination.\nAlways fresh and delicious. Friendlier than any other place in town.",
   "I have been eating at Far East since 2009, and cannot speak highly enough about the food and service here - both have been exemplary at *every single visit* for over a decade. What more can you ask for, truly, in a restaurant?  \n\nVisit, enjoy, and tell your friends - Far East is the way to go :D",
   "A great little family restaurant in downtown. My family has been going here for years now and this place never disappoints. I can't recommend them enough to anybody looking for some great, quality food in Olympia."
  ]
 },
 {
  "name": "Mekong Thai Restaurant",
  "address": "125 Columbia St NW, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d42364f8-9332-11ea-a7fe-14b31f159f22.png",
  "tags": [
   "art",
   "food",
   "delicious",
   "food",
   "delicious",
   "free"
  ],
  "link": "https://maps.google.com/?cid=12801361133518320830",
  "source": "GoogleMaps",
  "reviews": [
   "Got the food to-go, and can say it was a fast and great experience. From ordering in person till I was in my car driving away was a total of about 15 minutes, and while I waited inside it was a pleasant experience with good art pieces and a clean calm environment. The Mekong egg rolls and Phud Thai were the best I’ve eaten. The Mekong curry was also good and very spicy. I will definitely be eating here again.",
   "Very delicious food! Such large portions and not expensive. We ordered Combo #1 (egg roll, vegetarian pad Thai, rice, sautéed veggies and chicken) and Combo #2 (egg roll, vegetarian pad Thai, rice, curry). It was so much food we had very full take home containers. But everything was delicious! We’ll definitely stop here again next time we pass through Olympia.",
   "Delicious!  Attentive to our needs, and fair prices, this amazing restaurant has been a favorite for years!  Plenty of options for people with special diets, including gluten free, vegetarian, and vegan! Also plenty of meaty and seafood items for the omnivores and pescatarians!",
   "Love me some green curry! I think I’ve found my new favorite spot. It was clean + quite environment for a quick lunch. Service was prompt. My order came out quick.",
   "Great spot in downtown Olympia. Love the curry and the fried wontons."
  ]
 },
 {
  "name": "Seed & Bloom Plant-Based Kitchen",
  "address": "500 Capitol Way S, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d46c3c30-9332-11ea-9733-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "eat",
   "music"
  ],
  "link": "https://maps.google.com/?cid=12256127144089898625",
  "source": "GoogleMaps",
  "reviews": [
   "Every single thing here is delicious. The people are so nice. The space is wonderful for hanging out, visiting, working. Can't say enough good things about them! My fave items are the scones, breakfast sandwiches, Italian melt, and the spicy peanut wrap!",
   "Just ate here for the first time and really enjoyed my Italian melt sandwich 👍!  I dig Olympia's vegan catering eateries.  All the folks working at Seed and Bloom were nice 🙏!  There is a small selection of vegan cheeses/butters/milks and some other goodies like bags of vegan chips that you can get there as well.  I picked some Miyoko's butter and cheddar spread while there, the old lady and I enjoy those products 🤙  Check it out and support local businesses 🙌",
   "a LIL pricey but not too bad. REALLY GOOD tasty vegan deli-type food. had a curry potato salad that blew my mind! thanks so much to the artisans creating these great treats!",
   "Nutritious and flavorful, this shop is a delight to go to. This elegant location is the ideal place for a large range of diets such as vegan, vegetarian, etc. They carry wine, beer, organic drinks, and smorgasbord of salads and sandwich options.",
   "Best coffee ever ...didn't even add sweetener (Olympia Coffee Roasting Company). Awesome music. Awesome service. Excellent prices. $2.75 for 20 oz or two refills on 8 oz mug eat in."
  ]
 },
 {
  "name": "Izzy's",
  "address": "3540 Pacific Ave SE, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d4d33d02-9332-11ea-aff1-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7476088645199869923",
  "source": "GoogleMaps",
  "reviews": [
   "The owner and his wife do an excellent job. The food is great and Rosa and Gloria are our favorite employees. They give a 150 percent all the time. You can't be in better hands than Rosa's and Gloria's. Enjoy the food and atmosphere. Enjoy yourself!",
   "Here now!  Was invited by the owner to eat and share the experience.  Busy, helpful, cheerful, hardworking staff.👍👍👍👍👍  Clean, tasty, well stocked, fresh, did I mention clean?  Fried chicken was amazing, (tender and juicy).   Baked beans amazing (great smoky taste).  The corn lacked in seasonings but it was tender and sweet.👍👍👍  The salad bar was as it should be, clean, fresh, well stocked and not over loaded with too many choices but just right. I drove down from Puyallup and will do it many times over for this place.  I'd recommend Izzy's to anyone who has ever eaten at other American buffets.  The price is so low for what you're getting!  On demand, all you can eat sirloin steak, prepared any way you like and batter fried fish or fish tacos made to order.  Do it, visit this place, you'll come back, guaranteed.",
   "I have never been disappointed with this amazing restaurant! The staff is so great. I love to see that the same employees have worked there forever! The food is good and lots of variety!",
   "Delicious food, staff is always friendly and helpful.. we love it here! We drive from an hour away to to Izzys.. I eat seafood now because of their cod like no lie",
   "DELIVERY and CARRY-OUT?! Yes, please! We were thrilled to find one of our favs open for business. This is a great go-to when we can't stand our own food anymore (this happens a lot). Great service, people and food!"
  ]
 },
 {
  "name": "El Sarape",
  "address": "955 Black Lake Blvd SW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d51c1be2-9332-11ea-af23-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16861236022906521205",
  "source": "GoogleMaps",
  "reviews": [
   "After a rough start, we had a wonderful night. It was my husbands birthday and there was 14 of us to be seated, we did find seating for all of us in a long set of tables. Our server, Romero, who's birthday it was tonight also, was magnificent. He served us by himself, no one ever had to wait on a thing, he was there for us.  No mistake was made. Thankyou very much.",
   "Spent all day in remodel, wanted an easy meal. Ordered on door dash, received ordered meal with chips and salsa. First awesome discovery. Second awesome, the meal came with recyclable containers! Yes!! Third, is was so so good! My husbands vegan, he couldn’t believe I didn’t order him a regular chicken dish. It was all so good! Ordered a verde burrito, avacado enchilada, and a side veggie tamale. Can’t wait to order again - amazing!! El Sarape, looking forward to when we can visit you in person until then... door dash!",
   "Delicious. Most dishes between 15-25 dollars and totally worth it. Had some chips and salsa to start with and that itself was really good. We had the fiesta dinner and fajita trio. It was amazing! We loved it.",
   "This is my first time going here since the building was the black bear diner. They took the building and built a gorgeous restaurant! The decor, the tables, the back of the bar, and even a round table around a fire!? I was hands down impressed when I compared this location to the old El Sarape! \nThe food was also great, we ordered 2 different taco plates and both were good! The avocado salsa that came with them was just right and delicious! The drinks were also good and fast (we were in the bar but that doesn't always equal good or fast). Lastly we fed 2 adults with margaritas for less than $50! \nIf you didn't like the old place, make sure you gice this one a shot, you won't be dissappointed!",
   "Delicious food! Great place for a date. Lots of good vegan options. Avocado enchiladas are amazing! Convenient take out. At the bar they have a great happy hour with fresh tasty chips and house salsa."
  ]
 },
 {
  "name": "Fish Tale Brewpub",
  "address": "515 Jefferson St SE, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d566f512-9332-11ea-992d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "eat",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=176317927902280777",
  "source": "GoogleMaps",
  "reviews": [
   "Always good food, fresh and delicious. Brews to choose from Leavenworth to their own home variety, plenty of seating, located in downtown Olympia.",
   "It was packed! Which I like to see means that it’s a good place to eat. Had the Fish tacos and sweet potato fries. It was delicious, we ordered food and it was out in no time! Great service and Fantastic Food. Definitely a must go!",
   "I liked this place and think that they had a good selection! I tried a couple of the IPAs and was not disappointed!!! The staff were very nice, friendly, and helpful in selecting beers, the food was good as well! We had the public house  burger and they cooked it to order! We also had the tater tots which were impressive from someone coming from the Midwest! The place was fairly spacious, with indoor and outdoor seating and a pretty sizable indoor area. This place had good ambiance and overall great place to stop for a beer and food!!",
   "Great selection of beer from a classic WA brewpub.  I enjoyed each of my 4 samples.  The imperial IPA with honey notes (Hodgson’s Imperial IPA) was the standout for me.  Their nachos were excellent with plenty to go around for a group.  The venue is huge but in need of some interior investment.  Super nice and attentive staff!",
   "Delicious!! The fish basket is enormous. Perfectly fried cod and oysters. Plenty of beer and cider on tap to choose from. Service is friendly and the atmosphere is inviting!"
  ]
 },
 {
  "name": "State & Central",
  "address": "1415 State Ave NE, Olympia, WA 98506, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d5beb10a-9332-11ea-967d-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11867766542112281390",
  "source": "GoogleMaps",
  "reviews": [
   "I was in Olympia for a night and we decided to get some burgers at this place. The service was phenomenal! I wish I remembered ladies that attended us there, because they were incredibly nice! The food itself left me satisfied and reminded me of what a good quality burger should taste like. The burger itself was super juicy (I got the 'Juicy Lucy' so it lived up to its name). Overall, my experience here was great and if I find myself in Olympia again, this will be the first place I visit!",
   "I've been several times and always enjoyed the meals. Menu has something for most diners. It's largely pub fair done well, burgers, fish and chips, salads, etc... Everything I've tried was good.\nLooked like 8-12 taps and a variety of styles of beer as well as a full bar.\nIt's a small spot so there may be a wait during busy hours. There is some outside seating as weather permits.",
   "Don't wait, stop in. Street parking may be tough at busy times. Fast friendly service, clean and efficient.  I only had fish and chips -excellent light and crispy beer batter and thin cut fries, coleslaw was very good also. There is a nice selection of brews and wine. The restroom was very clean. I will be back for more.",
   "Absolutely L.O.V.E.  this place!  Limited parking, so take advantage of the easy access by bike.   Best tomato bisque in Oly.",
   "Great food as usual although I would desire another choice of potatoes for breakfast other than tots or fries and a better choice of toast.  For lunch or dinner no one beats S&C but they need to make the same commitment to breakfast that they do to dinner.  The omelette was awesome, my partner's bacon looked amazing, good coffee, just need to step up their game with home fries and toast."
  ]
 },
 {
  "name": "King Solomon's Reef",
  "address": "212 4th Ave E, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d60e09c6-9332-11ea-b3a5-14b31f159f22.png",
  "tags": [
   "delicious",
   "tasting",
   "affordable",
   "delicious",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6305725661283368659",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely perfect! Like everything about everything was so good! I had the biggest side of mashed potatoes and gravy in my life and it was probably the second greatest joy of my life. I have a kid so ya know. But for real do yourself and your whole table a favor and get them mashed potatoes! They are life changing. We also got the BLAT which was delicious and a grilled cheese with the tomato soup that was to die for.",
   "King Solomon's Reef Restaurant has some of THE best tasting and high quality breakfast foods at reasonable and affordable prices. The service is top notch!",
   "Food is delicious and fresh.  Will definitely coming back.    Great service also.   Good job guys.",
   "This is Bryan. I wanted to write this review and give credit due where it's due. I haven't been here to this place in 3 years. I'm temporarily here for a month and wanted to stop in and have a few beers. There is a Barkeep here named John. He is what makes this Bar. It's a decent place to go if you want to just chill lay back and get your thoughts together. You won't meet a more real good hearted good guy than John. The folks here are awesome and they have great food etc.\n  We need to as Americans support our good little American bars and Cafes. Thumbs up to The Reef. Also to John the Main Barkeep glad we have good Men like this around. Let's Support Our American Buusinesses🇺🇸🇺🇸🇺🇸👍👍👍",
   "Love to eat here, best homemade biscuits, big, and fluffy, melts in your mouth, just like my Great Grandma made. Great place for everyone, vegetarian, and vegan food available. If you haven't been there yet, you have to go as soon as possible."
  ]
 },
 {
  "name": "Narai Asian Cuisine",
  "address": "320 4th Ave E, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d6658f98-9332-11ea-a41b-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7876433087507264612",
  "source": "GoogleMaps",
  "reviews": [
   "They're still open for takeout during the shutdown! The food is delicious. My order was filled in less than ten minutes (although I was the only one ordering in person at the time). They were so gracious and gave me a stamp card for free crispy egg rolls on my 6th order. The chicken pad Thai was a sufficient spicy at a level two, came with fresh carrots, sprouts, and crushed peanuts! Will definitely be back.",
   "Super friendly owner and chef wife. Feels like home cooking. Delicious food flavors! Good variety, quick service, easy on the pocket too!",
   "Great place. Great service. Really high quality, fresh ingredients and authentic recipes.",
   "We stopped in late one night to grab some food to go. The owner promptly greeted us and took our order. He was helpful and our food was ready super fast. The salad rolls were fresh and they came with two delicious sauces to dip them in. Our main courses were fresh and steaming hot in our togo boxes. At home we feasted and decided that Narai is the only place to get Thai in Oly.",
   "Gracious hosts. Good fried rice. Narai temple is nice"
  ]
 },
 {
  "name": "Octapas Cafe",
  "address": "414 4th Ave E, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d6b13f3a-9332-11ea-a0e8-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11946858658420780747",
  "source": "GoogleMaps",
  "reviews": [
   "Great place. The venues bar and staff was great and the bands who played last night were exceptional!",
   "Octapas is a warm and welcoming place to meet a friend or a group or family. Full bar, coffee bar, and desserts, with the best ginger carrot cake one can consume. There are live events in the black box at the rear of the restaurant. You'll find yourself in the heart of Olympia community. The food is imaginative and , specializing in tapas, with entrees to soothe a hungry soul. Vegan options is an understatement. Check out their website!",
   "What a hidden gem. The menu is exciting.  The food is delicious.  The prices are extremely reasonable.  And the ambience is wonderful for a date night. I highly recommend.",
   "Friendly service even while quiet. Looks like it would be really fun during live entertainment. Interesting tapas menu.",
   "This is my first giving a review ever on a restaurant.\nI ordered a dish that highlighted Oysters on their menu. I was excited and ready to enjoy the dish. When I was served I had to really look around for the 2-medium size Oysters. I was expecting a dish that was focused on oysters, more than 2 anyway. That was very disappointing to me. Don't put the word oysters in the description and serve a dish with 2 Oysters! The dish fell short ☹️ due to the lack of them, in my option."
  ]
 },
 {
  "name": "Cooper Point Public House",
  "address": "3002 Harrison Ave NW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d6f21874-9332-11ea-9269-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "food",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4669873987305661353",
  "source": "GoogleMaps",
  "reviews": [
   "I absolutely love Cooper Point Public House! It has a warm and rustic charm from the moment you walk in all the way down to the food presentation. It's menu while small still has something of value for everyone. I can honestly say they have the best and I mean THE BEST buttermilk pancakes EVER! Lunch is great too! I also love their sustainability focus, by locally sourcing, composting, and utilizing paper straws. Let's not forget the staff who work hard to provide you with a fabulous experience, quick service, suggestions, and a kind smile.",
   "The atmosphere is nice enough but the food was a bit off. I had the bacon, egg, pub potatoes and pancakes with a Dr. Pepper. The bacon was okay. Egg, scrambled was a bit tasteless. The potatoes tasted like they should have been tossed out due to being past their prime. The pancakes, although smelled wonderful, reminded me more of a custard or flan. They just didn’t taste like good ole hot cakes. Everything just seemed lacking in flavor",
   "Excellent bar food and fast service.  I went\nwith a group at happy hour and the menu choices was very good.  So was the\nprice, if you go try the fried pickles and\nwings.  If you just want to eat good fried food, at a quiet no nonsense restaurant, this is a great place for you.",
   "Innocuous interior with no \"public house\" feel. Food was adequate,  and I would go again to try other menu items. I had a skillet breakfast and it was decent but lacked pizzazz. \"Toast\" was not buttered and was little more than dried bread with no color or toasting on it.\nWait staff was friendly and efficient. \nDefinitely worth a try, could be a good place, just need to dial it in a bit on what they're trying to be with food and atmosphere.",
   "Good food in a laid back atmosphere. Wait staff has always been friendly and our orders have been accurate. Service times can be a bit slow so leave yourself some time to relax and enjoy :)"
  ]
 },
 {
  "name": "Saigon Rendezvous ( Pho Na )",
  "address": "117 5th Ave SW, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d738a740-9332-11ea-90a1-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17950013750573609156",
  "source": "GoogleMaps",
  "reviews": [
   "Such a great spot. Our server was very friendly, there wasn’t a long wait. Food tasted great. I ordered the beef meatball Pho and it was amazing!!! I legit recommend this place!",
   "I was craving a warm soup and decided to try this place. I was pleasantly surprised. The food was incredibly delicious. It tasted clean, meaning they dont go crazy with the salt and im pretty sure they don't use msg. The service is kind and friendly.",
   "I went here before but didn't know it had changed owners, the surprise was more than pleasant, it was awesome!  The host is the most gracious of any place in town. The food is fresh. I mean vegetables probably purchased today. They only cares if everything was great and that you have everything you want. I will definitely go back, I'll probably bring my whole family next time. Looking forward to buying this from Uber eats.",
   "Tasty food, service is slow but nice people.",
   "Great food and great service!"
  ]
 },
 {
  "name": "Thai Garden Restaurant-Lounge",
  "address": "2735 Harrison Ave NW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d7874124-9332-11ea-83e3-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "eat",
   "food",
   "delicious",
   "kids",
   "food",
   "drink",
   "knowledgeable",
   "food",
   "free",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2216325257236177842",
  "source": "GoogleMaps",
  "reviews": [
   "Love this Thai place and so do my friends!  We were looking for a casual place for a nice lunch together.  There were a few other groups of friends doing the same thing.  Food is fresh, lots of veggies and it doesn't take very long.  Staff is friendly too, good ambiance with the plants in the room.",
   "The food tasted like it was made days ago and just reheated. The server was asked for lemon when she did our drink order and we never received them till asking when she finally checked on us half way through the meal. The rice dishes were extremely dry and even with lots of soy sauce, still taste less. Sadly I will not eat here again!!!",
   "What a wonderful ambience. The service was fast, the food was delicious. We can their hot wings and spicy fried dumplings for an appetizer. Followed by a vegetarian and non vegetarian entree. Both were delicious and served with a side of rice. Definitely worth the $12.50 we paid for them. The Thai iced coffees were delicious as well. The fish tank was cool for the kids too look at during the short wait for our food. All the plants were nice to look at as well. I highly recommend going in just after noon. Very chill.",
   "This is a top notch eating establishment. With authentic Thai food and drink.  Prices are moderate but not overly expensive. The waitstaff is knowledgeable and friendly and Everything tasted wonderful.  Enjoy",
   "I have worked in the restaurant industry for many years. I had been to Thai garden multiple times but today I had a bad experience... it was little things that added up that I usually let slide because I am a server myself. But this time I really felt like they don’t know about good customer service policies:\n1.) we walked in and weren’t greeted...there were 2 tables and no employees in the front of the house to be found, meanwhile 2 other tables came in. Finally we got sat.\n\n2.) I love to try new food and decided to try a new dish. I got 3/4 stars on spicy. My curry was just not good... I didn’t like it (it was flavorless, needed salt and seasoning, it wasn’t spicy AT ALL) I couldn’t keep eating it. I never send anything back but I had to let the server know. \nI told her I didn’t like the dish... \nto my surprised she responded that “it your decision to order that dish, and our policy is that we can’t take something off a bill because you simply didn’t like it” she left and came back and then let me know that she could give me a free spring roll but couldn’t take my food that I didn’t eat or like off the bill. \n\n3.) never seen a complaint handled this way in the service industry, it might not have been the servers fault but whoever implemented their policies needs to know they are going to lose customers if the customers concerns aren’t taken seriously."
  ]
 },
 {
  "name": "Basil Leaf Restaurant",
  "address": "235 Division St NW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d7e2f128-9332-11ea-ba68-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10062803711677059768",
  "source": "GoogleMaps",
  "reviews": [
   "If I could leave less than one star I would. The food is decent at best which is the only semi-pleasant part of this dining experience. The customer service is genuinely horrible, the mess up my order constantly. The last time we went there we ordered “Pad See Ew” over the phone, when we arrived they had prepared the wrong food and when I told them it was wrong they literally would not make the correct order, over and over they said “just try it, you’ll like it.” Clearly just  they did not make the effort to correct their mistake. \nZERO OUT OF TEN!",
   "This shop has the best mom's pork fried rice in the world! And too top it off they also have the best and freshest fresh rolls I have ever had. And ive had at least a dozen from different resteraunts. The owners and employees are always very friendly fast and have never let me down after dining in and taking out for over 5 years. ",
   "polite service. they work hard and are working hard through the pandemic. even with some longer wait times then usual, greatly appreciated. tasty food! (one req, need more filling inside the crab rangoon. had a couple pieces with close to zero filling).",
   "Had the giant prawns and was very happy with the crispy breading. Dipping sauce was sweet and tasty. Enjoyed the waitress who was learning English. If they had a more inspired music on the speakers it would have been even more enjoyable.",
   "Tasty meals, we all got lunch combo meals which were enough to fill us up (I'm a heavy eater). The single staff that we saw was very friendly and patient. The food was flavorful but a bit too salty/sweet and there was more oil than needed. Great spot in the area."
  ]
 },
 {
  "name": "Pellegrinos Italian Kitchen & Catering",
  "address": "205 Cleveland Ave SE, Tumwater, WA 98501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d8263286-9332-11ea-9b9d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=744822595185642036",
  "source": "GoogleMaps",
  "reviews": [
   "Authentic & delicious! Seriously the best Italian restaurant I've ever been to. Not only were there huge portions (and I'm a big girl) but the food was so good. The ambience of the restaurant was very nice and cozy, intimate and romantic. All the staff were friendly and courteous.",
   "I met a friend who is a business colleague after work for a social dinner at Pellegrinos Italian Kitchen & Catering in Tumwater.\n\nStaying at the La Quinta Inn & Suites by Wyndham Tumwater - Olympia on Capitol Blvd SE, it was a super easy and quick drive to the restaurant.\n\nParking can be a little tight so I parked on the adjacent side-Street, Bates St SE. \nBut this speaks to how popular and wonderful the restaurant really is!\n\nMy favorite types of restaurants are the local family-owned since you get that certain personal touch and atmosphere.\n\nAnd Pellegrinos is definitely 5+ Stars!\nThe service was phenomenal and the food perfect.\n\nI started out with the anti-pasta salad which I expected to be small but was more than generous loaded with all of the great stuff.\n\nMy meal was the veal parmigiana which couldn’t be made any better.\nIt was tender, tasty, and prepared just right. \nAnd the pasta and marinara sauce were excellent too.\n\nThis definitely a gem of a local restaurant.",
   "Only reviews breakfast. Cinnamon roll was incredible, and I will absolutely be back for that, and for the excellent service! The potatoes and the Italian sausage were just right, and the lemon sauce on pancakes was exactly what I wanted. Friendly staff, not too long to wait between ordering and receiving food, and they made sure we liked everything we ordered.",
   "First time here and it was great! Brought a friend for her birthday lunch. Delicious food and quick service.",
   "This was the first time I had been to Pellegrinos. It's a cute place, with great food and excellent service. We were a party of 6 and were seated upstairs. So I would suggest if you have anyone in your party with diminished mobility, request a table on the main floor. Also, it was a little loud where we were seated. Not sure what that's like on the ground floor. Still, we will all go back for the food & service!"
  ]
 },
 {
  "name": "Ricardo's Kitchen + Bar",
  "address": "676 Woodland Square Lp SE (Enter Off 7th), Lacey, WA 98503, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d86c636e-9332-11ea-a28d-14b31f159f22.png",
  "tags": [
   "art",
   "food",
   "delicious",
   "food",
   "food",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7151893408500332",
  "source": "GoogleMaps",
  "reviews": [
   "I have been to numerous the nicest and well known steak restaurants in downtown Seattle and Bellevue area and there are only handful of them that are equivalent to Ricardo’s. \nAbsolute hidden jewel in Olympia area.  You have to try their steak, it will blow your mind. \nFor the lunch try 80-20 burger, for the dinner all of their steaks are cooked to perfection, and even plating(presentation) of the food is state of an art. Great selection of wine, great atmosphere. If you need to get a good steak in the area, look no further",
   "My husband and I came here for our first time to celebrate my birthday and our anniversary. We had a reservation, and even though it was packed on a Saturday night and we were early for our reservation, we still got a table within 10 minutes.  We had the mushroom bruschetta for a starter, and it was so amazing, we ate every bite! I had the seafood tagliatelle for dinner, and my husband had the 14oz. 40-day rib eye. Everything was delicious! We were stuffed! And they offered me a complimentary dessert of my choice for my birthday. They also do military discount, which we appreciate. We will definitely be coming back and telling all of our friends about this place!",
   "Ricardo's always delivers! This is becoming our go-to place for special occasions. It is pricey, but the amazing food and service more than compensate for that. The staff goes out of their way to ensure that their customers are completely satisfied each and every visit. We'll be back soon.",
   "The food was awesome but the service was very poor. The waitress who was supposed to take my order acted like I wasn't there or would ask me for my order from the other side of the table. Other than the service, everything else was great.",
   "We love it here!  They dry age their beef up to 50 days in house!  The dry aging room is visible right when you walk in! Amazing everything! They have a great wine selection and mix great cocktails!  A must try restaurant!"
  ]
 },
 {
  "name": "Quality Burrito",
  "address": "213 4th Ave E, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d8c191ae-9332-11ea-baa8-14b31f159f22.png",
  "tags": [
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=12707315099527861951",
  "source": "GoogleMaps",
  "reviews": [
   "This place was amazing!!!! The burrito we got was the grilled chicken ranchero and it was almost as big as the plate. It came with chicken, pickled jalapenos and carrots, rice, sour cream, guacamole, cheese and beans. Also we had ours fried which cost a dollar more but it was worth it!! One burrito is more than enough for 2 people. Will be going back again for sure!! So good!",
   "First time at QB and I enjoy my dinner so much. Generous portion, tasty food, great service from both waiters, will definitely be back soon.",
   "Wow.i mean wow.   Delicious burritos.   Very tasty.    First time being here and definitely will be back.     Just awesome.",
   "Burrito?! Are you kidding?! These mothers are the greatest ever! Olympia is the place for burritos!",
   "Already loved this place, and now found out that they've chosen to remove beef from their menu entirely due to environmental concers.\n\nMajor props, had to drop a 5 stars to counteract any salty carnivores"
  ]
 },
 {
  "name": "Great Cuisine of India",
  "address": "116 4th Ave W, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d9055f3a-9332-11ea-a112-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "family",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6360546374067547285",
  "source": "GoogleMaps",
  "reviews": [
   "Very good restaurants... Liked the butter chicken best... Everything else was good except tandoori chicken which was little sweet. Will definitely try next time for other dishes",
   "Solid menu, great price, AMAZING FLAVORS! Consistently good service and food quality. It’s always the exact same every time we visit. Two people can share one appetizer and an entree and be satisfied.",
   "Had the buffet and it was decent but for me,   not something I'd repeat too soon. The meat was pretty dry and the samosa on the buffet was stuffed with rice and corn instead of the usual patatos,  peas,  etc.. so these two things really tainted my experience. Another fried item seemed stale - as if it sat on the buffet line too long.   Perhaps I caught them on an off day but I wasn't too pleased with that. The server was very nice and attentive with water and removing used dishes.  I just wanted the food to be better.",
   "This is a family run restaurant, I had great Service and the food was very delicious. I got the \"spicy\" chicken Marsala which was hot for sure but had a great blend of flavors. Pair it with a beer and your good to go.",
   "It was very good experience for us when we ate there. We were traveling from Portland to Seattle. We wanted to get some Indian food and this place was awesome! Customer service was good. We don’t have anything to complain! Several people asked us about the food in the restaurant. It was very easy to find perking since it was weekend. We ordered non vegetarian deal. It was plenty for both of us. I think three people can eat easily."
  ]
 },
 {
  "name": "Dingey's",
  "address": "700 Capitol Way N, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d94c5776-9332-11ea-8233-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=9086682836434740568",
  "source": "GoogleMaps",
  "reviews": [
   "Possibly the best food in Olympia. Limited hours and at the Farmers Market. \nSo many ways to enjoy local oysters, and all made fresh on site.",
   "I am a little suprised that the reviews are so good for this eatery.   It is not bad by any means, but in an area with tons of fresh good seafood, it also is not the top of the list either.  What this place does have is a good location.  As part of our outdoor Farmer's Market in the area, it is a hot food option while visiting the market.  I ordered the prawn basket and it was just ok.  If I were to return again I think I would try the crab cakes.  Just a so so place.",
   "Excellent menu of northwest seafood delight with friendly staff serving behind the counter. Crab Cakes Benedict is delicious!",
   "Pretty good choice if a little appetite plagues you. Great selection of fresh fish and seafood meals.",
   "Dingey’s has the best clam chowder in the world and there fish and chips are incredible."
  ]
 },
 {
  "name": "Swing Wine Bar",
  "address": "825 Columbia St SW, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d98f2d1a-9332-11ea-ac5f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "drink",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7780347080349568601",
  "source": "GoogleMaps",
  "reviews": [
   "We have always wanted to go here. A friend of ours invited us out.  Now we can't wait to go back. Excellent service, great food, excellent wine.  We were able to enjoy our friend and the food and not be interfered with for a long dinner.  We felt welcome and not out of place as some restaurants go if they can't turn the table over several times a night. I cannot wait to go back to continue going through their menu.",
   "Swing Wine Bar is a cute, upscale yet homey feel, restaurant that overlooks the beautiful lake. The food is always devine, with well thought out menus. As a non drinker, they had crafty moktails, which were perfect! Large craft cocktail menu, with a great wine list as well! Perfect for any occasion, as they have outside AND inside seating. It's PERFECT FOR DATE NIGHTS.",
   "Love getting dinner here. Fantastic location to bring a date or meet friends for dinner and drinks! Meals are exceptional!",
   "Been here a couple times and have always had a great experience.  The ambiance is great - and old house overlooking Capital Lake converted into a wine bar restaurant.  Service is very attentive and friendly.  They have a happy hour menu called the Lush Rush that changes, not sure how often, but the drinks and food options change.   This visit was a happy hour visit with my mom and we both had a Five O'clock Somewhere drink, and the Bacon wrapped dates for a little bite to eat.   Both yummy!   Will continue to visit this little house on the hill!",
   "Delicious food, must try the gorgonzola mushrooms, deviled eggs, street tacos were amazing. The baked brie is delicious as well. Huge menu of custom crafted cocktails and wine. You can also enjoy wine flights and whisky flights. The view is amazing, great service and atmosphere. Highly recommend."
  ]
 },
 {
  "name": "Oly Rockfish Grill",
  "address": "700 4th Ave E, Olympia, WA 98506, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d9dfe562-9332-11ea-8960-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=16605806348106198675",
  "source": "GoogleMaps",
  "reviews": [
   "This is the second poor review in a row for me. I used to love the goat cheese salad. Tonight the onions were way too pungent, the garlic wasn't cooked or sweet and the whole taste wasn't good. The waitress took forever to greet us. She was the only person I saw all night and she said it was her first night.",
   "I'd give 6 stars if I could. Amazing food, outstanding service, beautiful venue, endless menu, this place was amazing. My friends/family from out of town demanded TO-GO boxes, & continued to talk about the food for hours afterward. Highly recommended!",
   "We enjoyed a very yummy breakfast on Friday. I had the goat cheese & spinach scramble w/fruit & toast: FANTASTIC, delicious & not the typical boring & unripe fruit: a Wonderful, generous assemblage of delicious assorted fruit. My friends & I Will return!!",
   "Got brunch and it was great! Chicken Fried Steak, a poached eggs, a biscuit, and grits! All flavorful and delicious! A decent Bloody Mary too.",
   "Great breakfast spot, and has a cool lounge for cocktails in the evening with a decent dinner menu. Service was fast and professional."
  ]
 },
 {
  "name": "Peppers Mexican Restaurant",
  "address": "114 Cherry St NE, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/da33aaec-9332-11ea-9833-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12842090528152841661",
  "source": "GoogleMaps",
  "reviews": [
   "I love the setting of old Mexico 🇲🇽. The food is just like home. I love the selection and the smells. The waitress is very courteous and funny. Food was prepared quick, hot and very tasty. Highly recommended.",
   "Went there to have dinner tonight.  The place is empty and there's a sign in the window thanking customers for dining there for 28 years. But now they're closed for good.",
   "Delicious food and drinks!! Love visiting peppers for the mole, but tried their crema sauce last night and wow was it good. They also deliver!",
   "This was our first time at Peppers.  We stopped here for lunch.  The restaurant was nice and clean.  We ordered a chimichanga and fajitas.   The portions were large.  The food was great.",
   "Although the food is generally pretty good, I am VERY concerned that several times I have received salsa that is so old that it is bubbling and fermenting. \n\nI hope that someone that works here is monitoring the feedback from customers - I order online often as I live close by, and feel I should be reimbursed fairly for at least two occasions I paid $4.99 for chips and salsa and gotten old batches. Also, I've gotten stale chips almost always. As an aside - if I were ordering in the restaurant, I wouldn't have to pay for chips and salsa at all, as its included in any Mexican restaurant. \n\nIn general, these  mistake makes me worried that other things are also being overlooked, and I honestly want to keep being a customer... getting a little closer to not, though."
  ]
 },
 {
  "name": "Falls Terrace Restaurant",
  "address": "106 Deschutes Way SW, Tumwater, WA 98501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/da7ee524-9332-11ea-b4ab-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8959440419296706049",
  "source": "GoogleMaps",
  "reviews": [
   "I thoroughly enjoyed my meal here, to say the least. I got the sirloin steak with mashed potatoes and mixed squash and zucchini. The steak was a perfect medium rare. The restaurant is right along the falls and the view on a stormy night was incredible. This is my first night during a stay in Olympia and it was a wonderful way to start it!",
   "Drove past the sign visable from I-5 near 101 for years.  Met Family there and were surprised that the view and food was even better than imagined.  Price was reasonable.   Parking out front on Deschutes was ample.  Bing Crosby's Great Grandfather's house further down the street.  Good Stop.",
   "Delicious food, exceptional and kind service. First time visit for a special occasion... Will be back for more the next time we have someone to celebrate.",
   "We go every Thanksgiving. Friendly staff, varied menu with delicious choices and a full bar!🙂",
   "The food is beautifully presented and tastefully created. There are several healthy choices on the menu. Service is always top notch, and the view of the falls is spectacular. A bit on the pricey side, but worth the extra."
  ]
 },
 {
  "name": "Equal Latin Restaurant & Bar",
  "address": "520 4th Ave E, Olympia, WA 98501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dac8e68a-9332-11ea-a6eb-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "unique",
   "food",
   "delicious",
   "food",
   "food",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=17198430751869284950",
  "source": "GoogleMaps",
  "reviews": [
   "This place has the most authentic Mexican food in town. The flavors are over the top! Great menu and very good table service. Chances are that the owner will stop by your table to ensure all is well.\nThe prices are moderate.\nGenerous servings for every plate I saw. A good selection of draft beers and a full bar.\nThis place is easy to find, access, and exit. It is fully handicapped accessable.\nIf you found this review to be helpful please consider adding a thumbs-up.",
   "Had a wonderful dinner with my large group of friends - they accommodated us without issue and also got our entire order correct!  Delicious food with a spicy Latin twist. Self serve chips and salsa bar was fun and unique also! Happy hour menu and signature margarita- yummy! Definitely a great place and will come again!",
   "I really enjoy this restaurant.  The owner is very friendly and the staff is nice.  I've been there a few times and the food is always delicious. I especially appreciate their salsa and salad bar. They also have a good selection of drinks.  I am always happy and satisfied with my visits.  I will definitely be returning. Thank you.",
   "The food was fabulous and the prices were reasonable.  My group included a vegetarian who said the vegetarian/vegan menu was one of the most extensive in town. The serving sizes were immense, and the staff will bring to-go containers without being asked. There is both a salad bar and a chips and salsa bar that are complimentary. We were served by the owner, who was friendly, courteous, and patient with all our questions. I seldom leave reviews, but this place rocks -- try it!",
   "nice place to go have a dinner,They have many options in Draft beer  And the menu they have so much options  And  Now they have vegetarian menu, Is very family oriented you can bring your kids.\n When I go to the restaurant I really want a cold beer and a good dinner and he called outings they have bought them I recommend this place to come over and try it."
  ]
 },
 {
  "name": "IHOP",
  "address": "3519 Martin Way E, Olympia, WA 98506, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/db1cb44a-9332-11ea-97f1-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "delicious",
   "food",
   "learn",
   "family",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=11084932715478480035",
  "source": "GoogleMaps",
  "reviews": [
   "Will never order from this store again. Staff and manager not helpful when we had a problem with our order. Wanted to hand it off to someone else even though it wasn't door dashes fault our order was wrong and very cold.  The food where in plastic containers that had so much  condensation in them everything was soggy and wet. \nWe just wanted to help the local businesses out in this time of need and enjoy a nice Sunday breakfast, but instead my husband spent his morning trying to get our order fixed and the kids ate cereal  \n next time I'll make our own breakfast",
   "Cant go wrong here.    Always friendly staff and delicious food.  Great breakfast.",
   "I've always loved it at IHOP watching my wife giggle about what devilishly sweet pancake plate she will have and the atmosphere is always light with friendly service.",
   "The restaurant decor and condition of the furniture is better than other IHOPs restaurants in the area.  I ordered the Colorado Omelette, but it did not look near as appetizing as the picture on the menu. I'll try to order something different next time. I also had the side of fruit, 3 of 3 of the grapes in were not fresh. Learn from me, order something.  😉",
   "EXCELLENT service by our waitress Lacy! Was very pleased with my savory crepes and my boyfriend got sweet strawberry crepes! Clean and cozy atmosphere, family friendly, and affordable. Will be back again!"
  ]
 },
 {
  "name": "Aya Sushi",
  "address": "1540 Cooper Point Rd SW, Olympia, WA 98502, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/db66b834-9332-11ea-882b-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16372136787978229310",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing sushi place! The staff is very polite, and my waiter even helped me decide what do order. Not only does it look beautiful, but tastes phenomenal. But, it does take some time for them to make it, so probably don't eat here if you have limited time.",
   "My new favorite restaurant! Super tasty sushi and a great atmosphere for a really reasonable price! \nYou can get a full plate of 7 to 10 pieces of delicious sushi for $10-15 — Fresh crab, tuna, shrimp, octopus, etc... \nReally, with how expensive seafood normally is at other restaurants, it amazing what you get. It's not a HUGE amount of food, but it's surprisingly filling and, more importantly, you feel great after eating! It has a refreshing and revitalizing aftereffect that you definitely don't get after eating a burger and fries at Red Robin.",
   "I have avoided sushi my whole life. This is great. They have so many different rolls. One fills me up pretty well. My favorite is the Ichi Roll- tempura shrimp, avocado, cooked shrimp on top, cucumber & a sweet sesame dressing. It's in a strip mall, but the interior makes you feel like you are in a nice restaurant. Now I crave it every week. They also have American food as well as lots of other cooked dishes to try if raw isn't your thing.",
   "Second or possibly third best sushi bar in Olympia after Sushi house and followed by Koibito which is only slightly behind. But still insanely good. Any of the top 3 would not be a wasted outing in the least.",
   "I used to go here all the time before the virus and  Service is top notch and the food is amazing. The inside is beautiful and the lighting is calm."
  ]
 }
]