[
 {
  "name": "Desert Botanical Garden",
  "address": "1201 N Galvin Pkwy, Phoenix, AZ 85008, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dbb4faf0-9332-11ea-b242-14b31f159f22.png",
  "tags": [
   "family",
   "walk",
   "unique",
   "learn",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2404053162249248023",
  "source": "GoogleMaps",
  "reviews": [
   "Our family loves coming here. It is relaxing, and so peaceful. We enjoy it so much that my fiance' proposed to me by one of the fountains, and it was the perfect setting. The roses were in bloom, hummingbirds zipping around us, and everything felt magical.  Plus, the garden has so many fun activities, and events. I mean... just look at all these snails! One of my favorite installations they've done.",
   "A unique botanical garden. It has something for everyone. It is quite extensive, so be prepared to walk! The butterfly exhibit is small but still worth a visit. \n\nThe location itself is quite scenic. Near by it’s the zoo and a few hikes that can be combined with while you visit it.",
   "Is a very interesting place to visit. So much to learn about the plant life in Arizona. We walked 11kms so be prepared with good footwear.  We also ate at Gertrude's restaurant there. There was a 30+ min wait as it was very busy but our server was very nice. The food was interesting and cooked well. Price was reasonable. Worth visiting for sure. Bring water (there are a number of filling stations to refill) and make sure you have a hat and sun block as it gets quite warm.",
   "Very pretty location. The scenery is absolutely breath taking. I would have to recommend to visit during the fall or winter time if the said person might be sensitive to the extreme heat we can deal with come summer time for the Phoenix metro area if you're not from the local area. \nVery family oriented. Friendly. Great atmosphere for anybody!",
   "One of my favourite places to visit whenever I go to Phoenix. I love the botanical plants for viewing and admiration.  Staff is friendly and positive. \n\nI visited in December 2018 where the scenery was much more lively. This time it’s quieter but fantastically enjoyable.  I haven’t tried their restaurants. Their gift shop and plant shop are available for browsing."
  ]
 },
 {
  "name": "Musical Instrument Museum",
  "address": "4725 E Mayo Blvd, Phoenix, AZ 85050, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dc097702-9332-11ea-9683-14b31f159f22.png",
  "tags": [
   "kids",
   "music",
   "music",
   "kids",
   "kids",
   "family",
   "music"
  ],
  "link": "https://maps.google.com/?cid=3729350831455392251",
  "source": "GoogleMaps",
  "reviews": [
   "A really neat museum! We spent about 4.5 hours here, could have probably spent a couple more! When you arrive, they will give you a set of headphones which will sync to the TVs so you can hear music samples which helped to understand the instruments and cultures, but all information was written out.  I would recommend especially for teenagers and above, some kids might be bored. But I would definitely recommend to people coming to the area-- it was an awesome stop!!",
   "EXCELLENT!!!\nThe museum is 1 of a kind. You need to see it if only once. Really takes probably 2 to 3 days to fully take it all in. Most importantly, it has one of the best concert venues in AZ. Smaller theater, great prices, every seat is a good seat and best of all --it has some of the best performances and performers from around the world.  Every genre of music is represented at 1 time or another. They probably have concerts at least 300 days out of the year. Check it out and hurry up and get on their mailing list😊.",
   "Just a brilliant way to spend your day.  The exhibits are so well put together.  We got there shortly after they opened and easily were there until they closed.  We didn't get to really spend time on everything.  A testament of just how much there is to see.  Definitely worth your time if you are in Phoenix.",
   "This museum is absolutely fantastic!  The flow of the museum is easy to follow. There is so much to take in.  If you are a true musician, you probably want to plan on a whole day (or maybe two). We had three children with us.  The middle-school aged kids enjoyed about 3 hours.  The instrument room where we could play instruments was awesome!  This museum is really amazing.",
   "This museum is fantastic! The flow of the museum is easy to follow. Great musicians at the shows! Skills and activities for the children and a large area for the kids and adults to play with the instruments. You will be enthused to play several instruments.  Enjoyable for the Whole Family. It is Lovely to see how Music Transcends and Unites us all."
  ]
 },
 {
  "name": "Phoenix Zoo",
  "address": "455 N Galvin Pkwy, Phoenix, AZ 85008, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dc5378a8-9332-11ea-9420-14b31f159f22.png",
  "tags": [
   "learn",
   "unique",
   "kids",
   "tour",
   "kids",
   "walk",
   "tour",
   "family",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7252865776953727344",
  "source": "GoogleMaps",
  "reviews": [
   "This zoo is such a great place.  Young and old, day or night, every season of the year there is ALWAYS a reason to visit the Phoenix ZOO!!!  They have so many opportunities to learn including SLEEPOVERS for school kids.  Parents, don't despair, there are evening events 21 and older.  Year round this is a great place to celebrate, stroll, enjoy!  EVERYONE who works at the zoo is always smiling or laughing...I think we could all benefit from spending time with furry, feathered, scaly and unique new friends!",
   "This is by far my favorite zoo I have visited! Me and my mother made a last second decision while on a trip in Phoenix (2017) to find something fun to do. After finding this place we decided to make a day out of it and both had an amazing time seeing the large array of animals they had here.\n\nBy far a massive highlight to our trip! Tons of animals, educational facts along with many cool attractions throughout the park had us entertained till the park closed.\n\nWould highly recommend to anyone in the area looking for a fun day!",
   "Great place for locals or visitors. Wide array of animals, beautiful settings in the hills of Phoenix which make for a picturesque visit.\n\nThe zoo itself is very easy to navigate, well signed and lots to do for kids and adults. The guided tour which also includes a 4D movie is a nice add on as it helps to layout the zoo and gives you a general sense of where everything is.\n\nHighly recommended if you're visiting Phoenix or if you've never been and are from the area.",
   "Love coming here. The upgraded pass is well worth the price. The camel ride is always fun and offered a picture package for an additional cost. The tram tour is an excellent way to see most of the park, and save yourself the walk. Sting ray bay is also included, and allowed us to pet a sting ray. Great family day trip.",
   "Great VALUE for the money. This is not a 5 star zoo, but the value you get for the money makes it a 5 star rating. The flow of the park’s setup keeps children and parents interested and entertained, even for those with short attention spans. They have a nice children’s playground and designated play area with a concession stand, which is all conveniently located tougher with a 30 second walk to the petting zoo. Prices are good when compared to other entertainment venues in the Phoenix / Scottsdale area. They offer great discounts for veterans as well. If you have children I definitely recommend going at least once and then determine if the discounted year passes are for you/your family."
  ]
 },
 {
  "name": "South Mountain Park and Preserve",
  "address": "10919 S Central Ave, Phoenix, AZ 85042, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dca645cc-9332-11ea-89cf-14b31f159f22.png",
  "tags": [
   "free",
   "nature",
   "walk",
   "structure",
   "active",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7241350686142470773",
  "source": "GoogleMaps",
  "reviews": [
   "There are lookouts facing north right when you pass the entrance and horse stables. Those are nice and have tons of seating for parties or gatherings. But if you have the extra 15 minutes, keep driving up the winding road until you get to the big lookout spot. The view is incredible. There were vendors selling handmade native jewelry, nothing over $50 and most items $10-20. It was windier and colder there. There are dozens of hiking trails. Just a great way to escape and enjoy nature for free.",
   "South Mountain is a great place for all to enjoy the wonders that God has created. The rocks; the cacti; the wildlife: it’s a genuine desert adventure in the heart of the southeast valley. Bring some snacks and plenty of water, and be sure to take sun protection seriously. Be nice to the wildlife—respect their home, as you would want your own home respected; if you see a snake: leave it alone and walk away safely.\n\nHave a great time and be blessed always 👍",
   "South Mountain Park spans around 16,000 acres and consists of three mountain ranges. It is ideal for cycling, hiking, road drive and horse riding. The highest point in the park called the Dobbins Lookout offers stunning panoramic view of the valley. A stone structure at the top offers shady seating, and a small observation platform identifies various Phoenix landmarks visible from the view, including Camelback and more local mountain ranges. I loved driving to the top of the park enjoying the scenic views in the evening. My trip concluded by watching the beautiful sunset at the Dobbins Lookout.",
   "We hiked Mormon Trail to Hidden Valley Trail and through Fat Man's Pass.  The first part was tough because it was a steep elevation gain but it got easier at the top and was well worth it.  We are in our 50s and we are active but I would not say we are especially fit.  The trail is clean, well marked, and the views of Phoenix and Tempe are gorgeous!  It took us a few hours to complete.  There were other hikers (all ages and some with dogs) and mountain bikers but not so many that we didn't get to proceed at our own pace.  Beautiful trail!!  Will definitely do it again.",
   "Take the drive up to Dobbins Point and walk to the covering. The view is fantastic and the pictures are beautiful. You can see all of Phoenix including downtown. Stop on your way back at the compass at the top of the hill and see if you can find the items listed in the skyline. We loved it here!"
  ]
 },
 {
  "name": "Heard Museum",
  "address": "2301 N Central Ave, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dcf1011c-9332-11ea-a80b-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "history",
   "unique",
   "free",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15873792203703506722",
  "source": "GoogleMaps",
  "reviews": [
   "Exceptional museum that totally surpassed my expectations. They had a great deal for students—I think I paid $9 with my student ID—but I would have happily paid the full price considering the quality of this museum. The exhibit on the boarding schools is probably worth the price of admission alone—a well thought out, immersive, informative, and heartbreaking exhibit.  Only downside was one of the tours we joined had a docent that I would describe as...under-informed—we quickly darted out of the [free] tour. They had quite a few going all day and I'm sure many of the other docents are great we were just a little limited on time. All in all, this was an incredible visit and we both agreed one of the better museums we've visited recently, highly recommended!",
   "I loved that it's  centrally located  in Phoenix .\n\nThe American history, especially that of the first Americans, the Native Americans! I am so proud to be a small part of their land! As for myself, being a descendant from both polish and French ancestors, that I had the the opportunity to see cultural Native Americans rituals and many talents displayed in such a large foot print.\n\nOn a business office matter, when a visitor comes in with only an hour and 12 minutes left to go through the whole museum before closing, that the front desk might have mention that I could have come back another day... FYI",
   "We were fortunate enough to visit during the Hoop competition. Coming from Ohio, it was a great and unique experience to see Native American culture in action. The museum itself had a very nice mix of contemporary and older arts and crafts. I really enjoyed being able to see the variety of artistic styles found throughout the southwest.",
   "The Heard Museum in Phoenix is wonderful place that honors Native American history, while educating others about their rich heritage. It is also important for people to realize the true struggles Native Americans had, and the wrong that was done it them. There are displays that will blow your mind with their beautiful and detail, and others that will break your heart. Free nights are available so everyone has the opportunity to go. You will have a Lovely evening here!",
   "Plan to spend at least 3 hours here. They are wonderful docent tours. And special exhibits Change frequently. . If you're going to be in the Southwest. You have to see the history of the place. The native population is rich in history."
  ]
 },
 {
  "name": "Phoenix Mountains Preserve",
  "address": "2701 E Squaw Peak Dr, Phoenix, AZ 85016, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dd413424-9332-11ea-bd5e-14b31f159f22.png",
  "tags": [
   "family",
   "tour",
   "hike",
   "hike",
   "hike",
   "family",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=768664447671239094",
  "source": "GoogleMaps",
  "reviews": [
   "Good hiking at Dreamy Draw recreation area during weekday. Several trails here, easy to moderately difficult. Expect washes, loose rock & gravel, no paved trails. A few mountain bikes,  mostly family hikers, many with dogs. No powered vehicles. Nice concrete parking area. Restrooms typical of public park but well maintained.  Can become congested during peak hours on weekends.",
   "Went here for a tour. Nice little hike where you can see a beautiful sunset. Would recommend going up around 5pm! Beautiful view of Phoenix. Was told this place was the exact middle of Phoenix. If you are looking for an easy hike with a beautiful view, check this place out!",
   "Hiked the summit trail (300) this is a challenging and steep hike. Lots of rock face and steep drop offs. The reward is a beautiful view and a short rest before heading down.\nThis trail is narrow at points so choose rest points wisely (benches at various spots) so not to create choke points for runners.\n\nRecommend this trail enthusiastically, great \" in city hike\"....",
   "Great place for a hike or family gathering. The facilities include benches, picnic tables and restrooms. Very clean. Restoration or construction is happening at one of the spots and that does not interfere with daily activities at the park.",
   "One of the most beautiful views I've ever seen, and it's so close to the city. Great place to hike, with many different trails that take you up all the mountains. It was a beautiful spot for a day trip!"
  ]
 },
 {
  "name": "Hole in the Rock",
  "address": "625 N Galvin Pkwy, Phoenix, AZ 85008, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dd842dc8-9332-11ea-92fe-14b31f159f22.png",
  "tags": [
   "kids",
   "hike",
   "kids",
   "hike",
   "walk",
   "hike",
   "history",
   "walk",
   "hike",
   "family",
   "walk",
   "adventurous"
  ],
  "link": "https://maps.google.com/?cid=385298564104506413",
  "source": "GoogleMaps",
  "reviews": [
   "This is an easy hike that you can even take kids on! There is a great view as well as plenty of bike trails, picnic tables, and flora to look at! This is also an ideal spot to see the sunset and moon rise! You can even go down by the water and see ducks and geese! It's very peaceful here!",
   "This is an easy hike with plenty of parking and fairly easy hiking around the mountainous area. Beautiful views at sunset and a short enough hike that sunset can be enjoyed in the hole and still hike down safely. Can be slick in a couple areas and is often crowded so leave yourself enough time to enjoy the hike. Kids loved the hike as well.",
   "Really amazing and tranquil place. Rich with Native American history. Beautiful park to hike and bike. The rock formations are gorgeous. The colors and textures are just spectacular. I highly recommend coming out for the day and just enjoy the beauty here. Climb up Hole in Rock, walk around the park or just relax and soak in the sun.",
   "Awesome place to take a walk, chill on the rock and watch the sunset. The hole in the rock is obviously a main attraction, but there is more to do around. You can find some lovely spots for pick-nick, relax by the water, ride a bike or hike to the pyramid tomb. Fantastic place to spend time with friend, family, walk your dog or read a book by yourself. Highly recommend to check this out.",
   "It is a great spot to watch the sunset with a beautiful view of Phoenix. It does get really busy so get there a bit early to have a nice spot. Very easy walk up. If you are a bit more adventurous you can climb up on top of the rock as well."
  ]
 },
 {
  "name": "Japanese Friendship Garden of Phoenix",
  "address": "1125 N 3rd Ave, Phoenix, AZ 85003, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ddd8d3a2-9332-11ea-83e1-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17408193586874965605",
  "source": "GoogleMaps",
  "reviews": [
   "This place is serene. Best come when it first opens so that you avoid the crowds. Quite peaceful here. A nice place walk, meditate, go on a date, or just come just to be outside and enjoy the outdoors. The fish and ducks are fun to watch.",
   "My boyfriend and I visit the garden here and there because it's a beautiful place and it's in our neighborhood. however I attended a wedding there last weekend, and I am appalled at how the bride and groom were treated, and frankly a little embarrassed. Embarrassed because I was excited to have them in my neighborhood, experiencing the garden and starting their lives together in a place I really love. \nHere's what happened. Wedding is going great, cocktail hour started, dinner and dancing all going great and then the cops arrive.... that's right the garden director called the police because the groom walked into the dressing room to find a garden employee rummaging through all of the bridal parties belongings... he asked what are you doing??!! Apparently that's a hostile response and that's why the police were called... the director threatened to shut down the wedding and kick everyone out... are you serious??! The grooms wrist watch is missing along with $1000 cash. \nThe garden is refusing to give their $500 deposit back because they had to call the police ... \nSo let's recap...\nBeautiful place \nGarden employees rummaging through belongings\nGroom asks what the heck??\n$1000 cash and a wrist watch missing \nThreats to shut down wedding and kick guests out  \nPolice involved (they were super cool by the way)\nRefusing to give bride and groom their deposit back...\n\nStill want To book your wedding or event at the garden? \n\nThis whole situation just makes me really sad because like I said I really loved that place, however the way my family was treated is completely unacceptable.",
   "Very serene.... this is a really calm area, and they have many authentic Japanese attributes. Reading about their history, you discover just how much effort and planning went into this garden, by not the city of Phoenix and it’s sister Japanese city. \n\nBeautiful scenery, a large koi pond and even a waterfall!! \n\nHave been to several Japanese gardens over the years, and this is one of the larger ones and the only one I’ve visited with a waterfall. \n\nThey do ceremonies, including cultural types. Check their calendar.",
   "This little piece of Japanese culture nestled right in the middle of the concrete jungle, surprisingly is so serene and full of peace. They have done a wonderful job of bringing Japan to Arizona. This is a great place to let go of your daily stressors and just breathe. We did do the tea and enjoyed the explanation of the culture. This will be a definite repeat experience for me.",
   "Completely serene. Hidden sanctuary away from all the hustle and bustle of the city--right in the heart of Phoenix! It's literally a wonderful change of pace from the time you enter to the time you leave. Fascinating history to the garden as well. There needs to be more of these..and bigger."
  ]
 },
 {
  "name": "Children’s Museum of Phoenix",
  "address": "215 N 7th St, Phoenix, AZ 85034, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/de345588-9332-11ea-a382-14b31f159f22.png",
  "tags": [
   "kids",
   "structure",
   "walk",
   "kids",
   "food",
   "learn",
   "kids",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1388682273556104679",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for the kids, lots of different activities for them to enjoy. You can easily spend 2 hours (or more) having the kids constantly engaged and busy the whole time.\n\nFrom a large climbing structure, to pretend kitchen with loading dock, wooden cars, pool noodle maze and a handful of other activities, it was a hit for our group.\n\nHighly recommended for visitors and locals.",
   "Love it here! This is one of those places that my kids LOVE to come to! We have a season pass and come often. The kids love getting to shop in the grocery store, check out and even unpack while reloading the food. There is a fun ice cream stand where the kids get to pick their flavors and serve them up. Our favorite part is the noodle forest! A forest full of pool noodles! It is the most super awesome just make sure you walk and don't run!",
   "My son and I spent a few days here and for him not to get bored, I search for a playroom nearby and I found this. I then decided to check out the place. It was fun and had a nice variety of science exhibits with hands-on activities and things to learn about. I super liked it and so my kids. The children are learning while playing and that's really great!",
   "This place is absolutely fantastic!!!! If you’re in the area with little ones, you have to go. \n\nBeing that the weather wasn’t great on our vacation we needed to find some indoor activities for my toddler to keep her busy. \n\nWe spent hours here (you could spend an entire day). All 3 levels were packed with fun stations that my 2.5 year old thoroughly enjoyed. Though it would be fantastic for any age. \n\nThey even have a spot for younger children that is great too. \n\nHighly recommend!",
   "Great pace for toddlers are even babies to enjoy! They have a small area for babies to crawl and play. My 2 year old daughter spent about 2 hours here playing and we still had to drag her out. The museum isn’t really a museum it’s more like an indoor playground. The restrooms are also made for kids too since they have toilets easily for kids to reach and sinks at a lower level. They sale food and have a outdoor play area as well. Definitely recommend!"
  ]
 },
 {
  "name": "Echo Canyon Trailhead",
  "address": "Unnamed Road, Phoenix, AZ 85018, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/de75b310-9332-11ea-8524-14b31f159f22.png",
  "tags": [
   "hike",
   "adventurous",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=11691523250841911723",
  "source": "GoogleMaps",
  "reviews": [
   "I went hiking with a friend about a week ago when the weather got nice and I can honestly say that this is the best place that I have flown  my drone in all of Phoenix. The views are incredible the entire trail and there are plenty of different spots to pull off and hangout. I highly recommend checking this place out whether you are in the area or are looking to make a trip!",
   "What a great hike! Definitely a bit challenging, there are areas of sheer rock, thank goodness there are handrails to hold onto. Parking can be challenging, but the view at the top is worth all of it. Wear shoes with a good grip, that will make it much safer. The entire hike took me an hour and half, I went at a steady pace and didn't spend much time at the top. I will be making this a weekly workout, it's so much fun and the views are fantastic!",
   "It is a great place to explore with nice views of the surrounding area.  There is parking along with a bathroom at the bottom and even an opportunity to buy a water if need be. The trail starts off fairly easy with a gradual incline which gets steeper as you go. Then advances to a place where only more adventurous hikers would dare tred.",
   "Beautiful, but tough. Based on reviews I figured this would be difficult, but I still under estimated it. I got about a half mile in before I turned back. Partly due to time constraints, but mostly I wasn't prepared. I'd love to make the summit. Maybe another time when I'm in better shape.",
   "Great PHX hike. Recommended for experienced hikers as it is a double black diamond very difficult rated hike with climbing. Be prepared with the right footwear and water. Very beautiful at the top!"
  ]
 },
 {
  "name": "Castles N' Coasters",
  "address": "9445 N Metro Pkwy E, Phoenix, AZ 85051, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dee41f9a-9332-11ea-911d-14b31f159f22.png",
  "tags": [
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=14386602448939149210",
  "source": "GoogleMaps",
  "reviews": [
   "Lots of fun going to Castles N’ Coasters!  The most fun probably, was the sky obstacle course, only I don’t see any photos of that on my phone. I’ll have to see if anyone else has some so I can post them later. We had a really nice evening, even though it was at the end of a really long and eventful day. I would highly recommend anyone looking for fun, to visit this Castles N’ Coasters. There’s more to do than we had time for. I’m sure if you started I’m the morning and stayed until late, you could pretty much get everything into one day. Come see for yourself!",
   "Enjoyed Playing Miniature Golf with my Teenagers. The Good  Maintenance and Upkeep on the Course Made our Weekday Visit More Enjoyable. \nFew Activities were Open on the Weekday Yet We Still Had a Great Time in the Arcade, the Go Carts, Water Bumper Boats and Miniature Golf. Reasonably Priced and No Lines! Their Hot Dogs are Pretty Good Too!",
   "Castles N' Coasters is a Phoenix amusement park mainstay of cultural history. If you enjoy the Phoenix Fairgrounds, you can't disrespect the phenomenon that is Castles N' Coasters. They have updated their greens and keep their arcades working to the best tech top conditions! My wife and I enjoyed the mini golf, arcades, and the sweet shaved ice treats! Check out this Phoenix wonder for yourself!",
   "Definitely a 4.0. I would rank it higher, if they didn't charge water for 4 dollars. Quite a lovely place to spend with friends and family, especially for a birthday party. Bit too crowded but that means people love it. Favourite ride was magic carpet if you want a suprising magic ride. If you want a bit more adventure, try the Skydiver or the Sea Dragon: both are not for the faint of heart. I would totally go again!",
   "I love coming here. Many mini golf courses to choose from and the rides are excellent. If your looking for a fun little roller coaster day and arcade without driving to the next state this would be a lovely stop. Also excellent for birthday parties for the little ones"
  ]
 },
 {
  "name": "McCormick-Stillman Railroad Park",
  "address": "7301 E Indian Bend Rd, Scottsdale, AZ 85250, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/df2daab8-9332-11ea-8766-14b31f159f22.png",
  "tags": [
   "free",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=11838393876984897347",
  "source": "GoogleMaps",
  "reviews": [
   "Super fun park in Scottsdale. Great place to take a grandchild for a few hours of happy time. Take a sweet train ride around the park. Then do the carousel for more fun. Nice little snack shop for ice cream. \n Best part is the interactive train museum .. what a treat! So well done, I could spend hours discover more scenes . Volunteer on hand to explain the various engines etc.",
   "This is a very nice park. Plenty to enjoy for free. It’s only about a mile from my house and my 2.5 year old loves it. The concession prices and rides are very reasonable. The facilities are clean the playground is great. Highly recommend if you’re in Scottsdale with a child. The train ride and carousel are very well run and inexpensive. Recommend the $10 bracelet if you want to do multiple rides.",
   "What a gem to have in our city.  A place every child should frequent.  It's a great park,  has fun toys, wide open grassy areas, fun for all ages.  I like that you can buy a pass or just individual tickets.  The mini museum is always neat, again for all ages.  Perfect birthday spot. I haven't been to any concerts but it's on my to do list",
   "We love going to see the miniature trains, ride the big train, and the carousel. The park is so fun for the kids to play on and there is tons of grass space to run around. It does get crowded because it's such a popular park for families. Go early and enjoy!",
   "Th McCormick Stillman railroad is great for all ages. We took our 2 year old and enjoyed the train ride and carousel for a few dollars. It's free to go in and you only pay for what you do. The museum was very informative and fun for adults as you get quite the learning experience about trains. Our son absolutely loved the model train next to museum. He ran around making the trains go for about an hour. Afterwards, we all enjoyed ice cream at the snack bar."
  ]
 },
 {
  "name": "Piestewa Peak Park",
  "address": "2701 E Squaw Peak Dr, Phoenix, AZ 85016, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/df790c0c-9332-11ea-a116-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "music",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=4692605992828950655",
  "source": "GoogleMaps",
  "reviews": [
   "Great hike! Felt like a staircase most of the way up! The path was very well done, though things do get a bit more steep at the top. The path itself has been manicured and is much more defined in comparison to Camelback. It's a lot less crowded and parking is easier. A lot of different hiking path options here too. Definitely coming back!",
   "What an amazing and awesome place! Had no idea that it would draw so many people from so many different languages and national backgrounds. Families on outings from toddlers  to elders and all mix in between were like pilgrims on a mission to touch the sky. Looking up to the highest peak you could see people up ahead on the trail like ants filing past in a steady flow on humanity. It was beautiful to behold.",
   "Lots of trails form easy to hard an app all trails makes it easy to see the trails but don't depend on your phone just follow the markers keep vigilant some trails are dog friendly and others are not. Take plenty of water for your hike take some snacks. Better to be over prepared than under. Have fun and enjoy it so much beauty sometimes you see nothing but mountains when at the top you can see down all around. This is trail 304 and then 8A I've gotten turned around on this one but only because I was running it and listening to music.",
   "Loved our 4.5 mile hike on the Freedom Loop! Just the amount if challenge we were looking for. Stunning desert beauty all around! We especially enjoyed the quiet solitude of the \"back half\" of the loop; the forward-facing side was very busy this Saturday afternoon",
   "Met so many nice people here. Parking is excellent, they just renovated it recently and made it so much more accessible. The hike can be hard if you don't take breaks but otherwise you'll be able to reach the peak in about an hour"
  ]
 },
 {
  "name": "Phoenix Art Museum",
  "address": "1625 N Central Ave, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dfbec794-9332-11ea-9706-14b31f159f22.png",
  "tags": [
   "art",
   "affordable",
   "walking",
   "family",
   "art",
   "art",
   "history",
   "family",
   "art"
  ],
  "link": "https://maps.google.com/?cid=9100201502871915249",
  "source": "GoogleMaps",
  "reviews": [
   "Toured the museum today with friends to take advantage of two current exhibits - Legends of Speed, and renowned photographer Ansel Adams. This museum is \"easy to do\" - meaning large, bright, comfortable, well-laid out, and very importantly, an attentive watchful staff and security personnel who are not overbearing or \"in your face\" as can happen (and has happened to us) at other large city museums. The rules are clearly stated and as long as you follow them, you will be left to yourself to experience all that the museum has to offer. Our drive was one hour, and after walking for a couple of hours once there, we soon worked up an appetite and dined (with reservations - I recommend you do this) at the on-site high-end Palette Restaurant - another satisfying experience by the way. The Legends of Speed exhibit was superbly set up and worth the trip alone for us. The Ansel Adams exhibit, while small, offered an unexpected perspective of the famous photographer's work - multiple renditions of the same image but with different darkroom techniques applied to draw the eye to different objects within the photo, in effect, showing us how Adams not only mastered his subjects at the time he captured the image, but also how he masterfully manipulated the images technically to achieve a slightly different outcome, at a time when photography was very basic. Entrance fees are quite affordable and they even host days during the week where those with small budgets for this type of experience can pay what they can afford to get in. Phoenix has no shortage of great venues, and the Art Museum stands out, at least to me, as one of the top 10 venues to visit.",
   "This is a great place for not only family, but even for yourself! Enjoy the beautiful art and uniqueness that is shown on every wall. Even a 7 year old can be amazed by all there is. There is even a special room to explore which will amaze all ages and open one's imagination",
   "Fantastic world class museum in the heart of Phoenix. I visited the museum for the Legends of Speed exhibition and it was very well executed. Vehicles were well positioned, perfectly lit, and had great blurbs describing their significance in motorsports history. The rest of museum was very interesting as well with good mix of art pieces from all over the world.",
   "An awesome place for the whole family. I came over from San Diego to visit and had a great time. I would highly recommend it on your next trip to Phoenix.",
   "We really enjoyed our time at the Phoenix art museum. They have many beautiful exhibitions and great place to relax. Definitely worth visiting."
  ]
 },
 {
  "name": "Arizona Capitol Museum",
  "address": "1700 W Washington St, Phoenix, AZ 85007, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e002fcc6-9332-11ea-b826-14b31f159f22.png",
  "tags": [
   "free",
   "art",
   "learn",
   "knowledgeable",
   "history",
   "free",
   "tour",
   "field",
   "kids",
   "walking",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8369928824109305006",
  "source": "GoogleMaps",
  "reviews": [
   "Neat place to visit with exhibits on every level.  I really liked the 1st floor art gallery which has some large colorful paintings by Frank Ybarra on display until March 31st 2020. There is a free parking lot just to the east of the capitol complex, and in the adjoining park there are a number of sculptures and memorial displays, including a full-sized outline of the USS Arizona.",
   "I wanted to stop at the Arizona Capitol Museum during our trip to Phoenix to learn some Arizona history and it was such a great idea! You can get a free tour on fridays at 130 I believe, check their website to be sure. It is such a cool, old building with lots of exhibits inside. The tour guide was knowledgeable and entertaining. A great educational tour for trip!",
   "Its all well kept and clean. I went to do some advocacy work on bills but also had a great time walking from building to building. There were kids on field trips and even some families taking a look at monuments nearby and going around the buildings.",
   "~AZ proud of that beautiful Capital building and the grounds, love all the tributes for our fire fighters, AZ law enforcement office all who gave their life for others. Very nice place! AZ proud!",
   "The Silver Service that was given to the USS Arizona ,upon its' commissioning ,from citizens of Arizona resides in a viewing room here at the Arizona Capital building. So much history displayed all through here. I have enjoyed throughly all 5 visits. Nice display on the Merci train boxcar sent to Arizona after WW2, from citizens of France.  Arizona's territorial history was engaging and interesting.  This place is a must see when visiting."
  ]
 },
 {
  "name": "Pueblo Grande Museum",
  "address": "4619 E Washington St, Phoenix, AZ 85034, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e0505b02-9332-11ea-8424-14b31f159f22.png",
  "tags": [
   "history",
   "field",
   "learn",
   "history",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=5985020774379278263",
  "source": "GoogleMaps",
  "reviews": [
   "Ancient and amazing site!  There is a walkway which leads to the various outdoor exhibits.  The Pueblo Grande commands the whole exterior. The Museum is located near the Phoenix Sky Harbor and is surrounded by tall offices and hotels.  Quite a contrast between the Pueblo and the development.",
   "A small but important site right in Phoenix. Very much a worthwhile cultural stop for history and a look at the lives of early native peoples here in the valley.",
   "Great place to visit before having to head back to the airport. Great museum and cute gift shop. Admission is $6, which is worth the admission and support of the museum. Enjoy the trails that have the remains of the former settlement that was here. Plan for at least 2 hours, unless you’re a nerd like me who wants to read everything in the museum.",
   "Nice place to go and learn some local Native history. Good place to bring children individually or on group field trips.",
   "A hidden gem. Easily accessible from the light rail, totally affordable and small enough to be enjoyed in less than 2 hours, the small outdoor museum is a great way to spend some time outdoors in Phoenix."
  ]
 },
 {
  "name": "Mystery Castle",
  "address": "800 E Mineral Rd, Phoenix, AZ 85042, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e096b2f0-9332-11ea-aa5c-14b31f159f22.png",
  "tags": [
   "tour",
   "historic",
   "art",
   "tour",
   "tour",
   "unique",
   "unique",
   "family",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=16061788560566110820",
  "source": "GoogleMaps",
  "reviews": [
   "I took my senior community residents for a tour here today!  So worth the small $10 cash admission!  The house is a piece of unusual art full of interesting decor and memorabilia.  Both of our tour guides Ramone & Juan Carlos were exceptional guides full of stories and humor.  My residents absolutely loved the tour of this historic treasure! Thank you for sharing this with the world!/ Barbie with Sunrise Village",
   "Take cash the tour is cash only so if you make the journey out there and you don't have cash there's not much you get to do. My review is based off this no cash scenario because it's 2020 and who doesn't take other forms of payment besides cash??? The answer is this place, the mystery castle... That was the first mystery we ran into. The second mystery was if we were going to come back with cash? and that mystery was quickly solved... NOPE! A return trip for a mystery castle that should have been more fittingly named mystery hovel  was not in order for today! So the secrets held within this shanty will remain secrets to us forever more.",
   "This place was so great! I had no idea it existed and a random Google search brought it into my life. The tour guide obviously got a kick out of the place too, even after hundreds of tours, and that really made a difference. Def recommend a visit!",
   "The Mystery Castle is a unique, off the beaten path kind of attraction. The story is great about how a father with TB came to Phoenix and what he built for his daughter. The daughter, as eccentric as the dad, did some of the decorating and together they made a great place for people to visit.",
   "Fun place to enjoy some old Phoenix history and see some unique architecture and engineering that reflects a great family story. Juan Carlos was our tour guide and does an awesome job. Also found out they do weddings in the chapel."
  ]
 },
 {
  "name": "Hall of Flame Fire Museum",
  "address": "6101 E Van Buren St, Phoenix, AZ 85008, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e0ed2aec-9332-11ea-8cc1-14b31f159f22.png",
  "tags": [
   "history",
   "walking",
   "kids",
   "learn",
   "tour",
   "history",
   "history",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15381242960165469524",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice museum with about 100 fire apparatus, from walking to trucks.  Oldest is from 1726.  All in great restored condition.  Most if not all look better than day they were delivered to the fire Department. \n\nHonor hall for fire fighters lost in line of duty.  History of Smoke jumpers.\n\nMy Dad enjoyed it.  He is a former Portland, Oregon firefighter.",
   "We ended up going here [2 grandparents, 2 parents and 3 kids] because it was the only one open at a convenient time for us.  Boy were we astonished! Five giant rooms of fire trucks, some 300 years old, all beautifully restored. Also a detailed guidebook explained each one. Plus a small theater rain a video about the museum's foundation. The kids loved it! A large fire truck to climb on/in, firefighter clothes and hats to try on, all sorts of firefighter toys to play with in the kids' area. Plus docents around to explain everything and give demonstrations. We could have spent all day there.",
   "Loved this museum dedicated to the history of American heros, our fire fighters. This museum is packed with fire trucks from years gone by. All are in beautiful condition. The self guided, self explanatory tour is easy to follow and extremely informative. The size of the museum is overwhelming. There is even a children's section. There is a gift shop which has some really neat things as well. The staff  are very friendly and helpful. If you ever wanted to be a fireman as a kid or just want to see an amazing tribute to a noble profession and learn something on the way, I highly recommend visiting the museum if you're in the area.",
   "My wife and I visited the Hall of Flame a few weeks ago and although we had heard how nice the museum is, we were amazed at the amount of detailed history of the fire service we saw. \nWhen we got out of our car we were greeted by the museum supervisor. The staff was overly cheerful and welcoming. \nI was a fireman and appreciated seeing the engines, trucks, equipment and methods that were in use during the time I was involved in the fire service. This place has something to offer everyone even if you have no direct connection to firefighting. The Hall of Flame is a super educational experience. We spent 4 hours touring the exhibits and have already talked about returning for another visit someday. \nThe gift shop is filled with items to take with you to remember the day.",
   "Took the guided tour! Incredible history of fire fighting equipment dating back to the 1700s. Every firetruck is immaculate and preserved with care and love. Tribute is paid to those who  made the ultimate sacrifice including those on 9/11 and the Granite Mountain Hotshots."
  ]
 },
 {
  "name": "Sahuaro Ranch Park",
  "address": "9802 59th Ave, Glendale, AZ 85302, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e1378eac-9332-11ea-82a2-14b31f159f22.png",
  "tags": [
   "tour",
   "historic",
   "family",
   "library",
   "history",
   "tour",
   "library",
   "library"
  ],
  "link": "https://maps.google.com/?cid=12960466992835098622",
  "source": "GoogleMaps",
  "reviews": [
   "This is an amazing little park. There are some historic ranch homes which you can do a self guided tour of, a gorgeous Rose garden, a Grove, and little shaved ice stand. Often times you will also see peacocks running around which definitely adds to the experience. There is also a park behind it with grills, plenty of sitting areas, and playground.",
   "I love the tranquility and peacefulness of the park there's lots of space lots of room for exploring. Several BBQ pits and tables along with play grounds for friends and family to join together. There's also Sports complexes near,  all around you can find fantastic trees and grass I really like it here I will come back tell a friend. My favorite part was the Rose Garden alright everybody making your way down and enjoy. Such a beautiful experience for the holidays!",
   "We really like this park - it has a ton of different things to look at, and there's a ton of history. It's a fantastic place to take pictures, and we see people there taking all sorts. It's a fun place to play Pokemon go out have a birthday party! It's also right next to Glendale's library, and there's some gorgeous peacocks that live there. It's great any day if the week!",
   "It's a big park with a huge Ramada with grills along with picnic tables around the park also with an individual grill. There's several separated playground equipment, one area designs for toddlers, one with sand, and two with wood chips. There are plenty of large grassy areas. There are two restrooms. It is close to a bunch of historical buildings that you can actually schedule a tour for and then only a short distance further is the main Glendale library. It's easy to spend the whole day there.",
   "The grounds were quite quiet. The buildings all locked. The citrus trees were nice and the two peacocks were stunning. BUT the Library, next door, had dozens of peacocks in their back gardens! THAT was amazing!"
  ]
 },
 {
  "name": "Arizona Science Center",
  "address": "600 E Washington St, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e18dcd48-9332-11ea-9132-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=17330222221209878489",
  "source": "GoogleMaps",
  "reviews": [
   "By far one of my favorite museums in Arizona! It was super fun as a kid and is super fun now, too. It's so big, I don't think I've ever covered the entire museum in 1 day. Prepare to spend a lot of time in there, as you'll probably need 4-6 hours if you want to look at everything and not speed through. I love how they have a specialty exhibit that changes every 9 months-ish. Last time I went it was an Egyptian mummy exhibit! Highly recommend.",
   "It's was awesome!! My 3 year old son and I loved it. Only if we would have arrived earlier, we would have had more time to get to enjoy everything. But the best part was, well, EVERYTHING!! 😃 We will definitely be going back soon.   Oh and the best part was THAT YOU ONLY HAD TO PAY 3$ WHEN YOU SHOW THEM YOUR EBT CARD!! Great deal compared to 16$ admission.",
   "An attraction that taught science in a fun and interactive way. We came here years ago when our kids were small and had a great time. Our kids are adults now and this vacation we had no kids to bring so this visit was just the two of us. We thoroughly enjoyed all the exhibits from top to bottom. Since we purchased tickets to the planetarium show later in the afternoon we decided to start at the top floor and work our way down, ending the day at the bottom level which was the largest floor. The top floor had exhibits about the environment and education on recycling, solar power, and alternative energy sources. The exhibits weren’t just informative, but fun. The kids that were there flipped switches and rode bikes to see who could generate the most energy. Without kids we were able to spend our time reading all the information. The next two floors had info on weather (with a demo on what it’s like to be in the midst of a storm) climate, and a new dinosaur exhibit. Our favorite floor was the bottom floor with an amazing interactive look at the body. We probably could have spent the whole day here. We finished the day at the Volcano show in the planetarium. It was good but short. I’d definitely recommend this center for visitors of all ages and give yourself at least 4 hours to go through it all. We intend to come back again.",
   "There was so much to see and never a boring minute! The Victoria dinosaur exhibit as INCREDIBLE and that alone was worth the cost. Which wasn’t bad at all. Every corner had something to see and do. Everything is hands on and I recommend this for ALL ages.",
   "The Arizona Science Center is a gem in the heart of downtown Phoenix. Filled with many different areas to explore, this is not a place to only come to once. You could spend the entire day there and still not see everything. For that I suggest buying a membership so that you can enjoy this place of wonder and discovery. Don't forget to check out the planetarium, theater, and traveling exhibits. The Arizona Science Center is sure to capture the minds of all who enter."
  ]
 },
 {
  "name": "Rosson House Museum at Heritage Square",
  "address": "113 N 6th St, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e1d01a8c-9332-11ea-a7bd-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=4469686075119272667",
  "source": "GoogleMaps",
  "reviews": [
   "The tour guide was very informative and knew a lot about the history of not only the house, but also the history of Phoenix and the time period. Very cool I highly recommend to visitors and locals.",
   "Beautiful historical house. Several original items in the house. Guided tours hourly. A journey  to the past. 19th  century house. Paid parking nearby. USD 10 admission fee.",
   "Really Interesting vintage house in Heritage Square.  To visit, you must go on a tour (about 45 minutes) but well worth it. You can book in advance at their website or on site.",
   "Excellent example of the Victorian style home of the late 1800’s. Although not much if any of the original furnishings remained during the time it was used as a boarding house, the restorers used period pieces to complement each room. A must see for lovers of historical architecture!",
   "A beautiful building, mixing Gothic and Romanesque architecture. Very well preserved.  Nice atmosphere."
  ]
 },
 {
  "name": "St. Mary's Roman Catholic Basilica",
  "address": "231 N 3rd St, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e21b7bb4-9332-11ea-b6eb-14b31f159f22.png",
  "tags": [
   "walking",
   "historic",
   "family",
   "food",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=6558915945034586184",
  "source": "GoogleMaps",
  "reviews": [
   "It is a beautiful Church. And the congregation seemed very welcoming. The sermon was a bit weird though. Almost political. Just surprised me a bit. I'm not Catholic but was away on business and wanted to go to church on Sunday. St Mary's was within walking distance from my hotel. I think I will try to find a non-denominational church next time.",
   "If you haven't stepped inside the Saint Mary's Basilica in downtown Phoenix I would definitely recommend checking it out! officially named The Church of the Immaculate Conception of the Blessed Virgin Mary in the Roman Catholic Diocese of Phoenix, was founded in 1881. The current church replaced an earlier adobe church which was built in 1881. Building work on the present church began in 1902 and was completed in 1914. The church was dedicated in 1915, and listed on the National Register of Historic Places as St. Mary's Church in 1978. The oldest Roman Catholic parish church in the greater Phoenix, Arizona, area, it was the only parish in Phoenix until 1924 and is home to Arizona's largest stained glass windows collection and a 26 rank pipe organ built by the Schantz Organ Company.",
   "The day of the Dead festivities is a great event to take the family to. We all have a great time. They have Mariachi Singers, a Stage, Kid Zone along with great eats from dozens of food trucks. We don't attend church here but we keep coming back to this great opportunity to participate in the holiday.",
   "The time we spent visiting St. Mary's Basilica was magical. We attended All Saints Day and they had the Litany of the Saints, one of the greatest Mass experiences of my life. The history and beauty of the grounds is evident. They have a great gift shop, my large Crucifix was bought here in 2007. Its a great piece of my faith journey I enjoy to this day. Fond memories when I recall my trip to St. Mary's, I HIGHLY recommend attending Mass and walking the grounds. Praise be!",
   "Beautiful Basilica!  Very traditional - kind of an oddity in Phoenix as it feels everything is knocked down and rebuilt every 10 years! Be sure to check out the stained glass window which is simply stunning!"
  ]
 },
 {
  "name": "Encanto Park",
  "address": "2605 N 15th Ave, Phoenix, AZ 85007, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e264b9f6-9332-11ea-b134-14b31f159f22.png",
  "tags": [
   "parks",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=14024040957109860748",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderfully enchanting Park and the duck geese river is must see.\nMost especially when the waterfall fountains begin to flow\n\nRemind me of the magical parks developed in the ancient Italian Cities, when I was a child. \nAnd they also have a most magnificent miniature railroad system. \nFor all children, young and old to enjoy. \n\nHighly recommended 😎👍💜💙💜",
   "A wonderful location for young families, with children to explore.  We happen to pick the best day of the year:  completely overcast, very cool temps, very easy parking (our vehicle was the only one, awesome), very few families / people were present (perfect), many photos were taken with no one in the background or photo bombing us.  I took photos with my cell phone and they came out perfect, especially with lots of overcast.  We were there for 2019 Thanksgiving Day.  So pretty the park was with so very few people.  Lots of ponds, birds trees, even pomegranates bushes too, sure enjoyed eating those as well, that was a treat.  Fed the Pigeons some of the pomegranates, they loved it.  Our three grandkids were really amazed at such a pretty place, but we picked one of the best times to go though.",
   "Absolutely beautiful park with the bridges and small waterfalls. Would be great for photoshoots. The playground is good size and manageable with multiple children. It had a half wall around it, but is far enough away from the water to not cause worry. The walkway winds around great for fun adventures. There's also lots of great animals to look for- many different kinds of birds, and some turtles in the water.",
   "1st time their and had a nice walk about the place.  big golf course, fun center with rides including a train ride, fishing lake, ducks,  very large geese, pidgins and who knows what else.  like I said first visit and will go back to explore again. good family outing destination",
   "This place was pretty nice. The prices were decent for the boats and for Enchanted amusement park. Ducks and geese to feed. You can also fish here with required license. All around a day in the park doesn't sound to bad here. 😁"
  ]
 },
 {
  "name": "Cholla Trailhead Camelback Mountain",
  "address": "6131 E Cholla Ln, Paradise Valley, AZ 85253, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e2b9c4c0-9332-11ea-b3e6-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "kids",
   "hike",
   "walk",
   "walking",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=7201183621575773814",
  "source": "GoogleMaps",
  "reviews": [
   "Great, but tough hike, and not for the faint of heart. It starts out pretty easy but the last half or so is a lot of scrambling up rocks and looking for good foot holds to hoist yourself up with. Going down is probably more challenging.\nFortunately, the views are fantastic whether or not you make it to the summit or not.",
   "Great little hike if you’re limited on time! Be aware- parking is about half mile away, so plan that in! Took me about 1hr 15 min total. I wouldn’t necessarily call the rocks “scrambles” as some do, since they are easy to get purchase on and have good grip and lots of handholds, but you will definitely need to use your hands going up and down.  I like this trail over the echo trail since it has lots of cactus and scenery along the route, and I think better views along the way up as well.  Very well-trafficked and well marked trail, I’m not sure there is any way you could get lost here!",
   "This hike offers amazing views, but it's overall a pretty hard hike. The path is clearly marked which is nice because otherwise you would have no idea where to go. It's half hiking, half rock climbing. We went from 12-2:30 and I'd say 1/3 of it was in the shade so that was nice. We saw a handful of kids under the age of 13 on this trail and they were NOT having fun. Is say you have to be decently strong and over five feet tall to enjoy this hike.",
   "Camelback Mtn. Cholla trail is the easier climb but make no mistake it is not an easy climb and is rated as hard. There are many parts that require actual climbing. It's not just walking it really is climbing. Good footwear and bring water is critical. Take your time and you will be rewarded with some spectacular views. Be careful about parking as the side streets ban it and you will be towed. The mainstreet parking is only a short walk to where the trail starts off.",
   "Fun and challenging. It was my first time and took me 2 hours and 20 minutes. I am glad I did this side vs Echo Trail. You can do it with sneakers but parts of it would be easier with hiking shoes. I am so glad I did this hike while visiting town."
  ]
 },
 {
  "name": "Tovrea Castle at Carraro Heights",
  "address": "5025 E Van Buren St, Phoenix, AZ 85008, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e31e5318-9332-11ea-a10d-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "history",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14138018646481975287",
  "source": "GoogleMaps",
  "reviews": [
   "Due to rain the night before, our tour excluded some areas we had expected to enjoy. Black plastic covered much of the Castle exterior so photos were out. There was no ability for the volunteers to offer us any future options: when I asked if I would be allowed to come back at another time for just an exterior photo, I was told no. After booking over 8 months in advance, I must say I would not recommend this tour to others. Overall a disappointment.",
   "We loved this tour and our guides were phenomenal! I learned so much about the castle and also history about Phoenix. The guides were very caring and accommodating for my husband who is in a wheelchair. The foundation and its volunteers put a lot of time, and love in preserving the castle and its grounds, it really is a lot bigger then you think!\n\nThis is one of those impossible Phoenix tours and I would recommend scheduling a alarm to wake up early to call for your tickets about-6 months in advance and it is worth it!\n\nKnow that your ticket purchase will allow the foundation to continue to preserve such a beautiful piece of Phoenix history!",
   "Eh! You only get the basement and one floor. Not that much and hard to get tickets that are expensive. In a few years when they're more complete on the restoration there will be more to see. I advise waiting a few more years. Right now you don't get to see much and you are the one that is paying for future visitors to get something to see. If that appeals to you, cool.",
   "A great tour. Good to see the mysterious house in person. A quirky Phoenix treasure.",
   "Such a beautiful place filled with so much history and mystery!"
  ]
 },
 {
  "name": "Dobbins Lookout",
  "address": "Phoenix, AZ 85042, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e36c2522-9332-11ea-b38e-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=10129065283448764862",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best view point in Phoenix. Leads you directly to high elevation where you could see Mesa Scottsdale and Phoenix. Best part is you could drive all the way to summit. Sunset is my favorite time to visit as Phoenix sky goes crazy during sunset time. Name the color will be able to spot on sky. Soon after sunset you will have opportunity to enjoy the downtown lights. Final tip is ensure you drive in before 7pm as drive-in gate closes. Drive-out can be done anytime.\n\nHappy Outing!\n\nRegards,\nVishwas",
   "It's a nice place to overlook the city. Great bilingual and hiking too. The restrooms could use more upkeep but the views are spectacular",
   "Great place to see south Phoenix! \n\nYou can drive up here. It might be a bit dangerous at night time but just go really slow. It’s a nice view! \n\nOkay place to take pictures.",
   "Nice point to visit during sunset. Wonderful view of Phoenix in lights",
   "A beautiful view near here. We had a good time last week"
  ]
 },
 {
  "name": "Echo Canyon Recreation Area",
  "address": "4925 E McDonald Dr, Phoenix, AZ 85018, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e3b674ca-9332-11ea-99dd-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=9066096307579726304",
  "source": "GoogleMaps",
  "reviews": [
   "I am 29 years old and fit. This hike was well worth the 360 view at the top. I would classify it as a hard hike with the elevation gain and large rocks to scramble up. I am afraid of heights but this hike did not bother me at all. It took about 2 hours round trip enjoying the hike and not racing up. It was breezy at the top. I recomend some trail runners with grip which made it easier for me than my friend with regular running shoes. bring some water",
   "This was a hard hike but super fun at the same time. Going up was harder then coming down and it had the right amount of challenges such as incline,  a little scrambling, steep rocks, and you'll burn those leg muscles. Then when you reach the top the view is all worth it. There are restrooms at the trail head but parking sucks. It does get very crowded so I'd hike it again but prob won't go as often due to the parking situation.",
   "My fiance and I stumbled upon this place around sunset and we were mesmerized by how beautiful it was.  Every direction you look had different scenery and it was all beautiful.  It also seems to have popular trails for runners.",
   "Great place to hike. You get a good hour work out while site seeing. The weekend is always crowded. There is limited parking. I would go during the week after work between 4pm and 5pm.",
   "I loved this hike every minute of it. It was intense workout. I would do it all over again.🤩💯"
  ]
 },
 {
  "name": "Tempe Beach Park",
  "address": "80 W Rio Salado Pkwy, Tempe, AZ 85281, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e4097dcc-9332-11ea-8ea9-14b31f159f22.png",
  "tags": [
   "free",
   "music",
   "walk",
   "walking",
   "walk",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=366973538302800349",
  "source": "GoogleMaps",
  "reviews": [
   "Tempe Beach Park. One of my favorite places to go in Tempe. It's just off of Mill avenue and it is a great place for a stroll sometimes there's awesome events that are there. They also have free parking. Unfortunately this sometimes means that it is packed and completely full so you can't park there. But if you know you're way around there is a parking spot on the other side of Tempe Town lake that usually has plenty of spots. It's just under one of the bridges. Overall just a really great spot.",
   "It's a great way to get outside and gather some good music, awesome way of harboring good people of like music minds. It's getting to become a huge event and with parking difficulties. I am opting out from attending anymore but have great memories of good times! Enjoy you newbies!",
   "I love strolling the north and south paths. Tempe keeps it clean and pretty safe. Draws people of all ages, cultures and every type of fitness levels. Great place for bikes, dogs, skaters, runners, and those who love to walk. \nThe photo I took is of Tempe Lake, but the wishful heart of mine and vast imagination renamed it Tempe Ocean. This girl dreams big. For the water there are boat rentals, canoes and paddleboards.",
   "Perfect time of year to be out and walking around. . They are doing a lot of work to try to improve the Tempe. Lake area. I just am impressed by how much work they are doing to make it look better all the time. . I am not excited about all the corporate buildings, but I guess that goes with the scenery that comes. With the lake",
   "The lights are so pretty at sunset we pulled over for a little walk and to take a free shots, and we discovered Bird and Razor motorized scooters for rent. Folks younger and old were whizzing around on them, then our kids noticed, and after just a little learning curve, we all were riding. So much fun! The park and surrounding area is SO well maintained that the ride was so much fun and SAFE! Even my 51 year old, 6'5 300lbs husband rode one - the Razor with a seat and we all had a blast! Another reason to live this area!"
  ]
 },
 {
  "name": "Pioneer Living History Museum",
  "address": "3901 W Pioneer Rd, Phoenix, AZ 85086, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e454ad38-9332-11ea-ac61-14b31f159f22.png",
  "tags": [
   "cheap",
   "kids",
   "family",
   "family",
   "unique",
   "history",
   "field",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16946261880316616185",
  "source": "GoogleMaps",
  "reviews": [
   "Very fun visit - much bigger property than you would first expect. We went during the week and there weren't any period piece actors attending all the different buildings so things were roped off but still easy to see. I think with locals providing information and color this is 5 star. Most of the buildings were actually original and brought to this location and stood up which is incredible. Very cool!",
   "Fun place to spend some time with the whole family. Kids like the costumed people and the overall look of the place. Looks to be maintained well and made for a cheap way to spend some family time while maybe teaching the kids something in the meantime. If you are into old printing methods there are some neat old printing machines. Anytime the kid has a good time it’s worth a good review.",
   "We came on a rainy day during the week but even still we loved it. There is so much here that it gives you a sense of what life was like during the Victorian and Pioneer era. Some of it is hands on (gold panning)  but most buildings you just peak in. They have more events on the weekends. Great for the family, especially for homeschoolers.",
   "This Pioneer Living History Museum is a must visit place, take a trip back in time people! The grounds are beautiful, the structures are very old, the artefacts are rare antiques. There is a unique Telephone Museum there now. Very interesting for both children and adults. Thank you very much had a memorable and very pleasant experience.",
   "This was such a cool experience. My son went on a field trip, and we got to see how things were done way back when? It reminded me of the TV show Little House on the Prairie. The kids were able to look for gold and we even got to see a real life gun fight!"
  ]
 },
 {
  "name": "Arizona Falls",
  "address": "5802 E Indian School Rd, Phoenix, AZ 85018, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e4a3de9c-9332-11ea-9b83-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "free"
  ],
  "link": "https://maps.google.com/?cid=9535640048808502499",
  "source": "GoogleMaps",
  "reviews": [
   "I was looking for unique places Arizona Falls comes up so I decided to go.  It's a restored hydroelectric plant. The water that falls from it are pretty cool. Good place for photos. Then there is a path that runs along both sides of the water way. It's not paved very well be careful of stumbling on small rocks. Wear correct shoes as I did not. It looked like a great walk. I ventured out maybe a 1/4 mile round trip. There are porta pottys. I could see tennis courts in the distance. Very clean. I will be back to actually take a walk or ride a bike. I enjoyed myself.",
   "I love this place and have for  long time. I come here too relax and clear my thinking. Best place ever",
   "Fun little visit. I wouldn't make a special trip for it, but we were driving past and stopped.",
   "Awesome place for free fun, education, and beautiful waterfalls without the hiking like most AZ waterfalls. Highly recommended! Great place for a free date with cute waterfall selfies and learning about SRP supplying us with energy.",
   "Absolutely gorgeous. At least three sets of man made waterfalls. Great for photos."
  ]
 },
 {
  "name": "Big Surf",
  "address": "1500 N McClintock Dr, Tempe, AZ 85281, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e4f6421c-9332-11ea-abe8-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "kids",
   "food",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4169646453591045361",
  "source": "GoogleMaps",
  "reviews": [
   "Really fun experience for the whole family a lot of things to do highly recommended for people trying to have a nice day in the sun and water 💧",
   "Outstanding place to take kids 7 years and below. Plenty of space, usually not crowded. But summer pass and two admissions will have equaled the cost of the summer pass.  Traditional admission is $35 and Military is $20z Lockers about $8-12. The only issue is there’s no lazy river and the wave pool only creates one wave per ten minutes. Would like to see more continuous waves.",
   "Great place to relax and let the kids play.  Food is not overly expensive.  I ordered a large pizza and drinks for five and it was enough for all of us for under 25.  The only problem is there isn't enough shade for the number of people they let in the park.  Get there early or wait for someone to leave are your only options.  The kids always love going.  Their was one police officer on duty walking around, which I thought was great.  I wasn't worried about someone taking our stuff from our seats while we were playing.  They have lockers, changing rooms and plenty of restrooms.",
   "Great place to take your kids if you plan to be there all day. They told my son could go down slides but once he started he was then told he was too big. He is 6. They were rude to him. The lines go fast and it's not that long of a wait.",
   "Went to the Circus Americana set up next door. A small, intimate setting, like an old-time road show. A fun couple of hours."
  ]
 },
 {
  "name": "Enchanted Island Amusement Park",
  "address": "1202 W Encanto Blvd, Phoenix, AZ 85007, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e547158a-9332-11ea-82a5-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "kids",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=17534956040770335697",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great place for small children to go on rides and play carnival style games.  It is aimed towards kids 3 to 10. Several rides like the carousel and train are adult friendly.  There are snack bars and vending machines as well as snow cone stands. There are many designated areas for birthday parties.  We had a great time with my grand daughter and her parents.  Wrist bands we $21.50 for unlimited rides. A book of 10 ride tickets was $40.00. It's easy to do the math which is the better deal.  Staff and ride operators were friendly and very patient with children.",
   "This was actually very cute and pretty much exactly what is advertised and what I expected. They have a few good kid rides and its not too costly. The snack stand makes good jumbo pretzels with that hot, melty cheese. Kids of all ages can find a ride or a few to go on. I enjoyed it with my one year old and she had fun running around.",
   "Went here for my little cousin's birthday party and it's a great place for kids. A little on the expensive side but very fun. Took my son who's almost 2 with us and he's a little small for rides but he loved the carousel and the train that goes around the park. Would totally recommend this place to anybody with kids that are 3-10 years old. 10/10 Great place 👌",
   "Perfect for kids between 3 and 8. Any younger or older than that and they can't do all the rides. They had some fun rides and my kids got to ride them over and over because there was no one there. Most of the staff were friendly. Some were less than thrilled.",
   "Its okay...  children around 2-8 will enjoy themselves but sadly the surrounding park \"Encanto\" is full of homeless people. I lived across the street until my fiance passed away last mothers day. My late fiance was verbally assaulted and threatened by a homeless man. His language around our children was not something you should have to hear when simply walking by. Sorry she didn't have change.. Glad I didn't hear it. But I have seen homeless using it for alcohol use, drug use, and sleep. The park is nice other then that."
  ]
 },
 {
  "name": "Taste It Tours",
  "address": "4400 N Scottsdale Rd #11, Scottsdale, AZ 85251, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e593bbbe-9332-11ea-a8d5-14b31f159f22.png",
  "tags": [
   "tour",
   "eat",
   "foodie",
   "tour",
   "library",
   "history",
   "family",
   "tour",
   "historic",
   "organized",
   "food",
   "history",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=10433202931210968305",
  "source": "GoogleMaps",
  "reviews": [
   "Trey was a great guide. All the dishes and drinks were amazing! Returned the next day to eat at or buy from 2 stops on our tour. If you are a foodie, I definitely recommend!",
   "I got invited to do the Phoenix Taste It tour as part of a Christmas party.  I had no idea what to expect other than the fact that we would be eating and drinking at different places downtown.  Can I just say that after the 3 hour tour was complete I was hoping to be stranded on the island. Jennifer, our guide, was amazing! She took us to so many places and told us the history behind the restaurants, buildings we walked by, and all the secret places many people don't know about. For example, did you know the Valley Bar has a hidden library or the story behind the images displayed at the bar? Did you know Hanny's restaurant has a bunch of creepy dolls one the bottom level in which some people have witnessed ghost activity? This tour was much more than eating and drinking (which might I add was incredible)! I would highly recommend this tour and can't wait to do it again. It's perfect for a date night, family outing, or even a work get together.  My only suggestion is come hungry!",
   "We went on the Sunday afternoon tour in Old Scottsdale. It was very well put together and organized. Our tour guide Mitchell was in training, so the owner tagged along as well. All the stops were prepared for us with our tables, food, and drinks ready. The historic commentary was fascinating. The places they took us to were local favorites and we probably would never have known about them otherwise.  We enjoyed them immensely! Thanks for the fun afternoon!",
   "Matt was very enjoyable very attentive but would have been nice if he didn't read all history info and knew it by memory",
   "The food choices were exceptional and our leader Kyle was great.  There was, however, much more walking than anticipated; over 2 miles."
  ]
 },
 {
  "name": "Sonoran Outdoor Adventures",
  "address": "17624 N 40th Way, Phoenix, AZ 85032, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e5f321ae-9332-11ea-817d-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "tour",
   "art",
   "tour",
   "knowledgeable",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=15930231327577499746",
  "source": "GoogleMaps",
  "reviews": [
   "My girlfriend received a private tour as a gift for her birthday. From the beginning the process was seamless. Marek has the booking process down pat and was extremely accommodating. When we arrived he had everything set up for us so there was no need to bring any other essentials. He works with riders of all skill levels and is very knowledgeable on mountain biking and the desert. The bikes were easy to ride and the trails were great for all skill levels. Being natives to Arizona we gained a whole new perspective on the desert, nevertheless this would be a fantastic tour for visitors from out of state/country. We would highly recommend going on this tour to anybody looking for a  fun and educational tour of the desert.",
   "Awesome experience. Marek and Alan were great guides and perfectly tailored the ride to our experience level. They lived the trail etiquette by example and were all around great to be around.",
   "This early morning bicycle tour was one of my most memorable experiences! Marek, the guide, amateur botanist and professional owner of the bicycle tour company was fabulous. He booked the tour to fit my schedule, provided the state of the art \"fat tire\" bicycle and water pack, snacks, commentary, and multiple photo ops (see pics). I totally recommend checking out this experience.",
   "Marek is a great guide!  The sunrise bike tour was awesome.  I was out of shape but he made it interesting and fun.",
   "This tour was the highlight of our trip! Mark was an excellent guide who exudes passion for what he does. Don't bother bringing your camera - Mark takes exceptional photos with his iPhone that he'll share with you shortly after the trip. We got pictures at incredibly beautiful spots all throughout our journey. He really works hard to make this a memorable and wonderful experience. Although I was a bit timid with biking through windy paths, he was sure to warn us before any rough turns so we could prepare. He accommodated to our skill level while maintaining the perfect balance of challenging us and taking breaks as needed. Mark is incredibly kind and personable and the experience felt like riding bikes with a friend - a very knowledgeable friend who's treating you to a thrilling and memorable tour through the desert! If you're considering this trip, it's absolutely worth the price you pay for the memories you'll make."
  ]
 },
 {
  "name": "The Phoenix Police Museum currently closed until March 30",
  "address": "Historic City Hall, 17 S 2nd Ave, Phoenix, AZ 85003, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e643a036-9332-11ea-9d81-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "history",
   "kids",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9854099420534654475",
  "source": "GoogleMaps",
  "reviews": [
   "Very informational. Great displays. Helpful staff. Shows the origins of Miranda Rights. Car, motorcycle, helicopter, etc on display. Pay homage to fallen officers and K9 officers. 9-11 memorial. Don't miss this museum!",
   "Small but well-crafted free museum with free parking (limited) in front. Great stuff for kids to do. Interesting facts about Miranda rights, old west law, forensics, etc. My favorite part: Early police women wore a skirt and carried a special leather police purse...loaded with a gun and plenty of ammo!",
   "Interesting bit of history of Phoenix PD. If you get the chance be sure to stop by visit. Totally worth your time!",
   "Super fun hands on learning. I'm pretty sure I had as much fun as my kids and grandchild. Many photo ops you will only find here. It's a great addition to any downtown adventure. An added bonus is it's very close to the light rail so you can enjoy the ride and not have to mess with traffic or parking",
   "Wonderful museum, free admission. Covers the history of the Phoenix Police force from territorial times to present. Has a touching memorial to fallen officers as well as a 9/11 memorial."
  ]
 },
 {
  "name": "Margaret T. Hance Park",
  "address": "67 W Culver St, Phoenix, AZ 85003, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e69bf90c-9332-11ea-87e1-14b31f159f22.png",
  "tags": [
   "music",
   "family",
   "food",
   "music",
   "kids",
   "library"
  ],
  "link": "https://maps.google.com/?cid=5084022957642710852",
  "source": "GoogleMaps",
  "reviews": [
   "Love being here for McDowell Mountain Music Festival. It is a great park for festivals or any events in general. Very open, fits a good amount of people and the park itself is very nice and well kept the times I have been when no events are being held!",
   "This was a great spot to attend the Vegan Festival! It was spacious and the way everything was set up with the vendors,  the music and the vegan food trucks was great! We had a wonderful family time and enjoyed the Vegan Festival at this park!",
   "The park was quite clean and big. It was nice and green and there was a walkway that went all around the park. There’s a playground for the kids and the bathrooms are clean. I think the best part of the park was the flags. I went on a windy day so the way they were dancing in the wind was so beautiful.",
   "Cute little park! That's all it is though, very straightforward. Like an oversized backyard 🤷‍♀️. Quiet, peaceful and fairly well kept. We had a pleasant afternoon here.",
   "This park has amazing features and potential. Great events at this park. The library is huge with tons of staff and things to do. Only issue is the homeless population.  The mental health and the substance abuse on this property is huge. Be safe heading to this park at all hours."
  ]
 },
 {
  "name": "Talking Stick Resort",
  "address": "9800 Talking Stick Way, Scottsdale, AZ 85256, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e6f45168-9332-11ea-ab99-14b31f159f22.png",
  "tags": [
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3458005303903630266",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing, totally amazed by The whole Resort!\n If you thought you had to go to Vegas to have fun and Gamble, this Resort has it All. \nEspecially Sports!\nThis is the place not just to gamble you can also watch live! In the basketball Arenas to Baseball etc...\nLove it! And yes, there's plenty for Ladies to do!\n Fun is definitely imperative for All!",
   "Had dinner at the buffet a year prior and was definitely one of the best buffets I've had. This we stayed at the resort. Top notch very nice. Buffet still amazing. This time we also ate at the Orange Sky. Excellent food and an amazing views. Overall experience at the resort...A++",
   "The classiest casino in Arizona. A most see for anyone visiting this state. Talking Stick casino resort is top notch on every level!! Also Ocean Trails casino floor restaurant and bar my personal favorite #1 #1 10 GOLDEN STARS, A1, NOTHING COMES CLOSE TO THIS PLACE. TALKING STICK CASINO RESORT IS IN A LEAGUE OF ITS OWN. FAR FAR ABOVE THE REST.",
   "We had a great time at this hotel. The person who checked us in was so nice and friendly even letting us split the room with each person's card. We asked for an extra robe and the housekeeping people were very friendly. We enjoyed the free sodas at the bar. The room was nice and so was the pool. We would definitely stay there again.",
   "You have several choices for a Casino in the Phoenix/Scottsdale area, but think Talking Stick Casino is one of the top experiences for getting your gambling fixed. Great night life put 24 hours of gaming and food.  We didn’t stay at the Resort this time but it is a beautiful hotel to top off your experience here. Please make this a must stop with your friends. And if you like golfing indoors at night, we’ll TopGolf is right next door."
  ]
 },
 {
  "name": "AZ Heritage Center at Papago Park",
  "address": "1300 N College Ave, Tempe, AZ 85281, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e7379c1e-9332-11ea-a488-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=3132988498626199276",
  "source": "GoogleMaps",
  "reviews": [
   "Did you know that the “five c’s” of Arizona are copper, cotton, citrus, climate and cattle? Well I didn’t know that before here. I learned many interesting about this state. I’ve lived here for three years and loved AZ but after going here, I fell in love with it more. Probably one of my favorite historical state museums I’ve been to. This museum is for someone of all ages because they keep it simple so people everyone will understand.Arizona has a rich and complicated history and this museum really shows you all of it.",
   "Was a awesome time!!! I didn't catch the ladies name at front desk/ gift shop but extremely nice and helpfull. A very nice display of natural minerals.",
   "What an incredible place!!!  Information from UFO to first solar house in the world right here in Phoenix!  And so much more... The scenery is a bonus.",
   "I was there for a end of the year celebration. It was great. I only had time to see some of it but it was really great. There is a lot of Arizona history, the good and the bad. I want to go back and see it all and have more time to spend reading all the information.",
   "The museum is a beautiful building with huge saguaros and other cactuses in front. The displays are interesting and informative about all aspects and periods of Arizona history. The displays are set up on such away that families would enjoy them. Also enjoyed a special exhibit of photographs of homeless people in the Phoenix area along with their stories. Very meaningful and insightful exhibit."
  ]
 },
 {
  "name": "Dreamy Draw Recreation Area",
  "address": "2421 E Northern Ave, Phoenix, AZ 85020, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e78113ac-9332-11ea-b353-14b31f159f22.png",
  "tags": [
   "hike",
   "adventurous",
   "hike",
   "family",
   "hike",
   "nature",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=4114834764206794336",
  "source": "GoogleMaps",
  "reviews": [
   "Dreamy Draw is a favorite place for me and my 4legged buddy to hike. It is right in the middle of Phoenix Mountain Preserve. Easy access off 51 and Northern and from here you can head west or east on Trail 100. If you want to be more adventurous, you can take your pick of trails that branch off, and easily find your way back. Beautiful, lots of cacti. You'd never know you're in the middle of a huge metropolitan city.",
   "Lots of fun at Dreamy Draw! The rec area is a bit smaller, however the trails are fun and scenic. Trails range from novice to expert, allowing fun for the entire family! We went on Trail 100, as that is my favorite. About a 45min hike around the mountain, with plenty to see and do. If you haven't visited Dreamy Draw yet, put it on the list!",
   "Really nice place for hiking and biking. Trials vary in sizes and difficulty. Maps is hard to understand though. And the poles along the trail are old and not updated. Still a really nice place. You'll rarely come across a trail where you bump into a lot of people on the way. Very spacious. I've seen people of all ages come here. Very dog friendly as well.",
   "Dreamy Draw is part of the Phoenix Mountains Preserve. There are plenty of trails to hike that connect to other part of the preserve and even other parts of the city. It's nice to have a nature preserve right in the middle of the city.",
   "Not too much of a fan for this area. It's a very urban hike, so you can still see the city from the trail, and along certain parts of the trail, I even spotted some litter. \nParking was very limited as well in the evening after work... Trail were not very well marked either. \nAt the very least though, I am happy I got a decent workout here on a pretty beginner friendly loop, but I don't think I will be back anytime soon."
  ]
 },
 {
  "name": "Phoenix Sonoran Preserve",
  "address": "1600 E Sonoran Desert Dr, Phoenix, AZ 85085, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e7cf569e-9332-11ea-80e4-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "nature",
   "walk",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=6367885015233353201",
  "source": "GoogleMaps",
  "reviews": [
   "The preserve is a wonderful hiking and wildlife refuge area. It has a nature walk which is easily accessible and informative about the plants and animals that live in the preserve. You can walk, hike, mountain bike or on the many trails through the area that is part of the larger Phoenix trail system. A most enjoyable place to contemplate and enjoy the sounds of nature.",
   "This is just about the most peaceful Saturday morning walk anyone could ask for.  Beautiful backdrops, plenty of parking, a restroom at the parking lot, perfect for the family.\nAs you walk you get to see a lot of the beautiful native vegetation as you ascend the path.  The path is not overly difficult, kids can do just fine on it, beyond toddler sized.\nGo and enjoy the walk folks, its worth the visit.",
   "Excellent place, got to be there as I had opted for hot air balloon ride. Very calm and peaceful experience, got to say very well maintained and cleaned.\nThere are huge cactus plants which seem ages old can be found in here.\nAbsolute treat to watch them so close and the combination with Hot Air balloon ride made it 5 star experience",
   "Phenomenal landscape and views! Seen my 1st rattlesnake this season, just about 30-36\" in length crossing the trail. Trails are rocky which I don't mind but I know some are sensitive of. Parking lot was full when I was leaving at 9:45am so ppl were searching for spaces.",
   "I hiked 4 miles on the Dixie Loop Trail which was littered with beautiful wildflowers like lupine last Sunday.  I am convinced the weather gods were looking down on me.  Please take a break from the regularly scheduled depressing news and enjoy our local hiking trails.  It’s easy to practice social distancing and it’s fun."
  ]
 },
 {
  "name": "Martin Auto Museum",
  "address": "17641 N Black Canyon Hwy, Phoenix, AZ 85023, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e81d3608-9332-11ea-a442-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "knowledgeable",
   "kids",
   "walk",
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=9291038243856928640",
  "source": "GoogleMaps",
  "reviews": [
   "I have known Mel martin for years. He is truly a car guy and lover, as it shows in his collection. No one theme, just cars, trucks and tractors. There is even a merry-go-round. The place has a party room you can rent for an event and catering is available.",
   "I went with my dad, who is a big car guy! We can’t drive down the street without him pointing out a car, mentioning its make, model, and year, and telling me a story about a time he owned one, or wanted one, or had a friend who drove one. The museum guides were friendly and knowledgeable, and the car inventory at this museum was truly impressive. Well done, Mr. Mel Martin. I have a feeling my dad and I will be back at some point!",
   "Great place to go back in time... and enjoy some fabulous automobiles. ( They're probably in better condition than new... really beautiful !) Go see for yourself !",
   "A gem if you're at all interested in cars and auto paraphernalia. They have a bit of everything from antique toy car models, gas pumps, mechanic tools, a working carousel, and of course cars. Antique cars, race cars, vintage cars, and some modern day cars. It's all well maintained,  polished and clean. Staff is friendly and knowledgeable.  \n\nThey run on donation so there's no charge to enter, but if you can donate $10 per person it helps them keep the place running. In my opinion it's worth it. \n\nFor time consideration, you might spend an hour looking at everything, two hours or more if cars are a passion and you want to read all the information and inspect them all. It's a good way to spend a morning or afternoon. \n\nSmall children might get bored as in any museum, but kids who like cars will like it. It has some funny exhibits, carousel, and a driving video game, plus plenty of cars with custom paint that's very eye catching for all ages. If it were a board game I would recommend ages 5 to 105.",
   "This place is setup well.  You can walk between cars and see inside and under the hood quite well.  A wonderful automotive experience!   And cheap to get in.  10 bucks at the door and all my questions answered with pleasant knowledge.  And yes there is a Shelby cobra hanging out there."
  ]
 },
 {
  "name": "Carnival of Illusion",
  "address": "2400 E Missouri Ave, Phoenix, AZ 85016, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e85d1380-9332-11ea-b55c-14b31f159f22.png",
  "tags": [
   "art",
   "performance"
  ],
  "link": "https://maps.google.com/?cid=1522359831168535567",
  "source": "GoogleMaps",
  "reviews": [
   "My wife and I attended their 5:30 show last night as an early evening Valentine's Day gift to ourselves.  We were greeted promptly when we arrived and when the theater opened we were shown to our seats up front row seats 11 & 12.  The set's presentation was lavish and beautiful.  A myriad of details hung before us, each making us wonder how and when they would be incorporated into the show.\n\nThe show started on time and the magic show began.  But calling it simply a magic show doesn't do it enough justice.  Yes there were displays of close up magic, some tried chestnuts, many new to me; but there were two other components at play last night.  \n\nThere was the pure showmanship of the pair, a few times they compared themselves to PT Barnum, but I think that does them a disservice.  There's was an act of both magic and theater, a work of art well honed through their 800+ shows, but never appearing tired.\n\nThirdly there was the charismatic way that the two of them worked with each other, supported each other's individual displays, and the ease with which they worked the crowd to involve them in the very acts of the show.  \n\nThe whole thing came together to become something far greater than the sum of each of their parts.  I can not urge you hard enough to go see them.  It is truly a worthy experience, especially for any who are fans of magic, vaudeville, carnivals, and a genuinely solid entertaining show.",
   "Just saw this gorgeous show at the Tempe Center for the Arts. It is absolutely STUNNING in every way! Everything, from the tickets to the decor, to the brochures and pamphlets to the posters are all exquisite in old world magic aesthetic. The show itself is thrilling! Filled with fun moments of audience engagement, this show delights in mystery, fanfare, beauty, and of course, a wonderful sense of magic and wonder! \n\nThere is nothing quite like experiencing the Carnival Of Illusion here in our beautiful state. Nothing comes close to capturing the beauty of magic and the soul of the world, quite like these two. An absolute delight, all around! \n\nAnd, if you're celebrating a birthday or anniversary with magic in the air, the stars will align with a lovely surprise! After the show, this magic duo comes out to greet everyone personally and spend a bit of time with you after the magic. If you're celebrating with them, they'll even pose for photos with you too! ",
   "Very entertaining- funny and mysterious!  I took a 12 yr old and he was thoroughly impressed as well.  I asked him what is his favorite part and he said, \"ALL OF IT.\"  Definitely something different and fun to do.",
   "Me and my husband went to the 7:30pm show last night, it was up close and personal which I loved! Susan was so funny, her and Roland have an amazing gift. Thanks for a great night of entertainment",
   "It was alright. They haven’t changed up their routine in 10 years - it’s the same lame tricks as the last time we went, yet somehow it still seemed unrehearsed. Not worth the $45 dollars. The man kept shouting out “no videos please” during the performance when no one was taking a video. The best part was when they brought their dog out on stage to be honest. They need to revamp their routine."
  ]
 },
 {
  "name": "LEGOLAND Discovery Center Arizona",
  "address": "5000 S Arizona Mills Cir STE 135, Tempe, AZ 85282, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e8ac806e-9332-11ea-a1ce-14b31f159f22.png",
  "tags": [
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9103573918068574278",
  "source": "GoogleMaps",
  "reviews": [
   "This place is huge! My 2 and 4 year old spent almost 3 hours here and could’ve kept playing if it hadn’t closed for the day. I’d say that 4 is the youngest I recommend taking there. My 2 year old had a blast running around and playing, but most of the legos displays and building were over her head. My 4 year old was able to enjoy and understand how cool everything was. He was also able to do both of the rides, while the 2 year old could only do 1 of them.",
   "Fantastic experience! My 7 year old and I played for 5 hours and really made the most of the place. We watched all of the 4D movies, built dinosaurs, built and raced cars, ate lunch, played in the Lego City and rode both of the attractions. There are legos everywhere and you can just roll up and start building. My only request would be a bit more seating in some the areas, but really this place is a great value for the experience. Buy tickets online in advance so you can save $2 off admission per ticket.",
   "This place was fantastic!  All the staff we interacted with showed enthusiasm and kindness.  There are a ton of activity stations  but, CHILDREN MUST LOVE BUILDING or they will get bored.  My daughter spent 2 hours building and racing cars. There are also 2 rides that are very fun and theatrically thrilling!",
   "I visited today with my three year old, and it was a wonderful experience. She had so much fun and I was surprised by how many activities there were. It was colorful and pleasant. We loved the rides too. Totally worth getting the annual membership for the aquarium and legoland together.",
   "I went here with my niece and nephew yesterday and the reviews were not great. Several of the “laser” ride blasters didn’t work. They did a great job disinfecting rides and the movie theater. The tables and food areas were filthy. We were there for two hours and never saw them clean anything despite overflowing trash and lunch rush. The legos and play areas felt sticky...the way old kids’ toys get. They definitely need an update or a major scrub down. We went to watch the 4D movie and ended up being held hostage by an obviously underpaid employee hopped up on energy drinks. Instead of a simple explanation of the theater rules, she went rogue doing a 10 minute, self-titled “lesson in patients”. I’m 39 and it’s one of the most uncomfortable experiences I’ve had to sit through. It included her climbing over seats to yell in children’s faces, a short lecture on being “lucky” to have the luxury of coming to LEGOland, and the list goes on. She was having a rough day to say the least. If we didn’t have to walk past her we would have left. Go to the aquarium instead."
  ]
 },
 {
  "name": "Civic Space Park",
  "address": "424 N Central Ave, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e8f26fe4-9332-11ea-8249-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "art",
   "nature",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9317766590172511702",
  "source": "GoogleMaps",
  "reviews": [
   "Nice place to stop by and chill, catch some sun,  if you work near there and are between lunch breaks. They have plenty of sitting areas and if you have a nice little spread, you can chill on that.\n\nThey also have food trucks I think every Friday or two Fridays a month. Not sure. \nI will say the food truck prices are not cheap! But it is an alternative from traditional restaurant and I did find southern styled barbecue that is hard to find down this way, so it was worth it! \n\nSome people are bothered by the homeless people that hang out there, but they more often than not are catching up on sleep or just relaxing like everybody else. They are most often pleasant as well and do not bother anyone.\n\nThis is near the post office so one can drop of mail so it's just a nice place to stop by if you go back home. It's a respite,a breath of fresh air, from the busy and rushed atmosphere of mid-town Phoenix. Take a break and stop here. You will enjoy it. Don't go there hungry on Food truck days as those lovely scents definately catch you. That's how the barbecue got me!🤣🤣🤣",
   "Check out ‘Her Secret Is Patience’ the public art installation named for a Ralph Waldo Emerson quote (read more on Atlas Obscura)!  “Adopt the pace of nature; her secret is patience,” beautiful!",
   "PBS kids had a awesome event in civic space park. We had a blast. We look forward to next year.",
   "There can be some really cool events that take place over here at the Civic Space Park.  But this park is also  a great place to wait until the light rail or bus comes.  The whole park is very big city feeling and who could not notice that large fishing net looking sculpture.  All around this park is cool but a lot of people thought some parts of it were a waste of money.",
   "Very nice. Busy with ASU students moving about."
  ]
 },
 {
  "name": "Puzzle Effect - Phoenix",
  "address": "4700 N Central Ave Suite 102, Phoenix, AZ 85012, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e93c6398-9332-11ea-83a7-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=17737595923623849760",
  "source": "GoogleMaps",
  "reviews": [
   "We did a run of seven escape rooms while visiting my sister, two at this location. The Path was our favorite of the seven, The Emerald Bay was also fantastic. We were very impressed with the set design, puzzles, and staff - all great. Really hoping for more rooms because they have earned our business. Also, they're the only place I've been to that does the pictures in the actual rooms - something I appreciate.",
   "I did the power plant based puzzle and really enjoyed it. Without getting into too many details, the puzzles were very interesting and progressed logically so I always could track how to get from one place to the next. I had a great time and I'll probably go there the next time I'm in Phoenix.",
   "Amazing!! My friend and I weren’t able to finish before the hour was up and the staff was super nice and they let us finish up the puzzles with his help!! Greatly recommend! I really loved how they never actually locked the door of the puzzle room we were solving! So I could leave at any time if need be. I was also able to take my personal items into the room with me☺️",
   "It was so clean and honestly the most challenging one I’ve ever done, and I love a challenge. Also the staff was the absolute best and so accommodating. Love this place we can not wait to go do it again. & would most definitely recommend this place to anyone and everyone.",
   "We did the hardest room and had about 4 and a half minutes to spare. I recommend this place and would go again!"
  ]
 },
 {
  "name": "Downtown Glendale, AZ",
  "address": "W Glendale Ave, Glendale, AZ 85301, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e97e9d02-9332-11ea-b907-14b31f159f22.png",
  "tags": [
   "food",
   "parks",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=1289432345985184623",
  "source": "GoogleMaps",
  "reviews": [
   "A beautiful little place in the heart of Glendale. Nice parks tons of antique shops and food. So clean and people are friendly.",
   "A good place to relax for a minute.",
   "Downtown is historically beautiful. I am thrilled to live so close.",
   "At night this place looks so beautiful and I love it.",
   "Quaint area with unique shopping. Not all stores are open as the hours show on their doors."
  ]
 },
 {
  "name": "Hurricane Harbor Phoenix",
  "address": "4243 W Pinnacle Peak Rd, Glendale, AZ 85310, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e9dd5f22-9332-11ea-9cf9-14b31f159f22.png",
  "tags": [
   "family",
   "parks",
   "kids",
   "kids",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=349518528549755319",
  "source": "GoogleMaps",
  "reviews": [
   "Being a Thrill Seeking Family, this park did not disappoint. Granted, we prefer 100mph roller coasters. But Water Parks like this one (the old Wet-n-Wild before it was bought by Six Flags) has some cool features that set it apart. Namely, they have an \"uphill\" water slide and on some attractions, you can ride \"backwards\" for a different experience. The lines can be a bit long, but park attendees and staff are nice and keep things calm. The attraction life guards are quite on guard as well: they constantly check to make sure attendees don't overexert or dehydrate: kudos to them!",
   "DO NOT MAKE THE MISTAKE... of buying season passes!! I have been a long time Wet 'n Wild season pass holder and never had an issue UNTIL Six Flags took ownership. We tried cancelling our season passes weeks before the last payment was due and the payments keep coming out of our bank account. We tried to reach out via contact form with no response. We live chatted with an agent who verified that we cancelled our account and was going to escalate the issue. Long story short, we never heard back from anyone and when I went online the agent said my membership was marked to expire in November when it should have been already cancelled. We've been charged $105 per month for our passes. We have been paying for 16 months now when it should have only been 12 months and cannot get a hold of a real person. PLEASE STAY AWAY FROM SEASON PASSES. ITS NOT WORTH THE HEADACHE!!\n\nI honestly liked it better before Six Flags got involved!",
   "I took my older son and 2 nephews and we all had a great time. All the rides were cool and thrilling and we all went together on all of them. We were there on July 3rd, so at the end there were fireworks. Our experience was an amazing one. All it matters to me is that the kids loved it and had a blast.",
   "This place was so much fun for my kids! We had a blast on the slides and especially the wave pool. This was the best water park I’ve ever been to, 10/10.",
   "The park itself is a lot of fun, something for everyone and family oriented. The lines seem to be unnecessarily long sometimes because the kids working take too long to load the next riders... but even so they are really friendly and helpful. Only other issue was buying my season pass- the website is not transparent on the details and I wound up getting a season pass instead of a \"membership\". Not sure if it's too late to switch or upgrade but someone should evaluate the website to make more clear."
  ]
 },
 {
  "name": "Wesley Bolin Memorial Plaza",
  "address": "1700 W Washington St, Phoenix, AZ 85007, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ea2dc938-9332-11ea-b316-14b31f159f22.png",
  "tags": [
   "walk",
   "organized",
   "food",
   "free",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=9033999985428237731",
  "source": "GoogleMaps",
  "reviews": [
   "Totally enjoyable.  Walk through the monuments and read the plaques.  Leaves no group out. Great for all ages.",
   "Went for the annual 7A rally, and it was a great turnout. Thousands of armed but peaceful citizens rallying for their 2nd amendment constitutional rights. There was zero trash or littering to be seen. There was a heavy police presence, but no arrests were reported, as well as zero violence. There was a half dozen food trucks, so plenty of variety to choose from. Tents and tables were set up pushing their political agendas, as well as various political candidates running for office that were volleying for support. Very well organized and executed event.",
   "A lot of different sites. Police Military Firefighter much more. We really enjoyed this put together well great job. Free admission free parking. Across the street from the Arizona State Capitol Museum. We have been there multiple times and will return.",
   "Such a beautiful full of rich Arizona history. Our capital building is here. Some great statues and memorials as well. If you get a half day to spend here it's a good idea.",
   "Beautiful memorial! Well thought out and laid out. Thoroughly enjoyed spending some time walking through the grounds."
  ]
 },
 {
  "name": "Segway of Scottsdale Tours",
  "address": "7330 E Earll Dr Suite #R, Scottsdale, AZ 85251, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ea753294-9332-11ea-ba3e-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "learn",
   "tour",
   "knowledgeable",
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=13237825333853167510",
  "source": "GoogleMaps",
  "reviews": [
   "We had fun on this tour and got to see allot more about Scottsdale than we would on our own. The guise was a nice guy and told us a lot of info about the area. The bikes we cool to ride once you got a hang of it. Scottsdale was very busy due to Spring Training so it made it difficult to maneuver around town. The guide made allot of last minute changes and did not pay enough attention to the group at times so there was a gap within the group at times. One of the ladies has issues with her bike and I had to stop ti help her and he just disappeared on us. If not for my wife yelling to him to stop she would have gotten lost. I did offer some suggestions on his mic as at times he could not be heard or was really muffled please keeping a closer eye to the group. It I don't think he appreciated it. I am not picking on our guide but merely suggesting constructive feedback. I still tipped him for the tour. It is really worth doing and maybe at a time when there is less going on in town. Safe riding.",
   "Juan was our guide, he was patient and kind.\nLoved riding the segways.  Take the tour, you won't be disappointed.",
   "Awesome day touring Scottsdale on a Segway!\nIf you gets the opportunity to take a Segway Tour of old Scottsdale - don’t hesitate!  The Segway ride, itself, was a blast- something I’d wanted to do for some time. They teach you how to operate the Segway before the tour so can masterfully maneuver through the town.  Interesting things to see and learn as you go through beautiful Old Town Scottsdale. \nDefinitely recommend!",
   "What a fun tour this was!  Our guide was very knowledgeable about all things Old Town.  He provided a running conversation that was very interesting.  Both guides were very courteous and helpful in learning how to ride the Segway.  I was confident taking off on my own only after just a couple minutes of training.  I highly recommend taking this tour.  P.S. I'm 70 years old.",
   "Awesome!  Loved it!  Jason our tour guide was  great and entertaining.  Tour is the perfect length of time."
  ]
 },
 {
  "name": "Arizona Military Museum",
  "address": "5636 E McDowell Rd, Phoenix, AZ 85008, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eabbd8b6-9332-11ea-8ae9-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "history",
   "unique",
   "free",
   "learn",
   "tour",
   "history",
   "history",
   "historic",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=13901279212316716383",
  "source": "GoogleMaps",
  "reviews": [
   "A plethora of history on hand in a quaint museum. Found this gem exploring AZ, while visiting family, whom didn't even know about it themselves.  So much information and artifacts on hand and very interesting as well as educating. My 5 and 10 yr old loved it, as well as my 15 yr old nephew.  Side notes, entry is free and only open on weekends.  Highly recommend a visit here.",
   "Please give respect to the man at the gate and ready to show your ID. It's all the way in the back,. SW corner of the base. It was awesome to notice it was free to enter this fantastic little place. With courtesy they have a donation box and lots of books you can buy to help support more projects to add into it. I found out with the help of volunteers they are bringing in a tank next. Lots of eras and different sections \nwith unique and rare pieces still intact over the forgotten years.",
   "Had a wonderful time and had a great experience at the Arizona Army national guard Museum. The tour was contacted by a staff of soldiers and other staff members and veterans who have great knowledge of all the exhibits inside and outside museum. It was an honor to tour this museum as a member of the 8/55 military police company Who served in operation Desert Storm. Thank you for the wonderful tour I encourage everyone to come see this museum because you’ll learn the history of the Arizona , Army and Air Guard , Outstanding museum",
   "Incredible place! Everyone should visit and see the amazing history presented here.",
   "It's a free LITTLE museum but it's awesome. Has a lot of historic facts there and some really interesting pieces. The vet that was volunteering the day we went was absolutely amazing. He told us about his time in the Vietnam war as we were in the Vietnam room and showed us how the helicopter works the kids loved sitting in it while he explained. He was very kind to them and answered all their questions. Nothing like first hand knowledge."
  ]
 },
 {
  "name": "Phoenix Bat Cave",
  "address": "3698-3694 E Colter St, Phoenix, AZ 85018, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eb0c6a00-9332-11ea-971a-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "family",
   "walk",
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=5802311588684568082",
  "source": "GoogleMaps",
  "reviews": [
   "This is an amazing Bat cave, when I read the importance of bats in life I was surprised by how important they play a role in life, it was an amazing day to be there today. The weather and the view of the praying monk Mountain was just perfect, the Standford drive from 32nd st heading east it's a must do if you want to see the praying monk and get to the bat's cave, I didnt see the bats caming out of the cave but it was worth the time there, I think the wheather and the time was not time for them to come out of the cave. There is a beautiful canal with flowers by the bat's cave.",
   "Was a fun adventure. We went 7/22/19 and there was a few hundred + bat's coming and going. Not quite the large group we anticipated but was still worth the walk and adventure. The best part was seeing the sunset and seeing the BATS feeding and grabbing water on the canal behind the bat entrance!!",
   "This is a pretty unique and cool thing, and a bit of a hidden gem. I had some family in from out of town and brought them, and it was really cool! It is (obviously) hard to see the bats in the dark, so it's best to come right before sunset, just as they start to leave the cave.",
   "Wonderful atmosphere and a great access point to come walk the Biltmore canal trail!",
   "Google sent us to the south side of the canal the first night so the next night we parked at 40th St and Camelback to walk on the trail on the north side of the canal. The area is fenced off and marked so you can't miss it. A wheelchair can make it in, just remember the trail is sand. There are no available restrooms. Mexican Free Tail Bats can fly up to 60 mph so photos are tough to take, try making a video of them. We got there about 30 minutes prior to sunset which was perfect. You will walk back in the dark so take a flashlight. This is a child friendly event each night in the summer and is amazing to watch."
  ]
 },
 {
  "name": "Rio Salado Habitat Restoration Area",
  "address": "2439 S Central Ave, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eb6b9170-9332-11ea-9e38-14b31f159f22.png",
  "tags": [
   "unique",
   "nature",
   "hike",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=5086422279000130068",
  "source": "GoogleMaps",
  "reviews": [
   "My ducks!!! That's what I love. That and the fact that people leave you alone. But honestly, my ducks are my #1 reason for loving this park. When they see our truck or hear us call their names they literally come waddling as fast as their little webbed feet will allow. And I swear to you they're just like dogs in that their tailfeathers  are just moving side to side. They wag their behinds when they see us, follow us when we try and leave and literally all have they're own personalities. This park is amazing because of them!",
   "Quiet. Explorable. Back to nature. I enjoy it when I need out of the city for a moment, without driving far. A unique spot for Phoenix. Reminds me more of home up north.",
   "Love bike riding the trails here. Now that they have connected the trails you can ride all the way from Phoenix to Tempe. Great ride out past the airport. I usually park at Central Avenue and ride.",
   "Due to location... They have made a really nice place to enjoy.... Short walks or a good hike.   A variety of natures creatures an vegetation... The little waterfall was a gift for the soul.",
   "I love bridges structures, this is the perfect place to see bridges, there is also a downtown owls at the canal it was beautiful to see that, its a nice long walk, good to run or ride the bicycle."
  ]
 },
 {
  "name": "Peoria Sports Complex",
  "address": "16101 N 83rd Ave, Peoria, AZ 85382, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ebbce4f8-9332-11ea-bcd6-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "food",
   "free",
   "kids",
   "tasting",
   "food",
   "field",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2168085844272306260",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to spend a day watching the Mariners.  They go out of their way to give baseball fans an amazing experience. The variety and quality of the food was great. The staff was very friendly and appeared to truly care about the fans. It is family friendly and they have a great play area for kids.  Parking was only $5 or free if you can walk a few blocks to the complex. The ticket prices for great seats in the shade were very reasonable.",
   "My wife and i had a great dinner there.  It's been a while since we've been to one.  I think I had forgotten how much food you would get even if you ordered the smaller servings.  We ordered the lasagna and and Cesar salad and it was more than enough for the both of us.  Everyone these days offers a Cesar salad but very few are very good, this one was certainly one of the best I've had in a long  time.  We though the lasagna was good but not exceptional, I think we were expecting it to be richer tasting but it was fairly bland.  Our server was Jarrett and he was exceptional, very attentive, very informative.  Jarrett took the time to explain several of the dishes we had questions about very thoughtfully, and in detail. I think because of him we enjoyed the evening more than we would have otherwise.",
   "The ballpark is awesome! The grass area is perfect and my favorite place to sit. The volunteers working each game are very friendly. The only reason I give 4 stars is because the food and drinks are outrageously expensive! I'm pretty sure it's cheaper to go to Chase field! But, all in all, great place to catch a spring training game!",
   "Very nice.  Very friendly.   Delivery us with golf cart and took us to the gate.  Driver also made contacts with gate keeper and had wheelchair take us to our seating. And after the game, took us out in wheel chair and golf cart to the car.  This is that I will never forget.  First time here",
   "We loved this venue for a spring training game. The game was well attended. Every seat was a good one. \nThe margaritas were yummy and the food/drink prices were less than the other park we have been to."
  ]
 },
 {
  "name": "Steele Indian School Park",
  "address": "300 E Indian School Rd, Phoenix, AZ 85012, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ec0782b0-9332-11ea-ad2e-14b31f159f22.png",
  "tags": [
   "kids",
   "historic",
   "pets",
   "walking",
   "kids",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15561299676862919800",
  "source": "GoogleMaps",
  "reviews": [
   "My first visit to this park was actually quite uneventful and nothing to really write home about. My second visit there my boyfriend came along and showed me that I had actually missed quite a few interesting things  and it was all due to judging it by first glance and not getting my lazy behind out of the car to explore. There's a covered bridge over a pond that has very large fish in it, who apparently love slim Jim's. There's many different pathways you can utilize. All of which bring you to what was once probably a beautiful many tiered garden. It's forlorn and forgotten, but the different levels and the layout in general make for an interesting stroll. There's also the old asylum which is a magnificent building and the veterans memorial as well. \nSee, if I had just taken the time to explore and get to know the park, instead of \"judging a book by its cover\" I would have realized how interesting it was and the many fantastic things it has to offer. \nLife lessons y'all because, honestly,  don't many of us judge each other too quickly and harshly in our everyday lives? Take time out to get to know a person, place or thing before judging it. You never know what wonderful experiences await. 🌼🌺",
   "I've lived in Pix for more than 20 years and have never visited this park. What an error! Such a beautiful park! Filed with historic markers, plaques, and other observances. Well laid out, full of fountains, lakes and walking trails. A quiet bubble of solitude in the middle of urban Phoenix...its a great place for the kids or a date or the pets or just by yourself! I'm definitely going to find another reason to visit again,!",
   "It took years before that run down old school finally became a nice park and central Phoenix sure needed it badly in the middle of town. I remember the Natives mostly Navajo jumping the fence to get a soda or better still a beer or two. This really is our own Central Park. When I went to Central High years ago it wasn't any kind of school or park either but a mess next door to my high school. Now it's getting there. Looking closer to completion it is getting there. (Some day)",
   "We go all the time, we love it. We're are PoGo players and this park is perfect for that. There's also the stocked fish pond for people who like to fish, lots of paved walk-ways, a park for kids, pavilions for parties and cook outs, and I love to feed the endless amounts of ducks on the pond. Perfect place for photographers, readers, families looking for a fun park for the kids.",
   "Went to the Phoenix Highland Games. The food was good and the booths were plentiful with something for everyone. I was able to look up my family clan and buy kilts, pins, jewelry, blouse, boots, and a scarf with my family clan tartan. Best of all were the Highland Games and Scottish bands."
  ]
 },
 {
  "name": "Heritage & Science Park/Historic Heritage Square",
  "address": "115 N 6th St, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ec5506b0-9332-11ea-b03b-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "unique",
   "kids",
   "food",
   "food",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=5528504586274015292",
  "source": "GoogleMaps",
  "reviews": [
   "We went on the house tour and had holiday tea there after.  Every time I go there I find out something new!!  The tour guides are very interesting and knowledgeable.  The tea afterwards was a nice way to spend a nice relaxing time with friends.  The nibbles were tasty and they were great about making sure our teacups stayed topped off.  Definitely plan to go to their next tour and tea!!!",
   "Very peaceful place with great restaurants. We went to Anhelos and had the most amazing time.",
   "One of my favorite spots in pheonix. I love downtown Phoenix and heritage square is a must stop! It's right across the street from the childrens museum. The science museum is in the same block and it's a great place to bring the kids. They had a huge pile of snow this year for the kids to play in. The old houses have been restored and look amazing. The feel is so unique and takes you back in time to old pheonix. There are food and cocktail options right in the square, a great grassy area you could bring your own picnic, and a parking garage right there. Make a day of the museums and food, you wont be disappointed.",
   "Enjoyed our time at the Phoenix Flea today for small business Saturday. Lots of great booths and food vendors. We even brought our Pet Rabbit Ollie to share in the fun.",
   "Always nice to take a walk downtown. Never crowded and very clean Downtown Phoenix is great city!"
  ]
 },
 {
  "name": "Arizona Boardwalk",
  "address": "9500 East Vía de Ventura, Scottsdale, AZ 85256, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eca990f8-9332-11ea-93fb-14b31f159f22.png",
  "tags": [
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2948606986020116899",
  "source": "GoogleMaps",
  "reviews": [
   "This place is AMAZING for your little ones! I still believe WAY overpriced for some shops and museum's available there. Trying to create incentive to purchase tickets to multiple places at once to \"save money\". Sorry honey, I just don't believe I should pay $40 for ONE adult and almost $35 for a child just to go to the aquarium. Just my opinion. Should offer a larger military discount and make it more of a DEAL when purchasing tickets to MULTIPLE places. \n\nThe restaurants available need to step up if they really want to thrive. Mediocre food, again completely overpriced and you can see the staff are completely stressed out. \n\nBUT, overall, if you have a good chunk of money and you want to spend a nice day with your kiddos I would recommend this location. I still had a lot of fun.",
   "Had a wonderful time at the Butterfly Wonderland. My wife and I had never been there before. It is very informative and a great place to go. It is humid in the giant room they fly around in. We were able to watch a butterfly release when we were there.",
   "This was a fun trip. Lots of neat things to do around here. Easy to spend all day. Reason for 4 stars is I would consider it a little more of a seasonal place summer time would be a little less enjoyable for kids running around and what not.",
   "What an amazing place! We cant wait to go back and see more. Our son had a penguin following only his hand for over 20 mins. Passed everyone up to see him. Made his day for sure. We all enjoyed every part of it.  Our son that's 6 really can't wait to go back. The staff was so friendly.",
   "Wonderful place! Children play places, tons of educational boards and even an educational speaker show in the aquarium. There's a bunch of nice stores as well. And, the bathroom on the entrance floor even has a window to the shark aquarium!"
  ]
 },
 {
  "name": "Arizona Jewish Historical Society",
  "address": "122 E Culver St, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ecf6a01a-9332-11ea-a411-14b31f159f22.png",
  "tags": [
   "historic",
   "history",
   "music"
  ],
  "link": "https://maps.google.com/?cid=11012250642779847489",
  "source": "GoogleMaps",
  "reviews": [
   "I didn't even realize this little treasure of a museum was in Phoenix until my daughter had a recital here. I was very impressed.",
   "Wonderful wedding venue.  If you are looking for a place that is not out to give you the \"wedding tax\" I recommend this.  This historic building is the perfect place to start building your memories together :)",
   "Lovely synagogue, cottage and education buildings that are a slice of Phoenix history. I always enjoy going for events & services.",
   "Stimulating programming and friendly staff. The building has been lovingly restored to its original look.",
   "Venue for a contra dance event with live music.  Space was nice for dancing.   Another area of the  building  included a small museum.  Current exhibit on the Holocaust.  I will visit again to spend more time in the museum."
  ]
 },
 {
  "name": "Apache Wash Trailhead",
  "address": "1600 E Sonoran Desert Dr, Phoenix, AZ 85085, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ed3ba312-9332-11ea-9a04-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=17159700779891287076",
  "source": "GoogleMaps",
  "reviews": [
   "A great place to bike, hike or push a stroller! On a path or on pavement through the desert or hike up the mountains.  Easy or little more.  Bring drinking water and sunblock!",
   "Explored this trail system for the first time today. Did Apache Wash to Sidewinder to Ocotillo for a nice loop. Had decent elevation gains but plenty of down hill and flat to give the legs and lungs a break. The wildflowers were beautiful and we got a nice treat of hot air balloons taking off right at sunrise!",
   "From Apache Wash Trailhead, you can hike several trails that are flat or uphill. I have only hiked the Apache Wash Loop Trail uphill to Sidewinder and Apache Vista. The trail is heavily trafficked in the morning, but not so crowded late afternoon. However, if you choose to go for sunset, take note of closing times. These trails offer pretty views and a good workout for all hiking levels. There are a lot of runners and mountain bikers going up and downhill. The flat trails are great for horseback riding. There are plenty of parking spots, fairly clean flushing toilets, and water fountains by the trailhead. Also, you will often hear the sounds of airplanes and helicopters. Sometimes, you will see hot air balloons.The photos I’m uploading are from November of 2018 and October of 2019. These trails don’t offer shade, so the best times to hike them are from fall to spring.",
   "Wonderful trails! It's such a beautiful area with lots of options. There are bikers, hikers, horses and dogs! 😊 The trails are well marked so you always know which one you're on. \nWe went on a Saturday morning at about 9-10 am. It was busy, but not too crazy. It seemed like it was getting a lot busier when we left though. I would definitely recommend this for a nice, easy-going hike.",
   "Great place to start your hike or ride.  Lots of parking and there are washrooms.  Make sure to bring lots of water as there is not drinking water available.  Great views from the trails but know you will be gaining elevation.  Also a flat paved path if you like it smooth."
  ]
 },
 {
  "name": "Scottsdale Historical Museum",
  "address": "7333 E Scottsdale Mall, Scottsdale, AZ 85251, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ed8c8728-9332-11ea-b3cc-14b31f159f22.png",
  "tags": [
   "free",
   "history",
   "free",
   "history",
   "knowledgeable",
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=14892824957280312291",
  "source": "GoogleMaps",
  "reviews": [
   "This museum was a nice surprise and tons of interesting facts about the history of the city. Really striking that they were on DC current till 1952.  The staff was very helpful and gave us lots of tips on what to do in the area. Admission is also free.",
   "I visited this place in the last week of May, and the Museum was closed - I am not sure if they close it every summer, or if they are undergoing some maintenance activities and so they have closed the Museum. Nothing was clearly mentioned over there. But, I really liked the surroundings g area of Old Town Scottsdale and was grateful for making a decision to visit the place.",
   "Loved it! The history of Scottsdale was amazing! I especially loved the little classroom and the old kitchen.  The staff was super courteous and helpful! It is free but make sure to leave a donation!",
   "An excellent little museum. There's a lot of history there about the little red schoolhouse that began in Scottsdale so many many years ago. The people who volunteer there were knowledgeable and helpful.  It was very interesting to see how far Scottsdale has come from when it first began.  A great way to spend an hour or so😊👍👍👍👍👍",
   "Great for the hole family interesting info about old Scottsdale from 1904."
  ]
 },
 {
  "name": "Gila Valley Lookout",
  "address": "14635 S 25th Pl, Phoenix, AZ 85048, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/edd8753e-9332-11ea-9968-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=12513095302212014960",
  "source": "GoogleMaps",
  "reviews": [
   "Omg the views from here are amazing.. Lived here my entire life and never knew this was here!! A must see",
   "The road up is windey and curvy. Watch for bicyclists and crazy drivers. Enjoy the view.",
   "Great view of the valley.  If you can get there before the sun sets and wstch as the valley transitions from day into night and watch as the lights of the valley come go life.  It is really quite amazing.",
   "Really fun drive up to the lookout. Just come at a time that it's not crowded.",
   "Beautiful ride with awesome views for the valley! Highly recommend!"
  ]
 },
 {
  "name": "Phoenix City Grille",
  "address": "5816 N 16th St, Phoenix, AZ 85016, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ee2fe052-9332-11ea-88e9-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "music",
   "knowledgeable",
   "art",
   "food",
   "walking",
   "delicious",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10840478795017150932",
  "source": "GoogleMaps",
  "reviews": [
   "The ambiance and decor at this restaurant are modern and most attractive. The service was first class. The menu was interesting and varied. I had the octopus followed by the lamb chops, both of which were superb. The staff was very helpful, and the dishes were enjoyable and plated nicely. I will return soon!",
   "The food was delicious. There were 5 people in our party and everyone chose a different food item. The service was very good. Our waitress was friendly; kept returning to see how we were doing. The major problem was the loud music blasting from the many ceiling speakers. Conversations were very difficult to hear. A good dinner should include quiet background music at a level that does not impede conversation. It is doubtful that we will return.",
   "Went to this place on a whim and fell in love! Service was knowledgeable and prompt. Food was delightful! And the owner was walking around greeting everyone. We struck up a conversation about the art which was exquisite, would definitely recommend.",
   "The food was delicious. There were 5 people in our party and everyone chose a different food item. The service was very good. Our waitress was friendly; kept returning to see how we were doing. The major problem was the loud music blasting from the many ceiling speakers. Conversations were very difficult to hear. A good dinner should include quiet background music at a level that does not impede conversation. It is doubtful that we will return.",
   "Great food chef is always coming up with new specials very accommodating, great service ask for Carla she is the best, but all the servers are great!!! Just agreat great place"
  ]
 },
 {
  "name": "Binkleys Restaurant",
  "address": "2320 E Osborn Rd, Phoenix, AZ 85016, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eec0870a-9332-11ea-b08c-14b31f159f22.png",
  "tags": [
   "eat",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15302224716207378406",
  "source": "GoogleMaps",
  "reviews": [
   "I ate here for a friend's birthday and it was amazing. It was not a dinner, it was an experience! The chef is outstanding and meticulous with every detail. I am very picky and this was one of the top 10 meals I have ever had. And I've had the opportunity to eat at some of the best restaurants in the world. My only complaint is how hard it is to get a reservation. But I understand why.",
   "Truly an experience you should indulge in. Do the wine pairing. Do the add ons.  Expect to be there for 3+ hours.  Expect some dishes that blow your socks off.  I've eaten in some of the best restaurants in the world an chef Binkley can stand toe to toe with many of them.",
   "Bravo for the excellent service! I was feeling happy and satisfied with your dishes. All of your dishes were so friendly to the pocket. You expect me to visit your place, and I will surely taste your dishes again. You didn't fail to impress me, so I decided to recommend your restaurant to all of my family and friends. Thanks!",
   "It was an exceptional restaurant food and service. I honestly love to come back again and again at this place. Fantastic foods and amazing crew are impressive. I couldn't ask for more! I will never look for other restaurants again for sure. A loyal customer here! Trust me! You will never be disappointed for sure.",
   "What an amazing experience filled with a staff who care so much about ensuring your time is one of a kind and memorable. Chef Binkley is very welcoming and makes himself available to chat regularly with his guests. There is an incredible attention to detail as well. I highly recommend Binkley's for an unforgettable experience."
  ]
 },
 {
  "name": "Bobby-Q BBQ Restaurant and Steakhouse",
  "address": "8501 N 27th Ave, Phoenix, AZ 85051, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ef0aaf8a-9332-11ea-8c72-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11940719194717959783",
  "source": "GoogleMaps",
  "reviews": [
   "I had read about this place before we even headed to Phoenix, so had been looking forward to a meal here. We planned to go to the Phoenix location, but ended up closer to Mesa so we went to that location. My friend had injured his leg on our vacation so we needed a booth, and the hostess set us up in a nice area. I got a margarita, which was fantastic! We both got different two rib combo and it all was to die for! The cornbread was delightful too! The fresh donuts on our way out was a nice touch, too. We were really happy we came to see y’all!",
   "Easy to find. Ample parking. We received a pleasant greeting and were quickly seated. The menu was easy to read and had a good variety of BBQ dishes, salads and sandwiches. Wait staff was helpful and attentive. Our orders were delivered within a reasonable amount of time, were hot and well plated. Serving sizes were generous enough to encourage take home. Dining area and restrooms were clean. We will be back!",
   "I am a very happy regular customer of Bobby Q, and have visited all three locations with consistent delicious brisket. Recently they started offering a family feast deal for carryout. The price is amazing, the food is awesome, and service is friendly. The family feast introduced me to their half chicken. While I still think the brisket is the best item on the menu, their BBQ chicken is also amazing.",
   "Pains me to write this because the food is good.. realizing these are difficult times socially and financially. But why offer take out if you can’t support the volume? Tried several times and no one answered the phone arrived and waited an hour to get our food.. there were not a “lot” of orders maybe 10-20... and today they sent another text they raise the price $10 for the same item.. I hope you can make it you’re a great local business but please staff appropriately.. there is no reason with small volume of orders and a limited menu it should take an hour.. The only sides offered were coleslaw, beans and Mac n cheese. These are all prepped you just have to portion out.\n\nPlease let me know if you’re staffed and we’ll give it another shot but can’t jeopardize my families health waiting an hour with other folks.. we want to support you but you have to meet half way.\n\nDo online ordering or Better phone answering.. prep better and have a “drive thru” for pick up. You have the space and probably the staff ( if you keep them on and working) to support to go orders better. Spend money on staff to make money...",
   "The food was delicious! I hoped it would be and expected a wait being that it was Saturday night. Reservations recommended. 40 minute wait time went by fast. We were seated in a lovely outdoor space equipped with a heater. Which was good because it was cold out! My roasted chicken tasted like it was cooked in a campfire. So good. The creamiest mac n cheese you ever had. Ribs sticky and tasty. Yummy cocktails even. Server Leanne was prompt and very sweet to me and my family. And she explained the menu very well. Be prepared to spend some money but worth it in my opinion. Good decor, good food, good service and good cleanliness with friendly staff. We will be back."
  ]
 },
 {
  "name": "Hillstone Restaurant",
  "address": "2650 E Camelback Rd, Phoenix, AZ 85016, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ef4c2598-9332-11ea-8948-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6454049505590439210",
  "source": "GoogleMaps",
  "reviews": [
   "The restaurant is large but effective in breaking up into small places. It was quiet and all could hear each other. You felt as if you wee in a private room. The mood and ambiance is restful and very suitable for couples having a pleasant evening together. The sushi (Rainbow Roll) was well made and tasty. The appetizer were also quite tasty (Artichoke and spinach dip ). I also had a Manhattan. It was served in a chilled glass. When I was halfway through, the server noticed that the glass was no longer frosted and poured the balance into a newly frosted glass. It was an example of the top shelf service that you get at this restaurant. I highly recommend this restaurant.",
   "Usually love it .. tonight was an off night I suppose.  Sushi was kinda warm, french dips and burger and and all fries were quite cool.  Not busy.  At 9p the floor cleared and not one staff member on the floor for about 5 minutes, everyone disappeared!  Very strange.",
   "We had a party of three reservation Sunday evening and were seated within 5 minutes. The service is exceptional and the food very good. Constant attention without being bothered. Everyone enjoyed their food. We are from California and visit Houston's which is a Hillstone property. Very similar food, but no cheese bread! Our party ordered two different salads and the Chicken Sandwich. We also shared a Cobbler. Very nice employees. I would recommend this place for drinks, dinner or lunch.",
   "We had a party of three reservation Sunday evening and were seated within 5 minutes. The service is exceptional and the food very good. Constant attention without being bothered. Everyone enjoyed their food. We are from California and visit Houston's which is a Hillstone property. Very similar food, but no cheese bread! Our party ordered two different salads and the Chicken Sandwich. We also shared a Cobbler.  Very nice employees. I would recommend this place for drinks, dinner or lunch.",
   "The is a great location for business meetings. It was crowded with good looking folks eating amazing looking food. The kale salad is delicious and the tuna rolls are meaty and delicious. The staff are exceptional. Make sure and call ahead for seating times. We sat on the patio and enjoyed the smoked salmon and pressed sushi. Wow!!"
  ]
 },
 {
  "name": "Steak 44",
  "address": "5101 N 44th St, Phoenix, AZ 85018, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ef90f6f4-9332-11ea-aa52-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "walk",
   "drink",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11444269267017849278",
  "source": "GoogleMaps",
  "reviews": [
   "We had friends in town from Minneapolis and it was the husband's birthday. We went to Steak 44 and it was outstanding! We were greeted and welcomed by each staff member as we walked through the restaurant (felt like we were celebrities:) The servers were very attentive to every request, cocktails, wine and food were excellent. Great atmosphere! Request a booth by the kitchen -- very cool! Highly recommend this restaurant!",
   "We had friends in town from Minneapolis and it was the spouse's birthday. We went to Steak 44 and it was outstanding! We were greeted and welcomed by each staff member as we walked through the restaurant (felt like we were celebrities:) The servers were very attentive to every request, cocktails, wine and food were excellent. Great atmosphere! Request a booth by the kitchen -- very cool! Highly recommend this restaurant!",
   "The food is spectacular. The table service is phenomenal. The wait staff were very attentive during the entire dinner.  The only reason that I didn’t give 5 stars is because the hostesses at check in were very indifferent. If you are paying $$$ for a dining experience the hostesses should be as phenomenal as the wait staff.",
   "Came here with my significant other and our best friends for a double date. This was THE BEST dining experience we ever had. The service was absolutely incredible from the attentive and entertaining wait staff to the follow up phone call the next day thanking us for dining with them. The food was out of this world! Our steak was cooked to perfection, every bite melted in your mouth, and the seafood features and shareable side dishes were phenomenal. \nI completely recommend this place for an amazing dining experience. From beginning to end, we had the best time. I will be coming back again to celebrate future occasions purely based on this first time experience.",
   "Stopped in to celebrate my birthday and can honestly say I had an incredible experience. From the moment you walk through the door you are greeted with smiling staff, and a beautiful atmosphere. Hector was our server and he was absolutely wonderful. He was very attentive, and super helpful when it came to recommendations on what to eat. He really went out of his way to make my birthday dinner great. And the food is to die for! Best steak around served up to you on a nice, sizzling, hot plate. They also have a great drink menu and dessert selection. \nSadly I am a Florida native so although I can't be there anytime soon, next time I visit the Phoenix area I am 100% going to be stopping here again to eat!"
  ]
 },
 {
  "name": "Chelsea's Kitchen",
  "address": "5040 N 40th St, Phoenix, AZ 85018, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/efd700c6-9332-11ea-a0d1-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "walk",
   "knowledgeable",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=15919152627754095207",
  "source": "GoogleMaps",
  "reviews": [
   "We all had burgers and sat outside as it was a cool evening in the spring.  We did have things dropping off the trees onto table, but it wasn't the end of the world for us.  If a leaf falling on your food would freak you out, you should stay inside.  Waitress said they cooked burgers slightly under, so we ordered more well done than usual.  They were cooked as ordered, and not under.  So maybe they have gotten better at their temps.  We all were fine with how they came out as we are flexible.  For me I felt the prices were a dollar or two high for the overall quality.   The food was tasty, but not enough high end to justify the cost.  The salad side was a great option.  The tuna burger was also nice.",
   "I had the best time there last night. The team was remarkable as well as the food was even much better. Buddies, as well as I, had a booth by the cooking area as well as our steward was so efficient handling our insane personalities. The bar staff was outstanding as we headed to bench for a nightcap mixed drink. I left my glasses there and they currently had them for me and also not to worry, they are not shed. Everything was tasty and also taking my parents next time. Many thanks all",
   "Very cool spot! When you walk up to the front door you are hit with this amazing smell from their outdoor bbq pit. We sat on the back patio, great atmosphere. The waitress was very knowledgeable about the dishes and gave great recommendations- we had the guacamole to start, very fresh- then I had their surf and turf tacos and key lime pie for desert. I would order it all again.",
   "As fresh as it gets. I tried the Tomatillo Melon Gazpacho and it was dreamy good. I have not done many cold soups but this has changed my mind. Very light and full of flavor. You must try it, especially as the heat dials up. A great way to cool off! We then split the rotisserie chicken. Great earthy flavor but I’ll be honest. The star of the plate was the roasted corn and zucchini vegetables. Outstanding all the way around.",
   "You must be at the top! If you are looking for affordable and tasty dishes, you can visit this restaurant near our area. Last Sunday, I was so thankful to your staff for serving my order quickly. I like the place because it was so romantic and good for those who have partners. Expect me to visit your place again! Highly recommended!"
  ]
 },
 {
  "name": "Beckett's Table",
  "address": "3717 E Indian School Rd, Phoenix, AZ 85018, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f01ec8c2-9332-11ea-b4e6-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "unique",
   "family",
   "food",
   "delicious",
   "drink",
   "food",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=4090768213893596433",
  "source": "GoogleMaps",
  "reviews": [
   "The food here is really excellent! My husband had a rice cake grit appetizer he said was amazing with a lot of unique and unusual flavors mixed together, while i had the roasted red pepper soup which was yummy! My Scottish Salmon was cooked to perfection with a wonderful pineapple glaze and he tried their Australian Sea Bass,  barramundo, which i tasted and was delectable. You can tell each dish is prepared with such thought, caring and passion for what they're doing in this restaurant. The fig pecan pie with cream cheese ice cream added the finishing touch to our meal. We've been here several times in the past, i don't remember why tonight was the most memorable meal I've had here, but you can be certain we'll be back!",
   "So I and a colleague decided to talk about our business over dinner at Beckett's Table in Phoenix. The good reviews were well-deserved. Everyone on the staff was welcoming and friendly. The waiter made sound suggestions. The menu and drink list are unique (but similar to their sister restaurant--Southern Rail), servings were large, and the food was delicious. There was just two of us. But they have areas/setups that could accommodate business or family groups.",
   "It's just soooo good. Every time I'm at Beckett's Table I wonder why we don't get there more often. The service is always super friendly and the food is wave after wave of comfort and deliciousness. Great cocktail program and fantastic selection of Arizona wine too. It feels like love.",
   "This place is the #1 favorite for my wife and I. We had our second 1st date (yes, you read that right) at this place and have been coming back as much as we can.\n\nThe short ribs are absolutely amazing. The pasta is all fresh made daily and I've never had a bad dish (and Chef even holds classes every once in a while to teach how to make it).\n\nMy wife loves the beet board with goat cheese. They also have an extensive wine and cocktail selection and probably the most attentive staff I've encountered with the exception of maybe Kai at Wild Horse Pass. \n\nYou can't go wrong with this place...and it's not even expensive. Feels like you're eating an amazing dinner at home!",
   "The best restaurant in town! Trust me! You will never be disappointed for sure. Their foods were very admirable and delicious. I couldn't ask for more! I will definitely be going to save their contact number for future reservations. I won't forget to recommend this restaurant to all of my friends and family as well."
  ]
 },
 {
  "name": "Different Pointe of View",
  "address": "11111 N 7th St, Phoenix, AZ 85020, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f06e6f78-9332-11ea-804b-14b31f159f22.png",
  "tags": [
   "unique",
   "free",
   "food",
   "walk",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9753363138849406918",
  "source": "GoogleMaps",
  "reviews": [
   "Gorgeous arrangement and also the environment. We selected the 6-course dish to obtain the full experience, as the web server recommended. Everything was a layered photo ideal. Various structures as well as combinations that worked as well as were impressive.\nI wasn't a fan of some of home plates. The potato, as well as gnocchi as well as the chicken, were my least favorite.\nI would certainly enjoy to see again and also taste different plates. Please keep the Apple and also Celery sorbet- so scrumptious!",
   "The food, the service and the view, all amazing! It is quite a winding, confusing drive to get to this restaurant perched on top of a mountain, but worth it once you get there. It is a beautiful and fancy ($$$$) place that you can visit in slightly nicer than casual clothing, and treats you like royalty. Unique menu items, willing to make alterations if need be (I asked for gluten free bread with the bread plate, they didn't have it but gave me a small plate of cooked and chilled veg/potatoes to dip), and attentive service. I would go here again in an instant if only I could afford it! Worth the drive and the expense for something much nicer than the norm.",
   "The View! You have to visit Different Pointe of View when you are in or near Phoenix, Arizona. Yes, the View is Amazing! When you finally make the drive up the mountain to get to the restaurant you will love the view in the Day or Night. The presentation when you walk up to the valet is breath taking. Everything seemed to have a place and the attention to detail was noticed by everyone. Dinner music was playing and on this night we missed the piano being played for the day. This is a Four Diamond restaurant and it shows from the service, decorations and quality in the food. I've had some good steaks from around the world. This place ranks high with the cut of meat,  presentation, taste and quality of meat. They have a wide selection of wines, cigars and cocktails to chose from on display. The staff triple teams you for the speed of service and quality of the visit. The view on the patio was stunning and i took numerous pictures thinking it might be a while before I'm able to return to this beautiful view. The food, view and service are all reasons to visit Different Pointe Of View!",
   "Meet some good friends for drinks there and watched the sunset. Beauty beyond description. Service was great. Pricey but well worth it. Parking could be a challenge unless you valet. You'll love this place.",
   "What a wonderful restaurant.  Food was excellent, atmosphere dynamic and views spectacular.  The lamb shank was done perfectly, not greasy but tender and cooked perfectly. The duck was excellent complement by sides of ravioli and vegetables. Great cocktails and service was outstanding. Will visit again when I am in Phoenix."
  ]
 },
 {
  "name": "North Italia",
  "address": "4925 N 40th St, Phoenix, AZ 85018, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f0bb0a94-9332-11ea-b4dc-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1917533972181229100",
  "source": "GoogleMaps",
  "reviews": [
   "Enjoyed a wonderful meal with family last night at North Italia. Had the fresh made pasta and meatballs. It was amazing! The meatballs and sauce were perfect. Others had the scallop entree and said it was great as well. Very nice wine selection and the service was great. It was busy and the parking lot is not huge, so the valet parking was much appreciated.",
   "Went here for lunch on a Saturday with my sister. It outside on the patio was nice as they had warmers and the fireplace going. Once in a while we would smell something odd/gross. Not sure if it was something from the street/nearby and if it's always there or just at that time. Hostess and waiter were super nice and friendly. The food was amazing. My sister got an omelet and I got a pasta dish. We liked both. The Zucca chips came recommended and said yummy on the menu - They were just average.",
   "Very good food and service!  Highly recommend the Crispy Calamari appetizer (perfection, some of the best I've ever had).  Their personal pizzas are quite good, but if you're more in the mood for a salad, you wont be disappointed either.  Portions are hefty so be prepared to box some for later if you're not a hearty eater.",
   "Ohhhhh!!!! I can't say enough about this place so straight the point. This is absolutely a favorite great food and atmosphere. The energy tone I can't wait to go back for brunch .",
   "Always a great atmosphere. Always great services. Always great meatballs. What more can I say? We love going here and usually reserve it for special occasions (holidays and birthdays) but I should really stop in for Happy Hour sometime for a tall glass of wine, some bread, and more meatballs!"
  ]
 },
 {
  "name": "POMO Pizzeria - Downtown Phoenix",
  "address": "705 N 1st St #120, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f10448e6-9332-11ea-97d1-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "food",
   "delicious",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7682611097313625777",
  "source": "GoogleMaps",
  "reviews": [
   "The food was good.  I would recommend getting there late enough to catch the late night happy hour.  Lot of good varieties of pizza...  Ours was a bit over cooked on the bottom.  I know it's brick oven pizza so I can appreciate a little char on the bottom.",
   "Last Wednesday, my family and I were completely happy with the delicious foods and the drinks that we ordered. It was satisfying and worth it at a reasonable price. Besides, we thank the waiter and the waitress that served our order at that time pleasantly and correctly. Honestly, every minute and hour that we spent in your restaurant was filled with fun and enjoyment. Thanks!",
   "Nice and casual atmosphere, great service and excellent food! Definitely get the mozzarella balls, it comes with this amazing sauce. The pizza is good and their tiramisu is excellent. Will definitely be coming back!",
   "Our food was delicious and the service was good. Happy hour begins at 3 on Sundays so we were a bit too early but the drink prices were pretty reasonable as it was. All pasta is made in house. The gelato is as well. The bread has a good crisp crust. The outdoor seating was good and when the sun was in my eyes they quickly lowered the shade for me. We were very pleased with everything and we will be back.",
   "Went on a week night with a group of friends.  Had a nice spot on the patio.  The food was very good.  Happy hour prices were excellent.  The service was a bit slow and some of our dishes weren't served hot.  That's why I can't give more stars.  I don't know that I will go back because of that, even with the good food and good happy hour."
  ]
 },
 {
  "name": "Dick's Hideaway",
  "address": "6008 N 16th St, Phoenix, AZ 85016, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f14f5bc2-9332-11ea-b13c-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14852922862507005204",
  "source": "GoogleMaps",
  "reviews": [
   "A small hole in the wall entrance but actually great ambiance and great food if you are able to get a seat! They serve modern Mexican food. I normally go for their brunch and that's been amazing - large portions and quality enchiladas. \n\nI went for dinner and had swordfish. Unfortunately my dish and my friends fish dish were overcooked. The fish was hard as rubber :( I've heard good things so I'll definitely try again!",
   "Was told to wait up front for a table, as we were waiting another two top walked in and went to sit at the bar. Another bartender told them to go sit at the table we were politely waiting for. We told the server we had been waiting and she said oh okay well there is a shared table but that's it...no sorry let me work something out nothing. Asking for better communication between the staff as it pertains to seating the restaurant is all. Decided not to wait for another table, but it seemed like a good place to eat.",
   "Great out of the way place. Great food and brunch is until 4pm. Nice drinks and a really chill atmosphere. Sit at the bar and you can see the cooks make your food from scratch right in front of you.\nRemember: no Kardashians or dudes in tank tops allowed. Also for safety the cooks all wear condoms. I appreciate safety from my eating establishments",
   "Definitely a great breakfast.  If you are lucky Danni will be your waitress.  The food had great flavor and cooked well.  If you are deciding on a breakfast restaurant, quit looking. This is the spot. The food reminded me of a roadtrip I took in New Mexico.  We got lost and ended up at some restaurant.   They said Billy the Kid was killed there or something like that.  The Chile Verde salsa had so much life .",
   "After having read and heard many great reviews and comments about this restaurant, we had high expectations. These were indeed met. The food is excellent, probably the best we have ever had in this town. The chef said he has a nice repertoire of vegetarian dishes, and true enough, we were not disappointed!  I will return to this restaurant for business meetings in the future."
  ]
 },
 {
  "name": "Restaurant Progress",
  "address": "702 W Montecito Ave, Phoenix, AZ 85013, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f1a173f6-9332-11ea-9852-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3710377365411681295",
  "source": "GoogleMaps",
  "reviews": [
   "I'd like to start by saying that everyone we were in contact with on this night was so kind & warm. We made a reservation for a patio table in August but the temp was just right with the fan on. Our server was knowledgeable on drinks & the food. The food came out in a timely manner & I loved that every component was seasoned or had it's own flavor to contribute. Pictures of what we had are posted. The only gripe we had was a minimal desert menu (2 options I think?). We would def go back & we would def recommend to friends 😊",
   "JOB WELL DONE! This restaurant is one of the best in the area, and the food that I like the most here is their rib-eye steak. The taste of it is really the best, and everything else is great too. This place is really nice, and I want you guys to try them too. Truly mouthwatering food and desserts! Strongly recommended!",
   "I was introduced to this by a friend who lives nearby. Truly a spectacular meal - much of their ingredients are locally sources, and there is an emphasis on organic, as well. The servers are well acquainted with the wine list and make excellent recommendations for food and wine pairings. The prices are reasonable, especially when considering the quality and service.",
   "My husband and I went here for my birthday the other evening and it was such an amazing experience. We did the 5 course meal and each course took you through a layer of fabulous flavors. My tastebuds were the happiest they’ve ever been! The food is fresh and there is a lot of passion put into it. The service was also spot on. Everyone was warm and attentive. They go above and beyond to make sure you are well taken care of.",
   "Restaurant Progress was recommended to us by the Arcadia Meat Market staff, and we are really pleased they did. There is a very well-considered menu with lots of options for any dietary restrictions, and the friendly staff were very able to discuss options and make recommendations. Same for the excellent wine list, and recommendations were spot on. The decor is interesting, and the atmosphere is not excessively loud. Highly recommended."
  ]
 },
 {
  "name": "Wright's at the Biltmore",
  "address": "2400 E Missouri Ave, Phoenix, AZ 85016, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f1f4df28-9332-11ea-bbea-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18316500588396817134",
  "source": "GoogleMaps",
  "reviews": [
   "Wow, where to start! Me and my girlfriend came here during Valentine's Day and had a WONDERFUL evening. The restaurant is beautiful, with an ambiance that was perfect for the holiday of love. I was blown away by our server, James Crnkovich. He was one of the best servers I've had in my entire life. His professionalism, combined with a contagious smile, made us feel so welcomed and at home in the restaurant. He helped us pick out our meals, as well as a wine to go with each of them. I had the beef tenderloin, which was delicious and melted in your mouth. Plus when paired with the cherry sauce was a beautiful melody of flavors to enjoy! The pasta (although I wasn't allowed to have much) was delicious as well! My compliments to chef Jesus on cooking our meal, we were very satisfied with his work. I would recommend this restaurant to anyone who is wanting to check it out! The price wasn't overwhelming, and the service, atmosphere, and food were well worth the price point! I look forward to the next date where we get to enjoy this fine establishment.",
   "The most fantastic food and wine in the city! I try to visit it every time I am here for business. If you need a place for special occasions, business or private, this is the place. I love how the food is presented and how it tastes even better. I will surely come back and recommend the restaurant to all of my friends for their wonderful service and good food!",
   "Excellent food and service. I was expecting typical hotel restaurant food which is usually mediocre at best with a beautiful atmosphere, and was pleasantly surprised by what a delicious dinner we had! My salmon was cooked perfectly and very moist accompanied by an array of beautifully prepared veggies. Everyone loved their filets and one person enjoyed the short rib. My salad was the best one at the table the beet and goat cheese salad. The little gem salad and the wedge were a disappointment, so skip those. The chocolate torte was a nice way to finish the meal. We will definitely come back.....",
   "Wright's at Biltmore was fantastic, the appetizers and entrees were spectacular, I personally had the Scallops and it was some of the best food I have had in recent months. The wine and beer are spectacular as well, with both of my present company fully enjoying their drinks, and the wait staff was calm and nice, and very patient. The bill was a mind boggler, but the food is worth every cent, especially if your staying at the hotel.",
   "Beautiful food, service and atmosphere. What can I say? Worth every penny."
  ]
 },
 {
  "name": "The Parlor Pizzeria",
  "address": "1916 E Camelback Rd, Phoenix, AZ 85016, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f246fe22-9332-11ea-91ad-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "unique",
   "food",
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=1798108782266753697",
  "source": "GoogleMaps",
  "reviews": [
   "We accidentally came in close to closing time on a night they were closing early, and they still managed to accommodate our food and drink orders. Best food on our vacation in Phoenix! A must try! So much thanks to Brent for treating us so well and making us delicious, perfectly crafted drinks, both alcoholic and non. The food was fresh, unique, and wonderful as well. Already excited to go back!! Thank you so much Parlor Pizzeria!",
   "This was a nice place to try. The decor was great, service was good and food served pretty fast and hot. I had a small spinach salad and a small order of squash ravioli. Both were delicious. My friend had the Margarita pizza and it was good, but we've had better crust. He also had the small parlor salad and enjoyed it. The price on the salads seemed high at $12. No side salad is offered with an entree.",
   "So, I had driven by this place a dozen or more times and never even noticed it was there. To call the outside low-key or nondescript is a terrible understatement. Picture a solid, monotone cinderblock wall across the front of the whole building. But don't let that stop you. Plenty of parking in the back and when you get back there, you'll see the entrance is NOT on the street side, but on the parking side. They have both indoor and outdoor seating, an open, airy feel, and a cool ambiance. Service was great and quick. People were nice. Pizza is definitely the star here but there are lots of other options. My guest got the mushroom pizza (it looked great and disappeared quickly), and I go the small spinach salad with grill shrimp and it disappeared nearly as fast. And even the small was plenty large for lunch. With tip it was a $40 lunch. Solid choice for sure.",
   "The food was very good and the ingredients were very fresh. The salad was especially good. The pizza was better than most nearby places, but has room for improvement. There are somewhat skimpy toppings. The server was friendly. The pricing on the pizza is slightly high.",
   "Always a great meal. Delicious pizza. Great relaxing environment with friendly staff. The salads are tasty and fresh. The cocktails are great. Happy hour is awesome and worthwhile. Always great place to hang after work."
  ]
 },
 {
  "name": "Barrio Cafe",
  "address": "2814 N 16th St #1205, Phoenix, AZ 85006, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f29027a8-9332-11ea-a2b1-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "delicious",
   "family",
   "tasting",
   "food",
   "delicious",
   "family",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15831651706048966042",
  "source": "GoogleMaps",
  "reviews": [
   "It is a wonderful dining experience! Very outstanding in every aspect. Every staff member who interacted with me was knowledgeable, attentive, and passionate. The best food and hospitality I have ever had. This place really made it a great night for me. I can't wait to come back here. Thank you very much and keep up the good work always.",
   "One of the best, most memorable and flat out delicious meals I have ever had in the US.  This place is worth a trip to Phoenix. It’s been 5 years since first tasting the pomegranate guacamole and I’m still deeply thankful for the experience.  Every dish is fantastic.  \n\nOkay, just to be clear on my reco: as a child I spent time each year in France with my family (half French ) eating splendid food in neighborhood cafes and later in life have eaten in some of the best restaurant all over the world.  Hands down this place has world class food and should have at least one maybe two Michelin stars.  The ambiance is humble but the food is noble.  More noble than many a starred Michelin restaurant.",
   "Recently, my family and I stopped over to this cafeteria, and we greatly loved the foods and drinks that we ordered. It was all delicious and satisfying. Besides, the waitress that entertained us at that time was very accommodating, nice, and careful. Honestly, we greatly love to spend our precious time in your cafeteria. It was clean, comfortable, and refreshing. Till next time!",
   "A should eat location. This dining establishment offers Mexican food as you have actually never ever tasted. To delight your combination, make an appointment & take pleasure in all the fantastic flavors to be tasted. The treats are fabulous & the solution is exceptional. This is genuinely excellent food that is on one more level and the care and prep that go into this food were evidently seeing it up close. Very recommend for food lovers.",
   "Great food. And cute little restaurant. Couldn't give it 5 stars as the price range is a little bit high. You could argue that the portion sizes, the quality of the food, and service makes it worth the price. But \n.. I can't. Liked it not loves it."
  ]
 },
 {
  "name": "Matt's Big Breakfast",
  "address": "825 N 1st St, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f2d792be-9332-11ea-94f9-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "organized",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=16504193893145208650",
  "source": "GoogleMaps",
  "reviews": [
   "We visited Matt's in Scottsdale when it was just opened (5 days) and what a wonderful, grand treat. A Warning - if you are not really, really hungry - it might not be for you. But, the food is great, the ambiance is outstanding, the manager visits your table, and you never, ever walk away hungry. I actually give it 6 stars - it is that good. A few of my friends and I traveled to Phoenix for an event and stopped at Big Matt's twice for breakfast. The food was excellent, the portions were big, and the check was small. Would highly recommend to anyone visiting the area.",
   "The foods was amazing and was homemade. Our experience with our servers was delightful. Everyone there waited on us. If someone seen you needed something they were on it! Love this place! I had a ham steak and eggs, thick juicy ham steak, eggs cooked perfectly. My wide had the same with a pancake, pancake was moist and had a sweet flavor. Highly recommend!",
   "The foods was amazing and was homemade. Our experience with our servers was delightful. Everyone there waited on us. If someone seen you needed something they were on it! Love this place! I had a ham steak and eggs, thick juicy ham steak, eggs cooked perfectly. My wide had the same with a pancake, pancake was moist and had a sweet flavor. Highly recommend!!!!",
   "Fantastic breakfast joint! It gets busy but was very well organized with a host taking names outside. Plenty of seating and space to wait outdoors. The food was terrific! We had the special of the day and an omelet, with hash browns. All the staff were really friendly and helpful! Very prompt service, food came out quickly.",
   "Was looking for somewhere to have breakfast. Found this place on google. First time trying this place out. Was delicious! Service was great. Don’t change anything. Place & menu is perfect as is. 10/10 would recommend. I never leave reviews on anywhere we go but this was worth leaving a five star review."
  ]
 },
 {
  "name": "Pizzeria Bianco",
  "address": "623 E Adams St, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f32d64ae-9332-11ea-b297-14b31f159f22.png",
  "tags": [
   "kids",
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=1091072168939758786",
  "source": "GoogleMaps",
  "reviews": [
   "Do yourself a major favor and go to Pizzeria Bianca. Great place. Excellent customer service. Best pizza I’ve had in a very long time. Not too pricey either. There is outside seating. My wife and I went here with our 6 month old and the staff, including the owner, were extremely welcoming. It’s a good place for kids but there isn’t a whole lot of seating. That being said, they have a quick turnaround because the service is super quick.",
   "I had read for years how great the pizza was at Pizzeria Bianco. The salad (with added salami) was very good. The pizzas (Sonny Boy w/ mushroom and Wise Guy) were so-so. I have had much better wood fired pizza at other restaurants.  Service was excellent.",
   "My first time visiting Phoenix and Pizzeria Bianco did not disappoint. It has a trendy atmosphere and delicious beer on tap. I love pizza and the Rosa was delightful. They’re very keen on minimalism in their foods, which I love. This is true authentic pizza and I would absolutely dine here again. Service was also amazing and everyone was so friendly.",
   "Worth the wait. Probably the best pizza crust in North America. Everything I ate was perfectly executed.adiquate wine list with some gems. I visited 2 locations and found them both to be equal with varying degrees of ambiance which would be expected as I went to dinner and lunch. Service was good at both but not spectacular, I had to remember that it was pizza and not fine dining. Perfect all around",
   "While in Phoenix, I had the chance to visit a couple of my favorite restaurants from the days when I lived there for 10 years. Pizzeria Bianco is an absolute must visit place. They serve the best pizza I've ever eaten anywhere in the country. They have two locations..one downtown and the other in a shopping center off of Camelback. I visited that location and found it had hardly changed in all these years. Highly recommended. Simple and delicious."
  ]
 },
 {
  "name": "Ocotillo Restaurant",
  "address": "3243 N 3rd St, Phoenix, AZ 85012, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f3789ecc-9332-11ea-abe8-14b31f159f22.png",
  "tags": [
   "free",
   "tasting",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=13177983299940489720",
  "source": "GoogleMaps",
  "reviews": [
   "I've been here 5 times now and everything is always so good! They get really busy on the weekends, so I recommend calling to see if you can make a reservation. I've only been here for lunch brunch and dinner and they have a pretty good size menu. Also, when you check in, you get a free coffee or mimosa on the brunch menu. I ordered their beef rib in mole sauce . I can't remember when I had such a great tasting rib, but they were huge and wasn't disappointed. I definitely want to come back to try their dinner menu. They also have happy hour as well and very cute patio seating.",
   "The menu is something to see, from small tapas-like dishes to larger meals. They all sound delicious on the menu - too many to select from. So, with the direction of our waiter and the bartender (from earlier), all four of us selected something different. Each meal was so outrageously good that we had to stop talking because we were too busy eating! Think about getting reservations, especially if you want ti sit outside.",
   "Our lunch here was truly remarkable. We came on a quiet weekday and our food arrived very quickly. The food was excellent, beautifully prepared and plated. The portions were generous and priced very well.\n\nWe ordered the Ocotillo Chicken, Baby Back Ribs, Roasted Cauliflower, Vanilla Pear Salad, and Vegetarian Sandwich. All were FANTASTIC. We can’t recommend this place enough.",
   "The menu is something to see, from small tapas-like dishes to larger meals. They all sound delicious on the menu - too many to select from. So, with the direction of our waiter and the bartender (from earlier), all four of us selected something different. Each meal was so outrageously good that we had to stop talking because we were too busy eating! Think about getting reservations, especially if you want ti sit outside.",
   "Best takeout since quarantine!  Bill and company were sooooooo nice. Now we know its also dog friendly. Best ribs. And they make their pasta...you can taste the yummy difference. Cant wait to go back!"
  ]
 },
 {
  "name": "The Melting Pot",
  "address": "3626 E Ray Rd, Phoenix, AZ 85044, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f3c49c1e-9332-11ea-8376-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11423294559499054704",
  "source": "GoogleMaps",
  "reviews": [
   "This was a wonderful experience! The food was great, the ambiance was fantastic and the waitress was wonderful.  We went for our anniversary and did their \"lovers\" package. It was on the expensive side but for a special occasion it was worth it.  We will definitely be returning.",
   "The service is great. The food is great. We always do two cheeses and a dessert and skip the full entree. BUT BEWARE: THEY COULD NOT CARE LESS ABOUT REGULARS OR LOCALS. They cater to special events and holidays only. The first photo is of the bar. It’s great! It has four pot spots for eating as couples, the bartender is friendly - it’s great. Obviously when you sit at a bar you expect a different experience and it’s much more casual which also means slower service when they’re busy. WE HAVE WALKED IN NOW ON THREE DIFFERENT WEEKENDS TO BE TOLD THERE IS NO DINNER SERVICE AT THE BAR. We’re the people they see monthly, not yearly, or once while on vacation. We spend $200+ every time we are there and have a great experience. If you’re only a rose pedaling, proposal-seeking, curtained-booth restaurant, fine. How’s the Scottsdale location doing?\nYou lost monthly income from happy customers and 25% tippers. OPEN UP THE DAMN BAR!!!!",
   "It's a little expensive per the other reviews but you are paying for a gimmick. The prices have gone up and portion sizes have gone down over the years so it may be a shock if you haven't been here for a while. \n\nHowever the service is usually great and I have no idea how anyone would leave hungry. It's kind of a fun gimmick and the good tastes pretty good.",
   "Always a treat to go here. We went to celebrate our 10 year anniversary.  They staff were amazing about my gluten allergy and made sure to warn us about anything my husband ate, if it contained gluten. It was worth the drive and worth the price as always.",
   "Fantastic anniversary dinner. Great attentive service with a expansive menu that has something for everyone. Do yourself a favor and don't order the same thing as your date, share everything and enjoy!"
  ]
 },
 {
  "name": "Pa'la",
  "address": "2107 N 24th St, Phoenix, AZ 85008, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f4141bde-9332-11ea-ae37-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "affordable",
   "eat",
   "food",
   "tasting",
   "walking",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=3325197008119933741",
  "source": "GoogleMaps",
  "reviews": [
   "Impeccable service and great food. I really appreciate how the servers paid adequate attention to their customers. This is one of my favorites. Most of their dishes are good for sharing and was very affordable. The food is delicious and you can really taste the high quality of their ingredients. The interiors though, top of the line. I love this restaurant. Highly recommended!",
   "No question this is one of my most favorite places to eat in Phoenix or anywhere else.  The staff is amazing and the food is spectacular. It's a welcoming space and the patio is fantastic even in the summer.  Always excited to see what interest items they put together.",
   "This restaurant was SO good! Smelling the fire walking in, all the fresh ingredients, it all came together very nicely. The flavors were so good and very \"clean\" tasting. Def worth trying!",
   "Genuinely an experience you should indulge in. Do the a glass of wine pairing. Do the add. Expect to be there for 3+ hrs. Expect some recipes that blow your socks off. What an outstanding experience filled with a staff who cares so much about ensuring your time is one of a kind and memorable. I've eaten in some of the most effective dining establishments on the planet as well as I can say that 'la can stand toe to toe with most of them.",
   "This place is delicious. The vibe is casual chill. It feels super European but still American.\n\nGet the mussel soup, thank me later."
  ]
 },
 {
  "name": "Barrio Cafe Gran Reserva",
  "address": "1301 NW Grand Ave #1, Phoenix, AZ 85007, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f46f18ac-9332-11ea-9beb-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "tasting",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10737850977543268364",
  "source": "GoogleMaps",
  "reviews": [
   "Our nephew who lives in Phoenix suggested this restaurant and we chose this location because it offers reservations. Kind of a challenge to find and we were a little concerned once we located it because of the surroundings, but were VERY glad we did. Small and intimate. Beautiful table service. Absolutely superb food and drinks. Innovative menu. Very professional service. We would definitely return when we return to Phoenix.",
   "Our nephew who lives in Phoenix suggested this restaurant and we chose this location because it offers reservations. Kind of a challenge to find and we were a little concerned once we located it because of the surroundings, but were VERY glad we did. Small and intimate. Beautiful table service. Absolutely superb food and drinks. Innovative menu. Very professional service. We would definitely return when we return to Phoenix.",
   "The mole here is amazing. On anything you get it. The red, green or black. my favorite is the table side guacamole and the tree moles steak with vegetables. Always intense authentic flavors. Great for any special occasion or when you want something really authentic.",
   "We are not Mexican cuisine experts, but had been disappointed in the Mexican food we had found in Santa Fe. Upon arrival in Phoenix, we did enough research to discover Barrio Gran Reserva. We went with the more expensive tasting menu and were blown away by the extraordinary tastes. The restaurant is \"all about the mole\". The starter of scallop ceviche was the hottest course. We loved the fact that each course was a perfectly sized portion. We dissected and discussed every course in minute detail, which is always a good sign. The only slight surprise was the complete absence of a wine list. The short number of wines available seemed pretty expensive for their quality. Service was charming and informative.",
   "Place was small but the staff got us in without a reservation but we had to sit at the bar. This turned out to be a great seat to see the action and chat with the bartender. This made for a great experience. Add the amazing food and it was a great night..make no mistake, this isnt your basic mexican food. This is truly great food that is on another level and the care and prep that go into this food was evident seeing it up close. Highly recommend!"
  ]
 },
 {
  "name": "Cocina Madrigal Tacos + Tequila",
  "address": "4044 S 16th St, Phoenix, AZ 85040, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f4b0b58a-9332-11ea-b3ae-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6165071054029894729",
  "source": "GoogleMaps",
  "reviews": [
   "Let's cut to the chase...yes I will be back, yes it's good, and yes, mushroom enchiladas are a thing. Jason and Emily were awesome and even sent me back to the office with extra chips and salsa to share with my coworkers. They wanted feedback on the salsa, which me and the boss agreed is superb. It's a tad hotter than I can just keep chowing, eventually the heat got the best of me, but that's better than boring spice-less salsa. Chef recommendations: hatch green Chile pork, the Madrigal burger, crispy salmon, any burrito, and I don't recall which salad but man, 3 of those salads sound awesome.",
   "AMAZING! Not going to lie this was rather difficult to find because there wasn't any flashy signs and from the outside it doesn't look like anything special. But, the inside tells a whole different story. Mexican themed atmosphere, decoration, music, etc. Small bar, table and booth seating. Service was very friendly and had a positive sense of humor that was a nice interaction. Best Mexican food I have had in a long time. Classic chips with guacamole but with a twist of jalapeno-bacon added. Fantastic enchiladas, the beans and rice were just the right amount of side servings. Finally the dessert was beautifully prepared and the chocolate just melted in my mouth. Wish I could give six stars because everything seemed freshly prepared and served. Highly recommend this place.",
   "We were looking for tasty food, and lucked upon this place next to our COSTCO stop.  Food was made to order while you watch.  Varying degrees of spice, and hit the spot! Did I mention the tortillas? EXCELLENT! Essentially all the typical ingredients for burritos etc, made the way you say you want it.",
   "The food here is authentic, reasonably priced, and delicious. You can tell they care about the quality of their ingredients. They have the best mushroom enchiladas I have ever had. Their margaritas never disappoint either. On top of all of that, their service is great! The chef has come out to speak with my table on multiple occasions and it’s nice to see a Mexican owned restaurant really hitting all the marks.",
   "We went about 7pm with a group of 8. Seated in about 30 minutes, reservation are encouraged. Prices are reasonable and staff is polite. One seemed rushy though. We all seemed to enjoy our meal. I especially liked how the mushroom is cooked, a little crunch but cooked. Nothing stood out to say highly encouraged to try. Overall good flavor."
  ]
 },
 {
  "name": "MATCH Restaurant & Lounge",
  "address": "1100 N Central Ave, Phoenix, AZ 85003, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f503f4b4-9332-11ea-8eec-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14437531526752169794",
  "source": "GoogleMaps",
  "reviews": [
   "We enjoyed our weekday dinner here. Our pizza, veggie burger, and chicken were very good. They have a nice selection of wine including local rose which I really appreciated. Service was professional and not intrusive. Love the location too - close to a small park.\n\nNote that happy hour is in the bar only and not in the restaurant.",
   "This is a happening bar at happy hour, apparently with many regulars. Interesting mixology list and good wine selection. Our bartender, Justin, was excellent and amiable, and we had a great time our two nights there. The bar food (which apparently is also the restaurant food) gets mixed reviews here: a beet salad was excellent and big enough to share. The salmon, which came recommended, was dry and relatively tasteless. Think I would stick to burgers or sandwiches for bar fare, but you cannot go wrong with the drinks.",
   "We had company in town who wanted a buffet brunch  which seems to be rare these days and we found MATCH and decided to give them a try. There were six of us and not one disappointment. Fresh omelet station and the first time I've seen frog legs on a buffet. More company is coming and we can't wait to go back. They have only been doing the brunch for about two months and when the word gets out I'm sure there will be waiting lines.",
   "Reviewing the bar area.  It has great atmosphere but cafeteria like service.  I wasn't really hungry so had an $11 salad which was ok but seriously small.  I like dark beer and only thing they had was in a bottle.  This was fine with me.  Pop the top though and no glass.  Not even an offer.  Water?  Come on now do we look like a professional establishment?  I don't blame the unfriendly bartender.  He is the only one working the bar.  I blame greedy small business owners always cutting to grease their short term profit.  Then they wonder why they go out of business.  Maybe keep good servers and watch repeat customers come back with friends?  Last year was night and day better.  I'm here another 5 nights and won't be back.",
   "If you want some awesome food MATCH is  the place to go. The Chef is GREAT! The atmosphere is very comfortable and spacious. So whenever you're in the area of 1100 N Central in Phoenix, please stop in and enjoy the succulent food. Oh! You receive 2 hour valet parking."
  ]
 },
 {
  "name": "Durant's",
  "address": "2611 N Central Ave, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f54b5d14-9332-11ea-80b2-14b31f159f22.png",
  "tags": [
   "delicious",
   "cheap",
   "drink",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=1795104239706520601",
  "source": "GoogleMaps",
  "reviews": [
   "The decor takes you back in time about 40 years. The service is friendly and attentive. Entrees come with soup or salad and a potato. I had the house salad which was fresh and good. The ribeye steak was cooked perfectly, although the meat wasn’t as tender as others I have eaten. The baked potato came with plenty of butter and sour cream. The side of fresh asparagus we ordered was huge and tasted better than any I’ve ever had. To finish, I had apple cobbler which was a huge serving with lots of ice cream.",
   "Sat at the bar. had dinner and drinks. Joe was great. The spinach artichoke dip and onion rings were very tasty.. the bone in ribeye was superb along with the twice baked potato. Make a reservation cause the place fills up fast .. the drinks were legit and proper. I hear this is the best place for a martini or Manhattan.",
   "Cool 50s/60s vibe... felt like Sinatra could walk in at any moment.  It wasn't cheap but everything was delicious and lots of wait staff. We drank many lemon drops because they were so tasty and it felt like a place that you need to drink martinis. Calamari was just ok but the crab cakes were amazing! Prime rib was huge and delicious and can't forget the scrumptious bread!",
   "I’ve heard about Durant’s for years but never went as it was outside of the normal area where I frequent restaurants. I decided to make the drive to celebrate an anniversary. I was not disappointed! The decor takes you back in time about 40 years. The service is friendly and attentive. Entrees come with soup or salad and a potato. I had the house salad which was fresh and good. The ribeye steak was cooked perfectly, although the meat wasn’t as tender as others I have eaten. The baked potato came with plenty of butter and sour cream. The side of fresh asparagus we ordered was huge and tasted better than any I’ve ever had. To finish, I had apple cobbler which was a huge serving with lots of ice cream.",
   "The place was absolutely loaded when we were available. Quickly greeted and had our name removed. Waited possibly 10 mins and then was seated. The table chair was proposed by my friend (that's in a wheelchair)without asking however was brought back promptly. The waitress asked if we wanted his chair put in back as well as really did not push when we said no. Additional bonus! She really did not touch his chair without consent. To any kind of wait team reading this, that indicates a lot to us. We will definitely be going back next time we're in Phoenix metro! Thank you to everybody for an incredible eating experience!"
  ]
 },
 {
  "name": "The Stockyards Steakhouse",
  "address": "5009 E Washington St UNIT 115, Phoenix, AZ 85034, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f58f4412-9332-11ea-aecd-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walking",
   "delicious",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3702597643641376452",
  "source": "GoogleMaps",
  "reviews": [
   "This was a perfectly wonderful evening! This was near a condo we were renting and so decided to try it. We were surprised by the ambiance on the inside. I love paintings and sculpture so it was delightful. Furthermore, my elk rates up in one of the top five meals I have ever experienced. It was amazingly tender and delicious and the potatoes that came it were a perfect complement. My friend loved his sirloin as well. The drinks were very well done and we ended our meal with grasshoppers made with ice cream. The service was perfect. What a great night!",
   "Walking through the door is like stepping back in time, it's very rustic to the period. The food was prepared as ordered, and the steak was perfect. The staff was very polite and courteous and attended to our every need promptly. The 1889 saloon is a site to see, so do so before or after you have dinner. It is highly recommended for lunch, dinner, or drinks.",
   "Went to the Stockyards with my friend for dinner after watching the Angels/Texas Rangers spring training game. First time at this fine establishment for us. No reservations but they seated us immediately. Ur waiter Dan was first class with menu explanations and recommendations. Margaritas were very good. Prime rib, according to my friend was better than Lawrys ! I had fried chicken which was delicious. We’ll definitely go there again when we are back in Phoenix.",
   "Food is great. Service could be better. We had a reservation for four but came in early and we were seated right away. Our server started off great but she either couldn't focus anymore or didn't care. Our drinks were never refilled until asking for the check. She actually asked us about dessert before asking to refill my husband's coke. Our food was prepared perfectly!",
   "I was treated for my 20yr work anniversary and this place is amazing. The decor is astonishing throughout the restaurant. Our waiters and waitresses were quite courteous and attentive to our party of 20+  Now the food.. I ordered the Ribeye steak and it was perfectly medium rare for me, juicy and delicious. I also enjoyed the pecan pie for dessert. I would most definitely eat here again and recommend it."
  ]
 },
 {
  "name": "Seasons 52 - Takeout & Delivery Available",
  "address": "2502 E Camelback Rd, Phoenix, AZ 85016, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f5dec3ee-9332-11ea-8073-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "free",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2747344481764541777",
  "source": "GoogleMaps",
  "reviews": [
   "How can I gush more then I want to.  We just did a to go order for our 7th anniversary.  Chelsea was AMAZING.  The call to order was  easy and fun!  They added personal messages on the order.  Chelsea can out fully in safety gear, so pleasant. The food was so wonderful! Well packed, traveled well and warm and so yummy!  We were big fans prior to this current situation but now Seasons 52 is our go to!!! Call them and enjoy!!",
   "What a great choice this turned out to be.  Food was excellent,  service was friendly and timely. Beautiful ambiance! We tried hummus board appetizer and seafood stuffed mushrooms appetizer and created our own tapas table. So many flavors! We split a Cedar Plank Salmon that was tremendous! A little dill mustard on the side was another smashing taste",
   "I ate at Seasons 52 for a business meeting and it was the perfect location. Reservations were easy to make and table was waiting for us 30 minutes early. Lighting at the table was exceptional and there wasn't a lot of background noise which made conversation very easy. Seasons 52 has a handy alternative diet menu for gluten and dairy free as well as for Vegan diets, just let them know of your need and they are wonderful at accommodating. Everything on the menu so less than 590 calories and tastes amazing. I've had both the Chilean Sea Bass as well as the Steak Salad, both were delicious. Our waitress was phenomenal as well, very attentive and full of charm. Seasons 52 was the perfect choice for this dinner meeting.",
   "First time at \"Seasons 52\" it was a very pleasant surprise. After reading some of the reviews, I thought this visit was destined for failure. The greeter was very pleasant, the waitress (Haley) was very attentive and in good spirits. The food was exceptional, the portions were very adequate and I didn't leave feeling hungry. The peanut-chocolate dessert was absolutely to die for. I had the Chilean sea bass, my wife had the carimalized scallops,  it was superb. Would definitely be returning.",
   "Classy yet homey and comfortable atmosphere. It was very peaceful and elegant all simultaneously. The food was really yummy and different. Not your average Fair. The service was lovely we felt very welcomed and respected. I would definitely go back! They have happy hour goodies and we really enjoyed our time there."
  ]
 },
 {
  "name": "The Arrogant Butcher - Temporarily Closed",
  "address": "2 E Jefferson St #150, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f62da750-9332-11ea-8de2-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=16729133382072992982",
  "source": "GoogleMaps",
  "reviews": [
   "Make a reservation and enjoy a great meal with solid service and a fun atmosphere at The Arrogant Butcher. It was packed on a Friday evening, thankfully we reserved in advance. Great burger, soups, and chicken. Solid cocktails and efficient and friendly service. Fun spot in the heart of rapidly expanding downtown phoenix. This busy, open plan and open kitchen restaurant was great for a work dinner. In the booth we could converse well without a major risk of being overheard because of the ambient noise level. Service was prompt and efficient. My jambalaya was more than ok. Colleagues had crispy chicken, meatloaf and steak. All professed satisfaction. And the bill was, all things considered, honestly good value. Yes I would go again",
   "Wow... This was a great night and the food was absolutely delicious. Atmosphere steps it up a whole other level. Perfect for a date night. Only critique would be service. I feel like out waitress could have come by a bit more to check on us, but it was Valentine's day and they were busy. Other than that she was great and knowledgeable and we got seated quickly. ( I had a reservation)",
   "I ate dinner here on a really busy night. I got their signature beef short rib stew, which was awesome and came with a really good cornbread muffin. I  went by myself and because the wait was so long, I took the only seat at the bar. The number of cooks working was impressive and needed to accommodate the crowds. I was impressed with how much fun they were having and how efficient they were. The menu is not extensive, which allows them to accommodate the large crowds in a timely manner and serve tasty food.",
   "I celebrated my PhD this evening in this gorgeous place. happy to tell that we had a phenomenal evening and the restaurant was surely one of the reasons for this happy celebration. The team  contributed in a graceful way, the cuisine was yummy and my friends were very  cheerful. We shall surely visit again for more events. Thank you very much.",
   "My hubby and I stopped in for lunch just to try someplace new and what a nice treat to eat here! The server was really nice and the ice tea delish!! I can't say anything negative from the soup to the burger and fries I I had for my lunch. My husband had oysters to start and the prime rib sandwich. He had great things to say as well.  So even if it was $60 for lunch it was worth it.\nThen to top it off the parking was validated! So I would I guess we found a new spot now to frequent so we'll definitely be back for dinner. It's really refreshing to find a good place to eat in the Phoenix area , since moving here we haven't had the best luck with finding good restaurants unfortunately."
  ]
 },
 {
  "name": "The Dressing Room",
  "address": "220 E Roosevelt St #1951, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f6811ed2-9332-11ea-a4eb-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "delicious",
   "adventurous",
   "food",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=7334646729742014193",
  "source": "GoogleMaps",
  "reviews": [
   "This place has the best fries I have ever eaten. It's a lime, citrus flavor with a mild spice that just gets you in all the right ways. I love the drinks! I was a major fan of their old fashion. I would absolutely come back here in a heart beat. The space is small but cozy and the food was just damn good. Definitely check it out, I'm already craving the fries!",
   "Checked out this place after watching Plate bar and Pour, was excited. We were sadly disappointed. The ambience is awesome. Loved the outside seating. The staff were friendly. \nThe food was ok nothing to rave about. I had the Breakfast Burrito. It was bland. If it wasn't for the fact that I read that it had bacon and avocado I would not have noticed. It is as if they put all the ingredients in one pot, cooked them and forgot to season.",
   "I had my doubts on this restaurant because of how simple the menu looked, but honestly this is tasty! The athmosphere is industrial but cozy. You can sit outside or eat inside. The food, from the appetizer to desert is scrumptious! The staff is friendly and accommodating; they didn't have something on the menu and asked me if I wanted something else and then created a desert just as good! I highly recommend this place! 🏙️😋",
   "This place caught me off guard - I’ve known The Dressing Room existed but never really realized they had a full kitchen and served food; I’ve always assumed it was just a bar/cafe. After deciding to check out their menu, I realized they offer a lot of amazingly appetizing dishes that take seem to take a simple yet adventurous approach. The two dishes we ordered are precisely what we were in the mood for, however it was tough not to order other shareables off the menu like the Chorizo Poutine or the Spiced Falafel Gyro. We placed our order and got to fully enjoy the Open-Kitchen design as we sat at the bar top in front of the cook’s workspace, gazing on as we watched each step of our food preparation. We watched as the egg was cooked to perfection, and as mysterious, battered items were added to the fryer. Not too long later, our plates appeared upon us and all of it came together in two artistic masterpieces. The pad Thai salad included the most incredibly delicious fried shiitake mushrooms we’ve ever had - almost a nutty but clean flavor to them. The crunchy texture of the fried mushrooms complimented the soft, chilled noodles in the plate. And as for the Pork Fried Rice, if you’re a texture eater, this dish hits so many marks. We let the undercooked egg ooze out over our rice and meld into the array of flavors present. A few dabs of sriracha on top sets just the right amount of spice to this plate and you can bet we finished every last bite. Final thoughts about this restaurant: the soundtrack was perfect for the vibe of this place; the intimacy with the staff was just right - they were there when needed, interactive, but not invasive; and the actual ambiance and decor seemed to perfectly vibe with the overall vision of what this restaurant is meant to exude. I cannot wait to get back here again and try other menu items. Well done guys!",
   "Great vibes and space. They have two patios- back patio is super cute. Would be a great date night or brunch spot. They have breakfast all day!! Highly highly highly recommend their pork belly fried rice - you will not be disappointed! Reasonable prices and drink menu. Want to try their cheese curds next time."
  ]
 },
 {
  "name": "Green New American Vegetarian",
  "address": "2022 N 7th St, Phoenix, AZ 85006, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f6cd94dc-9332-11ea-90df-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3983598133859243370",
  "source": "GoogleMaps",
  "reviews": [
   "Having been to the Scottsdale location several times I was pleased to find this location near my hotel. The menu is pretty similar, but the desserts are sold in a small building next door; the idea works. The dood is excellent. Service was quick. The environment is much more hip than the Scottsdale location. There was a mix of solo diners, couples, and families.",
   "It's impressive to find a vegan place that has really tasty food.  This place was it.  The place gets busy (even on a Tuesday afternoon) so plan accordingly... Parking is a bit tight, so walk, bike, it carpool in.\n\nWe did have some issues with the company they use for gift cards, though the managers straightened it out with little headache.  The headache was not on their end, due the record.",
   "I knew this place would be good when I walked in because it was packed on a Tuesday night. The buffalo sandwich was very flavorful, and I liked that the lettuce was a spring mix instead of iceberg lettuce. I also had some of the chili fries, which were tasty too. I wish that the chili had beans in it though. \n\nI would definitely come back here again next time in the area.",
   "I am not a chef but I know when food is really good as in comparison to what I could create as a good home cook.  Vegetables can be prepared in amazing ways with limited calorie load. This food  is what anyone could create with little imagination. Here you order at the counter and verify your purchase on their computer program. Here they ask for a tip before service evaluation. It seems arogant to me.",
   "This place is unbelievable! Best vegan/vegetarian food options I have ever seen and soooo damn good. Worth every penny and then about 100,000 more. Please create a location in Flagstaff, AZ you would be warmly welcomed by all. I ordered the daily special, breakfast for dinner, and the west coast fries!"
  ]
 },
 {
  "name": "Nobuo at Teeter House",
  "address": "622 E Adams St, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f718cea2-9332-11ea-a7c2-14b31f159f22.png",
  "tags": [
   "creative",
   "tasting",
   "delicious",
   "food",
   "creative",
   "tasting",
   "food",
   "drink",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8943956305226981992",
  "source": "GoogleMaps",
  "reviews": [
   "Nobuo is Not Nobu. This a enclave of creative Japanese tasting dishes in a nicely remodeled old Phoenix wooden home. Old by Phoenix standards at least. Dishes as tapas sizes, but highly varied. Westernize, but elegant in taste and presentation, befitting the Japanese tradition. All presented and readily shareable among friends. I came two consecutive nights, by chance, but found plenty explore each evening, including an extensive sake selection. Only those looking for a thick juicy steak and wedge salad would be disappointed.",
   "Absolutely amazing experience. The food was incredibly delicious. Every dish was well balanced and well plated. This is my new favorite place to enjoy food. Thank you for having an awesome crew and atmosphere, chef Nobuo!",
   "Nobuo is Not Nobu. This a enclave of creative Japanese tasting dishes in a nicely remodeled old Phoenix wooden home. Old by Phoenix standards at least. Dishes as tapas sizes, but highly varied. Westernize, but elegant in taste and presentation, befitting the Japanese tradition. All presented and readily shareable among friends. I came two consecutive nights, by chance, but found plenty explore each evening, including an extensive sake selection. Only those looking for a thick juicy steak and wedge salad would be disappointed.",
   "Located near the convention center in Heritage Park, this quaint restaurant is in a converted brick house and serves Japanese fusion food. I went for lunch and had the soft shell crab sandwich, which was tasty. The salads and fish n chips are also good lunch options. There is a small bar and three moderate size dining rooms. Dinner has an expanded menu.",
   "Outstanding food as well as drink. So fresh as well as one-of-a-kind. Drinks as well! The meat was well cooked and was outstanding. Attractive setup as well as ambiance. We picked the 6-course meal to get the complete experience, as the server recommended. Whatever was layered picture best. If you could have that as well as their unique Old Fashion life would be full. Give it a try for a very unique evening. I will be back here soon."
  ]
 },
 {
  "name": "Times Square Neighborhood Italian Restaurant",
  "address": "2602 W Deer Valley Dr, Phoenix, AZ 85027, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f77064b0-9332-11ea-a28a-14b31f159f22.png",
  "tags": [
   "sampling",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11155124541804742614",
  "source": "GoogleMaps",
  "reviews": [
   "My friend and I made a decision to find below after checking out the previous testimonials and we were so grateful we did. Every little thing was terrific from the breathtaking sight, the service and attention to information from every employee we discovered, the atmosphere, and also our dish. We picked the Chefs Sampling food selection and also it was absolutely worth every penny spent. I would extremely advise for anyone aiming to celebrate a special celebration, date evening, or simply searching for brand-new experience without sacrificing service.",
   "By far the best italian place around. Fried mozzarella is a must. My favorite is the fresh clam pasta. HUGE PORTIONS",
   "Love everything here! Update...we went here for dinner last night for a birthday. We heard about the fried 🧀...w...wow it was amazing....a huge block of cheese fried and served with a sweet tangy marinara sauce. Also extra crispy medium wings that have a sweet taste that is wonderful. Lastly I heard great reviews about their 🍕....they did not disappoint with the combo ordered crispy not crunchy...yummy perfect crust and we had a perfect server he was fabulous plus a brownie and a song for our celebration.",
   "I heard that this restaurant was excellent. Maybe my opinion will change next time I try to check it out. I am person who loves crab cakes!  I can’t believe that a restaurant with such high quality Italian dishes would sell frozen store-bought crab cakes! \n\nComing on guys either take the crab cakes off your menu or make them fresh!",
   "Great place for great Italian cuisine!  Service is always good and friendly.  Manicotti with Meat sauce is amazing.  It's a convenient location for lunch so we usually stop by a few times a month.  Always pleased."
  ]
 },
 {
  "name": "Christo's",
  "address": "6327 N 7th St, Phoenix, AZ 85014, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f7bfbeb4-9332-11ea-a972-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "knowledgeable",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14756467918252177903",
  "source": "GoogleMaps",
  "reviews": [
   "This is a family-owned and operated restaurant that satisfies your appetite. Dinner with a visiting friend from our-of-town was an enjoyable, and very satisfying evening. Soup AND salad included for starters. Delicious fresh fish with crunchy vegetables for entrees. Desserts were top-of-the-line as well. Professional service. Well worth the effort to find this establishment. Enjoy your meal!",
   "I came here with a friend just by seeing it on the road. We were not expecting it to be as amazing as it was. The waitress was very friendly and knowledgeable, the food was delicious and the atmosphere was comfortable and relaxing. I had the halibut with feta and he had the shrimp Alfredo. Both of our meals were very satisfying. I will definitely be going back and telling others about this great find!",
   "Wonderful menu selection with great specials. Our waitress, Megan, is awesome and very attentive. Thank you, Megan!Food was nice and hot and tasted great. Be sure to make reservations!  A very popular Italian place! Staff is always hustling to take care of their patrons!",
   "Went with three friends for lunch. This place feels like an \"old school\" New York place. Our waiter was old school as well...a little abrupt. The decor was very nice with cloth tablecloths and napkins. I had the Chicken Genoveseo but it only had a half artichoke and one mushroom cut into three slices...skimpy. However the lemon wine sauce was outstanding. I really enjoyed the large chunks of fresh cauliflower, broccoli and sliced fresh carrots.",
   "Christo's was absolutely delicious, all meals came with bread, soup, and a salad. The service was also amazing and everyone was very kind and quick to get our food and clean up the plates for your next plate to come. Overall I definitely recommend this to anyone that is looking for delicious Italian food!"
  ]
 },
 {
  "name": "Tacos Chiwas",
  "address": "1923 E McDowell Rd, Phoenix, AZ 85006, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f81229c6-9332-11ea-996a-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=13096598959541718744",
  "source": "GoogleMaps",
  "reviews": [
   "Truly enjoyed a great treat and very glad we beat the rush. Even though a little on the higher side for taco pricing the little wait for a delicious bite was fantastic. Bravo to the chef of making them fancy but still with a hint of it's street credibility. Will be back for more hopefully sooner then later!!",
   "I love tacos, and these are better than the average taco stand, but the \"foodies\" who rave over it are over the top. This is a counter service joint with formica tables and a few booths. They have several bottle selections of beer, plus Mexican coke with real sugar. We had about five different types of tacos, and all were very good, especially when enhanced by the several salsas available at the salsa stand. We didn't try the burritos, but they looked great. The place is usually packed, and there is often a line to order, and seating can be tight, but everything turns very quickly; it is, after all, a taco joint.",
   "Awesome little taco shop in phoenix, Guy was right about this place. Amazing authentic flavors and the salsas are the icing on the cake. Be sure to stop by if you are in the area.",
   "So good that I had to go back the next night for more.\nIt may not be the flashiest place but those tacos (pastor and asada specifically) are so good! A must visit for your time in Phoenix.",
   "We decided to visit this establishment only for the fact that it was featured on Guy Fieri's Diners, Drive-Ins and Dives TV show. The place had an authentic feel to it, as if you were eating at a outdoor restaurant in Mexico. We order two different kinds of quesadillas is in two different kinds of street tacos. It was a hit and miss. The carnita tacos are delicious! However the Al Pastor(pork) tacos needs an acquired taste. The beef quesadillas were okay. Nothing exciting about it. Possibly could have made a better one at home. At the bottom line, I could return here one day, but I also could live without it."
  ]
 },
 {
  "name": "Switch Restaurant",
  "address": "2603 N Central Ave, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f8726d2e-9332-11ea-b0d6-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "delicious",
   "eat",
   "delicious",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=6388989075463140386",
  "source": "GoogleMaps",
  "reviews": [
   "I enjoyed a grilled chicken pita with a sweet dragon sauce. It was too big to try and eat as a sandwich so I had to eat half of filling then pick up the rest. Delicious!! I had dragon sauce on the side and really did not need it. The salad with grilled chicken was fine on its own. The curly fries were also a hit - thick wedges with a great seasoning. We will definitely return. We stopped at Switch for dinner and returned again for more. The menu is sort of southern inspired with a modern twist. The staff is friendly and the place has a young vibe but isn’t off putting for older guests.",
   "I enjoyed a grilled chicken pita with a sweet dragon sauce. It was too big to try and eat as a sandwich so I had to eat half of filling then pick up the rest. Delicious!! I had dragon sauce on the side and really did not need it. The salad with grilled chicken was fine on its own. The curly fries were also a hit - thick wedges with a great seasoning. We will definitely return.",
   "I went with a friend for lunch, everything was great. We didn't have to wait even though they were pretty busy, our server was wonderful. I had a delicious cheeseburger and fun twisty fries. Try the Tabasco-Maple mayo, OMG.",
   "I enjoyed a grilled chicken pita with a sweet dragon sauce. It was too big to try and eat as a sandwich so I had to eat half of filling then pick up the rest. Delicious!! I had dragon sauce on the side and really did not need it. The salad with grilled chicken was fine on its own. The curly fries were also a hit - thick wedges with a great seasoning. We will definitely return",
   "Cool local haunt.  Fun happy hour. Posh but not  pretentious, urban. Great beers and cool mixed drinks. Photo is of the fried brie wedge."
  ]
 },
 {
  "name": "Province Urban Kitchen & Bar",
  "address": "333 N Central Ave, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f8bfa776-9332-11ea-8531-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=13020102981208973492",
  "source": "GoogleMaps",
  "reviews": [
   "We arrived with few expectations, tired after a long journey and not used to the desert heat. To our delight the meal, though the menu offered only a small selection, was excellent! Nothing to complain about regarding the set either, however a the meal was on the expensive side.  ran in for a quick lunch and had the avocado tots and watermelon salad. Bother we’re incredibly delicious with very refined taste. Will go back over and over! And the price for lunch.... even better! Even so I would recommend it.",
   "Came in for restaurant week to try some of their top dishes and I was blown away! The flavor, presentation and variety was top notch. Everything about the food was perfect, down to the bread and butter on the table. Attention to detail is incredible here. I also tried one of the signature cocktails, the Lost Dutchman, and I enjoyed it so much more than I thought I would. I don't normally order signature cocktails because I don't like sweet and too many flavors to confuse my taste buds, but the balance was incredible! Last but absolutely not least, my server Karen was wonderful. She made sure everything was great, my courses were timed perfectly and gave the customer attention needed without being overbearing, as I have experienced at so many other restaurants. Definitely ask for her if you try this establishment for the first time (or any time!). Dinner will go smooth and you'll leave with a smile on your face. I sure did! Can't wait to go back and try more of their menu!",
   "We are always wary of hotel restaurants, but this one had such nice reviews we gave it a shot. It’s located in the Phoenix Westin with a separate entrance off of Van Buran Street. We sat at the bar, had a few drinks and ordered the trout and diver scallops. Both mains were very good and well prepared. The bar staff were efficient and friendly. Recommended.",
   "We are always wary of hotel restaurants, but this one had such nice reviews we gave it a shot. It’s located in the Phoenix Westin with a separate entrance off of Van Buran Street. We sat at the bar, had a few drinks and ordered the trout and diver scallops. Both mains were very good and well prepared. The bar staff were efficient and friendly. Recommended.",
   "Very pleasant atmosphere, friendly staff. Everything good and delicious here. Have to return to try more. AC, internet or sun seat outside."
  ]
 },
 {
  "name": "The Macintosh",
  "address": "2119 E Camelback Rd, Phoenix, AZ 85016, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f90f9c80-9332-11ea-8668-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "delicious",
   "family",
   "eat",
   "food",
   "delicious",
   "family",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4706040556829196607",
  "source": "GoogleMaps",
  "reviews": [
   "Very tasty! I've been wanting to go here for a while. Our waitress was very versatile, she was friendly, knowledgeable of the menu, and handmade my refreshing cocktail, her creation! Blackberry, mint, and lemon all played together so nice, featured in the photo below. The chicken and waffles were off the hook per my Dad, they smelled scrumptious, and were gone. To top it all off they had etch-a-sketch for my daughter to play, what a great idea! See you again soon!",
   "Stopped in for a quick bite and was really impressed! Very good happy hour menu! The smoked salmon dip is a MUST! Can't wait to go back and try more on their menu. Service was also great and really fast.",
   "An absolutely incredible experience. \nMe and a couple of my colleagues went out to eat here Thursday 2/27/20. I have never in my life had such a nourishing and fun experience at a restaurant. And it was all thanks to our server, CHRIS. What an exceptional man and service provider! He made us feel like family and like we had been going there for years. We laughed the entire time out of pure enjoyment. He was incredibly accommodating with our food allergies and by the time he had described the menu to us, we were about to order one of each! His level of engagement with us and the food was exceptional! We ate family style and shared several courses. The food was delicious. I can't express enough how this was the absolute best dining experience I have ever had!",
   "I would absolutely recommend The Macintosh for an amazing dinner with friends and family, OR to take a date that you’d like to impress and connect with. First of all, the shopping center which houses the Macintosh is filled with delicious little gems, but you should certainly make stopping here your priority. Our server, Mary, highly suggested many of the items off of their lengthy menu and we weren’t let down a bit. We started with the ‘Common Ground Brussels’ that absolutely blew my mind with their tasty, charred little bits accompanied by juicy bacon and the balsamic glaze that gives a nice bite. Left me wanting another order! Next up was the ‘Bag o Bones’ from their happy hour menu. The simple bag presentation, filled with perfectly cut shoestring fries, fall off the bone ribs, and their house ‘Crack Sauce’ was just what we needed before our entrees. I personally had the ‘Twisted Noodle Salad’ which I opted to have topped with shrimp. An amazing combo of tons of ingredients that won’t steer you wrong! Fortunately, our group decided that we were all up for a family dinner style meal and shared our plates throughout our visit. This means I also got to try the French Street Gumbo, Shrimp Po’ Boy, Grassroots Vegetable Chop salad, and their specialty BBQ plate. Amazing food, and amazing service by both our waitress Mary and the rest of the staff. From the moment I stepped in and mentioned our reservation, the hostess was so sweet and kind, and gladly walked me over to a reserved table on the patio while I waited for the rest of my group to arrive. Thanks so much for a great dinner - We’ll definitely be back for more!",
   "The food was fabulous: fresh and delicious! They accommodated our dietary guidelines well. We loved our server, Kris, so much that we requested him again at our second visit :-) He even brought us an anniversary gift!"
  ]
 },
 {
  "name": "The Gladly Restaurant",
  "address": "2201 E Camelback Rd, Phoenix, AZ 85016, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f95fdfc2-9332-11ea-9f48-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "drink",
   "food",
   "drink",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16512332448216501891",
  "source": "GoogleMaps",
  "reviews": [
   "Being the last ones on the patio with a large group our server was handling inside meant we got a little forgotten at the end there, but otherwise a perfect meal. That duck meatloaf was out of this world. All the flavors combined for a perfectly balanced dish. That roasted chicken was so moist and flavorful. Paired nicely with the risotto and tomatoes. That buttermooink burger though, that's where it was at. If you're into burgers, this one will leave you thinking about it for days after. Very worth a stop. Kind of an odd location, but come hungry.",
   "Wow. This place is as-advertised - fresh selection of amazing food, incredible drink selections and nice Happy Hour menu. Try the chopped salad and seafood chowder and the Salmon entree. The ice ball presentation is fantastic and makes the drink extra special. You will spend big here if you want but can take it easy with happy hour too. Service was spot on fantastic.",
   "Wow. This place is as-advertised - fresh selection of amazing food, incredible drink selections and nice Happy Hour menu. Try the chopped salad and seafood chowder and the Salmon entree. The ice ball presentation is fantastic and makes the drink extra special. You will spend big here if you want but can take it easy with happy hour too. Service was spot on fantastic.",
   "This place was great! So was their appetizer/snacks. If you want to try every and any type of drink/cocktail/wine, or beer; they've got it. The bartenders/mixologist know how to do any type of drink that suits your fancy. We've been several times and would like to go back there. I believe their hours are only 10:00/10:30. It's well worth your trip. They're quite expensive, but at least try one time and you won't be disappointed. The atmosphere is nice -- we dressed up a bit when we went last. Music is nice too!",
   "Probably the best business lunch I have had all year! I have seen their Chop Salad on The Food Network so I recognized it right away. But, I did not know they mixed it at your table and I got a choice of protein. Wow! Even better! Then to have perfect scallops in a trendy, bright and bustling atmosphere made it amazing. However the hidden surprise was that lemon tart! It almost made me cry and moan it was so good!!! OMG Thanks Katelyn from Tobias, I owe you one."
  ]
 },
 {
  "name": "The Breadfruit & Rum Bar",
  "address": "108 E Pierce St #2051, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f9b245b8-9332-11ea-a86f-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "delicious",
   "knowledgeable",
   "food",
   "food",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=11417241162416725557",
  "source": "GoogleMaps",
  "reviews": [
   "I have to admit, when were were referred here, I immediately thought college rum joint.... hmmmm? Was I wrong! This is a beautiful little neighborhood establishment that takes great pride in its offerings. Staff was extremely knowledgeable and had passion for what they do. We had a lovely meal, drinks and dessert. All choices were excellent and our server was perfect. If you have an opportunity, please check them out! Absolutely amazing! Quite possibly one of the best entree's I've had in Phoenix. Had the Tamarind Fish, like I said above, amazing! Awesome cocktails, friendly employees and relaxing atmosphere. What else could you ask for?",
   "We really enjoyed our meal here. Everything is so delicious and seasoned to perfection. Almost everything we had was a bit spicy and had a kick to it. From the shrimp, to the pork, to the whole fish to the clams we were not disappointed. Our server was very knowledgeable and explained al, the dishes to us. The cocktails are strong and yummy. I had 2 rum punches and I was feeling good! The restaurant is a bit pricey and worth every penny. We will definitely be back here again.",
   "This was one of the best restaurant experiences that my wife and I have ever had. The service was fantastic. The food was equally fantastic. I experienced taste combinations that I had never had before. This is a rum bar so we tried several different rum cocktails and they were wrong equally tasty as well as eye-catching in their presentation",
   "Food was fantastic, the wait staff was terrific. The only thing that was not so great was that a lot of the older patrons could not see the menus because if how dark it was. I personally like it that way because it seems more intimate. However it is a mood killer when you are constantly blinded by elderly patrons using the led flashlight on their phone to read the menu. I actually kept track and two of the other tables had their flashlights on for more than 5 minutes. Very annoying. It's not that big a menu.",
   "I have to admit, when were were referred here, I immediately thought college rum joint.... hmmmm? Was I wrong! This is a beautiful little neighborhood establishment that takes great pride in its offerings. Staff was extremely knowledgeable and had passion for what they do. We had a lovely meal, drinks and dessert. All choices were excellent and our server was perfect. If you have an opportunity, please check them out!"
  ]
 },
 {
  "name": "GreekTown Restaurant",
  "address": "8519 N 7th St, Phoenix, AZ 85020, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fa1574cc-9332-11ea-b035-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "family",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12083687661235731894",
  "source": "GoogleMaps",
  "reviews": [
   "Greektown came highly recommended. Came alone for dinner, greeted by George, assuming the owner and Demetri (seemed like family also). Very warm comfortable and authentic. Food was amazing. George recommended a plate not on the menu. Will definitely be back and tell everyone.",
   "The atmosphere here is terrific and the staff are awesome. Make you feel like a regular on your first visit. The food is amazing and perfectly timed. My courses didn't overlap and I love that. I didn't get a chance to have the coffee because it was too late at night for me so I will just have to go back.",
   "I love this restaurant! The owner, George, is very personable and friendly. He's been there every time we've gone in. Tonight we brought out of town family and they loved it just as much as we do!",
   "This place rocks! GREAT food, and very personable service. Portions were big, everything was fresh, and it was some of the best Greek food I've ever had. The owner, George, is a real entertainer and very personable. I want to come back to Phoenix just to go to Greektown!",
   "This restaurant has almost every element of a great restaurant under one roof.\n\nThe menu is not cluttered with a ton of different dishes to confuse the guests. It has just the right amount of options with simple descriptions of the dishes. Then comes the good prices that completly justify the great taste, quality, and the portion of the food. The  decor is simple but appealing, and everything is clean from the floors to the restrooms.\n\nThe restaurant is family-owned, and the owner(s) genuinely care about the customers and do their best for the best customer experience. The owner is hilarious, and very friendly. \n\nNow the best part. The food. I took my first bite on the gyro and couldn't believe how delicious it was! The rice, the bread,  the gyro,  the Greek salad– everything tasted fresh and unbelievably delicious. I was in Phoenix for work after a six-hour drive from LA in horrible weather and was struggling to find a hotel, but the food here literally made my day. Seriously, businesses like this deserve a lot more support."
  ]
 },
 {
  "name": "Mancuso's Restaurant",
  "address": "201 E Washington St Suite 201, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fa5defac-9332-11ea-9334-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "free",
   "food",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7536713159985368829",
  "source": "GoogleMaps",
  "reviews": [
   "really nice ambiance in such an unlikely place: surrounded by tall buildings downtown. reasonable prices and very tasty food combined with great service. I'll definitely be back!",
   "I booked dinner for 17 here upon a recommendation from a colleague and I had to have faith it would be OK because there was no where else available. This exceeded my hopes by a mile! Booking was super easy and professional. Menu choices were good and the food was scrumptious! Stuffed Mushrooms and tiramisu get ten stars!!! Our sever was fabulous and it was a great evening! Highly recommend for groups and the regular dining and outside space looked great too. I’ll come back for sure!",
   "GREAT PLACE. The server was helpful answering questions about the menu option,  a friend who is gluten free had all her questions answered and suggestions were offered to her. Plus for us Ladies, they have this fabulous mirror in the bathroom that makes you look 40 lbs lighter.\nThe food was delicious also.",
   "We recently had dinner here with eight people. Everyone loved their food. The bread was disappointing however, no one said anything but also no one had more than one breadstick. I tried the gnocchi alfredo with meatballs, the meatballs were not good. The rest of our group seemed happy with their meal. The dessert was really the star of the night. The chocolate cake was to die for, our waiter said it would melt in your mouth like butter and he wasn't wrong. Delicious.",
   "Great atmosphere and service. Delicious bread. Ok meatballs - too soft for me. Great wine list. Scenic, romantic patio. Best part... The fun mirror in the ladies bathroom."
  ]
 },
 {
  "name": "Avanti Restaurant",
  "address": "2728 E Thomas Rd, Phoenix, AZ 85016, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/faa7a2e8-9332-11ea-90c0-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3190583192424285160",
  "source": "GoogleMaps",
  "reviews": [
   "What a special night. Our good friends Julie Sullivan and Michael Belcher shared the evening. He proposed!! It was spur of the moment and amazing!! I was almost brought to tears. So wonderful. The restaurant still brought out a red flowers in a vase. We had dinner family style. Started with Calamari the continued on.for salad and then other main dishes. Way too much food but all was delicious.",
   "Great food and service. The garlic bread is fantastic. Not at all busy on Monday night, we had the entire bar side of the restaurant to ourselves. Very intimate and romantic. Our server, Sergio, was amazing. Very helpful with menu and drinks. The pasta was cooked perfectly with fresh vegetables and seafood. We will return when in the area.",
   "Amazing food and even better service! For an appetizer we ordered the calamari. It is hands down the best calamari we have ever had. For dinner, I had the pork tenderloin and my wife had the tortellini portofino. Both were delicious. Heck, even my veggies were yummy. I highly recommend. The only downside was that I was excited to dine accompanied by a piano but no one was playing.... on Valentine’s Day! Fortunately, that was the only disappointment of the night.",
   "We were a group of 12. Most of us had a form of pasta and a few had meat such as the veal chop and the pork chop. The meat choices were beautifully prepared and very tender and flavorful. Those with pasta said it was the best they'd had in years. Probably because they made their own pasta on site. Several choices of Rombauer wine also helped make the evening a huge hit.",
   "If you like Italian food... This is the place! It is an amazing time capsule of atmosphere reasonable prices and the best wait staff. The food was amazing.. Can you tell I enjoyed my self?  6 stars"
  ]
 },
 {
  "name": "The Henry",
  "address": "4455 E Camelback Rd, Phoenix, AZ 85018, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/faf2b726-9332-11ea-ac00-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "creative",
   "food",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=18203655143260475848",
  "source": "GoogleMaps",
  "reviews": [
   "From the moment you walk in and are greeted by the friendly hostess, you immediately feel at home. Not only is the ambiance, decor and vibe just outstanding, the food and waitstaff make it totally perfect. The staff is so helpful, friendly and accommodating not to mention the food is always perfect. Love love love this place. It is our go to restaurant, even though it is a long drive from Carefree. Anything Fox you can count on to be as close to perfect as possible...",
   "I'll couch this by saying we arrived at 2p on a Sunday afternoon. With that said, the Henry was the perfect spot for a Sunday nosh and adult beverage. We were seated at a lovely outdoor table in less than 10 minutes (no reservation). Our server appeared promptly with menus. I ordered a grapefruit spritzer that was only missing an Italian piazza to complete its loveliness! The brunch menu includes lots of options: breakfast bowls, burritos,salads and a burger. Vegan options were numerous. We had a quinoa/egg bowl and a Henry Scramble plus extra crispy bacon. Both bowls were more than enough and the bacon was perfectly done. Our first time at the Henry won't be our last.",
   "I feel compelled to leave this review because this average rating can so easily be above average.  This is for the morning cashiers: at the coffee bar: if you want to talk to the customers keep it brief especially when there are 10 people in line. A courteous good morning and then move along. With that said the pastries are great the breakfast food is creative but simple. Breakfast at The Henry is an absolutely delight.",
   "My first time visiting after hearing about it from so many friends. Fox restaurants never seem to fail me! I loved the salad choices and the kale salad was perfect. I look forward to going back and doing a little work. On another occasion try a happy hour",
   "A lovely place to enjoy the warm sun outside or a cozy table inside. Excellent customer care and very friendly staff. The menu has a lovely combination of foods sure to please the majority. Due to my modest appetite at the moment I opted for my stand by avocado smash. Definitely unique in flavors and exactly what I needed int he moment. Enjoyed a vanilla latte and my friend raved about the coffee cake."
  ]
 },
 {
  "name": "Anhelo Restaurant",
  "address": "628 E Adams St, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fb3fc4e8-9332-11ea-9252-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "food",
   "walk",
   "organized",
   "food",
   "delicious",
   "drink",
   "food",
   "food",
   "delicious",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=17803512763428784892",
  "source": "GoogleMaps",
  "reviews": [
   "great service. observing the staff was a treat, they all were friendly, knowledgeable about the restaurant, and the food. the menu is a bit small, but every single item looked delicious. the short rib is to die for. great scallops. espuma dessert was really really good. I can't wait to go back!",
   "Great food in a cool old building. Chill atmosphere with a slightly nicer vibe. Service was great and the staff was very friendly. There are a few more things on the menu I want to try and we will definitely be back. Best Restaurant ever. Food was great. Ther servers are very friendly and helpful. When you walk in you can see into the kitchen. The cooks are very clean and organized",
   "Absolutely delicious. Food and drink were spectacular. Friend got scallops and said they were to die for and my other friend got the risotto and was in love. I got the pork chop and wanted more. They have their own garden and I watched them pick the herbs to make our dinner. This place is great!",
   "I really enjoyed the food and presentation. The restaurant has a very romantic vibe; went with a group of girlfriends so initially that was weird. That being said there were a few groups, including one with their child. Some of the wait staff were off putting, however over all the service was good. Cute interior and loved the charm of the old house in which the restaurant is located. They even have their Anhelo wine that donates a portion to charty for children with heart conditions.",
   "To start, I really loved all of the food and the ambiance was very nice. The poutine was delicious and the house special pasta was quite flavorful. I would definitely go back just for the food, the quality and flavors were special. \nI’m only removing one star because of the service, which was ok but walking in around 9pm on a Saturday night, the vibe that we received made us feel like we weren’t wanted as patrons. Overall, I would definitely recommend Anhelo, just wish the service hadn’t left something to be desired."
  ]
 },
 {
  "name": "Islands Restaurant Phoenix",
  "address": "21001 N Tatum Blvd #36-1160, Phoenix, AZ 85050, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fb83d43e-9332-11ea-a433-14b31f159f22.png",
  "tags": [
   "tasting",
   "food",
   "tasting",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12078892541352331336",
  "source": "GoogleMaps",
  "reviews": [
   "Check out this location for really good tasting burgers that are light and very good smellie and tasty. Sauces dressings made from scratch and Unlimited fries delivered as bread starter if you are very hungry. Ice cream creations as well, are good. Patio seating with outside heating available. Very nice place overall so check it out and try a burger or something would ya!",
   "Islands has it all great burgers, cheddar fries and great iced tea with the orange slice.  Islands staff was fantastic,  friendly and very quick with refills and food.",
   "Check out this location for really good tasting burgers that are light and very good smellie and tasty. Sauces dressings made from scratch and Unlimited fries delivered as bread starter if you are very hungry. Ice cream creations as well, are good. Patio seating with outside heating available. Very nice place overall so check it out and try a burger or something would ya!",
   "I ordered the Kilauea w/ coleslaw and it was insanely delicious! Aint like any burger I've tasted before. I loved the chill atmosphere as well.",
   "I cannot fault this hotel. The food was great, the service was great, and it was also where we got engaged! A perfect restaurant that can stand out from the crowd, even in the area where there is so much choice. The portion size was perfect, and the steak was brilliant. I would highly recommend to anyone who is looking for fine dining in the area."
  ]
 },
 {
  "name": "CIBO",
  "address": "603 N 5th Ave, Phoenix, AZ 85003, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fbdbdfb0-9332-11ea-8fd8-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "delicious",
   "family",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=1943009799186576658",
  "source": "GoogleMaps",
  "reviews": [
   "We went here on Valentines Day and it was a great experience. I had called weeks ahead and made a reservation. When we arrived, they seated us immediately. Service was prompt and our waitress was very nice. The food was excellent and prices were fair. I definitely want to come back here sometime!",
   "Extremely delicious foods! This cafeteria has really the best set of foods and beverages that you can enjoy together with your loved ones. Everything here was really nice, and I would like to commend their staff for being so polite and attentive. It was such a great place to dine in together with your friends or family. Very worth it experiences!",
   "We had a very enjoyable dinner. The anti pasta was a delight and the pizza was hot and fresh. The waiter was very attentive and the atmosphere pleasant. My seat was near the doorway to the room we were in  and several patrons banged into it. The table should have been six inches further in the room to alleviate this issue.",
   "Heard all about the rave of this place so had to visit of course. I went on a weekday around 2 pm so there was no wait. Ordered the pepperoni and WOW. When I took the first bite I'm pretty sure my eyes closed (that's what I do when something is GOOD). Overall it was a great experience.",
   "CIBO is one of those rare restaurants that will deliver you a true 5 star experience every time. The food, the service, and the atmosphere are all far above par. Their pizzas and other Italian dishes are fresh, high quality, and of course delicious. The outdoor patio, complete with lighting, fireplaces, plants/trees, and often live music, is the perfect setting for a get together with friends or family, or especially a date night. A small mistake on our order was taken care of quickly, and service was fast. The calamari was delicious, and so was our pizza and sandwich. Note that they don’t take reservations other than large parties, so on a busy night, you might have to wait awhile for a table. Parking can be a pain on your own, but use their valet services to make things easier for yourself."
  ]
 },
 {
  "name": "Bri",
  "address": "2221 N 7th St, Phoenix, AZ 85006, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fc28a02e-9332-11ea-8a2c-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "eat",
   "food",
   "delicious",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14004247850701239881",
  "source": "GoogleMaps",
  "reviews": [
   "Been here twice now and absolutely love the small space and vibe in this restaurant. Seating is very limited and they also have bar seating. The food is excellent and is cooked over wood. Portions are small and the main meals feed 3-4 people. The roasted vegetables are a great starter. The duck and short ribs are both excellent options for the main meals. The duck can be a little spicy for some. In all highly recommend this place. Also the parking is extremely hard to come by and they direct you to a spot a little further down.",
   "Really cute little place. Great service, cocktails were interesting and well executed. The food menu looks so exciting! The description of flavors is so exciting, but almost everything we had fell a little flat. The spare ribs were plentiful and the sauce delicious, but so full of bones and cartilage they were awkward to eat. (Maybe that's just short ribs.) The sauce on the duck seemed a little too crusty but the duck was well cooked, moist tasty. The cheese/potato cakes were dry on the edges and SO GOOD in the middle. The smoked fish was perfection though. So, this place is great, and I would definitely go back, I just think I was slightly disappointed.",
   "The atmosphere here is really nice. Laid back and cool.  Awesome music,  amazing service.  Our bartender was the best (Jenny I believe) also Molly.  Both made us feel so welcome. Drinks were great,  food was perfect.  Seriously.  The best food! Had three sardines special,  omg, delicious.  Lychee scallops, yummy.... can't wait to come back.",
   "You know how you can drive down a street and see a place that you mean to try but just never get there. That's what happened with Bri. We live nearby, up and down 7th st all of the time and we saw the sign and had every intention of giving it a try. Last night, we did and were happy we did. It's the old Rice Paper....small, cozy and open. Community tables are fine with us...we meet people all of the time that way and enjoy it. Cocktails were great and for the beer lovers, they have a small but good beer/ale menu. Wine list is tiny and unremarkable.",
   "This place will make you think you are in a cozy home having some tasty food. The food is cooked on an open wood grill so the vibe inside is chill with a hint of smoke. The service was fantastic and the food was great.  Whether you are dining with by yourself or with a huge group of friends you will have a great evening here. The happy hour looked great and the reverse happy hour was even cooler."
  ]
 },
 {
  "name": "Gallo Blanco",
  "address": "928 E Pierce St, Phoenix, AZ 85006, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fc7d9e4a-9332-11ea-9a60-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "drink",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11130878346119297924",
  "source": "GoogleMaps",
  "reviews": [
   "We were looking for some good Mexican food and found this place by the reviews. The atmosphere was great; the food was excellent; and the service was outstanding. We had a great experience. The prices and portion sizes were decent. My kids enjoyed the food even though it was different Mexican fare than they are used to. Highly recommend.",
   "This is one of my all time favorite Mexican restaurants. The cocktails here are phenomenal. My personal go to is the Ernesto Hemingway. The mescal gives it a smoky flavor. You have to try it!  Also happy hour 3-6 daily with great food and drink specials. If near downtown Phoenix you should check it out",
   "Gallo Blanco Cafe is the best Mexican food I have had in Phoenix. Fresh ingredients, delicious flavors, healthy portions, and amazing service... my Mexican grandmother would approve. The Al Pastor Tacos were fabulous, the best I've ever had outside of Mexico City. Tortillas are excellent. The Chilaquiles were top notch and big enough to share with another person. What I love most is that the chefs aren't trying to over complicate their food. The dishes are simple, very well put together using local ingredients, and the total bill didn't break the bank. What's more... the servers add to the experience with their awesome attitudes and genuine pride for where they work. I can't wait to go back and experience this menu dish by dish. It's my new favorite spot for all things Mexican cuisine. Oh... and I am definitely going back to try their mouth watering selection of mezcals and tequilas. Sign me up for Happy Hour, baby - I am hooked!",
   "One of my favorite spots for Mexican food. The mole is one of the best dishes I've tried here. The tacos, especially the fish taco y delicious. Finishing the meal with a capuccino or a cafe con cajeta justo makes it all the more delicious",
   "We were in town for a business trip and decided to stop in due to the great reviews.  Well we are glad we did, everything was great.  The atmosphere is modern and laid back, the service was great also attentive but not overbearing at all.  The food was amazing, we sampled most of the appetizers on the menu!  After those we had some amazing food. Do yourself a favor and stop in if you are in the area."
  ]
 },
 {
  "name": "District American Kitchen and Wine Bar",
  "address": "320 N 3rd St, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fcc1d37e-9332-11ea-88d5-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18164660700688802201",
  "source": "GoogleMaps",
  "reviews": [
   "Great place and great food nice place to make business meeting or Any formal meeting. Nice wine collection and great service . please try chicken fried and hot chicken burger ... Overall great place with great experience..",
   "Very good wine list with a couple of AZ wines by the glass. The food we tried was also very good, with the $22 specials being a reasonable price for the area. The short rib stroganoff was pretty good but could have used more sauce. Desserts were good as well.",
   "Loved the service. Five stars on ambiance, service and cleanliness. The food was very good, cooked perfect, but the playing was not quite 5 stars, though closer to 5 than 4. Were had a great time.",
   "District has the best happy hour in Phoenix. I would even argue the best happy hour in the valley of the sun. Wings, fries, mac n cheese, hummus with veggies, and chips with dip each for about $5-$8 (1/2 off for HH). Cocktails, beer, and wine each under $7. \n\nEverything on happy hour is delicious! \nCustomer service is always great which is definitely a plus.",
   "The District is gone, and a buffet is in its place, only not really. It was actually inside the Sheraton on the fourth floor with a different name. Trying to get validation for parking was crazy. I think it was the fourth person I talked to that made it possible. He was really nice but finding this place and getting back out was anything but easy. Food was good."
  ]
 },
 {
  "name": "Rustler’s Rooste",
  "address": "8383 S 48th St, Phoenix, AZ 85044, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fd08eebe-9332-11ea-9ce0-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "kids",
   "delicious",
   "kids",
   "food",
   "kids",
   "family",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=1340500000724962898",
  "source": "GoogleMaps",
  "reviews": [
   "I’ve been to Rustler’s Rooste several times. Every time I go we go with a group of people and we have such a good time! The environment immediately puts you in a good mood and the service there is incredible! Everyone is so friendly and fun! This time I went on a company event and it was amazing! The food was delicious and cooked just right! The decorations were so festive and it put us in the mood to dance all night long! The view of the city from here is breathtaking. This is definitely a good place to have a big Family dinner or company get together.",
   "If you are looking for a fun and casual dining experience, then I recommend going to Rustler's Rooste. There is a live steer at the entrance and plenty of excellent BBQ meat options. You can even try rattlesnake if you dare! Rustler's Rooste offers some excellent views of Tempe/Phoenix. Great steaks and service with a great view of the city. The only restaurant I know of with a slide for the kids to enter.",
   "I visited this location years ago on a group business event. I distinctly remembered and made sure to bring my kids when we visited the Phoenix area years later. The old cowboy vibe there is fun, they even have an indoor slide when you enter the restaurant or you can choose to use the stairs. The food is delicious and the portions are large. The sunset view from the restaurant is amazing. I will definitely visit again when I'm in the area.",
   "The ambiance is fun! Wooden planks floors, a slide and a waterfall. The views of the city in the evening are gorgeous. Service was outstanding! My husband raved about the beef ribs. I thought the shrimp cocktail was pretty standard, but good. I ordered an extra dirty vodka martini and it was perfect. It's definitely a family friendly place and there were a lot of kids on a Friday night, but it also manages to be cozy for couples.",
   "The view is just gorgeous, it is difficult to find something that can encompass the entire city like that. The food is nice too, plenty to go around for sure. Though there isn't many vegetarian options. The live music was endearing and totally country- perfect for the atmosphere. Be careful of the amount of stairs and it will be a good time"
  ]
 },
 {
  "name": "FEZ",
  "address": "105 W Portland St, Phoenix, AZ 85003, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fd567de4-9332-11ea-ab9f-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "eat",
   "drink",
   "eat",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17892385230456533145",
  "source": "GoogleMaps",
  "reviews": [
   "Enjoyed a very delicious Valentine's day dinner at FEZ. Was able to make reservations, and was seated without any wait at our reserved time. Staff was very attentive, and gave great insights into different dishes we were trying to decide between. The menu has so many good things to choose from it was hard to pick.",
   "Atmosphere is always delightful. Eating outside or inside. I have tried almost all of menu. I order the calamari every time. Their specials are usually worth trying. Big fan of the presses. Service is always top notch. Bartenders are great! Every employee is beyond accommodating. I’ve stopped in at every time of the day, different times of the year. It’s always worth the stop. Parking isn’t bad, if you use the parking garage. I ping my location to friends. All around great place to eat or drink.",
   "Atmosphere is always delightful. Eating outside or inside. I have tried almost all of menu. I order the calamari every time. Their specials are usually worth trying. Big fan of the presses. Service is always top notch. Bartenders are great! Every employee is beyond accommodating. I’ve stopped in at every time of the day, different times of the year. It’s always worth the stop. Parking isn’t bad, if you use the parking garage. I ping my location to friends. All around great place to eat or drink.",
   "This place was AWESOME. I picked it on a whim to meet some family somewhere for dinner. We each tried different things and I think everyone was really into what they got. I would definitely visit again next time we're in the area. Try the French fries and their FEZ burger!",
   "Fez is such an amazing place to get food and be with friends. I really loved our waiter. They were so sweet to bring my friend a birthday desert. The banana desert was one of the best deserts I have had in years. I can't wait to go back!"
  ]
 },
 {
  "name": "Richardson's Cuisine of New Mexico",
  "address": "6335 N 16th St, Phoenix, AZ 85016, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fd9bc470-9332-11ea-87a4-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "knowledgeable",
   "food",
   "food",
   "delicious",
   "food",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=16293669161784246173",
  "source": "GoogleMaps",
  "reviews": [
   "This is by far, my favorite restaurant in the valley. Chef Vic is a culinary genius, making everything not only delicious, but also consistent.  \nthe way the owner freshly keeps up the place with beautiful flowers, and flowing water bowls for dogs is really impressive, giving a strong, natural, feeling of home. \nSit on the patio at the bar, you will be impressed..\nRichardson's (and The Rokerij) creates a warm, effortless, ambiance and is true hospitality. \nCheers!",
   "Oh my GOODNESS this place is incredible!!!! Its beautiful and seems very hidden, gives you a feel of privacy. The service was friendly and knowledgeable about the food. We came Valentines Day and had an incredible meal. We started with wine and the queso/chips. I ordered the enchiladas plate; cheese, turkey and pork, with Christmas sauce. Paired with beans and rice, it was nicely spicy and delicious!!!!!! I will definitely return!",
   "Wonderful hidden gem! A great atmosphere, great service, and fantastic authentic New Mexico food! A little on the pricey side, but worth it. The portions of food are very large. The freshly breed coffee is really good, and the margaritas are just as tasty! Highly recommend.",
   "Food was delicious! The patio was perfect for a cool night! Jalapeno poppers warm you up also so heads up...but they were so good 🔥. Bloody Mary wasn't the best I have had but not too bad. Bacon wrapped shrimp was amazing!",
   "Awesome place. Great Southwest decor and a menu with unique items and also their take on traditional ones. Beware, the appetizers are large portions and fantastic. All four of us couldn't finish our main courses! Looking forward to the leftovers at home soon. Good outdoor seating. We'll be back for sure."
  ]
 },
 {
  "name": "Culinary Dropout",
  "address": "5632 N 7th St, Phoenix, AZ 85014, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fdec06cc-9332-11ea-8c69-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2103499372696634781",
  "source": "GoogleMaps",
  "reviews": [
   "Staff was exceptional. Really good hosting. Food was also great. Atmosphere is really the top thing here. Only downside was that every car had to valet which causes a huge backup. We sat in line for 10 minutes since there were only 2 or 3 valets.",
   "This is one great place! I love coming here when I lived nearby! It was always upbeat and fun. We’ve tried almost everything on the menu and everything is very good! This most recent time I was able to try the brunch menu. I got the breakfast burrito, which was huge! It was covered in their provolone queso and made it extra yummy! We sat at the bar tho because we didn’t want to try and wait for a table and that worked out alright for us. However due to how extremely busy this place is getting the attention of a bar tender was extremely difficult. There was a time when we finally got a bartender to check up on us, I’d been waiting to order another drink, and when I did he filled up the water glasses and walked away without getting my drink. So then had to wait even longer. I will still return as I always have.",
   "The service is great. Food is tasty. Wide variety of menu items available, can’t complain. Have been there at least five times over the last two months, came out with nice feeling every single time about the food that we had. Check it out!",
   "This is an amazing space and environment! I had been here once before in the day time (which was great), this was my first time coming here at night and it did not disappoint, what an atmosphere! I sat at the bar and the service all around was top notch. Everyone was very attentive, nice and professional.  The Manager Andrew  took the time to come check on me and ask me how the food and drinks were (which were also amazing) despite how busy he was. 10/10 will be back !",
   "On a positive note,, the server was very personable and accommodating.\nI am not in favor of valet services. There is no mention that this is the only way you can park your car on Saturday. Understanding the menu was a task in itself; the food ordered ( chicken wings) was dry. The dipped sandwich was not liked at all by my guest. \nThe entrance to the washrooms is deceiving... separate male and female doors which lead to the same common area, then you have to find the men and woman's doors.  I stood outside watching for my children and all I saw was a bunch of people scratching their heads trying to navigate this. This definitely is a  conducive condition for some very bad situations. This restaurant's saving grace is the common area where people can freely play some games."
  ]
 },
 {
  "name": "Bluewater Grill",
  "address": "1720 E Camelback Rd, Phoenix, AZ 85016, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fe37435c-9332-11ea-b717-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10250590496645492726",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place!!  I was traveling from Florida and was used to great seafood.  I was blown away by the freshness and presentation.  I loved the North Eastern influence with excellent clam chowder.  The little neck clams were to die for and we had crusty french bread for dipping.  Add octopus as a treat appetizer.  Crispy fried catfish and properly baked walleye.  And the coleslaw was fresh and delicious.  I can't wait to go back.",
   "Went here for Matt Jr's birthday dinner. Both service and food were outstanding. We were there in time for happy hour, and enjoyed some appetizers on special. I had sand dabs and they were great. We also enjoyed a large salad, and fish tacos. For the appetizers, we had fish bites and calamari. Our server was very attentive, and made sure we were well taken care of for Matt's birthday. We got dessert to go, and they gave us a free mud pie for Matt's birthday. It looks so good, we ate it straight out of the to go container while still at the restaurant!",
   "One of the hardest to find eats to get value, quality and flavor within the seafood genre in the Valley - you’ll find at the Blue Water Grill.  Although there are quite a few seafood eateries, not many mind-you, the Blue Water Grill stands out in many ways.  One is price for value, another is the quality and variety of their offerings, the comfort, décor, service and friendliness.  With every visit we’ve had, they are by far our go-to seafood and fish restaurant!  We love their décor, their ambience as a combo of Sushi joint, Fishery and Restaurant.  I forget that they have a great bar and selection, with some really great mixologists who concoct some great old-fashioned as well as new beverages like American Mule, one my faves; they serve William Hill Chardonnay in a bottle or glass; they also have an excellent Cucumber Mojito.  Over the many visits to Bluewater Grill, we’ve had some incredible dishes which have included, but were not limited to Sushi Bar treats like their Senorita Roll.  A beautifully and flavorful rendition of Mahi Mahi Tacos.  Their Beer Batter Fish & Chips are excellent with a fantastic, fluffy and tasty Alaskan cod (not just white fish like many other eateries) with a crispy yet neatly thin coating – which lets the inner goodness of the fish come through.  One of the best San Francisco-style Cioppinos I’ve had in the area with Linguine Pasta in marinara sauce with plenty of mussels, shrimp, clams, crabmeat and fish.  Not to mention the many delectable offerings from the Sushi Bar such as their Mahi Mahi Special, the Salmon Special, the Senorita Roll, an extremely well done Spicy Charred Edamame, the Tuna Maguro; a terrific Philadelphia Roll; their exclusive preparation of the Phoenix Roll; wonderful Salmon Sashimi (Nama-Jake), a sumptuous Senorita Roll, the Las Vegas Roll and the always fresh and well-prepared Tuna Sashimi (Maguro).  If you’re a seafood and fish lover as we are, you are discriminating at every point – and every point is discerning in the approach, preparation, presentation and taste Bluewater offers.  Kudos to a great place to have an excellent opportunity to enjoy seafood at its best in the Valley.  Bon appétit!",
   "One of my favorite restaurants.  Excellent seafood",
   "Excellent seafood, casual atmosphere. One of  the best wait staff in Phoenix."
  ]
 },
 {
  "name": "Rokerij",
  "address": "6335 N 16th St, Phoenix, AZ 85016, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fe82a458-9332-11ea-a797-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3191422794007291382",
  "source": "GoogleMaps",
  "reviews": [
   "Very busy, cozy little place. Great late night happy hour - food and drinks. Being a transplant from Albuquerque, I’m a chile-head. This place, as well as Richardson’s and Dick’s Hideaway, is by far the most authentic New Mexican cuisine I have found in Phoenix. Great for date night! Outside dining as well. Not such a great spot for larger groups of 6 or more. Largest booth, as they cannot rearrange tables, sits five adults comfortably; add a chair for a sixth person.  Love this cozy place. Can’t wait to go back.",
   "This is so heartbreaking for me... I’m giving 3 stars because we’ve always had wonderful experiences and food here, but Valentine’s Day was way off... I ordered the Southwest Ribeye, and it was like a giant blob of bone and fat with cheddar cheese melted all over the top (before and after photos below). For a $400 bill for 4 people, my expectations were higher.  The ambiance is still wonderful, and our server was great. 😔",
   "Good food, great ambiance. Ambiance used to justify disparity between food quality and cost. Less and less so. Good but not amazing food shouldn't cost so much. Improve the quality, reduce the price, or both.\n\nProbably they don't have to because the ambiance is so good (especially in the basement bar)",
   "The service and food were excellent. The menu had so many things that sound delicious. Ill definitely be back.",
   "This is one of my favorite restaurants in Phoenix. I love the food, and service has been consistently great every time. Last visit I had the enchiladas with beans and rice and they were just delicious. The drinks are great as well. Portions are generous, so be ready to eat! This is a great place for special dates or celebrations."
  ]
 },
 {
  "name": "Clever Koi",
  "address": "4236 N Central Ave #100, Phoenix, AZ 85012, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fecd0818-9332-11ea-b665-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "creative"
  ],
  "link": "https://maps.google.com/?cid=9486286387682772530",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic Food and service. Raymond was a great waiter and really took care of us. It was our first time here and he answered all our questions and was very knowledgeable of the menu.  Really enjoyed the green tea as well!",
   "Creative appetizers and drinks with wonderfully simple yet rich main dishes. Love the black bean and celery root pancakes. Pork ramen is simply rich deliciousness.",
   "This place is a hidden gem and a great date night spot. You have to check it out. It has one of the coolest vibes and I haven’t tried anything yet that I haven’t liked. Their drinks are always on point too. It can add up pretty fast but I’d say the prices overall are worth it.",
   "Really nice slightly upscale dining with bar seating infront of cooking stations in addition to indoor, patio and bar seating.  Staff was friendly and the drinks were mixed well.  Tuna chips appetizer is absolutely wonderful and should be tried.",
   "Super happy to support this local restaurant. Can't wait to get back for their happy hour."
  ]
 },
 {
  "name": "Adela's Italian Restaurant",
  "address": "4041 E Thomas Rd #107, Phoenix, AZ 85018, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ff1cc30c-9332-11ea-a7c5-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "delicious",
   "family",
   "food",
   "food",
   "delicious",
   "knowledgeable",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17512071457317459437",
  "source": "GoogleMaps",
  "reviews": [
   "Small place but very clean. It's a family business and everyone is very kind. I was surprised that nobody is actually Italian. With that said, the food was delicious. The person who cooks clearly has mastered cooking Italian food. I recommend this place! I love this pasta restaurant a lot. They had the tastiest food in the area.  The place was so romantic and cozy. The restaurant itself was so beautiful.  The crews were very courteous and accommodating. They made sure that  I had everything that I  needed on my table. It was such a great dinner that I had.",
   "we pretty much had to ask for a silverware and complementary bread they didn't bring it on their own. And then we each ordered something different he got a ravioli and I got the baked ziti. there was very few raviolis that they were not very filled on his. My big CD had some kind of weird cream sauce, and it tasted like it could have come out of a can. For the price I was very disappointed with the meal that we got.",
   "Small place but very clean. It's a family business and everyone is very kind. I was surprised that nobody is actually Italian. With that said, the food was delicious. The person who cooks clearly has mastered cooking Italian food. I recommend this place!",
   "I love this pasta restaurant a lot. They had the tastiest food in the area.  The place was so romantic and cozy. The restaurant itself was so beautiful.  The crews were very courteous and accommodating. They made sure that  I had everything that I  needed on my table. It was such a great dinner that I had.",
   "Luckily we found this awesome little place that looks cozy and serves delicious food. First you get freshly baked bread while you decide what to eat. The staff was friendly and knowledgeable in terms of explaining what the dishes were. I went with the special of the day which was lobster ravioli in a vodka sauce. That dish was packed with flavors."
  ]
 },
 {
  "name": "Vincent on Camelback",
  "address": "3930 E Camelback Rd, Phoenix, AZ 85018, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ff60a9f6-9332-11ea-b3ab-14b31f159f22.png",
  "tags": [
   "food",
   "knowledgeable",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=9572933938935490662",
  "source": "GoogleMaps",
  "reviews": [
   "We had a wonderful time and great food and mimosas. There is a great street wide market and farmers market on Saturdays. It's a cool area and a fun way to spend a long morning and afternoon!",
   "Atmosphere terrific,  waitstaff friendly and knowledgeable of every dish they serve. Upscale, and pricey! You definitely get what you pay for.",
   "It was completely adequate. So many better restaurants in the area for food and service. Parts were great. Parts were pretty terrible.",
   "Came last night to celebrate wedding anniversary. Had to send seafood dinner back after couple bites. Did not look or taste fresh. Shared my wife’s mediocre pepper steak tenderloin. Even desert was marginal. Won’t risk coming here again.",
   "Very mouthwatering lamb chops, delicious lobster salad. And an amazing home made cheesecake with raspberry topping..😘😍🥰"
  ]
 },
 {
  "name": "Pane Bianco Van Buren",
  "address": "1505 E Van Buren St, Phoenix, AZ 85006, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ffa5f08a-9332-11ea-8149-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "food",
   "eat",
   "unique",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7669744260290078494",
  "source": "GoogleMaps",
  "reviews": [
   "Another winning restaurant from Chris Bianco!  The food and the staff are terrific.   Sandwiches, pizzas, and salads are all prepared fresh to order.  The bread is fantastic and can be purchased to go.",
   "This was my first time visiting and I will definitely be back. The food is fantastic and extremely reasonably priced. Several items on the menu change everyday. The atmosphere is open and unique.",
   "Life changing pizza and sandwiches.  Jealous of the local residence,  they get to eat here every day. Best pizza I had this year. Maybe ever....maybe, certainly up there in top 5. This place is go good words cant describe what this man does with just a few ingredients. Please everyone reading this go eat here, it was amazing.",
   "Great food, friendly inviting staff. Unique food. Great to see investment in the area!",
   "Well, if you know Chef Bianco, you know the food will be great. What makes this spot four stars is that this is Bianco's experimental space, so he's there all the time trying things out. WARNING: their regular hours are 11AM to 3PM Mon-Sat. No dinner service."
  ]
 },
 {
  "name": "Delux",
  "address": "3146 E Camelback Rd, Phoenix, AZ 85016, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/00094682-9333-11ea-a733-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "family",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1562156526156626941",
  "source": "GoogleMaps",
  "reviews": [
   "Starting with why it didn't get five stars.  Too many dogs on the patio, and the constant smokers sitting on the bench to the east.   All that being said,  fabulous service.  Our server,  Krista, was attentive,  funny,  efficient and c knew the menu.  Kept our drinks full,  and made sure we were content. The food was good. The happy hour sliders were so perfectly made.  We ordered rare and that was what we got. They were delicious! Fries were awesome, as were the sushi rolls.  Great prices for what you get.  We will be back!",
   "Came here with family who live locally and love this place! We ordered Sushi, Sashimi, and a few rolls. Also ordered a beet salad for the table. All were fantastic! We are big sushi fans and Delux has the best sushi we have enjoyed while visiting the Phoenix area! The owner stopped by our table several times just to chat and it was a very enjoyable visit. Next visit I might try a burger!!",
   "Cool hip atmosphere serving a larger variety of freshly made to order burgers, sushi accompanied by a wide variety of draft beers!  Nice daily specials and a good reverse happy hour.  The staff is very friendly and accommodating.",
   "We were in the area to meet a friend for dinner & she suggested Delux. She turned out to be quite truthful when she said that she's taken many friends to the restaurant and no one had a bad meal. She can count us in that statement. I had the junior beet salad & one mini burger and both were delicious and very filling. Our friend had a full salad & it was huge. My sister had a burger & really enjoyed the meat and especially the brioche bun. We & another friend will be back in the area in a few weeks and are already planning to go there for dinner.",
   "Came here with family who live locally and love this place! We ordered Sushi, Sashimi, and a few rolls. Also ordered a beet salad for the table. All were fantastic! We are big sushi fans and Delux has the best sushi we have enjoyed while visiting the Phoenix area! The owner stopped by our table several times just to chat and it was a very enjoyable visit. Next visit I might try a burger!!"
  ]
 },
 {
  "name": "Angels Trumpet Ale House",
  "address": "810 N 2nd St, Phoenix, AZ 85004, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/005766d8-9333-11ea-9641-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "delicious",
   "delicious",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10508121493660548637",
  "source": "GoogleMaps",
  "reviews": [
   "This was a GREAT beginning to our Spring training trip. We visited late evening with 3 dogs. Their outdoor patio was dog friendly, open and clean. The staff were exceptionally kind and gracious to us. We ordered their fish tacos, AWESOME, some of the best I've had and their special was the brisket sliders plate, which came with lots of goodies, DELICIOUS. Some restaurants will make us order \"the whole meal\". They did not and charged us accordingly! We will return in the future!",
   "This place is awesome!  They have amazing food and great beer selection. Their beer selection is always rotating so you will always have an opportunity to try a new beer from across the country. They have a decent wine selection too although I’ve only had their beer. The back patio is really cool with the Phoenix skyline as a backdrop and some Adirondack chairs beneath these really pretty trees that have a bright yellow flower on them. Very chill space.",
   "You can always count on Angel's Trumpet for a great, changing special menu, and delicious house recipes on the full time menu. They have one of THE largest beer/ale/wine menus, and are always busy-which is a great thing. I always love coming here when I'm downtown! And you will, too 😊",
   "We recently visited Angels Trumpet (Downtown location) while in Phoenix for a convention. We had no idea what to expect but went based on the reviews. What a fun & enjoyable experience. Our server, Josh, was amazing & very friendly. I enjoyed a glass of draft wine - Pinot Gris, and my friend had a draft beer (we can’t remember which one). The pretzel appetizer was so yummy. We could have eaten another plate of those. For our mains we had the bbq brisket grilled cheese with fries and the central Sammy with coleslaw. Both were delicious. We loved the decor, the ambiance and the staff who obviously enjoyed their jobs. We will definitely be back on our next visit to Phoenix.",
   "Food has always been good, service is friendly and consistent. Could be faster, but that could just be my skewed perception as I usually end up waiting for people to show up.\n\nThe double cheeseburger was delicious, the sauce makes it. Whatever they put in that sauce is spectacular and will leave you wanting more.\n\nRib tips are great. Everything pretzel based is to die for, it will seriously destroy your keto diet, also worth it.\n\nParking is free, if you can find a space. This is one of my pet peeves. People often park here and go elsewhere. This isn't the restaurants fault, obviously, just annoying. Watched someone take the last spot the other day only to get into another car and drive away."
  ]
 }
]