[
 {
  "name": "South Dakota Discovery Center",
  "address": "805 W Sioux Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/00a27994-9333-11ea-980b-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2294906391813810818",
  "source": "GoogleMaps",
  "reviews": [
   "We love the Discovery Center! It's a wonderful place for the kids to run around and burn energy, but also filled with educational activities. Keep your eyes open for awesome programming that the staff put on. The hours a little bit shortened in the winter, so if you're unable to make it now, rest assured summer hours are coming!",
   "This place is huge and really neat for kids to explore. There are so many things to do. My kids loved being in a giant bubble and also playing in the house and figuring out how to use the \"house phones\". We will definitely have to come back next time.",
   "Excellent place for kids. Lots of fun things for kids to do & look at. All age group activities for children. Kids will thank you for the fun.",
   "Such a fun place for children AND adults! Everyone is so nice!!",
   "Nice place with kids activities. The staff was friendly and they have some fun learning things to do!"
  ]
 },
 {
  "name": "South Dakota State Historical Society",
  "address": "900 Governors Dr, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/00e723ee-9333-11ea-ae4d-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=6341992661735710557",
  "source": "GoogleMaps",
  "reviews": [
   "An inexpensive museum with great value. A really interesting mostly underground building with a great view of town. Packed with information in the permanent galleries and with two rotating exhibits as well.",
   "Really nice museum, covers from the prehistoric to the current.  The exhibits are well done and informative.  we spent about two hours.  Cost is $4 with discount for seniors and children.",
   "Nice place ,  decent price to get in, very educational with all kinds of things to read about. As a local from the area I was impressed with the amount of extensive coverage on various subjects.",
   "Best small museum I've ever seen. It is a hidden gem in Pierre...spent 3 hours when I'd planned on 45 minutes. By all means, go.",
   "Beautiful scenery! Wonderful wildlife! And lots of places to visit with many things to do for the family. Highly recommend this area in the Black Hills of South Dakota for a vacation, even for a short getaway. It's so worth seeing and experiencing."
  ]
 },
 {
  "name": "South Dakota National Guard Museum",
  "address": "301 E Dakota Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/012b0308-9333-11ea-9d97-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2122751395985941971",
  "source": "GoogleMaps",
  "reviews": [
   "Unfortunately when my friend and I rolled in around 5 pm, it had closed by 4 pm. Though I cannot say anything for the content inside, this small property boasts a rich reserve of vehicles and equipment to view outside (pictures included). I would like to go back to see the inside someday.",
   "Nice little museum down by the Missouri River.  The building was closed when I visited, but there were enough outdoor exhibits to make it worth a side trip.",
   "If you are in Pierre SD, this is a small niche museum you must see.  It's simple but done with heart that comes from pride in service to the Nation.  We've come to really appreciate in our travels how much pride the \"locals\" put into places like this...so, stop by and support this tribute to Americans who served their nation in combat.",
   "If ever in pierre,sd this is a must, very nice and interesting look into not only the history of the SD National Guard, the history of the US military as a whole.",
   "A great little museum to visit if you are visiting Pierre.  It might be recommended for nonresidents to set map directions as it isn't necessarily located in a popular area of travel. \n\nA great place for people like myself  who enjoy military history and continual learning. I personally enjoyed our visit,  despite not all our children being as excited as I was. Unfortunately generational differences don't necessarily allow this place to be as enjoyable for teenagers. It is definitely recommended for younger children as my grandsons had a wonderful time."
  ]
 },
 {
  "name": "South Dakota State Capitol",
  "address": "500 E Capitol Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/016a54f4-9333-11ea-8f31-14b31f159f22.png",
  "tags": [
   "history",
   "wander",
   "music"
  ],
  "link": "https://maps.google.com/?cid=611217508364858093",
  "source": "GoogleMaps",
  "reviews": [
   "My experience here was quite good. My mate and I rolled up in our car and parked just a block away with no issues, and unlike many of the other state capitol buildings I have visited, this had no security checks, at least coming through the door we did. All of the rooms were pretty accessible, including the State Affairs room where I testified. The setting was very nice on a bluff overlooking the Missouri River, and the ponds around it looked very cool. I might not visit again to testify, but I am glad I did the one time. It’s close in resemblance to the Montana State capitol because the same design was used, interestingly enough. If you’re passing through, it’s worth even a quick visit.",
   "It’s a decent state building though there isn’t much to see for tourists besides a few displays on the little history about the building itself and some pictures of the state officials. I wish it would show more culture, politics, and history stuff relating to the state of South Dakota.",
   "Great place. Pierre is such a quiet and simple city. When we visited here the Capitol dome was under repair work. But the experience of being there was superb enough to make us happy. We walked in the nearby areas and took some pictures. The nearby areas are also quiet and not too much traffic and activity there. We liked the atmosphere and our visit to this great location. There’s a church nearby and right in front of the capitol there is a Soldiers and Sailors World War Memorial Building.",
   "Interesting place to wander through, with plenty of artistic and architectural details.  The evening I visited there was a music recital that added to the enjoyment.",
   "Nice building to visit.  We didn't get to spend a lot of time as we were on our way to Rapid City.  We did get the boys capitol books stamped but almost had to run to another location (luckily found someone willing to go behind the desk and get the stamp."
  ]
 },
 {
  "name": "Fighting Stallions Memorial",
  "address": "500 E Capitol Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/01bc93d2-9333-11ea-9e9b-14b31f159f22.png",
  "tags": [
   "walk",
   "art"
  ],
  "link": "https://maps.google.com/?cid=10780784800937220411",
  "source": "GoogleMaps",
  "reviews": [
   "Nice interesting statue dedicated to past governor George s Mickelson and other government officials that died in a plane crash in Iowa years back. Right next to the state Capitol building and capital lake.",
   "Beautiful memorial for Gov. Mickelson and the others lost in 1993. Very picturesque location overlooking Capitol Lake.",
   "Nice park with a walk path around a pond with several statues.",
   "Great piece of art, right by capitol lake.",
   "Can't understand the confusing 1 star reviews here (and no comments either). What's the matter with these people? Along with the WWII monument at Capital Lake, the Fighting Stallions sculpture is easily one of the most moving tributes in all of Pierre/Ft. Pierre."
  ]
 },
 {
  "name": "Casey Tibbs Rodeo Center Museum",
  "address": "210 Verendrye Dr, Fort Pierre, SD 57532, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/02088cf6-9333-11ea-b22c-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7785174380294000009",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing Rodeo History and A Great Staff!!!",
   "If your into rodeo this is a must. Lots of history within this building.",
   "Great venue with an upstairs meeting room and with kitchen which could be used for a variety of events. Staff are great to work with.",
   "You don't have to be a rodeo fan to enjoy this Museum. Lots of interesting exhibits and excellent photographs Plus Great videos of rodeo Riders. Fully accessible to wheel chairs.",
   "Just a buck'n!"
  ]
 },
 {
  "name": "Steamboat Park",
  "address": "Poplar Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/024f80f6-9333-11ea-978d-14b31f159f22.png",
  "tags": [
   "eat"
  ],
  "link": "https://maps.google.com/?cid=7265040977543152167",
  "source": "GoogleMaps",
  "reviews": [
   "A must see if you are in the area.",
   "It rained but we enjoined the sights! Peaceful yet being used by fishers, boaters, people on lunch breaks. Paths and pavilions.",
   "Steamboat is a really good place to cool down after a hot day.",
   "Nicely maintained park. Good fishing. Next to the river.",
   "Nice little place to sit down and eat supper. Clean, close to the river, again, just a wonderful place to visit."
  ]
 },
 {
  "name": "Oahe Downstream State Recreation Area",
  "address": "20439 Marina Loop, Fort Pierre, SD 57532, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/029e3d3a-9333-11ea-bc39-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "nature",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=11676640448392737756",
  "source": "GoogleMaps",
  "reviews": [
   "It's so beautiful, and the camping cabins are far more spacious than they look.",
   "A great family location that the kids enjoy going back to often.",
   "Each campground (three total) has at least one fully functional comfort station. The cottonwood trail is amazing for nature watching, walking, or biking. Playgrounds at each campground and another near the marina. By far, one of my favorite campgrounds.",
   "Beautiful place. Paved for most of the area and a great place to relax. The roads are kind of confusing it's really just better to use Google maps or satelite images to get around. Also be ready to get some driving in. There are no places around the area to get snacks or drinks so bring your own.",
   "Great camping and fishing grounds. Lots of trails to explore  as well."
  ]
 },
 {
  "name": "Verendrye Monument",
  "address": "Verendrye Dr, Fort Pierre, SD 57532, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/02e6df42-9333-11ea-a226-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8616794336042787884",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful place to get a good sense of history, and a wonderful view of the river and the whole town. Can get good sunsets and sunrise views.",
   "Cool piece of history. Great view!!",
   "I was born and raised in Aberdeen, SD. As a child we made several trips to and through Pierre and Ft. Pierre, and I had the opportunity to see the Verendrye Plate several times. It was exciting to see this historical relic of French explorers and traders in the Dakotas.  My memories of the area at that time also include watching the construction of the Oahe Dam, at that time, the largest rolled earth dam in the world,  across the Missouri River. ",
   "Historical monument ",
   ""
  ]
 },
 {
  "name": "Fischers Lilly Park",
  "address": "415 Ash Ave, Fort Pierre, SD 57532, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0353842e-9333-11ea-9b94-14b31f159f22.png",
  "tags": [
   "parks",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=7780281553716120699",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to stop and rest. 12 RV spots with electricity and water  and dump station .\n$15 a night. Worth stopping here.  Beautiful  views of the Missior and Bad rivers.",
   "Affordable, quiet, beautiful view! What I love most about this park is that it is first come first serve. We came just before a holiday and didn't realize it...most of the other parks, with water and electric, were taken and as a last resort we tried this one. Wow we were pleasantly surprised with this park. The view, the play park and riverboat access made our stay here very pleasant. Only thing that was a little bit of an inconvenience was the dump station...no sewage hookups. But for $15 per night I would say this is a bargain.",
   "Beautiful park. Very nice shelter and play ground. Great for dogs. No shore access for dogs",
   "Great open green space right along the river. The playground was nice, but nothing spectacular. The kiddos and us had a great time at the Ft Pierre days!",
   "Nice little RV park on the Missouri River. \nHas water and electric; well maintained."
  ]
 },
 {
  "name": "Verendrye Museum",
  "address": "Deadwood St, Fort Pierre, SD 57532, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [
   "family",
   "history",
   "free"
  ],
  "link": "https://maps.google.com/?cid=15944540493253593570",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for camping and fishing and visiting with family and friends.",
   "Visited this past summer as we went through Ft. Pierre. On a side street and full of many historical artifacts, lots of history exhibits. The lady there was very happy to tell us about the local history and answer any questions .",
   "Very basic museum, at least it's free.",
   "Nice!",
   ""
  ]
 },
 {
  "name": "Fort Pierre Chouteau National Historic Landmark",
  "address": "348-350 Fort Chouteau Rd, Fort Pierre, SD 57532, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/03afd51e-9333-11ea-a76b-14b31f159f22.png",
  "tags": [
   "historic",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15896557276793501143",
  "source": "GoogleMaps",
  "reviews": [
   "It is an acreage dedicated to preserving the history of one of largest trading posts on the upper Missouri. Of note, it is the starting point of George Catlin's paintings of the North American Indian. He resolved that “nothing short of the loss of my life, shall prevent me from visiting their country, and of becoming their historian.”  \nAs of fall 2017 an over look was built to give the visitor a higher vantage point to look over the historic sight.",
   "Historical landmark well documented at this site",
   "Very cool my ancestors worked there so it was nice to put a place to my genealogy research",
   "The oldest settlement in the Dakota Territory. The Fort Pierre area has been continuously occupied since 1817.",
   ""
  ]
 },
 {
  "name": "Farm Island",
  "address": "Pierre, SD 57501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0407e082-9333-11ea-b467-14b31f159f22.png",
  "tags": [
   "nature",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10981672483093735089",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful State Park, beautifully maintained. Sites are large and grassy. Few mature trees in the Eastern end, but was still very nice. Great views of the surrounding hills. Nature walks, bike paths, fishing and swimming in the river. Oh did I mention that the bathrooms and showers were awesome and sparkling clean. Certainly nothing bad to say! Friendly people too!",
   "Great for camping, swimming, kayaking, running/walking, bicycling, and so much more. Awesome place to take your family. Staff is always super helpful and kind.",
   "There is so much to love about this area. Quiet. Tranquil. Relaxing.",
   "New shower houses and restrooms in 2019 clean campgrounds was a great time!",
   "Rating is for a visit a few months ago. We were just visiting the area and the woman working there was very helpful in getting us information."
  ]
 },
 {
  "name": "VisionBedding",
  "address": "512 S Van Buren Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0453ddf4-9333-11ea-a566-14b31f159f22.png",
  "tags": [
   "art"
  ],
  "link": "https://maps.google.com/?cid=1448295419311065456",
  "source": "GoogleMaps",
  "reviews": [
   "I ordered 2 rugs with matching curtains. They are amazing! Well made and beautiful. I want to add that the customer service is wonderful as well! I had an issue with the Postal delivery, and Vision Bedding was ready to fix the issue if the Post Office didn't. Thankfully, my package was recovered, but, the fact that they would help out is rare for companies. I highly recommend, and will be ordering more items to complete my set. Thanks all!",
   "We are in the beginning process of having one of our rooms dedicated to our favorite vacation spot, Wildwood, New Jersey.  We want this room to be filled with special memories of Wildwood.  After some research, I found Vision Bedding on the internet and decided to upload one of my husband's pictures for curtains.  They turned out beautiful.  We are so happy.  The company was in contact via email during the process to make sure we were happy with the placement and look before going to print.  We received our curtains in about a week and hung them as soon as they came in.  I would recommend VisionBedding if you are going for that special look.",
   "I ordered a rug and two pillows. I just received the pillows and the rug will be arriving shortly. I was accidently sent the wrong rug, but after an email exchange the situation was rectified the same day. The pillows I received are beautiful and high quality. I was also very pleased with the service I received. What I found most  enjoyable was the selection of products and art that was available. Great job guys.",
   "My daughter wanted Orca whales for her nursery theme, not a common theme. I found vision bedding on line. They were very helpful. The graphic designer Abby was extremely patient and was very helpful. Their   online help line is excellent. They answered in a timely manner. The rug and the pillow were more than I expected . They are beautiful.They were shipped in a timely manner.  Again i could not have done it without  Abby's total guidance.I will certainly use this company again.",
   "Everything about ordering and receiving a comforter from VisionBedding was easy. I was looking for a specific design style and found more to choose from at VisionBedding than any other site online. When my order arrived I was so happy with the craftsmanship and the design was really vibrant, just what I had wanted. To have a handmade comforter of really quality materials was such a great find. Also super nice customer care. I loved everything about this experience!"
  ]
 },
 {
  "name": "Flaming Fountain Memorial",
  "address": "700 E Broadway Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/04a70706-9333-11ea-b274-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=7624905358744840890",
  "source": "GoogleMaps",
  "reviews": [
   "If your in Pierre SD, a must to see, better at dark to see the flame. Also fun to feed the ducks and geese.",
   "Nice place to visit.  Be sure to also see the nearby South Dakota capital building at the same time!",
   "Nice memorial. Fountain hasn't been flaming lately, though.\n",
   "Must see",
   "Love this place"
  ]
 },
 {
  "name": "Fort Pierre National Grassland",
  "address": "Fort Pierre, SD 57532, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/04fcc886-9333-11ea-97fb-14b31f159f22.png",
  "tags": [
   "nature"
  ],
  "link": "https://maps.google.com/?cid=2025887457772241827",
  "source": "GoogleMaps",
  "reviews": [
   "Very beautiful place. Lots of farming going on here so if you plan on doing some prairie dog shooting make sure you don't hit any of the farmers cattle.",
   "I lived in the area for twenty plus years. If you are viewing this grassland from the highway only you are catching a glimpse of it.  If you want to really see or experience it , visit the Ft Pierre Nat'l Grasslands Center in Ft Pierre, get a map and advice. During the spring you can reserve a blind to watch and photograph Sharp Tail Grouse. The best thing about the Grasslands is that it is not full of public convences - nor should it be. I have enjoyed this land that was made for skies, and that you can get far enough away from modern life to hear nature unadulterated. Other wildlife seen here are the Pronghorn, deer, butterflies, various hawks, meadowlarks  and snakes- incl rattlesnakes. If you explore in the summer dress correctly and bring plenty of water.",
   "Beautiful Grassland! Got to fish for bass in some of the ponds here. Great fishing and pretty scenery.",
   "Very scenic, but not sure why this is called a National Grassland. Lots of cows grazing in pastures, crops, and haying going on. ",
   "piu o meno bella"
  ]
 },
 {
  "name": "Pioneer Auto Museum",
  "address": "503 5th St, Murdo, SD 57559, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/05559d28-9333-11ea-92ee-14b31f159f22.png",
  "tags": [
   "unique",
   "tour",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=14909238410839271266",
  "source": "GoogleMaps",
  "reviews": [
   "Visiting Pioneer Auto was one of the greatest experiences of my life! I am from Tampa, Florida, and I plan on visiting again! Pioneer Auto is so unique and cool, you will be amazed at the entire collection!",
   "Very nice auto collection that spans many years.  The people working here are very friendly and helpful. You can find most American made antique autos as well as many foreign cars.  The H-D & Indians make up a small display of older motorcycles.  Plus, farm tractors and trucks fill in blanks with a nice collection.  The antiques are nice to see.   Many household items, etc...  Clean restrooms too.  Great place to visit.",
   "This is another one of those places that has been a around for years. The two ladies that were working there were very pleasant. If you love cars, this is the place for you. Extensive car exhibit, tractors, and motorcycles. Only complaint would be to have better lighting in the buildings.",
   "#1 VISIT      WORTH THE VISIT     INSANE AMAZING COLLECTION     GREAT ICE CREAM\n\nExpect to spend an hour or 2 here to see all the buildings and each collections. Everything is so perfectly set up and organized and maintained. The staff was very friendly and if you're lucky you will get a custom tour narration as well. Pretty cool. \n\nThe collection is overwhelmingly large and amazing. So much to see. Totally worth the money. \n\nDon't forget Ice cream from the Diner on your way out.",
   "This is one of the most AWESOME places I have EVER been! There is something here for everyone! Some of the friendliest folks you ever want to meet, and they let me sit in the Dodge Viper!!!! OH YEAH! Thank you guys so much for a most wonderful visit. My wife, Mom and Dad all had a really great time!"
  ]
 },
 {
  "name": "West Bend State Recreation Area",
  "address": "22154 Westbend Rd, Harrold, SD 57536, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/059f9eb8-9333-11ea-b5c3-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=3111854470476206655",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to visit. It's very remote and you feel like you are in the middle of now where which makes it feel like real camping. Everyone was very friendly and informative. While we were there the rangers/camp hosts would frequently stop by to let us know if bad weather was on it's way and if we needed anything.",
   "Used to be our favorite place.  Now it's too crowded, hard to get reservations.",
   "Great place very clean and well-kept the  people are really friendly and helpful.  this is the kind of place you don't want to tell everyone about,  so you can keep it to your self.",
   "Beautiful location. Clean. If you love boating or fishing this is the place. No swimming beach, which is too bad.",
   "Our favorite fishing \"hideaway! Kid friendly, great fishing, nice sized pads. I caught a tagged walleye there!"
  ]
 },
 {
  "name": "Hyde Baseball Stadium",
  "address": "Pierre, SD 57501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/05ecade6-9333-11ea-85ad-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=18045299236433777733",
  "source": "GoogleMaps",
  "reviews": [
   "Great place. Well maintained",
   "A nice walk around the the Ball Park",
   "Nice overall, but seating is very uncomfortable.",
   "What a great place to watch a game!",
   "Clean, well kept stadium, Pierre Trappers game was fun!"
  ]
 },
 {
  "name": "Akta Lakota Museum & Cultural Center",
  "address": "1301 N Main St, Chamberlain, SD 57325, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0638f8da-9333-11ea-8270-14b31f159f22.png",
  "tags": [
   "historic",
   "history",
   "family",
   "history",
   "history",
   "unique",
   "art",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13746410517364141881",
  "source": "GoogleMaps",
  "reviews": [
   "We drove through the campus of St. Joseph's Indian School in Chamberlain and decided to make a quick stop at the Lakota Museum. It turned out to be not so quick. Way more than we expected. A high quality museum with a lot of excellent history of the Lakota Sioux. It also includes a nice summery of St. Joseph's School with many historic photographs. It has an excellent gift shop and the young ladies working in the gift shop were friendly and helpful. The museum is not large so an hour would work but if you have more time and are interested in history this would be a good place to target. A beautiful setting on the Missouri river.",
   "Quite small, but an excellent museum. Clean and clear ehxibit. Plenty of nice souvenirs to remember the history of the Great Plains people. If you're passing nearby it worth the stop to visit it. If , like us, you are in a family vacation trip across the Plains, it is worth too. Those who have read Bury My Heart at Wounded Knee will be specially pleased.",
   "On our way to the Badlands/Black Hills we enjoyed stopping at Chamberlain to see the view of the Missouri River from the Visitor Center.   Fortunately, we made time on our way back to stop at this lovely museum.  The museum is a beautiful building right on the river in town.  There is a friendly staff and the exhibits were very well done.  For families this should be a must see on the way to other sites in South Dakota - especially for families who are trying to help their children understand the history of this area.   While Mount Rushmore is a destination for many, this museum helps provide some balance.  Thank you for investing your time and money in educating people about our past.",
   "So honored to be able to go to a unique place. Learning history that mainstream Education system didn't teach you in schools.  The medicine wheel courtyard was so peaceful.  So many beautiful works of art from former students of the school. So much to take in that one visit is not enough.",
   "Every South Dakota school child should be required to visit here; as well as every adult!  I learned SO much.  Very detailed exhibits and notations on early Native American Life, culture.  Lots of authentic items, donated & identified.  There is a very large bookstore, souvenir shop; with something or everyone.  I spent 2 1/2 hrs here.  Native staff who work here are a wonderful source of current & historical information on our native Americans."
  ]
 },
 {
  "name": "West Whitlock State Recreation Area",
  "address": "16157 W Whitlock Rd # A, Gettysburg, SD 57442, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0680b078-9333-11ea-bb60-14b31f159f22.png",
  "tags": [
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3905215652459026997",
  "source": "GoogleMaps",
  "reviews": [
   "My family and I try to make it out to West Whitlock at least once per year.  We are rarely disappointed and this year was no different.  Beautiful park, clean comfort stations, friendly staff and guests.  Strongly recommend.",
   "Great place, clean and awesome service.",
   "We stayed late in the season it was convenient and clean but the rate seemed a little high when all the bathrooms and water were off. Maybe the gf&p could look at a off-peak season rate. We would use the cabins often for ice fishing or hunting if they did!",
   "Nice facilities. Great for family outings and boat fishing. Very quiet and relaxing.",
   "Couldn't find anything to complain about. They weren't very busy when we were there (late August) so it was very peacefull. We were late getting there and thought we were to late to get some firewood but the host drove through about 9 and went and got us some.\n\nThe only thing some might have problems with is that if you have ATT, you will have 0 signal. That was ok with us because we were looking to get off the grid for a bit.\n\nVery nice and relaxing stay! Will go again!"
  ]
 },
 {
  "name": "Big Badlands Overlook",
  "address": "Interior, SD 57750, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/06cc38ac-9333-11ea-8672-14b31f159f22.png",
  "tags": [
   "hike",
   "nature",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=18117009557778491833",
  "source": "GoogleMaps",
  "reviews": [
   "This area is massive and breathtaking. I don't think pictures do it justice, you definitely have to be there to experience it yourself. The ridges go on for miles, and the sense of scale is amazing! I'd go again in a heartbeat.",
   "It was amazing. Totally worth the $25. You are able to see beautiful nature along with some different animals such as rattlesnakes, big horned sheep, and bison. You are able to climb and hike! It's an amazing experience!",
   "Wow! What an awesome place to visit! The views are outstanding! There are plenty of places to pull off and enjoy the beauty as well as some great hiking trails!",
   "A nice visitor with lots of information about the Badlands. It is small and there were a lot of people in there on the day we stopped. They have a nice selection of gift items as well a books about the area. The staff was friendly and helpful.",
   "Awesome place to spend the day at. Lots of good trails to hike and plenty of good overlooks that you can just drive right up to. They have a great visitor center with souvenirs and any additional information you may need on the park."
  ]
 },
 {
  "name": "Badlands National Park",
  "address": "South Dakota, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0714daac-9333-11ea-82c7-14b31f159f22.png",
  "tags": [
   "walk",
   "eat",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=7595424339779287024",
  "source": "GoogleMaps",
  "reviews": [
   "A very beautiful place to stop with many places within it that you'll just have to take pictures. Parents.... watch your children. There are many places that are not fenced and seriously unsafe. This is also part of the beauty as you can touch, walk into the natural areas. Some decent places to stop and eat, buy trinkets and piddle. Decently clean in most places.",
   "Photos of the Badlands are awesome.... but actually being here and seeing it with your own eyes is truly amazing, especially in the morning. Luckily all the wildlife were cooperating the day we visited and were out and about.",
   "I arrived at the Badlands relatively late in the day, around 8:00pm or even later. It was the middle of the summer, and we got out of our car just in time to see one of the most beautiful sunsets I have ever seen. We proceeded to drive through the park until dark, and from what I witnessed, the badlands looks like an amazing place to visit during the day time, especially if one has more than an hour as they are passing through.",
   "We visited in winter and with the slight snow dusting this landscape was astonishing. Would recommend anyone to visit it. The visitor center is great and has friendly and informative staff.",
   "Amazing scenery and drives inside and outside this jewel of a park. Colors in the hills are unique and amazing. I am planning on going back, there was not enough time to see everything. But I did go to Wall Drug. I suggest stopping there at least once in your life."
  ]
 },
 {
  "name": "Pinnacles Overlook",
  "address": "SD-240, Wall, SD 57790, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/076a74f8-9333-11ea-89e2-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=3882656077182746193",
  "source": "GoogleMaps",
  "reviews": [
   "Simply breathtaking scenic view out Gods Land! Parking was plentiful and restrooms were convenient. Please keep the area clean and use the trash cans!!",
   "Simply beautiful 😍😍😍 The view is amazing even if it's a cloudy day",
   "The Pinnacles Overlook has nice RV parking and some awesome photographic opportunities. Worth the brief stop during your road trip through the Badlands.",
   "We explored all area on misty foggy day. The water made the colors more vibrant. As we came back up from overlook entire place was in a cloud. So surreal.",
   "Ample parking and plenty of people space also at this first overlook as you head into the park from Wall, SD.  We stopped a few times and each time there was also wildlife either in the immediate area or down in the canyon.  Great place for sunset."
  ]
 },
 {
  "name": "Yellow Mounds Overlook",
  "address": "SD-240, Wall, SD 57790, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/07bbc086-9333-11ea-a79f-14b31f159f22.png",
  "tags": [
   "hike",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=15369949057106588591",
  "source": "GoogleMaps",
  "reviews": [
   "The variety of color was very beautiful! Short and steep hike is awesome. You can see bighorn sheep trails. Its a good place to kiss also!",
   "Just breathtaking views and beautiful formations.",
   "This is a beautiful location. But you need to go deep and camp to truly enjoy the nature. But it's not as beautiful as Grand canyon.",
   "By the time we made it here, everyone else was \"done\" so I was the only one to get out and explore a bit.  A little change up in the coloring 😁",
   "Definitely need to stop here! Go down and take a first hand look of the yellow mounds."
  ]
 },
 {
  "name": "South Dakota Hall of Fame",
  "address": "1480 S Main St, Chamberlain, SD 57325, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/080f5dd8-9333-11ea-873f-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=15379597307124913934",
  "source": "GoogleMaps",
  "reviews": [
   "Nice walk to see the trucks and monuments",
   "We came  across this  place while we were searching for gas station. Nice views out side the building and cool plane model to look at. Didn’t go inside as it was closed.",
   "Great facility to visit.  Would always visit and stretch my legs traveling through the area.",
   "If you stop,  pay your respects ...",
   "Monumental place to visit! Very nice"
  ]
 },
 {
  "name": "LaFramboise Island State Nature Area",
  "address": "LaFramboise Island Trail, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/086286e8-9333-11ea-962b-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=1517076826694874354",
  "source": "GoogleMaps",
  "reviews": [
   "A great place to walk or let the dogs run anytime of the year! We especially love coming here late fall/winter as there is no leash requirement then. The trails are always well kept and clean",
   "If you are from out of town and are in the Pierre area go to this island! Full of nature and great trails in the middle of the Missouri. Deer everywhere. My family and I really enjoyed taking Sunday strolls through the thick woods.",
   "Camping. What camping? Decent camping. Or parking.",
   "Very quiet place to sit",
   "Love my little island"
  ]
 },
 {
  "name": "Skeleton Man Walking Skeleton Dinosaur",
  "address": "On the westbound side of I-90, just before exit 170., I-90, Midland, SD 57552, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/08c6a046-9333-11ea-a3e8-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "kids",
   "art"
  ],
  "link": "https://maps.google.com/?cid=14026649879574563653",
  "source": "GoogleMaps",
  "reviews": [
   "We seen this on our Yellow Stone road trip. This was awesome along the highway to see.\nMake sure  you watch for it...",
   "Very cool! Enjoyed seeing it from the road when we drove by!",
   "Unique roadside attraction. Just snap a pic driving by or pull over if ya want, but not everyday do you see a TRex out for a walk with one of the locals.",
   "One of the things that makes America great - public art.  This is a really cool thing to see on the side of the road.  Tell your kids to look North around Belvidere, SD.",
   "Need to pull off the side of I-90 West"
  ]
 },
 {
  "name": "Minuteman Missile Visitors Center",
  "address": "24545 CottonWood Rd, Philip, SD 57567, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/090bbfd2-9333-11ea-ac94-14b31f159f22.png",
  "tags": [
   "theatre",
   "tour",
   "walk",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=14249925169518200291",
  "source": "GoogleMaps",
  "reviews": [
   "Staffs were friendly and give the information about the roads & it's conditions. Well maintained place, must visit. Before visiting Badlands national Park, check the road conditions here. Or another visitors center ( Ben Reifel visitors center) is on Hwy 240.",
   "I didn't think I would like this, but loved it.  Lots of cool interactive displays and photos. The video they play in the theatre about the cold war is very interesting.  Did not know that a Russian man saved the world on September  26,1983. We should all be forever grateful to Stanislav Petrov.",
   "My sons loved this stop!  Plenty to see and interact with.  We stopped at the other site as well which allowed us to see the missile but we couldn't participate in the tour because my oldest is very afraid of heights.  We still spent a lot of time here exploring and learning.  It was a wonderful place to visit!",
   "Very cool place I wish I would have had more time as we got here about 15 minutes before closing. Will definitely visit again when we're in this part of the country",
   "Minuteman Missile Visitors Center is an interesting attraction but the Minuteman Missile bunker tour was way cool!  You get to see the conditions and walk through an actual launch center."
  ]
 },
 {
  "name": "St Charles Lounge",
  "address": "207 E Capitol Ave #109, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/094df998-9333-11ea-980f-14b31f159f22.png",
  "tags": [
   "music",
   "drink",
   "history"
  ],
  "link": "https://maps.google.com/?cid=11113245783488570371",
  "source": "GoogleMaps",
  "reviews": [
   "A great place to sit and have a coffee martini on the occasion my girls get together for drinks. Beautiful job. Modern, yet rustic atmosphere. Good music options. Drinks are fun and relevant. I see their specials posted a lot and reminds me of the bar I ran back home in Oregon. This place was FINALLY a fun little bar for the 20-30 somethings in Pierre to go without a bunch of yucky drunks and drama. Dig it.",
   "The large clear ice balls are perfect with a top shelf whiskey. The signature cocktails are a must have. I have a few more to try, but so for the Mai Tai and the Cucumber Collins are my favorite. ",
   "Great atmosphere. Looked like great spirits selection. I enjoyed the beer instead which was also a very good selection! Wish I had found this place sooner.",
   "A great place for a drink. History of town. The bartender pour a good drink.",
   "Super beautiful remodeling. Drinks are specially crafted but worth the wait. Comfortable and accommodating atmosphere in one of Pierre's oldest buildings."
  ]
 },
 {
  "name": "Mount Rushmore National Memorial",
  "address": "13000 SD-244, Keystone, SD 57751, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0995d84a-9333-11ea-aad8-14b31f159f22.png",
  "tags": [
   "family",
   "organized",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15777584755905447489",
  "source": "GoogleMaps",
  "reviews": [
   "Great Bucket List Item to check off the list. Overall it was pretty straight forward, the \"easy\", more family friendly path was under construction however there was still space and opportunity for good pics. I can say that the bathroom facilities left something to be desired, I'll spare the details. It wasn't a cleanliness issue it was more of a structural issue, I mind you I'm 6ft 380lbs so this may be an isolated complaint.",
   "Well my mom & made the trip! She flew from Maryland to Missouri to meet me and we took a road trip. Yes Good ole fashion road trip. And hands down folks it was wonderful!!!!  The towns all around are so quaint and sweet. People are very kind and helpful. If its not on your bucket list... It sure should be!!!!",
   "What a wonderful place.  \nTruly a sight to behold. \nNot at all what I had expected. \nClean, accessible, organized layout with outstanding customer service from all personnel working on site.  \nEach person took the time to greet you and make you feel welcome.  \nI expected a tourist attraction, however I was given a real sense of belonging to the site. The history and the deeper meanings were shared. And the origin story of the creation was really great.",
   "I've been visiting my whole life. I can't believe how much it is built up. This trip was one of the best. Over Christmas Keystone and Mount Rushmore was a ghost town all to ourselves. My daughter first time and she was in awe. Definitely a must see much better if you don't have to fight a crowd.",
   "Incredibly amazing experience. Just to see the memorial in its full glory was astounding! It’s truly breathtaking and I’m truly sad that people don’t understand the hard work and meaning that goes into this. The thought that went into this is truly incredible! Great vacation idea!"
  ]
 },
 {
  "name": "Custer State Park",
  "address": "13400 US, US-16A, Custer, SD 57730, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/09df1ec6-9333-11ea-af94-14b31f159f22.png",
  "tags": [
   "history",
   "hike",
   "free"
  ],
  "link": "https://maps.google.com/?cid=1775359390383569975",
  "source": "GoogleMaps",
  "reviews": [
   "Outstanding! Huge, beautiful state park one of my favorite to camp and spend days exploring the park with nights filled with stars.  Saw many bison.  We rented one of their cabins, no complaints would be ideal if some were pet friendly.  Very easy drive into Deadwood for an afternoon of eating, drinking and checking out the sights.  Looking forward to another visit to spend more time so we can see all of this magnificent park. Good facilities, sites are well proportioned, Rangers very helpful and easy to find.",
   "We truly enjoyed Custer Park. We got there around 10 am and found it hard to see much of the wildlife around that time, so best to probably go earlier as others recommend. We were lucky enough to see some buffalo closer towards her end but overall there were some very nice views. The folks at the visitor center were extremely helpful and truly provided great recommendations. We were aiming to go from Custer park to Crazy Horse and then Mt. Rushmore however were advised to take a different route and it was worth it. We got to see Mt. Rushmore as we were going though a tunnel. Recommend doing a visit.",
   "Not what you would expect for a leisurely afternoon drive.  The park has more to offer than buffalo and open plains. Quaint camping lodging tucked away around one bend. Gentle babbling brooks around the next bend.  Wild donkeys greet you at the next turn. And buffalo are virtually everywhere.  \nDon’t speed through this one. \nTake your time and really take in this place. \nIt’s still a land lost in the late 1800’s and you can feel the history.  \nHighly recommended this visit. \nOn a last high note. The cost for the park was super reasonable for a day trip",
   "Beautiful area. Driving the switchback narrow roads around the Needles formations is worth the price of admission itself. Sylvan lake is amazing and we also did a few trails around the area. All are great but we really enjoy the hike up Little Devil's Tower mountain. Fun trail with lots of raspberry bushes along most of it. Last half mile is exposed with a little bit of non technical rock climbing at the end makes it a fun adventure.",
   "Oh man this place is top notch. Lots of hiking great hiking trail.try the Sunday gluch trail . Great Mountain View. Very busy in summer time. If you are planing on camping there place booked ahead of time. $20 park admission free.."
  ]
 },
 {
  "name": "Snake Creek Recreation Area",
  "address": "35316 SD-44, Platte, SD 57369, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0a2ec598-9333-11ea-8c84-14b31f159f22.png",
  "tags": [
   "parks",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=11235362727653307854",
  "source": "GoogleMaps",
  "reviews": [
   "Very peaceful campground near the Missouri River. East campground has paved parking pass and clean shower house/bathrooms. Hiking trails, boat ramp, beach, and playground close to the camp sites. West campground has gravel pads and some seem steep. Great spot to relax for a few days. Did notice planes flying over often, perhaps from Sioux Falls to Denver?",
   "This is probably one of my favorite sites that i've stayed in so far. We had a site right next to the Missouri river with views to die for. The water was less than 10 feet away. The view was incredible, also, no mosquitos ! For the first time in a long time we could actually enjoy an evening outside without using bug spray. (Been road tripping on the east coast) I would say that this site is definitely more of an RV site than it is for tent/van campers, there's loads of outdoor sports like jet skiing and whatnot that go on around and it seems to be a popular spot for the local residents and families in the area. They had great showers and amenities which made it a nice stay and the campsite was generally really nice. Would recommend it for the views. The only negative aspect was that we were charged a fee to enter the state park on top of the camp fee which was a bit steep, and weren't aware of this fee till after we arrived. Seems to be geared more to people who would go to the park often or the state parks often. Other than that it's a lovely campsite and i enjoyed my stay there.",
   "Loved our stay and will visit frequently.",
   "One of our favorite parks, two camp grounds to camp in. Kept up well, sites and comfort stations always clean. What a view, beautiful tree packed bluffs on the west side of the river. Lots of water, the river is about a mile wide and 65' deep.",
   "Great area ,very well taken care of, beautiful."
  ]
 },
 {
  "name": "Wylie Park",
  "address": "US-281, Aberdeen, SD 57401, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0a82bfcc-9333-11ea-b0fb-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "kids",
   "kids",
   "free",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=15671107374448740449",
  "source": "GoogleMaps",
  "reviews": [
   "Really enjoyed myself during a visit to Aberdeen, SD. There are so many things to do within the park area. Storybook Land is great for the kids and is kept up very well. I believe the upkeep comes from donations so entry into the park is free! Just a short drive within the park area is entertainment such as miniature golf and go karts for a price. Both offered great fun as I was there with other adults. Definitely would return next time if I'm ever in Aberdeen, SD.",
   "There is so much to do here! We go a couple times a year with our kids and they love it.",
   "Hours of fun.  Wasn't to busy while we were there so was very enjoyable as a family especially since the kids did very little standing in line for the go cars!.  The goose poo along the beach made it kind of icky but swimming was free and fun for all ages.  The bikes were fun, the mini golf was neat and well kept and fun for the while family.   Lots to do with the family or as a larger group!",
   "Such a fun park! I've been going there since I was a child, now my children enjoy it. They continue to make improvements and add new exciting rides and attractions! Their campgrounds, although never personally used them, look great!",
   "Fun for family of all ages. Fair pricing on rentals of bikes single and tandem. Fun mini golf and go carts right next to Storybook Land. Nice clean park"
  ]
 },
 {
  "name": "Reptile Gardens",
  "address": "8955 US-16, Rapid City, SD 57702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0ad4c7cc-9333-11ea-b671-14b31f159f22.png",
  "tags": [
   "family",
   "walk",
   "knowledgeable",
   "free",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=13900640683385846252",
  "source": "GoogleMaps",
  "reviews": [
   "We took a family of nine (aged 13 - 75) here on a Tuesday and had a great time. The open aviary and the crocodile and alligator enclosures were the best part of the establishment in my opinion. We also had the good fortune to watch a snake show, and then later a bird show (hawk, eagle, owls)-both were well presented well and interesting. There are A LOT of snakes here!oh yes: there are also some Galapagos tortoises, one is 115 years old. Nice place!",
   "Great place to visit if you are into the slithery sort. It's awesome that they give a military discount and parking is always plentiful. Being able to get a season pass from March to November is great. The handlers are entertaining. Make sure you visit during the summer season so you can catch the gator shows.",
   "They will convert your ticket into a season pass for free! The grounds are an easy walk, plenty of opportunities to sit and relax and enjoy the scenery. The reptiles, birds, exotic plants, arachnids and prairie dogs are plentiful and interesting. Playground equipment for littles and gardens for elders. The staff are knowledgeable and helpful. Wonderful way to spend time.",
   "This place was amazing! Every species there was in such great health, it was just a really great experience! They were all very friendly and made the experience very unique! The bird show was incredible! I won't say anything more than that, because I feel that you should experience it yourself if you have the chance! I will return some day!",
   "Lots of really cool animals to look at. It's has more than just reptiles. The gift shop is really neat too. Defitely recommend."
  ]
 },
 {
  "name": "Bear Country USA",
  "address": "13820 US-16, Rapid City, SD 57702, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0b210614-9333-11ea-96e4-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "walk",
   "kids",
   "family",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=4593412537139876583",
  "source": "GoogleMaps",
  "reviews": [
   "We decided to stop here after visiting Mount Rushmore and didn't know what to expect. I have to say that we were all surprised and just how amazing this place was. We stopped at a gas station and cleaned all the car windows and enjoyed every minute of the drive through Bear Country. The animals get so close to the cars and it's so cool to see them in a more natural environment. There were so many bears to look at, we could've sat in the car all day watching them. Definitely recommend this place!",
   "One of the highlights of visiting WY – dare I say it but it was more impressive and fun than Mount Rushmore!  It is an 11 mile nature preserve that allows you to drive through an assortment of wildlife that will include bears, wolves, mountain goats, etc.  At the end you can leave the car walk through exhibits that more closely resemble a typical zoo.\n\nDefinitely worth visiting!",
   "Me and my family loved it. The kids enjoyed getting to see the animals walk around close to the vehicle. Kind of a bummer that we couldn't see the wolf or the big cats because they were sleeping. All in all a good experience. Also enjoyed the walk at the end where your able to see even more animals. Definitely worth the money.",
   "Preponderance of bears roaming. Quite fun. Mountain lions didn't have enough space. Real reindeer herd was cool. Mountain goats and bighorn sheep wandering freely were nice to see. Arctic wolves didn't appear to have much roaming room.",
   "This is a must see attraction for anyone visiting the Black Hills.  A drive through experience with bears and a dozen or so other species of wild life; a walk around area for some up close views of bear cubs and other smaller animals; and the obligatory gift shop that isn't too ridiculously overpriced.  I grew up in the Black Hills and we go back every year or two to visit family and this is one stop that is still a must every time we go back."
  ]
 },
 {
  "name": "Storybook Land",
  "address": "2300 24th Ave NW, Aberdeen, SD 57401, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0b5f6ecc-9333-11ea-95b0-14b31f159f22.png",
  "tags": [
   "walking",
   "kids",
   "kids",
   "unique",
   "free",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=2593721609269809826",
  "source": "GoogleMaps",
  "reviews": [
   "Cute park with multiple themed playgrounds. Nice walking paths with displays from many classic stories. It has an entire section depicting The Wizard of Oz. There is a very large castle in the center of the park. During peak season there are rides available.",
   "So much fun.. I was there as a kid.. There on my wife's and mine early dates.. And now 5 kids later.. even the 17 yr old loves it as much as the 2 year old",
   "It's a inexpensive good time to take your little people and bring back the wonders of your childhood. I've been bringing my kids there now I bring my grandchildren there. And we all love it.",
   "Hours of fun.  Storybook Land is a unique park with tons of interactive figures from your favorite childhood storybook.  Everything is very well kept and they have even added several new attractions since we were here several years ago.  This park is free except for the rides but even those are not to expensive.   Kids got to see figures like Jack and the Bean stalk, Cinderella, Wizard of Oz, Black Stallion, Old McDonald, Winnie the Pooh, 3 Little Pigs and so many more.  They even have a small wild animal exhibit, bike trails and a small train ride that take you around the park.  The train and the newer roller coaster was a favorite for the kids.  Well worth your time!",
   "So much fun! Hard to believe that SD creates and maintains this park for free! Some attractions require tickets, but 90% of it is completely free and fantastic."
  ]
 },
 {
  "name": "Dacotah Prairie Museum",
  "address": "21 S Main St, Aberdeen, SD 57401, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0bb2e65e-9333-11ea-860b-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "learn",
   "history",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5925808354670240",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic place to bring kids! Exhibits are well-kept and staff are friendly. Just enough to look at to keep kids entertained!",
   "Very friendly staff and fun exhibits!",
   "I just love going back in History at the Museum! Every time I walk through the DPM, I  learn something new! If you're looking for something to do, check out The Dacotah Prairie Museum! You won't be sorry you did!",
   "It's actually three story tall Museum quite a bit to look at neat place to check out things",
   "Great place for kids and families!"
  ]
 },
 {
  "name": "Needles Eye Tunnel",
  "address": "MP 31, SD-87, Custer, SD 57730, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0c1f3cf8-9333-11ea-bd55-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=13218219659711432514",
  "source": "GoogleMaps",
  "reviews": [
   "This was a lot of fun and wish we had do e it the first day in the  Black Hills. $20 pass is good for 7 days and we would have taken advantage of more hiking etc. Rock formations are beautiful and there is plenty of wildlife along the hwy. Other drivers forget other people use the road and cause issues by tunnels, jam on brakes, or swerve across the road without warning so obey the speed signs",
   "The Granite formations here are beautiful. There are Bison roaming the woods and the surrounding Custer State Park is amazing.",
   "Amazing scenery.  Tunnels you hust have to experience.  Loved it.",
   "One of the coolest scenic routes I've been on. Photos don't do it justice. I only wish there was a mirror or something on either side of the tunnel so you could see if vehicles were approaching.",
   "If you can go there, do! The views are breathtaking! My photos don't even touch the full beauty!"
  ]
 },
 {
  "name": "The World's Only Corn Palace",
  "address": "604 N Main St, Mitchell, SD 57301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0c717be8-9333-11ea-baef-14b31f159f22.png",
  "tags": [
   "free",
   "history",
   "walking",
   "family",
   "history",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=15953220490645329174",
  "source": "GoogleMaps",
  "reviews": [
   "A friend of my wife's had told her about the Corn Palace and since we were driving right past Mitchell we decided to stop by. We expected it to be close to the interstate, which it is not, little did we know that it was here long before anyone had imagined an interstate highway system. It is probably a couple of miles from the highway but there are plenty of signs and it is not hard to find. Parking was also easy with free parking lots within easy walking distance - a couple of blocks. Inside it was a little wacky, a little educational, a lot of history and all very interesting. The people working were friendly and helpful. There was an excellent gift shop and really nice restrooms. Absolutely worth the stop...",
   "The corn palace was everything you needed it to be and nothing you expected. Beautiful murals, that change yearly, made of corn all over the exterior of the palace. Easily spotted with the decorative turrets atop the place. Also home to a rather large basketball arena, the place is genuinely surprising. Across the street you will find the gift shop which honestly is just as enjoyable as the palace itself, definitely a pit stop you should make!",
   "It was so neat!!! The best part was that it was PET FRIENDLY!!! What other place gives you a stop on a long journey and allows your four legged family inside?! We really enjoyed stopping by. You don’t need a long time there but it’s definitely neat to see and support local history spots. After all.l, it’s the world’s only corn palace!!!",
   "We go to watch Dakota Wesleyan's basketball teams. Very nice venue. Most of the parents and faculty sit on the east side which has bleachers but there are padded seats on the west side they're often filled as well. Local groups to halftime entertainment. There's a good snack bar & plenty of bathrooms. The only bad thing is that parking can be an issue. You often have to walk a block or two.",
   "A must stop if you are on highway I90 going by Mitchell. Detail of corn on outside of building is amazing. Inside has merchandise you can buy. A few minutes of off the highway but worth the 5 minute drive."
  ]
 },
 {
  "name": "South Dakota Air and Space Museum",
  "address": "2890 Davis Dr, Ellsworth AFB, SD 57706, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0cbdee7a-9333-11ea-8031-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "history",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=9555829134960933487",
  "source": "GoogleMaps",
  "reviews": [
   "Home of the bomber wing this is a must see. \nTake the family for the free tours and take in the aviation history and marvel in the splendid of the old and new aircraft on display. \nSee how the minute men lived and how the name came to pass. Jump into the cockpit of a bomber and feel like you are there at 30,000 ft.  And then slide into the flight simulator and pilot a jet from takeoff to landing ( if you got the “Right Stuff”). \nWe were lucky to be outside when the air wing was coming in for landing.  What a wonderful sight to behold.  \n\nGreat site to visit for all ages.    And wonderful gift shop with amazing take home items.  \nAdd this to your list",
   "A wonderful stop I would recommend to anyone traveling in the area. Real decommissioned aircrafts that will leave you in awe. The inside of the museum is definitely interesting as well, and there is no cost to enter.",
   "It's exciting to see all the different aircraft up close and learn a bit about each of them! The staff is also very friendly and helpful! Definitely visit when you're in the area!",
   "Really enjoyed all the exhibits outdoor and indoor. This is really a must see when we have company. Enjoyed the film they had on the place women pilots played during the war!!",
   "Very interesting things to read about. There was a pilot named Clyde Ice and among many things he was a flight instructor. The interesting part is how he was the flight instructor for other aviators that went on to do something significant in aviation. He is mentioned in a few other bios and in the video that is shared there. Plus they got cool planes."
  ]
 },
 {
  "name": "Wall Drug Store",
  "address": "510 Main St, Wall, SD 57790, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0d111794-9333-11ea-a575-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "free",
   "eat",
   "food",
   "cheap",
   "free",
   "food",
   "family",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=14154884434892420524",
  "source": "GoogleMaps",
  "reviews": [
   "My family thought I was nuts, but I had to do it. I remember Wall Drug billboards as a kid in the late 50s and early 60s - from hundreds of miles away, they'd give \"distance to Wall Drug\". What is it? A tourist trap and one of the greatest marketing campaigns ever.\n\nBut seriously, it's much fun to visit. The homemade donuts are to die for. The restaurant is reasonably priced and the food is very good. After that - shop. It actually is a great place to pick up tourist stuff, gifts, etc. And it's a real piece of Americana.\n\nWe were on the way to Black Hills and heading into Badlands. It was ever so slightly out of our way and worth the stop. Family still thinks I'm nuts, but they had fun",
   "We enjoined seeing all of the signs as we drove across the state. It was a interesting rest stop on our road trip to Yellowstone from Dunbar PA.\nThere was a lot to see here. The food here looked very good but it was so busy and we didn't have the time to wait that long to eat.\nBut we did find several souvenirs to take home and we got our Free Ice Water.....\nWe'll stop again someday when we have more time  and look it over a lot better....",
   "Wall drug is a must stop if you are traveling through  South Dakota in the I90. You cant miss it with all the billboards they have filled through the highway. They still have the free ice water and cheap coffee tradition, the food was considerably good. And the badlands national park is very closely as well.",
   "Honestly not that impressed. If you want to look around in the shops then it’s a good idea. They have some very interesting shops but there are just so many people and their “famous water” is warm and disgusting. I wish I could rate it higher but it just wasn’t interesting for my whole family.",
   "All those billboards on the road make you expect something special. It’s more like an ordinary tourist attraction full of different staff. Its Wild West theme is quite interesting. It’s the only place to eat in the area but it definitely is overestimated."
  ]
 },
 {
  "name": "Falls Park",
  "address": "131 E Falls Park Dr, Sioux Falls, SD 57104, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0d580d26-9333-11ea-b349-14b31f159f22.png",
  "tags": [
   "walk",
   "historic",
   "walking",
   "walk",
   "walk",
   "cheap",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=18060354332619062853",
  "source": "GoogleMaps",
  "reviews": [
   "While a brisk walk on a chilly day would highly recommend parking at the falls and walking the sidewalk and getting out onto the natural stone.  What a nice waterway with an old train track overhead and planes landing a few miles away.  Add the historic old brick mills and sound of the water flow and a nice view of the falls.  Could spend an hour there walking up/down the river walkways.",
   "Was so cold when we went! But, the view of the falls was really pretty and only a short walk from the parking lot. Plus, there was no fee to enter so definitely worth the visit if you're in the area. The Cafe was closed for the season, so can't speak for that. Will try to upload some pics once I get them from my camera, but there are plenty of pics that others posted that pretty much sum it up view wise.",
   "It's a great park to walk through and has lots of places you can sit to enjoy the scenery. During Christmas they set up festive lights, so it's always nice to come see that.\nThe overlook tower is really fun to go up on because you get a really good view of downtown Sioux Falls. \nThe only thing that can be a little off-putting is that the water/falls are very green. It would be really cool if the city could find a solution to purify the water. I realize this wouldn't be an easy or cheap thing to do, but it would definitely brighten up the park!",
   "Nice to visit. Great picnic spot and trails to walk, run and bike. Can smell fishy sometimes and no railings which can make it dangerous if you dont use discretion. Natures beauty and normally pretty popular with locals and tourists so people are around. Neat landmark in Sioux Falls. The light show/history of the falls is a must.",
   "Falls park at around the holidays is truly spectacular.  You can drive around or stop to walk around. All of the lights was amazing and they are enjoyed by young and old alike. Definitely worth a trip."
  ]
 },
 {
  "name": "Mitchell Prehistoric Indian Village",
  "address": "3200 Indian Village Rd, Mitchell, SD 57301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0da717ac-9333-11ea-baf6-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "kids",
   "walk",
   "kids",
   "learn",
   "knowledgeable",
   "active"
  ],
  "link": "https://maps.google.com/?cid=14267176325869161491",
  "source": "GoogleMaps",
  "reviews": [
   "this is a pretty spectacular working archaeological dig that allows folks to come in and actually dig in a climate-controlled environment it's pretty nice it's worth coming to see. the views are beautiful of Lake Mitchell. guides are pretty knowledgeable, they have done a tremendous amount of work and the exhibits for kids are all hands on and that is very cool.",
   "Small site...  lots of parking. Small path to walk on to get there..  not sure if its handicapped accessible, small area for kids to dig for bones and artifacts..  pretty cool though that you could see workers digging and looking for artifacts.. small gift shop..  gift shop was a little pricey",
   "Very cool to see a living archeological site. The grids, what they have found, what will be found, just mesmerizing",
   "Fun experience. Our host was knowledgeable and seemed to really love sharing the story of the original caretakers of this land. We were able to meet and talk to the lead archeologist Dr. Adrian Hannus. My son was start struck! What amazing work they do here! Please consider supporting this site. We can learn so much from researching the past.",
   "Such an interesting place to visit. I had no idea that there is an active archaeological dig site here. Better yet. .....they built a dome over the site to protect it from the elements and to allow visitors to enjoy it."
  ]
 },
 {
  "name": "The Mammoth Site",
  "address": "1800 US-18 BYP, Hot Springs, SD 57747, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0dec5e64-9333-11ea-8307-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "learn",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=9297282922725018703",
  "source": "GoogleMaps",
  "reviews": [
   "This place is awesome. My youngest daughter told her grandparents about it, almost exactly verbatim from what the tour guide said. She decided she was going to be a \"digger\" right then and there. \nIts worth the drive to Hot Springs...do NOT miss this.",
   "Stopped in Hot Springs to see the Mammoth Site and glad we did.  The site was extremely interesting and well done. The tour was certainly helpful in understanding what we were looking at. We managed to keep busy in Hot Springs for a couple of days, no problem.",
   "Out of the way gem for a budding archeologist. Great guides, very large gift shop with something for everyone. The site was indoors so a nice day trip for a rainy day.  The actual site was super\nInteresting and moderately interactive for all age groups.",
   "This place is so cool! If you haven't seen so many bones in one place it's worth to visit it. I liked it!",
   "This place is one of a kind. It is a huge Mammoth Dig site under a roof and surrounded by a museum and gift shop and research facilities. There is something for every age group to do and learn. Definitely take the tour to get the most out of the trip."
  ]
 },
 {
  "name": "Splash Central Waterpark",
  "address": "345 9th St SW, Huron, SD 57350, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0e36d538-9333-11ea-9c4a-14b31f159f22.png",
  "tags": [
   "cheap",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=8886374857633367160",
  "source": "GoogleMaps",
  "reviews": [
   "Enjoy the summer by cooling off at Splash Central. My boys go every day for hours, lots to do and fun to be had. Go down the Master Blaster or the body slide. Relax in the Lazy River. Let the little ones play in the Kiddie Pool. Or race each other on the Whipit!",
   "This is a smaller version of Wild Water West, minus the wave pool (and adult drinks, but this is their city pool so I get it). The admittance fee is low, they even have a reduced price for non swimmers. The concession cost are not terrible or even really considered over priced in my book (not like going to a movie- cheap to get in, a life savings to snack). The slides are great, love the lazy river, and the kids all love the variety of things to play on.",
   "Love the lazy river really friendly staff very attentive to need if their guests!! The lazy river is very enjoyable, the water slides are a great time, the Olympic sized pool with an inflatable for the kids to burn all that summer energy on! They have like little cabanas to multiple purposes. I recommend this place for price and passes.",
   "It's an awesome water park for a fair price. No where near as expensive as Wild Water West outside of Sioux Falls, but still plenty of fun activities to do there.",
   "Best water park that we have been to in South Dakota. Slides r fun, lazy river perfect on a really hot day. Will b back for just the waterpark🌊🏊⛲"
  ]
 },
 {
  "name": "Bob's Lounge",
  "address": "114 W Dakota Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0e7c1b92-9333-11ea-8000-14b31f159f22.png",
  "tags": [
   "music",
   "drink",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=6621392166370948376",
  "source": "GoogleMaps",
  "reviews": [
   "My waitress way cool and friendly. \nIce cold beer. Great atmosphere",
   "Small but cozy bar. Shandies on tap. Favorite side bar of many people. Music and popcorn are always ready.",
   "Service was fine. Drink was okay. Place could have been cleaner.",
   "Love this little dive, feels like home..",
   "Great place for a drink after hunting."
  ]
 },
 {
  "name": "Wind Cave National Park",
  "address": "South Dakota, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0ebc0b00-9333-11ea-bb18-14b31f159f22.png",
  "tags": [
   "tour",
   "hike",
   "tour",
   "history",
   "tour",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4174081005379495295",
  "source": "GoogleMaps",
  "reviews": [
   "Great tour! Gets very cold on tour...bring a jacket. Worth the wait. Hard to get good pictures due to low light and no flash.",
   "as I read other reviews, I see negativity about the cave elevators being down.  not 1 review mentioned the phenomenal opportunity about getting out of the vehicle and going for a hike.  I am a regular here and have had numerous wildlife experiences that were beyond description. If you have the ability to go for a hike. you will likely be rewarded big time.",
   "Elevator broke back in July 2019 and the park superintendent estimated a month for repairs. It's now February 2020 (8 months) and there's no update. For a park whose sole attraction is a cave, it's absurd to not be able to enter the cave.",
   "We still enjoyed learning about the area and it's history.  At times it seemed too close even though we were in our van or at a safe distance. Inside the cave is quite interesting if you have never been in a cave before, but even regular cave dwellers will probably find this cave intriguing. But the elevator still isn't working; it's a bummer not to be able to enter the cave. The elevator was not working when we were there, so there were no cave tours at all. I don't know what I was expecting when we were offered a tour of the largest natural opening, but I was a bit surprised.",
   "Looking for a Colorado Springs adventure. Was afraid this was going to be lame after checking out the website, could not have been more wrong. This place has beyond amazing mountain views, especially of Pike's Peak. The building is very clean, and well updated. The Discovery tour was $23 for adults, $17 for kids older than 6, and well worth it. Learned a lot, and enjoyed the cave. Gift shop is really good, hard not to spend a lot of $ here. I wanted to do the Terror-Dactyl ride, but it was $50 and they didn't allow any glasses/sunglasses, and I didn't have my contacts in. I will come back next time I am in CO Springs. Awesome place! Great for kids and adults alike."
  ]
 },
 {
  "name": "Ingalls Homestead",
  "address": "20812 Homestead Rd, De Smet, SD 57231, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0f07451e-9333-11ea-9442-14b31f159f22.png",
  "tags": [
   "family",
   "historic",
   "history",
   "kids",
   "historic",
   "knowledgeable",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6077088271129178888",
  "source": "GoogleMaps",
  "reviews": [
   "Our family had an incredible time here! The historic interpreters were so engaging with my daughters, there were more things to see than we had time for, and everything we saw had such a sweet balance of the story of the books and the real life history of the time and place. I really hope we get to visit again!",
   "Very fun place to visit. They have a great setup with many hands-on things to do. We spent over 4 hours here but it only felt like 1 because the kids had so much fun. All of the staff were really friendly.",
   "I was surprised at how much I remembered from the books as we toured the place.  The historic actors with the information were wonderful. The place is well maintained and a long over due visit.",
   "Such a beautiful place!! For the best experience, we suggest to plan ahead to stay on the prairie in a real wagon or the bunkhouse. Our kids loved it!! Even our teenagers found FUN on the farm! The workers were so kind and helpful and really engaging and knowledgeable. The shower houses weren’t far away and they were clean and water was warm. Family ran and they were super sweet!! Highly recommend!! ❤️❤️",
   "One of our top favorite places in all of SD. Every trip is a different experience. We always spend all day and our 6 year old never gets bored. The owners are so personable. You'll want to come back every year."
  ]
 },
 {
  "name": "Rushmore Cave",
  "address": "13622 SD-40, Keystone, SD 57751, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0f4f4ac8-9333-11ea-a504-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "unique",
   "family",
   "kids",
   "knowledgeable",
   "tour",
   "knowledgeable",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=18019415255794502885",
  "source": "GoogleMaps",
  "reviews": [
   "We had a wonderful tour of this beautiful cave today. The young lady ( I can't remember her name) was so friendly and knowledgeable. My husband and I were the only ones in the tour so it felt very personable. I would definitely recommend the cave tour. Many parts were absolutely stunning and you are able to get amazing pictures.",
   "This caves are awesome, great place to enjoy with family, lot of stairs but if u don't have knee problems or very little kid you are fine. Love this place. Very unique",
   "We had a great visit to the cave today with Joe as our guide. He was super professional and very informative. He even chatted with our kids as we walked through the cave, which was welcomed for my wife and I, so we could focus on our younger son navigating all the steps without touching the cave walls. We were very impressed and found it to be well worth the money spent. Our kids were so excited after they left the cave, and they said they had made a new friend.",
   "Our tour guide Kevin did an amazing job, it was a blast for young and old alike! He had an excellent sense of humor and was very knowledgeable about the cave. Pricing was acceptable, but we opted not to go on any rides due to time limitations.",
   "The lady friend and I both did the 1 hour cave tour with Kevin and loved it. He was very entertaining and knowledgeable. \n\nThe lady friend did the rollercoaster and had a blast on it. \n\nWould definitely come back here again."
  ]
 },
 {
  "name": "Devils Tower National Monument",
  "address": "WY-110, Devils Tower, WY 82714, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0f9a5da2-9333-11ea-8712-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "walk",
   "walking",
   "hike",
   "pets",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=12188039200068454266",
  "source": "GoogleMaps",
  "reviews": [
   "This was one of our most favorite stops on our road trip vacation. It was awesome seeing the tower in the distance as you drive towards it.\nAnd as you get there it was way better in person than any picture we've ever seen of it.\nI highly recommend taking the time and walk around the entire perimeter on the tower. Al of the different views are worth the walk.\nThis will definitely be on our list to return to someday...",
   "I don't feel this place can be accurately described in words. Much like the grand canyon, you have to see this with your own eyes to truly appreciate what an amazing monument it is. I visited as a teenager and years later brought my family to visit. Hopefully I'll get to visit again one day.\nWe hiked around it, took a bunch of pictures, watched the wildlife around and just enjoyed the spectacular view of this towering mass of rock and the beautiful surrounding country.",
   "This was a beautiful stop on a road trip I took in the summer. The walk around the monument was fun and there are lots of places to take photos. The washrooms at the park were clean and maintained. Definitely would stop again in the future. Using the tower viewers to try and find the old wooden stairs was incredibly fun as well.",
   "Can't describe how awesome this National Monument is! Have to see it in person to fully understand how this formed. Beautiful park with easy walking trail around monument. Visitors center describes how this formed (or what they all agree upon). Worth the drive!",
   "Really great national park. We did the long loop and it was just gorgeous! The views were awesome. The only downside was we weren’t allowed to take our golden retriever puppies on the hike. Unfortunately, because people don’t clean up after their little furry friends, most national parks don’t allow pets. But still take the time to visit this national park. It will be worth your time."
  ]
 },
 {
  "name": "Crazy Horse Memorial",
  "address": "12151 Ave of the Chiefs, Crazy Horse, SD 57730, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0febb222-9333-11ea-b56e-14b31f159f22.png",
  "tags": [
   "unique",
   "family",
   "theatre",
   "history",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=550170492528074951",
  "source": "GoogleMaps",
  "reviews": [
   "Surprisingly Good Experience, \nWell Worth the $30/car!\nDon’t assume it is fogged in when Mt Rushmore is. \nFamily visited 3/15/2020 with full sun.  \n\nIntro video was worthwhile background;\nRestaurant had surprisingly good and unique entrees. Gift shop was full of quality stuff, \nOptional van ride $4/person was well worth it.  Very pleasant staff.\nMuseum area is one stop viewing of all things Native American.\nScale plaster model outside is good reference and to take pictures in front of.",
   "Very interesting finally seeing it for the first time in real life. I've seen many pictures and videos over the years. But being there is a completely different experience.\nI hope I'm still around to see it completed someday. \nIt's worth the trip to go and see...",
   "Very informative, recommend to check out the the documentary in the theatre in the visitors center. The carving itself is not complete yet but they are making progress. The progress is very slow and we understand why it is that after watching the documentary. Good lesson on American history. Its worth going here of you are going to Mt Rushmore",
   "This was a really eye opening experience. Crazy horse memorial has a really inspiring story behind it. You have to watch the film inside the museum in order to understand everything behind crazy horse. Also be sure to take a ride in the bus that takes you to the base of the mountain. It was a pleasant experience. I would recommend this to anyone.",
   "If you can go there. Please do. They are privately funded by donations. No help from the government at all. A family legacy in the making. An amazing place to be with family. The lazer light show is beautiful. It is more of a museum so not so much hands on for kids. But the performances are amazing and kids will love it. Staff are loving and visit with guests a lot. One of the best places to go."
  ]
 },
 {
  "name": "Cosmos Mystery Area",
  "address": "24040 Cosmos Rd, Rapid City, SD 57702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/103cb9ba-9333-11ea-a585-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "tour",
   "tour",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1927795350353646475",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome sauce. Everyone in the family from 8 to 38 had a great time. Price is just right. Time is just right. So it is a must.",
   "Was super fun. We went on a pretty busy day I think, because the groups were rather big. It was kind of hard for all of us to fit in the small rooms. Overall pleasantly satisfied with out stop out.",
   "This was such a cool, crazy place!  Our guide had several demonstrations to show how weird this place really is.  Great audience interaction and the kids were just thrilled to participate in the demonstrations.  Lots of fun and laughs to be had...try it out!",
   "This place was fun!! The tour guide was adorable, she really tried so hard to get everyone to interact. I've always wanted to see one of these \"vortex\" houses, and it was very cool!",
   "Great place to bring the kids! A word of warning for adults; the experience left me feeling a little queasy! The tour is totally worth it, and my kids enjoyed cracking open their own geodes afterwards! A great way to spend an hour or so!"
  ]
 },
 {
  "name": "Chapel In the Hills",
  "address": "3788 Chapel Ln, Rapid City, SD 57702, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/10936540-9333-11ea-a812-14b31f159f22.png",
  "tags": [
   "walk",
   "tour",
   "free"
  ],
  "link": "https://maps.google.com/?cid=17003441578488293048",
  "source": "GoogleMaps",
  "reviews": [
   "This is a beautiful chapel. I visited it in the winter when it was closed to visitors, but I was able to walk the grounds and tour the outside. All if the carvings on the outside were stunning to look at. I can't wait to come back in the spring when it is open to the public.",
   "It was a dream come true for me!! It was the 50 anniversary - my grandmother came Norway I had heard stories and seen pictures of chapels in Norway.  It is something I will carry with me forever.  If you have Norwegian heredity it is a must place you must see.  The beauty the reverence of what truly God is.",
   "The Chapel in the Hills is absolutely beautiful! I've loved it since the first time I visited, and I've dreamed of having my wedding at the Chapel. However, I was extremely disappointed to find out that just recently in late 2019, the Chapel changed their policy so couples MUST use their Lutheran pastors to officiate weddings at the chapel. While I understand that they have the freedom to hold this rule, it's very disappointing, especially since this is a newly implemented policy. I'll continue to visit and admire the Chapel in the Hills, but am very disappointed in this recent change of policy.",
   "The architecture is breathtaking.   It was the day of their closing , we were at a wedding it was so cold inside the chapel, no heat.  I will go back in Spring or summer.  I didn't get to the gift shop so must go back.",
   "Some of the most amazing wood work you will see. The property is just as beautiful. Free, but be sure to try to take a small donation to help maintain. You won't regret it"
  ]
 },
 {
  "name": "1880 Train",
  "address": "222 Railroad Ave, Hill City, SD 57745, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1123c5dc-9333-11ea-9876-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "learn",
   "kids",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=437733760448101827",
  "source": "GoogleMaps",
  "reviews": [
   "This is a fun adventure for the family. I have dinner the summer train ride to Keystone and the winter Santa ride. I would just recommend if you are traveling with small children to just do the one way ride and not the full round trip option, but it is awesome to be on this old-school train and enjoy the beautiful views with the family.",
   "This is such a fun place me and the kids went and after we was done\"bringing\" Santa back from the north Pole my 5 year old yes can we go again! The cookies and hot chocolate served on the train was great!  This is a must!",
   "We want to the Black Hills to do a bunch of hiking.   The 1880 train was a very fun break from all of that.   The ride was relaxing and fun for all ages.   If you are a train buff, this is a no-brainer.",
   "I’m glad that the 1880’s train has kept steam alive, it’s what built this country!  I took my family on the train, and my kids loved it, and so did I!  The prices aren’t as bad as some have said, it’s 2019 and this type of equipment is expensive to fix, I’m a pipefitter By trade, so I would know.  The ride was great, scenery was good and narration was also nice to learn the history about the area.  I will continue to visit and highly recommend the 1880’s train to anyone I know!",
   "Such a happy experience, especially with children! The train is nostalgic and homey, tastefully decorated and plenty warm. The staff is top notch, from the elves to the conductor to Santa Claus. I highly, highly recommend making this a holiday tradition."
  ]
 },
 {
  "name": "The Journey Museum and Learning Center",
  "address": "222 New York St, Rapid City, SD 57701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/119dff12-9333-11ea-9343-14b31f159f22.png",
  "tags": [
   "kids",
   "history",
   "learn",
   "kids",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12200121449434304802",
  "source": "GoogleMaps",
  "reviews": [
   "The museum is ambitious and strives to keep the good balance among science, history, and culture. The downside is that it’s a bit costly for its small size. In other words, the place could have more displays to make the visit longer and worthwhile, or reduce the price a bit, especially for adults who take the kids there.",
   "Lived in south Dakota my whole life and never know it existed. What a nice hidden treasure we found. Purchased an annual pass as it makes for a fun day of learning and activities with my son. So many things to do and such a great way to learn about many different topics.",
   "We spent a day going to museums in Rapid City.. This place was outstanding!!! It takes a person from the dinosaur age to modern time. Plan to spend a couple hours or more, if you want to see everything and read all of the descriptive material at each exhibit.. It was a great time... And educational..👍",
   "A lot of educational stuff for adults if you want to know the history of South Dakota, and enough stuff to keep kids busy if you have them along too. We really liked reading about all the different types of rocks and the exhibit that displayed all the different beautiful gems was really cool. The gift shop had plenty of South Dakota related things in it but so does every other place in the area.",
   "My daughter loved the wide range of history about the local area.  The exhibits are really well done and engaging.  The staff was super helpful."
  ]
 },
 {
  "name": "Sturgis Motorcycle Museum & Hall of Fame",
  "address": "999 Main St, Sturgis, SD 57785, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/121bc378-9333-11ea-bf06-14b31f159f22.png",
  "tags": [
   "history",
   "unique",
   "art",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=16430943818856880281",
  "source": "GoogleMaps",
  "reviews": [
   "This is a place that you have to go to if you're  in Sturgis. There are many bike in the museum,  I was just a little disappointed considering this is the hot bed of the motorcycle world.\n\nShould you go to the museum? Yea go anyway  it part of tourist  trap and does has some interesting exhibits",
   "Visited here on 02/20/2020 and not only was it fun and informative the lady working there was very friendly .  much appreciated a good experience on a long move between Denver and ND.",
   "Enjoyed the history. Clerk was very nice and helpful",
   "Wow. There are motorcycles from the 1920's here, and they are beautiful! The artwork throughout the entire building is gorgeous and unique, but I won't forget those motorcycles. Definitely a place to check out if in the area, interested in motorcycles and history, or just interested in art.",
   "A must stop when in Sturgis to support the local motorcycle museum which had a bunch of lovely bikes in there and a lot of motorcycle history anybody who rides should definitely stop."
  ]
 },
 {
  "name": "Museum of Geology",
  "address": "501 E St Joseph St, Rapid City, SD 57701, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/127c3346-9333-11ea-96c3-14b31f159f22.png",
  "tags": [
   "free",
   "academic",
   "free",
   "organized",
   "kids",
   "organized",
   "kids",
   "free",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=8869204134061206717",
  "source": "GoogleMaps",
  "reviews": [
   "Best part aside from its incredible breath and quality: it’s free to visit! They have fossils large and small, local and international, spanning across several eons of time. There is also an incredible display of minerals, meteorites, and fluorescent minerals. The gift shop is reasonably prices too. My pictures are just a SMALL FRACTION of what’s there and don’t include any of the large fossils or meteorites. I arrived too late in the day this particular visit to take as many photos as I wanted; it’s easy to spend several hours there (and I have!).",
   "This museum is awesome! It takes up the 3rd floor of an academic building but is well-labeled with visitor parking out front. The exhibits are very well labeled and organized, with one area containing rocks/minerals and the other area containing fossils. I appreciated the old-school feel of the museum, with the displays being more informative than flashy. They have a great variety of fossils, with some common and some rare (but all exciting). The best part, the museum is free (but appreciates donations). Well worth the stop, looking forward to visiting again someday!",
   "I loved my visit here! I really like how they have the minerals organized. There's even an area to keep younger kids occupied. Lots of great fossils too, but personally I am more of a rock-hound. The fluorescent display is really cool.",
   "This is a great, free place to go for a little education!  There weren't many interactive things for kids to do throughout the museum except for a few things in the kids area, but the front desk has a scavenger hunt for kids that takes them all over the museum.  The labeling on each case could be a little better to make the scavenger hunt flow a bit better, but the kids get to pick a rock at the end which was super fun!!  A great place for homeschoolers too!!",
   "Lots of great exhibits that you can experience up close. Plus it's FREE! The kids loved seeing a variety of fossils and minerals. Check for parking right in front of the building after the busy hours"
  ]
 },
 {
  "name": "Dinosaur Park",
  "address": "940 Skyline Dr, Rapid City, SD 57701, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/12e4f5be-9333-11ea-8a82-14b31f159f22.png",
  "tags": [
   "free",
   "kids",
   "free",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10989964826263443906",
  "source": "GoogleMaps",
  "reviews": [
   "Such a cool spot! My seven year old loved climbing on and around all the dinosaurs. It's totally free to go, and the store had some really great stuff that we haven't found anywhere else.\n\nIt was such a hit that we ended up going twice, first at the start of our trip and then again almost a week later when we were leaving.\n\nIf you're in the area and have a dinosaur fan, it's really worth the trip. The dinos are around 90 years old if memory serves and some could use a little more paint, but it doesn't detract from the experience.",
   "One of my favorite places. Beautiful views, fun for kids to see the dinosaurs that are larger than them. Also historical aspect is great :) I have a photo of my grandparents here, my mom, me, and my children here all during different times.",
   "Great place for families and its free! The views of rapid are the best in the whole city.",
   "We lived in Rapid City over 20 yrs ago and it was fun to see this attraction again after all these years!  They have made some very nice improvements and a visitor center that was closed at the time we visited.",
   "This is a simple park with old dinosaur statues that was created, I believe during great depression. There are a lot of stairs. It gives kids an area to burn out some energy. There's a great view of Rapid City at the top.  My kids enjoy visiting just like I did as a kid."
  ]
 },
 {
  "name": "The Outdoor Campus - West",
  "address": "Adventure Trail, Rapid City, SD 57702, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1348bf80-9333-11ea-a372-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "learn",
   "learn",
   "nature",
   "family",
   "free",
   "kids",
   "free",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10307036059488812586",
  "source": "GoogleMaps",
  "reviews": [
   "This place is amazing! We came on free try canoeing and kayaking day! Great friendly very helpful staff! My older 2 kids (9&11) took a canoe together and had a heck of a time figuring it out, but one of the instructors came out in the water to their aide to teach them right away and had nothing but joy in helping them! I can't say enough good about this place and it's staff! Thank you for the experience & the fun!",
   "Great place to learn about wildlife and the outdoors. Awesome classes that you can sign up for to learn about the basics of outdoor recreation.",
   "It has something for everyone. Both inside and along it's nature trails. With diarama's of wildlife and a aquarium of many different fish. It has many occupations for the young and mature mind. A pond to learn to kayak and fish a archery range. Hunters safety courses, and many groups meeting to promote photography, wildlife and water conservation, and disabled veterans fly fishing. There is something for everyone. Contact the Campus for classes and activities hosted daily and through out the year.",
   "Wonderful place to bring the family.  They offer many classes and the campus is beautiful.  Their mud day is super fun! Definitely worth a visit and most things are free of charge!",
   "I always enjoy coming to Outdoor Campus. It is free and embraces learning through exploration.  When my kids were little we came to some classes and family nights. Now we come when we have company to give an overview of Black Hills wildlife and land."
  ]
 },
 {
  "name": "RedRossa Italian Grille",
  "address": "808 W Sioux Ave Ste 200, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/13a7f6be-9333-11ea-b29d-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7402304460014553868",
  "source": "GoogleMaps",
  "reviews": [
   "I was in town for work and asked a couple locals where to eat, this was recommended as one of their favorites! \n\nUpon arrival I was seated prompt and courteously, the place has a great ambiance and is pretty classy. \n\nFor food they were on the last day of their “Taste of New Orleans” menu, so I decided to take advantage of it and ordered the “French Quarters Jambalaya” and their “Chop Chop” salad from their main menu. \n\nBoth were very delicious!  The Jambalaya was generously filled with shrimp, crawfish and andouille sausage! The salad had a perfect pairing of mixed greens, smoked mozzarella, banana peppers, Italian salami, then topped with a red wine vinaigrette! \n\nPricing was fair,  some may say it seems high for a small town restaurant.",
   "Everything is clean and the servers are friendly. \nWas not impressed with the food, though. It's  great if you like frozen microwave food or out of a can food. I had the lasagna and it was cold in the middle and really had no flavor, fake cheese? 1 star.",
   "The server was great she was delightful my wife and I were very happy to have such an engaged employee.  The food was excellent and delivered to our table quickly.  We will be back.",
   "Great food. Love the desserts. Good customer service. Very friendly staff.",
   "We had reservations on Valentine’s Day. When we got there the lobby was full of people waiting and we were told we would have to wait at least 20 minutes, even with our reservation. The hostess was quite short with us and was openly blaming the kitchen for being behind. When we did finally get seated and waited on, our waitress was great and the food was delicious. I’m not sure I’ll plan to go here for another holiday, though."
  ]
 },
 {
  "name": "La Minestra",
  "address": "106 E Dakota Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/14102f12-9333-11ea-bf65-14b31f159f22.png",
  "tags": [
   "family",
   "drink",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10159058445281143488",
  "source": "GoogleMaps",
  "reviews": [
   "I went for dinner with a friend. I had been for lunch and dinner was just as good. From the house salad to egg plant parmagan it was excellent. Servive was amazing. A friendly family restaurant with an open kitchen. The table with next to us had a great pizza. A place to go back to and try different menu items.",
   "Went to La Minestra for the first time today... Greeted at the entrance with a friendly hello.. We arrived when they first opened for lunch.  Nicely furnished and decorated, including the floors.  The staff was super friendly and ready to go into detailed description of the menu items. The menu is small, but adequate.  We ordered two of the lunch specials.  I ordered the chicken tortellini/ sun-dried tomatoes/ spinach with a cream sauce and a 1/2 Ceasars salad... My husband ordered the clam chowder soup with a turkey wrap.. Both meals were great... He loved the clam chowder.  We both sampled all of the food.  My only negatives were.. The sauce on the tortellini was some what runny. Also, the romaine lettuce was not in small enough pieces.. Its hard to cut it yourself without having it all over the table and you. The clam chowder was thick, the the sauce on the tortellini should of been too... The tortellini tasted very good though.  We would definitely go back.. Expect to pay about $15 or more with a drink and tip.   Upbeat place with good food and a happy staff!",
   "I like this place because it has a flavor distinct from the rest of the food in Pierre. I've only eaten their lunch specials, which change daily.\n\nTheir newer happy hour menu is great. Nice selection and reasonably priced. I appreciate the smaller portions and $2 price tag, so I can order a variety.\n\nWait staff is consistently on point, friendly, quick, and apologetic if something doesn't go right. ",
   "Service and food were perfect tonight. Could go a little lighter on the rosemary on the truffle fries, but everything else was perfect. The mussles over linguine needs to be on the menu!! So good!!!",
   "Neat little place, you wont find spaghetti here but lots of other great entrees.   Staff is friendly and prompt.  Prices are reasonable."
  ]
 },
 {
  "name": "Mad Mary's Steakhouse & Saloon",
  "address": "110 E Dakota Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/146d9148-9333-11ea-b053-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "eat",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7700978395339021836",
  "source": "GoogleMaps",
  "reviews": [
   "The cost is on the high side but the food is very good and the service was amazing!",
   "When we walked in we were greeted very friendly very clean place good food nice atmosphere I would recommend for anybody to go eat there",
   "We were there on a Tuesday evening and the place was very busy.  Even so. We were waited on pretty quickly.  Ordered small sirloin and garlic mashed potatoes.  Food was delivered quickly and was very good. Would eat here again.",
   "Good steak, great service and with cowboys on tv, you feel like you're right in the wild west. Drinks are pretty stiff (which is good!)",
   "Food is amazing, service is great, the wait is not that long, its cozy and great for groups. It's just a really good place to eat."
  ]
 },
 {
  "name": "Guadalajara Mexican Restaurant",
  "address": "314 W Sioux Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/14c06c6e-9333-11ea-ae88-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "music",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=6523495123156968885",
  "source": "GoogleMaps",
  "reviews": [
   "AWESOME FOOD!! Very reasonable price for the amount of food serviced... The restaurant was very busy but we did not have to wait long for our order...  So GREAT FOOD, AWESOME SERVICE I LOOK FORWARD TO DINING THERE AGAIN",
   "Nice restaurant with a lot of seats inside.\nWhen we were there, there wasn’t any music playin-it made the atmosphere sad. \nFood was tasty but nothing outstanding.",
   "Don't bother.\nThe salsa has no tomato chunks. It is cilantro and onion soup with a watery tomato base.\n\nThe pollo fundido is bland (but pretty moist) chicken wrapped in a tortilla (either fried or not) and then they have the audacity to slap a slice of processed american cheese on top of each one. Even after I smothered it in sour creme I couldn't suffer through it.\n\nThe chili verde is a green onion and tough cubes of pork smothered in....something. even the rice here needs hot sauce to have flavor.\n\nOh and they have nothing on draft.",
   "Was recommended tonus, and worth it! Chips n salsa when u sit down..great margaritas and lots of food!",
   "Great dining experience.  Terrific variety on the menu. Reasonable prices and large portions. My family all agreed it was the best meal we have had in awhile."
  ]
 },
 {
  "name": "Richie Z's Brickhouse BBQ & Grill",
  "address": "401 S Central Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/15173f36-9333-11ea-85e6-14b31f159f22.png",
  "tags": [
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=897848122266636139",
  "source": "GoogleMaps",
  "reviews": [
   "Just ate there for first time. Special was smoked meatloaf with mashed potatoes and gravy and corn with a bun. Holy smokes it was so good!  Big portions and great service.  5 stars",
   "Richie Z's is a great addition to Pierre! They have an extensive menu with something for everyone. The atmosphere is also really great. They really did well renovating the space. I would highly recommend!",
   "Had a great lunch with the family! Sandwiches were all great, fries were crispy, and sauce was good too! Would recommend to friends and family.",
   "Just went there tonight and had the worst service ever!! They ran out of the  Prime Rib that we wanted so had to reorder, but I didn’t get what I ordered after 2 hours of waiting!!  Then our waitress was carrying her baby around while serving our food!! Really!!!  Not sure who owns or runs this place but WOW!! Can’t believe that your service can be so bad!",
   "Top notch bbq. Richie is a great pitmaster and if you're anywhere near Pierre, South Dakota you must stop in to the Brickhouse."
  ]
 },
 {
  "name": "Wonderful House",
  "address": "317 S Pierre St, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1578c06c-9333-11ea-b2a0-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4446114394569887894",
  "source": "GoogleMaps",
  "reviews": [
   "The owners were from Fujian, where it’s known for great cooking and cuisine. I'd say this is the tastiest and fairly authentic Chinese American restaurant in town. If you like Chinese food, don't miss this one.",
   "Our family of five tried a few different items and they were all pretty good. We tried the wontons, salt and pepper shrimp, honey chicken, and the spicy sesame chicken. All of them were a little above average on the Chinese quality scale. The staff was very helpful and kind. The price of all of them items were slightly higher than they should be.",
   "THE FOOD IS SO GOOD and they are so kind 😊 take out is WONDERFUL here",
   "It is self serve/carryout..\nAt noon they have a buffet.\nEssentially there is no table service.\n\nOur meals were deep fat fried...sweet/sour chicken or pork. Meals were tasty with generous portions.\n\nPrior to the remodel, table service was provided and the atmosphere reflected oriental features.\n\nAtmosphere is more like a fast food place.\n\nPrices were reasonable.",
   "I absolutely love eating at Wonderful House! The food is always fresh and hot and the service is excellent. They really make you feel like family!"
  ]
 },
 {
  "name": "Pure Bliss Cupcake Co",
  "address": "107 E Capitol Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/15d64a00-9333-11ea-ae7f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7520900335770581220",
  "source": "GoogleMaps",
  "reviews": [
   "Reasonable prices, delicious food, and excellent service. You'll never leave here unhappy, constantly great.",
   "Cute and cozy. Great cupcakes. Lovely atmosphere. Awesome interior design.",
   "We went there for a short break in the afternoon, it was nice and quick. Great coffee, and wonderful cupcake.",
   "The most delicious cupcakes I have ever had in my life. The lady was so kind and answered all my questions. The sweets are beautiful and taste wonderful. Great place to order all your sweet tooth treats. Love it.",
   "What a cute little place! They have baked goods made fresh every day, like cinnamon rolls, caramel rolls, and a few flavors of cupcakes that change often. On weekdays there are two featured lunch specials of home-made deliciousness, ranging from soups to sandwiches to meatloaf to hot beef with mashed potatoes. The specials change every day and often depend on what's in season. On Saturdays there is a featured brunch item, like lemon poppyseed pancakes, breakfast burritos, waffles topped with fresh peaches, and so much more. It's always fresh and amazing! Specials change daily, so stop in or check their Facebook page to see what they have. I have loved it every time!"
  ]
 },
 {
  "name": "Gators Pizza",
  "address": "1615 N Harrison Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1635f682-9333-11ea-be89-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10782106900543541349",
  "source": "GoogleMaps",
  "reviews": [
   "Gators Pizza is located inside the center of the mall in Pierre.  They have a large variety of food to choose from and are full of flavor.  Even during peak times of service; food output was incredibly fast without sacrifice of quality.  To see the owner interacting with customers is a pleasant twist to see in this day and age; I wish I saw this more often in other restaurants.  The area is filled with a good positive and energetic energy and I can see that the employees enjoy what they do here.  Location is very clean and table clean up during peak times is also fast.  They have SD video lottery in the back and they also sell beer here.  Prices are pretty fair for the quality of the food you get; for a large 3 topping pizza, 2 monsters, and breadsticks cost around $30.  If you are in Pierre and want some good pizza, salads, and soups; check this place out.",
   "The food is always good. I do find it to be over priced for its value. I do like the variety of menu options.",
   "Allowing 36 people in your restaurant is irresponsible!! Pierre ordinance says you can only have 10z  It last on surfaces for 10 days and what about your bathrooms. I don’t belive those CDC guidelines. You will spread it all around Pierrre.",
   "Nice atmosphere..good soup",
   "My brother-in-law is a diabetic so he has to have the thin crust and my sister and brother line myself had pizza on Sunday night it was not greasy not a lot of sauce just perfect thanks Pizza Hut"
  ]
 },
 {
  "name": "Tokyo Japanese Restaurant",
  "address": "1615 N Harrison Ave #27, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/168416cc-9333-11ea-8de6-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "food",
   "free",
   "eat",
   "food",
   "walking",
   "delicious",
   "free"
  ],
  "link": "https://maps.google.com/?cid=711072229315935487",
  "source": "GoogleMaps",
  "reviews": [
   "Went with an experienced friend, my 1st time to eat there.\nFood was better than I had prepared for!\nCindy and her staff are very friendly and helpful.",
   "The staff are polite and very helpful and the food is always delicious.  We never wait long. It is a breath of fresh air here in the middle of the continental US of A to have this delicacy.",
   "It was definitely awesome! We lived it and it's our new favorite place 😁",
   "Roughly only took a half hour from the point of walking in the door to being done with my meal. Probably one of the better places in Pierre to eat in my opinion. Honestly it was a little bit of a struggle finding gluten free options at first, since their isn’t a separate menu you have to ask or be knowledge about the rolls and how they are different here. But the staff work with you and now that they’ve all dealt with it they navigate your options easier now. But the food is taste, the service is super strong as everyone will check in with you and how your meal is going, and the options are varied. I suggest the steak hibachi if you aren’t a sushi person.",
   "I came here on opening day fully expecting it to be a disaster. Much to my surprise, everything was running smoothly and efficiently. I ordered 3 rolls to go, it was buy 2 get 1 free. I was provided hot tea while I waited which was delicious and such a pleasant surprise. It took about 20 minutes for the rolls, but they were all amazing and definitely worth the wait. I grabbed a menu so I can call ahead next time. The dining room is clean and open, and there is a sushi bar to sit at as well. Staff was super friendly and inviting and I can't wait to go back. Excellent addition to our community!"
  ]
 },
 {
  "name": "Jake's Good Times Place",
  "address": "620 S Cleveland Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/17278308-9333-11ea-bacf-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2176917635616983355",
  "source": "GoogleMaps",
  "reviews": [
   "This place, the staff and the food are awesome!! Amanda is always a great server (they all are but she’s my fav). I love the food: wings, burgers and riblets are my go-to dishes. Great place to hang out and have drinks and good food. When we get back to normal, it’ll be the first place I go.",
   "Great food, the Nachos and Wings were the best I've had in a long time.   Only beat by a Dive Bar in the middle of Alaska.   Coming from the Washington DC area where dive bars and greasy spoons can be found almost every a corner.   They don't even  compare to this food.",
   "So it’s a dive bar and the atmosphere is pretty much what you’d expect. The salad bar could use a better eye to what your staff puts out. Lettuce that’s really bruised and starting to go bad shouldn’t be put out.... or intentionally buried at the bottom. The bathrooms need a complete overhaul. The floor is uneven and the in the stalls there is tile missing.... which shows exposed the exposed wall and the water damage there. \n\nReally my only good thing to say about Jake’s is the wait staff. Super polite and good about keeping your drinks full and your order needs taken care of. \n\nThat being said the food could use a lifesaver. I went a few times and the pork riblet basket was a lot more sad that I was expecting? When I got the ribs it was a 50/50 split between good and horrible. One side was  so over done and crispy that it crunched worse than popcorn would? The other have was actually really good and done to a nice level..... just don’t know how you can have such polar opposites in one side of ribs...",
   "Consistently good food and service.  Standard pub fare.  I recommend the Reuben.",
   "Got sat down and got served by a cranky waitress. Had to confirm our order twice. The food came out quick but was disappointing. \nOrdered the taco salad. \nTortilla was stale. Meat was poorly seasoned. Used an old tasting mixed salad for the lettuce. Poorly chopped. The tomatoes were under ripe.  \nWaitress never came back to check on us. \nCountry radio station playing in the background with commercials and all.\nOverall the place looks dated and worn down. Kind of a shame for a Pierre staple.\nThe riblets were decent."
  ]
 },
 {
  "name": "Gallos Mexican Restaurant",
  "address": "366 S Pierre St, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/17b79078-9333-11ea-85bd-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=17616334608150551449",
  "source": "GoogleMaps",
  "reviews": [
   "Reheated food Menudos were very poor along with the sour cocktail with black avocado pieces with 6 shrimps my total was ridiculous!!!!",
   "I was skeptical coming here. We are from the West coast where we were surrounded by Mexican culture. We have eaten at probably hundreds of different restaurants and taco trucks..... But I must say that I am very impressed and I was very satisfied with my meal. It was rich in flavor and tasted fresh. I am now going to be a regular customer. Not to mention, the restaurant is decorated perfectly and gives us the feeling of being back home.",
   "Amazing food and customer service even though it was only one person working. Best Mexican food I've found in South Dakota. Definitely coming back as soon as I can. If you're looking for that authentic hole in the wall Mexican place this is perfect.",
   "For a restaurant so say they have good food and they show it. This is not that restaurant. I will say I'm very disappointed in this place. My little brother and I ate here maybe a month ago, I'm not going back.\nI ordered the shrimp fajitas, little brother ordered nachos. His nachos were great. Mine not to much, the shrimp was warm to the point of cold, my peppers were under cooked and the over all dish had no flavor, salt and pepper never killed anyone. Oh did I mention that everything came out in under 5 minutes. That's scary! In the end we ordered a fried icecream. Maybe I'm not used to the way they do it here but it was fried than frozen, came out also in under 5 minutes.\n\nHaving to lie on my way out the door while I had a sick stomach was not fun, I dont like to be rude. I have sat on this for a month, mad that I had to lie, mad that I got sick, and mad the food was made poorly",
   "This is for a visit back in August. Very delicious and authentic. Really liked the mole sauce. I'm docking two stars though because the owner wasn't too friendly to us. I feel like when you own a restaurant you should be a little more welcoming to patrons."
  ]
 },
 {
  "name": "Taco John's",
  "address": "415 E Sioux Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/182a01c8-9333-11ea-b43f-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1563447334578300037",
  "source": "GoogleMaps",
  "reviews": [
   "Despite living in a place that has authentic Mexican food, when we're visiting family here, I always have to stop here. Food is as tasty as it has always been. Service was fast and personable. Would recommend.",
   "Sometimes the service and food quality depend on the shift or time of day, but overall I have found this Taco John's to be fast, reliable, and pretty good.",
   "This location has always been great about getting the order correct the first time. I sometimes go near the cutoff time for breakfast and they never try to make me feel bad about the time. My food is always hot and fresh. Easy to get in and out of this location right off the main road.",
   "I genuinely love the employees and the food. They've never gotten my order wrong and they're always friendly and show great customer service. They know how to work a business and I keep going back :)",
   "Great supper.  Quick and friendly service."
  ]
 },
 {
  "name": "Drifters Bar & Grille",
  "address": "325 Hustan Ave, Fort Pierre, SD 57532, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/187fea0c-9333-11ea-b8f5-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food",
   "drink",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11599822263937421274",
  "source": "GoogleMaps",
  "reviews": [
   "Six of us ate here and tried a variety of different foods, they all were fantastic. We also tried the Gambit of craft beers that they had available, with a decent selection, most of which were local. Great views, food, and drink... Not much else you need!",
   "Good food. A few different menu items than the typical restaurant items I see far too often.   Batender was good for some friendly conversation. That's appreciated when I'm traveling alone.  Worth a stop in.  Hope I can get here some time when the sun is up to see the river view.",
   "Housemade items are simply amazing! Staff is extremely efficient, honest, and exhibits the quality of a real team. Best of all, they have the best views of the upper midwest. Prices are so reasonable for all the amenities- it makes Drifters a worthwhile destination of it's own. If only there was a rating higher than 5 stars. \n\nReview of our delightful menu items. The Beet hummus is fresh and delightful. Quite enjoyable for the novice and expert veggie eater. The burger?!? Beyond amazing. However the fries seem to be hand cut and so extremely fresh it's like eating a sliced baked potato. The Ahi Tuna entree features well prepared sticky cold rice, but flavors beyond typical Midwest capabilities.  Congrats to this restaurant for the creation. The wasabi peas were slightly disappointing- as well as the ornamental seaweed paper - but it is Pierre, SD. The leading role-  Ahi Tuna hold a delightful quality and at just $17.00 the entree is overall simply amazing.",
   "Bacon wrapped steak had a great flavor.  Sweet potato  fries were very good.",
   "Beautiful location, an interesting, varied menu, and responsive, knowledgeable service. Server, Matt, was friendly and warm without being ingratiating and made excellent food and drink recommendations. I appreciated the Impossible Burger options as that opened up a whole section of the menu for vegetarians. Veggie dining is not so easy in Pierre/Ft. Pierre, but this dinner made being a vegetarian in a mixed-eater crowd group effortless.  Portions are way bigger than necessary, so count on a take-home box!"
  ]
 },
 {
  "name": "Big Tom's Diner",
  "address": "1415 E Wells Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/18d44bde-9333-11ea-a8d1-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14043751155686696924",
  "source": "GoogleMaps",
  "reviews": [
   "Big Tom's is amazing! The sloppy Joe basket is definitely my favorite, it's a shame it's a weekend special. Oh well! My only complaint is that whenever I call in, I'm usually met with really rude responses. I don't let it sully my opinion though because I'm always greeted with smiles when I come into the restaurant or drive through.",
   "Food is amazing! We've been here 3 times now and its always been great. Staff is super friendly and the price is just right.",
   "Great food; everything is homemade on site! Very reasonable prices, with daily specials. I've been there many times and get something different each time. I've never been disappointed.  Charming diner decor with fast service. The staff is friendly and seem to genuinely enjoy working there. Check it out (be sure to try the sweet potato fries)!!",
   "Always friendly, top notch staff. Food is typical home town diner, but done well. Buns are amazing, though they tend to get soggy under their burgers. \nReally my only gripe there. Great sweet potato fries. Patty melt is AWESOME.",
   "We had to try this place according to all the positive reviews, and I would say that the reviews are accurate. Just a good old fashioned diner with excellent fries and burgers to match!"
  ]
 },
 {
  "name": "Dairy Queen Grill & Chill",
  "address": "519 W Sioux Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/193de36c-9333-11ea-ba06-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=6074960383697320188",
  "source": "GoogleMaps",
  "reviews": [
   "Good food, waited on promptly & courteously. Very helpful when I wanted to take the rest of my food home.",
   "The service is always super fast through drive-thru, I've only been inside once and it was new so everything was clean. The employees have always been nice.",
   "Was very impressed by the fast paced service in all areas...staff were all helping each other and doing a excellent job keeping the lobby area clean",
   "Blizzard of the month was good. Angela recommended it.",
   "Opening week, they were very busy but well staffed. Very quick service."
  ]
 },
 {
  "name": "Zesto",
  "address": "213 W Capitol Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/19957ac6-9333-11ea-9ebc-14b31f159f22.png",
  "tags": [
   "art"
  ],
  "link": "https://maps.google.com/?cid=5996066488739130327",
  "source": "GoogleMaps",
  "reviews": [
   "This is a famous place for getting some really yummy flavored ice cream, from Sundaes to shakes and cones. We swung by almost every night for my two week vacation here for a different flavored ice cream, after eating dinner. It is cash only, but it's worth it. There are some tables and chairs outside in the back.  This is an order from outside place only.  There is handicap parking available.",
   "Can’t tell you the quality of ice cream. I can only say that it being “cash only” killed it for me. It’s 2019 there are several options to get a card reader without it being a nightmare as the owner.... perhaps it’s time you got an updated system? No outdoor seating or alcoves makes getting ice cream here a no go as the temps start dropping like they always do in Oct. \n\nHonestly I went to Dairy Queen because of the card options.",
   "A very dated location, but the friendly staff is very welcoming.\n\nThe large turtle was amazing. Honestly, the price was fantastic. \n\nAlthough the place can be extremely busy and requires a lot of waiting, it definitely is worth it. I would recommend attempting to sneak by during a less busy time, it is always worth it.",
   "Incredible little art deco-ish ice cream place that also serves lunch.  Service was fast and friendly, although we only ordered ice cream.  Several other customers had ordered lunch and the orders seemed to be served quickly. Reasonable prices, $4 for a small dirty river, twist ice cream, how fudge and crushed Oreos.  Next time we're in the area, we'll be back.",
   "Good selection, but no hard ice cream. But I enjoy thier malts."
  ]
 },
 {
  "name": "Pizza Ranch",
  "address": "321 E Hustan Ave, Fort Pierre, SD 57532, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1a01f740-9333-11ea-bbbe-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10659978197658072217",
  "source": "GoogleMaps",
  "reviews": [
   "Good place for a pizza buffet. Also has fried chicken, pasta and salad. The staff was a little slow cleaning up after people left.",
   "The food was excellent as always.  It must've been a busy day because we had a little trouble finding a clean table.  Most of them had been recently vacated but the staff was doing their best to keep up with the patrons.",
   "Good food and nice people",
   "This is the place of all places. For a girl with a milk allergy this place is heaven and hell and everything in between like Nirvana. I can suffer on one side of the buffet and on the other I risk temptation because we all know which side is better. Lastly don't go to the back room like ever. Many travelers have entered only I have returned. God bless Amen.",
   "Really good food and friendly staff"
  ]
 },
 {
  "name": "Domino's Pizza",
  "address": "1419 E Wells Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1a637868-9333-11ea-ab00-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=4300754060862785926",
  "source": "GoogleMaps",
  "reviews": [
   "Great location on Sioux Avenue with easy access and parking. Friendly service with a few tables to dine in the building. Good quality Domino's food and service.  Have reasonable prices and regular specials. Nice hot and tasty pizza, chicken, and other err items.",
   "Great food, fast service. You cant get better pizza in town",
   "Superior balance between quality and convenience. Better than Pizza Hut any day of the week. Always check the coupons. 5/5 will continue to eat domino's again.",
   "Cheesy bread was just the ticket. Good stuff, courteous staff...I'll be a return customer. Thanks!",
   "I've eaten here a few times, and they have good pizza, but the people aren't very friendly, they saw us as an inconvenience, not customers"
  ]
 },
 {
  "name": "Subway",
  "address": "512 W Sioux Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=520468894368476557",
  "source": "GoogleMaps",
  "reviews": [
   "As a person named Jared I have a certain love/hate relationship with subway.  It's never a bad place to get a sandwich, but I have to keep my association with them to a minimum.",
   "It's a subway but the facility felt dirty. I also happened to find a hair from the beard of one of the employees who did have a hat but nothing over his beard.",
   "I asked for a big mac and they gave me a salad. I began to speak to the manager, but he proceeded to cut me off and offered me wheat bread. I distinctly asked for a jitterbugger and was given whole milk. 1/5 stars from me.",
   "It was great! I should have a meal there every day!",
   "Clean place & friendly, prompt service."
  ]
 },
 {
  "name": "Cattleman's Club Steakhouse",
  "address": "29608 SD-34, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1ab7b328-9333-11ea-846c-14b31f159f22.png",
  "tags": [
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=500370035021291804",
  "source": "GoogleMaps",
  "reviews": [
   "Arrived at 5pm. Waited in line to get in. Seated our large group (20+) right away.  Great beer and liquor selection. Service was great. I guess the only criticism I can come up with was a couple steals were slightly over. My medium rare was a full medium. On the pricey side but I really loved it.",
   "Super good!  So glad I made it here and hope to make it back again and again.  The food was delicious and service was excellent!  This would be my regular spot without a doubt.  This is my first visit to Pierre and now I have to be sure to get back here so I can have dinner at Cattleman's!!!",
   "Traveling through town, a local recommended it and we were not disappointed. Good selection of craft beers. On the way out we meet the owner and she recommended to restaurants in the area that we would like.  The atmosphere was casual and laid-back, we were in town for bird hunting and about half of the people we're dressed similarly. Know for steak, and it was good, as were the other items our group ordered.",
   "Good was amazing! Service wonderful. Cost not bad at all!",
   "Cattleman's Club is among the best steakhouses I've ever been to. That's not a claim that I make lightly as I've eaten in great restaurants all over the world. Every time I am in the area I go to the Cattleman's Club because the steak is always cooked to perfection."
  ]
 },
 {
  "name": "Silver Spur",
  "address": "103 E Main Ave, Fort Pierre, SD 57532, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1b12085c-9333-11ea-bd5d-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17654401673788513720",
  "source": "GoogleMaps",
  "reviews": [
   "We went to the Spur for the first time a few months ago and it was fantastic! Service was great, food was great, and we loved the atmosphere. We ended up return a month or two after that and again it lived up to the expectations that we had in place based off of our first time there. Since Pub 34 closed, this is one of the best places to go here in town!",
   "This was our first experience eating there. We have heard great things and for our date night we wanted to try something new.  We got a great seat outside. Our Server Cari was quick, nice, friendly, and extremely helpful with helping us choose apps and our main course. Her suggestions were on point and did not disappoint at all. We ended up choosing two apps and 3 main dishes as everything looked amazing. The Totchos, Cheese curds for apps and the main courses Chicken Fried Steak, Southwest Cheesesteak, and the Grilled Gound were amazing as well as their aoli sauce were delicious. Trust me, they did not disappoint.. prices were great and portions were more than enough. Great drinks, amazing food, and great service. I highly recommend. Especially for a date night or family night out. Huge shout out to our server Cari, we will definitely go back because of her.",
   "One of the best \"not on the interstate\" restaurants, I parked my semi and walked a half mile to dine there.would do that anytime.",
   "Had great food and a great atmosphere. We were shooting darts for league and they were super amazing and able to reserve a few tables for the teams. Again, great food and would love coming back again.",
   "Staff was friendly and the food was good! Atmosphere you would expect from a nice small town bar"
  ]
 },
 {
  "name": "Champs Chicken",
  "address": "310 W 1st Ave, Fort Pierre, SD 57532, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=16833806698284303016",
  "source": "GoogleMaps",
  "reviews": [
   "Decent food and the staff is fun and friendly",
   ""
  ]
 },
 {
  "name": "Grey Goose Store and Social Club",
  "address": "28886 Merry Rd, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1b64bc76-9333-11ea-b43a-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5959186811965146367",
  "source": "GoogleMaps",
  "reviews": [
   "This place will always have a place in my heart. My Grandfather Vernon always came to The Goose for breakfast, when he grew less mobile the staff would deliver his breakfast to him every morning since he lived a few houses down. He loved this place and I love how they always looked out for him. Now that my grandfather has been gone 4 years this place will always be remembered.",
   "Friendly, very nice inside, clean, great food and drinks and nice patios.",
   "The food is pretty good, but the service is often sub-par to poor.  We waited more than an hour and forty-five minutes for our food, and the place wasn't even that busy! Our waiter assured us that the kitchen was working on our meal after about an hour of waiting.  It turns out that he was being dishonest and actually never even put in our order.  He started avoiding our table.  Only after another server noticed our frustration and took it upon herself to check on our order did our server admit that he had neglected to put in our order at all.  Baffling. Honestly, the food ended up being good, but overall, it was a vexing ordeal, and the whole meal should have been comped. This is our second negative experience here.",
   "I live near by..a great place to eat.an the bar..u meet all walks of life..folks from every where..an from pierre.ft.pierre..just a Beautiful place to go an be happy..the store reasonable prices..stop by..see many hunters..bikers..an natives..hope to see u..",
   "Very good breakfast! Courteous staff, small town pricing. "
  ]
 },
 {
  "name": "Scooter's Coffee",
  "address": "401 E Sioux Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1bc3f522-9333-11ea-a2bc-14b31f159f22.png",
  "tags": [
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13257566864807820874",
  "source": "GoogleMaps",
  "reviews": [
   "One of my favorite places for coffee in town,  conveniently open later so I can get my Peanut Butter Blender w/2 extra shots to finish out the night 😄.\n I've visited many times, and have never seen there crew slacking. Good job guys/gals!",
   "The first couple months the place was good and fairly fast. \n\nThe last few times if there are 3 cars in front of you, prepare to wait minimum 15 minutes for a cup of coffee. \n\nEach day you can drive by and see the difference in service. On top of that, the $6 drink wasn't even that good in taste.",
   "Decent food and coffee, waited in line for 15 minutes. I do not recommend if you are going for something quick.",
   "First time eating a Breakfast Bagel. Real good!",
   "WOW... GODS 🤤😱🤯🎅🏿"
  ]
 },
 {
  "name": "Lake Oahe",
  "address": "Pierre, SD 57501, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=18269521622269113887",
  "source": "GoogleMaps",
  "reviews": [
   "Some of the best fish in the state!"
  ]
 },
 {
  "name": "Spring Creek Resort and Marina",
  "address": "28229 E Spring Creek Pl, Pierre, SD 57501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1c12eb40-9333-11ea-93f0-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6061468437589735997",
  "source": "GoogleMaps",
  "reviews": [
   "Food very good. Haven't been here for several years when under different management. Was very pleasantly surprised.",
   "Excellent place for a get away!  Stopped in passing through for work and was able to put together a last minute fishing trip.  Limited out on Walleye and they grilled it for us that night.  Excellent!",
   "Shelly is a wonderful server! Food is great!",
   "Super place ☺️🚫stress ♥️👍",
   "Excellent food. Great atmosphere."
  ]
 },
 {
  "name": "Medicine Creek Bar & Grill LLC",
  "address": "211 Pierre St, Blunt, SD 57522, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1c6d8ea2-9333-11ea-845d-14b31f159f22.png",
  "tags": [
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=2177960480286192977",
  "source": "GoogleMaps",
  "reviews": [
   "Best food and NOT overpriced!!! Love it, love them, always service with a smile. 😊",
   "Cool",
   "Great people and friendly staff.",
   "Slow service. Miss lead on menu",
   "Great place to eat. Low prices"
  ]
 },
 {
  "name": "Burger King",
  "address": "201 W Sioux Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1cd4534c-9333-11ea-a3df-14b31f159f22.png",
  "tags": [
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5548843509657151626",
  "source": "GoogleMaps",
  "reviews": [
   "They forgot 2 out of a simple 4 crescent order. I use to work fast food 9mo pregnant; in a area 30min outside Chicago; and could take, make, and expedite without mistakes. So not sure how hard you have to try to forget 2, exactly the same items, out of 4 especially when it's your special. They did send 2 free crescent coupons (it was that or drive back) but still didn't help that morning's breakfast.",
   "Gotta say one of the dirtier burger kings I’ve been in. I usually enjoy a spicy chicken sandwich and fries but the fries were covered in black burnt specs so they tasted burnt while being soggy and undercooked. The place had trash all over it (including a used Kleenex on the cash register). My daughter said the toilet seat was sticky and they obviously haven’t deep cleaned anything in a long time. It’s obviously time for some training , take pride in your establishment.",
   "Cant even make a sandwich with just bread patty and sauce. I got my sandwich soaked in sauce like it was completely dunked into a bowl of sauce. But they left the lettuce off like I requested. They even gave me medium fry when i ordered small",
   "Just ordered a Texan Double Whopper and on the bottom bun of the burger there is some mold. Never puked so hard in my life hahah.",
   "Everything was amazing. I was on a short lunch break from work going to a training for volunteer fire department, and the wait time was reasonable for the noon hour. I was able to get in and out, order exactly what I wanted and received it very fast. Would definitely recommend."
  ]
 },
 {
  "name": "Hardee's",
  "address": "305 W Sioux Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 3.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1d2fe112-9333-11ea-a0c1-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2790649095015689985",
  "source": "GoogleMaps",
  "reviews": [
   "The foods ok. They need to put a bit more effort into the food served. Take pride in your work.",
   "Great food. Service was slow. The window gal didnt greet me or say the amount owed. Just took my money and handed me food. No thank you or have a nice day.",
   "Very dissatisfied with the \"service\" we received. If you're in customer service, then it is obvious that being rude or curt is not what invites repeat business. The guy at the window clearly felt that his time was being wasted by the tone of his voice. Once we pulled up to the window, he could be heard yelling at another employee. No name badge. None on the receipt either. We were charged for adding bacon & did not get it on the burger. Never been to a Hardee's before & don't plan on returning.",
   "I love their big chicken sandwich with a seeded bun!",
   "Great fast food stop. The staff was super friendly, the food was served to our table with a smile and looked delicious. Highly recommend. "
  ]
 },
 {
  "name": "McDonald's",
  "address": "610 W Sioux Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 3.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1d807264-9333-11ea-8cca-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11042189127622540459",
  "source": "GoogleMaps",
  "reviews": [
   "The manager on duty tonight was very rude. I order a chocolate shake and he give me one mix with the shamrock. I ask if I can get another one remade and he said no it what I order so I showed him my receipt and he walked off. Tim the cashier was so nice as to take over and help. He was nice and friendly from the moment I walk in. The manager didn’t even have a name tag on and I think that because he knows that he has a poor attitude and awful customer service.",
   "Really wish there was a way to give a negative. The dip ships have done it again! Went through the drive thru ordered a \"bacon\" quarter pounder ended up with a regular one. I'm really starting to believe they're still open cause they are the only one in town. How is it a promo that its being hyped and suggested can't be done correctly. I'm starting to think I'll save my McDonalds money for any not in Pierre, SD. Oh and as if messing up my order wasn't enough they forgot the bacon on my husband's too. (Funny part is they got the special request correct but couldn't remember the bacon.)",
   "I tried to buy my grandson in Pierre some food but I am 160 miles away. I ordered on app and paid with my card but they wouldn’t let him pick it up because he didn’t have my phone. I even called them and explained but they said “Nope!” I canceled it and I’ll buy him food from elsewhere. No customer service there at Pierre McDonalds!",
   "This McDonald's location has continued to ruin my view of them every time I go here. The staff is rude and the food is almost always cold.\nThere was one particular night where I went through the drive through with my fiance after a particularly long and hard day. The kid taking our order gave us the total and then told us to come up to the first window. We did and no one was there, so we pulled up to the second window. The staff was rude and said we should have gone to the first, so we explained that no one was there and they rolled their eyes. They only then proceeded to tell us that the ice cream machine was \"broken\" and they couldn't make the one thing I ordered: a vanilla shake. Why didn't they tell us when we ordered? I had already had a hard day, so I didn't respond and just drove off.",
   "If this wasn't the only McDonald's I'd stop going. It seems like every other time I go they mess up my order especially through the drive thru. Paid for a bacon Big Mac no pickles got a regular Big Mac with the pickles. I give up and figure just expect them to screw it up."
  ]
 },
 {
  "name": "Arby's",
  "address": "319 W Sioux Ave, Pierre, SD 57501, USA",
  "avg_visitor_review": 3.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1ddec038-9333-11ea-876e-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=13587904834941931450",
  "source": "GoogleMaps",
  "reviews": [
   "Had the half pound classic with a mint shake. So good",
   "They do not go by the hours posted! 9:50pm on a Friday says the close at 11pm but yet the lady at the window said they were closed. I informed her of the hours posted and she could care less. It was closed 10 min early if it were a regular weekend (again as posted). 1hr and 10min is truly unacceptable!",
   "Yoo the chicken sliders are absolute 🔥! If you're having a had day, just go to Arbys and get yourself a slider or two. It will not dissapoint.",
   "Needs improving more. DAMN",
   "This is Pierre's Arby's idea of sliced roast beef. WTF"
  ]
 }
]