[
 {
  "name": "The Stephen Hopkins House",
  "address": "15 Hopkins St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1e67ece6-9333-11ea-b6e2-14b31f159f22.png",
  "tags": [
   "learn",
   "tour",
   "free",
   "history",
   "tour",
   "history",
   "knowledgeable",
   "tour",
   "history",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13060870400135699001",
  "source": "GoogleMaps",
  "reviews": [
   "Strolling through the streets we came across this little historical gem. Actually it lured us in (there was a boulenteer out front inviting people in). Once in the home, a very knowledgable tour guide, more of a historian, took us through each room of the home sharing stories and details of the important man who owned this house. The tour was free, surprisingly since it was really well done. The guide took time to answer any questions and let you look around each room. You never felt rushed. The staff are very friendly and helpful.  If you want to learn a little bit of American history and about the important man who lived here, I highly recommend spending some time to visit this charming little home.",
   "I would like to start my review with the tourist guide who actually invited us to visit this place.\n\nSo, we were roaming around and guide asked us to take a look into that place and history related to it. Since i was visiting from Canada, i had no clue who Stephen Hopkins was but after the tour, I actually read a lot about him and his life experience. \n\nThis house is a great place to visit if you’re interested to see how people used to live in colonial society. Everything related to Stephen Hopkins is still placed in that house and history is very interesting.",
   "This is a great place to visit. So much history. Our guide was very knowledgeable. There is no cost to tour the place but they do ask for donations. This house is over 300 years old.",
   "Y'know...I've been to my share of museums, and the long and short of it is this:\n\n1) The less crowded, the better \n2) The more hands on, the better \n3) The guide, if afforded the opportunity to have one, makes or breaks the whole thing. \n\nWe got here at 10am (opening) on a scorching hot Saturday, and we were joined by only one other intrepid scholar. Check one in our museum-fun favor. \n\nMarjorie (the guide) took us right in. She kept apologizing for the heat, but her warmth and her candor was way more overwhelming. She is a gem and we had a delightful time learning about early Providence. Oh, and she let us carry the water pot...bro, we are PAMPERED with our plumbing and innoculations. \n\nOf note: I'm impressed with both this house and John Brown's house up the street for their willingness to engage with the stain of slavery head on in both exhibits. \n\nFor any nerds like me and my lady out there, this is a fine hour spent in RI. \n\nOh, and it's freaking FREE, so leave a good tip and sign the guestbook... otherwise, the grants stop coming in....sigh.",
   "Great docents explaining the history of the house and its occupants including 5 or 6 slaves."
  ]
 },
 {
  "name": "The Providence Athenaeum",
  "address": "251 Benefit St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1ed22086-9333-11ea-a996-14b31f159f22.png",
  "tags": [
   "library",
   "wander",
   "library",
   "free",
   "library",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16578095039491069431",
  "source": "GoogleMaps",
  "reviews": [
   "Getting married in a library usually means you can wander among the books, but you actually have to use a completely different space for your ceremony. Here, you actually have your ceremony in the stacks! A book lovers dream!\n\nYou can have both your ceremony and reception here and I have seen 2 weddings with around 100 guests fit well. I don't know if you could honestly fit many more guests though comfortably. \n\nThe Athenaeum allows you to take photos almost anywhere in the library and is very responsive and accommodating- it's not like one of those massive \"wedding factories\". They don't do many weddings, so it's a lot more relaxed.\n\nThe reception area/dance area is broken up downstairs by the stairs coming down in the middle of the room, so you can easily divide dinner from dancing. However, neither space is particularly large so you *can* dance and do the hora, but it's narrow.\n\nIf you have any guests with mobility issues, there are a lot of stairs both getting into the venue, going down to the reception area, etc. But they do have entrances that are accessible but you'll need to think ahead to make it run smoothly.",
   "Love it here! If I lived here this would be my second home. Creaky, beautiful, atmospheric, odorific! Some greats have spent time here and you can still feel their presence.",
   "Exquisite, visually stunning! Great ambiance and a perfect place to read. And the story about Edgar Allan Poe & Sarah Helen Whitman, need I say more? Tips, visit when the lights are on (after sunset)...",
   "A really cool working library...reminds me a little of the library at Trinity College.\n\nDefinitely a great place to stop over and browse while in the area.",
   "FREE library that holds old intellectual books from various authors. \n\nVery quiet good place to study and wifi is free. However no food or drinks are allowed."
  ]
 },
 {
  "name": "Waterplace Park",
  "address": "Memorial Blvd, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1f2b8e92-9333-11ea-b61b-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "tour",
   "art"
  ],
  "link": "https://maps.google.com/?cid=7074262004035701536",
  "source": "GoogleMaps",
  "reviews": [
   "In the winter it's a great place for a walk thru parts of Providence, you can go from downtown all the way to Fox Point.  In the summer there's several cultural activities to enjoy along with areas to sit down and enjoy the sun or a picnic...great place for late night romantic walks.",
   "Great place to escape for lunch or a quick walk around the water. You’ll also find seating to relax, read or just hang out. Kept very clean by friendly staff. Astonishing fire shows on the water at night on summer weekends as well as boats to rent.",
   "Absolutely BEAUTIFUL!  One of Rhode Island's famous attractions. We have people come down from all around the world to see the lighting's.  Here you can rent boats and you can have your very own private tour with a romantic dinner OR you can rent one to enjoy with your loved ones🧸🙌🥰. You can also go KAYAKING!",
   "Fantastic renovation of an original waterway in Providence. A vibrant area of shops, restaurants and art in many forms. Water fire is a treasured experience with varied events throughout the season. Worth a stop anytime.",
   "Great chill spot..usually pretty clean and safe. Great architecture! And a good smoke spot...just dont get caught..."
  ]
 },
 {
  "name": "RISD Museum",
  "address": "20 N Main St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1f8e483e-9333-11ea-955f-14b31f159f22.png",
  "tags": [
   "unique",
   "art",
   "free",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=5265030494165669820",
  "source": "GoogleMaps",
  "reviews": [
   "Great museum with unique exhibits and a truly fantastic \"raid the icebox\" series of curated exhibits. We were pleasantly surprised at the high quality of the exhibits and pieces at a college museum (yes, yes, I realize this is RISD). Enjoyed the wide range of art and styles as well as how well the museum was presented. Well worth the visit!",
   "I had a difficult time enjoying the museum. I think, for me, it's because I had a hard time trying to identify the museum's genre/flavor/what-have-you. There's one paint/work right next to something of a different style from hundreds of years prior. \nThat being said, I LOVE that they make it free to the public on certain nights throughout the year to allow everyone to enjoy art.",
   "Fantastic museum, I was not expecting it to be so huge. The collection was incredibly diverse, from period rooms, to contemporary art, Egyptian relics, Japanese relics. It really demonstrates the loves people have loved all over the world throughout time.",
   "Fantastic world class museum! My first visit was 3 years ago. I was amazed by the collection. I was naive in thinking that a college museum in a small city wouldn't rank with the likes of Boston's MFA, but it does! Wonderful collection.",
   "A little challenging to navigate, but the artwork was beautiful and well-curated. I appreciated the diversity of works and the contrast between old and new artists. I'll have to come back!"
  ]
 },
 {
  "name": "Providence Children's Museum",
  "address": "5th lane, 100 South St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1fdefe24-9333-11ea-942d-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "history",
   "kids",
   "eat",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=5356490592915063621",
  "source": "GoogleMaps",
  "reviews": [
   "I took my grandson a few days ago. It is $12.50 per person to get in adult and child which is not bad for a whole day's worth of fun and learning.  The first floor has the water tables, vacuum and tubes with scarves with balls very cool, and many other tactile things to do. Up the ramp there is puzzles and brain teasers as well as dress up and many other adventures.  It is a whole day's worth of fun. Great place to take the kiddos. As my grandson said.  \"It was the best day of his whole life\" He goes to many places and had lots of fun.",
   "It is a good place but small and does not change. It is worth joining if you plan to go to other reciprocal children and other museums it is with 100%. My kids get board very quick there. But we use it at other places around the country. It is it good for us, but it is challenging with 4 kids.",
   "MUST SEE!! Outstanding kids museum.. geared towards the younger ones, but lots of room to run, play and explore! \nMy little ones favorite is for sure the water room! But there are some great informative lessons and history for older kids and some nice info plaques on the way kids play for adults.",
   "Very interactive place for kids of all sizes and abilities. It was convenient to have a place to eat or take a quick break. Having a ramp to access upper level is awesome. When you may feel 'closed in' head to the enclosed play yard to release more energy!!",
   "This is a wonderful place to play, learn and explore. I have had nothing but amazing times with my little ones here. The staff is very personable. They make you feel very welcome there as soon as you step through the doors all the way until the time you leave. If you need anything a little extra during you're time there, they try and help you out if they have the ability to."
  ]
 },
 {
  "name": "Prospect Terrace",
  "address": "Congdon St, Providence, RI 02906, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2046b0e8-9333-11ea-bf47-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=17223404866620010196",
  "source": "GoogleMaps",
  "reviews": [
   "Best views of the city here. Also where Roger Williams' ashes are. Cool spot to see the city from a different perspective. Not too far of a walk from the downtown area.",
   "I moved out of state and love to come visit everytime I'm around. Is one of the most beautiful views in Providence.",
   "Beautiful view of area below. the old state house/ state building. With a large 14-ft status of their Roger Williams. \nArea to seats quite. Green grass",
   "This is a great view of Providence no matter what time of year. It is a small park but nice to spend time to view and chat, it is usually quiet there. I go often and always take those visiting as a must go spot.",
   "This is a \"small\" public park (with maybe 4-5 benches) named after the Roger Williams. The view here of Providence is spectacular."
  ]
 },
 {
  "name": "Roger Williams Park Botanical Center",
  "address": "Floral Ave, Providence, RI 02905, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/210d8fa4-9333-11ea-912a-14b31f159f22.png",
  "tags": [
   "unique",
   "tour",
   "unique",
   "learn",
   "family",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13076977362430551405",
  "source": "GoogleMaps",
  "reviews": [
   "A hidden treasure in Rhode Island. The docent tour is a must to truly see and hear the fascinating life stories.\n  We were brought to each habitats and visual treasures of color and textures.\n  There were so many hidden treasures within the space. These included pottery, unique plant containers, and heights of plants and trees.",
   "Beautiful greenhouses and a wide variety of plants. Plants in outdoor garden were mostly dead because of winter, but the path  appeared to be well-kept and the plants that exist year round looked very pretty",
   "We got married in the Botanical Center and it was perfection! Our guests loved how unique the space was and enjoyed all the natural beauty of the space. The staff was always friendly and responsive and I would highly recommend the venue to anyone especially if you are getting married off season!",
   "Great for the family. It's peaceful and enjoyable. Perfect atmosphere for children to learn more about the environment. If the rose maze were in full bloom it would have been 5 stars",
   "We took a nice walk at the RW Botanical Gardens and enjoyed just taking our time admiring all the beautiful flowers.  Our 5 year old especially enjoyed looking for the mermaid and the fairies.  Outside we checked out the rose maze. That was fun trying to get to the center. Lastly,  kids can see a couple of goats at the base of the gardens."
  ]
 },
 {
  "name": "Roger Williams Park Zoo",
  "address": "1000 Elmwood Ave, Providence, RI 02907, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/215dad1e-9333-11ea-987b-14b31f159f22.png",
  "tags": [
   "active",
   "free",
   "active",
   "eat",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3280479280133262757",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic visit to the zoo in February! We had such a great time despite the chilly temperatures. We had practically the whole zoo to ourselves! Almost all of the animals were out and much more active than they are in the hotter summer months. We watched the giraffes being fed and the elephants bathed all indoors! So cool! The rainforest room was extra toasty and a fantastic space! The giant otter was a thrill to watch and the free roaming monkeys and birds were amazing. The barnyard was a delight for my 1 year old. And bonus the bathrooms were heated! Overall, the zoo was an amazing place to visit in the winter especially if you enjoy half price admission and no crowds!! Highly, highly recommend!!",
   "This place is very fun on a nice day, the animals will be out and active. On a hot day they will want to lay around. Tickets are not expensive at all. The food can be though, so sometimes it's best to eat well before.",
   "We go every year to the pumpkin spectacular-it is a great night out! We love Halloween and get lots of great ideas for carving our own. The themes change yearly and the imagination and creativity of the carvers is amazing. We absolutely love the laughing tree and how it has grown/evolved over the past few seasons.",
   "This is a great zoo. We go all year round and always enjoy our visits, even in the winter many of the animals are out and about and also there are indoor exhibits the provide a reprieve from the cold. The new rainforest exhibit is so nice! It takes about 2 hours to make your way through, some areas are hilly so it may be smart to bring a stroller if you have little ones.",
   "Roger Williams park zoo is one of the best zoos I have ever been to. Every time me and my family visit, we're always greeted by nice workers and friendly faces. The exhibits are always amazing to see and watching the animals is always a treat. I hope to be able to have a chance to talk with the owner of the wonderful zoo someday."
  ]
 },
 {
  "name": "Roger Williams National Memorial",
  "address": "282 N Main St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/21a787a2-9333-11ea-9036-14b31f159f22.png",
  "tags": [
   "walk",
   "historic",
   "history",
   "learn",
   "historic",
   "history",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=4952941447798368715",
  "source": "GoogleMaps",
  "reviews": [
   "I love this park. Walk my dog here several times a week. As many do. It's always clean and when there's litter, I pick it up. The Rangers do a great job. It has very interesting markers that I still re-read. Always a great experience.",
   "Very friendly staff in the visitor center!! Welcoming and excited to share their knowledge about the site, Rodger Williams, and the history of Providence. Also directed me toward other nearby historic sites of interest. Overall a great little stop in Providence for anyone interested in U.S. history!!",
   "The only national park in Rhode Island, this place doesn’t look like much upon first glance. It’s a nice park, well-maintained and picturesque, but it’s very small for a national park and for the most park looks like any other park in the city. \n\nThe cool part about this park is the history behind it. This is pretty much where Providence was founded, and Roger Williams lived very nearby. There’s a historic well, plenty of informational signs, and a wonderful visitor’s center.\n\nIf you’re looking for a breath of fresh air or a stroll through a park, this is an alright option with plenty of better alternatives. If you want to learn more about the history of Providence and Rhode Island, there’s a lot to discover here.",
   "Interesting short movie about Roger Williams.  Friendly, professional & informative!",
   "Providence - really nice place for vacation. Here you can see a lot of huge and gorgeous buildings, beautiful parks and other really good things."
  ]
 },
 {
  "name": "Swan Point Cemetery",
  "address": "585 Blackstone Blvd, Providence, RI 02906, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/22005626-9333-11ea-b1a8-14b31f159f22.png",
  "tags": [
   "walking",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17966718356455419218",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful 300 acre cemetery. Walking around you can tell that a lot of care goes into this place daily. The trees are beautiful and there is an area along the water that is peaceful.",
   "More of a park with headstones than cemetery.  A great look back at the grandeur of death in the 19th century. \nBe aware that taking photos of monuments is officially discouraged, so use discretion. ",
   "This has to be one of the most beautiful cemeteries in the entire USA. I don't live here, and only visited the cemetery to admire its trees and gardens, and thought about changing my plans for my final resting place!",
   "From the wonderful experience with Linda Xavier in learning the history of the cemetery to the final day of the funeral, my experience with Swan Point was wonderful. Linda was patient and met with the family time and time again to ensure we were happy with our choice in a plot.  She also gave us a lot of information which made it easier to decide on what to do for a service and funeral.  The cemetery itself is beautiful and peaceful.  I highly recommend meeting with her if interested in Swan Point.  The entire staff there is professional, kind and compassionate.",
   "Beautiful cemetery."
  ]
 },
 {
  "name": "DePasquale Square",
  "address": "Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/224b4212-9333-11ea-834e-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=11445607195931817261",
  "source": "GoogleMaps",
  "reviews": [
   "Nice square. Good restaurants. Open air atmosphere in the center.",
   "Lots of vibrant colors and with Italian flair meeting Spanish Caribbean style.  The outdoor atrium and fountain are excellent.  You won't go hungry either",
   "This place was hopping on a Sunday night!  Lots of people, great live band playing Frank Sinatra songs, folks dancing.  Get a taste of Italy here in the Federal Hill District of Providence RI.  I had the fig and prosciutto pizza.  It was topped with fresh arugula,  and the crust had a very nice chew.  If you are looking for a place to people watch, and get a nice meal, this is the place!",
   "DePasquale Square is a wonderful place to visit. It has Fine restaurants and a market place for a real Italian feel experience. One Local owner Gianfranco really knows how to please people with the Italian menu and the Italian scenery.",
   "Love this part of providence great to visit at all times of the year highly recommend checking it out if your in town. Especially when the weather is good at night the place really comes alive!"
  ]
 },
 {
  "name": "The John Brown House Museum",
  "address": "52 Power St, Providence, RI 02906, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/229d0bec-9333-11ea-90c7-14b31f159f22.png",
  "tags": [
   "walk",
   "cheap",
   "tour",
   "tour",
   "historic",
   "history",
   "family",
   "tour",
   "learn",
   "history",
   "tour",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=16527566125306840570",
  "source": "GoogleMaps",
  "reviews": [
   "Nice and cheap for an unguided tour! The house is gorgeous and so much fun to walk through!",
   "The Benefit Street tour starts from the John Brown Museum. You have to book advance and it is a good way to find your way around the historic sites of Providence. Geographically, the tour covers a distance from about the middle of Benefit Street down to the northern end of the street; and historically it roams from the earliest settlers right up to the modern day. The history of Brown University, and the mega rich Brown family who set it up, are inevitably a big part of the story. The family patriarch John Brown features prominently and our guide didn’t shy away from Brown’s less than proud history of slave ownership. There’s also a visit to the Providence Athanaeum, site of some Edgar Allan Poe scandal, and a tour of the First Baptist Church of America, which looks exactly as you would hope a New England church to look. The tour does take a very long time and our teenager was getting a bit fed up at the end, but it was interesting and we learned a lot.",
   "This house is incredible! Take the tour, $10 per. If you get Lyle as your tour guide ask about the burning of the Gaspee. It ties in with a piece on the second floor. Amazing story about the founder of the estate. Lyle is an excellent tour guide.",
   "John Brown was an American abolitionist. Brown advocated the use of armed insurrection to overthrow the institution of slavery in the United States. You will learn more about this man and his brothers who had a different pov on things. It is a great place to learn more about a sad but also liberating part in American history. Without history we are nothing.",
   "Great walking tour of Benefit Street with Denise"
  ]
 },
 {
  "name": "Carousel Village",
  "address": "1000 Elmwood Ave, Providence, RI 02907, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/22e79edc-9333-11ea-ba14-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "kids",
   "family",
   "kids",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9289223288930857825",
  "source": "GoogleMaps",
  "reviews": [
   "This carousel is beautiful and so much fun. I enjoy riding alongside my 5 year old daughter every time. I recommend buying the multi-pass, it's worth the money. Especially, if you frequent the carousel as offered as we do. Also, pony rides are $5 for one ride, which is going around the circle once. Food truck Friday's ate the best. Kids play in the playground, there's tons of food trucks too choose from and there is even beer and wine sold (make sure you have your I.D.) for anyone 21 and over.",
   "A little run down but still pleasant.",
   "Carousel village is a fun place to visit with the family during on season. There is a little cafe with picnic tables, a train that takes the kids around RWP a bit, a huge carousel with tons of horses and a large playground that has equipment for toddler, preschool and school age children. Great place to enjoy during the warmer months!",
   "Lots of fun for everyone! Food truck fridays in the summer is a great way to try different foods and listen to local music. Activities for kids is also a plus.",
   "Awesome time great food so much to choose from. Great prices great entertainment. Lots of fun"
  ]
 },
 {
  "name": "Providence Ghost Tour",
  "address": "60 Congdon St, Providence, RI 02906, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/232fcbc0-9333-11ea-9087-14b31f159f22.png",
  "tags": [
   "historic",
   "walk",
   "tour",
   "history",
   "tour",
   "history",
   "performance",
   "history",
   "walk",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1743049950628357487",
  "source": "GoogleMaps",
  "reviews": [
   "Super cool! Loved every historic story behind all the building. Great experience! Came from NY just because, and found this pamphlet at our hotel!! Loved it",
   "Pretty neat ghost tour. Our guide, Nicky, was awesome! I'm not really into ghost stuff usually, but she had a lot of interesting stories about the history and tragedies that have happened on some of Providence's streets. Good for a nice evening walk, too. I imagine this tour is really busy in October. We went in June. Apparently, students from nearby colleges (i.e. Brown and RISD) will come up to tour groups and say \"ghoooooosts!\" Unfortunately, I didn't get to see that. I definitely recommend this tour!",
   "This tour is a fun way to see the city. Good balance of humor and spooky moments. Nikki was fantastic and did a great job on our tour. She catered to our interests when we asked her for more history or story details that weren’t necessarily part of the tour. Would definitely recommend!",
   "Had a great time exploring Providence and learning about its bloody and haunted history. Our guide was wonderful and gave a very entertaining performance.",
   "A great way to spend an hour and a half on a beautiful September evening.\nNot a scary tour, but interesting.  Especially if you enjoy history and the paranormal, as I do. Our guide, Stephanie, was fabulous.\nBe prepared to walk a steep street or two - uphill!  Also, no restroom stop nor place to purchase a beverage.  Bring a water bottle!\nDinner on Thayer afterward made the evening complete!"
  ]
 },
 {
  "name": "Museum of Natural History and Planetarium",
  "address": "1000 Elmwood Ave, Providence, RI 02907, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2389366e-9333-11ea-b773-14b31f159f22.png",
  "tags": [
   "free",
   "affordable",
   "history"
  ],
  "link": "https://maps.google.com/?cid=10066913976093567364",
  "source": "GoogleMaps",
  "reviews": [
   "They are so affordable that it is like going for free! Honestly because of the price I thought this place would be lame , but it wasn't it was interesting and fun especially on a winter day and u feel like getting out .\n\nI think they should have a full gift shop with a quick snack bar ( popcorn and drinks ) just to bring some more money into the museum so that they can improve it a bit ...if they improved it a bit and charged $5 more to get in it would be worth returning to .\n\nOtherwise it is a one time visit kind of place... definitely worth the price and at least going once",
   "A little small but amazing value for the $2 price tag. I recommend adding the planetarium for the extra dollar.",
   "This place has interesting exhibits and is only $2  to enter.  We spent just over an hour and was glad we took the time to visit.",
   "cute little museum. the price tag meant i could easily decide to kill an hour or two here. the collection and information presented was solid & tailored to the area, & staff was nice!",
   "Thoroughly impressed with the RWP Natural history museum, admittedly my expectations were low because of the small size & only a $2 admission, but I wasn’t disappointed! Absolutely a great hidden gem in RI. Check it out! \n\n& for $3 there is a planetarium show (ages 4 and up)."
  ]
 },
 {
  "name": "Lippitt House Museum",
  "address": "199 Hope St, Providence, RI 02906, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/23cdb9a6-9333-11ea-886d-14b31f159f22.png",
  "tags": [
   "family",
   "tour",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=4634763132240644687",
  "source": "GoogleMaps",
  "reviews": [
   "I really like it. Next time I will bring my family because this was a school trip.",
   "Awesome! A must see..",
   "Amazing place filled with family history and well preserved architecture. Loved the tour and would recommend to anyone with a desire to step back in time. Great late 19th century home.",
   "They offer Victorian game night - so much fun!",
   "Uniquely intact house museum, beautifully maintained and restored."
  ]
 },
 {
  "name": "First Baptist Church in America",
  "address": "75 N Main St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/241968ee-9333-11ea-8fbc-14b31f159f22.png",
  "tags": [
   "academic",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12616255634187789156",
  "source": "GoogleMaps",
  "reviews": [
   "Summer worship is Sundays at 10am, with no Sunday School. During the academic year, Sunday School and Adult Forum are at 10am with workshop service Sundays at 11am. Refreshments available after service downstairs. Free guided tours, Sundays, immediately after service, begin in the Manning Room downstairs.",
   "Very nice staff a little difficult to find parking the day we were there.the church has a lot of history that I found very interesting. The pews are fascinating you have to see them.",
   "Beautiful old church. They have a very informative video and then we walked around the church by ourselves.  Several very old documents and pieces our where you can see them close up. It is a beautiful place worth the visit!! Cost is a donation.",
   "Must see in any visit. Amazing organ.",
   "We walked all the way over from downtown to see the church during hours posted on the church’s website, only to find out from two very unfriendly women that no tours were being given today. Either adjust the info on your website and follow your own hours or don’t bother giving tours at all. Also, I personally have a real problem with any church locked up tight during reasonable hours at all. What if a parishioner just needed to go in to pray?  Very unwelcoming place!!!"
  ]
 },
 {
  "name": "Rooftop at the Providence G",
  "address": "100 Dorrance St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/245d76e6-9333-11ea-a4ad-14b31f159f22.png",
  "tags": [
   "music",
   "food",
   "walking",
   "delicious",
   "drink",
   "music",
   "music"
  ],
  "link": "https://maps.google.com/?cid=7659611661804489038",
  "source": "GoogleMaps",
  "reviews": [
   "When walking through the revolving door, go to your left and use the elevator (button R). This will take you to the Rooftop. I found it was quite spacious up there (bar, tables, couches). Pretty atmosphere. I didn't get the chance to try the food but the drinks were good. However, I did look at the menu and the cheapest thing was $12, and the food that I saw come out for other customers was presented nicely. Also, all the employees I experienced were accommodating and nice. I went to see live music (Radio Honey), and enjoyed myself. A nice spot in Providence.",
   "The waitress was so nice and offered great service. I wish I could remember her name! The heated rooftop is such a nice feature. I don't drink alcohol but the bartender surprised me with a delicious mocktail as there weren't any on the menu. Great night.",
   "We only went for drinks and sat outside at one of the fire tables. I must say that the staff is one of the best I have even encountered. They stopped by often asking if we needed anything. I not even sure who our actual server was, any staff that walked by checked in. The music was slightly loud outside and it did make it difficult to talk over it at times. With that I would still go back because the experience was amazing.",
   "Cool rooftop bar if you’re looking to hook up or something. Place was pretty pretentious but you’ll have an awesome time. There wasn’t really a dance floor... and the drinks were okay. Really pricey though. The outside area is nice even had some blankets for the cold nights. There wasn’t much of a view though... and it wasn’t that high up. Gets packed around 11ish.",
   "A little dramatic with rules but I understand. Music was cool. The crowd progressed into a younger crowd as the night went on. \n\nStrong drinks.\n\nGreat views. \n\nLots of pretty people."
  ]
 },
 {
  "name": "Burnside Park",
  "address": "40 Kennedy Plaza, Providence, RI 02903, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/24a359b6-9333-11ea-befe-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=6475639325137120844",
  "source": "GoogleMaps",
  "reviews": [
   "Pretty clean for a park in the middle of downtown Providence. Interesting statues. Amazing trees. A sketch artist's dream. Lots of fun features. Close to dining, entertainment, shopping, and more. A great place to stop and rest.",
   "I attend Church Beyond The Walls by the statue of General Burnside. I find it a peaceful place and a unfortunately chaotic issues of Kennedy Plaza. The other night waiting on my bus has the sun had set, and the gloaming headset in. The lighting was perfect to take a few snaps.",
   "Nice park that has a lot going on, especially during summer. It is somewhat small, but has a really nice playground for kids. There’s always something going on here, from marching bands to political rallies to farmer’s markets. It’s definitely not the cleanest park in Providence, lots of huge rats running around at night. All in all a good park to come see on a summer day.",
   "Nice park. Great atmosphere. Beautiful fountain. Super clean place.",
   "Exciting and always changing. Every year they have the farmer's market, storytelling, dancers, an open garden, or movie time. Plus, sitting below the trees, listening to the music, and the water flowing on the large fountain it's just perfect 👍\nAnd most of the time on my way back home I stop at the food trucks, and lemonade stand, or icecream stand. This year the city installed tables and chairs near the skating rink."
  ]
 },
 {
  "name": "Memorial Park",
  "address": "S Main St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2503f900-9333-11ea-af1a-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=15271562234600734779",
  "source": "GoogleMaps",
  "reviews": [
   "A beautiful a d inspiring gem in downtown Rhody. Tons of visual satisfaction to accompany a daytime stroll. Packed with monument and murals, this location has the perfect blend of a small metropolis and an eclectic renaissance. \n\nThe diversity of the people, is reminiscent of Times Square without the lights and rush. The Universities in the area, provide a variety of people from all over the world. \n\nYou'll be able to spend hours, just walking. Or, you can take advantage of the bicycles provided to the public, at a small cost. \n\nWould have given it a 5 star rating, if it wasn't for the traffic congestion and impatient drivers.",
   "This was awesome to see with all of the veteran's memorials. I've never been to Providence and didn't know what to expect but I'm really glad we stopped by on our trip back to Boston.",
   "Great memorial for veterans. There is also a sculpture including dozens of real discontinued guns embedded in a concrete pillar. It's quite moving.",
   "Super fun to smoke a joint and look at the statues.",
   "Love to come down by the water during a lunch break and have a moment of seclusion"
  ]
 },
 {
  "name": "Sky Zone Trampoline Park",
  "address": "70 Pawtucket Ave, East Providence, RI 02916, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/25596982-9333-11ea-ad5f-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "kids",
   "kids",
   "parks",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4950197200346748426",
  "source": "GoogleMaps",
  "reviews": [
   "The whole family had a blast. Even those of us that just watched the others play had a great time. Even though it was the day before Thanksgiving all the staff friendly and helpful. Their prices are reasonable and safety definitely comes first there. I would feel more than comfortable bringing my nieces and nephews there any time. Honestly I think my sister and her husband had an even better time than the kids :-)",
   "Horrible service! After waiting in line over 10 minutes to register 2, 11 year olds, the manager on shift was very unprofessional and extremely rude. Made it a priority to tell me the kids need it T-shirts to jump but doesn’t cross sell the socks. paying over $50 dollars to jump for 1.5 hrs, staff are restraining the kids from jumping in certain areas over no socks, when the “manager/cashier” DID NOT MENTION aside of t-shirts socks were required. When I approach the register for my socks she insisted “I TOLD HER, I ALREADY HAD SOCKS”. really? When I refused to agree with her, she Denied me service, and sent me to the next cashier. In her small mind my tone of voice was screaming. Just because I’ve been here in the past doesn’t necessary mean that I carry your socks everywhere. She failed to include the socks and wanted me to agree on her asking me and because I didn’t she refused to service me. Staff, super slow and very unorganized. If that’s the attitude of the manager in charge, I honestly can’t blame the horrible service. NEVER AGAIN will I step a foot in that place, I rather drive 30 plus miles!",
   "Professional and safety! Grest place and clean! My children had a great time. They enjoyed it and went from center to center.  Each staff was uniqueand respectful! They will keep track and monitor while first were using the area they were in charge.  Thank you for making this experience great! Thank you! :)",
   "Check in team member was very nice. There was another team member named Cristian who went above and beyond to answer my questions, help resolve my issues and interact with my children...\nI have been to several other trampoline parks, it didn’t matter which socks my kids wore as long as they were jump socks. The option of buying sky zone socks or trading in your own socks is a little over the top with micromanaging. \nI had two toddlers with me and four 10 year olds. My older so called toddler was jumping with the big kids and was immediate yelled at and kicked off by a team member. When I looked on the main court there was a child who was quite smaller than my son jumping. I had to seek out a member and ask what the problem was. I was told that a parent could put any age on the waiver and it couldn’t be questioned, but because I was honest my son gets the boot? Also besides my kids, there were only two other kids jumping there, not crowed with the potential of someone getting hurt. Cristian was nice enough to explain to me that I had the option of bumping up my older toddler, the person who kicked my child off should have told me. \nNext there were not enough team members for every area to be open. My little ones had to wait to be able to go to an area they were “allowed” which was only wasting the time I had paid for. For the last 15 minutes of our time because there wasn’t anyone on the main court Christian allowed all the children in my party to jump together which I appreciated. If it wasn’t for him doing damage control my review would have been much worse. Still due to all these problems I will not be returning nor will I recommend any of my friends go there.",
   "They don’t allow to jump less than 16 years old kids after 10 pm  on Saturday though they are opened up to midnight. They need to mention this rule on there on google maps listing. No body checks all the rules in your sky zone website. Please be transparent what matters most to the customer."
  ]
 },
 {
  "name": "Lippitt Memorial Park",
  "address": "1015 Hope St, Providence, RI 02906, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/25a0bcfe-9333-11ea-baa4-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2903091724024943766",
  "source": "GoogleMaps",
  "reviews": [
   "This is a nice little park with a pretty extensive playground it also has quite enough space to walk the dog or sit on the bench by the fountain. It also has lots of space has to have some lunch even fitted with some picnic tables. The landscaping is a little bit on the shabby side. Overall it's a friendly park next to a couple of nice restaurants and a nice neighborhood.",
   "Love this park. Plenty of open space and the playground is in the middle away from all the traffic, super cool for the kiddos. Easy to get to. Farmers markets during the growing season. Great place to meet friends.",
   "Nice straight trail and a nice open Park which holds different events throughout the such as yoga in the park couple running groups and it's a great place to hang around",
   "Wonderful park in a nice residential area. Lots of great restaurants, bakeries and dessert shops nearby.  The water fountain is a nice place to gather. Lots of space for picnics and playing.  Big enough to kick around a soccer ball too.",
   "Can't go wrong with a great family friendly Park wonderful location lots of fun stuff for kids lots of other kids there with their parents it was a good time"
  ]
 },
 {
  "name": "Lincoln Woods State Park",
  "address": "2 Manchester Print Works Rd, Lincoln, RI 02865, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/25f5813e-9333-11ea-b14b-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "family",
   "walk",
   "field",
   "nature",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=17845773311218653179",
  "source": "GoogleMaps",
  "reviews": [
   "Its a huge place with lots of trails to walk dogs. Its quiet even when there appears to be a lot of people there. They have separate campsites with grills. Good place for a family outing or party - plenty of room for kids to run and play. Love it here!",
   "Always a beautiful walk.  I find it too congested lately especially after 9am.  I found an early morning walk is best because there's less people and you can enjoy the gorgeous walk. So many trails to choose from. An if you're a dog mom or dad, its like an amusement park to them! Enjoy!! And happy trails!!",
   "Lincoln Woods is a treasure. It's so close to urban areas, but it's a nature lovers paradise. There are amazing rock formations, great trails for hiking,mountain biking, and horseback rides. There are picnic areas with bbq grills, covered pavilions, a baseball field, and a lake with a small swimming area. It's a must see for anyone looking to get out and experience nature",
   "Lincoln woods is beautiful. The views you can find on the lake are absolutely stunning, especially in spring or summer and during sunrise and set. However, the only downfall is that the water is kind of gross. The rest of the park is mostly clean, but the water is not very pleasant.",
   "Nice and peaceful. Take a long walk around the park. Nice place for a bike ride. Cozy hideaway for a picnic with your lover. People love to swim here on those hot summer days."
  ]
 },
 {
  "name": "Providence Art Club",
  "address": "11 Thomas St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/263f6046-9333-11ea-8e6f-14b31f159f22.png",
  "tags": [
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=2625559936808743874",
  "source": "GoogleMaps",
  "reviews": [
   "The Providence Art Club is an absolute gem.  My husband and I attended the Winter Members’ Exhibition 2020 which was incredible.  We are not currently members but after attending this event we are now thinking about joining.  It was fantastic seeing them give away cash prizes to local artists!  If you haven't gone to the Providence Art Club you should stop by!",
   "Pretty amazing collective of artists of varying talent. The fact that there is a thriving art club actually having their own building in downtown (sort of) Providence amazes me",
   "Amazing old 1880 club with a bar and vintage leather furniture. Wish I was a member. Cool H P Lovecraft exhibit when I went",
   "Outstanding restaurant and exhibits",
   "It's like a restaurant i go over there for my job i like this place people are nice"
  ]
 },
 {
  "name": "Neutaconkanut Hill Conservancy",
  "address": "Legion Memorial Dr, Providence, RI 02909, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/268d8718-9333-11ea-9ec5-14b31f159f22.png",
  "tags": [
   "nature",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=17681748251441422280",
  "source": "GoogleMaps",
  "reviews": [
   "Can’t find many good hiking spots in Rhode Island, but this is one of them. There’s plenty of trails to explore, ranging in difficulty to accommodate all. There’s also a ton of overlooks with a great view of downtown Providence. I went here in the winter, and while it was nice that I was one of, if not the only person there, it was also quite icy in some spots. Can’t wait to check this place out once it warms up!",
   "Nice unexpected location for some quiet time in the woods and nature.  Nice well kept trails.  I would recommend keeping an image of the trail map on you because trail blazes are not super frequent or consistent but easy to follow with the map as reference.",
   "Living the city life wishing for hiking trails without having to travel an hour to get to one? We were so pleasantly surprised by the sense of remoteness of the trails. There are many trails, all levels of difficulty, and are well maintained!",
   "Well maintained hiking trails. Parking can be a bit difficult over weekends",
   "Nice walk in the woods for being so close to the city. Good place to take your dog"
  ]
 },
 {
  "name": "Temple to Music",
  "address": "F C Greene Memorial Blvd, Providence, RI 02910, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/26fc048c-9333-11ea-802c-14b31f159f22.png",
  "tags": [
   "hike",
   "music"
  ],
  "link": "https://maps.google.com/?cid=11467317924732350003",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful place. Beautiful and soothing. The dog loves the surrounding area also. Great place to throw a ball and just unwind. You get the beautiful temple, the water and a massive greens area! Thanks Providence! Great job w Roger Williams Park.",
   "Beautiful park, good place to hike and photography.",
   "Great place for weddings, concerts, picnics,  or just relaxing in the park, this is a great classic style white marble temple.  It's open to all and surrounded by great views and in a natural amphitheater. Nice in both summer and winter.  Great winter sledding in the hills on each side.",
   "Always find great things happening that I can participate in going on at the temple a lot of it is private but they love having company and sharing and having a good time a great place to meet people",
   "Nice cozy spot to do photography. Play music, hold an event at"
  ]
 },
 {
  "name": "Betsey Williams Cottage",
  "address": "1000 Elmwood Ave, Providence, RI 02907, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/276350f8-9333-11ea-ab32-14b31f159f22.png",
  "tags": [
   "historic",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=417833594841892697",
  "source": "GoogleMaps",
  "reviews": [
   "One time home of a descendant of the founder of our 13th state,  her home has been carefully maintained to reflect how it might have looked when this was her farm. The grounds have changed greatly over the years but her farmhouse is a historic piece of Rhode Island.",
   "A nice place that just hang out and chill when you are at that Park... just trying to imagine back in time what it was like for the people who lived there",
   "Spent half day here. It was a good day. Was really exhausted and happy at the end. Don't be lazy and walk for a while in the area, you will find the area a beautiful one.",
   "Betsey Williams Cottage is a very nice looking place. Also lots of birds and green areas. Must see it in person.",
   "Beautiful in the Fall."
  ]
 },
 {
  "name": "Ladd Observatory",
  "address": "210 Doyle Ave, Providence, RI 02906, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/27c08c5e-9333-11ea-8aa7-14b31f159f22.png",
  "tags": [
   "history",
   "free",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=12520738030759551271",
  "source": "GoogleMaps",
  "reviews": [
   "Ladd Observatory is an amazing place. I am an astronomy enthusiast, but I did not have any chance to go to any observatories before here. I liked the place and saw the moon through their huge telescope. The building is pretty old, but you can see the history of telescopes and machines, sort of. The staff and people are super nice and helpful.",
   "They have a bunch of nice events open to the public, check their website.\n\nThe grounds are also a great place to hang out and relax, read a book, picnic, whatever you like.",
   "They have weekly (Tuesday evenings) free space viewings, with telescopes set up to show various interesting things and staff to explain what you're seeing and answer questions. If you like space stuff, it's a kick. Be sure to check their site before you go, as their hours are weather-dependent.",
   "What a beautiful, historic site! Ladd Observatory is operated by Brown University, and hosts weekly observation and lecture sessions during the year. Be sure to check them out on a clear night!",
   "Very cool place with some dedicated volunteers and staff. Interesting museum to complement the telescopes."
  ]
 },
 {
  "name": "Rhode Island Irish Famine Memorial",
  "address": "Providence River Greenway, Providence, RI 02903, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/281b219c-9333-11ea-bca2-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=6799837908837019458",
  "source": "GoogleMaps",
  "reviews": [
   "Riveting and compelling artwork.",
   "Tiny park in a good spot of town. It does worth to sit in for 10-15 minutes when the weather is nice. If you're living here and working around downtown area, I suggest this place as a to-go location around noon.",
   "A beautiful tribute! Love the location and it's done so well.",
   "Such a lovely spot with a memorial that's worth learning about.",
   "Worth checking out if you are in the area, a good place to sit and collect your thoughts by the river."
  ]
 },
 {
  "name": "Blackstone Park",
  "address": "600 Blackstone Blvd, Providence, RI 02906, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2861c6a4-9333-11ea-99c0-14b31f159f22.png",
  "tags": [
   "parks",
   "walking",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7478230131023248212",
  "source": "GoogleMaps",
  "reviews": [
   "One of the nicest neighborhood parks in Providence. Sunrise walks are great! I enjoyed starting my day here. Well groomed walking paths.",
   "great place to exercise, and take your pet for a walk",
   "Very nice for short walks with my dog! Clean and easy to stay on the path",
   "Love taking walks there. Been yrs since I've been but went there for a walk with bf . Was nice out",
   "A nice and relaxing place, really relieves me of all my stress.😋😊"
  ]
 },
 {
  "name": "Seekonk Grand Prix",
  "address": "1098 Fall River Ave, Seekonk, MA 02771, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/28b4efdc-9333-11ea-980f-14b31f159f22.png",
  "tags": [
   "kids",
   "eat",
   "food",
   "family",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=680237221604709826",
  "source": "GoogleMaps",
  "reviews": [
   "My kids love this place. Great place for indoor and outdoor. Food is pricey but there are places around where you can go and eat and come back.",
   "Very fun place. Great for family events like birthdays and stuff like that. This place has fun rides and arcade games",
   "It was great. Lots to do. Their Not so scary Halloween was really cute. The Mickey Mouse was quality. Very well done. They have everything.",
   "Great place to spend a day. Kids loved the two different tracks and had lots of fun with the all day pass.",
   "Great little place for the under 12 crowd.  My wife and I have been bringing the kids (and now grandkids) since 2000.  They always have a blast and there is a pretty good selection to keep the kids busy.  My wife and I sometimes play the mini-golf course after a dinner date when we're in the area. Many time the mini-golf course is empty except for us and it's nice to have the entire course to ourselves."
  ]
 },
 {
  "name": "Cathedral of Saints Peter & Paul",
  "address": "30 Fenner St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/28fd440c-9333-11ea-9e42-14b31f159f22.png",
  "tags": [
   "performance",
   "structure",
   "walking",
   "historic",
   "walking",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8752800107339055527",
  "source": "GoogleMaps",
  "reviews": [
   "The Cathedral is absolutely beautiful. Breathtaking architecture has been maintained and restored throughout the years, and the structure is truly an architectural marvel for anyone of any denomination to appreciate. The ornate design is paralleled only by the acoustics which lend to a truly magical experience when listening to voices and instrumentation in concert or during Catholic mass. The pipe organ is a marvel in and of itself! Numerous performance groups hold concerts at the Cathedral, and Roman Catholic Mass is celebrated weekly. Parking is limited and it is best to use the metered parking on the main road or to pay to park in a lot. Wear appropriate shoes for walking on cobblestones and uneven sidewalks, and scarves and gloves are a must in the winter months when the side streets leading to the Cathedral act like a frigid wind tunnel. There is ample seating for just about any event, due to the building's immense size. Bathrooms are clean and fully accessible. An elevator is available for those who require it.",
   "A beautiful old cathedral in the heart of Providence. They have the largest mechanical operation organ in North America. The square outside could use some work. There are signs of neglect that don't present the church well. Would be a fine place to celebrate mass. I recommend visiting with a friend who can play the organ!",
   "Beautiful architecture, beautiful mass. A place to just sit in God's presence.",
   "Beautiful. Classic. Visually mesmerizing. Historic. Astounding organ. Fantastic stained glass. Interesting paintings. Wonderful marble.\nOld-style pews with heating ducts running down the center. Complicated walking routes for receiving the Sacraments in an orderly manner. Has parking. Easy to reach by way of RIPTA or walking. No bike rack that I have seen.",
   "A beatiful Roman Catholic cathedral with a fascinating history. I love this church.💖\n This is the church of our beloved Bishop of The Diocese of Providence. A MUST visit for all Roman Catholics in RI.\nThe very first time I attended Mass there, at the 100th anniversary of Fatima , I was in the crowd  picture in RI Catholic!!!"
  ]
 },
 {
  "name": "Pomham Rocks Lighthouse",
  "address": "Riverside, RI 02915, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2945be9c-9333-11ea-bdc4-14b31f159f22.png",
  "tags": [
   "walk",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=11453689611932975105",
  "source": "GoogleMaps",
  "reviews": [
   "You can see this beautiful lighthouse from the east coast greenway. Best time to see it is at sunset!",
   "Beautiful lighthouse from a distance. Got great pictures on an overcast day. Wish they would do tours again.",
   "Be prepared to walk a distance down a bike trail to get a view. You've got to peak though brush to get a glimpse. But still worth it if you're a lighthouse lover as I am.",
   "Pretty lighthouse",
   "The restoration they did is amazing! I visited this on a light house tour so I got a very nice explanation of the changes they did and got to see inside. The crew that worked on this lighthouse is really passionate about the work they did and keeping the history of it as alive as possible. I totally recommend going to check it out!"
  ]
 },
 {
  "name": "First Unitarian Church of Providence",
  "address": "1 Benevolent St, Providence, RI 02906, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/298d4f8c-9333-11ea-a1f3-14b31f159f22.png",
  "tags": [
   "music"
  ],
  "link": "https://maps.google.com/?cid=12557847486482668456",
  "source": "GoogleMaps",
  "reviews": [
   "Warm, open and welcoming congregation.\nIntelligent, open-hearted minister whose preaching is uplifting and challenging.\nAmazing choir and music.\nA huge array of programs to expand human connections and nurture the spirit.\nA haven for all types of families and people of all ages.\nMany opportunities to assist in charitable outreach to the larger Providence community.\nand so much more...\nI love this place.",
   "Great community!",
   "Thoughtful community of people who are dedicated to creating a safe place where each member is encourage in their spiritual growth.",
   "A truly Welcoming Church with a large congregation of nice folks.",
   "Great place for a meeting felt at home here"
  ]
 },
 {
  "name": "Fargnoli Park And Water Park",
  "address": "945 Smith St, Providence, RI 02908, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/29df1964-9333-11ea-b5f6-14b31f159f22.png",
  "tags": [
   "kids",
   "library",
   "walk",
   "family",
   "parks",
   "field",
   "food",
   "walk",
   "kids",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=5600761884588412951",
  "source": "GoogleMaps",
  "reviews": [
   "A splendid park! Basketball courts and a seasonal splash pad. There is a little lending library stand too. Picnic tables are available. Decently gated in so no huge concern of kids running into traffic on Smith St. Some challenging climbing pieces on one side that are not typical for playgrounds and then a small kid section as well. A set of regular swings and a set of baby swings as well as a chair swing.",
   "It’s a nice park but no longer allows dogs. There are signs posted at each entrance.",
   "My fiance and I love love love this park! Always clean and maintained. A great place to bring family. Fully fenced and the patrons are always politely and completely personable. There are a lot of parks in Providence but this is the only park we frequent! The parking is a little tight but it is not a far walk when the weather is nice!",
   "The park has a baseball field and basketball court with both a toddler and 5 and you playground areas. We enjoyed the first food truck event this past Thursday. There was even a guy singing and playing the guitar.",
   "Great little hidden gem. Doesnt look like much from the road, but this is a really nice space to get away from it all and spend some time in nature. Nice space to walk and there is a ton of playground equipment for the kids. You can go sledding here in the winter too, which is great when it snows. The kids absolutely love it here!"
  ]
 },
 {
  "name": "Save The Bay Center",
  "address": "100 Save the Bay Dr, Providence, RI 02905, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2a481480-9333-11ea-a4e1-14b31f159f22.png",
  "tags": [
   "walking",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=2488761102189142951",
  "source": "GoogleMaps",
  "reviews": [
   "Easy access to Narragansett Bay, kayak launch, fishing, parking, walking trails, dog friendly (on leash), great birdwatching! Managed by nonprofit so when you visit give Save The Bay some love.",
   "It's a great location to visit. On a nice day, take advantage of the walking path along the water. Terrific views of the bay.",
   "Save the Bay is an amazing non-profit in Rhode Island doing important work on environmental education, and keeping the Narragansett bay clean. They are committed to keep the Bay open for the enjoyment of all who wish to fish or just enjoy a quiet, beautiful afternoon on the Bay.",
   "Great place for events! So peaceful to entertain guests and watch the sunset. Do not sit on the picnic tables unbalanced or they WILL FLIP.",
   "Perfect place ! Sunbeam was there for me :)"
  ]
 },
 {
  "name": "Merino Park",
  "address": "100 Heath St, Providence, RI 02909, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2a8b1138-9333-11ea-827c-14b31f159f22.png",
  "tags": [
   "field",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=14589851546101072980",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great place to come play some sports during the summer time. But the only thing is that there is a project right by which makes everything uncomfortable because they are well known for their gang activities. So you can visit at your own risk lol. I went there to play soccer on the field and played basketball and I was fine. I'm pretty sure you'll be fine as well.😂🤷🏾‍♂️",
   "Great park, awesome soccer games!",
   "good park i lost my virginity near the river",
   "It's a great place to hang out with friends and then go to the bike trail",
   "The other review must be written by people who have lived in the area their whole lives. It's basically a strip of grass along the highway behind a housing project where mad-men on ATV's go tearing up the grass.\n\nIf you live within walking distance and need a place to walk your dog it beats the streets, but that's about the best thing I can say about it."
  ]
 },
 {
  "name": "Governor John Notte Memorial Park",
  "address": "1801 Douglas Ave, North Providence, RI 02904, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2ad11af0-9333-11ea-853c-14b31f159f22.png",
  "tags": [
   "kids",
   "field",
   "family",
   "nature",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7449951577388355829",
  "source": "GoogleMaps",
  "reviews": [
   "Nice little location, sort of an oasis on the lake, not far from the busy, crowded city.  I attended a professional conference here, but seems like it's really made for weddings, showers, and local town ceremonies.  If you get a chance to attend, go check it out.",
   "I love that the kids have easy access to water without waves that don't knock them down. They still have sand to play in period there's a playground right on the beach so they can go back-and-forth from the water to the park. Perfect place for them to burn off some energy",
   "Major improvements have been made to this park. Great new playground, great swimming area with beach sand, great place to take the family - also it's nice and clean. It has tennis courts and a  softball field. The only thing lacking could use better designation of parking in back lot.",
   "A little bit of nature right in the city's backyard",
   "Great place to sit or walk around outside. Nice, friendly, a lot in one place. Good landscape that's nicely taken care of."
  ]
 },
 {
  "name": "Wanskuck Park",
  "address": "229 Woodward Rd, Providence, RI 02904, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2b31829e-9333-11ea-8319-14b31f159f22.png",
  "tags": [
   "pets",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12679674867328666905",
  "source": "GoogleMaps",
  "reviews": [
   "Really nice, spacious park. There’s huge open fields and a trail that goes through the woods. It’s sort of an underground dog park, so be prepared for dogs on and off leash. Owners are friendly and responsible, though, and the size of the park makes it easy to find your own space.",
   "My dog's favorite park! Always friendly people and pets there, my dog has made quite a few canine buddies and is always so excited to go there",
   "Awsome place to walk your dog. Parking not the greatest.",
   "Great place for the dogs.. Unfortunately these those few who do not pick up after their puppy's poop 💩🤔",
   "Great dog park. Everyone so friendly."
  ]
 },
 {
  "name": "Rhode Island Museum of Science and Art (RIMOSA)",
  "address": "763 Westminster St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2b7938fa-9333-11ea-8b2c-14b31f159f22.png",
  "tags": [
   "family",
   "art",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5474652739546330372",
  "source": "GoogleMaps",
  "reviews": [
   "The Rhode Island Museum of Science & Art is a MUST VISIT location! Do not let the size of this place deter you from visiting because even though this place is small, you will not get this type of service and one on one interactions with staff anywhere else!! I am honestly in shock that they ONLY charge $5.00 per person, because everything you get is worth WAY MORE! A visit is typically 2 hours long if you go through each and every activity. The staff were absolutely amazing and they really took their time with each child and parent to make sure they were getting the best experience possible. We did some spin art, and the woman who was there was so patient with my daughter who had never done spin art before. I wish I caught her name. But we chatted away like we knew each other for years. Truly hands down the best time I have ever had with my family at a museum like this. Do not pass up an opportunity to visit this place.",
   "This place is not new, but the owner is taking care about everything.  Good place to spend 30 min 1 hour with kids 3-9 years old.",
   "Awesome place with friendly staff. Rachel is an outstanding educator who is very gifted with children. She made our child's birthday party a huge success. Cannot recommend this place enough.",
   "Small, enjoyable science museum. Friendly staff. Worth a visit.",
   "Such a reasonable price and so many completely interactive exhibits. Plan on a 2 hours visit. The science of what makes things work is awesome. Adults had as much fun as the kids. Don't overlook this gift of a place."
  ]
 },
 {
  "name": "Twin River Casino Hotel",
  "address": "100 Twin River Rd, Lincoln, RI 02865, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2bdb2fc6-9333-11ea-b5d1-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16561529773111749328",
  "source": "GoogleMaps",
  "reviews": [
   "Twin River is a great Casino in New England.. they have a variety of food a nice restaurant or bar and grill and then take out food courts along the sides.. Some table games venues and small concerts, which arebetter to see. 2 floors of slots non-smoking and smoking... variety of slots from one cent all the way to high roller high stakes pulls... Incentives,free slot play for returning customers... Live music and many bars I love it...",
   "Love the vibes here haven't taken photos but I will. I recommend this casino . has a second floor for smokers . first floor is smoking. Machine change often . lots of new machines. I love the people there. Enjoy .",
   "Nice place. The hotel is so cute! Went here you see a concert (Gretchen Wilson). It's an intimate setting, which is always good to see a table favorite dinner or band. However, if you're looking to do anything other than sit and watch, ya might want to try another venue. People were escorted out for dancing 2 steps away from their chairs.",
   "As a preferred player I’m always treated well by the hosts. My overall experience has been great and the food, entertainment, and service are awesome. \nFred and Steve’s Steakhouse is awesome as well. \nAwesome service and Food. I highly recommend dining at the delicious establishment.",
   "The only problem I had was with the service at Johnny Rockets on Tuesday night on the 1st floor. The waitresses were curt and not friendly at all. We never got a welcome at all. Drinks took forever to receive and we were never asked if our dinner was ok after we received it. It wasn't busy at all. The entire staff was chatting and not paying attention to customers. I work for Marriott Hotels and understand how important these comments can help. \nOther than that, we had a great time in the casino. Every one else was friendly. The establishment was clean and we will definitely come back. \nThanks for replying to my comment."
  ]
 },
 {
  "name": "Conimicut Point Park",
  "address": "Point Ave, Warwick, RI 02889, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2c246d90-9333-11ea-8c6f-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=8408930359657999084",
  "source": "GoogleMaps",
  "reviews": [
   "Conimicut point is on the west shore of Narragansett bay.  Nice place for a walk. At low tide you can walk out on the sand bar on the point and get a great view of the light house that helps vessels navigate the channel .",
   "Love this place it's beautiful it's great it's a fantastic place to bring your dog and you can bring them there year-round just make sure you pick us up to yourself having the peninsula go out to the lighthouse is awesome especially for the puppies.",
   "I love Conimicut Point Park, it is especially peaceful during early evening. Personally, for me, it is a tranquil place to do some thinking. The light house does it for me, as well as the ocean smell!! I have gone there for many years and left with a new perspective on life. Highly recommended!!!",
   "Close to home very few people know this place; very nice. Many people come for fishing. Fresh air, relaxed and not crowded. I do not go to the beach, but really enjoy the relaxing view of the ocean. Picnic areas available. Playground also available.",
   "I love conimicut point its peaceful and no one really bothers you and its quiet"
  ]
 },
 {
  "name": "Sabin Point Park",
  "address": "130 Shore Rd, Riverside, RI 02915, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2c6dabcc-9333-11ea-8ddf-14b31f159f22.png",
  "tags": [
   "family",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=16675998872343596009",
  "source": "GoogleMaps",
  "reviews": [
   "I really like coming here fo fishing, but it's also a great place to go just to hang out and relax. Plenty of park benches and picnic tables, so if you're looking for a nice outdoorsy spot to bring the family for lunch, you might want to try here. No swimming is allowed, but there is plenty of room to do other things. It's a really nice place, and definitely gets a recommendation from me.",
   "Small park with a lot of things to do. There’s a trail that runs through the park, a dock to fish on, sports fields and basketball courts, and a beach. The beach isn’t great, there’s tons of glass and it’s pretty rocky/full of broken shells, but there is restoration work ongoing. Nice view of Providence and the bay. Wish there were bathrooms here.",
   "No e place to go to take a walk by the water or play at the park. People launch boats here also. The beach area is definitely not for swimming but you could walk and look for sea glass or shells.",
   "One day, we looked at Google maps and saw Sabin Point - what an unexpected, delightful gem! No swimming in the water yet (environmental cleanup efforts are still ongoing) but for a clean, quiet, tidy relaxing picnic, it is simply one of the best in Rhode Island!",
   "One of the places I love. Lots of fun here and so many things to do. I am sure that if you are local you have been here before. If you did not yet, come here quickly before it will get too cold  ( That doesn't affect how beautiful the place is, just less things to do)"
  ]
 },
 {
  "name": "Colt State Park",
  "address": "Route 114, Bristol, RI 02809, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2cc8c4ae-9333-11ea-aa00-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=1725102187424359484",
  "source": "GoogleMaps",
  "reviews": [
   "GREAT PLACE! Went recently to try and escape cabin fever. Beautiful location on Narragansett Bay. Huge. Easy to get around. Wonderful bike path. Playground. Beach. Kids will love it.",
   "An amazing place to visit. Very peaceful to walk around at, and plenty of trails if you prefer the woods. The water makes for great pictures and it's my favorite place to walk my dog at!",
   "I always loved this place. I took my daughter here for the first time a few months ago on a good day and she loved it. Very open and quiet place to go to just relax",
   "Beyond beautiful.  So many great areas to walk, photograph, reflect.  It's a beautiful drive with the ocean right beside you.  It's one of my quick fix drives if I'm craving the salty air :) The drive getting there is just as fun and beautiful.  A great place and town to get lost in.",
   "Nothing beats Colt State Park !!! Beautiful ocean views lots of things for families to do including a bike path and skateboard park. Lots of barbecue and picnic benches for everyone to enjoy just an all-around great adventure please don't miss this wonderful Park in Bristol Rhode Island !!!!"
  ]
 },
 {
  "name": "Dexter Training Ground",
  "address": "Parade St & Willow St, Providence, RI 02909, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2d13b048-9333-11ea-832e-14b31f159f22.png",
  "tags": [
   "kids",
   "field",
   "kids",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2455210501399587853",
  "source": "GoogleMaps",
  "reviews": [
   "I fly FPV drones, and I love to fly at Dexter park..  I try to only fly micro drones there since it is a pretty busy park with a lot of people around..  So far nobody has complained on me, they seem to enjoy watching me fly..  People say there is a lot of drug use associated with Dexter Park. However I have not experienced any of that thank goodness..  Although there is usually a couple homeless people somewhere in the park, they don’t bother anyone..\n If you have a dog, Dexter is a great park for you..",
   "Nice park, especially if you have dogs or kids. Cool statue, good view of the Armory, and exercise stations throughout. Also has a bocci ball court and chess/checkers boards on some of the tables. Great place to enjoy a day off.",
   "Great for kids, and has a softball field, and volleyball ready.. Great for chess as well",
   "its have  nice playground for the kids and a lot space to walk and breath fresh air ...",
   "A fabulous park with bocce and a new volleyball court. Farmers Market on Thursday nights in the summer. All in the face of the Cranston Castle."
  ]
 },
 {
  "name": "Goddard Memorial State Park",
  "address": "1095 Ives Rd, East Greenwich, RI 02818, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2d7b7302-9333-11ea-8a2e-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=13207430317121773169",
  "source": "GoogleMaps",
  "reviews": [
   "The trees are just beautiful. Great trails along the beach. You can also go horseback riding",
   "Goddard Park is a wonderful and relaxing place to go walk my dogs and work on some training. My husband had also gotten some amazing photos of them as well with the beautiful scenery!",
   "Great place. Clean beach, trail in the woods, great time exploring around the coast. There are many fields for sports, picnics. No group too big or too small.",
   "Great walking trails..they are legally horse trails so follow the (State) rules curb your dog and let the horses pass.",
   "I moved states and this place was right up the road. So I thought I would check it out. The park is usually not too busy on weekdays. You will see quite a few people doing their thing. Golf, running, walking, taking pictures and riding horses, on the weekends the sky is the limit, within park rules anyway, is well maintained. The weekends are the best, the families are so happy and friendly."
  ]
 },
 {
  "name": "Biomes Marine Biology Center",
  "address": "6640 Post Rd, North Kingstown, RI 02852, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2dc7e586-9333-11ea-9241-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "family",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15585386068591509704",
  "source": "GoogleMaps",
  "reviews": [
   "I enjoyed the fun day out. But $33 for 2 adults and a child was kind of pricey. The reason I say that is because you can walk through the center in less than 15 minutes. Other than that it was great to be able to pet different types of fish and sharks.",
   "Great place for the whole family! Great demonstrations. Went on a busy day, but there are so many exhibits to see. Gift shop was reasonably priced so the kids left with something!",
   "I was excited to find a little aquarium/biology center so close. I was a little disappointed at some of the enclosures as they were small for some of the livestock and didn't offer any places for the fish to get away from the banging hands of children. There was a lot of information about the exhibits for the size of the facility. One of my main dislikes however was the removal of a puffer fish from it's tank, to be plunked into a room temperature tank and \"puffed up\" for onlookers. Causing a puffer to puff up can be very detrimental to it's health, and they can take hours to resume a normal metabolic rate. I was very surprised to see a \"marine biology center\" doing this. I'm sure it's a big hit for the kids, but really at the fish's expense. All in all it's worth the trip if you're local and the price was good. I would urge others and hopefully them to try and take a little more precaution for their livestock's wellbeing.",
   "I can’t say enough good things about this place. Our children just love to visit. The touch tanks are a huge hit and my kids can spend all afternoon going from one area to the next. We love the mix of tropical and native species in the tanks. They have a nice play area with books and a puppet show stage for kids to use. It’s a nice place to go to in the dead of winter when the kids are bored.  So many learning experience here. ❤️",
   "This place is interesting and has some potential with much needed improvements .\n\nThey have lots of tanks that u can touch sea life including baby sharks, star fish and horse shoe crabs.  Even the ones u can not touch u can get up close to. It was fun.\n\nHowever I would not return, the lobsters were kept in very small tanks , as well as the snapping turtle . There was a long eel , and a fish they called lucky that was also in a small tank .\n\nMost tanks were cloudy and filled with Alagae \nI can not support a place that upholds this sort of treatment to make a dollar .\n\nThey really need a bit of cleaning and invest a bit of money in bigger tanks for some of the sea creatures . If they did this I would recommend this place and give it 5 stars.\n\nUntil then , I barely want to give them 2"
  ]
 },
 {
  "name": "Clouds Hill Museum",
  "address": "4157 Post Rd, East Greenwich, RI 02818, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2e18e8f6-9333-11ea-9575-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "history",
   "knowledgeable",
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=6786381068288172798",
  "source": "GoogleMaps",
  "reviews": [
   "The best kept secret in R.I. ! This mansion has so much history and amazing views of the bay it once sat on 500 acres! Upon entering Clouds Hill your eyes are met with towering ceilings in each room with very ornate surrounds. Each fireplace is a marvel to behold, and there are many! Ann is the owner and is there to chat with she is a real gem and gave us hot cider after the tour! The workmanship is beyond words! Do yourself a big favor and take this tour you will be amazed!",
   "The amount of history that can be learned here is amazing!\nHave you seen the mansions in Newport and wondered what it would be like gowing up there? At clouds hill just chat with anne.\nI hope to return in the spring.",
   "Surrounded in history, I learned a lot from volunteering there, and our guide was knowledgeable, and passionate!",
   "We attended the Clue like mystery event on November 3, 2018, and it was outstanding!!! My 6 year old daughter is special needs (autistic) and the staff/actors were incredible how they treated her and overall how professional and fun they all were. I can't say enough on what a great night out it was and one my family will remember for a long time.",
   "An amazing original collection, spanning the globe, a feast for the eyes!  Very informative, friendly staff,   awesome!"
  ]
 },
 {
  "name": "Donigian Park",
  "address": "Valley St, Providence, RI 02909, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2e79f4e8-9333-11ea-9015-14b31f159f22.png",
  "tags": [
   "nature"
  ],
  "link": "https://maps.google.com/?cid=15077807510124704215",
  "source": "GoogleMaps",
  "reviews": [
   "A very nice, relaxing park to come to for some peace and quiet. The Woonasquatucket River runs right next to it and provides some great views. There are often a lot of geese and ducks around the park, which is nice except for the fact that their poop is everywhere. Not much you can do about that though. There’s a nice bike path that runs right along the river, and a lot of open space for activities. Overall, a great park!",
   "Very peaceful place to sit by the water and enjoy the animals. A little hiding spot to relax and enjoy nature",
   "Nice park . More green than playground.. needs a toddler playground for the little ones or more things to do.",
   "Great park with plenty opportunities for outdoor activities",
   "This places is just beautiful. !"
  ]
 },
 {
  "name": "Old State House",
  "address": "150 Benefit St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2ed53492-9333-11ea-aa9f-14b31f159f22.png",
  "tags": [
   "walk",
   "historic",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=7846924237501318575",
  "source": "GoogleMaps",
  "reviews": [
   "You probably know the place. I was here last time years ago, and I think the place could use some work done. Cool spot, hope they will work and improve conditions it a little.",
   "Beautiful old building, why isn't it a museum? Historical society housed in it was closed on Saturday when we visited.",
   "I visited this place in early June'13. The building itself has a nice appeal to it. It looks old , impressive and important. But for some reason there was no name board on the building. We have to look into google maps to figure out that it was the old state house. ",
   "From the looks of things I would say that the old state house is in need of some repair, while I have never been inside the old state house I can attest to the fact that the outside looks amazing, an historic wonder located on Benefit street. I would suggest walking up the facade from South Main and taki g in the long sweeping g front lawn and walk way",
   "It's not open to the public on Saturdays"
  ]
 },
 {
  "name": "Escape Room Rhode Island",
  "address": "560 Mineral Spring Ave Suite 2110, Pawtucket, RI 02860, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2f24663e-9333-11ea-a059-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=14865405895075388514",
  "source": "GoogleMaps",
  "reviews": [
   "We had a great experience here! A group of 7 of us took on Professor X and defeated him with only minutes to spare! Challenging, fun puzzles to solve. The mechanisms in the rooms were neat to mess with. Staff seemed a bit lack-luster in greeting us and prepping us for the room, not very invigorating or setting the mood, but once we were in the room we were off! Will definitely be coming back for another adventure!",
   "First time going and it was so much fun! John was super helpful and nice. Fun for the whole family and gets your brain working! would give more than 5 stars if I could!",
   "First time at the Escape Room for this group of friends. They were able to solve the puzzles and find the Diamond at The Heist Room. The staff was super friendly and helpful. They want to go back to solve the next room!  We will definitely recommend this to our family/friends.",
   "My wife and I are around 100 rooms now and have done all the rooms within a 1 hour radius of Providence. This place had some poor reviews and so I want to kind of give it a 5 star review with an explanation. For those who have done some rooms before, The heist will be a bit too easy, I think we made it out in about 24 minutes or less with just the two of us. I believe that this is a great room for people who have never done one before though. The puzzles show you what kinds of things you do and how they can tie together, and its design is fun enough. This is likely the specific place and room that I would likely have people go that are asking what a room is like to see if they would enjoy it more generally. We have yet to play The Contraption at this location and that appears to be their more difficult room for people like us and I will update this review with those details.",
   "A great night out! Staff was fantastic and the room was challenging and exciting!"
  ]
 },
 {
  "name": "Caratunk Wildlife Refuge - Audubon Society of RI",
  "address": "301 Brown Ave, Seekonk, MA 02771, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2f7a75c2-9333-11ea-9caf-14b31f159f22.png",
  "tags": [
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=2550081976650138357",
  "source": "GoogleMaps",
  "reviews": [
   "On a recent sunny Sunday afternoon I decided to tape the Patriots game and drive over to the Caratunk Wildlife Refuge on a beautiful early November day and it was one of the nicest days I have spent this fall.  The trails were all well maintained and the fall colors were spectacular.  I went in the early afternoon before most of the wildlife comes out, but the fall colors were breath taking.  If you are looking for an area with a variety of trail types from flat to slight hills this is your area.",
   "Nice little 1 and a half mile loop near the Attleboro area. Quiet with a nice view of a brook and a few bridges along the trail.",
   "I've been wanting to hike here for about 2 months now, and I finally got my chance today!  Perfect weather day for this lovely place.  I was there for about 3 hours total.  Walked the Perimeter Trail in it's entirety, as well as the Hemlock, Observation Trail, and Muskrat Pond Loops  (saving Cole's Brook for a subsequent visit).  All trails were fairly easy (just watch your step around protruding stones and tree roots) and very well marked/blazed.  This lovely Refuge ranges from the outright beautiful to the sublime.  Well worth a day visit, and I strongly recommend (after liberally dousing with insect repellent) taking ample time to revel in the sights/smells/sounds (barring civilization noises) everywhere.  Everything from the miniscule and humble to magnificent is on display here.  Can't wait to go again!",
   "An amazing place. Very green and beautiful with long trails that can make you feel like you're trekking through the jungle. Stay away from Hemlock Loop unless you're up for a real adventure.",
   "I have been going here since my teens , although I haven't been in many years , I'm sure it's just as beautiful and serene as my last time there ! I'm due for a good hike , think I will pay a visit soon ."
  ]
 },
 {
  "name": "Superman Building",
  "address": "111 Westminster St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2fc6c126-9333-11ea-b772-14b31f159f22.png",
  "tags": [
   "historic"
  ],
  "link": "https://maps.google.com/?cid=8322622871543247474",
  "source": "GoogleMaps",
  "reviews": [
   "Came here from Boston in a day trip.\nAccording to other reviews, is this ruined building?\nWhat a pity..... \nGive energy to the downtown again!   ;)",
   "Strange to me that its left abandoned even with it being a prominent building for Rhode Island. Hopefully companies invest and move back in.",
   "It's really remarkable for a building of this scale and architecture to also be quite tall. Even more remarkable is how it has remained the tallest building in the city for all the 90 years of its existence and the fact that it is OLDER than New York's Empire State Building by a few years. It's sad that the building has been abandoned for years and that it is in danger of being demolished. There is a website dedicated to saving the building for those who wish to help (Google 'Save Superman' to find the website).",
   "Bank of America, evil corporate crooks, abandoned this fine piece of 1920s architecture in 2012. It has since fallen into disrepair and somewhat resembles a gray tombstone over Providence, easily seen driving by on I-95. The building itself is quite handsome, it's not called the \"Superman Building\" for nothing; and could look nice again one day. Hopefully it will be restored to its former glory and host tenants worthy of its dignity as the tallest building in Rhode Island - something the culturally bankrupt bean counters at Bank of America could not appreciate when they fled in a cowardly fashion from the streets of Providence and left this historic building unoccupied.",
   "Always know I'm back in RI when I see this building. It's as beautiful inside as it is on the outside."
  ]
 },
 {
  "name": "Gaspee Days Committee",
  "address": "2 E View St, Warwick, RI 02888, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/30118606-9333-11ea-95d7-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=14473859693118915778",
  "source": "GoogleMaps",
  "reviews": [
   "Been on the Committee for many years and still love the events especially the Arts & Crafts show, always a great time. Lots of food and music also things for the kids. Don' t forget to get your raffle tickets to help the parade.",
   "My cousin lives in the village. It was my first time and I had a blast at the parade",
   "Love this every year. The town should help the Gaspee committee with additional funding support.",
   "Amazing Day! Best Arts and Crafts Fair I have ever been to. Beautiful location, nice people and fun activities for All ages. Put it on your Must Go List Every Year!!",
   "Beautiful little park with a small gazebo"
  ]
 },
 {
  "name": "Battleship Cove",
  "address": "5 Water St, Fall River, MA 02721, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3069a5ac-9333-11ea-96d4-14b31f159f22.png",
  "tags": [
   "history",
   "kids",
   "eat",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12073325728111409472",
  "source": "GoogleMaps",
  "reviews": [
   "Such a great way to teach youngsters about a part of our history that we never want repeated, but must also never forget. There is a lot to see here, so give yourself at least 3 hours, not including lunch.  I also suggest watching some YouTube videos about the USS Massachusetts before coming.  You'll appreciate the exhibits a lot more that way.",
   "We love this place. We brought our youngest son here for his birthday because of his fascination with ships and subs. This is a good place to take your kids for an adventure and at the same time appreciate history and let them know the bravery of our heroes who gave up their lives for our freedom. We got to see where they eat or sleep and if you want to spend the night there too and experience how they sleep on their tiny beds. We got to experience how uncomfortable they live in such tight space and still have the courage and dedication to serve the country which teaches us also to be grateful for every little things we have in their expense costing their lives.",
   "Outstanding! Definitely a must see if you are ever in the area. The ships are massive but all the donated memorabilia really made my visit one to remember. Plan to spend some time there because you will get lost in all the things to explore.",
   "This museum is awesome. The exhibits are informative and the ships are incredible. You can go most anywhere on the ships. I've done the sleepover too. That is really fun. Highly recommend you check this place out.",
   "As a US NAVY VETERAN I was thoroughly impressed. My 15 year old grandson was full of questions and I was honored to have the answers. We did not have time to visit all the ships but will return next year to finish where we left off! KUDOS to all who make this history stay alive!!"
  ]
 },
 {
  "name": "Snake Den State Park",
  "address": "2321 Hartford Ave, Johnston, RI 02919, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/30b27086-9333-11ea-aa16-14b31f159f22.png",
  "tags": [
   "walking",
   "nature",
   "nature",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3214652592350701124",
  "source": "GoogleMaps",
  "reviews": [
   "I'm just confused by this park and its trails. It has potential, but the trails are SO poorly marked and not maintained, it's nearly impossible not to get lost. Additionally, there is the element of hunting?! There's a sign at the trail entrance (which I have never seen at a state park) warning hikers that they must wear orange during certain parts of the year. You'd have no way of knowing this prior to going. Also, while you're on the trails, there are hunting signs that imply that you are actually walking in the middle of where people could be hunting. They say \"No hunting beyond this point\", and you're clearly in the hunting area as opposed to the not hunting area. There are also signs that say \"Bow and arrow hunting only\" right next to the trail! Bizarre. It's really too bad because it's a vast area that has great hiking potential.",
   "I visited here 3 weeks ago and I traveled about half an hour to just not be able to go into the park because of hunting season so without a vest or bright color jackets you cannot access and if you do you most likely will be shot or God forbid your dog gets shot by some idiot that needs bright colors to distinguish a deer from a dog or person! So be aware of this.",
   "Great place to go near Providence to get out in Nature. Remember to wear orange during hunting season. Sort of easy to get lost, but there's a trail map if you look on AllTrails.",
   "Really nice park to go to, especially in the fall. There’s a multitude of trails to choose from, and none of the ones I’ve walked have been too exerting. I’m looking forward to visiting the tulip farm when I get a chance. From what I understand, they are planning on developing the park a bit more soon. Good place to stroll around in nature and relax.",
   "Nice walk with open areas and wooded areas.  It definitely wasn't the right time of year for tulips, but it was the right time of year for some peaceful walking!"
  ]
 },
 {
  "name": "Warwick City Park - Buttonwoods Beach",
  "address": "Steven O' Connor Blvd, Warwick, RI 02889, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3108f5e6-9333-11ea-8c5f-14b31f159f22.png",
  "tags": [
   "kids",
   "parks",
   "kids",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=11185664625793446306",
  "source": "GoogleMaps",
  "reviews": [
   "One of the few parks in Rhode Island that is just as beautiful during winter as it is at any other point in the year. Very nice, clean beach with a great view of the bay. The surrounding area has a small playground for kids, and dogs are welcome. Good place to come read a book on a nice day.",
   "This is my favourite beach when it comes to little ones.  The water isn't deep, there are no real waves or undertow. My kids always enjoy the periwinkle and hermit crabs. The is plenty of shade in the play ground area.  It's the perfect mix of sun, salt water, shade and activities. There it's usually a lemonade truck in the parking lot too.",
   "Great place to spend the afternoon with family. Enjoy a nice swim while listening to some tunes by Fred Mostly.",
   "Nice park and beach. Lots of cute little crabs -- away from the main beach. Nice paved walking trail.",
   "Beautiful park located in Warwick city. Quiet and secluded in the winter months. Busy and full of life during the summer. Really clean public beach, Restroom during summer months."
  ]
 },
 {
  "name": "Rocky Point State Park",
  "address": "33 Rocky Point Ave, Warwick, RI 02889, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/31609f24-9333-11ea-ba3c-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "walk",
   "free",
   "walk",
   "walking",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=7941084336658624701",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to take the dog or kids. Lots of shoreline access with a nice walking trail. This place used to be a popular amusement park if you didn't know. The rides are long gone but you can still see some remnants of the area as it was when they were there.",
   "GREAT place for a walk, run, etc, with or without the dog (leashed)! Plenty of free parking, terrific views of the Bay, and a fishing area! Bring your lunch and enjoy a relaxing picnic. Fly kites!!",
   "Rocky Point is a wonderful place to walk, picnic or fish. It's clean. A very easy walk along the path. You can bike there also. There is handicapped parking available with a beautiful view of Narragansett Bay.",
   "Love this place. Walking, biking, sitting, or whatever you want. It's all great to do here. I especially like getting Sea Glass here.",
   "They done a wonderful job and parking now at old exit so many cars can fit walking path nice even when busy the dock will be another attraction and be selling chowder and clam cakes again i hear fantastic while keeping open spaces for public AMEN JESUS H CHRIST"
  ]
 },
 {
  "name": "Newport Car Museum",
  "address": "1947 W Main Rd, Portsmouth, RI 02871, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/31ad35ca-9333-11ea-9fc5-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "kids",
   "art",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7824185907926766227",
  "source": "GoogleMaps",
  "reviews": [
   "We planned a trip to Rhode Island just to visit Newport Car Museum! We visited during the Hoods Up Weekend event for my birthday. They do the hoods up event once a month and it was DEFINITELY worth the 3 hour drive to come and see! They had quite an array of cars to view as well as many employees that were always readily available, should you wish to ask any questions about any car. They were quite knowledgeable and I enjoyed talking with them. At the end of the day, it doesn't matter if you are a Chevy person or a Ford person. People come here together to unite as one and put their differences aside to truly enjoy all the beauty bestowed upon us in the car world. There is a nice sitting area as well and a small area to enjoy a coffee and reading materials. We did notice a room down a hallway that had some inventory inside that was not on display. There is also a car simulation room for adults and kids. There are staff to help everyone who wishes to try their hand at a race. It was a really nice visit and also were able to purchase many things in the Newport Car Museum gift shop. Overall, we really enjoyed their Ford collection and were quite grateful we were able to attend the hoods up weekend event and strongly encourage others to also consider visiting this museum.",
   "We were headed to Rhode Island to stop at a couple of our favorite shopping spots, and I wanted to do something fun while we were there...I found this car museum online and it looked interesting. My husband and I aren't really into cars, but we do appreciate nice cars and enjoy history on almost any subject. We really enjoyed this museum! The cars were beautiful and beautifully maintained. We just watched Ford vs Ferrari, so I liked the Ford Shelby exhibit because I knew a little something about it. We happened to end up there on \"hoods up\" weekend, which was definitely a bonus. If we went again I would definitely aim to go when the hoods are up. There were art deco chairs scattered around and it added to the style of the museum. The ticket price was $18 an adult and $15 for military (my husband is a vet but we didn't ask if that counted for military pricing and we paid standard admission). Included in the admission fee is a turn on the car simulator (Forza) which I seriously suck at but it was still fun! Overall it was an enjoyable afternoon and definitely worth visiting.",
   "I'm a local, and I have no idea why I put off visiting this museum for so long. I'm a big fan of cars, and they have a spectacular collection. There's a little bit of everything, from Modern Exotics to 50s Classics. The museum is very well laid-out, with great R and video presentations along with the cars. The staff is very friendly and helpful, I really enjoyed chatting with them about some of the different vehicles.\n\nI went with my father and younger brother, I had bought them tickets for Christmas. We had an excellent time, and I highly recommend it!",
   "Great selection of cars! Up close and personal, videos, simulator room. This was not on my agenda for the day, but I'm glad I went in. I really enjoyed it. Match box cars come to life. They have a dedicated room to  Mustangs. They even have chairs and couches that are 60s era.",
   "This was a fantastic place to go if you love cars. Extremely friendly staff that make you feel welcome for sure. I think you can have parties there and that would be a very good and different option.  A must go."
  ]
 },
 {
  "name": "Blackstone River State Park",
  "address": "Lower River Rd, Lincoln, RI 02865, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/31f6ee68-9333-11ea-bf0f-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=5865893365018821381",
  "source": "GoogleMaps",
  "reviews": [
   "Wow.. such a nice state park.. peaceful and beautiful.. you can do cycling, running, etc..worth going there. Nice fall colors view. They have air pressure machine available in the park. I saw kayak boats also. It is just an hour drive from Burlington. So many close by stores available.",
   "It's a really great Park if you want to go for a walk and be out in nature.",
   "Enjoyable anytime of the year.  Great bike and walking path and the scenery is amazing.",
   "Great place for jogging, cycling or brisk walk. It's calm place to enjoy nature's beauty. Be it fall colors or lush green trees.",
   "Rode bikes on the trail & had a great time! There was a lot of beautiful scenery including a waterfall. Very tranquil and relaxing."
  ]
 },
 {
  "name": "Los Andes",
  "address": "903 Chalkstone Ave, Providence, RI 02908, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/325bf606-9333-11ea-9671-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "walk",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=912810895683306085",
  "source": "GoogleMaps",
  "reviews": [
   "Came upon this charming restaurant by chance and apparently chance was on our side. The restaurant was super busy, which is always a good sign. The ambiance is very authentic and really nice. When we finally sat down and saw the menu, wow such great dishes to choose from. Loved the selection. The food was fantastic and the prices were shockingly inexpensive for the portions and high quality of the dishes. The employees are very friendly and helpful. Truly loved this restaurant and highly recommend it.",
   "Everything from start to finish was absolutely stellar. The decor, the service, the atmosphere, everything was exactly as we had pictured it when we imagined a perfect romantic dinner for valentine's day. We started with the cocktail that was garnished with a grey goose infused strawberry dipped in chocolate, our potato based appetizer with the avocado puree and chicken was phenomenal as well. When our entrees came we were surprised at the amount of food they give you, the portions are large enough to take home for leftovers the next day. Everything we ordered tasted so wonderful and had such a beautiful balance. At one point the owner came to check on our table and he was so kind and personable. It is very clear he puts a lot of love into this restaurant, and we are ecstatic to return soon to try another delicious entree. Visiting Los Andes for dinner was the best decision we could have made for ourselves. If anyone is wondering if it's a good place to try and have never been, do it. You will not be disappointed.",
   "Very good! Service was excellent attention to detail. Food was fresh and cooked perfectly. The taste was out of this world! Definitely a gem and a must try. Extremely busy so book ahead. One more thing the atmosphere was warm and inviting with a saltwater tank that separates the dining room and the bar as you walk in!",
   "Amazing food!  Very authentic!  I travel the world as a crew member for an airline and this is some of the best food you will find. I ate there recently and asked about a certain spicy chili sauce I liked from Lima, Peru and the Owner took me to the kitchen and showed me how to make the sauce.   It just shows the passion for excellence and impeccable service they have.  Casually classy and never pretentious.  Do yourself a favor if you are ever in the Providence area, and try this place!  You should make reservations as it is often very busy.   Can’t wait to return when I am next in town!",
   "We loved this often recommended restaurant. I had made us a late reservation for Valentine's Day but hoped if we arrived early, we might get a seat...no luck. But we did discover the back bar and there we found seats and the great service from Brittany. The apps, entries, drinks and dessert we're fantastic!"
  ]
 },
 {
  "name": "Gracie's",
  "address": "194 Washington St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/32b3af92-9333-11ea-b46b-14b31f159f22.png",
  "tags": [
   "food",
   "cheap",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=215172440587577612",
  "source": "GoogleMaps",
  "reviews": [
   "One of our favorite places in pvdc. Excellent service, well thought out menu and innovative flavors. The only downside is the high level of noise and our inability (a table of three people) to hear each other without having to shout. \nCongratulations on the James Beard Award nominations! Well deserved.",
   "We drove from Boston to Providence to try Gracie's during restaurant week( which they are extending all month) and we were not disappointed. \nPulled up decided to valet, surprise! Valet is complimentary!\nOnce seated, the decor is tasteful and modern -- fine dining with a 2020 edge and a good wave of energy. \nThe 3 course meal was $34.95 each and everything tasted wonderful. Tasty bread, carrot-ginger gazpacho, tender rich gnocchi, fresh beets straight from a local farm, a lemon-lime palate refresher before the main course and then crispy, but moist and fresh, flavorful swordfish.\nAll that followed by dessert that tasted and looked like they have a world-class baker in their kitchen. Did I mention that the cocktails were crafty -- a la bourbon sweet potato blended so smoothly? YES, a sweet potato bourbon cocktail.\nAll of that and 5-Star, but not snobby, courteous and timely service.  We enjoyed every moment and highly recommend this restaurant to EVERYONE reading this review.  We are foodies and go out every Wednesday to a different restaurant, so trust me, we know a good restaurant or two.\nGo to Gracie's and enjoy yourself, on us. You're welcome!",
   "Absolutely outstanding food, so many flavors. The staff was remarkable, attentive, and had plenty of knowledge of the food and menu. The atmosphere was exquisite. Very high end. I went during restaurant month and had a whole 3 course meal for under $40 and split it and was a decent amount of food. If you're ever in town check this place out 4 sure.",
   "Great dining experience all in all. Service was truly impeccable- the cheese boards, wine and dessert were absolutely amazing- my one request is for the sweet potato entree that they add something like another veggie to accompany it- as I was a tad underwhelmed by the entree when I ordered it being that it was 25$ for a mere cut up sweet potato with some garnishes. My husband had the cod dish and it was incredible and very similar in price!",
   "We went with a large group (10 people) and did the tasting menu with the wine pairing. It is not cheap and one of those outing you file under experience and not just dinner. The staff was very good and attentive and while the whole table did the tasting menu, the kitchen was able to accommodate multiple changes (no seafood, vegetarian, pescetarian). All used seasonal ingredients really well. Some dishes were better than others. No dish was an outright flop. The wine pairings were a little disappointing but that may depend on your palette. We had many wines that tended toward the sweet side. Overall, I'm glad I ate here and I'm glad a restaurant of this quality is thriving in Providence but that 7 course menu with wine is a steep cost with gratuity. Go for a very very special occasion but becoming a 'regular' would break my budget."
  ]
 },
 {
  "name": "nicks on broadway",
  "address": "500 Broadway, Providence, RI 02909, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/32f880dc-9333-11ea-86a5-14b31f159f22.png",
  "tags": [
   "food",
   "kids",
   "food",
   "walk",
   "tasting",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=956260713264495629",
  "source": "GoogleMaps",
  "reviews": [
   "Food was amazing. We like to try new places and this was great.  The only things keeping us from going back would be the prices. Service was amazing.",
   "Amazing Breakfast.   Really top notch restaurant.   Very busy and had to wait a while but worth it.  Highly recommended.",
   "Food was good, restaurant is fairly small. Nice ambiance & we enjoyed being able to see the kitchen work. Not ideal for a large party and not the best for kids. We had to wait quite a while for a table for 4, seems best for parties of two.",
   "First time going to Nicks on Broadway. Absolutely loved every part of it, the atmosphere when you walk in is dimly lit and modern with a chill vibe. The staff was very welcoming. We got a bottle of champagne (celebrating birthdays) that our server recommended which was nice. We decided to go with the chefs tasting menu, which is a 4 course meal left in the chefs hands to decide what he will be making for us. The menu changes based on what they can get for the freshest seafood, produce, and meats. They brought out \"small bites\" between some of the courses, and every course was amazing. The surprise made it fun also. My favorite course was chicken with fresh greens risotto and the house made foccacia was very good as well. Had some cool cocktails. We will be going back for the tasting menu again!",
   "1st time here. Been trying forever to get here. What a mistake....... waiting so long. The food and service are amazing.  Don't bother ordering off the menu. Get the chef's tasting. 7 course if you can. Very nice atmosphere. You can actually talk and hear the other person you're with. Great place for a date night. We went on a Thursday 6pm. Very small place but got right in. Can't say enough good things about this place. Go see for yourself. I'd be amazed if you don't like it."
  ]
 },
 {
  "name": "Cafe Nuovo",
  "address": "One Citizens Plaza, Providence, RI 02903, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/33484eb8-9333-11ea-9121-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "free",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=15059575833814384207",
  "source": "GoogleMaps",
  "reviews": [
   "Everything was great- somewhat difficult to find tucked away in the building, but well worth it. Helpful staff and waiter with great recommendations, and fun mixed drinks from the bar. Not a huge or complex menu but still sounds it difficult to choose. From appetizers to dessert, nothing disappointed.",
   "The food was amazing.  It was a 5! Beautiful  place to take a date or even purpose... or just come and eat !\nThe deserts  are everything you could ask for.\nGives you a greater appreciation for Providence.",
   "Cafe Nuovo is an absolute gem of providence cuisine! The staff is wonderful and attentive, the food is exquisite, and the wine selection is vast! I could not recommend a more wonderful dining experience. Over the past 4 years cafe nuovo has become a tradition for the wife and I when celebrating any event.",
   "Overall an okay experience! When our waiter greeted us he went right into asking us about water options which we didn't hear him correctly on. Regular water would've been just fine, but we got charged $8 for still water that we didn't even touch. Refills are not free too, which we were surprised about. Other fine dining restaurants do have free refills. Once our food was placed in front our actual waiter never came around few min later to ask if everything was good/need anything else. We had to ask other servers to call over our server few times.",
   "Have been to Cafe Nuovo several times in the past and everything has been consistently great.\n\nThe interior is very clean, comfortable, and upscale. \n\nThe service in this establishment is fantastic and our server was always checking on us.\n\nStarted with a delicious bowl of their tomato soup. \nI had the filet mignon and mashed potatoes and the co reviewer had Spaetzle tenderloin.  Both meals were excellent!\n\nFirst time I have ever had a \"Potato Gaufrette\"!\n\nThe co reviewer's Manhattans were also great and very \"smooth\".  She also claims this was the best cappuccino in Providence!\n\nWe both had dessert and do not regret the calories!  Creme brulee for me and the lemon cheesecake for the co reviewer. \n\nDefinitely will be back!"
  ]
 },
 {
  "name": "Circe Restaurant & Bar - Providence",
  "address": "50 Weybosset St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/33ad2b42-9333-11ea-b3a2-14b31f159f22.png",
  "tags": [
   "creative",
   "knowledgeable",
   "food",
   "delicious",
   "delicious",
   "family",
   "knowledgeable",
   "family",
   "food",
   "tasting",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=39241677599734663",
  "source": "GoogleMaps",
  "reviews": [
   "The food was delicious and there were a number of creative menu items in addition to traditional fare.  We had the deviled eggs and short ribs appetizers.  All very good. They have a good selection of wines and fun cocktails. A nice thing about the restaurant is that they are open for dinner earlier than most.  It is very popular - we were able to slip in without reservations at 4:30 but by 6:00 the place was packed.  The service was very prompt and the server knowledgeable about the menu items and the specials.",
   "A large group of us came here after my best friend’s courthouse wedding, just down the street. It was close to the end of lunch service and the chef offered us the dinner menu in addition. The lunch menu looked amazing and everything was delicious—highly recommended the crab cakes.\nWe even got a complimentary champagne toast from the staff. We will never forget it!",
   "What a gem in the financial district of Downtown Providence! I’ve passed by many times bu have never been in before. A college and I decided to try it out for lunch after reviewing the menu online. We both had a difficult time picking a lunch item everything sounded so good. I went with the meatloaf and my college had the Italian burger. The staff greeted us warmly when we arrived and the service was excellent. Our meals came out in a very reasonable amount of time looking delicious. Let’s just say by the time we were done the dishwasher didn’t have to work too hard. The place is very cool and very cozy. I liked that the kitchen is open to the dining area. We will definitely return and tell our friends and family.",
   "Overall a good dining experience in Providence. It's got great food, really knowledgeable sommeliers! I highly recommend for family dinners, date night and work dinners.",
   "The food was phenomenal. I tried a charcuterie board, short rib risotto balls, and the 2 way duck. All were great.\n\nThe special cocktail menu were also very well done. I recommend the Manhattan, which is sweeter than usual and the key lime pie martini from the dessert menu. I tried the busted nut, which was served in a coconut, but it was a bit watery tasting to me, likely from the coconut.\n\nAfter 10pm, they had a DJ and a violinist, which was one of the coolest things I'd ever seen. He played violin to the music the DJ was playing.\n\nThey also serve food until midnight, which is a big deal around this area. They also have valet so you don't have to deal with finding parking."
  ]
 },
 {
  "name": "The Capital Grille - Curbside Takeout & Delivery",
  "address": "10 Memorial Blvd Ste 101, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/341cbb24-9333-11ea-9ece-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3284980523430986184",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food & service... Would have been 5 stars but for some reason even though the restaurant was mostly empty we we're sat in the back corner by the water station. My girlfriend and i were both dressed professionally...maybe it's just sop for early arrivals but it would have been nice to have a table with a view for our $200+ meal for two",
   "Fabulous!! Calamari, Steak, chicken risotto, truffle fries, soy glazed Brussels (the BEST EVER!) and cheesecake to top it all off! Absolutely Amazing! Great location in downtown Providence on the river. Service was the best!, food was the best! We're definitely going to return in the summer to enjoy Capital Grille and downtown Providence! 👍",
   "Overall this was a nice dining experience. A nice ambiance in the building which they took over after Ruth's Chris closed down.\n\nThe service is top notch. The waitress was more than attentive. The place looks nice and is laid out well. The menue was exotic and intriguing. I do recommend the place highly.\n\n4 stars because my steak was overcooked and I didn't expect this since they put Ruth's Chris out of business but Ruth's never overcooked my steak. Still a great place to dine.",
   "This place was awesome. Atmosphere was good. Food menu was good. Seating section was clean and comfortable.",
   "Food was great. The guy serving us though was incredibly rude. It was very busy, so I can understand getting frustrated. But if you're paying $200+ for a meal, I do not think it's too much to ask to not be given an attitude. Will not be going back to this location"
  ]
 },
 {
  "name": "Camille's",
  "address": "71 Bradford St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/34611570-9333-11ea-8b24-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12316991772028286435",
  "source": "GoogleMaps",
  "reviews": [
   "Best dining experience I've had in the last few years. Food was delicious, servers were attentive and the restaurant was very nice. I will definitely be coming back.",
   "Literally everything was amazing! Tony our waiter awesome! Sangria they have all the time and phenomenal!",
   "Seafood was not that fresh.  Scallops were the size of a quarter and over cooked.  I had a Seafood dish that had one tough shrimp and one overcooked, quarter-sized scallop...See below.  Although the host or manager told me they were real, the potatoes tasted like instant.  The scallop dish was not much better.  For the expense, the food was not worth the money.  The best part of the meal was the wine.  The server let me taste 3, and the one I decided on was the best I've ever had.  The restaurant's ambiance is relaxing and beautiful.",
   "Very Refined Dining experience, our server was like our personal Butler! The Food...simply to die for ! We (3) enjoyed apps, salads, dinners, desert and Coffee , not to mention Cocktails and a bottle of High End Wine. Every single item was without Fault! We celebrated like Kings in a Castle !!",
   "Formal Italian restaurant with a variety of pastas and other plates. Very recommended for dates or special occasions."
  ]
 },
 {
  "name": "Andino's Italian Restaurant",
  "address": "171 Atwells Ave, Providence, RI 02903, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/34a413e6-9333-11ea-a7b3-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "music",
   "family",
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12307150680444618960",
  "source": "GoogleMaps",
  "reviews": [
   "This place was amazing! The atmosphere, the food, and the service was a 10 all the way!! We had a great waiter named Phil who really made the experience a great and memorable one. The food was much better than I ever imagined starting with the stuffed mushroom caps!! Great lighting and  relaxing aura, Custom drinks too!! A++",
   "Once again the best Italian food on the east coast!!! Plus last night we got take out and in a separate bag was a roll of toilet paper! At first I was surprised and kind of like what!!! But then after thinking I was grateful and amazed all in one,,,,, what a wired thing to find but a very nice thought!!! Thank you andinos ! Can’t wait to get to do sit down ASAP so I can tip mom 100 dollars we love her!!!!!",
   "One of my favorites on the HILL! They have a gorgeous back patio with plants and shrubs and flowers. Great Frank Sinatra music. Food is amazing and the summer sangria selection and Martini selection is like nothing I've ever seen! If you're on the hill you need to make this a destination.",
   "My wife and I have been to many restaurants in the past 20 years. Yesterday, we were fortunate that Andino was doing take out during these difficult times. We got the chicken parm and it was the best I have ever had. Usually, I would not eat a portion that large, but it was so good I could not help myself.  The bar and restaurant were beautiful. I got to meet the owner and he was extremely nice and he showed me the wonderful outdoor patio. He informed me he has a valet parking across the street. I cannot wait to take my family there often this summer. I am still thinking about the fantastic meal I had yesterday. Even though, five stars are the limit it deserves 10.\n-James McMahon",
   "THANK YOU ANDINOS! Much love for making my birthday extra special turning 60! 💜 My twin brother was smiling from heaven and most likely enjoyed your delicious food in his hay day before he died...he spent a lot of time on the Hill. Newport is my husband's and mine home away from home. Casual and fine dining BUT!...by far your restaurant,  it's ambiance, and YOUR FOOD surpasses them all! Thank you and Mary with all my heart! God bless and stay well! Love Ann Lancellotti 🙋‍♀️💜😘"
  ]
 },
 {
  "name": "Julian's",
  "address": "318 Broadway, Providence, RI 02909, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/34f5b26c-9333-11ea-8ac6-14b31f159f22.png",
  "tags": [
   "drink",
   "delicious",
   "unique",
   "delicious",
   "food",
   "creative",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2249141163811476824",
  "source": "GoogleMaps",
  "reviews": [
   "I was planning to go to Kitchen but it was unexpectedly closed... i was starving on such a chilly morning so I went to Julian’s. Oh my goodness! Julian’s is good in its own way! Love the Benedict! Love the super thick cut loaf! Look at the French toast!!! You can order half size. The dishes are BIG! The staff were super nice! And they served Rhode Island special drink coffee milk (though I did not like it...)!!! I will definitely back come only for Julian’s!",
   "Breakfast galore! It was so busy on a Friday morning... we only waited 15 minutes or so. The portions are generous here and they have some unique things. We started off with bloody Mary’s which is a must!! It was quite delicious. I got the kimchi bowl which was a great Asian twist but still had the classics like eggs and potatoes. It was very hearty. We also shared half a French toast. That was good too. Love that they let you do half orders like of the Benedict.",
   "Being from  northern Rhode Island I never knew this place existed. Glad I found it yesterday dining out with friends excellent eclectic foods volume up big portions! feel like you're in a familia hang out with people from all different ages and backgrounds. Would definitely go back there again.",
   "Love that they serve brunch during the week! Food and drinks were delicious! Staff was attentive. I've heard good things but this was my first visit and it did not disappoint! Also, the bathroom is cool, I could spend forever looking at everything in there!",
   "A must visit for brunch. Try to come after 1pm or 2pm to skip the line. \n\nThe food was very creative with a ton of options and customizable plates. \n\nBeer geared more towards the sour beer elite with an acomodating list of options for mid grade craft beer lovers.\n\nAwesome spot. Thank you!"
  ]
 },
 {
  "name": "CAV Restaurant",
  "address": "14 Imperial Pl, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/35afb2ee-9333-11ea-b79d-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16846258062553364123",
  "source": "GoogleMaps",
  "reviews": [
   "This was a very fine restaurant, great lighting and seating arrangements. The atmosphere was very unique. Great wine selection. I would say the food over all is an acquired taste. I tried something and it wasn't my cup of tea, but the management was so great I was able to get something else. Overall I highly recommend.",
   "Went for brunch, great atmosphere,  excellent food and drinks. Service just a bit slow but nothing crazy. Also, need better table management,  there were several empty tables while we ate at the bar for over an hour, not a huge deal. Overall luv this place",
   "An interesting restaurant with ambiance that feels like the comfort of sitting at home.. great service and delicious food too!",
   "Nice ambience.  Interesting decor.  Friendly staff and great service.  Dishes were delicious.",
   "The food and atmosphere was terrific! Everything was so great! My only quam was with the size of the croquettes appetizer. It was 5 teaspoon sized croquettes balls. This isn't reflective of any classic croquettes, which are much larger. They were so small that it had the typical affect portrayed in movies of over paying at a nice restaurant for a morsel of food. But our meals were delicious and so were the appetizers."
  ]
 },
 {
  "name": "Enoteca Umberto",
  "address": "256 Atwells Ave, Providence, RI 02903, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/35f91e36-9333-11ea-9a53-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food",
   "family",
   "food",
   "family",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6333903469937038076",
  "source": "GoogleMaps",
  "reviews": [
   "I’ve been waiting for a long time to go here. I called and talked to Umberto, he was very nice and got me scheduled to come in at 5 PM.  He opened the door greeted me like family and seared us.  All the food was amazing, and the winds were great.  It’s not going to dinner, it’s an experience. Umberto makes the night so special because of his amazing personality, warm & inviting. The girls cooking were so polite, his family came in later, little Italian adorable kids sitting behind the counter perfectly behaved.  Most of their food, and the wine  are all imported from different parts of Italy and Sicily.  It’s definitely an experience.  When you’re leaving, and the owner hugs  you just as tight as your own family, any questions?  Go here!",
   "This place is truly authentic Italian! It's even more enjoyable if you understand the language and what's being said by Umberto and his wonderful family! Purely southern Italian cuisine combined with great wines makes for an unbeatable combination!",
   "The single most overrated place I have EVER been. Besides it is a fraud. Wine overpriced. Owner fake. Worse than anything else, food not prepared on site....there is no oven, no cooktop. Food is REHEATED in toaster ovens and induction pans. Limited refrigeration. No fresh cooked items. I suspect food is prepared in another local restaurant and reheated. Food needs to be brought into the restaurant via the BATHROOM, can you believe it? STAY AWAY.",
   "WOW! Just wow. This gem of an Italian restaurant can only fit ~10 people total at a time. You must have a reservation, but if you can get in-- you'll be welcomed with warm, open, Sicilian arms. The owners are an Italian couple who serve up a pre-fixe menu daily and what they've got is what you get (no menu otherwise). Amazing wine pairings from the same región as their family. Such a cozy place. A must try for anyone scoping out the Atwells/Italian scene.",
   "Local favorite! Small restaurant with a warm feeling. Delicious food paired with imported boutique wines. Highly recommend!"
  ]
 },
 {
  "name": "RED FIN Crudo + Kitchen",
  "address": "71 Washington St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/363cb714-9333-11ea-9313-14b31f159f22.png",
  "tags": [
   "food",
   "free",
   "eat",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=12915581900108417286",
  "source": "GoogleMaps",
  "reviews": [
   "Great and easy food. Great staff. I can't remember the cocktail I had... The one with the lemon peel, but I would go back just for this cocktail.\n\nOctopus was my favorite, the waiter also said that it's the restaurants most popular dish. He did not disappoint.\n\nVibe was calm and relaxing on a Wednesday night during the middle of March. Would definitely come back. \n\nOnly bad aide is all the street parking was taken so we had to pay a heft parking fee in the parking garage.",
   "I have an allergy to dairy and gluten which limits what I can eat.  One of the (few) gluten free options comes on a bed of cheese risotto.  I informed the waiter of my allergies and asked  if he could substitute the risotto for something else. He said \"No, I'm sorry I can't.\" I asked if he had rice that I could just order on the side, along with my plate.  He said \"No I'm sorry we can't do that.\" So I ordered the plate, and ate ONLY the meat. Such a waste of money.  After bringing out food, the waiter never even returned to our table to fill water or to check on us.  Luckily the adjacent waiters noticed our empty glasses and filled them up.  This is by far the worst service I've experienced in quite some time.  Red Fin, the world is increasingly becoming more restricted in terms of food intolerance.  If you can't substitute risotto for rice so that a patron can enjoy a plate, I kindly wish you well.  I can honestly say, this is the first time I've had someone draw a hard line at rice...(face palm).",
   "Great first dinner spot in Providence. In a very walkable area and easy to get to. If you're a fan of seafood and/or tapas, I would recommend this place. The octopus, rissoto, and deviled eggs were great to have. The only downsides for this was the wait time to get a table and/or food, and the price is not really equitable to the amount of food you get. Overall, would visit again though.",
   "Restaurant itself is very nice. It's a bit pricey but the quality of the meal that you get is very worthy. Service was excellent. Definitely would recommend and it's a place where you can go once in a while and spoil yourself.",
   "The good parts: \nI got the pork Belly and my wife got the salad and deviled eggs. The pork belly was epic and I will get again. The salad's flavors were delicious. Mike, the bartender was fun to talk to and attentive but not just with us. He took care of everyone equally.\nThe bad parts:\nThe hostess was subpar. We had reservations and showed up 5 minutes early. There wasn't a table available. She offered the worst table to us next to the door even thought she was using as the host check in table.  The chairs were uncomfortable and they need to be replaced."
  ]
 },
 {
  "name": "Mills Tavern",
  "address": "101 N Main St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3683a962-9333-11ea-ac02-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "creative"
  ],
  "link": "https://maps.google.com/?cid=8516141095785758866",
  "source": "GoogleMaps",
  "reviews": [
   "We had a very nicely done halibut and salmon. Wood grilled smoky entrees seem to be their thing. Raw appetizer selection like oysters and clams. Friendly wait staff. Nice place to spend a couple hours. Not a bad walk from the state house.",
   "The bartender was fabulous. Best whiskey sour ever. Dollar raw bar was fun. Then sat at a lovely table by the window and had a fantastic meal. Nick was our server. Always there when you needed something.",
   "We were in the area visiting Brown and a friend told us about Mills Tavern. Very beautiful place. The food was amazing, we had the calamari(a different spin on it), ceviche was surprisingly delightful, oysters(some of the best I’ve had in a long time) and and the tomahawk wagyu(cooked to perfection) with mashed potatoes and asparagus. Service was great. Definitely will be back.",
   "Excellent steakhouse offering expertly prepared seasonal cuisine. While steaks are the stars here, their lamb, venison, and swordfish are equal to the task. The raw bar is outstanding and as fresh as you'll find anywhere. The menu is seasonal and creative, the service top-notch.",
   "Affogato .... for dessert.. and can I just say the mac n cheese is heavenly.... O yeah BEST LAMB CHOPS DOWNTOWN🐑"
  ]
 },
 {
  "name": "Siena",
  "address": "238 Atwells Ave, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/36c47fe6-9333-11ea-9b08-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=474397409430699684",
  "source": "GoogleMaps",
  "reviews": [
   "Quaint Italian place on the edge of Federal Hill. Great presentation, excellent service, and delicious food. They also had a complementary valet service for those struggling to find parking in federal hill (i.e. us!). The octopus and bread pudding were highlights. The only negative was that the price was slightly on the expensive side, so be prepared to spend quite a bit for what you are getting. Overall, would definitely visit again!",
   "This is one of the finer Italian restaurants on Atwell. Great service, lots of laughs and wonderful meals.\nA special night at a special place. Just how good things can be when you have great persons working for you.",
   "Elegant feel and tasty food make this a worth-the-trip dining adventure. I enjoyed the pork chop with pear, and my friends raved over the risotto. The seasonal cocktails are not to be missed! I tasted my friend's \"Fall for Figs\" martini, and it was very nice, like an alcoholic Fig Newton, in the best way. Just go. Valet parking is available; we walked from the Hilton, and it was only 8 minutes at a leisurely stroll.",
   "Kayla our server was awesome, dinner great, dessert not what we expected and to our surprise  management  compensated  us and  that my friend  showed us that Siena is a classy  restaurant.   and yes we will  try another dessert . This is definitely  a restaurant that we will go back to and you my friend should try it if you haven't  already",
   "Went for restaurant week, great choice! I had the bruschetta, salmon and limoncello mousse. Everything was delicious. I loved the risotto that came with the salmon, it had a light lemon and mint flavor. I would recommend anyone to come here for dinner. Can't wait to go back and try more amazing food."
  ]
 },
 {
  "name": "Massimo Ristorante",
  "address": "134 Atwells Ave, Providence, RI 02903, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/370e334c-9333-11ea-9a30-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10267159450644119578",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food and desserts. If you're looking for an awesome Italian restaurant in Federal Hill this is the place to go. Make sure you get a reservation because it can get busy on the weekends. Love the bread they serve and the tomato dipping sauce.\n\nCan't wait to go back.",
   "Great food and lovely atmosphere. Our waitress made great recommendations for wine (we're usually not wine people, but it was wonderful) and dessert (the bread pudding was amazing). The entrees (Gnocchi & ravioli) were solid but probably weakest part of meal",
   "Went to dinner with a colleague. Nice place with fantastic ambience. Food was nice and of good quality. Seafood is fresh and the service bu the waiter that served us was good as well. Definitely recommend this place.",
   "One of the best meals I have ever had. The food is magnificent, cooked perfectly and the portions are generous. The atmosphere is very inviting and the staff outstanding. In particular, we had the extreme pleasure of  having Remi work with us and she is spectacular. Charming, sweet and extremely knowledgeable. She made a great evening perfect.",
   "Friendly staff. I got the spaghetti with meatballs and sausage. The pasta was fresh and perfectly cooked. The meatballs were tender and flavorful. The sausage was somehow tough. Not just a little tough, but petrified. It was presumably cooked in the sauce. I would have thought it impossible to get Italian sausage to come out tough, cooked in this manner. They somehow pulled it off."
  ]
 },
 {
  "name": "Providence Coal Fired Pizza",
  "address": "385 Westminster St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/377338d0-9333-11ea-81b6-14b31f159f22.png",
  "tags": [
   "kids",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7876210609462872882",
  "source": "GoogleMaps",
  "reviews": [
   "I was on a trip to Rhode Island, and this place was recommended to me. I don't like pizza with a crispy crust, so I didn't order pizza. However, many of my companions did and they enjoyed it. I ordered a meatball sub that was served with a cup of tomato soup. The soup was fantastic! It had little balls of mozzarella in there and basil on top and it was really tasty. My meatball sub was pretty good; it had lots of melted mozzarella, and it was nice and crispy, but the meatballs were a little dense. The service was really good, and we were able to get in and out during our 1 hour lunch.",
   "Nice downtown location with plenty of street parking on the weekend. Pizza was good. Went here with my 4 kids and everyone was nice and satisfied when we left. \nGood pizza although a bit pricy.",
   "We order a 2 small pizzas, the size of them were perfect for sharing between 2 people.\n\nThe pesto pizza was a bit disappointing, first of all it has a lot of oil in the pesto making the dough a bit soaky, and the chicken was totally without flavor.\n\nBy the way the Conrad pizza was really good, nice crunch on the dough and the sausage had a great flavor and a perfect combination with the onion and red pepper.\n\nThe price was a good deal with 10$ each pizza.",
   "Will is a fantastic waiter! Rosemary wings & pizza was delicious as usual😊",
   "Being from NYC, I am very picky with Pizza.  This was pretty good but not great.  I personally liked the Margherita more than the pepperoni.  Waiting time was long but the place was crowded so had to expect it.  The waiter at the bar provided good service."
  ]
 },
 {
  "name": "Pane e Vino",
  "address": "365 Atwells Ave, Providence, RI 02903, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/37b46eac-9333-11ea-8a02-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "food",
   "knowledgeable",
   "food",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3614020762992009542",
  "source": "GoogleMaps",
  "reviews": [
   "This restaurant is amazing. I came here for my birthday. The place was packed because it was Valentine’s Day weekend, good thing we made reservations. The food and desserts were delicious such an amazing taste. The service was great and the FREE valet was a plus.  The place is a little small but the atmosphere is great. Will recommend this restaurant to anyone!!",
   "Food and service is wonderful. My second time here. Lobster ravioli is my favorite but tonight I had the special, seafood pasta dish and it was very tasty with Neapolitan pasta, wine and tomato sauce coupled with shrimp and lobster need I say more! Completely mmmmmh worthy. My friend had the pork chops, I'm trying those next. The chops along with the fig is divine. The service is immaculate and the staff is very knowledgeable of the menu and sauces. I look forward to going again.",
   "Great atmosphere and staff. Highly recommend. I walked past this place on Atwells quite often but finally I went in. Do not pass this place up! Great food and drinks. Watch the game at the bar, have a date at the tables, worth the visit for sure.",
   "Extensive Gluten Free Menu \nAttentive Waitstaff \nThey even have gluten free dinner rolls if you ask (they're the best i've ever had) Reminds me of Harry Potter inside. \nWe order the specials. They never disappoint.",
   "Place is great. Food is amazing and service is even better. Our server was the best!"
  ]
 },
 {
  "name": "Cassarino's Restaurant",
  "address": "177 Atwells Ave, Providence, RI 02903, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/37fc761c-9333-11ea-a891-14b31f159f22.png",
  "tags": [
   "food",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13322151483936051546",
  "source": "GoogleMaps",
  "reviews": [
   "Great menu. Excellent traditional Italian cuisine.  Outstanding table service. Our Server was John who did a great job and took very good care of us.  Valet out front.  Very nice wine selection. Love Cassarino's. Highly recommend. We'll be back.",
   "Nice atmosphere, good food and reasonable prices. The customer service was good too. We would definitely go back to this restaurant again.",
   "Delish!!  Great, cozy spot on Atwells. Authentic,  robust flavors. Nice wine list.  Knowledgeable server.  Got right in on a Tues eve but reservations recommended and can easily book online.",
   "I hold Italian food on the hill to a certain standard, this was not up to my standards. The pink pesto sauce was just so over powered with pepper flavor, and the gnocchi were undercooked... my friends veal dish also didn’t impress me",
   "Went here with a large group of people during a recent visit to Rhode Island and had a nice dinner.  We got some appetizer platters to share with the table and everything that was included was very tasty.  I then got the Cassarino and that was really good.  The portion size was huge and I was able to bring half of it home for lunch the next day.  This was a nice dinner in a nice setting on Federal Hill and I will definitely be back the next time I am in Rhode Island."
  ]
 },
 {
  "name": "Providence Oyster Bar",
  "address": "283 Atwells Ave, Providence, RI 02903, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/38514d28-9333-11ea-9def-14b31f159f22.png",
  "tags": [
   "delicious",
   "cheap",
   "food",
   "delicious",
   "knowledgeable",
   "delicious",
   "food",
   "eat",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=6449204603319630702",
  "source": "GoogleMaps",
  "reviews": [
   "If you want to have some amazing food this is the place! Make sure you come for happy hour Tuesday-Sunday 3-6:30, Monday 4-6:30  , $1 oyster and clams , $5 appetizers, with huge portions, the mussels, wings and clam chowder were absolutely delicious!!!!! And all off of happy hour menu , super cheap amazing quality food. The workers are nice, polite, quick and helpful. I want to come back now haha hopefully soon.",
   "Phenomenal little restaurant in Providence's Little Italy district. The seafood is fresh and delicious while the staff is friendly and knowledgeable. I strongly recommend taking advantage of their bottomless mimosas/Bloody Mary as part of their brunch menu, they never leave you with an empty glass! Their desserts are also worth saving room for.",
   "I had a fabulous dinner here with my boyfriend. Neither of us had been before, and we were so happy with every dish. The oysters Rockefeller and the scallop entree in particular were absolutely perfect. The service was on point, and the atmosphere was pleasant and bustling. I look forward to coming back!",
   "Very nice restaurant.  I went on New Years and despite that they were short staffed our waitress did great, very attentive. \n\nThe place was clean and good decor. \n\nThe food was great! Absolutely delicious. I had the avocado toast with smoked salmon and it was amazing. They are also very accommodating. \n\nWe went on New Years and therefore were able to park easily in the street. However, that area is very busy so parking can be challenging. \n\nI will definitely go back to this place again.",
   "This restaurant was amazing!! I’m not from around here and I’m so glad I picked here to eat. The food was phenomenal and so was the music. I would 10/10 recommend!"
  ]
 },
 {
  "name": "The Grange",
  "address": "166 Broadway, Providence, RI 02903, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/38981a58-9333-11ea-86df-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "creative",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=61222631975345457",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent customer service. Really diverse menu options and especially for gluten-free and plant-based. The aesthetics were beautiful it’s a really great place to have ambience and a casual atmosphere.",
   "We had a good time at the Grange. The service was a little bit slow but very nice and helpful. I got scrambled tofu with mushrooms and vegan cheese and I loved it a lot. My husband had biscuits n gravy and was not impressed (it sounded much better than tasted). He recommends it only to those who really love mushrooms. \nVery uncomfortable chairs 🤷🏻‍♀️",
   "Love the vibes. Rustic design with tropical greens. Perfect setup. Food is awesome. Great vegan or vegetarian choices.  Friendly service.",
   "Great atmosphere, layout and design. I am not began, so the menu did not appeal to me as much as other places. However, it's a great place for coffee or a drink. The staff are friendly and accommodating.",
   "Absolutely the best restaurant in Providence, amazing food my meat eating friends don't even mind coming here. The food never feels lacking it's incredibly creative and we'll put together. The drinks are super creative and absolutely delicious."
  ]
 },
 {
  "name": "Al Forno Restaurant",
  "address": "577 S Water St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/38e8be76-9333-11ea-bf73-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=715043712138675933",
  "source": "GoogleMaps",
  "reviews": [
   "Our first time here and we can't wait to come back! Service was swift and sweet! We shared everything and thank goodness because portions were plentiful!",
   "Nice atmosphere and good service, but the food left a lot to be desired. I rarely leave reviews but this place was extremely disappointing. Pizza was so bad to be barely edible. Dessert was good but did not make up for the terrible and way overpriced appetizers and entrees. With so many wonderful restaurants in Providence, I would strongly advise going elsewhere.",
   "Perhaps it was because we were sitting with the owner last night, but judging by what other people say, I don't think so. This food was great. The quality is exceptional. \n\nThe margherita pizza is possibly the best I've ever had, and it's different than any one I've ever had before. We ended up with several things at our table, lamb, the duck pasta, short ribs, the octopus salad, mashed potatoes, Romanesco, Caesar salad... It was all delicious. \n\nI'm not much of a dessert person, but the desserts were fantastic. I like that you order your dessert when you order your main course because the desserts are cooked to order. The cookies are baked to order. Everything is done for you that night when you order. Fantastic. Yeah.",
   "I went here by myself and I must say I was very pleased. I sat at the bar upstairs and made friends with other travelers. \nThe food was amazing.  I also tried their grilled pizza and I was impressed with how thin the crust was.  Highly recommend.  And Kyle the bartender was very professional and prompt with serving.",
   "We love Al Forno. We had our wedding reception there 17 years ago, and it has just got better with time. We return every year for our anniversary celebration. The wine list is phenomenal, the food is the best in the state, and the service is immaculate. Don't forget to order your dessert when you order your entree. Enjoy!"
  ]
 },
 {
  "name": "East Side Pockets",
  "address": "278 Thayer St, Providence, RI 02906, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/39466ff6-9333-11ea-acc2-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10579205009926965803",
  "source": "GoogleMaps",
  "reviews": [
   "I stopped in here for dinner on a Saturday evening while visiting Providence. It was around 6:30pm and parking in the area was really hard to find. We ended up parking a few streets over and walked over. The place was very busy but they went through the line quickly. I got the gyro and chicken wrap with all the toppings and it was very good. The amount of meat I got for the price was impressive and it was all well cooked and seasoned. There is some seating inside but it seems that most take their food to go. I'd definitely recommend trying out this place.",
   "One of the best falafel places around Providence and Boston area! It more of a take out place than a sit down place. Owner and staffs are very friendly!",
   "We've been eating at East Side Pockets for years. The food is delicious.  You know it's really good when you always see a line in there. The place is small with some tables and benches inside, plus in the nice weather you can sit outside. Definitely a highly recommended place.",
   "Love the Place overall but tried it yesterday (4/10/20) and was extremely disappointed. Portion size twice as small as it used to be ( I get that it’s not easy times but at least they have to set expectations).  For example, all the places I tried in the past couple of weeks make as big portions if not bigger. FYI I’m trying to support local businesses",
   "Good choice for Vegans! Thanks for the Valentines’s day special heart falafel.  Try the homemade Sweets."
  ]
 },
 {
  "name": "Luxe Burger Bar",
  "address": "5 Memorial Blvd, Providence, RI 02903, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/398cdcc6-9333-11ea-b2f1-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "cheap",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15442115743478603961",
  "source": "GoogleMaps",
  "reviews": [
   "I absolutely love this place. Where else on earth Can you create your own burger with so many options? I prefer The grilled cheese bun every time I go there with different variations of my favorite burger. The loaded fries are awesome. Staff is always friendly.",
   "The food was delicious, but the service was slow with a very short staff team. Expect this if you go there on weeknights. Good ambiance with low level lighting, great for a low-key meal or date. Their vegan/veggie burger is pretty good, and their Build Your Own Burger menu has many options.",
   "Let's get one thing clear: the food is great. The main draw of this burger bar is the build your own burger option. Opening the menu, you're welcomed with option after option of buns, meats, toppings and sauces. A plethora of drinks are available including milkshakes and draft beers. The burger I got was full of flavor, well cooked and delicious. I'll be coming back here soon.",
   "First time here and we loved it!! The burgers ate absolutely amazingly good!! Not cheap but not expensive either for luxury burgers. Server was really good to us and very knowledgeable about the menu.",
   "I can't post a review without giving at least 1 star. I give none. The restaurant was empty except for 3 people. Seating was still an issue for me and my 6' 7\" friend. 25 minute wait for food. Burger smelled like moldy rag. Then waited 25 additional minutes for the milkshake that was ordered. Was served 5 oz in a to go cup. Questioned what would appear to be the manager, with his air of importance, about the portion size. No response but a contemptuous look. Very capable young lady removed the milk(shake) from the bill and apologized.To that young lady: you did well and I am sorry you didn't receive the tip that I left. I will however leave you one here. Find another job, you are smarter than your supervisor and deserve better than to be subject to an incompetent..."
  ]
 },
 {
  "name": "Harry's Bar & Burger",
  "address": "121 N Main St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/39d863d0-9333-11ea-a209-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=7191915480764647829",
  "source": "GoogleMaps",
  "reviews": [
   "Ask for what they have on draft, there’s always more.\n\nWe were shocked at the pricing, for PVD we expected far more for an artisan style burger place. Beers were great, atmosphere was fine.\n\nWe weren’t into the onion things, too mushy but you HAVE to order the cauliflower bites, there was amazing. We ordered the the pulled pork and pastrami sliders, we wanted to try them all honestly.\n\nWe liked the place so much (and that they had old speckled hen on tap) we came back twice in one day!",
   "As always did not disappoint, great selection of beer and food. Love the salt and pepper fries",
   "Very good craft beers. The burgers (served by two -or three-) were very tasty. Not expensive.",
   "Fabulous meal... Burgers with cheese bacon onion rings etc. Sweat potatoes, classic ones. Beer, cider. And half price from 3 to 5PM. Nothing to add.",
   "I LOVE THIS PLACE. Their drinks, and staff, and burgers and fries are so amazing and addicting. I love their alcoholic s'mores milkshake and the bartenders are usually great. Good place to go alone or with a group of people, very shareable plates. I'm just drooling thinking about it now."
  ]
 },
 {
  "name": "Vinya Test Kitchen",
  "address": "225 Westminster St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3a15e20c-9333-11ea-b3dc-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "tasting",
   "food",
   "food",
   "affordable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11388542701072605529",
  "source": "GoogleMaps",
  "reviews": [
   "Very small intimate place with excellent food and service.  The pictures say it all in regard to the food. The owner of the restaurant takes care of the customers with undivided attention.  You will be happy with this place if you are looking for inspired original creations.",
   "My boyfriend and I just experienced the 6 course meal tonight and it was a treat! I loved the experience and everything tasted great! Owner has great communication! And we loved how it was all family working together.",
   "We called ahead on a Saturday night for a 4 course tasting menu. The restaurant is very intimate where one can see the chefs at work. The food was excellent: the high points of our meal was mahi mahi first course that was incredibly tender and a scallops main course which was cooked perfectly. The price we paid was 60 for the 4 course meal. \n\nThere is a wine shop next door, but you can bring any wine or booze you like.",
   "Should have a line out the door. Byob, affordable high-end food. Been 3 times, and all plates gave been great. A must try.",
   "Amazing food with an intimate ambiance"
  ]
 },
 {
  "name": "Joe Marzilli's Old Canteen Italian Restaurant",
  "address": "120 Atwells Ave, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3a5b016e-9333-11ea-b91f-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "walk",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18035882636867941547",
  "source": "GoogleMaps",
  "reviews": [
   "Very reasonably priced for lunch. We enjoyed the lunch special which comes with soup and jello or ice cream. Chicken parm was of good quality. Valet parking is a nice touch in the area. Family friendly and very busy for an early lunch on a Saturday",
   "Fantastic food! We went on a weekend (I would highly recommend a reservation unless you are eating at 3pm) and were pleasantly surprised. Real Italian food served in a way that makes you feel like you're at grandmas. They offer a 4 course meal for $2 extra on your entree - bread, salad or soup, your chosen entree, and ice cream or jello. This is the kind of restaurant I remember going to as a kid (I'm only 23) and I wish more places were still like this. I got the veal piccata and oh my I wanted to swim in that lemon butter sauce.",
   "The best of the best in Providence’s Federal Hill.. Italian to a tee. The best sauce, bread, spumoni, soup.  You can have a 7 course meal starting at $20. And up..\nThe setting is elegant, though you can bring a family.. Pink is the color with elegant cloths and napkins.. Staff is professionally dressed and been there forever .. Valet parking.. Reservations suggested on weekends.. Fine to walk in before 5. One of the oldest restaurants on the Hill.",
   "One of the most exclusive, classiest & exquisite Italian restaurants available in New England.\n\nChef Peter is an amazing & a gifted chef. Greeted by class-act maitre d’  David & treated w/ attentive grace. I have dined in places all over the United States.. Waiter: Jay is simply one of the best.. extensive knowledge of the menu, refined & classy. \n\nA restaurant of Excellence -my highest recommendation - indeed!",
   "Fantastic service and wonderful food. Had a great time."
  ]
 },
 {
  "name": "north",
  "address": "122 Fountain St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3a9e7348-9333-11ea-bf6c-14b31f159f22.png",
  "tags": [
   "drink",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13898243142439515833",
  "source": "GoogleMaps",
  "reviews": [
   "I've been dying to go to this place for a while and we finally did. Some dishes were great like the fried fish over mint rice and the ceviche others not so much. They change the menu offer so I would go back and see if we get luckier but for this specific experience we weren't impressed.",
   "Unreal dining experience. Flavors were off the charts. Hot Sesame Noodles and Cocoa Coconut Creme stole the show. Can’t wait to make it back to try more!",
   "Super Ramen Sunday Review: $20 for a bowl and a drink (selected from fixed menu of Paloma, beer, wine). Wife got the rose which was deliciously funky in the best way. We ordered the lamb and pork belly ramen bowls. Both broths had a great texture - rich and almost velvety. The noodles (I believe made in house) had that nice chew. As a whole, both bowls were short of being really good. Missing some depth and maybe some spice. The lamb bowl had a mixture of mint that worked well, but the pork bowl missed something similar. The atmosphere was nice and would return to try out items from the regular menu. Heads up, the small space filled up in almost 20 minutes after opening on a Sunday evening.",
   "Best restaurant in town. Menu changes w the season. All the staff genuinely care about making the experience lovely. Y'all never wanna leave. Esp! After having The Tiny Ham Biscuits❤💛😊",
   "Great food, drinks, and atmosphere. I had the mackerel special and the ramen. The mackerel was delicious. The citrus cabbage slaw really complements the strong flavor of the mackerel. The ramen for this month was a vegetable ramen.  The texture of the ramen was perfect. I like that the broth wasn't overly salty. Overall, a good dish. The cocktail was also great."
  ]
 },
 {
  "name": "Bucktown",
  "address": "471 W Fountain St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3ae89bdc-9333-11ea-88ad-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7354291802406065761",
  "source": "GoogleMaps",
  "reviews": [
   "Our kind of comfort foods. Great place that serves classic southern foods. Tasty fried chicken with various side dishes you're gonna love. Good price as well. Very recommended.",
   "Went there for the first time today and I wish I could give this place 5 stars...but I can't. I went with my daughters. One had the chicken biscuit and Mac and cheese and she liked it. My other daughter had egg and cheese sandwich with waffle fries she liked it. I had the chicken and waffles.... waffle was good. The coating on the chicken..very tasty..but unfortunately my chicken wasn't cooked all the way through. I was so disappointed. I wanted to eat but couldn't. Ended up taking one of the pieces to finish cooking it at home. The coleslaw had too much vinegar in it for my liking. I heard so many good things but unfortunately my visit wasn't that great. I don't know if I will try this place again.",
   "Amazing food. Got the fried chicken dinner with potato salad and creamy slaw.  Chicken was fried perfectly. Juicy, crunchy, the breading had a great flavor. The potato salad was different than the types I usually have which are mayo based. These were more mustard based and delicious. Slaw was perfect. Will be going back for sure.",
   "Being born and raised in South Carolina I have definitely had my fair share of southern food, Bucktown definitely nails that classic southern food momma cooked feel and taste. From the first bite of the collard green to the last bite of the chicken biscuits. It has truly been the most enjoyable food experience I've had in the last 7 years while traveling the United States.",
   "Bucktown is absolutely the best example of not judging someone by their size. The flavors and quality are miles above any fried chicken place I've been across the country. So if you step in the door and are scared by how small the place is, be brave, pull up a chair, and make a new friend with the best food in Providence."
  ]
 },
 {
  "name": "Bluefin Grille",
  "address": "1 Orms St, Providence, RI 02904, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3b2f9022-9333-11ea-83f2-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=602174903629740654",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent food and service. What really impressed me was that they have several gluten free options, and they also accommodated my dairy free as well. A lot of their food is also locally sourced so that makes me more likely to return.  Overall, delicious food and great experience.",
   "Food was excellent! Service was fantastic! And the crab and asparagus ravioli was the best I ever had. Perfect honeymoon dinner!!!",
   "Went with my daughter on New Year's Day for the buffet and it was decent. Service was really good. Food was fair.",
   "Marriott Downtown's restaurant - very lively and popular place, great food. Got dinner here as well as breakfast - and I highly recommend the breakfast! The spread was awesome, the food was fresh, and we particularly enjoyed the live cooking of omelettes. Touche!",
   "Very good pritty quick ccx and good hospitality"
  ]
 },
 {
  "name": "Fleming’s Prime Steakhouse & Wine Bar",
  "address": "The Residences Providence, 1 W Exchange St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3b77971c-9333-11ea-9024-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "food",
   "delicious",
   "drink",
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=11816722455341132298",
  "source": "GoogleMaps",
  "reviews": [
   "Celebrated our 33rd wedding anniversary here.  My husband let them know when he made the reservation, and the staff took fantastic care of us.  The table was a generous booth meant for four, decorated with sparkly disks and sported a card signed by the staff.  Terrific food: we shared the 35 ounce steak, and at our request sliced it for us in the kitchen.  The roasted carrots were delicious, as were the asparagus.  I love that the menu gave the calories for most of the dishes.  Staff was attentive and friendly, but not intrusive.  They decanted the wine before we asked.  I would like for the after dinner drink menu to have the prices.  Would love to return sometime.",
   "This was my first time dining here and it was delicious. Everything was perfect! Had a reservation and seated right away. Waitress came right over and took drink order and delivered promptly. The other waitstaff was on- top of it all. They made sure water glasses were always filled and to be cleaned dishes taken off the table. Steak was cooked to perfection and seasoned just right. We will definitely be dining here again.",
   "This place was pretty delicious I won't lie but I've definitely had better service, food was pretty good they definitely spoiled us for a little bit but the warm welcome wore thin. I wasn't really dressed to code wearing a union t-shirt and camouflage but damn was a good patron. In conclusion I would say the corn has the most oniony flavor I've ever tasted in my life. Order at least three things of espresso because the third one will be double-filled 😉",
   "Great wine and ports available. Nice dining room and service, but I've actually had better steak at Ruth's Chris. Nothing on the menu is worth the price they charge. The food was good and it was a nice evening though.",
   "One of taste good restaurant in Providence. Rib eye  steak 🥩 was delicious.  price is $$$$ but not super crazy price than NYC. They have special price for weekday so you can try. Check the photo what menu pics."
  ]
 },
 {
  "name": "Rosmarin",
  "address": "225A Westminster St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3bbc1936-9333-11ea-a6b8-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "tasting",
   "creative",
   "tasting",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9034570133364017902",
  "source": "GoogleMaps",
  "reviews": [
   "the food is absolutely awe-inspiring...every bite brings you several waves of experiences.. while each one is distinct, the combination is surprisingly perfect. true craftmanship...\n\nVery charming and intimate store run by a father and son",
   "Some creative and delicious dishes. We did the six-course tasting and each dish was very good.",
   "Great table services. Fast services by great staff. Everything was well organised. Staff were nice and greeted us very well.",
   "Best quality of ingredients and perfect selection of food choices when you choose the tasting menu. \n\nSpectacular food presentation reminds me of a New York restaurant in RI.",
   "Amazing place. Food was excellent. great services."
  ]
 },
 {
  "name": "Oberlin",
  "address": "186 Union St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3c02bf42-9333-11ea-ba85-14b31f159f22.png",
  "tags": [
   "eat",
   "eat",
   "food",
   "food",
   "walk",
   "art",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=11978056950657855245",
  "source": "GoogleMaps",
  "reviews": [
   "Welcoming, chill atmosphere. I only stepped in because I had a sweet tooth and ended up having a great apple tart with a pretty delicate geranium ice cream. The ladies working let me taste some sherries and even recommended some other places to see and eat while I'm in town.",
   "The one is $16.00, and literally one bite. The food quality is great, but the portion is absurdly small. You will starve even after spending $160.00 on the entrees to buy 10 of this to eat.",
   "This placed earned every one of those stars.  Atmosphere is A+, service is A+, and I drove down from Boston and can safely say the food is better than anything I've there.  The raw Fluke was amazing. Gnocchi was perfect texture and flavor, the squid and carrots were spectacular.  This place should be top of your list.",
   "One of, if not the best spot to sample FRESH, local seafood in a laidback setting. Contemporary plates are art to the eyes, and to the palette. The wine list is absolutely top notch. The great staff will walk you through your odyssey.",
   "Unique menu. Ask to sample the sake selection."
  ]
 },
 {
  "name": "Tallulah's Taqueria",
  "address": "146 Ives St, Providence, RI 02906, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3c4594ae-9333-11ea-8344-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "unique",
   "art",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=8578351662451211838",
  "source": "GoogleMaps",
  "reviews": [
   "Not bad flavor, but they need to get better at managing expectations. Understanding there is shut down. Don't set pick up times and not stick to it or be so far behind it's over an hour waiting on line. Also set a tone for social distancing. This is a hot mess and looks like an issue waiting to happen. No one following any rules.",
   "Love this place their burritos and tacos are amazing and so are the margaritas do not forget to try one of those! Can’t wait until I can go back to dining in and not just take out thank you for doing such a great job especially during the pandemic much appreciated!",
   "This food is pheNOMenal! So good you'll want to eat it fast -- But slow down and enjoy the meal. Several great meats to choose from, an amazing selection of added veggies and condiments come standard, fair prices and excellent service. Small building, big flavor!",
   "We did a quick search online for tacos. This place came up amongst many other options. We read the reviews and realized quickly we needed to check this place out.\n\n As soon as we walked in the door we were warmly greeted to a nice clean Indoor \"taco stand\". (they have way more than tacos) \n\nThe person behind the counter was extremely friendly, helpful and led us on our Mexican Journey. We each got three different tacos, fresh salsa, chips, guacamole and local soda. The prices were perfect considering the quality and quantity. \n\nWe grabbed seats in their outdoor seating area. And within a few minutes the friendly staff brought our plate out. I was expecting tacos to be wrapped up and throw  in the bag, yet I was extremely excited to see their presentation. The tacos look like a work of art on the plate. \n\nEach Taco had a unique taste and was topped with amazingly fresh cilantro. From the first bite to the last bite we enjoyed every morsel of Mexican goodness that was on our plate. \n\nWe will be back for sure to check out every other item on their menu. It is worth the drive from Fall River!",
   "The best Mexican Restaurant in RI. I love this place a lot. You can order anything in their menu and its so delicious and mouth watering."
  ]
 },
 {
  "name": "Capriccio",
  "address": "2 Pine St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3c971088-9333-11ea-99d9-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=854788262249384621",
  "source": "GoogleMaps",
  "reviews": [
   "Went during providence restaurant week, and had a great experience! Really strong options and everyone was quite happy with their meals. Would definitely recommend and go there again",
   "Truly a 5 star dining experience! The best restaurant i have been to in my 35 years alive. Elegant and romantic. Will he back for every occasion possible. Beef Wellington was melt in your mouth. Worth every dollar spent",
   "Had a dinner there with my wife. Both loved it. Food, service, environment. Was not many people there at that time, food was coming out on perfect timing. Prices are reasonable. You want cheap, go to olive garden. Will definitely recommend this place.",
   "The staff was very attentive and friendly , very detailed in requests. The food was better than expected, the presentation was beautiful and the food was smooth and flavorful. Compliments to the chef, the waiters, and all other participating staff. We will be returning! \nFood 10/10.      Staff 10/10.      Ambience 9/10 \n\n10/10 Recommend",
   "It's more flash than substance. The decor, the service (such as a plate that is only intended to hold a napkin), the prices, and it's reputation make you think you're in for something special. Are you? Yes and no. As I said, the service from multiple people makes you feel like a VIP, my veal was perfectly cooked with a delicious sauce (but not everyone was happy with their dishes) but everything takes absolutely forever. Longer than in Europe. It was 45 minutes before the appetizers came out. The entrees ordered at the same time arrived about an hour after that. They weren't terribly busy, a lot of people were working, most of the dishes ordered weren't that complicated. The waiter had quite a personality so that's a plus. But this is really the place to take people you want to impress, esp. those who value price tags over food quality. I mean, the food is pretty good, but if you've been to a lot of top notch places already, you'll notice the overall quality doesn't quite match the price tag"
  ]
 },
 {
  "name": "Trattoria Zooma",
  "address": "245 Atwells Ave, Providence, RI 02903, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3ce27168-9333-11ea-a574-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=16804873863097505113",
  "source": "GoogleMaps",
  "reviews": [
   "Great atmosphere.  Beautiful  furnishings. Attentive staff. Located on the heart of Federal Hill this place has it all.  Perfect place for an upscale evening. Have a dish prepared with the homemade pasta.  Seriously good. Squid ink pasta with shrimp in lemon garlic butter was delightful fresh bright and piping hot. Definitely coming back.",
   "It was a very nice place to visit. Friendly staff and nice comfortable environment. The food was terrific and the valet was easy and convenient, very appreciative of it. A little expensive but for what you get it's 100% worth it. If fine Italian cuisine is your thing, then I'd definitely reccomend going here.",
   "I had never stopped into Zooma before and was pleasantly surprised. The service was great in a really nice setting. My dinner was not great but it was good. Everyone at my table loved their meal,mine wasgood. I will definitely return.",
   "I had previously overlooked this spot in favor of other Italian options.  Sorely regret that. This might be my new fave. Hands down best pasta I have ever had.  Service was spectacular. We will absolutely be back.",
   "I visited when I was super hungry and then when the plate arrived to my table... the plate was big, bigger than the ones you're used to. The portion, the smell, the taste - everything about the pasta and soup and salad superb! \n\nI'll be visiting again."
  ]
 },
 {
  "name": "Chez Pascal & The Wurst Kitchen",
  "address": "960 Hope St, Providence, RI 02906, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3d2213ee-9333-11ea-a01f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10050235499704558870",
  "source": "GoogleMaps",
  "reviews": [
   "Whenever we drive up to Boston we try to stop here. Both sides of the Alsace-Lorraine themed restaurant are fantastic. Stop by the Wurst Kitchen at lunch for some tasty German sausage. Or sup at Chez Pascal's fine French dining room with great wine pairings in the evenings - both options are fresh, pleasant, and delctable!",
   "Absolutely delicious! I have been here few times and every single time I very well satisfied with the food and desserts. The staff is very friendly and the place is cozy.",
   "Have only been once but I can definitely say that the dog & sauerkraut I had there is memorable. Traditional yet funky sauerkraut, some of the best I have ever had. I look forward to visiting again in the future.",
   "At first sight it seems an odd combination; French cuisine with a Wurst kitchen. However, a selection of sausages makes a great starter to share. Then we moved onto the French dishes for the entrees. None in the group had anything but praise for the entire meal. With friendly service, this definitely a restaurant on the list for a return visit.",
   "This place is quaint and so charming.  Every time we've gotten the mussels we've been happy!  Their pickled cucumbers are so deliciously tangy- we wanted more and next time we will ask for a side of them!  The waitress did not check on us much so we never got a chance to ask for more.  They  are offering a variety of jams, including bacon jam that we thought would make great Christmas presents- so we'll be back."
  ]
 },
 {
  "name": "The Dorrance",
  "address": "60 Dorrance St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3d77adcc-9333-11ea-afa3-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=10142613698132131630",
  "source": "GoogleMaps",
  "reviews": [
   "Great service 🙌 great vibe with live jazz in this beautiful old bank building! The food is delicious! I have been into few places that has food this good! Great job to the Chef 👨‍🍳 I will definitely be coming back here many more times!",
   "Just amazing food. A bit pricey (but it’s reasonable if you consider the atmosphere and attention the waitstaff gives you) \nI have gone here before and split a meal between two of us and the baby and they never once acted like we were weird for that. Never classist or snobby. Just a great beautiful restaurant with the best American food and staff. Worth it just to sit inside that gorgeous building in the afternoon.",
   "Wedding reception here. Was absolutely awesome. The atmosphere is picture perfect, food was great, and bartenders were really good. It was a bit warm (I think because the building is older) other than that I highly suggest it. Great service.",
   "Awesome place and the food was great. We went on a live jazz night and had a great time!!",
   "I've been here a couple of time for drinks but tonight we had dinner as well.  The drinks are fun and very tasty.  There was live music without a cover and the ambiance is great.  The building itself is absolutely gorgeous,  the bank-turned-restsurant is great.  Original ceilings, stained glass windows, and bank vault lounge in the back are super cool.  The chef is excellent and the staff are amazing!!!! 100% recommend for drinks or dinner or both."
  ]
 },
 {
  "name": "Federal Taphouse & Kitchen",
  "address": "279 Atwells Ave, Providence, RI 02903, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3dd891dc-9333-11ea-825f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3327640544982813124",
  "source": "GoogleMaps",
  "reviews": [
   "I came here on a Saturday afternoon for some lunch and drinks with friends. We were able to find parking a few streets down and walked over to the restaurant. The inside was pretty busy, they do brunch on Saturdays with bottomless mimosas or bloody Mary's so I could see why they'd be so popular. The waitress Dawn was so friendly and great, she checked in on us a few times and made sure the food was good. The 1/4 chicken was nice and moist and the peas with bacon were a good side. I also thought the prices were really reasonable considering the amount of food. I'd recommend a visit in.",
   "One of my favorite places to visit! The food and drinks are always good. Best atmosphere and the bartenders are always super friendly. Kellie is always so friendly and makes the best drinks. Always making everyone that walks in feeling welcome!",
   "AMAZING! Great drinks and super delicious food!! They have a gluten free menu upon request. I ordered the gluten free nachos with shredded chicken and gluten free chicken wings. The nachos were loaded with toppings and large enough to share. The chicken wings came with 2 dipping sauces. Both were AMAZING!! Fun spot.",
   "My wife and I shared the most amazing app of clams casino,  then we shared a pitcher of their white sangria which was a little drier than I expected but was still refreshing and it was actually quite good. For dinner I had the half chicken with 2 sauces and 2 sides. I was disappointed when it came to the table because I had asked for double pan gravy and they sent a gravy boat with a very nice pan gravy but the other one was a zesty BBQ sauce, which may have been a great sauce in its own right but when you expect one thing and get another it does ruin the experience a bit. The chicken was a little dry as well but did taste quite good especially with the pan gravy.",
   "Visited on a Wednesday for \"Steak & Wine\" night. Wasn't busy. Went for my birthday dinner with 2 adults and one child, so it is kind friendly, but does not have a kid's menu. I ordered the steak and it was cooked the way I like it. Had a Sangria which was pretty good. Will visit again."
  ]
 },
 {
  "name": "Persimmon",
  "address": "99 Hope St, Providence, RI 02906, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3e6234ca-9333-11ea-a511-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1909484818230896059",
  "source": "GoogleMaps",
  "reviews": [
   "My favorite restaurant in Providence. Staff is always so accommodating and makes great recommendations. My friend and I usually share about 5 courses and they never complain if we decide to add another one on mid meal. The food is absolutely amazing. I've never had a bad meal here. Thank you!",
   "I had heard so much about Persimmon, I was very excited to have brunch here with some friends. We were not disappointed. From the minute we walked in to the dining room, we were treated so well. The menu was sophisticated and the presentation so high end. Flavors were spectacular.",
   "I enjoyed my time here. I had a great seasonal cocktail and the food generally was great! Some dishes I liked more than others, and definitely be prepared to order more than 1 thing. This is the type of place where you’ll have a culinary experience, so be prepared to spend a bit more to feel satisfied. It was a great date night place!",
   "Wow. This is a truly special place. Each dish tonight was unique, complex, and beautifully balanced. Persimmon consistently rivals what I consider the best of the best. The Venison Wellington was just sublime!",
   "Cool place good food. Slow on new years eve but that is understandable."
  ]
 },
 {
  "name": "Andreas",
  "address": "268 Thayer St, Providence, RI 02906, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3eb38164-9333-11ea-a772-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11333911708891388311",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful Greek food close to Brown! Great service and delicious dishes, I recommend it to anyone who loves authentic Greek food.",
   "Always enjoy Andreas. Prices have risen but food quality still great. Prep and service were excellent as usual. Quiet when I arrived but soon picked up but no one seemed rattled, customers or staff. No real complaints. Four stars because I hope they continue to strive for greatness  Next time happy to go one higher!",
   "My companion and I are not fond of Greek food, but we were looking for breakfast and they have a large breakfast menu. I had the eggs Benadict and she had the stuffed french toast. Both were good, but nothing exceptional. Service was quick and friendly and the price was reasonable.",
   "Great location. Great food. Excellent and attentive staff. Owner is a real cool guy. Atmosphere is very fancy like. Nice spot for sure to check out on Thayer",
   "Tasty dishes with fast friendly service.  This place is super convenient for a pre Brown hockey game meal."
  ]
 },
 {
  "name": "Rosalina",
  "address": "50 Aborn St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3f0522e2-9333-11ea-a616-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11744597886254514801",
  "source": "GoogleMaps",
  "reviews": [
   "Simple menu with a spin on traditional favorites. The atmosphere is cozy and the servers are knowledgable. Overall better experience than i expected. The pork chop was amazing. I will definitely go back. The prices are very reasonable for a downtown location.",
   "The atmosphere is Lovely and our Hostess and Server were great however my beautiful meal was served ice cold..I had the Ravioli with Meatballs - My Husband and Daughters meal was nice and hot so they were happy...I normally don't return food I just don't go back but my daughter encouraged me to ask for a new plate. Our server gave us a dessert to share with a heartfelt apology...for me I don't think I will return. The Chef that prepared the food for our table had to know they were serving a plate that was not heated...",
   "Get the meatballs, get the pasta with pomodoro, get the chicken parm, get the bread and riccotta served with olive oil. Does it seem like I ordered too much? never! Cause these guys do it right and the atmosphere is really cool here. Best seat for me is the bar, great service and views of the kitchen.",
   "Great food and service! Best polenta I’ve ever had-period! Thanks, Will, for friendly and attentive service. Probably our new go to spot for my wife and me.",
   "We can’t speak highly enough of Rosalina. Having them cater our wedding made all the difference in the world. Lauren was absolutely wonderful. She managed to make our special day that much more amazing thanks to a wonderful selection of foods and outstanding service. We recommend Rosalina to everyone we meet. Thank you, Lauren, Tom, and team!"
  ]
 },
 {
  "name": "The Slow Rhode",
  "address": "425 W Fountain St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3f640bec-9333-11ea-a514-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "kids",
   "food",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=6143910178833170135",
  "source": "GoogleMaps",
  "reviews": [
   "I had dinner and drinks with three friends at Slow Rhode this weekend and it was an awesome experience.   We tried lots of different things and  every dish was great.   The menu may be a little limited but everything on the menu is delicious.   Plus,  it was only $55 per person with a  tip that showed appreciation for the great service. You should absolutely check it out!",
   "Good flavors, good drinks.  The menu had a lot going for it and the chef doesn't hold back on spice especially with the hot fried chicken. My only complaint was that the dishes sometimes felt like mugs of great flavor that just didn't blend flawlessly together",
   "Seems like a neighborhood hangout. Tucked into a building with about 4 places and a pretty small sign that has a S and R on it next to large parking lot. Has a bar with about 10 seats and then a row of tables with seating for about 20. Simple and small menu. $10 cocktails to choose from. Ordered the burgers which were good sized and had good flavor, the sweet onions seemed to be on the salty side. Fries were tasty as well. Food took awhile to come to the table. So definitely better of a place to sit and drink and hangout for awhile instead of a quick dinner. Not necessarily a place to take the kids, no highchair available.",
   "Nice people and good spot for a drink. Menu is limited so dinner might not have lots of variety. Outdoor seating in the summer. Parking lot.",
   "I did a google search and found this restaurant. Had the fish fillet sandwich and it was great! My sister got the duck drum sticks and she was licking her fingers afterward. I did take out but went to the restaurant to check the place out. It is small but very fashionable. Lived in NYC for 20 yrs. and it reminds me of the kinda place I would see downtown. Very much worth the trip to this place. 👍🏽"
  ]
 },
 {
  "name": "Yoleni’s Providence",
  "address": "292 Westminster St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3facfc22-9333-11ea-a57d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "music",
   "food",
   "delicious",
   "music"
  ],
  "link": "https://maps.google.com/?cid=8985363096767818399",
  "source": "GoogleMaps",
  "reviews": [
   "we love this place - the food here is delicious!  we ordered take-out during this stay-at-home order over the phone. it was easy, tasty, and everyone was friendly. recommend!",
   "Went there with my Greek best friend for a quick lunch. The food was decent and had live jazz music playing too. Liked the environment. And my best friend said the food is really good, even though not 100% authentic. Would go there again.",
   "The yogurt bar is amazing. The restaurant is hit and miss, as some of the meat entrees were obviously reheated. The grocery area is fun to browse through because they import foods that you can't find anywhere else.",
   "Yoleni`s is ethnic Greek restaurant and Bar. It is based in historical building where once diamond and Jewelry auction used to be  held. The place serves ethnic Greek food. Different type of dry fruits.Great staff Great service visible from road .",
   "The vegan sandwich was delicious. The latte came out piping hot which is the way I like it. I also like the airy open space of the dining room.  The music is a little loud though, but tolerable."
  ]
 },
 {
  "name": "The East End",
  "address": "244 Wickenden St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/40092802-9333-11ea-871c-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=1537031066968838375",
  "source": "GoogleMaps",
  "reviews": [
   "Very small and cozy place,  has that rustic appeal inside and out . The bar, well it's out of this world with it's selection of spirits. Particularly their whiskey/bourbon selections.  You will find just about anything a whiskey collector has or is dying to aquire in here.  If you are looking to sample a dram of pappy Van Winkle 23 yr or maybe something even more sought after to you personally, this is where you find it. You will pay for it in the form of a dram ( 3/4oz) or a pour (2oz) . Water droppers are offered with your pour.  Prices are ok and parking is limited to the street. So if you want to just taste something your trying to track down , or celebrating and want something fancy , this is the spot to find it.",
   "The menu is constantly being updated so it makes you want to keep going back so you won't miss a single thing. Every thing I've ordered has been outrageously delicious. Just classic dishes made with good ingredients like a spicy chicken sandwich or a burger and fries but it's elevated to something gourmet and gorgeous. Also they have a huge whiskey selection and some fantastic cocktails. It's very dark in here and it fills up fast so get in there while you can",
   "Drinks were excellent, atmosphere was excellent, food was fantastic. What more could you ask for. Great place to hang out with friends or take a date.",
   "Classy and cozy place! A friend said it's a good place to go on a date! Right on Wickeden near the point street bridge so you can walk over to the hot club or whiskey republic later in the night!",
   "Absolutely fantastic atmosphere. I only came here to try the fantastic Bourbons they have, but will definitely be back to get the whole experience."
  ]
 },
 {
  "name": "Angelo's Restaurant",
  "address": "141 Atwells Ave, Providence, RI 02903, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/40533d12-9333-11ea-b185-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walking",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12960172776901741243",
  "source": "GoogleMaps",
  "reviews": [
   "What's not to love on Federal Hill! We stopped in for lunch on a Tuesday afternoon, we were seated immediately. We used the rear valet entrance. If you know the area the parking lot is behind the restaurant. I had a chicken parmigiana sandwich, the others had a cheese ravioli plate & veal w/peppers & fried calamari. No complaints on quality of the food. However here's what I wasn't a fan of, the portions especially the veal! Definitely not enough for my husband! This also wasn't offered w/any sides other than the bread that was brought to the table. The calamari wasn't enough for 2 people to split & I ate the entire portion, was really delicious!! I wish they would have offered fries or a salad or even a pickle w/my sandwich. The staff was friendly. The interior is decorated w/photos of years ago, a train on track will travel if you insert a coin.  I would return but I truly expected much more from a Federal Hill restaurant.",
   "I originally wanted to go to the Wise Guys, but they don't open till 3pm so I went next door. After all this is Federal Hill and any place here should be able to make a ham and salami grinder. Or so I thought. Upon walking inside the place looks and feels like one might expect. A nice lady in the front took my take out order and a few minutes later the sandwich was ready and out I went. When I got back in my car and opened the box it all went down hill or off a cliff I should say. First I noticed the tomatoes that I did not order followed by banana peppers that were not part of the order and lack of pickles that I did order. Next came the bread, fluffy and bone dry exept a few spots that where soaked by balsamic vinegar once again not part of the order. Lastly there was practically no meat on this sandwich. I saw a single slice of ham and a single slice of salami on the half of sandwich that was in my hand. So I went back and said that this was a badly made sandwich and the nice lady gave me a refund and that is my reasoning for a two star review. Unfortunately the pictures of the sandwich came out much better than the product itself.",
   "The place has been around for 95 years. They are doing it right. The meatball and French fries just work together so well. The braciole is tender and the egg noodles with the red \"gravy\" is just right. The staff just add to this old school charm.",
   "Stopped by for dinner with the family, first night in Providence, couldn't have picked a better place. Food was amazing (even restaurant week specials available!). The staff was great, Jane was especially helpful and friendly, we felt like family right away, would highly recommend!",
   "Reasonable price with old fashioned American Italian food in providence.  You must try."
  ]
 },
 {
  "name": "Parkside Rotisserie & Bar",
  "address": "76 S Main St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/409d6598-9333-11ea-bebd-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "unique",
   "food",
   "creative",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14850264436628532146",
  "source": "GoogleMaps",
  "reviews": [
   "Parkside has been open and offering pickup and delivery since the beginning of Rhode Island’s stay-at-home orders. They have done a fantastic job of transitioning their service to this new landscape. Everything they have done - from an optimized menu to contactless payment to curbside pickup - has been well thought out and deeply appreciated. The food remains not only excellent, but a true treat in this weird landscape we are in. Thank you, Parkside.",
   "If you are looking for a great atmosphere,  absolutely stunningly presented and delicious food , amazing bar and wine selection and great service then you need to visit this great restaurant.  Valet parking.  Thank you for a great evening.",
   "Delicious food,  gracious bartenders,  delicious wine... fun,  casual but somewhat upscale/ nice atmosphere & decor.  Great prices... what more would you want? Great place to enjoy yourself alone and with others. Some unique menu options that are delicious.",
   "Provably the most underrated restaurant in Providence. The food is outstanding and creative. 90% of the time, I get the rotisserie special and I am never disappointed. Last time I actually had the seafood special that included a 6 oz piece of swordfish, Alaskan crab leg, 2 oyster Rockefeller and 2 grilled baby octopus. After dinner, I wanted to try another special that they had, homemade duck sausage, so the kitchen put together a duck sausage appetizer for me to try. No parking, but there's valet parking available.",
   "Bouillabaisse was amazing! This view is epic it's right on the water. Drinks were great, service was perfect, if I'm in Rhode island I'll make sure that I always stop in for the bouillabaisse"
  ]
 },
 {
  "name": "Olneyville New York System Restaurant",
  "address": "18 Plainfield St, Providence, RI 02909, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/40e6a3de-9333-11ea-9ba4-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7226717647225291501",
  "source": "GoogleMaps",
  "reviews": [
   "This longtime icon has earned the badge of an official Rhode Island  food. From a Greek immigrant's concoction of the finely ground beef from his own ethnic standbys and the unique pork and beef dogs with onion and celery salt in a steamed bun, a legend was born. The association with New York was by name only, because at the time what was more worldly than that city? You'll be as lucky to find a New York System wiener in that city as an English Muffin in London. Don't be fooled by the name, the wieners are a Rhode Island creation as unique as Del's Lemonade, coffee milk and coffee cabinets. \n     In my mind, since childhood, nothing is a better accompaniment than coffee milk. Don't tell your friends you've been to Rhode Island unless you've experienced Olneyville wieners 'all the way' they are the original and the best!",
   "Really friendly staff, helpful and funny. Food is delicious and inexpensive. Get the hot weiners all the way!",
   "Always worth the ride for my system special with coffee milk!!",
   "Serving up great basic food since 1946 is this local landmark. Inside is charmingly dated as a time capsule. Staff is very friendly. I was slightly intimidated going there as a Newbie and not knowing all the vernacular, but the place is great. Hot wieners \"all the way\" hit the spot and the fries were great. A must stop if in town.",
   "Nothing is better than  Hot Weiners!! Simply Delicious! Olneyville has the best in RHODE ISLAND"
  ]
 },
 {
  "name": "Bayberry Beer Hall",
  "address": "381 W Fountain St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/412a8ac0-9333-11ea-817b-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "food",
   "delicious",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2016386298389186628",
  "source": "GoogleMaps",
  "reviews": [
   "Bayberry is a large, open beer hall with an amazing beer selection and a refined ambiance. They typically have 14 beers on tap and many more in bottles. The space is very clean and the decorations are subtle but very nice. The best and biggest surprise is the food, though. Some of the dishes, particularly the spicy chicken sandwich, are as good as you can find anywhere in Providence. It’s not cheap, but the quality is so high that it doesn’t matter. Check this place out!",
   "Our first stop on a visit from out of town and it didn’t disappoint for one second! Amazing beer list for me and cocktails for my lady. We got the Portuguese sweet bread, chicken biscuit, & huevos rancheros add roasted pork. The house hot sauce was a great touch. Can’t wait to make it back!",
   "Great beer hall in downtown Providence. It's near federal hill, in a wide open space and has great service. Beers are great and I highly recommend the food here, particularly the spicy chicken sandwich. Desert items like the smores shown are also terrific. I will say that the only detractor to this is that it's a tad pricey, but would definitely visit again.",
   "Awesome experience at Bayberry. We liked the communal tables. Very Beer Hall oriented. Easy to understand their ordering system. \nExtensive beer selection. My personal favorite is the Notch. \nI was very impressed with the food. We started with the sourdough pretzels and mustard. Soft, salty and hot! \nWe split a burger and Hot Chicken sandwich. Absolutely delicious!",
   "Open atmosphere and everyone seemed friendly. Not too difficult to find parking. Food was really good and the specials were good too! A lot of beer and drink options. We went for brunch and absolutely would come back"
  ]
 },
 {
  "name": "Opa Restaurant",
  "address": "230 Atwells Ave, Providence, RI 02903, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4174da62-9333-11ea-a3a1-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "delicious",
   "food",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=6482504627252250127",
  "source": "GoogleMaps",
  "reviews": [
   "Opa restaurant in Providence RI serves excellent middle eastern food. After a few weeks of eating pescatarian meals, my colleague and I headed to Opa. After a long walk as is our wont, we were seated inside the restaurant. The waiter and his trainee introduced themselves and took our orders. \n\nEven though it was past 7 pm on Monday, there were hardly any patrons in the restaurant. We were given some traditional shrak/pita bread with olive oil dip. The combination of the bread and oil was good. When our food finally came, we were ready to dig in. I had ordered lamb skewers and there were at least 5 skewers with 3 pieces of meat.  My colleague had ordered the mixed grill and he was enjoying it, being a fast eater. \n\nOpa restaurant waiter assured me before ordering that the meat is halal and taking his word I started eating. The food is good though some pieces had sinews forcing me to leave the masticated remains underneath the plate. The price is very high at $25+ but I think it is ok for the quantity though I would like to see the quality too.",
   "Excellent service and the DJ was amazing! Awesome atmosphere, ambiance, and the food was delicious! Hookahs were clean and burned forever. Definitely going back and referring friends?",
   "The food is great. Service quick and on point. The quality of Their chicken kabob and beef kabob is exquisite. Tender, juicy and melts in your mouth. Hookah is decent, could improve on the quality but overall is definitely worth a visit.",
   "Amazing lebanese food. Joyce was awesome. She knew everything and was super helpful about suggestions about ordering. Definitely recommend trying the mixed grilled platter so you can get a bit of everything. And ask for the garlic sauce.",
   "Where oh where to begin... this place is amazing! Absolutely a must try for a very filling dinner. The restaurant opens to the outside with seating outside as well. The inside is dimly lit; however, it is a nice ambiance. The menu is extensive with options for everyone. The grilled calamari was the first for us, as typically it's fried; however, we liked having the healthier option. I ordered the 16 oz ribeye, cooked perfectly to medium. It was juicy, tender, and had such great flavor. The salad, was delicious.. for being a salad.. it was crisp and fresh. I chose to substitute the fries for zucchini and mushrooms, which I wasn't hassled for doing so. The meal was absolutely delicious. My other half ordered kabobs, which had a mix of meats, which he enjoyed as well. We were both satisfied with our dinner. Our server was friendly and all of the staff was attentive with quick service. A belly dancer came out as entertaining  which was neat. Wish I had better photos, although the lighting wasn't in my favor."
  ]
 },
 {
  "name": "Den Den Café Asiana",
  "address": "161 Benefit St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/41b761f0-9333-11ea-b865-14b31f159f22.png",
  "tags": [
   "eat",
   "cheap",
   "delicious",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=16789905955703511828",
  "source": "GoogleMaps",
  "reviews": [
   "My favorite place to eat in Providence. It's quite the drive but completely worth it in my opinion. It's trendy and has amazing Korean and Japanese dishes. I have had their Tonkatsu (fried pork cutlet), eel rice bowl, and twister potatoes. I would have them all again! Give it a shot!",
   "Please anyone who is looking for an amazing menu with as amazing staff please visit Den Den you will not be disappointed. Spicy Squid and pork belly BBQ In the top picture and located In the picture below is Premium BBQ short rib. Im drooling thinking about it.",
   "Outstanding! This is one of the only restaurants that I can play \"menu roulette\" and never go wrong. It's not cheap, but it's worth it. This one, the one off Benefit has a nice casual cafe appeal to it whereas the other one near Thayer is much louder and cafeteria like.",
   "Stopped by on a Sunday night before leaving Providence. Food was delicious, tea was great, prices were reasonable and the staff was all friendly. Definitely recommend giving them a shot.\n\nNote: if you don't like fish flakes ask for none on your dish.",
   "Great service. Pay upfront then your order is served to your table.\n\nClean large relaxing place to eat at. \n\nWill come back again."
  ]
 },
 {
  "name": "Kleos",
  "address": "250 Westminster St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/42055b1a-9333-11ea-8ef2-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4753237647208860533",
  "source": "GoogleMaps",
  "reviews": [
   "Try Dip Dish appetizers for 6 different spreads & Mediterranean Mule! Main dishes are all good so you won’t make any mistakes when you visit here.\nIt’s a cozy environment with welcoming wooden tables. Recommend for a nice night out with a partner or friends!",
   "Menu looked so tempting. It was a difficult choice but settled on the gyro, which was delicious served with a small.crispy tomato and feta salad and salted fries. Server Valerie was professional and friendly. When we couldn't decide on a full sized dessert, she brought us tasty cookies gratis. Prices reasonable.  Lovely atmosphere with white lights all around. Highly recommend!",
   "Scallops were cooked perfectly. The pasta with butter and cheese was a hit with kiddo. The spanikopita was... just okay. Something about it, some flavor was unusual and made the whole experience a little off. Overall beautiful environment.",
   "Starting with the good.  Kleos has a great location in the heart of Providence.  Parking can be hard but valet is offered as well. \n\nInside you will find a rather tight seating arrangement with small bar.  Outdoor tables are available.  Our waiter was a pleasure and very accommodating and made a suggestion to try the sample plate which was outstanding. \n\nSticking with my norm I ordered the rather expensive Gyros Plate that was to be served with fries and a salad.  \n\nWhat arrived was a typical presentation for this type of meal.  However, I found the salad to be lack luster.  The big pieces of feta cheese on the top was interesting but didn't really offer much to help.  The biggest issue was the Gyro itself in that it was extremely dry and salty. This really needed the help of the tzatziki but surprisingly there was little to be found, a few cuts of tomatoes and onions just about rescued this.  I found the fries to be overcooked as well. \n\nI may give this place another try as the other reviews suggest it may have just have been an off night.  At the least for my meal.",
   "We just walked in to this restaurant because it looked bright and had a very contemporary look to it. The menu is simple and yet checks all boxes. The food was delicious... we all had the pita sandwiches and they tasted great. The house salad with he house dressing is ahhhhmazing!"
  ]
 },
 {
  "name": "Bravo Bistro",
  "address": "123 Empire St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/424e7226-9333-11ea-9d87-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=17044999354934400813",
  "source": "GoogleMaps",
  "reviews": [
   "I found a spot I'd love to frequent! The ambiance of the bistro was what won me over. The lighting, the warm greeting from our hostess/server. Everything was amazing. I ordered the Bravo Burger and it came with fries and whatever fixings you wanted. The burger was grilled to absolute perfection and the fries were crispy and seasoned deliciously. Simple yet extravagant. My friend ordered the Bravo Steak Sandwich and thoroughly enjoyed it with some A1 and the fries that came with it. I believe our servers name was Olivia and she was absolutely amazing and made my dining experience truly amazing. I'll definitely be coming back.",
   "Gets three stars just for the soup which was good. But stay away from the Crouqe monsieur. Everything that could be bad with it was. Wrong type of bread used, got all soggy, was like eating bread pudding with ham and cheese in it. The bechamel sauce wasn't even put under the broiler to crisp up. Would not recommend this sandwich.other than that place was nice and French onion soup was good.",
   "We tried this restaurant for the first time on Thanksgiving. It was pretty good. They had a traditional turkey & stuffing Thanksgiving plate along with other choices if you wanted something different. The service was good and the atmosphere nice. We would like to try this restaurant again when it's not a holiday.",
   "Murder Mystery plus dinner... Cast is extremely talented and funny!  Audience participation brings family and friends to their knees with laughter.  Food was excellent.  Great night out.  You won't be disappointed.",
   "Relaxing atmosphere and great for a quick bite and drink when you find yourself in downtown Providence. I can't recommend it highly enough."
  ]
 },
 {
  "name": "Red Stripe",
  "address": "465 Angell St, Providence, RI 02906, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/42a2fb10-9333-11ea-ae52-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food",
   "drink",
   "eat",
   "food",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=4543467023744722401",
  "source": "GoogleMaps",
  "reviews": [
   "We had a wonderful experience at Red Stripe! Food was delicious, service was prompt. Our waitress was very attentive as we had a 5 and 3-year-old with us. Extra silverware and plates, while also taking away clutter from the table. I would highly recommend this place, especially on Wednesdays where it's $1 child meals and $5 martinis!",
   "This restaurant came highly recommended by a friend so I had to check it out. I just landed, I was hungry and I still had to drive to the Cape but I definitely needed fuel for my body so Red Stripe it was. I liked that it was a casual dining spot because I was in “travel clothes” but the food was way above casual. They had a great selection of  meal options. I had their New England Clam Chowder which wasn’t the typical white cream base BUT OMG delicious. I highly recommend it. For my main dish I had the seared sea scallops with risotto. Scallops were perfectly cooked and so was the risotto. I enjoyed my meal immensely and I look forward to visiting this Red Stripe on my next trip up North! I must point out as well great service from the hostess to my server! My only downside was parking, there wasn’t a designated parking lot but I heard this is an issue in Providence not just this restaurant.",
   "Great food and great service. I had the watermelon and feta salad, my boyfriend had the lobster roll. Both were great. I plan on coming back next time I am in the area.",
   "Placed a reservation through Open Table for 8:00pm Christmas Eve. Arrived inside the restaurant at 8:03pm and was told by the host that the restaurant was closed; yet it was still busy. Two women ahead of me were getting sat at a table, just as I was told by the host she would have to ask the manager if my party could still dine. Then the host decided it’s alright to take my party seeing as she had just canceled my reservation. My boyfriend and I get sat against a dirty wall against a corner. After getting quickly greeted by Eric, my party decided what to eat quickly seeing as they were already closed. After telling my server we were ready to order, he doesn’t reappear for 10 minutes. Eric proceeds to write down our order, then explains they have run out of truffle fries. This doesn’t make sense seeing as other menu items have Parmesan or truffle so not sure what they ran out of; he then leaves for some time and finally gets my boyfriends drink. Our food didn’t take long to arrive. The fries are great, buffalo cauliflower could’ve been cooked a little longer but still good, burger was good, except Eric forgot my boyfriends bacon so he had to wait to eat it until it was grabbed. Enjoyed what we could, then tried for some time to get Eric’s attention. Took some time to get the bill, which arrived with another tables’ check, we paid and quickly left. Had some high hopes for this place after reading some of the other reviews, so left disappointed. Would’ve stayed and ordered more if the service wasn’t so poor overall. We didn’t expect fast service for Christmas Eve, but a little more attention to detail wouldn’t hurt.",
   "Had lunch with friends. It's been a year since I've dined here. Reuben and fries.. fries were really greasy and beef rather thick and chewy.  Our waitress was inattentive. I had to ask for water twice. I drink a lot of water, thank you. She did ask \"how is everything \". But that was when we were almost done. She was pleasant but needs to spend more time watching her table than chatting with employees. Come on, there were only 5 full tables in the entire restaurant."
  ]
 },
 {
  "name": "Hemenway's Restaurant",
  "address": "121 S Main St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/42e9a24a-9333-11ea-9b87-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "walk",
   "delicious",
   "food",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=4641324930202173281",
  "source": "GoogleMaps",
  "reviews": [
   "I’ve been here a few times and it’s definitely becoming a favorite. Nancy, our waitress, made us feel at home and well taken care of. She recommended a great wine that truly complimented our dinner and was very personable and professional which helped to amount to a great night out. She is definitely an  asset to the wait staff. The food was great, again. I highly recommend the chefs special,  Grilled Swordfish, and you have to have the oysters, they might be the best part. 10/10",
   "This restaurant is nestled in the Brown University campus building. Lots of window you can look out to the beautiful city building around and park walk ways. The seafood is fresh. As it was restaurant week when I visited I had the 3 course price fix and added a beet salad. Each dish was good. Mushroom soup to start was delicious. Second was the beet salad, great, this was my add on because it reminds me of Sunday lunch my Mom use to make so any chance I get for beet salad I take it :0). Third was baked stuffed lobster 1.25lbs. this was a bit salty due to the seasoning salts, I might be over rating as I am not a salt guy. And finally desert was topped off with carrot cake and banana ice cream. Not a big carrot cake fan so the ice cream is what I had and it was Yummy.",
   "Really nice place. Lump crab appetizer was top notch. Escargot was good (but I thought the bread crumbs were a little overwhelming). Excellent paella and excellent scallops! Service was a little slow at the start (it was a busy Saturday night) but otherwise great.",
   "Food was delicious the waitress Gabriela was not up to par.. Asked her for something and watched as she spoke to another employee half way done with entree an finally received the lemon i asked for. She did not offer bread we had to ask  After being seated for 5 minutes.  Hats off to the chef today for sure food was great",
   "This was my first time and a restaurant of this caliber and I definitely was not disappointed. The staff was amazing and when I told the waitress that this was my first time having a raw oyster, she promised to choose a good one and definitely seem to deliver. We had a large party who ordered a large variety of dishes and not a single person was disappointed. If you were looking for a little more upscale restaurant very close to historic buildings I highly recommend this restaurant. You won't be disappointed."
  ]
 },
 {
  "name": "Milk Money",
  "address": "566 S Water St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/43326a12-9333-11ea-82c6-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12432435040944437248",
  "source": "GoogleMaps",
  "reviews": [
   "First time at Milk Money but definitely not the last. Charming decor, quick friendly service and amazing meal! Serves tapas style, enjoy all the variety they have to offer. Every dish that came out was presented beautifully and prepared perfectly. From the deviled eggs and octopus to the chard and potatoes. DO NOT miss the fried chicken! AMAZING!!! Great desert selection , the lemon semi-freddo with the berries was out of this world! You leave satisfied but not overwhelmingly stuffed! My only caveat is the bone marrow... not worth the $...very little marrow, pass on that!",
   "Overall great experience!  We were celebrating my son's bday and tried so many delectable goods.  It's tapas style, so order many things and share.  Our waitress was awesome and helped with the selection process.  Great for foodies ❤️♥️❤️♥️.  I will definitely return.",
   "Definitely worth trying for Sunday brunch where the vibe is casual and hip, and the food is good. Parking available in the back and on S. Water Street. The management was friendly, greeting each party at the door before being seated. Enjoyed the focus on locally-sourced foods and ingredients. Will definitely go back to try the dinner which I understand offers lots of tapas plates for sharing or trying new foods. Fun place.",
   "Came here for brunch following a bachelor party. Everyone absolutely loved their meal. I got the French toast and it was perfect. The side of bacon is also super Thick. Almost like bacon-steak. Worth a try.",
   "Would come back! Close to the highway, friendly staff, great atmosphere for chilling and chit-chatting. Food service was a little slow, but the food makes up for it! Delicious and flavorful! Great cocktails, alcoholic as well as non-alcoholic. Coffee was great too, perfect brunch location! Extra points for bamboo straws instead of plastic."
  ]
 },
 {
  "name": "Ten Prime Steak & Sushi",
  "address": "55 Pine St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4378d598-9333-11ea-b182-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "eat",
   "art",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17554749693667948958",
  "source": "GoogleMaps",
  "reviews": [
   "Food and service were fantastic. The restaurant was very clean and uncluttered. My date and i ordered oysters and a sushi roll for an app, the ny cut steak and the rib eye steak for the main course; then banana bread pudding for dessert. Everything came out in a good amount of time and our waiter was very attentive and helpful when we were deciding our meal. Will definitely be going back. Oh the banana bread pudding was delicious and the \"smoke show\" cocktail was great as well!",
   "I’ve only been to Ten Prime twice in the last 6 years, both times for a birthday dinner. This time, it was my birthday, and also restaurant week. Just like my first visit, the food and experience were exceptional. I absolutely enjoyed my food and would go back!",
   "I come to Providence once a year. I have 2 nights to go out to eat.  I can’t help but keep going back to 10 Prime for the amazing sushi rolls, good ambiance, and great service. The executive chef is awesome here too. I like to sit at the bar. Ryan’s cocktails behind the bar are next level.",
   "Originally I had left my review blank.\nThat's essentially my impression of 10 Prime Steak & Sushi. It's nothing to write home about, in almost any way. It was remarkable when it opened, 20 years ago. It was modern then - even futuristic. It hasn't kept up that pace in menu innovation (even the beer & wine list remain stagnant) nor the decor (I post a picture here of a once fantastic saltwater tank for reference . The person responsible for maintaining it should not have that job). The same regulars at the bar, getting all of the staff's attention, just 20 years older. Nothing wrong with consistency, except it can grow old and tired. My recent visit could not have been more lackluster.",
   "Outstanding! I almost forgot how good some of the restaurants down city are. Ten was great. Some of the art in the place made the experience uncomfortable. But the food made up for it. A must if you admire a succulent steak on occasion."
  ]
 },
 {
  "name": "Broadway Bistro",
  "address": "205 Broadway, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/43bf548a-9333-11ea-89a3-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "walking",
   "unique",
   "music"
  ],
  "link": "https://maps.google.com/?cid=16680465861313644328",
  "source": "GoogleMaps",
  "reviews": [
   "Small intimate atmosphere.  Food is magnificent and well plated.  Wait staff was attentive and more than helpful when I spilled my port!  Can't go wrong with a stop wether dining or at the bar.",
   "Excellent little restaurant within walking distance of Columbus Theater & shops. Excellent friendly service. Menu is not extensive but the food was very good!",
   "Fun and unique menu selection with a good variety of vegetarian dishes.",
   "One of our favorite restaurants ever!  Imaginative menu, cooked to perfection.  Good helpful staff.  Place has never failed to delight us!",
   "Great bread. Best vegetable Ramen I've ever had. Fast service. Good music. Would return."
  ]
 },
 {
  "name": "New Rivers",
  "address": "7 Steeple St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4413b674-9333-11ea-84f2-14b31f159f22.png",
  "tags": [
   "delicious",
   "creative",
   "unique",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13973431910429497882",
  "source": "GoogleMaps",
  "reviews": [
   "It's a nice cozy and friendly place in a grubby city, Providence.  We ordered the night's special braised beef with a light cream corn and shiitake mushrooms.  Excellent! The corn was not heavy at all, very light, ultra light.  The beef was cooked well, although I did find it a bit grossly but more than acceptable.  This was a well prepared plate. \n Judging by the crowd it is a local, after work, professional neighborhood place.\nStaff and wait service was friendly and very amicable.\nWould go again.\nOne downer...no online reservations.  You have to call...call...to make a reservation .  LOL.",
   "Amazing experience everytime I've been here! The menu is so diverse and offers spectacular dishes. The amount of flavor packed in each meal I've had is incredible. Highly recommend trying one (or all) of their desserts! Their chocolate sorbet has to be my favorite. Thank you New Rivers for bringing Providence delicious eats!",
   "Fresh ingredients and creative dishes with amazing flavors. We made reservations for an early dinner and the restaurant was quiet and intimate while still being casual. Service was quick and attentive and happy to accommodate any special requests or to make suggestions on the menu. The dishes are on the smaller size but still satisfying and the flavor provides are excellent. Plenty of fresh ingredients and specialty flavors that blend together and make a great bite. We left around normal dinner time and things were getting busy so reservations are a must. A great place for a date night in the city.",
   "Great food with always something unique. Cozy space. Wonderful wait staff.",
   "The food is excellent. The menu offers surprising combinations of flavors and many options both for vegetarians and meat lovers."
  ]
 },
 {
  "name": "Mare Rooftop",
  "address": "229 Waterman St, Providence, RI 02906, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4474be02-9333-11ea-9722-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=3220528447141102024",
  "source": "GoogleMaps",
  "reviews": [
   "The name says summer but it’s a great place in winter too. This sleek and elegant place is full of twinkly lights and yummy Italian seafood.  During winter it’s frenetic vibe is quiet and chill. I’ll be back to the huge and comfortable bar for great pizza and fresh seafood.",
   "Mare Rooftop is amazing. The staff is super attentive and the food is outstanding. The environment is romantic and I cannot wait to visit again in the summer. The owner, Rob, is a very nice gentleman and runs a wonderful restaurant. This gem on the East Side of Providence is the perfect spot for date night. On our visit, we had Nate as our waiter. He was attentive and very pleasant to interact with. You have to try this restaurant as it is one of the best in Rhode Island. Thank you, Mare Rooftop for a special Valentines meal. We cannot wait to return.",
   "Clean aesthetic not gaudy. The food IS good, not pretending to be. Each bite surprised me with exactly how flavorful it was. The people were absolutely friendly and down to earth. Valet was modern with a link sent to your phone to recall your car. Beyond expectation in all directions and still priced within reason. I honestly, almost didn't want to like it, but I did 🙂",
   "This place has been on my radar for sometime, but mixed reviews kept me from making a reservation... until last night. It was beautiful weather and my BF wanted to dine at a rooftop restaurant. So, I took a chance and made made a reservation. BOY am I glad I did!! Let me tell you, nearly everything about this place was phenomenal. First, free street parking (although they have a valet). We were greeted in the lobby and had our reservation validated before directed to the elevators. Upon exiting, we were greeted by name and although I had requested a table by the windows, they offered us a table outdoors if preferred. They let us check it out before we decided to go with an outdoor table. (If it had been hotter, we would go inside since they open up the wall of windows but you have shade) Our server, Stephanie was en pointe. Her timing was perfect, attentive but not rushing. Drinks: Red sangria & G&T were spot on for a summer Eve. BF had oysters &  shared the grain salad - glad we did, it's big enough for a light entree. Followed up with paella for 2. We couldn't stop raving about the dishes, not something I've been doing lately. The salad was the perfect combo of texture and flavors and dressed to perfection. The paella was equally good. Both are chock full of tasty nugget surprises. Not sure what's up with other reviews, but I will definitely be back!",
   "The co reviewer and I decided to try this much talked about rooftop establishment as part of restaurant week Providence.\n\nThe interior is clean, comfortable and the vibe is hip.  Olivia our server did a great job making sure our meals were perfect and checking in on us all night!\n\nWe both had the three course dinner special.   The tomato soup was excellent and hit the spot on such a raw night.\n\nI had the filet mignon and the co reviewer had the chicken scallopine.  Both were excellent.\n\nThe Vanilla flan was a perfect dessert for the evening. \n\nWe have to come back and try the brunch very soon!"
  ]
 },
 {
  "name": "figidini",
  "address": "67 Washington St, Providence, RI 02903, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/44b808ca-9333-11ea-9e16-14b31f159f22.png",
  "tags": [
   "family",
   "eat",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=7903555489465797881",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely amazing pizza. The dough is out of this world. The service is great and the owner who makes the pizza is always up for a chat and sharing his journey of pizza making.\n\nOverall, this is one of the best if not THE best pie you will have in New England.",
   "I come to this superb restaurant from time to time because I enjoy the good mood that is part of this restaurant. The crew is highly welcoming and skilfull. The service is absolutely quick. Most important, the food you eat is magnificent. I ate there many times and I was always satisfied. The price is honest. I highly suggest this place to my friends and family.",
   "best actual Neapolitan pizza (only pizza worth eating) I have had in the USA so far. Great homemade soda and fantastic service.",
   "The atmosphere is cool but that doesn’t make up for the soggy, bland pizza. So many better places to go in RI for pizza. We were disappointed. Literally Had to eat the pizza with a spoon it was so wet.",
   "AMAZING pizza! Everything else is amazing (drinks are inspired) too but the Margarita Extra pizza will haunt you."
  ]
 }
]