[
 {
  "name": "North Carolina Museum of Art",
  "address": "2110 Blue Ridge Rd, Raleigh, NC 27607, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4500d1d4-9333-11ea-8181-14b31f159f22.png",
  "tags": [
   "art",
   "walking",
   "unique",
   "free",
   "walk",
   "art",
   "art",
   "art",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9519329763869303361",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place!!! It's beautiful! It's well taken care of and the art is amazing. There's lots of different cultures and eras to choose from when looking around. They've got some impressive artists and impressive works by artists you may not even know. They have a cool little coffee shop (super important, in my opinion) and they even have a restaurant! I haven't eaten there but I definitely plan on it, soon. Walking past it, I saw some people's plates and it looked great! I can't wait to go back!",
   "Thoroughly enjoyed my visit and can't wait to go again. Excellent mix of contemporary and classical pieces. Each part of the exhibit is very unique and admission was free! We spent 3 hours easily and there was still more sculptures and portraiture to see. We are already planning our next visit. I would highly recommend it.",
   "Beautiful and the sights were amazing! However I wish the art pieces were easier to walk to with direct trails leading to each piece. I understand the long trails for people who wanna run, bike or take their time. But for people like me and my boyfriend we just wanted to see the art outside and ended up missing alot of it because of time and weather. Other then that this place was awesome.",
   "Great selection of art and artifacts ranging anywhere from 6,000 years old to a few years old. Plenty of indoor gallery space with a few very well known artists as well as a huge outdoor \"grounds\" with giant sculptures and other large installations. Excellent place to hang out and experience art from many different time periods and cultural movements.",
   "So my boyfriend and I took a trip here for Valentine's Day. As we roamed the halls of the building with the permanent exhibition, we realized that there is literally like one or two art exhibitions on or about African Americans. There is nothing on Native Americans and nothing on Latinos. Which means the dominant narrative is one centered around white Europeans. The narrative and history being told by the items the NC Museum of Art chooses to show in its' permanent exhibition is only a portion of history and quiet frankly uplifts white supremacy. The NC Museum of Art can do better."
  ]
 },
 {
  "name": "Pullen Park",
  "address": "520 Ashe Ave, Raleigh, NC 27606, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/455bea8a-9333-11ea-8937-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "family",
   "free",
   "family",
   "free"
  ],
  "link": "https://maps.google.com/?cid=13304147730283634675",
  "source": "GoogleMaps",
  "reviews": [
   "Really nice place for families. They have rides, boats and trains for kids! Also this park is very close to Raleigh downtown where there’s a lot of good restaurants and cafes. Top choice for parents with kids 3-8 years old. The place will get much more prettier in spring when all flowers bloom.",
   "A very nice place to visit. It's a small park, but really a cool place for parents to take their children,  or for parents to take their children. I was informed that during the summer, they're many picnics and concerts in that park, so I can't wait to visit during that time. The outdoor train was a really cool thing for kids. The Merry Go Round was especially nice as well. I can't wait to go back.",
   "Such a wonderful park. Plenty of fantastic free fun for the family. The playgrounds are safe, clean, and modern. The snack bar is reasonable and the cost for the rides is very accessible at $1.50 per ticket and each ride requiring one ticket per person. I think the paddle boats may require a minimum of 4 tickets to ride.",
   "This is an amazing park with a play area for children. It also has cover if its a sunny day so you can rest and get hydrated again. There is a train for family to have a over look of the park and for the children to enjoy the scenery. There is also a carousel for the children. Over all an amazing medium sized park to go with family and friends.",
   "It was a fun little Park to go to.\n\nMy three-and-a-half-year-old sun absolutely loved the train and the boats!!!\n\nAlso nice that they have a free playground, but you can take a child to instead of spending money.\n\nBathrooms were in decent condition.\n\nOverall I would definitely recommend this!"
  ]
 },
 {
  "name": "Marbles Kids Museum",
  "address": "201 E Hargett St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/45b5f190-9333-11ea-80fe-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "kids",
   "walk",
   "nature",
   "walking",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=10113596087737764998",
  "source": "GoogleMaps",
  "reviews": [
   "We love Marbles! For parents with young children, this museum is a gem. As other reviewers have mentioned, you and your kiddos could spend hours here and not be bored as there are several exhibits designed to ignite their curiosity. I love that Marbles emphasizes the importance of play and imagination for children. At many of their exhibits, you'll find that they translate concepts such as money/budgeting, customer service, weather, emergency personnel, into messages that young children can better understand. It does tend to get slammed on holidays and weeeknds as you can imagine, but despite that, because there is so much to do, you'll find that there is a good flow between the exhibits and how many children are in a location at once.",
   "Love love love this place, especially when you have a 3 year old full of energy. You can spend whole day here and your kids will not be bored. From arts and craft area to toddler section everything is interesting. Would love to take my kids there again and again  and plus point is If you have a specific bank card (can’t remember the name ) on the first weekend of every month one admission will be free.",
   "My 2 year old had so much fun there! You can easily spend 2-3 hours there. There is so much to do for the kids. I really loved it! It’s the perfect place for some indoor fun. We will be back next time we visit Raleigh for sure.",
   "What a wonderful concept...learning while playing. My grandson is only 15 months, but now walking, he can explore different aspects of science and nature. It is a perfect museum for children to grow into. Lots to do for all ages. You can spend hours there, or like us, 1hr. Depends on the age of the child.  Luckily, the walk in person, myself, admission was only $7.+ tax. I bought my son, daughter in law and grandson a member ship for Christmas at $120. It jumped to $130 for the new year. Pretty steep for families trying to live. Then the next membership is $150. That gives you an opportunity to see other museums.\nParking can add up in the oarking garage also.",
   "This is a wonderful place for children of all ages to explore and learn through play! It does get crowded so be mindful of peak times when planning a visit. The only reason I didn't give it 5 stars is because some toys were not working or had missing parts. Additionally, some surface parts of the museum felt dirty and had grime built up that was visible."
  ]
 },
 {
  "name": "North Carolina Museum of Natural Sciences",
  "address": "11 W Jones St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4625f1a6-9333-11ea-883c-14b31f159f22.png",
  "tags": [
   "kids",
   "field",
   "kids",
   "free",
   "walking",
   "free",
   "free",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=9871916602311768126",
  "source": "GoogleMaps",
  "reviews": [
   "What a great experience. Today the 8 of us had a great time at the museum. The exhibitions were very well presented and interesting. Also the kids had an awesome time at the discovery laboratory and the interactive displays. I will recommend this place to everyone. People with or without kids. Lots of fun.",
   "Great place for kids and nostalgic place for adults. It's free to get in and donation are always welcomed. There are 3 floors so make sure you have good walking shoes. The museum is handicap assessable. Staff to s very friendly and I was pleasantly surprised. Great for field trip, out of town guests, or a off day. I would say this is me te for the kids but adults are welcome too.",
   "How is this FREE?! I've been here probably 10 times, and have loved it every time.  Good for people of all ages. My mom hates museums but loves this one.  They have so much cool, interactive stuff.  Plan to spend several hours here. You still won't see everything. This is probably my all-time favorite museum in the world.",
   "A real nice place to go, especially for little to no money! (Donations are welcomed) I had a two year old and it was very informative and though she did not get to know a lot about the different exhibits, there was still a lot for her to interact with and see. Especially at the Discovery center.",
   "This place was awesome! And its free?? We had to come up for a business trip and wanted to see Raleigh. When I saw this place, I thought it would be a great place to take my boys, I was totally right. My oldest (7) had the best time. They have experiments that children can do, they have displays about the science work that is going on. It. Was. Amazing! It's right across from the state Capitol. There was a history museum right next door. It's in walking distance from a lot of things, and there are bus stops close by if you need to go farther. . We loved it!"
  ]
 },
 {
  "name": "JC Raulston Arboretum",
  "address": "4415 Beryl Rd, Raleigh, NC 27606, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/467dd5ec-9333-11ea-bbc5-14b31f159f22.png",
  "tags": [
   "organized",
   "family",
   "kids",
   "walk",
   "tour",
   "free",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=2928598461218892848",
  "source": "GoogleMaps",
  "reviews": [
   "We love this arboretum! They really pack so many beautiful trees, shrubs and flowers in a relatively small botanical garden. There are so many little trails through the gardens that you can really find some peace and quiet no matter how busy it is. It is well organized with a Japanese garden, a desert garden, and local favorites. There are also some nice fields to picnic or toss a ball around.",
   "The best place for a stroll by yourself or with family. We love to bring out of town guests to explore the grounds, year round too! Everything is so well kept. Parking can be an issue during high volume times, just pay attention to street parking so you don't end up in a ticketed area. Beautiful spot for family pictures to prom to event rentals!",
   "We met up with a friend here for the first time with our children from ages 2-10 and we all had an absolute blast! Great times and even better memories! Only forewarning I'd offer to parents with young children is to be cautious near the rear of the main building as they have a bunch of cacti and other sharp/pointy plants. The majority of the park is of little concern in comparison. We will certainly be returning again very soon.",
   "Here's the thing: there is not a lot of color or  blooming going on at this time of year but there is plenty of life in the arboretum every day. There is room for kids to run and explore,  young couples to huddle in quiet corners, and everyone to spend quality time checking out all kinds of plants from all over the world that also thrive in our environment...and all of this on a holiday. We had a great time!",
   "Excellent stop to walk and enjoy the beauty. We're visiting for the weekend and enjoyed the opportunity to get out into nature. The visit was free and the helpful volunteer at the Visitor's Center gave us a map with a tour of what was in bloom at the time of our visit."
  ]
 },
 {
  "name": "Lake Johnson Park",
  "address": "4601 Avent Ferry Rd, Raleigh, NC 27606, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/46c7895e-9333-11ea-bfcf-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "family",
   "nature",
   "walk",
   "hike",
   "family",
   "walking",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4028024234501137008",
  "source": "GoogleMaps",
  "reviews": [
   "So my girlfriend and I came down here on vacation from New York State. We were staying in Cary North Carolina and decided to come check out this park because it had some good reviews. This was a very beautiful Park and loved the hike around the lake. The boardwalk was really cool to walk and crossed and seen tons of wildlife was really cool as well. I definitely would recommend this place to other people",
   "I love this place. Nice easy trails. It is always a little bit busy there and parking is usually packed but it is also very relaxing to spend time at this place. Good if you like exercising and enjoy nature. I also love that you can rent a boat or a kayak. It's a family friendly place.",
   "Great hiking and you can choose a simple walk around the lake on blacktop or a longer hike via an extension that is mostly hiking trail. The blacktop around the lake can get a little crowded especially on weekends but still a very nice walk with a few steep hills and amazing views of the lake. Great family walking destination pretty much any time of year. Nice bathrooms and eating area are a plus.",
   "Perfect loop options around this perfect lake. One 3 mile paved loop, and one 2 mile unpaved option. The kayak and boat rentals are awesome!! The only way to improve this lake is to allow those rentals for longer than just the Summer, please. We're in the South, it stays warm much longer than just 3 months.",
   "We really enjoy the walking trail.   It is a nice 3 mile walk, with some change in elevation as well.   The main path is paved and about six feet wide, so it is easy for bicyclists to avoid walkers.   There is a wide variety of dogs, taking their humans for a walk."
  ]
 },
 {
  "name": "Frankie's Fun Park",
  "address": "11190 Fun Park Dr, Raleigh, NC 27617, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4723b34a-9333-11ea-a3b8-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11415344327800163858",
  "source": "GoogleMaps",
  "reviews": [
   "Lots of fun. The go carts are pretty fast, the place is clean and well kept. The employees are all very very nice. Most young employees don’t care about their job and can have attitude but I was pleasantly surprised here because they were all so sweet!",
   "Fun place! Took my 15 year old here for his birthday party. Even played laser tag with all of them. Go karts, video games, food... This place is full of fun! The beer made it especially nice to relax while the kids ran around and played.",
   "I was in North Carolina on a business trip. On my off day I got to visit this fun park. It was awesome. So many attractions. It felt like a mini theme park. I will definitely be visiting again next time I’m in the area.",
   "I was more of a bystander, but I thoroughly enjoyed watching my grandson and daughter while they had a great time, especially on the go carts. I loved watching my grandson beat this older guy who thought he was going to race by him because he was younger, lol.\nI'd give it 5 stars if the concession stand had a better food selection.",
   "Had a lot of fun. There was stuff for the entire family to stay busy. Go karts are $8 for approximately 5 minutes, mini golf has 3 different courses and cost $9 per course. Laser tag is a team VS team mode cost $7 for a 5 minute game. There is a vr ride shooting game for $7 for 5 minutes which is a ton of fun. And then there is the arcade with some of the coolest games around. Me and my family spent 50 a piece and had fun for 5 to 6 hours."
  ]
 },
 {
  "name": "Raleigh Brews Cruise",
  "address": "9650 Strickland Rd #103, Raleigh, NC 27615, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/477f411e-9333-11ea-bce6-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "brewery",
   "learn",
   "learn",
   "tour",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=16674715756903009263",
  "source": "GoogleMaps",
  "reviews": [
   "We had an amazing time!  Booking a trip was super easy and the meeting spot was excellent!  Brews cruise allowed us to travel and try breweries that we probably never would have!  We all felt the price was beyond reasonable and we are already planning our next cruise!  Thanks to Tonya for being an amazing guide!!  Can't wait to do it again!",
   "We had the pleasure of spending my mom’s 55th birthday with Raleigh brew crews. It was such a fun experience. If you are looking to explore local breweries, Tonya and Tim will help make for a memorable experience. I have nothing but great thing to say about this tour!!",
   "Tanya and Chris were awesome! They took us to three brewery type places (we went to Raleigh Rum with Oak City Amaretto, Clouds Brewery Tap Room, and Brier Creek Beer Garden but they go to different places every trip). They have a bus with snacks and waters so you do not have to drive from place to place, and they took fantastic care of us! At each location they set us up with multiple samples and a short talk/tour from someone at the company then gave us time to order and try other things. It was $50 per person for us and we absolutely got our money's worth, we will definitely be back for another tour!",
   "The Raleigh Brews Cruise is a wonderful and very fun activity that you do not want to miss!  The Owners are great and you can see how much they care about their business and their customers!   It is a treat to visit all these breweries (with transportation provided!), learn all about the beer making process and of course, enjoy some great beer!  I brought a group and they have said over and over again how much they loved it!\n\nMake sure plan an outing with Raleigh Brews Cruise soon---you will have a great time!",
   "Wow. What a fantastic afternoon -- in ways we didn't even expect! From the initial communication to the final goodbye, the Brews Cruise tour guides were knowledgable, helpful, personable...and FUN! They bent over backwards to make this a special experience for us: snacks, water, advice, fun conversation. They curated a perfect collection of breweries where we not only got to sample the beer but learn from the owners themselves about the process, the tasting notes and distinctive intricacies. Learning + laughter + beer = one heck of an afternoon. I'd highly recommend this, my friends."
  ]
 },
 {
  "name": "North Carolina State Capitol",
  "address": "1 E Edenton St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/47c37642-9333-11ea-acfc-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "knowledgeable",
   "tour",
   "history",
   "knowledgeable",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1195346305867674141",
  "source": "GoogleMaps",
  "reviews": [
   "One of the smaller state capitols we've visited but worth a trip. Many states have modernized or created new capitols but this building predates the Civil War and the ground floor is still used by the governor. A self-guided tour upstairs has exhibits on the building's history.  The state legislatures have moved two blocks North, just past the State History and Science Museums. That building also allows self-guided tours.",
   "The Behind the Scenes tour is offered periodically and I would highly recommend. It's offered by the NC Dept of Natural and Cultural Resources. The tour guide was very enthusiastic, knowledgeable, and passionate about the tour which lends to a more entertaining and interesting experience. You do have to climb a lot of steps so be prepared with good shoes. The tour guide was very accommodating and was sure to let us know in advance of tight spaces and narrow climbs so you could opt out at parts of the tour. We had been on a regular tour some many years ago and this was by far so much better. We also had a good group of like minded history oriented people so that made it even better. We finished up with light snacks on the second floor portico overlooking the grounds.",
   "The tour guide was very enthusiastic, knowledgeable, and passionate about the tour which lends to a more entertaining and interesting experience. You do have to climb a lot of steps so be prepared with good shoes. The tour guide was very accommodating and was sure to let us know in advance of tight spaces and narrow climbs so you could opt out at parts of the tour. We had been on a regular tour some many years ago and this was by far so much better. We also had a good group of like minded history oriented people so that made it even better. We finished up with light snacks on the second floor portico overlooking the grounds.",
   "Actually a great place to visit.  Also in the winter, if you have the chance,  local Wake County High Schools Chorus' sing in the rotunda. The acoustics are incredible for this!  Should try to check it out.",
   "The place is small, but has friendly staff with nice exhibits. Will be better once the renovations are done."
  ]
 },
 {
  "name": "Neuse River Trail",
  "address": "Raleigh, NC 27610, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4812a7cc-9333-11ea-8874-14b31f159f22.png",
  "tags": [
   "family",
   "hike",
   "free",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=9204154695600324289",
  "source": "GoogleMaps",
  "reviews": [
   "The family tool a bike ride and everyone enjoyed it. It is an easy ride, with plenty of scenery changes to keep the little ones interested. Keep in mind that there will be plenty of others on the trail and you have to me mindful of the other bodies. On that note, if you are looking for a quiet, tranquil patch of Greenway, this is most definitely not it.",
   "So much beauty and comfort !! The sounds, the escape. Fitness in the beauty of the outdoors.\n\nGreat picnic site!\n\nYou can hike or swim. Though the current creates a sort of swimming treadmill.\n\nNot to mention a FREE perk of NC!",
   "Absolutely gorgeous walk! The paths are are easy to follow with path signs to point you in which ever adventure you want. Great for walking, biking, hiking, and fishing. I will definitely have to come back because the trails have a bit of length to it when walking. I'll be back for more!",
   "Great trail - check it out!",
   "Beautiful trail, well maintained. Hiking, running, bicycling or even wildlife viewing!"
  ]
 },
 {
  "name": "CAM Raleigh",
  "address": "409 W Martin St, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/48733e8a-9333-11ea-90b0-14b31f159f22.png",
  "tags": [
   "family",
   "family",
   "free",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=9427635058729385219",
  "source": "GoogleMaps",
  "reviews": [
   "Great space for events, showings in excellent downtown Raleigh location. Recently, I participated as a vendor at NC Book Festival Book Fair at CAM. Wish there had been more street side advertising for the event to increase foot traffic to support the authors and publishers at the book fair, but overall a nice experience in an accessible location.",
   "Family Day at CAM, this was our first visit, my grandson loved it!! He sat on a Harley and said \"awesome\". The DJ, arts & crafts, and ice cream was a big hit. We're definitely coming back.",
   "Interesting architecture and beautiful art line the walls, though it's a very small museum overall. We went for a free family event and it was awesome. We wandered around after the event and were impressed with the art pieces, but found that there's not much here among the three levels. This is similar to other modern art museums in comparable sized cities, so I guess it's just a function of population. The staff were amazing and friendly!",
   "Enjoyed CAM Raleigh. Relaxed environment. Nice art and exhibits that celebrate culture as well different time periods. You could spend anywhere from 30 minutes to a few hours here and feel fulfilled.",
   "Go see the Low Rider custom motorcycle exhibit \nYou won't be disappointed \nAnd drop by Humble Pie across the street for eats n drinks while your there"
  ]
 },
 {
  "name": "Mordecai Historical Park",
  "address": "1 Mimosa St, Raleigh, NC 27604, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/48b63c52-9333-11ea-bfa5-14b31f159f22.png",
  "tags": [
   "tour",
   "historic",
   "history",
   "walk",
   "tour",
   "family",
   "historic",
   "history",
   "knowledgeable",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=13699613657954295672",
  "source": "GoogleMaps",
  "reviews": [
   "We visited the Mordecai House on a cold fall day but it was nice and warm in the buildings. All of the on-site buildings are climate controlled and the tour for adults is $7 and of very good value. There are a few older buildings that have been moved to the site from around Raleigh including the birthplace of President Andrew Johnson. The tour guide was incredibly informed and went into detail about each building and the occupants. As history lovers, we greatly enjoyed this. Everyone on the tour enjoyed it as well. It was a decent sized group of people of all ages. We were informed they do living history events as well and we will be returning for that too. Something we especially enjoyed was the fact the furniture and the other items in the Mordecai Home are 98% original to the house which is not usual in historic homes. The visitor center had a very well put together museum section too and that was interesting. The whole thing makes for a very enjoyable time out.",
   "I Stopped by on a Sunday and was pleased with the tour and how close together things were. The tour was very interesting. The house was a very neat historical home. It was also fun to walk around the outside of the house. If you are looking for something to do in Raleigh I would recommend this.",
   "I've visited this spot twice to experience the Mojaa performing arts center \" Escape to Freedom\" reenactment. Tickets are about 12-15 pp. Families should definitely be apart and visit the indoor museum before or after the show. Great discussion piece.",
   "We recently visited this historic house & park. Even though the day was hot & humid, the house & structures are cool & comfortable. Our guide, Marissa, was superb! She had a large group (our seniors as well as a family with small children, etc) and she made the presentation relatable to all, interesting, and fun. She really seems to enjoy what she does and it shows. She made history fun!",
   "Fun day, learning new things about Raleigh. Tour guide was knowledgeable and friendly."
  ]
 },
 {
  "name": "William B. Umstead State Park",
  "address": "2100 N Harrison Ave, Cary, NC 27513, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/48ffc7b0-9333-11ea-aa83-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "hike",
   "nature",
   "hike",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3662448427923880761",
  "source": "GoogleMaps",
  "reviews": [
   "Good place for walking and some picnic spots.  Nice Small lake with bridge into it. Can take nice pictures from there. There is a little park area where some are playing and relaxing. The trails are okay and have wet patches on the way. Not clean. This park can be improved more so can attract more visitors as it is in nice location. There restrooms and water stations.",
   "What a great place to walk, hike, run, or just sit and enjoy nature. Great for all ages, clean well marked trails.\n\nThey need to open earlier and at the very least put the hours of operations at the gate, which is 8am.",
   "Conveniently located. Great for a relaxed weekend hike. The trails are clean and well maintained. Dogs on leashes are allowed.",
   "Beautiful park, lots of walking trails. Take your mobile or GPS with you; it's easy to get lost.",
   "Great trails, only minutes from RDU and RTP. Since it's in the heart of the Triangle, lots of people use these the trails. If you want peace and quiet, there are other great natural places. Overall, a real gem!"
  ]
 },
 {
  "name": "City of Raleigh Museum",
  "address": "220 Fayetteville St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/494fe3a4-9333-11ea-b217-14b31f159f22.png",
  "tags": [
   "learn",
   "free",
   "organized",
   "history",
   "learn",
   "learn",
   "kids",
   "history",
   "tour",
   "free"
  ],
  "link": "https://maps.google.com/?cid=10021849302740699629",
  "source": "GoogleMaps",
  "reviews": [
   "The City of Raleigh Museum in Raleigh is a cool museum that explores the history and highlights of the city. I liked all of the different displays that were very informative and educational and I was able to learn many things. Everything here is well organized and curated and I had a good time here. The museum has free admission and is well worth the visit to check it out. The building the museum is at is very cool too. Great experience and a lot of fun.",
   "Beautiful ly well done with hands on exhibits.",
   "Loved it... So much things and information that helped me learn more about NC and mainly about the rapidly growing city of Raleigh. Very nice museum to visit and spend some good time at.",
   "Very nice museum, really nice staff and a good place to take your kids to learn more about history especially local history. I really enjoyed the concept of having temporary exhibits that change often and you get to learn new things.",
   "What a fantastic little city gem! Right on the main street in Raleigh, NC, once you get inside, you'll be amazed by the space and the number of exhibits they were able to fit inside. Many areas feature rotating, temporary displays and admission is free so I'll keep coming back.\n\nThey also have diverse membership choices, the smallest at $35 gets you discounts to numerous small events they host during the year (an Oct. 'Dark Raleigh' tour, Raleigh Roast in Jan, etc, etc). That's an easy call to support such a great Raleigh institution!"
  ]
 },
 {
  "name": "Artspace",
  "address": "201 E Davie St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/499b1dc6-9333-11ea-8a05-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "art",
   "walking",
   "art"
  ],
  "link": "https://maps.google.com/?cid=540360963632580653",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful art space with a wonderful range of artists! We were Downtown and wandered in after lunch and found this amazing gem....A Must See when in Raleigh!",
   "The new installations in this space always bring a smile to my art loving face. We had the pleasure of getting to meet the artists of the main installations on First Friday, it was insightful and riveting. I would definitely recommend going and checking out the work these wonderful craftsmen have created. Don't be a square, Vicent Van GOOOO to Art Space.",
   "Wish I had more time! Wandered through fewer than half the spaces and saw just a ton of fun, beautiful and inspirational work.  Had a lovely chat with two of the artists.  This was my alternative to visiting a museum in downtown and I’m really glad I did it.",
   "I've been here many times either looking at their exhibitions or just walking through the different artist suites, admiring their work. The exhibitions they've had in their upstairs area have shown some varied pieces from many different artists, I even bought a piece from an exhibition they had a couple months ago. They also hold many cool events showcasing their artists in residence. It's a great place to appreciate (and purchase) local art!",
   "Perfect date destination.  My husband and I strolled along and enjoyed the different art. We went on first Friday. Its amazing how many different mediums are used. There was wall art, metals, sculptures, modern even jewelry. You can meet the artists and purchase the art on the spot. After we had dinner at Bu-ku. It was a perfect evening downtown Raleigh."
  ]
 },
 {
  "name": "Durant Nature Preserve",
  "address": "8305 Camp Durant Rd, Raleigh, NC 27614, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/49dbcd78-9333-11ea-a42f-14b31f159f22.png",
  "tags": [
   "walk",
   "knowledgeable",
   "nature",
   "kids",
   "hike",
   "hike",
   "history"
  ],
  "link": "https://maps.google.com/?cid=16387258993740748153",
  "source": "GoogleMaps",
  "reviews": [
   "It was our first visit, and we came for the Winter Solstice Walk. The park is beautiful, perfect for a \"tree bath,\" and the staff were knowledgeable and patient. My son asks a lot of questions all the time, and they were so sweet to him and answered fully, with no sign of frustration, complimented him on asking questions, and invited him back to ask more. I was so touched and appreciative, I could have cried with gratitude. The programming was great. We will be back...many, many times",
   "This is a hidden gem in North Raleigh, especially since the dam repair. Good variety of trails including a fun little mountain bike trail. Nice nature areas for small children as well as access to gentle streams.",
   "Great park! Very well maintained. I look forward to visiting the butterfly garden in spring.",
   "Beautiful local park with a small lake, playground, fields, and lots of events sponsored by the city of Raleigh. For moms with strollers, the rough path down to the lake can be hard to ride on. So just come prepared! Really beautiful in the fall. The hike around the lake is best for adults or older kids because it is a natural path.",
   "Hidden gem in North Raleigh suburbia.  I often come here after work to hike and clear my head.  The forest here is dense and much more mature than you would expect in an urban area.  Although information is hard to come by, the place has an interesting history of being a boy scout camp during the 60's-70's.  There are random structures and shelters throughout the park that must be remnants from that time."
  ]
 },
 {
  "name": "Shelley Lake Park",
  "address": "1400 W Millbrook Rd, Raleigh, NC 27612, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4a2ad82c-9333-11ea-9b97-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "walk",
   "walk",
   "art",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=10493120137486836649",
  "source": "GoogleMaps",
  "reviews": [
   "A great place to go to enjoy some fresh air.  There is a trail which wraps around the lake which is nice for a walk, run, or bike ride.  Also a great place to just relax and take in nature.  You may see a bald eagle sighting if you visit.",
   "A great park. A pleasant paved loop for walkers. Lots of wildlife. If you keep your eyes open you might catch a glimpse of the pair of bald eagles that live in the park. You might even spot one of the barred owls if you're lucky.",
   "This is a great place to bring your furry friend for a walk. It's a 2 mile walk on a paved trail around the lake. There are plenty of open areas and spots to take a stop, sit on a bench, and enjoy the day.",
   "Since there are always people here it feels like a safe place to walk around and visit the geese and ducks, have a picnic, fly a kite, etc. There is a fishing pier but the paddle boat rentals are gone. The picnic tables and playground are near the art center at the upper parking area. Sometimes you catch a glimpse of the bald eagles that have a nest nearby.",
   "Very nice walking trail around the water. The lake is small, it's more like a 4 or 5 acre pond from back home. It is pretty and a good place to unwind if necessary. The water is dirty/muddy, and there is some trash in the water which is disappointing. There are many different types of fowl located on or near the water including ducks. Other than what I've mentioned, the park deserves a 4 star."
  ]
 },
 {
  "name": "Pope House Museum",
  "address": "511 S Wilmington St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4a7d64f0-9333-11ea-958f-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "free",
   "history",
   "tour",
   "free",
   "walking",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1101854766496808358",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome. The rich history in this place is amazing. Our group really enjoyed the tour.",
   "Very interesting part of Raleigh & African-American history! Admission is free, but please consider dropping some money into the donation box.\n\nDr. Pope was born to free parents. He graduated from Shaw University, & in 1885 he became the first African-American doctor in NC. He went on to found a medical society & health insurance company, & he had this gorgeous house built on Wilmington Street in 1901. He was a truly exceptional person; I'm surprised so many Raleigh residents seem to know little about him.",
   "This is a wonderful Museum. Been trying to get here for a year and finally visited and it was worth the wait. Only open on Saturdays for tours for a few hours but I highly recommend it.",
   "I really enjoyed my visit. I think they're only open on Saturday so check the schedule before you go. The tour guides were super. the free tour takes about 30 to 40 minutes. Be sure to stop by here as it's walking distance to most of the other attractions downtown.",
   "An amazing slice of history amongst corporate buildings."
  ]
 },
 {
  "name": "Laurel Hills Park",
  "address": "3808 Edwards Mill Rd, Raleigh, NC 27612, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4ac60736-9333-11ea-a7ea-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "music",
   "kids",
   "walking",
   "kids",
   "active",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1626424084002765330",
  "source": "GoogleMaps",
  "reviews": [
   "Love going to this park. If you have toddler age be prepared for older kids running around too. Amazing playground and love that it has all the ramps. Lots of swings and slides. We love coming here.",
   "Really wonderful park for kids. Best playground I have ever seen - it has something for kids of all ages. I have been taking my son since he was 6 months old (he is 14 months now) - he loves the swings, sandbox, slides, music areas. My nephew loves this playground just as much at 8 yrs old - zipline, basketball, monkey bars.",
   "Such a fun park for kids and families. It has recently been upgraded to become a disability friendly park so there are swings and activities that are accessible to children with disabilities. It is safe and it has a great walking area for dogs/ running and biking. There are basketball courts and fields for activities that need space and covered picnic areas for parties. The inside is very nice as well but I think the outdoor areas are the main attraction.",
   "Amazing park with a lot to do!  I bring my two year old here and she has a blast.  There are always kids of all ages running about, so close supervision with younger kids is strongly suggested.  I've never had any problems, but sometimes kids can get excited and bump into others.",
   "This is a great park with a lot of fun equipment. You have to be active here, especially if you have multiple young kids though - the high/close baluster railings make it difficult to see your kids from across the park. The park is usually very busy and a lot of fun. The park has shelter, but it is typically rented."
  ]
 },
 {
  "name": "Historic Oak View County Park",
  "address": "4028 Carya Dr, Raleigh, NC 27610, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4b09c702-9333-11ea-85ca-14b31f159f22.png",
  "tags": [
   "walk",
   "historic",
   "history",
   "tour",
   "history",
   "kids",
   "free",
   "knowledgeable",
   "historic",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=564032737637642302",
  "source": "GoogleMaps",
  "reviews": [
   "There’s so much to explore here, even on a cloudy, winter day! There are indoor exhibits in several well-kept historic buildings and barns. The Farm History Center (like a welcome center) includes an adorable, well-stocked play area for little ones. My toddler loved it! The grounds are pleasant and easy to walk. There are some cute, friendly goats that enjoy carrots (bring your own). I was very impressed by this park and everything it has to offer!",
   "Just completed an absolutely lovely Christmas tour of the homestead and park. It was a completely charming hour spent. The 27 acre site is wonderfully preserved and well maintained. Donna was both an affable and informed tour guide who guided us through the various owners and history beginning with the antebellum period thru the Civil War and then on to the Victorian era followed by the Depression period up through WWII and then onto modern times. She did an amazing job and is an asset to the park. I learned so much and a fun time was had by all. I look forward to returning in Spring when the flowers are in bloom. A total jewel of a park for Wake County residents and it's visitors.",
   "This place is pretty cool! I thought my kiddos would be bored since they're young, 3 years and 1 year, but it was the opposite. They loved running through the beautiful grounds, seeing the chickens and goats but especially the inside exhibit with play kitchen/market and dress up costumes. We'll definitely be back!",
   "Amazing free park! The visitor's center has a fun play area with a market, books, puzzles, costumes etc. Kids can play in the barn and explore the gardens. Each building has interesting displays for all ages.",
   "Wow..this place has it all. A historic 19th century farmstead lovingly preserved. Has a  wonderful visitor center, exhibits on the history of North Carolina's agricultural heritage.  Goats in the barn. A walking trail, picnic shelters and fishing. The staff  is very knowledgeable. It's a place catering to every age group and every season."
  ]
 },
 {
  "name": "William B. Umstead State Park",
  "address": "8801 Glenwood Ave, Raleigh, NC 27617, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4b711498-9333-11ea-924b-14b31f159f22.png",
  "tags": [
   "pets",
   "nature",
   "walking",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=9392629552417000591",
  "source": "GoogleMaps",
  "reviews": [
   "The boat rental process is really simple and fun for an afternoon of paddling. The trail system is extensive and well marked. It's a great place for trail running! Parking is hectic on the weekends, so plan to get there early if you want to park inside the park.",
   "Those of us that live in the area are fortunate to have a state park so close by to urban areas.  I run often in the park and sometimes fish.  It is a great getaway, as the park is fairly large with numerous trails and lakes.  The hills can be quite challenging, but it's a good place to train for running.  The turkey creek loop is challenging and scenic, and can be used for running, cycling, and horseback riding.  I have camped here once, and it was a pleasant experience, just need to request a space in advance.  There is a large downed tree on Graylyn trail that was beautifully carved by an artist, that is worth seeing.",
   "A fine State Park with a good variety of activity opportunities. I have enjoyed a number of trails of differing lengths in spring, fall and winter, and have never come away disappointed. For a first visit, I would recommend the entrance on the US70 - Glenwood Avenue - rather than the other possibilities. The Visitor Center is a good first stop. But there is so much to go for! The only negative factor: the Park, at least in the more northerly parts, is never peaceful. RDU air traffic is the main cause of the noise. Don't let that stop you going, though!",
   "Well maintained trail. Lots of locals and their pets. Trail hikers and runners and families all walking at the same time simply enjoying the nature and peaceful environment.",
   "One of the best place. Being a lover of nature , i've never seen such a beautiful place. This park has so much of beauty!!"
  ]
 },
 {
  "name": "Gregg Museum of Art & Design",
  "address": "1903 Hillsborough St, Raleigh, NC 27607, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4bcbbaa8-9333-11ea-9fe1-14b31f159f22.png",
  "tags": [
   "free",
   "family",
   "free",
   "creative",
   "unique",
   "free",
   "art",
   "free"
  ],
  "link": "https://maps.google.com/?cid=178776256928992613",
  "source": "GoogleMaps",
  "reviews": [
   "A great little museum with a constantly changing collection. Definitely worth checking out if you're in the area. The free admission certainly sweetens the pot.",
   "Nice place to visit with friends and family. I had been to a scavenger hunt event here. It was fun.",
   "My first visit.  Small museum but interesting visiting exhibitions.  \nCurrently a collection of contemporary southern photography.  But for me, the collection of imaginary fauna from the Hokes Archives by Beauvais Lyons is wonderful.\nFree parking.",
   "See below for a recap of current exhibits.  It's free!  See photos, too.\n\nThe Gregg Museum of Art & Design reopened in its current home at 1903 Hillsborough Street on August 26, 2017.  The museum includes the renovated original NC State University Chancellor’s residence and a recent addition.  The grounds and patios are also a magnificent escape from a busy urban environment.  Include the gardens and paths in your visit.\n\nEntrance to the museum is free, as is parking.  There’s a room in the museum for children to sit and draw and plenty of places for parents and other visitors to sit an enjoy the beautiful environment.  Many old and majestic oaks remind of the time when this was the Chancellor's home.\n\nRestaurants are plentiful just across Hillsborough Street, including David’s Duck & Dumpling, Players Retreat and Gonza Tacos y Tequila (next to the new Aloft Hotel across from the Bell Tower)\n\nCurrent (2019) programs:\nNow open through September 8, 2019\nSouthern Surreal — Masterpiece Furniture\nby Tilden Stone\nDon’t miss the eccentric furniture masterpieces by North Carolina’s greatest unsung master maker!  This exhibit presents a unique, beautiful, artful and whimsical stroll through the mind of Tilden Stone as seen through his masterful and creative furniture.  The exhibit is world-class and would not be out of place in any museum.  That it is here in Raleigh is a great gift to the community.  Plan a visit!\n\nNow through July 28, 2019:\nBorderlands – Evidence from the Rio Grande\nby Susan Harbage Page\nDocumentary photos and found objects from the US/Mexico border.  This exhibit brings the border crisis off the newspaper and TV screens and places it in a very poignant perspective.  I was unexpectedly engaged and educated on the human side of the difference between an ‘us’ and a ‘them.’\n\nNow open through July 28, 2019:\nExplorations — Science Sculptures\nby Christina Lorena Weisner\nSculptures with a scientific twist link the gallery with earthquakes, meteorite strikes, and ocean waves\n\nNow open through June 23, 2019:\nLeft-Handed Liberty — Self-Taught Art\nfrom the Permanent Collection",
   "Great little Museum, till the end of the year they have photos of the South series, a science of genetics gallery, and a whimsical animal gallery. The cost is free they ask for a donation. Not to be missed."
  ]
 },
 {
  "name": "WRAL Azalea Garden",
  "address": "2619 Western Blvd, Raleigh, NC 27606, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4c137234-9333-11ea-9069-14b31f159f22.png",
  "tags": [
   "family",
   "tour",
   "walking",
   "tour",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11721465260578731573",
  "source": "GoogleMaps",
  "reviews": [
   "Cute and quaint gardens that are perfect for portrait sessions. We recently photographed a family at this place and loved how the photos turned out. Photos by: Keepsake Memories Photography",
   "We took a stroll through the garden before doing a tour of the studios. Unfortunately, the azaleas were not in bloom, but several of the rhododendrons were. They have a wide assortment of azaleas and I can only imagine how beautiful the garden is when they are in full bloom. The gardens are well maintained and all the plants are very healthy. They have good signage so you can identify different plants. Overall, a fun experience. We will definitely visit again.",
   "Beautiful park in Raleigh for photos, especially gorgeous when the azaleas are in full bloom! It's very well maintained and has great walking paths throughout the garden.",
   "We took a stroll through the garden before doing a tour of the studios. Unfortunately, the azaleas were not in bloom, but several of the rhododendrons were. They have a wide assortment of azaleas and I can only imagine how beautiful the garden is when they are in full bloom. The gardens are well maintained and all the plants are very healthy. They have good signage so you can identify different plants. Overall, a fun experience. We will definitely visit again.",
   "This place is fantastic. It's rarely crowded unless there's an event that is happening. Watch out for prom season for example. The best time to go is definitely in the spring as I feel the flowers are in bloom during that time. Though there are plenty of year round flowers that can be seen. There are plenty of paths to walk around as well as plentiful seating. Great place for a date or family. You may even catch a wedding."
  ]
 },
 {
  "name": "Sassafras All Children's Playground",
  "address": "3808 Edwards Mill Rd, Raleigh, NC 27612, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4c6ae134-9333-11ea-a4c8-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "family",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=8025511127489661654",
  "source": "GoogleMaps",
  "reviews": [
   "Tremendously fun playground with area for all ages, and some very cool swings, gliders, and rockers. It's beautiful, large, and bordered by a small lake and a large community center. There are covered pavilions for picnics and birthday parties. There are so many cool pieces to play with, and several playgrounds, including a sand pit for the littlest ones. A small path surrounding the park is good for light exercise. There is also a basketball court, baseball field, and soccer field directly adjacent to the playgrounds. Absolutely awesome!",
   "This park is full of enjoyment and excitement for my toddler. They do have different sections for older and toddler kids. Its nice clean, family friendly park with options for older kids to play basketball as well.",
   "This playground is massive. It's like they took 4 separate jungle gyms and put them together. Plus: a sand pit, swings, and zip line. Very wheelchair friendly. Nice bathrooms and a walking trail around a lake. My 3 year old spent hours playing here and didn't get bored once.",
   "The only reason I didn't give five stars is because of inconsistent closures throughout the year. Otherwise, it's a great playground for both young and school age children. Multiple slides and swings available. Also, there are zip line style swings for all age kids. It's a nice place for beginning walkers, with ramps and nice wide passages on the jungle gyms. There is a covered pavilion and a few picnic tables on the grounds. There is a pond with a small walkway and a basketball court available as well. The bathrooms are convenient and clean and there is ample parking.",
   "Wow! This playground is amazing! Lots of fun new equipment to play on."
  ]
 },
 {
  "name": "North Carolina State University Memorial Belltower",
  "address": "2011 Hillsborough St, Raleigh, NC 27607, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4cbfb864-9333-11ea-82bf-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "tour",
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9488883572045042632",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful architecture. Makes me think of my father and the journey he must have had throughout his college years.",
   "This was a nice stop while we were in the area. The tower is beautiful and hearing the bells is definitely amazing. Plus the area around it has tons of grass which us great for kids to run and play. The area is perfect to park and walk the street as there are some cute little restaurants and shops nearby. Great monument at the gateway to North Carolina State University. Hope you get a nice sunny day to take good photos",
   "I got a tour of the Bell Tower from inside, guided by Dr. Thomas H. Stafford Jr. The newly created green space on the north side of the Talley Student Union is named the Stafford Commons in recognition of Thomas H. Stafford, Jr’s years of service to the university. \nDr. Stafford briefly narrated the history of the Bell Tower, it's significance and the timeline of its construction. After narrating the history, he asks us a question based on the names of the fallen heroes carved on the granite inside the Bell Tower. When no one is able to answer the question, the answer leaves us amazed!",
   "A beautiful monument. The Belltower is definitely an essential sight of Raleigh with great significance for the North Carolina State University students and community. I can't wait till the new bells are installed and ringing.",
   "The impressive Bell Tower and lovely Harden Family Memorial Gardens, adjacent to the North Carolina State Capitol, Raleigh, make a fine place to rest and meditate on life's blessings and challenges. Being right next to the First Presbyterian Church makes the spot convenient for worshipers, as well. Very nice tower, represents the university. Lights up red when NC State win a game."
  ]
 },
 {
  "name": "Lake Crabtree County Park",
  "address": "1400 Aviation Pkwy, Morrisville, NC 27560, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4d0c9fd2-9333-11ea-9f31-14b31f159f22.png",
  "tags": [
   "kids",
   "hike",
   "field",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15267774224144710442",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome set of hikes and mountain bike trails. Both aspects have intermediate to advanced levels. I personally was doing hiking and found that my couple mile hike around one side of the lake to be engaging and fun at the same time. My son got to play on the new playground that have intriguing learning activities for kids of all ages. There was different obstacles, musical toy steel drum, couple slides, and little critical thinking activities with blocks and magnets. Overall, great place to just get out of the house and enjoy the great outdoors, right in Raleigh's \"backyard\". Also attached to the Greenway for runners and bikes",
   "They have a great mtb trail system that is while lesser known very enjoyable. The woods are beautiful and the sunsets are great. I used to really enjoy sailing there but they sadly got rid of that. Back to the trails there are some titles “black diamond” but they are more like intermediate but the jump trail is very enjoyable they aren’t huge but they are smooth and well built and easily gaped. Overall it is a great park and has fun trails and all sorts of activities to do I would highly recommend coming here just be warned that if it rains the trails will be closed for at least 2 days.",
   "Turns out to be a great park. Kiddos love it. Lived here 8 yrs. Visited only a few times. So much to do.  We visit here often",
   "Great place to find a variety of birds, some pretty views, half the times I come here I see male and female bald eagles flying over the lake (be patient and look closely as they can be tricky to spot amongst the large flocks of gulls cormorants and other birds). By the North (aviation pkwy entrance) parking lot there is a big field for kids to play and 2 sand volleyball courts. 6 mile trail around the lake; gets narrow and a rocky on the NE side where trail runs alongside the road.",
   "The beech picnic area and playground are great! Our 18 month old had a ball running around. The park is clean and the picnic area was great!"
  ]
 },
 {
  "name": "Moore Square",
  "address": "226 E Martin St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4d59607e-9333-11ea-9c7d-14b31f159f22.png",
  "tags": [
   "theatre",
   "kids",
   "family",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=555647733527557799",
  "source": "GoogleMaps",
  "reviews": [
   "Moore Square is a wonderful small community. It is always so positive. Marbles kids museum has fun things for small children to do and visits will be playing there quite often. Every once in a while on Sunday they will play a movie sponsored by the IMAX theatre. Pianos provide musical fun. Square Burger is a cute little restaurant for a quick meal. Superb milkshakes. Behind Square Burger is an innovative playground for kids.",
   "They really cleaned this area out nicely. The bus station is clean & a bit safer, the park is huge & beautiful, & they built a nice little burger joint convenient to anyone in that area. I had a great time there with my family & we for sure will return.",
   "The Bus Drivers are very helpful when I am getting on the bus and off  I'm in a wheelchair with one leg. They make sure that I am locked in. Keep up the good work. go Raleigh Busses Thank you'll so much. be Blessed always.",
   "This is a great place to come and experience Raleigh community. Greenspace right in the heart of downtown. Safe, peaceful, relaxing. Kids having a blast playing outside in the fresh air.  Definitely check it out!",
   "First time going to 1st night with the family and it was a lot of fun. Tons of activities for all members of the family regardless of age. If you haven't been, 2021 would be a great way to start your new year here"
  ]
 },
 {
  "name": "Prairie Ridge Ecostation",
  "address": "1671 Gold Star Dr, Raleigh, NC 27607, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4dc17318-9333-11ea-8c92-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "nature",
   "kids",
   "nature",
   "knowledgeable",
   "learn",
   "kids",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=3740822021947594191",
  "source": "GoogleMaps",
  "reviews": [
   "A great place to bring the family regardless of age. The nature playspace is perfect for little ones to run around and play. From the sandbox to the camping area to the stage and all things in-between, there is plenty to keep the kids entertained. Plus the hiking trail is just long enough to stretch your legs and enjoy the outdoors.",
   "What a great place for kids of all ages! Lots of places to get dirty, climb, dig for fossils, and be in nature. Plenty of seating for adults, shade, and all the activities are close to each other.",
   "Wonderful place, always plenty of interesting activities for all ages and knowledgeable educators",
   "Awesome place for the kids to play and learn about natural. Great for helping to cultivate a love for the outdoors in a controlled environment",
   "Really cool shaded playground. Definitely one of the top free best place to bring the kids in Raleigh. Only complain is that they don't have any trash cans, so be prepared and bring empty bags to pack any trash that you might have."
  ]
 },
 {
  "name": "Adventure Landing",
  "address": "3311 Capital Blvd, Raleigh, NC 27604, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4e24042e-9333-11ea-9cca-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9371946449213335595",
  "source": "GoogleMaps",
  "reviews": [
   "This place is a lot of fun to bring the kids. It's a little older and run down than some of the newer places but just as fun. They do not serve beer or it would be a fun place for adult groups to meet as well. Take the kids and have a great couple hours.",
   "Had a 7 y/o birthday party here. For the price, I was very impressed. It was all inclusive, and all the kids were tired when they left... So mission accomplished! The staff was pretty awesome, and the facility was nice. Only request is that they should serve beer for the grown ups, but oh well =)",
   "I wish I could give this place a better review but every time my family and I have been it’s been terrible. The machines are constantly broke, bathrooms are always terrible with no toilet paper and the #1 thing that bothers me is that the employees always seem annoyed especially if you need help because THEIR machine is broken, just haven’t experienced a good time here and I definitely would not recommend.",
   "The only reason I can't give adventure landing 5 stars is that it is in need of renovations.  It's just not a modern place.  That having been said, it's fun and the kids don't care that it's not attractive.  It's a good value.  There's almost always a Groupon available, so check that out before you pay full price.  They have laser tag, 3 mini golf courses (bumpy in places), go carts, and an arcade.  They have a snack bar with pizza and fries and stuff like that, but I've never eaten there.  Your kids will have fun here.  You might crave different scenery, but you'll be happy you're not forking over a small fortune for the kids to have fun.",
   "Maintanence was obviously very low. Good atmosphere but two of the three machines took my coins. Staff was good but games definitely need an update"
  ]
 },
 {
  "name": "Joel Lane Museum House",
  "address": "160 S St Mary's St, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4e6ca636-9333-11ea-b3dc-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "history",
   "tour",
   "tour",
   "family",
   "history",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=10150322984432664094",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to get in touch with local history.  Multiple buildings, and outdoor exhibits during their bi-annual open houses.  The docents are all welcoming and very knowledgeable.  Note that due to the historical design, not all areas are handicapped accessible.",
   "The Joel Lane house is one of my favorite places to visit in Raleigh - it's the oldest house in Wake County.... 1769.  The tour cost about $7 or $8 and the entrance fee is worth it and goes toward the restoration of the property.  Make sure you tour all the buildings.  It is worth attending one of their special events when the staff and volunteers are in period costume.",
   "This visit was a planned stop. I had read a bit about the Joel Lane Museum and wanted to know more. We went on a 45-60 minute tour of the house and small grounds surrounding, guided by the museum director. He was very informative and gracious and obviously had a true interest in sharing what is known about Joel Lane and his family. We enjoyed this tour immensely and would recommend it to anyone with an interest in history and culture who is traveling in the Raleigh area.",
   "Very nice small living history museum. A great view into colonial history of Raleigh.",
   "The volunteers are very informative and gave a nice tour"
  ]
 },
 {
  "name": "Raleigh-Durham International Airport Observation Park",
  "address": "W International Dr, Morrisville, NC 27560, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4eb1ec88-9333-11ea-901d-14b31f159f22.png",
  "tags": [
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6024886502793253930",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great place to watch planes taking off and landing! While we were there, on a Sunday afternoon, we probably saw at least twenty planes landing and taking off during the hour we spent at the observation park! Definitely a great place to take children! There is a runway area and a sand box that they can play in!",
   "Haven't seen a really good sunset yet. I'll keep trying. It's a nice spot. Never more than a handful of people there and there's a small playground. Wouldn't call it a destination but if you're close or passing by during sunset it's probably worth a stop",
   "My husband visited this place yesterday. \n\nHe says it's a good place to see the planes flying. \n\nThe frequency of planes coming here is definitely less. \n\nSo you need to spend few hours in hand to enjoy the show. \n\nThe place is sunny. \n\nThere is place to stand. \n\nThe places is vibrant. \n\nThe place is definitely good for kids. \n\nThe place is good for oldies too. \n\nIt is easily accessible. \n\nGood washrooms",
   "Awesome location to watch 👀 airplanes ✈️ take off!!!! Great place for your child to play while watching the planes take off! 😊🛫🤸🏽‍♂️",
   "Started hanging out here when my son was 1.  He is now 16.  He still enjoys it and has a complete fascination with airplanes now!  Take a picnic and enjoy your time there.  They have a small kids area for the little ones to enjoy."
  ]
 },
 {
  "name": "Horseshoe Farm Nature Preserve",
  "address": "2900 Horse Shoe Farm Rd, Wake Forest, NC 27587, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4f10aed4-9333-11ea-9fc1-14b31f159f22.png",
  "tags": [
   "walk",
   "field",
   "parks",
   "kids",
   "historic",
   "family",
   "parks",
   "field",
   "nature",
   "walking",
   "music"
  ],
  "link": "https://maps.google.com/?cid=4037425064454311208",
  "source": "GoogleMaps",
  "reviews": [
   "If you want to find some peace and quiet this is a good place for it..there are trails to walk and ride bikes.  There is a large field and plenty of wildlife around.  There is a picnic area as well and it's covered.  Public bathrooms are there.  enjoy!",
   "Good example of a city and surrounding towns integrating greenways, natural areas and parks to connect neighborhoods. Their efforts should be a benchmark for other towns to encourage outdoor recreation and connectivity in North Carolina.",
   "It's pretty sparse if you are looking for playgrounds or things to entertain kids but it's excellent for a big space to run around, see small wildlife, and great access to the Neuse River Greenway. It has a nice picnic shelter and public bathrooms. There is a historic farm house but we have not visited it yet. The parking area closes at night so make sure to check the park times before going.",
   "A pretty small, but charming park. A good place to bring the dog. Lots of open space to spot dear in the early hours of the morning",
   "I personally enjoy the park as just a nice nature area to relax and hang out with the family. Maybe have a picnic, listen to some music. It's a large field with a nice trail for walking or biking. If you prefer parks with more attractions then look else where."
  ]
 },
 {
  "name": "ROOM 5280 - Raleigh Live Escape Games",
  "address": "123 Glenwood Ave, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4f69563a-9333-11ea-84e4-14b31f159f22.png",
  "tags": [
   "unique"
  ],
  "link": "https://maps.google.com/?cid=10859550817494931022",
  "source": "GoogleMaps",
  "reviews": [
   "Went here for a work/team building outing and we all had a blast! Andrew, our host, did a great job running both the Sherlock and Dark rooms we did. The atmosphere of the stories behind the rooms were engaging and the my group was able to finish with minimal clues. Clues were given to us only twice, and they were only ever confirmation of things we had already figured out but by chance hadn't worked. Would definitely recommend trying this place out with any medium-to-large group",
   "Had a great time here! Andrew is really friendly and is a great host. The place is located downtown (good location and parking) and is literally in a house. The rooms were well designed and both our groups were able to complete the puzzles! It is great for team building. However, the gadgets/contraptions used were not the most advanced that I have seen! Would still definitely go again.",
   "What a great experience! Our group of six did the Heist room and had a wonderful time. The puzzles were challenging, but not impossible, so we never felt like we were at an impasse. It took the ideas and contributions of all of us to solve the puzzles. Everything was very inventive and well thought out. It was such a sense of accomplishment to finish each puzzle and escape from the room! This would be a great team-building experience. I’m looking forward to going back and trying another room. Highly, highly recommended!",
   "We did the Sherlock themed room. It was fun and had some cool features, but it wasn't overly high-tech or unique. The hostess also came over the intercom and gave us a couple clues that we did not ask for, which was a bummer. However we only had 3 minutes to spare when we escaped, so maybe it was better that she did that.",
   "This was our first for escape rooms & we really  enjoyed.  However the room became uncomfortably warm & the smaller room was hot.  I was sweating slightly & my friend's mom had sweat all over her face.  Thankfully she pulled out a large folding hand fan to cool herself down."
  ]
 },
 {
  "name": "Historic Yates Mill County Park",
  "address": "4620 Lake Wheeler Rd, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4fbaf8ee-9333-11ea-bdf2-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "knowledgeable",
   "family",
   "tour",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=8688023163729469610",
  "source": "GoogleMaps",
  "reviews": [
   "This is a beautiful place to visit. It is very easy to find, easy parking. They have some hiking trails, you can walk around the lake. The visitor center is very informative and kid friendly. They have a kids corner where the kids can play and also dress up. \nThe mill itself is very pretty, they offer tours on weekends. \nThe bathrooms were clean and wheelchair accessible. The boardwalk and visitor center are wheelchair accessible as well. \nI would definitely visit again when I'm in the area again.",
   "As new residents of NC, our family visited Yates Mill on a sunny day in March. It is an excellent historical and scenic tour. Our guide was compassionate and knowledgeable about the Mill and its surroundings. Restoration of the mill after Hurricane Fran is a prime example of what a group of concerned citizens can accomplish to preserve important historical landmarks to share with future generations. Thank you.",
   "I'm right along with most people who visit here. It's a very relaxing walk around the trail. Highly recommend a visit.",
   "We were visiting this area in early November. My brother and I are photography buffs. We thought the mill would be a great subject. It did not disappoint. The park is gorgeous. The museum on the grounds was an added bonus. It is a wonderful facility. I really enjoyed the exhibits and learning more about the mill.",
   "It's always a pleasure to spend time at this place, walk around or have a picnic. Definitely, a nice stop to just enjoy the view and explore a little bit."
  ]
 },
 {
  "name": "Dorothea Dix Park",
  "address": "2105 Umstead Dr, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/50076b58-9333-11ea-b332-14b31f159f22.png",
  "tags": [
   "field",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17197897820285755227",
  "source": "GoogleMaps",
  "reviews": [
   "Thank you for taking the time to grow such beautiful sunflowers for the public to enjoy! 🌻 Dorothea dix has done it again. They took the time to make an amazing sunflower garden for the public to come and view, take pictures at and enjoy. I think it’s amazing that this park continuously each year grows the sunflowers for the public. In addition, when reading one of the signs it notes that the location used to be a landfill and the sunflowers help to produce a healthier and environmentally friendly atmosphere - which is added bonus points!",
   "We came for the sunflowers! We waited a week or 2 after it looked like they were blooming so we got a full dose of sunflower goodness. I'd highly recommend this field for photographers, novice or professional. Such a lovely setting.",
   "Great place. Lots of areas. Designated a drone and RV Plane safe park. Join a local club.",
   "First time at the park and i love it and my little one as well!! It's huge, has amazing views to the city!! And the sunflowers are so pretty!!",
   "Dix park has such an interesting history and a great layout. I really enjoyed taking a tour of the old State Hospital and exploring the rest of the grounds. I visited right after they cut down the sun flowers, but it was still a beautiful area."
  ]
 },
 {
  "name": "Oakwood Dog Park",
  "address": "910 Brookside Dr, Raleigh, NC 27604, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5057ae6e-9333-11ea-bf57-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=12586213989797716464",
  "source": "GoogleMaps",
  "reviews": [
   "This was our first time going there. It's just an all around nice park for you as well as man's best friend. Come make a new friend or two. There's plenty of parking.",
   "Friendly environment. Spacious. CLEAN.",
   "There is a small and large dog section. The areas were nice and kept clean. A lot of old leaves on the ground that the dogs had a fun time playing in.",
   "The Oakwood Dog Park is an amazing park! Plenty of space for dogs to run around, and I really appreciate the double gate to ensure no pups escape while greeting a new friend into the park! There is plenty of shade as well as multiple water spigots so the dogs can stay nice and hydrated.",
   "I love this place! It's amazing to me that a dog park of this magnitude exists in such a great location on such valuable land. Our dog Gus loves being social here, greeting new arrivals at the gate, and then taking off on his self-guided circumference walks around the park. The hose with fresh water is👌, and the puppy pool is fantastic during warm weather "
  ]
 },
 {
  "name": "African American Cultural Complex",
  "address": "119 Sunnybrook Rd, Raleigh, NC 27610, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/50b49cc6-9333-11ea-ae55-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2360376060314831431",
  "source": "GoogleMaps",
  "reviews": [
   "It's closed until further notice but I met the owner and she was a sweet lady. She said they are planning to move to Dorthea Dix in a few years",
   "Intriguing the amount of information that's on hand here. History lesson  that was much needed",
   "pleasant! I've actually done community service here!",
   "Was great",
   "Would to bring our youth group back. Alot of history and a lot of love"
  ]
 },
 {
  "name": "Sacred Heart Catholic Church",
  "address": "200 Hillsborough St, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/50f9463e-9333-11ea-a45a-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=11634946006427095748",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful church amazing reminder that Gods forever present. I love to come here to admire the tranquility and beauty of this beautiful sanctuary.\n\nGod bless",
   "Beautiful Church with MAGNIFICENT Stained glass. The message was on point. Especially loved the confession immediately after Mass and the prayer garden behind the church under the trees was cool, even on a hot summer day.",
   "Sacred Heart Church is a Catholic church located on Hillsborough Street in downtown Raleigh, North Carolina, United States. The church served as the cathedral of the Diocese of Raleigh from 1924 to 2017.\n\nBishop: Luis R. Zarama",
   "Beautiful church, and, despite all the other churches we took in, the Catholic Church was the only one open. Who's welcome now? Say what you want about us Catholics, but you truly are welcome in our churches!",
   "We attended mass at Sacred Heart on a recent trip to Raleigh. The people of the parish were very welcoming and friendly. The Father was interactive and gave a great homily. The church is small in size to be a Cathedral but it has a lot of charm and history. I know the parishioners were excited about the new Cathedral opening soon."
  ]
 },
 {
  "name": "Nash Square",
  "address": "200 S McDowell St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/515d869c-9333-11ea-a286-14b31f159f22.png",
  "tags": [
   "eat",
   "walking",
   "kids",
   "parks",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=2366351978764652740",
  "source": "GoogleMaps",
  "reviews": [
   "Small but beautiful park in downtown Raleigh. We saw lots of wedding parties taking pictures here, but beyond being a scenic photo spot or a relaxing place to eat lunch, there's not much here. It seems safe enough and had lots of families strolling through on the weekend. Worth a stop if you're walking around in the area.",
   "Got some great shots of my girl on graduation day",
   "Cool little park here in the city its small but has everything you need in a small area. They have some monuments that the kids liked and cool to take pictures with. \n\nPark is well kept up, clean all around, and I didnt really see any weird people around. \n\nParking around here isn't great but sure if you live nearby you know the situation here. \n\nOverall its a nice park and would recommend checking it out.",
   "It's the closest public park within the city center. It's got lots of trees that provides shades from the searing heat when it's a hot day, tons of benches to sit and unwind on. It's close to other memorial parks and the museums. Good detour for visiting out-of-towners. It's also one of the stops in the Ghost tours provided by @TobaccoRoadTours.",
   "Beautiful place. Great atmosphere. Great place for walk."
  ]
 },
 {
  "name": "Anderson Point Park",
  "address": "20 Anderson Point Dr, Raleigh, NC 27610, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/51d04794-9333-11ea-81c6-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "walking",
   "walk",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5965735465814662180",
  "source": "GoogleMaps",
  "reviews": [
   "A beautiful place to go any day, any time. An amazing walking trail that follows the Neuse River to venture on. It's a calming and great for the kids. There's a big field, right by the park, for anything like soccer up to baseball. There is two main eating areas where a bathroom available beside the field and park.",
   "Never too busy, good for my son since he doesn't do too well with crowds. Wish the parking lot want so far from party, but it's a good walk",
   "One of my favorite places to run and bike. It's always very clean, I have never not felt safe while on the trial or in the park area. I love that there is a bathroom and water fountains available. The scenery is nice while you walk, run, or bike. I do enjoy that the landscape varies, there are hills and curves, bridges...etc.",
   "I'm sure most in the area already have been, but first time for us. Major crossroads of a number of regional bicycle trails with full conveniences including a bike repair station with tools and air pump. Bench swings, large playground, and picnic shelters. Big thumbs up!",
   "This is a great park and is a good place to fill up your water if your going for a long bike ride. The park also seems very entertaining to kids. The lighting is good at night and also seems enjoyable for a stop on biking adventures.\n\nIt also seems like a good park to have a picnic! I would recommend checking out the swinging benches here and also it's a good spot to take pictures at!\nKF"
  ]
 },
 {
  "name": "Millbrook Exchange Park",
  "address": "1905 Spring Forest Rd, Raleigh, NC 27615, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/52328d1e-9333-11ea-bd33-14b31f159f22.png",
  "tags": [
   "kids",
   "parks",
   "free",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4394442713877645950",
  "source": "GoogleMaps",
  "reviews": [
   "A fun park to play at! Plenty of benches for parents/grandparents to rest while kids play. Easy access to plenty of parking and the Community Center has access to clean bathrooms. We'll definitely be going back to play again!",
   "First time at the park. What fun! I'm impressed that dog owners were respectful and picked up after their dog. Small dog side is huge compared to other off leash parks I've been to. Such a nice day today, we had 12 dogs! Highly recommend",
   "Good quantity of hard courts (like 23). It does tend to host a lot of leagues so if you wanna know if courts are gonna be available I recommend calling. You can reserve for a fee or you can call ahead and just show up for free if something is available. The quality of the courts is pretty good. The lights are great on the lower courts. Pretty poor on the upper courts as they aren't very bright and so there are a ton of shadows. Two benches on every court is nice. They offer lessons, too.",
   "Great facility. Saw a children league basketball game. Awesome coaching skills. The referee was fantastic in teaching the fundamentals.  Outside is a playground.  Great parking and more to use on site.",
   "Loved the park! It was our 1st time there. It was clean and loved the soft turf. And the 2 different playgrounds for younger and older kids"
  ]
 },
 {
  "name": "Downtown Raleigh",
  "address": "300 Fayetteville St, Raleigh, NC 27602, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/529063ee-9333-11ea-8870-14b31f159f22.png",
  "tags": [
   "tour",
   "historic",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=11553890619286362574",
  "source": "GoogleMaps",
  "reviews": [
   "Visited 48th annual historic Oakwood candlelight tour.  Quite impressive, but is more geared toward the home's characteristics versus Christmas and it's time of year.",
   "Vibrant and trendy with lots of nice eateries and wide walkways. The people seem to enjoy it, and it feels safe.",
   "Halloween is a serious celebration at this historic neighborhood",
   "charming\nSoo love 😍😍😍",
   "I love downtown Raleigh it is always something to do."
  ]
 },
 {
  "name": "Fred Fletcher Park",
  "address": "820 Clay St, Raleigh, NC 27605, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/530b129a-9333-11ea-aa8c-14b31f159f22.png",
  "tags": [
   "music",
   "walking",
   "walk",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=15271628402653456687",
  "source": "GoogleMaps",
  "reviews": [
   "Perl of the Glenwood South district. Good for a party at a shelter. Beautiful setting for proposal and wedding. Great for jogging, walking, music etc",
   "Nice park to go walk around. Small playground has swings and some spring riding toys.",
   "Wonderful park and dog friendly! Usually full of people even on a yucky weather day. Make sure your dog is on a leash because not everyone out here adheres to leash laws or have dogs with manners.",
   "Married my husband here and walk through almost every day with my dog. It’s about the most perfect city park I’ve seen, to the point that my housing is planned around easy access. I miss the huge oaks that fell in hurricane Matthew (and the shade they provided to the playground), but this place still has a lot to offer.",
   "What a little gem of a park!  Not very large but a lovely green oasis just minutes from the heart of downtown Raleigh.  The old homes  you can walk into are beautiful.  A well kept secret worth visiting."
  ]
 },
 {
  "name": "Knightdale Station Park",
  "address": "810 N First Ave, Knightdale, NC 27545, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/535eff22-9333-11ea-b605-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "walking",
   "food",
   "parks",
   "walking",
   "brewery",
   "family",
   "walking",
   "kids",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=12215724630685922257",
  "source": "GoogleMaps",
  "reviews": [
   "The park has lots of great options for individuals if all ages. Their is a walking path, a nearby did park and fields, and playground equipment for a variety of age ranges. There is also a new splash pad area that is open during the warmer months that is pretty great.  The park is not fenced in and there is a water feature nearby that has a simple wooden fence that children can easily sneak through so not the best park of you're looking to just let your kids free roam.",
   "This is one of my favorite parks in the area. The park has slides, swings, mommy and me swings, splash playground, dog park, walking trails, sand boxes, open fields. We usually bring our scooters and bikes and ride around a little, then play on the playground. \nThe park hosts some fun events like food truck rodeos that we also enjoy.",
   "Today, it was perfect - a lovely day just before the rain, I had the park to myself. I'm not sure what it would be like when full of people. I can say that it's a lovely park with a good playground & dog park. The paths are in good condition & everything I saw was clean & well maintained. There are sports fields & a picnic shelter. On one side is a local brewery, & on another there soon will be a terrific barbeque restaurant.",
   "We love it here. The play area, is nice and diverse. The splash pad is new and has shaded seating for parents, which is definitely needed! The grassy area near the pavilion is nice, with seating. There are plenty of paved trails for walking and biking, and our family really enjoys them. We also like the pond.",
   "One of the cleanest parks I’ve brought the kids to play. Just enough to keep children of all ages busy for hours. There is a splash pad during the summer and a dog park separated for small size and larger size dogs."
  ]
 },
 {
  "name": "Greater Raleigh Convention and Visitors Bureau",
  "address": "One Bank of America Plaza, 421 Fayetteville St STE 1505, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/53a752ee-9333-11ea-a7c1-14b31f159f22.png",
  "tags": [
   "historic"
  ],
  "link": "https://maps.google.com/?cid=1912218255342533670",
  "source": "GoogleMaps",
  "reviews": [
   "Love this historic city full of life, entertainment, restaurants, festivals. See events for schedule theres always something to do.",
   "Great facility for a convention. Concessions are priced too high.",
   "The people here were extremely helpful in giving us maps and telling us anything we wanted to know about the area, how to get around, and more!",
   "",
   ""
  ]
 },
 {
  "name": "North Carolina Museum of Art Parking",
  "address": "1900 Blue Ridge Rd, Raleigh, NC 27607, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/53f5e830-9333-11ea-bf33-14b31f159f22.png",
  "tags": [
   "free",
   "art",
   "walk",
   "family",
   "art",
   "walking",
   "free"
  ],
  "link": "https://maps.google.com/?cid=13923352771323176929",
  "source": "GoogleMaps",
  "reviews": [
   "Not only is the NCMA museum free, the parking is too. Not many museums can claim that. It's a huge lot which is also popular with hikers on the art trails. If full, drive around the museum for more parking on other side. \nDuring the State Fair days, watch the fireworks over the nearby fairgrounds from here.",
   "I love going to this place. I make sure to visit at least twice a year. The outside is so fun for a nice walk with the family and the inside is great for a lunch date. Much better than going to a movie! So glad this exists in NC!",
   "Very spacious parking lot. Enough room to host quite. Few people. Love the fact no matter where you park, there is some kind of activity that you can do or see. One side of the parking lot has the art museum and the other side of the parking lot has the many walking trails. Which is another great site to see. Art all along the trails! And they seem to go so far with sculptures in the middle of the wall. There also a place where they seem to host events, like an arena.",
   "The parking lot is huge... and FREE!!! It's super easy to get into and out of, and there are a good number of handicapped spots down between the two main buildings. The only thing I could say that I didn't necessarily like was the fact that there is basically zero shade in the parking lot.",
   "Parking was very friendly, especially for those of us who are handicapped, and needed to be dropped off closer to the museum."
  ]
 },
 {
  "name": "Carolina Pines Dog Park",
  "address": "2305 Lake Wheeler Rd, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/54375e6c-9333-11ea-8400-14b31f159f22.png",
  "tags": [
   "drink"
  ],
  "link": "https://maps.google.com/?cid=1457749687582408064",
  "source": "GoogleMaps",
  "reviews": [
   "Love the openness of this park and how shady it is throughout. Just be aware that not every GPS will take you to the exact location of this park. It's towards the back, behind the baseball fields. Everyone I met was always friendly, and most watched their dogs closely. There are pools for the dogs, buckets of water for them to drink from, and potty bags all around. There's also a separate section for smaller dogs. Plenty of seating for you to enjoy while your dog socializes.",
   "I enjoy taking my cockapoo to Carolina Pines Dog Park. This is a very large dog park with three separate sections. It is fairly well maintained and the people that visit the park seem friendly and attentive to their dogs. There is plenty of parking here. There are bags and tennis balls available here to use. There is also a water spout and plenty of buckets. I recommend this dog park.",
   "Awesome dog park with friendly owners. It's separated into 3 fenced areas - one for small dogs, one for large dogs, and one that's not labeled. Be aware that while the area is handicapped accessible the ground is natural cover and slopes away from the entrance so you probably should avoid it in a wheelchair unless you have somebody to push you back out",
   "This dog park has 2 fenced areas. 1 small for small dogs & 1 big for the big dogs. Lots of trees available for tinkling on too! Actually I think the trees should be thinned out some!",
   "I love it. Has 3 separate areas. 1 huge! Area and 1 smaller and then 1 a bit smaller for small dogs. There are trees, water, and bags for the number 2s. My baby girl loved it."
  ]
 },
 {
  "name": "John Chavis Memorial Park",
  "address": "505 Martin Luther King Jr Blvd, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/548d6dae-9333-11ea-b61b-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=3552104216711284915",
  "source": "GoogleMaps",
  "reviews": [
   "Home to a wonderful 1916 Herschel carousel in immaculate condition, complete with operating band organ!  Beautifully maintained and restored, the glory of the whirling painted horses and vintage paintings could have enthralled me for hours.  The De Kleinst band organ is well maintained and sounds great as it plays \"The Time Warp\" with just a touch of ironic anachronism!",
   "Took my birthday pictures here on the stone steps. Very quiet and my kids love the playground.",
   "Nice  Park for family for the summer as well as the winter.. They have Pinic area for Winter with Fire place.. And they are getting to make the Park Even better Cant wait..",
   "Nice historical park with new carousel house (original building is still on the property), pool, and playground. The playground has vintage equipment for older kids — metal slides and ride-on toys — that creates nostalgia from my own childhood, but get much too hot to be usable on a sunny day. The toddler equipment (the label says it is designed for children aged 2–5) is made of the newer recycled plastic material, and this portion was under the shade of trees, which was nice on a hot day when we visited. The ground is sand in the entire playground area, which is quite large. There are also swings, including a few bucket style for young kids. The water fountain wasn't in operation and there was a little bit of trash on the playground, but nothing too unusual.",
   "My son liked it, but I wasn't too keen. It's close to home. I don't care for the sand or metal equipment.  2 slides were too hot to use. I wish there was a bathroom close to the playground. Otherwise,  quiet and spacious.  The toddler play set was well shaded."
  ]
 },
 {
  "name": "Raleigh Fire Museum",
  "address": "105 Keeter Center Dr, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/54efd942-9333-11ea-aa2f-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1650143552837083433",
  "source": "GoogleMaps",
  "reviews": [
   "In the museum there is a beautiful bell, and many historical objects that show us how the fire fighting evolved. Very didactic for children to visit.",
   "A fantastic small fire station currently used as a training ground. Every second Saturday of the month admission is free. A guaranteed 30 min fun for you and your kids. Parking is provided on the ground for free.",
   "Had a ton of fun bringing our son to see the truck and try out the fire hose. The little museum is interesting too.",
   "Great place to see the history of the Raleigh Fire Department",
   "Lots of interesting, nostalgic pieces surrounding the history of the Raleigh Fire Department."
  ]
 },
 {
  "name": "Lake Lynn Park",
  "address": "Lynn Rd, Raleigh, NC 27613, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/554859d8-9333-11ea-aafb-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "nature",
   "walk",
   "nature",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=9174449173397319565",
  "source": "GoogleMaps",
  "reviews": [
   "Need to rejuvenate your soul or get a quick run? Lake Lynn is one of my favorite spots in North Raleigh to do just that! The loop around the lake is 2.25 miles, all paved with a few bridges.  It’s peaceful and beautiful.  Plenty of parking too! So get your groove on and visit this gem.",
   "Very nice park/lake. Very beautiful piece of nature in the middle of town. I've always felt safe here and really like fishing, hiking and running here. Good place for the whole family and the dogs love it here too!  It's bigger than it looks from the road. I would definitely recommend this place as a great place to walk  or run. Fishing is decent.",
   "This is a great place to walk around and take in the nature around you. Great boardwalk around the lake and nice place to stop and sit. You will see different types of geese, herons, ducks and some fish too! The community center is current undergoing renovations but there is still a great playground and other recreational attractions too. You never know what you’ll see when you go out for a stroll.",
   "I had a nice walk. The trail is great for a leisurely walk especially if you're a lake person. The runners and dog walkers were courteous. I'm surprised more people weren't fishing. I saw bass all over.",
   "It's a great place for a quiet stroll with lovely sites. You can find all sorts of birds and turtles around the area. And if you're a pokemon go fan, there are several gyms and stops around the way."
  ]
 },
 {
  "name": "Oakwood Cemetery",
  "address": "701 Oakwood Ave, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/558fc358-9333-11ea-b717-14b31f159f22.png",
  "tags": [
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=5506603893640086050",
  "source": "GoogleMaps",
  "reviews": [
   "As a cemetery enthusiast I loved visiting! the grounds are lovely. a great place to just visit.",
   "My eight-time great-grandfather Martin Pfeifer and my family was buried there can't wate go visted some day",
   "My Father is in this cemetery along with my Grandparents, and everything has been okay until today. My family planned a remembrance dinner in my Father's honor, so we called the cemetery and checked the Google page hours and both showed it was open until 6pm.  I pull up to the main gate at 4:57pm and it's chained shut, now we can't go visit my Father and the head lady there named Robin tells me they close early after the clocks are set back.  Not sure why, since it's 5:30pm and the sun is still out...I'm very displeased right now since I drove 45 minutes from Benson and the rest  of my family was meeting me there.",
   "Beautiful cemetery!",
   "AMAZING"
  ]
 },
 {
  "name": "Midtown Park",
  "address": "4011 Cardinal at North Hills Street, Park at N Hills St, Raleigh, NC 27609, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/55f78766-9333-11ea-8abb-14b31f159f22.png",
  "tags": [
   "food",
   "kids",
   "pets",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=17160480764869189950",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice place.  I visited the park the last weekend during The Wine Fest. I enjoyed the place very clean and nice.ill be back for sure.",
   "Great public space. Was here for a classis motorcycle show, and the venue was perfect for it. Wish there was something like this in my hometown.",
   "Fantastic modern feeling area with great entertainment , food , and lodging accommodations. This area can even make a bowling alley look classy!",
   "Had the relay for Life of Raleigh there. Fantastic area! Parking plentiful because of the various parking decks! Wonderful balcony apartments( lucky people who already live there!) Nice outdoor venue for the band we had. Nice play park for kids and pets (gotta bring the leash! ) It's within walking distance to a variety of eateries, grocery stores, and hotels.The entire area was so clean!! Literally, we were amazed at the upkeep! Felt safe even at night!  If I had known about this place, I would have searched  to live here myself:-) I will definitely be back! Kudos to the establishment!!",
   "Beautiful clean park. We went when nothing was going and it was beautiful. The tree also light up at night."
  ]
 },
 {
  "name": "Dr. Martin Luther King, Jr. Memorial Gardens",
  "address": "1215 Martin Luther King Jr Blvd, Raleigh, NC 27610, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/56713046-9333-11ea-983f-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=16187522946691108842",
  "source": "GoogleMaps",
  "reviews": [
   "THIS IS VERY BEAUTIFUL FOR REV. DR. MARTIN LUTHER KING ! TO HONOR ALL THAT HE STOOD FOR",
   "The monument was quite beautiful and along the walls the famous and inspiring words of MLK were carved into stone. Reading them really gave me a sense of who he was. The location and the actual monument itself are quite pretty. The statue is quite impressive too.",
   "Nice clean public park. Small but efficient.  Plenty of parking and self interpretation.",
   "It's awesome to have such a nice park dedicated to Dr. King. He is a very prominent and determining factor in where America is today. He is sorely missed but will never be forgotten.",
   "As a European American who rejects bigotry and mourns the victims of slavery in teh Americas, my visiting this memorial was especially meaningful. It is a pleasant place to be, as it denotes the peacefulness that MLK advanced. The park represents the commitment of the Raleigh community to inclusiveness and civil rights. It reminds one of the righteous stature of a man who stood up for the American creed (All persons are created equal), for the true meaning of religion (Love), for human brotherhood, and for (Yes), the Dream. It is simply a park, not a museum or historical site. Plan a family get-together, a picnic, or just walk around and enjoy the landscape. Read the inscriptions on the fountain. It is small in size as parks go, but what it represents is huge."
  ]
 },
 {
  "name": "Carl Alwin Schenck Memorial Forest",
  "address": "Raleigh, NC 27607, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/56d5483e-9333-11ea-b379-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=14820699464765254474",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful trails, alot of trees down probably some major going on.",
   "Beautiful place to walk around and enjoy nature. Trails are not very well marked so make sure you have your GPS/Phone with you.",
   "Beautiful and well maintained forest just outside of Umstead Park. \nMuch fewer people compared to Umstead or Eno and the Forest is in great shape as it’s essentially and laboratory for forestry students at NC State. \n\nThe trails are short and make for a nice 30-75 minute hike. \nDirt road to enter and may be muddy after some rain.",
   "Love that u can just go wherever  no dogs sadly  but there are many deer trails!! Great park!",
   "Fantastic place to go if you want to spend time hiking around. I go out there often with my classes at NCSU. \n\nYou can yell in the forest and it's so dense that no one will hear you, but do be respectful of wildlife.\n\nThere are pine orchards that were planted in the 80's that are fun to find. Try identifying all of the different trees, you will have a blast!"
  ]
 },
 {
  "name": "Carolina Touring Company",
  "address": "W Martin St, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/57258b68-9333-11ea-8203-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "family",
   "tour",
   "historic",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=8553373400671170141",
  "source": "GoogleMaps",
  "reviews": [
   "Loved our scooter tour of Oakwood today. Our guide Todd was extremely knowledgeable and the scooters were a ton of fun to ride. I've lived in Raleigh for 27 years and learned a lot about its past and present while on the tour, so this tour is great for locals and visitors alike.",
   "We had a fabulous time this past weekend with Mimi in Raleigh learning about our home city!!!!  Ryan was also a terrific host. Strongly recommend for friends, family, locals or tourists. Thank you Mimi and Ryan.",
   "Fun ride!",
   "Yes, better than Segways! These machines are delightful to drive. Expert training in 5 minutes. The tour was Historic Oakwood and very very insightful. Headphones so ya can hear the guide, but still hear traffic and talk to someone. Highly recommend this experience!",
   "So much fun! Our tour guide was great! What a wonderful way to get to know Raleigh 👏🏼"
  ]
 },
 {
  "name": "Sertoma Arts Center",
  "address": "1400 W Millbrook Rd, Raleigh, NC 27612, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5778db9c-9333-11ea-9b26-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "walk",
   "art",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=16304323098062912408",
  "source": "GoogleMaps",
  "reviews": [
   "Love the trails but wish the water fountains worked when I was there.\nDid tai chi on the grass with a group and had an easy time of it.\nHave also been here to vote. \nHandicapped parking is easy to access and use when I need it. Plenty of other parking for when I don't.",
   "The clay studio is always very clean, the staff and other potters are all friendly and knowledgeable, and there is a clear and orderly firing system.",
   "Always a nice place to visit and see some art as well as take a walk around the lake.",
   "At Shelley Lake Park. Nice art exhibits, playground, lake, creek, 2+ mile paved greenway. Saw art, geese, ducks, heron or two, some turtles, bikers, walkers, kiddos and doggies. Great place to spend some quality time.",
   "Pottery studio here is great. Wheel and handbuilding classes are run by fantastic potters. If pottery isn't your thing, take an art class, jewelery making class, or a fitness class. Hidden gem located at a great city park."
  ]
 },
 {
  "name": "Buffaloe Road Athletic Park",
  "address": "5812 Buffaloe Rd, Raleigh, NC 27616, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/58227e68-9333-11ea-9a58-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "family",
   "walking",
   "food",
   "field"
  ],
  "link": "https://maps.google.com/?cid=17955016753191817255",
  "source": "GoogleMaps",
  "reviews": [
   "Nice dog park in back. We we t to walk on the connected Nuse River trail. Easy parking. Nice track. Haven't checked out the aquatic building.",
   "This park is incredibly well maintained. It is connected to the neuse river Greenway and is a good place to park and walk. They have a lovely dog park that has a good bit of shade.",
   "Great for walking and bike riding , extreemly clean trails, there is a dig area and aquatic center here . Great for family outing .",
   "The food is good. They work fast and the place is clean. Is very busy as well. The parking lot is very busy and small, is a bit difficult to get in and out. Overall it's a good place.",
   "This park has a few great features including a nice playground area (next to restrooms), an open space multi-purpose field surrounded by a 1/4 mile track, several baseball fields, and an aquatic center. The only negative about the park is that they keep the baseball fields locked up. So don't go expecting to \"bat a few balls around\". Another drawback to the park is there are only a couple picnic tables next to the playground. There are no other tables in the park. The best feature, and probably least used, is the access to the Greenway. You can find this access near the aquatic center."
  ]
 },
 {
  "name": "Cedar Hills Park",
  "address": "5600 Sweetbriar Dr, Raleigh, NC 27609, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5886bee4-9333-11ea-a9e3-14b31f159f22.png",
  "tags": [
   "field"
  ],
  "link": "https://maps.google.com/?cid=10050314979829974454",
  "source": "GoogleMaps",
  "reviews": [
   "I come here to play disc golf fairly often. I like this coarse. It has some challenging holes and most are fairly wooded. I think Kentwood is better for beginners but this is a nice moderate next step up.",
   "Great frisbee course and location grills and benches also available",
   "Nice facility.  Has an 18 hole disc golf course that is excellent.  Children's playground is available.",
   "Clean park, lots to do. Disc golf course is fun and challenging with a mixture of wooded and open holes. Have basketball courts and tennis courts along with a playground. Good place to spend an afternoon.",
   "Fun local disc golf park. Rarely crowded. There is also tennis courts, a baseball field and a playground."
  ]
 },
 {
  "name": "Sunflower Field",
  "address": "Raleigh, NC 27606, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/58dc58fe-9333-11ea-8cab-14b31f159f22.png",
  "tags": [
   "field",
   "family",
   "field",
   "art",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=13429699329137732088",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful, well-maintained fields that attract a lot of visitors. Do come early to avoid crowds and heat. Several varieties are planted from multi-branching to dwarf to mammoth Russian sunflowers. Expect to spend 40 to 60 minutes or more exploring the many rows and paths. Lots of good picture spots. Watch for bees and please don't pick or destroy any sunflowers.",
   "I'm so glad we have sunflowers!  I miss the old field but understand why they were moved to here.  I like they're so close and parking (legal) is adjacent to the field.  Thank you for these gems!",
   "GREAT park. Man, City of Raleigh did good planting these flowers here. When we visited, there were so many people there taking pictures and just enjoying the scenery. We saw a ton of bees, which is one of the best reasons to see these flowers in bloom! Thank you, City of Raleigh.",
   "Beautiful flowers, good for picture taking. Family friendly, but don't come on a hot day!",
   "Always a destination worth visiting in late summer. Love these huge fields of happy flowers :) great photo opportunities. \nThis field is part of Dorothea Dix park which is North America’s largest green space inside city limits! Events are happening here all the time. Art, music, food, etc. Definitely worth stopping by."
  ]
 },
 {
  "name": "Yates Mill Museum Entrance",
  "address": "4620 Lake Wheeler Rd, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/593575e6-9333-11ea-b113-14b31f159f22.png",
  "tags": [
   "walking",
   "tour",
   "family",
   "walking",
   "wander",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12656712486196329243",
  "source": "GoogleMaps",
  "reviews": [
   "Great walking trail around the lake. Feels like you are further away from the city. We saw a deer which was a treat for us. The falls near the mill are really nice too. I would go back there for sure if I come to Raleigh again.",
   "Beautiful place! Can be tricky walking for little ones with large rock areas that can be a little slippery. The tour was fun. Buys place on the weekends around the fall due to family photo taking. Otherwise a great place!",
   "Beautiful trails and really cool bridge. The mill is in great shape.",
   "Was a awesome piece of history,  and it get to wander around on your own at you own pace.",
   "Beautiful Mill and really nice indoor museum with tons of great information and things to see from the area."
  ]
 },
 {
  "name": "Glenwood Grill",
  "address": "2603-151 Glenwood Ave, Raleigh, NC 27608, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/598fd9c6-9333-11ea-a0f0-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=320205646391686524",
  "source": "GoogleMaps",
  "reviews": [
   "I came here Monday with my guy. We googled a few places and wanted to try a place new to both of us. We made reservations weeks in advance and figured because it was a Monday it would be chill. Nope. We were wrong. \nThe restaurant has dining and a bar area and it is small. It’s also very loud. I’m surprised by the amount of people they are able to fit. We arrived on time for our reservation and waited for about 10 until someone acknowledged us. It was the bartender and she only stated someone would be with us shortly. We waited a few more minutes and one of the servers came over and asked for our names and stated they would get our table ready. Since the restaurant was packed I understand running behind but it’s still a bit annoying because a reservation was made. \nThe menu is small and not many options. Our server was polite and very busy. Since the restaurant was so loud we had to raise our voices to talk to each other but once it started to clear out it was fine. There is not a lot of space between the tables so there is limited privacy. \nOur food came out fine and we both really enjoyed the salmon.",
   "Very nice experience last night. We were greeted and seated promptly. Our waitress (name?) was very friendly and personable. Food was delicious. Seafood (shrimp and scallops) and grits are in the top 3 best I've ever had. Very tasty sauce and drops of blue cheese comes with it. The chef even allowed us to order things that weren't specifically on the menu. Atmosphere was calm, low-lighting, and peaceful. I would recommend this restaurant to others.",
   "Really good food. Great atmosphere. Great service. Variety on the menu and they will always surprise you with soup and dish of day.",
   "Lowcountry in the heart of Raleigh says it all! The food here is amazing. Chef John Wright is outstanding. Highly recommend dining here!",
   "A great restaurant with an excellent atmosphere. The service was also nice. This was my second time visiting the Glenwood Grill and the food did not disappoint. Everything was perfectly seasoned and cooked to perfection!"
  ]
 },
 {
  "name": "Second Empire Restaurant and Tavern",
  "address": "330 Hillsborough St, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/59e2b4fa-9333-11ea-be77-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "drink",
   "food",
   "delicious",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4645400567980530750",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing place!!! Made are night perfect! Will 100% go back.\nGreat place to go on a date night. Very romantic setting. \nIt is pricey but worth it.\nThe service was amazing. Everyone went above and beyond to make it a great time. Food is delicious. Its very fresh. Loved the cheese plate.\nI would recommend making a reservation.\nThey do have a spot for large groups. \nThey do have parking, but its not a lot.\n If you get a chance you should go.",
   "The food is superb, the ambiance is magical, and the staff delivers the highest level of service and courtesy. We celebrated a special occasion around the chef's table which was impressive on all facets: four extraordinary courses, perfect wine pairings and an amazing \"reality show\" from the highly skilled kitchen team. Highly recommended.",
   "It's rare I post reviews after only going somewhere once, but this place was that great. I had the paella, which was fresh and delicious. The dessert, a butterscotch cake with butterpeacan flavoring and citrus reduction was made in house by their pastry chef and out of this world.  Would happily go back. Service was on point.",
   "Great service. Great food. Wife and I had a marvelous time. Too expensive to come often, but worth the special occasion spend. Only detractor was my drink could have used another shot of bourbon to balance the other ingredients. If you like bourbon, just get bourbon and skip the cocktail.",
   "Amazing. Bar staff were on it and made great beverages.  The hostesses were accommodating while we waited. The wait staff was on point. Jason was exceptional along with the others assisting him. Really made the dining experience one of the best.\n\nThe food was delicious. We all had something different and stole bites from each other. We also had 4 kids in tow and the chef was able to pull something together too keep them from turning into crazed animals. Another bonus point for them.\n\nIf you haven't tried Second Empire, you are missing out. We will certainly return and we urge others to try it out, I cannot see how someone would be disappointed.\n\nHats off to the chef and wait staff. Thanks."
  ]
 },
 {
  "name": "Brewery Bhavana",
  "address": "218 S Blount St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5a3e6886-9333-11ea-bc5a-14b31f159f22.png",
  "tags": [
   "drink",
   "tour",
   "library",
   "brewery",
   "delicious",
   "eat",
   "food",
   "knowledgeable",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5152192318224290361",
  "source": "GoogleMaps",
  "reviews": [
   "I had the most amazing experience   here tonight. This place is breathtaking. A bookstore, a flower shop, a library, a restaurant  and a brewery all in one... I must be dreaming! The stage is set, the lighting is in place, the props are in up, the staff is the gorgeous cast and you are the AUDIENCE. Austin is your tour guide to not only to a magnificent scene but also a delectable meal or drink with a view of the marble bar. He will have you intrigued and eventually addicted.",
   "Great atmosphere and a cool little store in the middle of the restaurant! Awesome taproom area with a ton of selection. This place is always busy so best get a reservation asap.\n\nThe peking duck was quite pricey but absolutely delicious! Cooked perfectly, with a generous portion, and amazing presentation! The sides with it, I felt, did not do the meal justice. One side, plain dough pieces, are completely without flavor, and there was so much of it! My guess is that it's on purpose to eat with the main dish, while not taking away the duck flavor. Tradition-aside, it's time that item evolved IMO. The scallion pancake app is amazing though. My dog is loving the femur bone the dish came with as I write this!\n\nService was a bit slow for refills, but was  friendly & helpful otherwise. This was our first experience. We were slightly underwhelmed, but it had been quite hyped to us for a while so we had some crazy expectations. We'll likely be back, but with the prices, might be a little bit.",
   "Walt staff is exceptional!!! Very helpful with first time selections. Food is fresh and flavorful. Liv (our server) was very delightful. Definitely a repeat visit is in order. Awesome food.",
   "I stopped in for lunch shortly after they opened and was seated right away. My server was very friendly and knowledgeable, and helped me narrow down a few options that I had trouble deciding amongst. I ordered the Pork Ma-Po Tofu, as I was looking for something savory and spicy. It did not disappoint when it came out shortly after. Tons of flavor, just the right amount of heat, and a generous portion. Good food for a reasonable price in an nice setting (there’s also books and flowers for sale here). I’d come back again to try some more of their varied menu.",
   "I know this place is rated as one of the top restaurants in Raleigh however being as I’ve traveled around the world this place is just OK. Some of the food can use a little bit of improvement in flavor and texture. Overall, the place is unique for its atmosphere and beer on tap. I believe the best dish that I’ve ordered there, so far, is the fried rice."
  ]
 },
 {
  "name": "Beasley's Chicken + Honey",
  "address": "237 S Wilmington St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5afc639e-9333-11ea-9391-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "food",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=11447757663234564890",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful little place. I would describe it as cozy, borderline intimate, with the waitstaff acting as if it's day one of being open. That's not a bad thing either, as they were incredibly friendly and not overly so. Ordered the fried chicken and waffles, and was thoroughly impressed. The pimento mac-n-cheese custard was also great. Did not try the bar, although it appears to be plentifully stocked with a good cocktail menu to go with it. Overall, a good place to grab a bite to eat, whether alone or with friends.",
   "Amazing food and dessert.  I had the Classic Chicken Sandwich that comes with shredded lettuce, special sauce, and on a potato bun.  Another crowd favorite is the pimento mac 'n cheese. They were both very delicious. Creamy red velvet cake, real banana pudding, and chocolate chess cake we're also had by our group. All 3 were so delicious.  Can't wait to go back.",
   "A Raleigh must if your only visiting for a little. Some of the best friend chicken I've ever had. They serve other good dishes as well. I had catfish here once. It was nice. The Carolina reaper hot chicken is p hot but v worth the challenge for the taste. The taste. It's good taste. Love the taste. How much taste. All the taste. So taste. Have a taste.",
   "I ordered our meal for takeout and the staff was helpful when I arrived. The food came out shortly afterwards. We had the hot chicken sandwich with pimento mac and cheese and the meatloaf with mashed potatoes and green cabbage slaw. Both meals were amazing with an array of flavors and textures. The portion sizes are realistic. The only downside is the price portion ratio is off compared to what we're used to seeing.",
   "The (what seems like) perpetual line out the door should be significant proof that this place is legit. This is a great choice for a casual bite for even the pickiest of eaters. They have phenomenal sandwiches (hot chicken, classic chicken, veggie), awesome sides (mac, greens, biscuits) and the best banana pudding. My go-to fave is the chicken and waffle with a side of the hot oil that they use on the hot chicken sandwich. That paired with a little drizzle of maple syrup is literally heaven on earth! Casual, affordable and quick (aside from the waiting in line on a busy day)."
  ]
 },
 {
  "name": "Poole's",
  "address": "426 S McDowell St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5b463e02-9333-11ea-a20b-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "family",
   "eat",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8963784408105703868",
  "source": "GoogleMaps",
  "reviews": [
   "Always a favorite. You need to show up about 20 minutes before they open and get in line. If the line is less than 30 people or so you are probably going to get a table. If not, they have a really cool bar reminiscent of an old soda fountain ... but with cool adult cocktails. The menu is ever changing and fresh. Have had dinner here about 4 times and have loved every one. The roasted chicken was amazing and they had a meatloaf that also was the bomb. But with their format, very difficult to predict what they will have week to week. Just know it will be excellent!",
   "I've been wanting to go to Poole's for years and finally got the chance. Poole's is an early one of chef Ashley Christensen's restaurants in Raleigh, and it deserves its reputation. The interior is cozy, dimly lit, and looks like it could once have been a diner. But the service and the care taken in preparing the food bring to mind fine dining not the local greasy griddle.\n\nFood is upscale seasonal southern, with a relatively small, focused menu. The waitstaff and bar staff are relaxed but professional. The macaroni au gratin is deservedly famous: first, it is huge. Second, it has a wonderfully crisp top and smooth, complex cheesiness underneath. I also loved the avocado salad. Doors open at 5:00 and the first seating is at 5:30. Arrive early and have a drink. I enjoyed a cocktail and saw a well-balanced and interesting beer list. There are extensive wine options, though I'm not sure how many are available by the glass; many of the bottles were $50+(++).\n\nThe first seating fills up quickly, though we arrived around 5:25 on a Saturday and still managed to get seats at the counter. The main dishes took a pretty long time to come out, but I didn't mind as the atmosphere was relaxing. While it is possible to keep costs down somewhat at Poole's, for most of us it will be a special occasion sort of place when you are prepared to splurge on an experience you'll remember. Well worth it.",
   "As it has been every time we go, the dinner was excellent! This place is a must eat when in Raleigh. You should definitely call ahead to figure out the time for your party to eat there. The dinner is served as a main dish per individual and all sides are served family style. I would sides the Mac and Cheese.",
   "Now the food itself was EXCELLENT. They have an all you can eat snack bar with a large variety. But if you're wondering about the meat, all I can say is everything was FANTASTIC. Every meat was tender, juicy and full of flavor! My favorites were the Sirloin, Tri-tip and Fillet Mignon. Overall my experience here was wonderful and I plan on returning in the future, highly recommend :)",
   "Southern comfort food elevated and served with charm. I have not had the opportunity to go to Poole's in a long time. It was even better than I remembered. \nIt was Sunday night, so roasted chicken was what we needed. The chicken was perfectly tender served over perfectly smooth and creamy mashed yukons. The reduced sauce was amazing.\nOur appetizer was an unexpected treat. It was lump crab salad with a generous portion of avocado and cornbread. The cornbread had aged provolone which made it even better.\nThey have a good wine selection at various price points. The menu also has options at different price points too."
  ]
 },
 {
  "name": "42nd Street Oyster Bar",
  "address": "508 W Jones St, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5ba3c862-9333-11ea-9c99-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "music",
   "delicious",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10125506401474401982",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent food and service. Got a main course an appetizer and about 18 clams. It was awesome. Shucked the clams right in front of me. Sit at the oyster bar if you can. 5 stars will return. $$$$$",
   "The BEST hushpuppies I've ever tasted! The food is fresh, delicious, savory, flavorful, lively. You gotta try the pimento cheese oysters. There isn't anything negative I could say about this place. The waiter and cooks friendly, engaging, and made great recommendations from the menu and places to visit around town. Its busy so make reservations for groups.",
   "Had an amazing brunch here. The chicken n biscuits with gravy topped with a medium over easy egg was delicious. The shrimp and grits was also terrific 👌. The staff was also on point, very helpful, and accommodating. A+ in my book. They have some awesome Bloody Mary options here as well.",
   "This was my first visit to the restaurant and I loved it!! The food and the atmosphere was great.  The live band playing great music! We had a large party so the waiter was on point with our orders. Also brought out some key lime pie cheese cake for my daughter birthday. I can not wait for my next visit!",
   "My first time here and everything was amazing. Our service was phenomenal! Our server Michael was so friendly and knowledgeable and an overall gentleman. The food was delicious but it did take a while to come out so dessert was on the house. I would definitely recommend and would be back."
  ]
 },
 {
  "name": "Sitti",
  "address": "137 S Wilmington St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5bea949e-9333-11ea-89f5-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "tasting",
   "food",
   "food",
   "foodie"
  ],
  "link": "https://maps.google.com/?cid=1518564068229517182",
  "source": "GoogleMaps",
  "reviews": [
   "Thank you so much for the delicious meal. We got the falafels & trio-dip and Kafka kabob... & can I just say wow. We’ve been to the restaurant a few times & were worried the food would taste different when it came to delivery. However, that wasn’t the case. It was excellent and exactly want we needed. Thank you so much for the kind note as well! This is an exceptional local restaurant! \n\nAlso, the baklava was superb!",
   "Definitely best place to have dinner in town. This is the best Lebanese restaurant I’ve ever tried, everything was so delicious, specially the date with bacon, the rice with chicken an de meatballs with yogurt. I really enjoy the dinner but you have to make a reservation because the place is always very crowded.",
   "Came here for our anniversary dinner one Saturday. It was really excellent all around. Our server, Matt, was really helpful. Really liked the atmosphere. All the food was so tasty. Best tasting kibbeh I’ve had. The Lebanese wine was also very good. Paired perfectly with our meals. Busy place I recommend making a reservation.",
   "I am so impressed! Food was fresh, flavorful. It’s a nice and chill environment and the food presentation was beautiful. This will be my go-to place when in Raleigh !",
   "Downtown Raleigh has really become a great foodie area and Sitti is one of the reasons.   A Lebanese style restaurant with a nice long bar and a nice staff.   A wide variety of appetizers, entrees, and desserts.   All of which are good.  Easy to see right off of South Willmington Street.   Clean facilities.   Reasonably priced.   Credit cards accepted.   We will most likely be going back."
  ]
 },
 {
  "name": "Seasons 52",
  "address": "4325 Glenwood Ave, Raleigh, NC 27612, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5c2d1c4a-9333-11ea-b025-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7332957013169493071",
  "source": "GoogleMaps",
  "reviews": [
   "Met the nieces for late lunch and shopping. I like that the restaurant is seasonal, they tell you so you don't expect something to be on the menu next time and it's fresh.i was so hungry I for got pics of the food. The artichoke and spinach dip was excellent... also had tomatoes in it and wasn't the normal creamy... more of the veggies and chunky. They make the mozzarella in house which was good on the lobster flatbread. Golden beer salad was good... I knew this but it's not on lettuce. Hailey was a great and attentive server. Been wanting to try the restaurant and it pleased the palette.",
   "It’s got potential but doesn’t quite make it. Missed many details and the food, although isn’t bad, is not that great either. \nService is ok. \nPlace and atmosphere is good.\n\nJust in case management reads this:\n-clean under tables and everything else constantly \n-clean head rests and furniture\n-dessert display made us feel like you pulled out of a Starbucks pastry display. (Good try though)\n-get rid of that chair, who’s sitting there? Yes, it’s convenient to have a chair close by for an extra guest but it looks terrible.\n-menus are dirty and stained\n-salt and pepper? Really? Classic diner.\n-and the toothpicks, wow",
   "Had lunch here because I wanted a good salad. Was not disappointed! BBQ chicken salad and Shrimp Mushroom appetizer. Staff is very friendly and attentive. Felt fancy without costing too much.",
   "Always good!  They really know how to do seafood!  Great ambiance and friendly service.  Menu includes calories of dishes.  Small desserts helps with sweet cravings while keeping calorie intake on check. Recommended",
   "Scallops, Risotto, & Mac + Cheese are all AMAZING! Very good mini desert parfaits too! Nearly immaculate dining room. Prices are rather high. Limited parking. Very slow service. Also, I did see a flying insect multiple times..."
  ]
 },
 {
  "name": "The Fiction Kitchen",
  "address": "428 S Dawson St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5c75abf4-9333-11ea-a343-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "delicious",
   "food",
   "creative",
   "food",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7615375389825545081",
  "source": "GoogleMaps",
  "reviews": [
   "My partners son couldn’t tell his chicken sandwich wasn’t real chicken! \n\nDelicious food-but be prepared to wait a little, they don’t take reservations, and this place is always packed. They also have homemade sodas- we loved the root beer. Gluten free and vegan options for most items on the menu. \n\nI couldn’t tell the difference between the dairy pimento and the vegan pimento, save for a little extra spiciness. Will be back!",
   "I am absolutely stunned with how delicious the food is here. Everything is extremely flavorful and perfectly spiced, from the baguette with vegan pimento to the Carolina-style pulled \"pork.\" They source their food locally, with an emphasis on goods from the farmer's market, and you can taste how fresh it is. We will most definitely be back many times.",
   "The food was creative, fresh, filling and good quality! We had the chicken and waffles, the zucchini patties, a house salad, and lemon cheesecake. It was all vegan and very tasty! The service was good and the wait wasn't bad even though it was very crowded!",
   "This was the most epic meal I've ever had in North Carolina. It was incredible! Everything about it. The vegan BBQ dish was incredible. As were the appetizers and Tres Leches dessert. Also be sure to try the house-made root beer. It was next level. I've been vegan for four years and this is the first time I've ever had to stop and question whether the food I was being served was actually vegan or not. It's not that I care. I don't care if my food simulates the non-veg version of the dishes or anything. But they just nailed everything so close to the original. But it was better! I couldn't believe all the flavors. I also loved the vibe, atmosphere, and extremely friendly service. This is definitely one of my top favorite places ever",
   "Been here twice, and both times food and service were phenomenal. We got there about 10 min after they opened and all the tables filled just before it was our turn to be seated. They took our name and number and called when there was a table open. It was great to be able to just go have a drink somewhere while we waited. The pulled \"pork\" is incredible!! And \"chicken\" and waffles were impressive."
  ]
 },
 {
  "name": "Relish Craft Kitchen & Bourbon Bar",
  "address": "5625 Creedmoor Rd, Raleigh, NC 27612, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5cd13900-9333-11ea-ac2b-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "family",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12358256949201685575",
  "source": "GoogleMaps",
  "reviews": [
   "This is a not so hidden gem.  The food was beyond delicious.  It was at our table shortly after ordering. The portions are generous.  Best cheese grits I have had in a very long time.  Staff was friendly and attentive. The atmosphere is relaxing and fun. While I don't live be nearby, I certainly will be back.  Definitely a place to bring my out of state family and friends.  (And pick up unique gifts) Only drawback is that I could not stay longer and enjoy more tasty treats.  Bourbon pecan pie was amazing, so much so, I forgot to take pictures.",
   "I bring my out of town friends here and am incredulous when my in-town friends haven't been. We literally can't come here without starting with the Pimento cheese fritters. People always ask what I recommend and you just cannot order anything sub-par on this menu. My personal favorite is the Summer Greens salad on the test kitchen menu. (They had it last year and I was downright depressed when they replaced the menu for more seasonal items) well, it's back and I'm in love. My other personal faves are the Mac skillets, the multi-colored sweet potato wedges, and the panzanella side salad. \n\nLittle known fact, they're incredibly eco-conscious. Local owners caring about composting and locally sourcing is my type of place. We'll be back..as always.",
   "My sweet daughter ADORES this restaurant. Today she got take-out for me as I am 65 and hesitant to get out much with current events. It was absolutely delicious! My daughter said, momma....I am going to order from them alot to keep them in business. She and her husband had their shrimp and grits last night.....she said best ever!!! Their food is superior....you will not be disappointed! Please support this wonderful business.",
   "The food was delicious! Had the Alfredo Mac and cheese, love the skillet. Their fried brussel sprouts are addictive. The banana pudding desert was amazing. Great cooks. Service was great too! Friendly and quick. Definitely coming back to this place, highly recommend. Nice and casual looked like they had a small shop too.",
   "This place defines comfort food. The only issue is having to make a decision on what to order. The Mac and Cheese variations are fantastic. The grilled cheeses have always been spot on. Even tried the country fried steak and was not disappointed in the least. But then they have to throw items at you from the test menu. I don't have a favorite item from Relish because I have rarely ordered the same thing twice. And the same problem occurs with the weekend brunch. Too many delicious options!"
  ]
 },
 {
  "name": "Bad Daddy's Burger Bar",
  "address": "111 Seaboard Ave, Raleigh, NC 27604, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5d19dae6-9333-11ea-91aa-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=2018063838778815311",
  "source": "GoogleMaps",
  "reviews": [
   "Very great place! Much better than i expected. Had the Bacon Cheeseburger on Steroids and was not disappointed! Was very tempted to get one of their \"Build your own Salads\" and next time I definitely will. 10/10 will definitely recommend and come again.",
   "Best burgers ever. I thought I would hate a burger place since I'm so done with burgers, but these burgers (been twice and tasted my husband's order) are fabulous. Good drinks too. Tons of parking. Cool wall hangings. Can't wait until it's warmer to enjoy their patio.",
   "We love Bad Daddy's! The food and service are always great. I highly recommend.",
   "I really enjoy this part of DT (downtown). Not too crowded but close to things. This place was fairly new, so glad we gave it a go.",
   "Be prepared to wait (25 min) service was good. Had the western hamburger with fries. Burger was cooked perfect but the fries was ice cold. Nice atmosphere but it was very cold on the night I visited."
  ]
 },
 {
  "name": "Firebirds Wood Fired Grill",
  "address": "4350 Lassiter at North Hills Ave, Raleigh, NC 27609, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5d5b29be-9333-11ea-ae0c-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "kids",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11743759956538762327",
  "source": "GoogleMaps",
  "reviews": [
   "Food here is amazing! Really enjoyed the service and the delicious food. Parking in north hills is always a bit of a headache but if you plan for it in advance it’s not too bad! I would highly recommend making a reservation ahead of time if you know when you’re going, especially on the weekends! Overall great experience! Wait staff was very friendly and the food was prepared VERY fast! We’ll definitely be returning!",
   "We had an excellent dining experience here the other night. Our server was attentive and friendly. She took special care of our kids and even surprised them with a treat at the end of our meal. \nAfter ordering drinks and food, a server overheard us discussing wine so they brought us a menu and helped us decide on the right one. A great dining experience. We will be back for sure.",
   "This was my 4th time visiting Firebirds and as always the food was delicious! Because we visited later this time, the service wasn't as great as it has been but it wasn't horrible. The salmon was flavorful and the loaded potato was great! The meatloaf was was the best I've ever had! Definitely a restaurant you want to try if you haven't already.",
   "We had the best time at lunch today. Our server, Lauren, was fabulous. She was able to answer our questions and make recommendations that were incredible. Her sense of humor was enjoyable and she was readily available to refill drinks. We will come back again and ask for Lauren. Thanks for a great meal.",
   "This is my favorite restaurant EVER!!! I love the food here...it’s super super yummy! Staff is super friendly and helpful... and prices are not bad given the great quality of food and service. Absolutely love this place💯"
  ]
 },
 {
  "name": "Vivace",
  "address": "4209 Lassiter Mill Rd #115, Raleigh, NC 27609, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5db28a66-9333-11ea-b51a-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14449379087338372028",
  "source": "GoogleMaps",
  "reviews": [
   "One of my favorite Italian restaurants, hands down. The quality of service and food makes up for the price. This is without a doubt the closest I've come to authentic Italian cuisine in America... Even after visiting Italy, this is still my favorite place to go on a fancy date 😍😍 all the waiters are incredibly friendly and go out of their way to make sure you enjoy your visit! I love the atmosphere and environment, well done Vivace, 5 stars all the way!! 10/10 would go again 👍",
   "Great Italian Restaurant in the heart of North Hills. Great food and great service. Upscale restaurant without the upscale price. I strongly recommend. Here is a photo of my ZEPPOLE. 🙌🏻🙌🏻🙌🏻",
   "Great food.  Nice atmosphere.  A well run restaurant.  A great place to relax in the bar area or have dinner in the dining room with your family.  They also have a pizza bar, which is first come first serve, and enjoyable to sit at and have dinner.  We will be visiting again soon.",
   "My wife and I celebrated our 5 years anniversary here and they made us feel very special since we walked in. We got complementary champagne and dessert and the food was extraordinary. Our server, William was an expert at helping us decide what to eat. Overall experience was amazing. Thank you.",
   "Loved this place ....the food was amazing, i visited this place with my friends on my birthday and it was a total bliss. Ganocci and Ravioli was really good and we all loved it"
  ]
 },
 {
  "name": "Neomonde Mediterranean Raleigh",
  "address": "3817 Beryl Rd, Raleigh, NC 27607, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5dfb2c54-9333-11ea-a4db-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15805160450316501128",
  "source": "GoogleMaps",
  "reviews": [
   "First time at Neomonde today. I got the 1/2 pita with lamb and sides of Orzo salad and Hummus with pita. I LOVE Mediterranean food and I was so impressed with the large variety of menu items and gorgeous colors of the fresh veggies in the display case! It was difficult to choose, but I loved everything and greatly anticipate returning often. It was a long wait (about 20 minutes) to get my takeout but the service was good and it won’t keep me from going back!",
   "That was so yummy!!! We ate it all! \nPros, good food. Fresh food. Calming environment. And GREAT dessert. \n\nCons, they forgot my order... and my friend had to go to the counter and tell them so they made a new one. Very pricey.",
   "Delicious Mediterranean food in a huge, beautiful restaurant, with super fast and friendly service. The food is the star of the show here: it's absolutely delicious, the portions are large, prices are low, and it comes out lighting fast. We loved all 8 items we tried. The desserts are also amazing, especially the cashew baklava! There is a ton of seating, including an outdoor patio. You'll also find a Mediterranean grocery store attached to the restaurant. Fantastic!",
   "Really liked it here. Easy to order, food comes out fast. We had a lot of questions as it was our first time here and they were very helpful. The food was fresh, tasty and filling.",
   "Neomonde Mediterranean is a nice place to get good Mediterranean food. The restaurant is cafeteria style where you order your food at the counter, pay, find a seat, and they bring you your food.\n\nI got the Pita Pocket Platter which includes half a pita, two sides, and baklava. The pitas are a good size and the platter is plenty of food.\n\nOh, they also serve fresh-baked pitas which is a nice, tasty treat.\n\nNeomonde has indoor and outdoor seating. Indoor seating is a mixture of tables and booths. The only drawback is the insure seating area can get loud, making it hard to have conversations.\n\nThe restaurant also had a small store where you can purchase Mediterranean items, treats, and cooking items.\n\nI will definitely be going back."
  ]
 },
 {
  "name": "Angus Barn",
  "address": "9401 Glenwood Ave, Raleigh, NC 27617, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5e4269d8-9333-11ea-9af6-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4754003628733995467",
  "source": "GoogleMaps",
  "reviews": [
   "First, this place is huge!!!  But once settled it still has an intimate feel, as it's all sectioned off nicely.  Great food and friendly service.  Oysters on the half shell and their rib appetizers are a must, and of course the steak is the staple here for mains.  I had the beef tenderloin with blue cheese mash potatoes, medium rare beef was melt in your mouth tender, and the mash was a great compliment with the blue cheese.  Overall a fantastic experience and will gladly visit again.",
   "I've been here several times for dates or group dinners as well as once for a wedding at The Pavilion.  Every time has been wonderful, and the private event team was phenomenal at the wedding (the bride's parents were thrilled).  The prime rib rivals the best in the region (as it should for nearly $40), and I love the cheese and olive appetizer.",
   "One of my favorite places EVER.  An iconic Raleigh landmark that welcomes visitors to the Triangle, and welcomes residents back year after year.  I love to sit in the Wild Turkey Lounge and then hit the meat locker patio if it's nice out.  Try the Buffalo Turkey wings and don't miss the Chocolate Chess Pie! And don't forget to take your good luck apple when you leave!",
   "I’m generally not one to leave reviews but I wanted to share about my experience at the Angus Barn last night.  My wife and I had a 7PM reservation and arrived early with the intent to enjoy an adult beverage or two in the upstairs bar.  It was comfortable and quiet so we decided to stay and have dinner there.  Our servers, Deb and Cameron provided exemplary service.  I’m not sure how it’s possible to be super attentive without being overbearing but they pulled it off without a hitch.  The food, as always, was first rate.  But the kicker— early in the evening my granddaughter called to wish me a happy birthday.  Deb and Cameron heard, “happy birthday grandpa!” and made a mental note.  As we prepared to leave I was presented with a cake to take home to celebrate my birthday.  It’s the little things that make a big difference.  Angus Barn never disappoints, and Deb and Cameron put an exclamation point on the evening.",
   "Wow!!!!! I had a wonderful time! It's definitely a one of a kind place. So much character everywhere you look. The Christmas lights were still up and it was beautiful. The food was delicious. I am vegetarian and didn't expect to get so stuffed at a steak house!!! Great service too. I was very impressed with our server. Just an all around wonderful experience. I have never been disappointed with this place."
  ]
 },
 {
  "name": "Irregardless Cafe",
  "address": "901 W Morgan St, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5e998aba-9333-11ea-b317-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "food",
   "music",
   "kids",
   "free",
   "food",
   "music",
   "family",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17871882825529187038",
  "source": "GoogleMaps",
  "reviews": [
   "The food was delicious. It's great that they have a pretty expansive menu to choose from. Everything from vegan to gluten free to meat filled dinners. My husband and I went here for date night and it was yummy. The atmosphere is very relaxed. Every time we have been there has been live music which is nice. I would highly recommend this restaurant. They also do catering for events. I haven't used them for catering but I have been to events that they have catered and I'm never disappointed.",
   "Love this restaurant for the high quality ingredients and gluten free options.  Have always had great experiences dining in.  Called the other day for carry out service while we are under stay at home orders... I asked about kids meals (my kids LOVE eating there), and the woman on the phone said \"Yeah, I don't think that's going to happen.\"  Sounded very unconcerned about fielding orders for families.  I guess they have enough business without us.",
   "This restaurant was great. The service was great and the food was amazing. Reasonably priced food with live music in the background, which adds ambiance sets a relaxing mood. The server Lauren is amazing, she made the experience that much more enjoyable. Very warm, welcoming and helpful! I very highly recommend this place for anyone that lives in or passes through Raleigh! I think most other restaurants should take notes on great customer service from irregardless!",
   "My family really enjoyed ourselves. Everyone was satisfied from the herbivores to the omnivores. The atmosphere and the staff were great and friendly. It's really great to find a place that accommodates many different food choices. The only negative was the parking, but it's downtown, so hey.... We'll be back!",
   "One of my top 5 favorite restaurants in Raleigh! The food here never disappoints! I love the poblano pepper dish. The cheesecake is awesome. They have plenty of gluten and dairy free options."
  ]
 },
 {
  "name": "J Betski's",
  "address": "10 W Franklin St STE 120, Raleigh, NC 27604, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5eed5040-9333-11ea-beaa-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=807080481775251474",
  "source": "GoogleMaps",
  "reviews": [
   "Another wonderful meal at J. Betski's. This time it was Saturday Lunch. I have dined here many times since it's conception years ago, and I can't think of any bad meal I've ever had here. Chef really cares about the food. Pairing the unique selection of beer and wine with the food is one of the highlights. Also one of the few authentic Eastern European restaurants in the Raleigh area that I know of. Lunch is just as good as dinner. Service is friendly and helpful. Definitely one of my favorite Raleigh restaurants!",
   "Always an absolutely amazing meal. I've been dining here for 14 years now and I love it as much today as my first visit. Looking forward to seeing the new location. If you want the beat service ask for Trent as he is phenomenal!!",
   "Excellent lunch. Our table shared plates of pierogies, sausages, kielbasa, warm potato salad, krout, and some good beer. Quiet pleasant lunch. Dessert was fantastic... the lavender orange bread pudding is amazing. Good chocolate tarts. Easy parking out front. Only looses a star to a abrupt and somewhat short waiter bordering on outright rude. We will be coming back, but looking for a different waiter.",
   "If you are looking for quality Eastern European food including pirogies, schnitzel, seafood and steak then look no further. Plus, don’t forget the desserts! 😀 The restaurant is small and seating is limited but it is that personalized experience that makes J Betski’s a treat. The staff is friendly and willing to talk you you and help you make the right selection. The only drawback is that they don’t have iced tea at dinner. We will definitely be back... before and after they move due to Seaboard shopping center being repurposed.",
   "The atmosphere was nice and the service was great. for someone who has celiac and his vegetarian, it's probably not the best option. But they did have a fantastic beet salad I could eat, so I appreciated that."
  ]
 },
 {
  "name": "Taverna Agora Greek Kitchen & Bar",
  "address": "326 Hillsborough St, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5f4ab2c6-9333-11ea-b84b-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "tasting",
   "food",
   "music",
   "knowledgeable",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2595163282163231347",
  "source": "GoogleMaps",
  "reviews": [
   "Taverna Agora is a really good Greek Restaurant and dining experience. I like being able to eat on the rooftop and having a nice breeze and a great view. There are many different items available on their menu and I liked the variety available. The food here is amazing and well prepared. The service here is attentive and professional and they work for to bring you everything that you need to have the best meal. This was a memorable meal that I really enjoyed.",
   "I've been to Raleigh three times and I've been to Taverna Agora every single time. Hands down my favorite restaurant here. The atmosphere and vibe on the rooftop reminds me of my trips to Greece. The food is authentic and so is the music they play. The drinks are tasty--Greek lemonade is my favorite. I've had everything from the tasting platters with the lamb chops to the shrimp souvlaki. Haven't had a bad meal yet. Will continue to come here whenever I'm visiting!",
   "If you like Greek food, Taverna Agora is a must.  Great food and well presented.  Courteous and knowledgeable staff and the best patio seating in the entire city.  Great place for meeting friends or a date.",
   "I was pleasantly surprised how amazing my food was. I got the surf and turf and my husband got the lamb chops. Both dishes were delicious.",
   "What a nice place, excellent food, atmosphere, and service. And the breads are fantastic. Wish I would remember the server's name, but very professional, swept-back red hair and arm tattoo. Why it took us so long to finally go there I'm not sure, but we will definitely be back. It was a really good experience."
  ]
 },
 {
  "name": "Winston's Grille",
  "address": "6401 Falls of Neuse Rd, Raleigh, NC 27615, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5f9a0b78-9333-11ea-8465-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3366543562233273093",
  "source": "GoogleMaps",
  "reviews": [
   "I stopped in here with a business associate/friend for a lunch meeting. And what can I say it was awesome. We came around 1 and there was no waiting and we were served quickly. The restaurant was super clean and the staff was very friendly. I ordered the New Orleans Gumbo Soup bowl and my friend ordered a quesadilla plate. The food was delicious and we were both very pleased. I highly recommend this place if you're in the area and you're looking for a nice restaurant to stop in and talk and chat while you eat a good meal. The ambient environment there is very friendly and relaxing, the service is great, and the food is delicious so you can't go wrong. 👍",
   "We had a large party and the service was excellent. We split multiple appetizer varieties and all were good.  Everyone was pleased with their entree.",
   "Best restaurant in Raleigh hands down. Service is excellent. Their meals always over deliver. I had bone in pork chop with a barbecue bacon sauce, side of green beams and sweet mashed potatoes.Excellent",
   "You will never be disappointed with the food regardless what you order.  Great service.",
   "Excellent service, great food, pleasant environment. This was my first visit and they showed and proved. Both my wife and I were extremely pleased. I had the pork chop with mashed sweet potatoes and green beans. She had pan seared catfish and fried shrimp, collards and creamy mashed potatoes. Excellent meal choices for a first visit..."
  ]
 },
 {
  "name": "David's Dumpling & Noodle Bar",
  "address": "1900 Hillsborough St, Raleigh, NC 27607, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5fde67ae-9333-11ea-bc70-14b31f159f22.png",
  "tags": [
   "food",
   "structure",
   "eat",
   "food",
   "eat",
   "food",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17028380873794641559",
  "source": "GoogleMaps",
  "reviews": [
   "Environment is excellent because of the historical building structure and old fashioned decoration, Food was so so, believe me, like most P. F. Chang’s, they are using similar ingredients: soy sauce, sugar and syrup.",
   "I love this place. The food is so good and fresh! One of my favorite places to eat in Raleigh.",
   "This used to be my favorite Chinese restaurant. Unfortunately over the years it has declined steadily. \n\nWay back you got two big egg rolls with most entrees. Then it was one. Now it's one small one. \n\nMy go to dish is Spicy cashew chicken. I also say \"as spicy as they can make it\". The ticket said \"VERY SPICY\". \n\nWhen I ordered yesterday there were barely any cashews and it wasn't even mildly hot. \n\nSad to lose such a great spot. \n\nUpdate: now they think posting anti-Trump memes on their Facebook page is appropriate. \n\nI'm out. No more mild cashew chicken for me.",
   "Love this place. David's is just great. The food is great, prices are great, and it's almost never too crowded despite the quality. We get take out often and eat in several times a year. Laid back, no pretenses, easy to pop in or good place for a casual date. Highly recommend.",
   "Great location Amazing food & Wonderful service! This place hit it out of the park.  Our server Ian was informative, he explained different menu items to us.  He was thoughtful closing blinds without us asking,  it was neat sunset.  He also offered a kids cup and various other things to assist with our toddler being present.  We loved the food and will definitely be returning.  🥰"
  ]
 },
 {
  "name": "State Farmers Market Restaurant",
  "address": "1240 Farmers Market Dr, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/602a8c0c-9333-11ea-a634-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8889191072939494117",
  "source": "GoogleMaps",
  "reviews": [
   "This place had some of the lightest fried chicken I ever had! It was so crispy and well seasoned. I loved the mashed potatoes and gravy and biscuits. The biscuit was so soft and buttery. The food was so good and the farmers market that's located there was so nice to see. It had many vendors and people from the community. The staff of the restaurant was really nice and made the experience a lovely one!! Cannot wait to go back when I'm in Raleigh again!!",
   "This is second to none, the breakfast is always great and it's just like being at grandma's. They make you feel right at home and they are very accommodating. I was there two years ago for my mom's  birthday  and we got everyone in the restaurant  to sing happy birthday to her, not to say pay back is pay back this morning  the staff all came by our tab3 to sing happy birthday to me. But still this is a great restaurant for breakfast and lunch.",
   "This is one of our favorite places to eat breakfast! The food is consistently excellent. The staff is always quick and friendly. It is a little loud when crowded but they do open early. Love the location next to the market. It is a great location for a Saturday morning outing.",
   "The North Carolina State Farmers Market is a great place to enjoy fresh flowers, produce, plants, and other local products. It's also home to this wonderful restaurant featuring traditional southern food. There is another restaurant with seafood that is just as good. If you were in the area permanently or on a visit it will be ashamed to miss this.",
   "Average food.  Servers were polite but slow.  This place has a great location next to the farmer's market.  Parking is very easy as there's a lot of parking spaces. Decor and atmosphere is cool. There's a big wooden boat, a life size statue of a horse, a bunch of colorful animal statues, and a carriage. When I thought about it, the best parts to this restaurant have nothing to do with the food or the service which are just average"
  ]
 },
 {
  "name": "The Capital Grille - Curbside Takeout & Delivery",
  "address": "4242 Six Forks Rd, Raleigh, NC 27609, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/607ddc74-9333-11ea-9b5a-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17351119809463487297",
  "source": "GoogleMaps",
  "reviews": [
   "It was my first time there and the food was simply delicious. I had a server named Christian, she was a delight... Very attentive and knowledgeable about the menu. Her bubbly personality made the experience even more enjoyable.",
   "I have been always looking for a perfect dried age steak experience, and luckily The Capital Grille was the best choice, i would say the steak looks it came from heaven...cooked perfectly and the taste was powerful. The soup and the appetizer were great as well, definitely i will put it in my top list!!!",
   "#1✨Experience!!\n\nWe went in last night to celebrate our wedding anniversary and everything was perfect!!  We were greated with a decorated table, excellent service, very polite hosts and staff.  Food was amazing! \nThe Capital Grille was by far the BEST choice for our anniversary dinner date!!  Thank you!",
   "This is as top notch restaurant. Went for a business dinner, a group of 8, and it was amazing. I had the best oscar style fillet I have ever enjoyed. The staff and service is superior. Very fancy but relaxed. Lobster Mac and their spin on Crab Cakes is wowing. Everything from start to finish was perfect.  This was my second visit, I went for lunch a few weeks ago and had the burger and truffle fries. That was incredible as well. And DEFINITELY get the calamari.",
   "What a wonderful experience! From the moment we walked through the door, to the time we left to find our car waiting for us mere steps away, everything was glorious. The service? Impeccable. The food? Sublime. All of it was magical. Highly recommended!"
  ]
 },
 {
  "name": "Caffe Luna",
  "address": "136 E Hargett St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/60db8d1e-9333-11ea-b289-14b31f159f22.png",
  "tags": [
   "daring",
   "delicious",
   "kids",
   "food",
   "delicious",
   "unique",
   "family",
   "food",
   "delicious",
   "food",
   "delicious",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5235177317394238206",
  "source": "GoogleMaps",
  "reviews": [
   "Italian restaurants are difficult to distinguish. Well prepared and flavorful is required to be deemed adequate. Caffe Luna was no different. The menu, while deep in rich and full flavor offerings lacks any daring or originality.  Also missing was any thing demonstrably on the lighter side.\n\nWait staff was attentive and professional. Hostess served double duty handing out \"to-go\" orders and, regrettably, took about 5 minutes to recognize, while I was alone, I was  not waiting for carryout and wanted a table.\n\nThe room feels big, to big. The high ceilings, with nothing to bring the scale down, is an architectural miss. It lack any intimacy or warmth that is part and parcel with the bbn Italian dining experience.\n\nThe four stars is hard earned, and not to be taken for granted.",
   "Finally got around to eating here after living downtown for a few years! And we were really impressed, not only with the food but with the service. We enjoyed meeting the owner, who was very welcoming and friendly. The tomato sauce was the best I’ve ever had, and my two picky kids loved it too. Lasagna was especially delicious and the desserts were delicious as well. I thought the prices were very reasonable for the quality of the food, not to mention the baskets of fresh Italian bread they provide you. A great visit all around!",
   "Cafe Luna is very nice! From the atmosphere to the staff this restaurant speaks class! Great beer and wine choices (they do not have a full bar). Their food is unique and delicious with generous portions! Great date spot, business meeting dinner place, or family dinner restaurant!",
   "Absolutely outstanding service! HIGHLY RECOMMEND for lunch. Most of their lunch pasta dishes were only $6.95. and you get a great portion! The food was amazing, reminded me of Italy. We went for lunch and got there about 1:45 (they close at 2:30pm until dinner), we were seated and had about 2-3 different people who would get drinks, take orders, check in on us. The cheesecake was delicious!",
   "Always enjoy eating here  Food is delicious with unique selections. Staff is attentive but not intrusive. Great wine selection. Great place for a date night."
  ]
 },
 {
  "name": "Gravy",
  "address": "135 S Wilmington St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/61223326-9333-11ea-8809-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "food",
   "eat",
   "food",
   "delicious",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18052133057856036993",
  "source": "GoogleMaps",
  "reviews": [
   "Gravy is great, unpretentious Italian food, friendly service, served in a warm, comfortable atmosphere. Located in the middle of Raleigh, near hot spots and parking, so its convenient as well.\n\nGood selection of wines. Their bread is to die for, so get a few rolls to nosh on and enjoy a glass of wine. I had the chicken parm but next time I'm getting those meatballs. There are vegetarian options as well. The service was quick and friendly. Really an enjoyable eating experience.",
   "Phenomenal Food! Wow! Such a great location! We sat at a high top next to the window and had a great view of all the goings on and so many good tastes coming at us! The risotto balls were so unique and flavorful! The mozzarella plate was fantastic but almost could have been added to the desert menu with a little more presentation of fig and some green apple. The shrimp scampi risotto was perfect! The texture was fantastic! The short ribs were perfect with aIdente vegetables in the ragout! We look forward to the next visit!",
   "One of the best Italian food I have ever eat in U.S! I am not an expert, but let me tell you, you will be amazed! And the staff is a little bit shy but take good care of you.",
   "Nice staff. Eggplant pie was light, meaty and crisp. The chopped Italian salad was adequate.  Wine list is American and Italian of respectable depth and reasonable prices.  Garlic and butter knotted bread rolls are a nice touch to complement the  red sauce \"gravy\". All in all a nice place.",
   "We went yesterday for TRW. We had a party of six. Hailey was our waitress and she is top notch. It is rare to go out and get both great service and great food but thankfully yesterday nailed both. The food was delicious and the portions perfect. My Old Fashioned was spot on. I had the eggplant pie and my husband had the Gruyere Ravioli. Both were spectacular!  A nice, unique gem of wonderfully rustic Italian. My Papa is from Italy and I can’t wait to bring him next time he is in town! Thank you for a wonderful meal and outstanding service. Hailey, you made us feel at home. Thanks again. We will be back."
  ]
 },
 {
  "name": "Bloomsbury Bistro",
  "address": "509 W Whitaker Mill Rd, Raleigh, NC 27608, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/61640cd0-9333-11ea-877e-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4115166798814869468",
  "source": "GoogleMaps",
  "reviews": [
   "Always love sitting at the bar, fine food, great drinks and awesome conversation with the guys. Sadly, won't be doing that for a little bit, so we ordered take out and it was great. The food was wonderfully prepared as always and the 1/2 price wine was a gem.  We're ordering again very soon!",
   "Loved it! Can't say anything more! Great service and wonderful food. Loved to sour dough bread too! Waitress gave some to take home, which I enjoyed for several days!",
   "We had the family chicken and pasta last night , pick up service, it was fabulous! I highly recommend this restaurant! It was easy to order, easy pick up , lots of yummy food! Support small business!",
   "My experience was great. Service was prompt, food was hot and quick. Overall apart from my main dish it was a 5 star dinner. \n\nThe eggplant was good but I also look at value for quality and I definitely felt like it lacked. All that to be said it was the only entree I tried. The mushroom soup was absolutely delicious. I would go again but it’s not my first pick.",
   "What a wonderful experience.  We first enjoyed Chef Toler’s cooking over 20 years ago and have rediscovered his kitchen this year.  Difficult to select an entree from the menu but those chosen perfectly prepared. Service just right.  Outstanding."
  ]
 },
 {
  "name": "Crawford and Son",
  "address": "618 N Person St, Raleigh, NC 27604, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/61a4e698-9333-11ea-bbce-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13022729649934851201",
  "source": "GoogleMaps",
  "reviews": [
   "Beyond exceptional! We ordered (literally) everything on the menu and there wasn’t a bite of food that disappointed. Every dish was so thoughtfully designed and carefully constructed; every item on the plate was meant to be there. The drinks were also great, the service was fantastic and Chef Crawford was too nice for words. Best. Restaurant. Raleigh.",
   "Dinner was as good as it looks! \n\nWe started with the compressed watermelon and pappardelle to start - they were both delicious...but the pasta was phenomenal!\n\nFor mains we had the short rib and swordfish - both were great and we didn't even need our knives!\n\nWe ended with the peaches & cream pie for dessert. \n\nOverall, one of the best meals we've had in Raleigh. We'll definitely be back!",
   "Outstanding service, outstanding food, very nice decor. Thoughtful menu, all food properly executed, cooked and prepared. The mushroom salad outshines the tartare (both awesome) we are still arguing between the pig cheek or the braised short beef (amazing). The apple crumb will make your eyes roll into your skull. Definitely will be back",
   "First time I was ABSOLUTELY impressed with food from a restaurant. Really upset that I was too full for their dessert, heard their chef is one of the best in the country for pastries.\n\nAlso, their drinks were phenomenal, never had anything like it. \n\nPrices were set perfectly for the value you receive. Would go back again!!",
   "The ambiance, service and food presentation were excellent. The food it self was good but over salted for my taste. I'll be back though to give them another try."
  ]
 },
 {
  "name": "Cape Fear Seafood Company",
  "address": "832 Spring Forest Rd, Raleigh, NC 27609, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/61e5993a-9333-11ea-b658-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17005922926897540219",
  "source": "GoogleMaps",
  "reviews": [
   "This place literally has the best seafood ever. The service is amazing too. The hostesses were very kind and accommodating and the server was knowledgeable about the menu. The drinks were fantastic. A little pricey but its worth it.",
   "This has got to be one of my favorite seafood restaurants EVER! \n\nThe wait was an hour and 30 minutes, and it was worth every minute. From the food, the ambiance, to the staff, this place was amazing. Our waitress was pleasant and very helpful. \n\nNow to the food. Seafood is very easy to mess up or be mediocre at but they got it right on so many levels. The Jambalaya was one of the best I've ever had and I'm from the gulf coast so that says a lot. My friend ordered the Salmon and said it was the best she ever had. The crab dip was amazing and the pitas were to die for. Even the damn water was good. \n\nCaleb, you guys got a winner here. We will be back with the whole crew!!",
   "I thought the food was really good. The buffalo chicken sandwich was good white meat chicken and was grilled to perfection but could have used a little more buffalo sauce in my opinion. Next time I will know to ask for more. Keith was great at the bar as the take out specialist. He made sure that the orders were correct and complete. Shrimp were fried just right. Really recommend the creamed potatoes as a side. They appear to be legitimately made from scratch and were slightly to the salty side but were delicious.",
   "First and foremost..a reservation is a must...The place is a massive cavern of happy go lucky foodies with smiles on their faces.  the service is great and friendly.  The food is just plain yummy across the board.  The Cape Fear chowder is a must and the grilled shrimp tacos are heavenly.  The muscles appetizer is a bath of goodness.",
   "I was impressed the first time I visited Cape Fear Seafood. After going back several times I noticed the food is only good on certain days of the week. They have at least one really great chef that is exceptional. However  their food is really hit or miss depending on who is back there in the kitchen. Reading through the other reviews, I understand why some people think this restaurant is great and others feel as though the food is bland and just okay. It truly Depends on the chef that day."
  ]
 },
 {
  "name": "Bul Box",
  "address": "500 E Davie St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/62305e28-9333-11ea-9be6-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6310455328697529137",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing place. Outstanding customer service, went above and beyond to make sure my meal was safe for dietary restrictions. \n\nFood was outstanding in flavor, and the delivery came in a wonderful container.",
   "Nice find. Bubble tea...well, smoothie really... And spicy sweet chili wings. They text you when your order is ready so if you need to run out and come back you can. The wait was around the amount of time I would expect. On a Tuesday evening there was no line to order which was nice when you compare it to the other food hall. \n\nThe wings were the right mixture of sweet/savory/spicy and they were all cooked through. They could have been fried harder for my liking but I still enjoyed them. I didn't try the appleslaw but there was a generous portion.\n\nThe strawberry bubble slushie was refreshing. I think there were popping bubbles in there but they were all popped by the time they got up the straw.",
   "Just ordered for the first time and had it delivered. Food was so amazing. I had beef bulgogi with \nKim chi fried race. If you havent already eaten here, you should. Cant say enough about the flavor.",
   "I ordered the teriyaki chicken, it was excellent. I took a picture of the food also but that one didn't turn out. It was so fresh and very tasty. Veggies were fresh and still crispy. Would definitely recommend.",
   "Love. Love. Love.\n\nGood flavor and quality for the price. Not a large variety on the menu, but the boxes are really good. \n\nGood happy hour spot."
  ]
 },
 {
  "name": "The Pit Authentic Barbecue",
  "address": "328 W Davie St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6286467a-9333-11ea-94c9-14b31f159f22.png",
  "tags": [
   "walk",
   "cheap",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11105087931462353277",
  "source": "GoogleMaps",
  "reviews": [
   "Perhaps the premier BBQ in the area, certainly the place for impressing friends and house guests. Not cheap. The brisket is the best in town. Do make a reservation and take advantage of the valet parking. Parking is not allowed at the shopping center lot across the street; a watchful guard is looking for parties that park and then walk to the Pit. \nAlso a fun place for Thanksgiving with smoked turkey, ham and all the trimmings for a fixed price. \nThe Pit also has a location in Durham but I liked this one much better.",
   "Very good!  Love getting the biscuits and hush puppies to start.  BBQ is a little smoky, but good flavor.  Love the sweet potato casserole.  The Mac and cheese had a thick top layer that I didn't love, but the noodles were good.  Nice place to visit and then go next door to Vidieri for dessert!",
   "Five stars all across the board! Not a single thing to critique. Staff is excellent food is perfectly seasoned. Atmosphere is clean and open. Very well decorated. Bathrooms smell amazing.",
   "Great atmosphere, fast service, friendly waitress, well groomed. I love that. Food fat trimmed excellent.. Great flavors. We really enjoyed everything. Most certain we will come again.. I had double combo, baby back ribs, brisket so tender, mac n cheese, fried okra fried perfect...",
   "The Pit does everything right. Their wings, Carolina BBQ, brisket, turkey, sides are cooked to perfection and seasoned deliciously. Haven't had anything I didn't enjoy here. Staff are friendly and accommodating, prices are good and portions are more than adequate."
  ]
 },
 {
  "name": "Vidrio",
  "address": "500 Glenwood Ave #100, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/62cc2946-9333-11ea-870e-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7061463311951023731",
  "source": "GoogleMaps",
  "reviews": [
   "This has been our third time visiting over the past few years. Each time has been a delight. A wonderful place to go with friends who are up for sharing various dishes.",
   "I've visited Vidrio 4 times in the past few months and I cannot wait to go back again. This has become our date night/special occasion spot! \n\nThey have been consistent every visit and I haven't been disappointed by any dish. My favorite dishes are the hand cut fettuccine, grilled octopus, and hanger steak.  Highly recommended checking out Vidrio if you haven't! Excellent service, food, drinks and atmosphere!",
   "Loved it!! I haven't had food this good in very long. Loved each and every meal and the drinks was over the notch!!",
   "What a wonderful place, the drinks are good the food is amazing, my girlfriend and I came here on a date night had an amazing time",
   "Vidrio has outstanding service, amazing food, and a romantic ambiance. From the photos, Vidrio looks beautiful, but no photo can do justice to the mesmerizing multiple story wall of colored glass nor to the hanging ropes. It is the perfect setting to enjoy hand-cut fettuccine and the New York strip steak. The steak was incredibly tender and juicy. Our waiter eagerly offered us a custom cocktail to pair with our appetizer and he gave us the chocolate lava cake as a complementary birthday dessert."
  ]
 },
 {
  "name": "Cortez Seafood and Cocktail",
  "address": "413 Glenwood Ave, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/631e1a30-9333-11ea-b729-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3103146239106903603",
  "source": "GoogleMaps",
  "reviews": [
   "Great SUN happy hour dollar oysters.  Stop by and check out thr great cocktails.  Menu changes occasionally as well.  Fresh bread with hemp butter was also awesome.",
   "Hands down, Raleigh's best restaurant. Do you see that burger? El Fish Mac! Best GD burger ever. Hand cut fries are outta this world, too. First rate cocktails. Excellent oysters. Try the bread and weed butter. You won't regret it - any of it!",
   "So I hear this place is open during this pandemic and taking orders. Even better when you go to a google and see they are offering this coupon for 20% off. You think great!!!..EXCEPT....when you go to order there is nowhere to put the code...? But the coupon also says to show at the store...but when you do..they decline to accept it. Then since it says u can get a gift card 20% off...so you want to buy that then pay for your food. But again..an excuse is given. There are plenty of places that need our money and support right now. If you are going to offer something. Then honor it. Don’t bait us. I no longer desire to try the food.",
   "This is Raleighs premier up and coming restaurant. Everything is fresh, tons of ingredients picked up from the local farmers market daily,  and the dishes are meticulously thought through.  Cocktails are just as good.  All the employees are pleasant and good at their jobs.  The vibe at the restaurant is fun and unique, I absolutely love coming here.",
   "The food was excellent!  I had the grilled whole snapper, and the flavor was wonderful.  My wife had swordfish, also very good.  Her vegetables were also grilled, her zucchini was almost whole.  It was pricier than I expected, e.g. we had to pay for the little basket of bread, then again it was fresh baked, steaming hot, and served with a special butter.  The menu online didn't include any desserts, but they had a couple, we shared flan.  We sat inside, and it was quite cold, my wife brought a sweater."
  ]
 },
 {
  "name": "Mandolin",
  "address": "2519 Fairview Rd, Raleigh, NC 27608, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6370a728-9333-11ea-a05b-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "unique",
   "eat",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17012884513535604864",
  "source": "GoogleMaps",
  "reviews": [
   "I have been here twice now and had great service both times which seems like is getting harder and harder to find.  My fiance and I have loved every thing we have ever ordered here.  The food is flavorful and tastes very fresh.  Prices are a little steep for portion sizes but I will pay for an excellent experience.",
   "I loved every second of this restaurant experience. My date and I just couldn't decide so we ordered a little bit of everything. The biscuit dumplings were scrumptious, I especially loved the chicken in the gravy. The trout, oh my God. What a surprisingly delicious meal. The acorn stuffed squash is something I wish I could eat every week after a long day at work, maybe paired with a yummy glass of wine from their amazing list (the unoaked chard was awesome!!) And the chicken & waffles was a unique take on a classic Southern dish. To finish it all off, we shared an order of french press of Pine State coffee,yum! And an order of the apple crisp. Everything was fantastic and I'm excited to have found a new favorite local restaurant, emphasis on the \"local!\" A standing ovation for Mandolin, what a treat!",
   "Amazing dinner last night with two wonderful people. I had the trout! And our server (I'm sorry I forgot her name!) was great, so kind, professional and caring. Will be back for sure.",
   "This was an amazing dining experience. Our waiter was fun and inviting, knowledgeable and experienced, one of the best waiters I've had in a long time. The dishes won't be forgotten. We had oysters on the half shell as an app, and they were probably the freshest in the city. The drinks are all amazing. This is a must do, but be prepared to pay for that level of service",
   "Just ate there today for brunch. Food was good but service could of been better. Could of got 5 stars but they never brung me and my date our fruit we ordered with our meal. So deep into conversation it slipped our mind and you waiter never once mentioned it. Shouldn’t have tip $15"
  ]
 },
 {
  "name": "Death and Taxes",
  "address": "105 W Hargett St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/63b6ff1a-9333-11ea-9f79-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "history",
   "food",
   "historic",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=535312947380586672",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice place with some history behind the place. Food was very good, I had the grilled pork it was very good and had a nice, fresh flavorful, taste. My friend had the rabbit which was also very, very good. It is a higher end place so on the expensive side. Limited beer selection but the food and service are top notch. Our server Selena was very attentive  and knowledgeable about the menu and the history of the place. She was very professional and discussed with us the vast experience of the owner. Very nice experience.",
   "Well no.  This restaurant has the ingredients to be much better, but it misses on the food.  Death and Taxes has a beautifully designed dining area with an open kitchen setting in a historic building.  Thus, you arrive on a positive note.\n\nThe kitchen features a wood fired stove which sounds flavorful but failed to deliver.  I ordered the pork chop in medium.  What was delivered was rubbery, fatty and bloody.  We all know chefs like to “flash” cook for flavor, but that is not what I wanted or ordered.  The chop came with “charred” cabbage which had no “charred” flavor.  The entire dish was swimming in the chops juices.  This felt more like amateur hour that a refined chef.  Ironically, the meal took a long time to be delivered, but I am confident it did not spend much time on the grill.  Perhaps next visit will be a better experience.",
   "I am not a fan of all the restaurants under her umbrella, but I can always count on Death and Taxes to come through when entertaining swanky guests. I really like the twice cooked lamb shank. It's a considerable amount of food and I sometimes feel generous enough to share. Lovely muted elegance.",
   "I live in a city with over 11K restaurants. Raleigh has less but let me tell you, if you visit the city, check out Death and Taxes. The food was delicious. Steak wasn’t great but coming from Houston, I won’t judge too hard. The space is small. Very small. We called and still had to wait but happy we did. Great bourbon selection! Like AMAZING! Didn’t see anything on the dessert menu to excite me but still left very satisfied. Well done. Oh, get the roasted oysters!",
   "Fancy dining but also overrated. \n\nService was great!  The drinks were excellent. The food was good.  \n\nThe highlight was that I asked for a metal straw for my cocktail, on a whim, and sure enough.. they brought me a metal straw!  It really is the little things :)"
  ]
 },
 {
  "name": "Garland",
  "address": "14 W Martin St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/64014edc-9333-11ea-83ab-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "unique",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=12199997835077767958",
  "source": "GoogleMaps",
  "reviews": [
   "Thought this might be an Indian fusion name as the name of the restaurant sounded Indian. \nBut its not. There was one curry option that ccame out without any bread! How can you have the curry only with rice. The taste was OK too. The staff was very courteous and attentive.  Came a couple of times to check if everything was OK and always smiling.",
   "Food was magnificent.\nFull of exotic flavors and every dish made a statement!\nI normally take pictures of my dishes, but we were very hungry and the plates looked scrumptious so we just dug in and ate. Loved it and will go back again.",
   "The food was delicious and even though the lunch menu is pretty limited, the two orders we placed turned out really good",
   "This place was recommended by a colleague who works around the corner. \n I had a lunch date with my son on a Thursday during the rush hour.  The serving staff were pleasant, positive, and attentive.  The atmosphere was somewhat too dark.  The food was tasty and fresh with unique combinations of flavors.  The cost was a bit high for the amount of food but organic \"yuppie\" meals tend to be higher prices.  The lunch menu seemed rather limited.  It's unclear if the theme is Mediterranean, Indian, or eclectic.",
   "One of Raleigh's best restaurants. Bringing together southeast Asian flavors with southeastern US ingredients. Well executed, balanced, and flavored- every dish will knock you out of the park. I particularly recommend the Chicken or Tofu 65, absolutely delicious. If you like seasoning things with ketchup and black pepper only, this isn't your restaurant. Absolutely worthy of a James beard award, would be a Michelin plate if Raleigh was in the guide."
  ]
 },
 {
  "name": "Rey's Restaurant",
  "address": "1130 Buck Jones Rd, Raleigh, NC 27606, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6469d4e4-9333-11ea-8f28-14b31f159f22.png",
  "tags": [
   "drink",
   "eat",
   "food",
   "unique",
   "food",
   "delicious",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=11964755293881435803",
  "source": "GoogleMaps",
  "reviews": [
   "The owner Rey, is Fantastic. The entire staff are polite, professional, and personable. The food is wonderful. 5 stars. If your looking for an upscale restaurant, go to Rey's. If you are looking for a place to hold your large gathering, go to Rey's. Eat and drink at the bar, eat outside on their newly built outdoor patio or enjoy your dinner in their lovely dinning room. Either choice is a great experience.",
   "Go here. Fine dining with a different flare than most you've been to. The restaurant is elegant and beautiful. The menu is unique. The story of Rey is compelling. The food we had was top notch. Our waiter, Greg, was very professional and just the right mix of interaction and information. The place is well-equipped for couples, small groups and large parties. We luve in N Raleigh, but we're glad we found this gem in Cary.",
   "So my husband and I love this place. The atmosphere was lovely. The staff was awesome. The food was ABSOLUTELY DELICIOUS! The chef really put his heart into the food. Everything was flavorful and filling. It was our first visit but we will definitely be back and soon.",
   "Love this place. One of the best Filets you will ever eat. Great service every time. They make special occasions and celebrations even better with special touches. The owner personally walks around to every table and greets you and asks how things are etc ... I highly recommend you go here; I don't think you will be disappointed.",
   "I just wish I could give this place 10 stars. Rey is absolutely incredible. Even in these trying times, he came to our table and cooked bananas foster for us! How many owners do that? Certainly right up there with Angus barn or Ruth Chris, just an incredible dining experience!"
  ]
 },
 {
  "name": "Bella Monica",
  "address": "3121 Edwards Mill Rd, Raleigh, NC 27612, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/64b92dbe-9333-11ea-9a21-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "unique",
   "food",
   "delicious",
   "free"
  ],
  "link": "https://maps.google.com/?cid=12120250998805186889",
  "source": "GoogleMaps",
  "reviews": [
   "We recently dined at Bella Monica and it was amazing. This was our first time dining here. I proposed to my future wife and she said YES! The staff was not aware, but when we told our waitress she could not stop congratulating us. Even the staff came to our table and they turned a special moment into and amazing experience. \n\nThe food, the ambience, and the staff combined to make it a perfect night. We will definitely be going back and encourage everyone to add this to your favorite restaurant list. You will not be disappointed!",
   "This was our first visit and I was very happy at the quality of the food. The chef gave a personal touch when he came to the table to talk to us about some of the dishes order preferences. Our table was for eight people so we were a bit cramped in the hallway but it was fine by me. All in all, great food and fantastic service.  Will definitely go back!",
   "Excellent, pricier Italian restaurant with good ambiance and delicious food.\n\nBella Monica is my go-to restaurant when I'm craving high quality Italian fare. The restaurant's ambiance and atmosphere make for a great date night. Entrees vary in price from $14-20, with good portions that will leave you full but not overwhelmed. They also provide an unique bread dish to start that will leave you full before the appetizers arrive, if you're not careful. Their rotating specials menu always are worth trying, and allow for variety outside of the Italian classics always present on the menu.",
   "Had a wonderful take out meal, during this crazy time Bella Monica provided us with the comfort of a fresh cooked meal from the shelter of our own home. The pizza and stuffed shells were delicious and satisfying. We can't wait to come dine in!",
   "One of the best Italian restaurants in Raleigh. Specializes in gluten free, dairy free, and vegan menus. Fresh ingredients and well cooked meals. Service is excellent and prompt. Portion size is definitely fair for the price paid. Lastly, it gets busy on the weekend so I would highly recommend making a reservation a few days in advanced."
  ]
 },
 {
  "name": "Stanbury",
  "address": "938 N Blount St, Raleigh, NC 27604, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/64fffac6-9333-11ea-838a-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "knowledgeable",
   "food",
   "unique",
   "family",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=13464338378520932346",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic spot tucked near town.  From the start the breads and spreads are great. Always order one of their greens/veggies—romaine salad or roasted whatever. (Menu changes) Scallops delicious.  All of their plates we’ve tried have been incredible.  \nIn fact, I’ll say it might rival these Southern Staples: A sweet HOT Kristy Kreme or the 4 piece Chicken Supreme Combo from Bo’s.  Now if you don’t like those 2: well that’s just plain sad.",
   "Eclectic decor and an eclectic menu make for an awesome dining experience! Food and drinks were perfection. The ribeye was probably my favorite, with the bone marrow coming in close second.",
   "Delicious food and experience. I had the pork chop and my wife had the whole snapper. Everything tasted top notch. The staff is knowledgeable and made some great recommendations including wine and cocktails. Our particular server was friendly and had a great sense of humor. He also surprised our table with some champagne on the house as we were celebrating a birthday. This is not my first visit and certainly won’t be my last.",
   "Not my first time here and it certainly won't be my last.  This gem in the heart of Mordecai rarely disappoints.  A small plates menu that packs a large punch.  And a cozy setting, with an open kitchen. This spot is not to be missed, if you like eating out.  Try the crispy 🐖 head and the 🦆 breast.",
   "My family and I eat here whenever we have the chance! Our favorite restaurant in Raleigh. They are constantly updating their menu, so each visit is unique."
  ]
 },
 {
  "name": "ORO",
  "address": "18 E Martin St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/654d3d7e-9333-11ea-8e80-14b31f159f22.png",
  "tags": [
   "music",
   "family",
   "delicious",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10470829857222684516",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful and open, albeit loud, space. The menu was varied and interesting, with lots of options for the vegetarians as well as the meat eaters. Loved the pearl couscous and the ribs. Liked the diverse wine list. The key lime mousse for dessert was lovely. A nice treat if you’re in the area.",
   "Took my lovely lady out to this restaurant for Valentine's Day weekend. Salmon, Octopus, Truffle Mac, and Shrimp Tempura were all phenomenal. Glad they encourage sharing. Also, a nice dim lit atmosphere with my kind of music playing in the background. Definitely will be back for more!",
   "I had a great time here with my date last night. There was a 45 minute wait for a table but it was expected for a Friday evening. We waited at the bar and had a stormy mule. They had a lot of specialty cocktails that looked good. We were seated and ended up getting the sesame cauliflower, caramelized pork belly, and parmesan risotto. All of them were amazing! I really liked their family style for eating. They brought out the dishes to our table and we served ourselves onto our own plates. And we only ordered 3 dishes but it was so filling. The atmosphere was so romantic, a little noisy but it didn't ruin the mood.",
   "This place is amazing! Such a great lunch and dinner spot. Today was lunch and I highly recommend the Bento offering. Obviously it changes daily. Today we had the braised short ribs, mixed greens, fingerling potatoes, and an amazing creme brulee cheesecake ALL FOR \n$10. Seriously, that has got to be the best deal in downtown Raleigh.\nAlso had were a couple scrumptious apps/shareables - Sesame Cauliflower and Asian Brussel Sprouts. Oh my goodness the burst of flavors from these! When you go, do not pass these up!\nI had the BBQ Shrimp Tacos! Again, some of the most savory and delicious combinations of flavors that you'll ever experience!\nAsk for Hunter when you go! Wonderful server and mixologist 😏\nGet the smoked Old Fashioned. You won't be disappointed!",
   "I had dinner with a few friends at ORO for the first time this weekend, and I will definitely be back!  The food and drinks were fantastic!  I especially liked the butternut squash ravioli.  The Bath & Boozy drink was served in a miniature bathtub!  We had great service, and the restaurant has a nice atmosphere."
  ]
 },
 {
  "name": "so•ca",
  "address": "2130 Clark Ave, Raleigh, NC 27605, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/65aa6652-9333-11ea-8afe-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "creative",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16536674198270401697",
  "source": "GoogleMaps",
  "reviews": [
   "My wife and I came here on a date night and really enjoyed the atmosphere and the small plates that we can share. Our waiter, Miche, took great care of us and had great recommendations. All of the food was very unique including the drinks. The restaurant itself was fairly quiet with a very upscale atmosphere and not too crowded.",
   "My wife and I recently dined at this fine restaurant just this past weekend. I’m happy to say the food was great. The service was exceptional. Just a small detail, I seem to have this very strange cough after visiting this place which doesn’t seem to go away...",
   "The food was well-presented, creative, and light. Also the space was beautifully decorated. However, the flavors of the food were very underwhelming, especially for the price. There are many places in Raleigh and Durham to get much higher quality food at a much lower price. I would not recommend this restaurant.",
   "Took my date here on Valentine's Day and it was amazing! First time eating here and will definitely be coming back! I love the atmosphere of this restaurant, and the plating here is so brilliantly done. Madison was also an amazing waitress! Definitely coming back and is easily one of my new favorite restaurants. Until next time!",
   "Danielle. What a superb server she was. I felt like she loved her job. I am vegan and we try to avoid gluten and I was BLOWN away by the food. We ordered 4 appetizers and dessert and two drinks each and a $20 tip and it was about $100.00 and for the experience I had I would have paid $200.00. We ate off the VEGAN menu completely. ⭐️⭐️⭐️⭐️⭐️"
  ]
 },
 {
  "name": "Centro",
  "address": "106 S Wilmington St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/65ebdc76-9333-11ea-9398-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3721360039671075480",
  "source": "GoogleMaps",
  "reviews": [
   "We LOVED our lunch! I would recommend the torta to anyone; it was just delicious! The bread was soft, the steak tender - I couldn't have asked for more. The soup is also delicious. I would also recommend the shrimp tacos. We also especially appreciated the great service. We'll be back!",
   "I was not overly impressed but my husband was. It was a little pricey for the quality of food and wine. Nice hip atmosphere. Overall it was good and I would go back to try something else but I can’t rave about this place like some other places I’ve been to. We didn’t make a reservation on a Friday at 615 and there was an hour wait so we sat at the bar. The bar tender was very attentive and helpful.",
   "The food here is always fantastic! You can’t go wrong with any of their tacos. Most days they have lunch specials which are also always worth trying. \nThe space is uniquely decorated and has a very eclectic vibe. Table sizes are somewhat limited so if you come with a large party will be difficult to get everyone seated. My latest visit we had six people and we simply sat at the bar which worked out fine. Definitely a local favorite and I’m always excited to visit again.",
   "Incredible atmosphere and delicious food. Had the salmon wrap with beans as a side. She had the steak tacos with the slaw (heads up, it has a bit of a kick - not your traditional slaw). Our server was a peach and we really enjoyed our experience. The bathrooms include extra toiletries and are amusingly decorated as well. Would highly recommend!",
   "Came here on a Tuesday and was immediately impressed by the decor. It was rustic and tacky in a beautiful way, so much fun stuff to look at and the decor gave the restaurant an authentic Mexican vibe. The food was good not crazy good but good. My margarita was another story though. I forget the name but it was the spicy one and the spice was perfect but the after taste was out of this world crazy good! The chips salsa and guacamole were great also the habenero house made hot sauce was incredible."
  ]
 },
 {
  "name": "Royale",
  "address": "200 E Martin St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6669981e-9333-11ea-bc66-14b31f159f22.png",
  "tags": [
   "delicious",
   "tasting",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14765904537516491344",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious restaurant in the heart of Raleigh.  Everything I had was top notch.  Of course, the Brussels sprouts are not to be missed and can be a meal alone.  I am not sure what they added but I could not stop eating them.  My trout included a savory salad and was flavorful.  Dessert with strawberries nicely completed the meal.  Worth a visit in Raleigh.",
   "Very professional bar and table service. Full bar but the menu is limited. The Trout was prepared perfect.the Brussels Sprouts were very good. French flare to everything. \nThe Bartender was great.",
   "One of the best meals i have ever had. So happy with this place. Katie was awesome! The beef Wellington was incredible and the s'mores ice cream was the deal sealer!",
   "Great food and great service. We did the \"dealers choice\" which is their tasting menu. Each plate, 13 in total, was excellent. The total service was about 2 1/2 hours which was enhanced by our lovely waitress Maya. Her enthusiasm for the food was quite notable. I Highly recommend Royale for a special occasion.",
   "Royale is always a treat. Jeff takes great care of us and I'm always pleased with the food, hearty but complex and interesting at the same time. I'm obsessed with the brussel sprouts. Cocktails are great, too. A must hit in Raleigh."
  ]
 },
 {
  "name": "Capital Club 16",
  "address": "16 W Martin St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/66bbb152-9333-11ea-90b8-14b31f159f22.png",
  "tags": [
   "delicious",
   "tour",
   "food",
   "walking",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2599559015103152635",
  "source": "GoogleMaps",
  "reviews": [
   "This super stylish restaurant serves up delicious, European-inspired dishes. They have huge windows and beautiful indoor/outdoor spaces. We love them so much, we feature them on our Raleigh Walking Food Tour.",
   "Great bar and restaurant!  Both the food and drinks were exactly what I wanted.  Staff was good.  Will definitely be back!",
   "We have been to Capital Club 16 for dinner on several occasions and we have never been disappointed. \n\nToday we decided to go for Sunday Brunch and oh how glad we did. Every offering on the brunch menu sounded delicious. We wanted to taste it all. \n\nMy wife had the Pan seared Salmon. It was Baked salmon, pepper jack grits, roasted tomatoes, sunny side up egg with creamed spinach\n\nI had the Fried egg Florentine. A couple of Sunny side up egg, potato cakes, roasted tomato, mushrooms, fresh greens with a side of Schiller sausage.  I Finished my brunch off with a cup of counter culture coffee. \n\nThe atmosphere is warm and welcoming. Bernard, our server was very nice and made our time at Capital Club 16 just perfect.",
   "We love trying restaurants and getting out of our \"box\". This was in a very cool older building in downtown Raleigh that had that awesome rustic charm that we never knew was there.  The staff were friendly, the Bloody Mary was just the right amount of spicy and the food was so good we ate every bite on our plates! The dessert of the day sounded so good we had to get one to share.   All in all it was a very nice experience that made us want to go back again.",
   "What an excellent find. Had Sunday brunch. The food was really excellent. We had the German faire. I had the pork schnitzel and it was delicious. My wife had the German platter which included white sausage. Great too. They sell Hofbrau lager on tap! The Bloody Mary was nice and spicy. Our server Glynnis was very helpful and friendly. Very attentive. Oh yeah, the chocolate cake with banana sauce was outrageous.Good coffee too!"
  ]
 },
 {
  "name": "Parkside Restaurant",
  "address": "301 W Martin St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/671a241e-9333-11ea-96ff-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8243359887543065984",
  "source": "GoogleMaps",
  "reviews": [
   "The food was really great. The fried chicken gravy bowl, the pork chop, deviled eggs, everything was fantastic. I had my birthday brunch here and am very satisfied with my decision. The food was hot, seasoned, and really good portions. The service was excellent as well. I have to check out their dinner menu next!",
   "4 stars for food. Really enjoyed the deviled eggs, fried chicken biscuit bowl, tomato bisque and BLT. Lacking was service. Waitress took the orders and then different food runners delivered. Had to go out of our way to get a refill of coffee as the appetizer dishes stayed piled on the table. Additional 20 minutes after finishing before the check was offered.",
   "First time here and the meal was very good.  For lunch tried the short-rib stroganoff and the daily special open-faced scallop BLT with collard greens.  Everything was delicious.  Service was great.  Was not too busy at 11 am.  Beer/bar selections looked good (did not try) for my pallet. Will definitely come back again.",
   "Park side is cute diner located in downtown Raleigh. The atmosphere is fast paced, but the service was fairly steady. I think our server had too many tables and that caused him to not be able to dedicate the attention to all of his tables equally. The food was ok. I had the shrimp and grits which weren’t bad, but I’ve definitely had better. I will try something else if I return to this restaurant.",
   "We thoroughly enjoyed Parkside. We chose it because of other reviews and were very happy with our choice. Food was great. I had the Mediterranean Bowl with Salmon. They ran out of salmon so I ended up with shrimp but it was still great. My husband had the stroganoff which was amazing. There were 4 of us and everybody loved their food. I had the strawberry jalapeno margarita and it was delicious. Staff was friendly and very attentive. I drink a lot of water and they kept my glass full. He even brought me a full to go cup when I asked for a little more water at the end of our meal."
  ]
 },
 {
  "name": "MOFU Shoppe",
  "address": "321 S Blount St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/67722f46-9333-11ea-98fc-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walk",
   "drink",
   "art",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4359010456791573410",
  "source": "GoogleMaps",
  "reviews": [
   "One of our meals was really good, but absolutely not worth the wait. \n\nWent for lunch on a Saturday, we were one of 3 tables at the time. It took an hour after we ordered to receive our main dishes. Server was very nice but it just wasn’t worth the hour wait. \n\nThe curry bowl with shrimp was delicious, loved the flavor. My fiancé got the coconut rice bowl with fried shrimp and was “never more disappointed with a meal in his life” he said it tasted like someone just threw the leftovers from their fridge in a bowl. Very little flavor... and this from a man who loves food. \n\nThe space itself was really cute, very clean. Love the decor and urban chic style. Was excited to try but left disappointed... an hour and a half later.",
   "Great place with a menu that is always changing.  Lots of great options and they have great sauces to accent every choice.  If you want heat just ask.  Waitstaff is very professional and will take time to explain the menu.  Great seating options and you can just lounge and sip on your drink while you watch folks walk by.  Who doesn’t love to “People watch”.  Parking can be tricky, but you already know that if your venturing downtown.",
   "Absolutely loved this place. Fantastic service with a server who was spot on and had recommendations immediately (and had actually tried the food). Great variety, drinks, and atmosphere with local art and craft cocktails. Parking is Street or a parking lot around the corner. We had the brussel sprouts / ginger dumpling (small plate) and then entrees of flounder tacos and short rib bowl. My only nib is that the rice was a bit too sweet and the desserts / coffee at the end can definitely be skipped (this is not their forte at all).",
   "Great addition to the Downtown Raleigh food scene! We loved all of our dishes, especially the pork dumplings and the kimchi fried rice balls. We were disappointed they were out of the chicken entree when we had dinner there, and had to get more appetizers instead of an entree. Prices are a fairly high, but quality and creativity of the dishes is solid, and portions are pretty good sized. Love their story from the food truck days, and we had the kindest waitress who we loved!",
   "Followed the waitress' recommendations and liked all!  The Flounder Taco and Sprouts were outstanding.  Great ambiance and parking nearby.  Highly recommended and a must in downtown Raleigh!"
  ]
 },
 {
  "name": "the Oak, Kitchen | Bourbon Bar",
  "address": "4035 Lake Boone Trail, Raleigh, NC 27607, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/67bec8f6-9333-11ea-872c-14b31f159f22.png",
  "tags": [
   "food",
   "knowledgeable",
   "delicious",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7274426129425263359",
  "source": "GoogleMaps",
  "reviews": [
   "I can't remember the last time I had customer service like I had at The Oak. No joke, I was blown away by how pleasant it was. The atmosphere was laid back and the smells, phew that smokey smell from their food radiated through the entire restaurant. My fiance and I made reservations for 2 and earlier in the day, we were contacted by them to confirm our reservations and to ask if we were attending the concert at PNC arena that evening, in which we were. They told us that they would be sure to have us out int time for the show and they were not joking. Our drinks were brought quickly and the same for the food. The timeliness of this didn't take away from the quality though. The shrimps tacos, fries and sliders blew us out of the water along with the stout I was drinking. When leaving, we were told to be safe and to enjoy the concert and that made us smile. They have gained repeat customers for sure.",
   "Enjoyed a very good meal here. Started with deviled eggs and a salad which is easily shared amongst 2 or even more the start. The NY Strip was perfectly cooked and the fish tacos were tasty as well. The waitress we had was impressively knowledgeable about the extensive whiskeys and bourbons that can be enjoyed with a flight.",
   "My husband and I met some friends there last night and had a good time. The atmosphere is nice and we didn't have a hard time finding parking. The menu is a little skimpy. The guys got the sliders and at the price they charge there should have been more than 2. I got the nachos and it was a decent helping. My husband and I bit got the old fashioned and they were good. He got a martini and it was way too salty. It was not good at all. I would say this is a good restaurant, but the prices are a tad high for the menu selection. You will enjoy it if you visit.",
   "nothing special about the bourbon beef burger was nothing special for $13 plus an extra $2 to remove the chips that come with the burger and replace them with regular fries. It tasted like any generic burger and fries. \nfor $15 I would prefer something in the quality of Red Robin.\n Great location we sat outside with garden view, very relaxing atmosphere. friendly waiter. \nNot my cup of tea.",
   "Found this lovely restaurant on Yelp and made a reservation the same day (through Yelp) within a few hours of the time frame. When we arrived, the restaurant was busy but not packed to where every single person was waiting. We got there right as our reservation stated and they seated us within 2-3 minutes of arriving. Our waitress was nice and explained about the menu and vibe since it was our first time here. The food was delicious and the service was 5 stars. We weren't that hungry so we just split two small plates and it was more than enough. We also tried a few cocktails and they were just as good. I loved the fact that they offer meatless burger sliders since we are vegetarian and cannot find that at too many restaurants (although it is becoming more popular). I have told many people of this restaurant and will be taking visitors here when they are in town!\n\nPros:\nMeatless/Vegan options\nGreat service\nLayout is nice and relaxing\nSeating inside or outside\nGreat variety of drinks to choose from\nClean bathroom\n\nCons:\nWish the bar was a tad larger/more seats to welcome guests who want to grab a drink while waiting."
  ]
 },
 {
  "name": "Five Star Restaurant",
  "address": "511 W Hargett St, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/68045db4-9333-11ea-a857-14b31f159f22.png",
  "tags": [
   "delicious",
   "tour",
   "food",
   "walking",
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2099913253741393016",
  "source": "GoogleMaps",
  "reviews": [
   "Five Star Restaurant offers delicious Taiwanese and Chinese cuisine with a fun, industrial atmosphere. Their bar and pool table are perfect for happy hours! We love Five Star Restaurant so much, we feature them as part of our Raleigh Walking Food Tour.",
   "We've been coming here since this space was Wicked Smile. The BEST sesame beef ever. Great bar too.",
   "Cute,  trendy spot in the warehouse district downtown Raleigh.. the shrimp fried rice was excellent,  service okay.  The drinks were really good,  but it seems the only way to know about this place is word of mouth.. there is no visible sign outside to indicate it's existence. Nonetheless,  great place to chill and eat and I'll be back.",
   "I liked the place. However, I think they need to upgrade their location a bit. We sat right next to the wall with the holes in it. Other than that, it was nice. Atmosphere there is also very good and friendly.",
   "I came here on Saturday for my birthday celebration with 3 of my friends and it started of really rocky. I am not sure if the lady with the short hair cut is the hostess who took us to the table but she had a horrible attitude that almost ruined the night.  I requested to be at a table in the corner so that my friends and I did not disturb the other guests because I knew we would be laughing the night away, it was met with eye roll, smacking her lips, a smart comment under her breath, and she also poured everyone else water except me.  I was very disappointed in her behavior and how she represented the establishment.\nThat being said, our waitresses Brittany and then Sam were phenomenal! They really helped make the rest of our time there a success and for that I am grateful and appreciative! First and foremost she provided me with the water that I know the other lady intentionally did not pour.  She had a thorough knowledge of the menu which she used to provide suggestions on appetizers, sake, drinks, and entrees.  We took her recommendations and our food was absolutely delicious! Amazing flavors and huge portion sizes. \nHospitality is such an important part of the dining experience, it is a shame that I spent the first 15 minutes focused on how nasty the first lady was and trying to decide if I wanted to celebrate elsewhere because who wants to be greeted in such a negative manner, especially on their birthday?"
  ]
 },
 {
  "name": "Bida Manda Laotian Restaurant and Bar",
  "address": "222 S Blount St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6848929e-9333-11ea-b63f-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=602842650379018403",
  "source": "GoogleMaps",
  "reviews": [
   "We got lucky to get reservation when we did. Usually you may have to plan to go here but off chance you get a table. Food was good the cocktails were great. Highly recommend the papaya salad, totally different. Great ambiance and our server was great.  Four star based on value and taste.",
   "Flavor on top of flavor!! Sausage is out of this world.  I’ll dream about that.  Story basil looked and tasted like freshly picked vegetables.  The vegetables were so good, I didn’t notice the beef.  Poached egg was a really nice surprise!",
   "Amazing food! There is nothing on the menu that I didn’t like. I came here for a staff dinner and were all got to try a little bit of everything - and everything was DELICIOUS. Waitress was fantastic and very helpful on any food allergies at the table. I’ll definitely be back!",
   "One of the best restaurants around and their staff is always accommodating and helpful. Great place to come to if you have an allergy just let them know. \n\nI recommend the pork belly soup and chicken wings.The chicken wings are among my top 3.\n\nOnly downside is that they do run out of chicken wings and it is soul crushing :(",
   "The wait was long over one hour but it was well worth it. The dining atmosphere is inviting. The servers are attentive. The food was delicious. I mean it was really tasty and savory. It was presented well and served at the right temperature. I had the spring rolls, papaya salad, and pad Thai. \n\nI will definitely return when I come back to Raleigh. Make sure you reserve ahead of time."
  ]
 },
 {
  "name": "N.C. Seafood Restaurant at the Farmers Market",
  "address": "1201 Agriculture St, Raleigh, NC 27603, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/68a3d248-9333-11ea-b75f-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13890717249258220214",
  "source": "GoogleMaps",
  "reviews": [
   "Literally the best place to get seafood. Literally. Why bother going anywhere else unless you want a waiter to serve you? Price point/quality/portion is insanely valued above average. Price is so cheap for the quality of food and huge portians. Can't beat it anywhere else to my knowledge and it's worth the drive. Right off the highway. Great location.",
   "All I can say is wow!  If you love seafood, this is the hidden gem of Raleigh.  Great food.  Great prices.  It's so good that you don't mind that it's served in a to go plate and it's a good thing that it is served that way because if you're not starving when you start you're definitely going to take some home with you.",
   "I'm here now and just had the lunch special shrimp. Man when I opened up the top of my tray the steam just shot out the top. Now you know that's fresh and it was. I had to ask for forgiveness because I ate every bit of it. The portions are huge and well worth the money. When I want fresh hot seafood this is the place to come. I will be back.",
   "really good food. Fresh fish and shrimp. Not too overly seasoned so the freshness of the ingredients shines through. Service was really fast. The place is crowded but that adds to the rustic environment. Portions are large and totally justified by the price.",
   "Awesome place. It’s a very busy place, but they are one off the best seafood places in Raleigh.\nThey have outdoor and indoor seating areas. \nThe waiting time is between 5 to 10 min. \nAfter you do your order they give you a number  and they will call your N when it’s ready.\nThis  was my first time ordering soup, it was excellent I will order it every time we go there.\nWe got 3 orders. Shrimp, scallops and 2 soups 🍜. \nYummy yummy yummy. \nWe really loved it, this place will  be our favorite seafood place ever."
  ]
 },
 {
  "name": "The Station at Person Street",
  "address": "701 N Person St, Raleigh, NC 27604, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/68ece966-9333-11ea-b181-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "food",
   "eat",
   "unique",
   "food",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=7579249769124371887",
  "source": "GoogleMaps",
  "reviews": [
   "We had a fantastic lunch at the Station. Katt was attentive and friendly. We ate outside and the kids loved the patio. They have fans and the patio is mostly shaded. There is indoor seating as well. The food was delightful and the beer list was nice and varied.",
   "Went on a week day for lunch and I️t still had a good crowd. Great outdoor seating! Welcomed by a lot of friendly faces who were very attentive and readily there for you. We were new to Raleigh and they made us feel welcome. Great quality food and good beer menu! Highly recommend for a nice lunch.",
   "Great place to visit for a lazy Sunday afternoon. As you can probably discern from the name of this place it's an old gas station great bones to the building, cool nostalgic place to eat. It has a nice outside dining area and a super cool bar. It also has a nice bar on the inside ample seating at both the bar and inside dining with a few TVs and probably 10 to 12 draft beers. I had the sloppy joe with pimento cheese and homemade chips, really super good!!! My wife had the Pickled beet and goat cheese salad  with chicken, which was equally as good.",
   "Enjoyed some drinks at the outdoor bar before heading to dinner. The staff was friendly and knowledgeable.\nThere’s a lot of great outdoor seating with plenty of room indoors as well. A unique space and set up. Looking forward to coming back and trying food soon. Great location.",
   "Great spot! Glad we stopped by - amazing deal on the salmon blt (so much salmon). Everything was great - bacon habenero pimento cheese dip with pita, sloppy joe with pimento cheese, carrot cake.\n\nThe bartender was awesome and versatile. Got some hot toddies here (not on the menu) and they were amazing - especially on a cold night sitting at the outdoor bar. Friendly staff."
  ]
 },
 {
  "name": "Assaggio's Italian Restaurant",
  "address": "3501 W Millbrook Rd, Raleigh, NC 27613, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6930f77e-9333-11ea-aeaa-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=4024730448217253702",
  "source": "GoogleMaps",
  "reviews": [
   "I have been eating at Assaggios for over 10 years now.   They're the best. Hands down.   Please consider trying them if you haven't already.   This is one local business that has earned its place in  our community.   We love you guys",
   "1st visit ordered on line through slice. Let's say these wings were almost as good as the ones back in Upstate NY. My only request next time is the wings be fried little crispier. Also had the antipasto salad and that was delicious as well. Order was ready when I arrived to pick it UP. No issues. Will definitely be back for dem WINGS!!",
   "Happy with my Assaggio’s experience so far! Their meatball subs are amazing, and the baked ziti and lasagna are tasty as well. They deliver through Postmates too which is very convenient. I will definitely order from them again!",
   "Authentic Italian food!! This is my go to place since I moved to Raleigh. Great sauce too.",
   "Fantastic food! Beautiful design. Loved the prices. My favorite part was it wasn't overly loud! Nothing worse then going to have a nice quite dinner with the husband and the music is so loud you can't hear them"
  ]
 },
 {
  "name": "Tazza Kitchen Cameron Village",
  "address": "432 Woodburn Rd, Raleigh, NC 27605, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6974de8c-9333-11ea-9f12-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5234020292134165649",
  "source": "GoogleMaps",
  "reviews": [
   "This spot is truly a gem! My husband and I were going to dinner this past Saturday and wanted to try a new restaurant. I found this restaurant on Yelp and when we drove here and realized it's in a strip mall, I honestly didn't know what to expect. (Not that it makes a difference, but it looked small on the outside so I assumed a wait). The restaurant is a lot larger than it appears. The string lights on the outside flow into the restaurant on the inside.\nThe host greeted us and told us it would be about twenty minutes but really, it was less than ten. We were seated near the kitchen which was fun to be able and look inside while watching orders come out. Our waitress helped me narrow down which cocktail I wanted and I settled for the 'Ladybird' which didn't disappoint. We skipped appetizers since we weren't too hungry and each got an entree. I opted for the margarita pizza and my husband got the shrimp tacos with the green rice as a side. Everything tasted great and was very good. The overall vibe of the restaurant was enjoyable and each table had enough space between so you don't feel squished. I am happy that we tried Tazza and we will be back very soon!",
   "Took a while to get a seat, so definitely recommend reservations if you go on a Sunday morning. Food was amazing! Service was good even though they were packed. Portions are large. I couldn’t finish my French toast. Coffee was delicious too! Only complaint was the wait.",
   "Fun food good service. Pleasant and interesting building. Crab cakes are worth the visit alone. All the seafood was good and the table next to us raved about the tacos and burger. Clean and comfortable.",
   "A nice locally owned place to order a fantastic pizza. They have all the normal Italian staples. They have an awesome pizza selection. I ordered a Spicy Sausage and Black Pepper Honey pizza and it was incredible. The service was great and friendly. Prices were about normal, about $10-15 per person.",
   "I was very impressed with this restaurant. The atmosphere was cozy, the staff was friendly, and the food was tasty. We tried the brisket tacos, carnitas tacos, and the spicy sausage and black pepper honey pizza. Wasn't disappointed with anything. I would come back for sure."
  ]
 },
 {
  "name": "Mecca Restaurant",
  "address": "13 E Martin St, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/69b9d814-9333-11ea-9b1d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "historic",
   "walking",
   "tour",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15259438091411237306",
  "source": "GoogleMaps",
  "reviews": [
   "I'm glad this place is still going strong after all these years. I love the \"diner classics menu\" but I wish they still served breakfast all day. Now they just serve breakfast for Sunday brunch. Under new owners, they now have evening hours, & serve alcohol. Prices have gone up. $25 is too much for a diner lunch for 2!",
   "Best fried chicken in Raleigh. And boy do they give you a lot of it. Plenty to share!",
   "One of the best old school restaurants in Raleigh.  Food has been constantly good for the last 20 years I have been going there.  Their Cheese Burger is perfect.  Meat and 2 for lunch.  Never disappoints.",
   "Mecca serves delicious, Southern-style diner fare with a warm and friendly atmosphere. We love bringing guests to this historic location and featuring tastings from Mecca as part our Raleigh Walking Food Tour.",
   "Been in business for 90 years. It shows. Great food and a great price. Wonderful staff to boot. The building is awesome and they have an old ham. Go and see it for yourself"
  ]
 },
 {
  "name": "The Point At Glenwood Restaurant and Bar",
  "address": "1626 Glenwood Ave, Raleigh, NC 27608, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6a2172b4-9333-11ea-ae5b-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13257147706338611227",
  "source": "GoogleMaps",
  "reviews": [
   "Impromptu dinner visit on a Monday night had all 3 of us pleasantly surprised as first time guest. Would recommend it and would gladly return.",
   "My husband's food when it arrived was hot while mine was not.  We love coming to The Point to dine but this time we were not quite as impressed with the food as we have in the past.  Our server K was exceptionally terrific as all your staff has always be friendly.  We will continue to visit but I believe feedback is always welcome.",
   "Amazing environment in Raleigh’s historical five points. A staple. Amazing food and drinks and support staff. Highly suggest dinner and Sunday brunch buffet. Can handle large parties with ease!",
   "The Perfect Lunch. Pizza, Soup And Salad! Love this place..",
   "It was good. Food was seasoned perfectly and it was cooked well. A blackened grilled chicken of some sort lol. Bartender was nice too. It was cold as Ice in there so thank God I brought my jacket."
  ]
 },
 {
  "name": "Cafe Tiramisu",
  "address": "6008 Falls of Neuse Rd, Raleigh, NC 27609, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6a792ffa-9333-11ea-95c8-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6095227580905415728",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely dinner at the bar last night.  Attentive waiter/bartender.  Servings are ample.  Nice wines by the glass.  Well seasoned food.  Pasta is cooked just right.  Can't wait to return to try other dishes.  Very much recommend.",
   "I have been wanting to try Cafe Tiramisu for a long time. I've heard and read so many good things about it. I finally got the opportunity to have dinner here, and I can see why so many people love this place. Service by far was the highlight. Very friendly, and welcoming. My entree selection, the Chicken Marscapone, was just wonderful. So decadent, and balanced with the spinach fettuccine alfredo. I normally am unable to finish my pasta at most Italian restaurants, but this dish changed that! The wine we chose was also excellent. In contrast, the cocktail menu could use some work. The two selections we chose from the list didn't seem to fit with the time of year, and was a little on the overly sweet side. Also, the small caesar salad I had to start the meal, was surprisingly bland. I'm hoping the more interesting sounding entree size salads are more exciting. That all said, it was a superb meal. I would highly recommend this place for anyone looking for good Italian food in the triangle area, especially for a date. Don't let the Harris Teeter shopping center fool you, It's legit! First Time Diners: Make your reservations early, as this place is on the smaller side.",
   "Chilean seabass, tomatoes, spinach, capers, parmesan white wine reduction sauce with homemade spinach fettuccine... highly recommend!",
   "Excellent.. Best Italian cuisine in Raleigh. Service is top notch. Intimate dining experience that impresses every time. Recommend making a reservation, but will accommodate if possible. Thank you Cafe Tiramisu! And RD!!",
   "I ordered take out tonight. Excellent food! The shrimp and scallops pasta, clam linguine and tiramisu wonderful! Thanks!"
  ]
 },
 {
  "name": "Margaux's Restaurant",
  "address": "8111 Creedmoor Rd, Raleigh, NC 27613, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6abd8c00-9333-11ea-8837-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16290350753765763233",
  "source": "GoogleMaps",
  "reviews": [
   "The angel hair pasta with shrimp was probably the best pasta plate I've had in a while. \nGenerous portion sizes at a reasonable price.\nOur server was attentive and fun! \nThe restaurant has a cozy, dark feel about it.\nDefinitely recommend for a date night, or to impress out of town family.",
   "My party of four Tried the Three course dinner each: all were promptly served and the right portions from appetizers to dessert! Great decor, friendly staff and comfortable.  Ample parking.  Highly recommended",
   "Food was fantastic. From the appetizer thru dessert. Service was very good. Atmosphere was just right. We enjoyed the 3 course meal and I would certainly recommend it. Never felt rushed. A delightful experience. This is my 1st five star in almost 2 years.",
   "During this very difficult time we ordered our favorite comfort food to go. The owner Steve who knows us very well said no problem and his team had our meal prepared as quickly and as appetizing as dining in. We  support our favorite restaurant in Raleigh and hope that you will too through and beyond this crisis. Thanks Steve!\nCarol and Russell",
   "Have been here before and especially enjoyed their weekday specials.  This Saturday night we were lucky enough to be invited to a private dinner and it was phenomenal.  Stephanie and Trey took the BEST care of us from appetizers to dessert.  I love that the Chef knows how to kick up flavors.  The appetizers we had were all amazing.  Our group also enjoyed soup or salad, exceptional entrees and fantastic desserts.\n\nMy Cornmeal Crusted Grouper with Hoppin' John, Local Collards, Red Bliss Mash and House Hot Sauce was so good and plentiful that I can't wait for leftovers.  Meanwhile others were happy with their entrees.  Many got the Filet and it was perfectly cooked.  Yum also for the Key Lime Pie, Bailey's Cheesecake and Profiterole desserts!\n\nTIP:  Monday nights they have a special deal all night, then other weekdays look for their early bird specials!  \n\nThis place is great for date-night because you can actually hear what someone is saying, and they take such good care of you!"
  ]
 },
 {
  "name": "Bahama Breeze - Curbside To Go & Delivery",
  "address": "3309 Wake Forest Rd, Raleigh, NC 27609, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6b08c624-9333-11ea-9f94-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "eat",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5419888908894136738",
  "source": "GoogleMaps",
  "reviews": [
   "Our reservations were honored swiftly. Very nice atmosphere. For some reason the lights blinked on and off four times during our dinner visit which was alarming. The food was absolutely delicious. However, the portions were small for the pricing in my opinion. Our server was amazing.",
   "The food was really good. I'm Caribbean, and my mom is one of those who would rather cook than eat out but she was visiting, and she loved the flavors, preparations, and service! I've already recommended this spot to my siblings, and I'll definitely be doing back. Nonetheless, it's super comfortable. I'd say casual attire. I wore heels and didn't feel overdressed.",
   "Really good food, second time on this chain, first time in this location. I was really satisfied. This location has an \"outdoors indoors\" which they offered to sit by the fireplace, and it's really nice, but the cold from outside still leaks in very well, so one side was chilly and the other was somewhat warm from the fire.\nI had an amazing server, he was on top of his job, not too intrusive either. Before going there, everyone said the service sucks, but I loved it.\nKeep in mind I wasn't there in the busy hours.",
   "The food is wonderful, the portion sizes are generous. The atmosphere feels like you are in an Island cafe', just without the sand. The service is kind and thoughtful. There are a large number of seafood and vegan options. There are also great desserts, and  generous portions... !!!!",
   "So I have been here before and let me say... The food is almost always amazing. The staff is usually very good too. My last visit had an unexpected visitor but the manager was quick to acknowledge the situation and comp my meal as a way to help rectify it. I will go back, but not anytime soon. Some might not think it is fair to hold them responsible for an unexpected visitor, but I can't help it. Sorry."
  ]
 },
 {
  "name": "Hummingbird",
  "address": "1053 E Whitaker Mill Rd STE 111, Raleigh, NC 27604, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6b5fe718-9333-11ea-a76e-14b31f159f22.png",
  "tags": [
   "free",
   "unique",
   "food",
   "delicious",
   "drink",
   "food",
   "food",
   "delicious",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14943076390288970987",
  "source": "GoogleMaps",
  "reviews": [
   "First time dining at Hummingbird. Friends and I went for brunch and they had a quality menu. Service was quick and easy. Only downside was a few people at my table requested gluten free bread and they came back to say they were all out. They did accommodate them but their meals were not as enjoyable because of that. I’d go back however, despite that. Chicken and waffles were great.",
   "Great place with a friendly staff.  The food was superb.  Although this was our first visit.......I believe our choices were great.....so here goes.  My wife started with the Hummingbird Fizz signature drink.....and I had an amber lager.  We tried two small plates to share, the wings and fall salad....both were phenomenal.   We then ordered dinner...I had the pork cheeks which were five or six incredibly tender pieces of meat over potatoes and broccolii (steamed) over the top.  My wife had the chicken......and she was able to finish half (the rest will be for lunch tomorrow).  We also had the charred cabbage which really was unique and very tasty.  We'll be back.",
   "Wanted to grab some good and quick!!!! My first time eating but as soon as I saw my favorite waitress from another favorite spot, I knew the food here would be great!!! She suggested the avocado toast with a fried medium over well egg and this spicy peanut sala!!!!!! I paired it with a drink made from wild flowers and raw honey and finished my meal with a sticky bun with sea salt and caramel!!! SOOO FREAKING DELICIOUS!!!!!! 🤤🤤🤤🤤🤤🤤🤤🤤🤤🤤🤤",
   "The food was gorgeous and wonderful - I had a salad with chicory - and so were the drinks. I had something grapefruit, I think, garnished with rosemary. I loved it. This place nails all the greatest details - heavy silver, paper straws, cloth napkins and cloth towels. In addition, the décor is, like, this beautifully sophisticated mix of traditional, rustic, industrial, MCM and, like, normal elements. The whole experience ends up just being a joy - cozy and chic. The service was unbeatable",
   "Hummingbird is heaven, it feels familiar and friendly. The food is always unique and delicious. #fawnfeasts on ig"
  ]
 },
 {
  "name": "Capri Restaurant",
  "address": "6325 Falls of Neuse Rd, Raleigh, NC 27609, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6baecbac-9333-11ea-8d16-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "family",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9926569522158073882",
  "source": "GoogleMaps",
  "reviews": [
   "Dino always has a friendly welcome, a warm smile, and excellent food. His support of Veterans is unmatched.",
   "One of the best keep secrets in the area. I am very picky with Italian food but this was by far some of the best Italian food I have had in a long time. The chef will make anything you like even if its not on the menu. The gnocchi, calamari, and fried veal was delicious. The desert was the icing on the cake. This is a must go!!!! It will not disappoint!!",
   "Wonderful restaurant! The owner Dino makes the dining experience super special! My family went for Sunday dinner but you could easily enjoy this place for a date night or celebration dinner! The food was very authentic! The Tiramisu and ice cream were both delicious! I recommend this place!",
   "Great Northern Italian food. Family owned, best Tiramisu I have ever had.",
   "This place is great! The food and decor were spot on. No complaints, but this restaurant is just in a super unfortunate location. It deserves a lot more traffic than it gets."
  ]
 },
 {
  "name": "CO",
  "address": "101 Park at N Hills St, Raleigh, NC 27609, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6beff274-9333-11ea-bf69-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "delicious",
   "walk",
   "eat",
   "food",
   "food",
   "delicious",
   "drink",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6965756202426193058",
  "source": "GoogleMaps",
  "reviews": [
   "One of the better restaurants that has a good selection of Gluten free and Vegan options in the Raleigh area.\n\nOverall great food with a mild taste that will satisfy even the most discerning local critics.  Value was spot on and the vibe was hip enough but not too much ‘in your face’.  \n\nTried two types of Summer rolls for starters, both were excellent and mild.  Sauce was the excellent complexity that added just the right kick at the end.  If you need heat, there are house sauces that will suit you need for speed.  \n\nHibachi Deluxe was next with a tofu lemon grass piece that had a beautiful layer that was excellent and fresh.  The vegetable medley was soft with a little crunch, just right with beautiful colors of reds and greens.  \n\nFilling meal, dessert was too much for us.  I could possibly see an addictive trend starting with the excellent food and service.  Wonderful meal.  Definitely worth a two hour drive for a great experience in the city of Raleigh.",
   "This place, is an amazing restaurant! There dishes are delicious, authentic, and just all around amazing. Its across from the Capital Grill, which is another amazing restaurant. There is parking across the street from Co, so you wont have to walk far! If your looking for a good place to eat in North Hills, and your looking for something different, I highly reccomend this place!",
   "Incredible food, friendly and attentive staff, and an elevated casual atmosphere.\nWe split the pre fixe menu (tuna taco, half sushi roll, hibachi tofu, and strawberry spring roll) and added edamame gyoza, ahi poke stack, and mango summer roll.\nThe food came out with great timing, and was beautifully presented to the finest detail. Better gyoza than we've found in dumpling houses, the raw tuna was superb and not at all fishy, the hibachi was the first hibachi I've /ever/ enjoyed (well-seasoned, crisp tofu, not too salty, great sauces) and the strawberry spring rolls were a shocking, magical experience.\nWe'd give it more stars if possible!",
   "Excellent service and incredible food! It was a perfect date night spot! We ordered three entrees and a small dish and it was half-off a bottle of wine night, so we got a French red wine with a name I can't remember or pronounce. Definitely coming back!",
   "I am giving it a 5 stars for so many reasons. My boyfriend and I went on a little getaway from Charlotte. We were undecided what we wanted to eat so we came to CO. We started with some Spring Rolls appetizer. OMG I really recommend them. Especially if you like healthy food. I just think they need to put a little bit of more meat. Well it was time to order our food and like always my boyfriend didn't know what to get. It was either Poke or Hibachi Bowl. Without asking the server she (Asian short lady)was kind enough to explain what was the difference. Basically Poke is a Hot/Cold plate while the Hibachi is a hot one. He decided to go with the Hibachi which I recommend. I got myself Com Chein. This plate was so delicious. It was rice with chicken, shrimp, carrots & edamame. I had a whiskey sour which I'm very hard to get pleased with the drinks down here since I'm from NY. I was in Heaven with my drink. I will definitely go to this restaurant again!"
  ]
 },
 {
  "name": "Jose and Sons Bar and Kitchen",
  "address": "327 W Davie St #102, Raleigh, NC 27601, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6c3c64d4-9333-11ea-84e0-14b31f159f22.png",
  "tags": [
   "music",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16000679661345639702",
  "source": "GoogleMaps",
  "reviews": [
   "The experience was a delight all the way through. The music was light and cried noise minimal. Understated and appropriate decor. Friendly and prompt wait staff. It's restaurant week so I had the lunch 3 course special. Brisket flautas, the Raleigh burrito and flan. Each was plated well and the flavors were fresh and tantalizing. This is a place to revisit for me.",
   "Not super happy with the Sunday Brunch menu. It feels like it's been trimmed down and not really standing out. The menu used to have several favorites that are now gone.",
   "Fantastic option for corporate catering! We ordered from Jose & Sons for our companywide meeting in Cary on October 4, 2019 (National Taco Day)! The food, portions, and service were all fantastic. Mike, our catering manager, was very responsive and helpful with menu suggestions. Delivery was on time and everyone loved the food. I would highly recommend Jose & Sons for your office catering.",
   "A very cool place for good Mexican food. The burrito I had was awesome. As well as the brisket tacito app and flan dessert (all part of Triangle Restaurant Week menu). Great portions and friendly service. I'll definitely be back to try out the rest of the menu.",
   "Absolutely delicious plates. Reasonable prices. A fun mix of Mexican food + Southern, very well executed. Highly recommend if visiting Raleigh.\nAnd you can make reservations in advance online."
  ]
 }
]