[
 {
  "name": "Maymont",
  "address": "1700 Hampton St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6c8247c2-9333-11ea-9ca5-14b31f159f22.png",
  "tags": [
   "kids",
   "nature",
   "walk",
   "kids",
   "free",
   "family",
   "walk",
   "kids",
   "historic",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=4834827198225545156",
  "source": "GoogleMaps",
  "reviews": [
   "Clean, green and very well maintained. Italian garden, Japanese garden, Nature center and wild life experience makes the visit here filled with fun for all age groups. Mansion is great. Kids would love exploring nature up and close here. Not sure if there is a bicycle path here.",
   "One of the best free attractions in Richmond. Great place for a picnic or to walk around and see the Japanese garden. I love feeding the goats and sheep (remember to bring quarters). We had our daughters 1 year birthday party in the Stone Barn and it was awesome, they had horse and carriage rides for the kids. One of our go-to stops if the weather is nice.",
   "The gardens are well maintained and the animals are taken care of too. Bring the family or someone special to enjoy this Richmond jewel. Be mindful, not all trails are paved so you're going to have trouble if your wheels/feet aren't off road and you want explore the grounds fully.",
   "Lots of space to run around, beautiful gardens and historic house, and of course lots of animals to see. They have a whole petting zoo farm area AND a zoo area with local wildlife. They have eastern bison, a black bear, deer, and birds. Great place to take kids or go for a nice walk. I definitely haven't seen the whole place its full of secret areas.",
   "We love Maymont! While it's not a traditional zoo, my son gets such a kick out of the animals. It's a great way to spend a couple of hours. Such a fun mixture of zoology, botany, and history. A great Richmond fixture for the whole family. Bring some quarters if your little ones like to feed animals!"
  ]
 },
 {
  "name": "Virginia Museum of Fine Arts",
  "address": "200 N Arthur Ashe Blvd, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6ccf5680-9333-11ea-b8ca-14b31f159f22.png",
  "tags": [
   "kids",
   "art",
   "walk",
   "knowledgeable",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=4695707663755383770",
  "source": "GoogleMaps",
  "reviews": [
   "We love this museum, it's not too big and there's always something interesting going on. Last month we came for the Edward Hopper exhibit, and this past weekend we came to see the existing museums exhibits (I really liked the American Art gallery, really beautiful ) and there was China Fest, for the Chinese lunar new year! Beautiful presentations by community dance and martial arts groups, programs for children as well ! Lots of kids! So much fun!",
   "I love this place. I do find it a bit confusing to walk through, but there are many docents available to help. I bought tickets for the Edward Hopper exhibit yesterday and the woman at Visitor Services was so kind & helpful - set the tone for a wonderful visit!\n\nThere are many clean restrooms and a beautiful museum store. The entire place is so calming and makes for a great any day activity- alone or with a group.",
   "Wonderful museum with beautifully curated exhibits covering a wide range of fine arts. The recent Hopper show was spectacularly presented. The museum staff here is the most knowledgeable, welcoming and helpful I have ever encountered. And let's not forget Amuse, the VMFA's world-class restaurant -- wonderful cuisine, cocktails, and wine list, plus awesome servers and staff.",
   "Excellent Location. Cool and different artwork that caught my eye in all sorts of mediums. If you love art I spent 4 hours here and didn't even go over the additional exhibit they had at the time. Clean and relaxing as well.",
   "What a great collection in a wonderful building. They really have one of everything here. This special exhibition space was generously proportioned so you had plenty of room to see all the art."
  ]
 },
 {
  "name": "Science Museum of Virginia",
  "address": "2500 W Broad St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6d133d5c-9333-11ea-80cd-14b31f159f22.png",
  "tags": [
   "active",
   "kids",
   "free",
   "kids",
   "knowledgeable",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10474820232218678101",
  "source": "GoogleMaps",
  "reviews": [
   "We took the kids here and this is by far the best science center I have ever been too. The kids had so much fun playing around and learning. I would have to say one of my favorite parts were playing air hockey with a robot, probably the nearest thing I've ever done. I would love yo go back. They do offer military discount, free for the active duty member and a dollar off for their dependents. We really enjoyed our day here and would love to go back. We traveled 2 hours to get here and it was well worth the trip.",
   "Very nice place for kids in the 5-12 year range. After the spectacular entrance, we could see the magical SR71 stealth aircraft. Very good decision by the museum folks to move it inside. They have live animal exhibits, which is cool. There are folks who could answer any questions you might have, which is very good. Kids loved the science challenges. There are nice exhibits about current day problems such as plastic, pollution, etc which are so relevant and useful for everyone to know.",
   "Wonderful science museum with a great, ever-changing collection of exhibits and hands-on activities. We especially loved the live dissection of a cow's eye! The only challenge of visiting the museum is the limited parking, though there are lots on the side off Broad and you can park in front of the children's museum next door. Definitely worth a visit or membership, especially if you have children!",
   "An extremely fun and informative museum for individuals of all ages. The exhibits here are time-honored and exciting. Staff is very knowledgeable and friendly, especially with children. If you're looking for a fun place to take the kids on a Saturday afternoon, this is the place.",
   "Great museum with lots of hands on activities to keep children engaged. The special event space is large and they always have great exhibits in there as well. I also appreciated the live cooking events that they do. I will say that their Cafe is pretty lackluster. It is all microwave food and premade sandwiches. For the price and the number of people (four) they had working behind the 10ft long counter they could have actually prepared some food. Overall, though a great way to spend a day."
  ]
 },
 {
  "name": "Virginia Holocaust Museum",
  "address": "2000 E Cary St, Richmond, VA 23223, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6d64e012-9333-11ea-b9da-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "historic",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=11737842106812738664",
  "source": "GoogleMaps",
  "reviews": [
   "It’s FREE (As it should be)\n\nThe spiral bound tour guide is well laid out and easy to follow. \n\nIt doesn’t take an entire day to go through (~2hr)\n\nThe Nuremberg trials room full scale replica at the end is simply stunning. \n\nPossible next upgrade: an app or audio guide version of the tour. The app would also be an easy giving portal.",
   "This museum is a very historic place. It will make you very emotional. As a wedding and event planner their auditorium is the perfect place for a reception. The view from upstairs overlooking the dinning area can be breathtaking if decorated right. We had the opportunity to do two event here. The staff is friendly and very accommodating. The museum itself is very clean. The caterer need warming towers as there is no kitchen and a limited food prep area",
   "My husband and I spent two hours at the museum but didn't finish so we had to return the next day. It is pretty incredible. We were surprised by the detailed information and authenticity of the materials that were displayed, as well as the connection to those who survived the the holocaust then relocated to Richland. This free museum is a treasure.",
   "Awesome experience, very humbling..... I didn't take any pictures. Wouldn't recommend for younger children because of content and there is a lot of reading and they would get bored very quickly.",
   "Well told story, much information and many photos. Hard to take in sometimes- definitely takes 2 hrs or more depending on how much you read."
  ]
 },
 {
  "name": "The Edgar Allan Poe Museum",
  "address": "1914 E Main St, Richmond, VA 23223, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6da96374-9333-11ea-8201-14b31f159f22.png",
  "tags": [
   "learn",
   "learn",
   "library",
   "art",
   "art",
   "history",
   "library",
   "walk",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=14196981765529427724",
  "source": "GoogleMaps",
  "reviews": [
   "A very nice small museum! I'm sure it's lovely in the spring time with all the different plants. I would say you need to have an interest in Poe to visit as you will learn A LOT about him and his life. My visit was fun until the place swarmed with secret service.",
   "I love that there are different buildings to self navigate through. Very cool sit down library with local raven art on the walls. Cute resident cats, nice staff, and lots of interesting things about Edgar A. Poe to learn here.",
   "If you love history and poetry. Especially American Poetry written by Edgar Allen Poe this is the place for you....it's a quaint building but has a very eclectic collection of Poe relics, art, and history. Awesome place. Very cool spot. A must see.",
   "Nice little stop for horror and mystery enthusiasts. There is a garden, small library, gift shop and museum on the property. It's not really a spooky thing, more educational. Die hard fans can leave a note or poem for Edgar. There is a shrine. But mostly it's a collection of historical items that have been saved from his houses or work before the buildings were destroyed.",
   "Poetic. I have been a fan of Edgar Allan Poe since I was a little boy. I came to Richmond unaware of the museum here in his honor. What a treat!! First, folks, this is a right-sized museum. Not too big and not too small. Prices are very affordable and getting here from our downtown hotel was an easy but slightly long walk. Too many cool details to describe, but having a black cat strolling through the garden could only have been topped by a raven."
  ]
 },
 {
  "name": "Libby Hill Park",
  "address": "2801 E Franklin St, Richmond, VA 23223, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6dee34a8-9333-11ea-8f52-14b31f159f22.png",
  "tags": [
   "parks",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5498133758744061044",
  "source": "GoogleMaps",
  "reviews": [
   "One of my favorite parks in Richmond. The views of the river and the city are amazing and the park is very well maintained. You see weddings often up here. There are plenty of benches and even a picnic table. And if you’re up for a workout, a great set of stairs! 😃",
   "One of the best views of the sunset/skyline in Richmond. Great place to sit down and have a picnic if the weather is good. Parking is easier than expected.",
   "Must see in Richmond a skip a way from downtown, great food trucks and great restaurants. Outdoor haven on nice days. Great place to take a dog or get a jog.",
   "Great views of Richmond. Still has the old gas lamps. It is a popular workout spot due to the long set of stairs.",
   "Nice views.  I stopped because I rode through this park on Zwift.  Nice place to just stroll and enjoy the views of Richmond."
  ]
 },
 {
  "name": "Virginia State Capitol",
  "address": "1000 Bank St, Richmond, VA 23218, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6e380f3a-9333-11ea-9638-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "history",
   "free",
   "hospitable",
   "tour",
   "knowledgeable",
   "family",
   "art",
   "history",
   "walk",
   "tour",
   "walk",
   "tour",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=18364975359890376154",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful building designed by Thomas Jefferson. So much history in this one location. Very knowledgeable and hospitable tour guides. Free tours on the hour. Loved seeing the original senate chambers and the statue of George Washington. The movie \"Lincoln\" was filmed here. Don't miss the Virginia Women's Monument outside.",
   "Amazing Capitol. Awesome architecture and lots of history. The people who give the tours are very knowledgeable and fun to listen to. Me and my family absolutely loved the Virginia State Capitol Building would definitely go back to this state of the art building.",
   "Fun time and educational. I skipped the tour and went on a Friday afternoon when it wasn't crowded. Employees were very helpful. The statues of Thomas Jefferson and George Washington are cool and the architecture (designed by Jefferson) is beautiful. There's also a nice park with statues outside to walk around in.",
   "Great place to visit. Very historical. Amazing views. Great location to walk around Richmond and visit various locations. Beautiful architecture.",
   "The actual tour of the Capitol is interesting in itself, but our docent could have been teaching a history class. So much knowledge! The majority of the time is spent in a few chambers so there is not a lot of walking. The information imparted there was of utmost interest and importance. Of course there is s gift shop which contains a variety of treasures. Our first stop in Richmond definitely encouraged us to explore more."
  ]
 },
 {
  "name": "Agecroft Hall & Gardens",
  "address": "4305 Sulgrave Rd, Richmond, VA 23221, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6e8a7528-9333-11ea-ad2d-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=6169886509978903784",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful home that truly takes you back in time. Your is very informative, though a bit long. Even in the winter the grounds are stunning, but must be truly magical in the spring/summer when in their full glory.",
   "This is a amazing jump back in time to 1400s.  For $10 you will have a educational tour inside.  Stating with a short film.  A few opportunities to sit and rest while your guide describes life during the times in which this house was in England.  When the tour is done you will have the rest of your time to yourselves in the garden and grounds.  Well worth the trip.",
   "I love agecroft but it has gotten to where all of their tours are identical.  You get exactly the same thing no matter which one you take.   Regular tour,  \"behind thre scenes, \" \"architectural history, \" whatever... all the same.",
   "History buff place.  Only Elizabethan furnished English Manor in the U.S.\nGuided tours only inside.  Lovely staff.  Gardens well worth seeing.",
   "Such a beautiful manor. So glad it's still preserved."
  ]
 },
 {
  "name": "Maggie L Walker National Historic",
  "address": "600 N 2nd St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6edfe858-9333-11ea-b78b-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "kids",
   "history",
   "history",
   "tour",
   "free",
   "learn",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=12507273886831530918",
  "source": "GoogleMaps",
  "reviews": [
   "The guide was super friendly and knowledgeable. The house is well preserved and it's like you're transported back in time. The tour is about an hour long and the kids can do activities in their junior park ranger booklet throughout it. Recommend this historical site to people looking to get their history fix in Richmond.",
   "If you like museums and history....\nGo visit Maggie L. Walker's home in Richmond, VA! The National Park Service (NPS) maintains this property and it was and is an eye-opener. I admit, i did not know who she was.....but i find myself telling EVERYONE i encounter about Maggie and her absolutely PHENOMENAL  life! \n\nI am now and forever will be a fan of Maggie L. Walker and her legacy!!\n\nI enjoyed learning about her and all she has done!",
   "Amazingly preserved home of an amazing woman!  Great tour.  Highly recommend!  And it's even free!",
   "This was such a neat experience, lots of information. Amazing, I would love to go back again.",
   "Visited the Maggie L Walker NHS as we try to visit all of the units in the park system. The staff here was extremely friendly and informative and, due to the low visitor count, we got a private tour of Maggie's home.\n\nWould recommend visiting to learn more about this woman. Expect to spend 1-2 hours here if you do the tour"
  ]
 },
 {
  "name": "American Civil War Museum- Historic Tredegar",
  "address": "480 Tredegar St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6f2492a8-9333-11ea-8ba9-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=9133931592626346375",
  "source": "GoogleMaps",
  "reviews": [
   "A great place to visit for civil war memorabilia and artifacts. Stunning composure and presentation of materials with breathtaking audiovisual supplements makes for a singular experience that cannot be overlooked by any history buff. The expose on early American currency was particularly informative, including a wide selection of bills, both government and private bank notes. External exhibits were equally intriguing with the explanation of the workings of a civil war era iron mill. Outstanding in all aspects.",
   "Really nice museum! Very informative! It is a little pricey and smaller than I thought but they do squeeze in a lot of information. Parking is validated with a ticket which is really nice. I brought my 5&9 year old honestly it was too much reading for them. They liked to look at the pictures and exhibits however went through the whole thing within minutes. My 5 year old was very bored.",
   "Museum is well set up and has interactive electronic screens for each year of the war. There are also a few short videos that you can sit and watch throughout the exhibits. It is very visitor friendly and breaks the information up into digestible pieces. Highly recommend!",
   "Excellent museum that I think expertly handles the intricacies of the Civil War. I learned a lot. Beautiful interior of the museum. Many multimedia presentations. Pretty cool. Probably ages 10 and up. But the 10yr old would have to be pretty interested in history.",
   "Political Correctness run amok!\n\nI'm not sure why the old Museum of the Confederacy was closed or why it merged into the Civil War Center to become what it is now, but it was a major disappointment.\n\nThe exhibits are well done and the facility is a wonderful effort of conservation and city redevelopment, however, they fail to pursue numerous area of this controversial area.  While they do deal with anti-war riots in New York and similar themes of the Confederacy, a lot was left out.  Now this isn't because the place is overfilled with material.  Nope...I'm estimating that only about 25% of the available floor space is occupied with exhibits.  The entry areas are massive and a waste of space.\n\nFinally, in the gift shop, there are plenty of replicas of historic Union flags, as there should be, but no Confederate battle flags.  That says it all.\n\nDon't waste your time here."
  ]
 },
 {
  "name": "Hollywood Cemetery",
  "address": "412 S Cherry St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6f67909e-9333-11ea-994e-14b31f159f22.png",
  "tags": [
   "history",
   "unique",
   "walking",
   "hike",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1868792720037819328",
  "source": "GoogleMaps",
  "reviews": [
   "Enjoyed the afternoon to take a drive through. Very clean and well maintained cemetery. Was able to visit John Tyler and Jefferson Davis burial sites. The view towards the city and James river is well worth the visit.",
   "A very nice and calm place to visit. If you love visiting cemeteries like I do, this place is a must. Very well kept up, a little easy to get lost in but it makes a great story. Just a magnificent place, great history.",
   "Hollywood Cemetery is best know for being the burial location of  three people: James Monroe, John Tyler, and Jefferson Davis (and a whole bunch of confederate soldiers). \n\nHowever, locally, it best know for three ghost stories: The Little Girl and her Dog, the crying Pyramid, and the Richmond Vampire.  \n\nPlus, to the dismay of the fine ground keepers at Hollywood Cemetery, it's almost a Richmond tradition to sneak into the cemetery at night. FYI: If you do get caught, you can be arrested and face huge fines.",
   "Unique place to explore. We love walking with our dog. Beautiful views of the James River and city.",
   "Beautiful, historical park like cemetery with graves of multiple Richmond notable figures & 2 US president’s.  Lovely views overlooking the James River.  Makes for a great urban hike.  For fans of the civil war it’s a must see as it has a large confederate section along with the grave of Jefferson Davis (not in the confederate section) & his family.  Many beautifully carved graves including faux bois style, figural, & obelisks.  A must see for native Richmonders & visitors alike"
  ]
 },
 {
  "name": "The Valentine",
  "address": "1015 E Clay St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6fb4ec38-9333-11ea-8a5f-14b31f159f22.png",
  "tags": [
   "family",
   "walking",
   "learn",
   "unique",
   "tour",
   "history",
   "creative",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7347595526388950143",
  "source": "GoogleMaps",
  "reviews": [
   "This Museum was a great experience. There was a good gift shop inside with a good selection. There was over 100,000 items out on exhibit here. They are constantly updating the exhibits. The staff is extremely friendly and has a great deal of knowledge that they share with you if you have any questions. They exhibits are presented in a very elegant way. This Museum encompasses three buildings on this street.",
   "I Zenia really had a wonderful time last night. It felt like I was invited to an awards program to receive a trophy., walking on the RED CARPET,  yea, yea, and the award i receive was a place on the wall in the Valentine's Museum.  \n it was like a fairy tail dream. but, hey it was real. with all my family,  and other winning recipients.  On the wall will all my WARRIORS",
   "The Valentine museum is a great experience. You’ll learn about “meat juice” and great elements of what makes Richmond unique and its rich history. Don’t miss the house tour!",
   "I have visited this museum several times. I really enjoyed the variety of Richmond & US history and present day stories that were provided. When I went last, the Miller and Rhoads clock was proudly displayed above the stair well that descended to the basement-like floor; that was something very special to see since my grandparents loved the store. I was also given a tour where our group was allowed to hold old, historically-important books, such as ones belonging to/read by Patrick Henry. That was very fun; I am an avid reader and love history. The museum has a creative mindset with their exhibits, there was not just one area of focus in history, the range was lovely. I reccomend this museum to be visited by adults or older children, the younger ones might not be interested in what they have to offer.",
   "What beautiful buildings on a really cool street!"
  ]
 },
 {
  "name": "T. Tyler Potterfield Memorial Bridge",
  "address": "T Tyler Potterfield Memorial Bridge, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6ff6d53a-9333-11ea-9b19-14b31f159f22.png",
  "tags": [
   "history",
   "nature",
   "walk",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=6107406626794193564",
  "source": "GoogleMaps",
  "reviews": [
   "Great bridge with great views and feeling of nature plus historical stories that the bridge has experienced and engraved on top of the bridge. You can feel the times of history and the emotions of the people involved through the addresses along the bridge. Well done.",
   "Outstanding addition to James River park system. Great views and has really expanded public access.  Cool historical markers and quotes as well.",
   "Gorgeous landscape of Richmond. I come to Richmond every week for work and I think this maybe the highlight of coming here. Such a gorgeous place to run, walk or just get away. \n\nI had a hard time finding the parking for this as the GPS kept stopping on the highway bridge. So I googled the climbers parking lot and there’s a path that takes you to the walking bridge and overlook. \n\nA must while your in Richmond for a big chunk of their history and natural beauty!",
   "Great views of the city and the river! Bring sunglasses when it's sunny out, the metal decking can get blindingly bright. If you're running, pick your feet up, the decking has some joints that stick up ever so slightly - just enough to cause you to trip! \n\nPark on the north side of the river near Tredegar St and Brown's Island Way or on the south side of the river on Railroad Ave next to SunTrust.",
   "Amazing natural pedestrian bridge with historical views. Well maintained and wide enough for large groups."
  ]
 },
 {
  "name": "Capitol square",
  "address": "1000 Bank St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/70414bd0-9333-11ea-9c49-14b31f159f22.png",
  "tags": [
   "learn",
   "unique",
   "tour",
   "history",
   "free",
   "history",
   "walking",
   "tour",
   "free",
   "history",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=5632234612563046321",
  "source": "GoogleMaps",
  "reviews": [
   "Paid a visit to the Capital to see the new Virginian women's monument - Voices From the Garden.  Though still in progress, the 7 out of 12 planned statues are very expertly crafted and worth the trip to see.  Surprisingly diminutive in size, the statues are realistically crafted and pleasantly life size. The memorial lacks information and context at this time.  There are no plaques nor hint of who the women are on display. So it's necessary to Google and learn who the figures are and who's to come. Not really a problem. All the more reason to pause and enjoy.",
   "An amazing building and place full of history and history being made. Take a tour and explore were the oldest continuous legislative body sits in session and the awe inspiring architecture of Thomas Jefferson. The tour guides are terrific and take you through the unique history of Virginia and it's legislative body.",
   "So much incredible history in and around this building. Touring the capitol and walking in the same chambers that Thomas Jefferson and George Washington did was surreal. Free hourly tours and such kind hospitality from the guides.",
   "We took the free tour of the Capitol on a Sunday when we had friends in town visiting. The tour provides a good mix of information about the architecture and history of the Capitol building - beginning with Thomas Jefferson's role in its creation. Also, how the construction of Virginia's Capitol building influenced subsequent design choices in Washington,  D.C. and government buildings throughout the country.  The tour includes entry to the house chambers. We really enjoyed the tour and the expertise of our guide.",
   "Historic building, lots of shade outside for those hot days, fountain, brick walkways, and underneath it all the visitor's entrance (with a delightfully air-conditioned inside)."
  ]
 },
 {
  "name": "Virginia Museum of History & Culture",
  "address": "428 N Arthur Ashe Blvd, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/708470b4-9333-11ea-a545-14b31f159f22.png",
  "tags": [
   "walk",
   "library",
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=891233438859866386",
  "source": "GoogleMaps",
  "reviews": [
   "I feel a little torn, I enjoyed the museum but I expect there to be more.  A good exhibit on the lasting, personal impact of slavery and a walk through of Virginia's history we're the only things to see. They were both done well, but I was looking for more. Exhibits seem to skip forward a lot: i.e. Jamestown, Revolution, Civil War... With very little discussion about what happened in between. It's good, but I expected more -- most of the museum's space seems to be given to an  event hall and library.",
   "A good overview of the state. They should keep the exhibition of African-American history in the Commonwealth on permanent display. Still has some Confederate displays from their time as the Confederate Museum.",
   "Everyone needs to visit this place and get educated. Anyone who visits this place and then still thinks anything about the Confederacy should be celebrated, glorified and honored is a kook. The Charlie Brown exhibit was awesome!",
   "They provides a full view of history, and done a good job to lay the history out in that space. They incorporates the both the original sense of history and the contemporary progressive ideas.",
   "I am very glad to visit this museum in Richmond.  The exhibits were put together very well and believe me, it's a lot to digest, especially The Story of Virginia.  One of the temporary exhibits that was available (the last day will be the 21st) is Fresh Murals, which showcases paintings from local artists.  All I can say they will start conversations on Virginia's past and how far we can move toward the future.  Pictures below will be from all the artists.  Enjoy."
  ]
 },
 {
  "name": "Virginia War Memorial",
  "address": "621 S Belvidere St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/70cc036e-9333-11ea-921a-14b31f159f22.png",
  "tags": [
   "kids",
   "learn",
   "field"
  ],
  "link": "https://maps.google.com/?cid=7667767460888585949",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely beautiful memorial! They did such an excellent job creating this place. Inside is a little museum full of collections of uniforms and weapons from the different wars. They also have videos available of interviews of veterans from Virginia from each war. Best part was the 3D photographs. They were stunning my kids really enjoyed their visit.",
   "Really great place to learn about duty, honor and the sacrifice that many native Virginians exhibited during our Nation's battles.",
   "11/20 - I had a field trip here and it was great. The movie 4d movie was my favorite part. And also to the person who died on 11/19 May he Rest In Peace he helped out country and we can’t pay enough Thank you.",
   "This place is very well maintained and quiet. It is a beautiful tribute to Virginia's fallen heroes.",
   "Very nice facility. I was there to start their new boilers."
  ]
 },
 {
  "name": "Children's Museum of Richmond",
  "address": "2626 W Broad St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7119604a-9333-11ea-9d06-14b31f159f22.png",
  "tags": [
   "kids",
   "learn",
   "kids",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=2399141364828390514",
  "source": "GoogleMaps",
  "reviews": [
   "My friend and I both took our 2 year old boys. They both loved and enjoyed this experience. There's never a dull moment especially with their short attention spans. There's so much to do even if they do lose the attention of one thing they're able to go find something real fast. It helps their developing skills and the staff is always wonderful. I really wish I had a membership here so that my son would be able to enjoy this more my friend and I both took our two year old boys. They both loved and enjoyed this experience. there's never a dull moment especially with their short attention span. there's so much to do even if they do lose the attention of one thing they're able to go find something real fast. it helps her developing skills and the staff is always wonderful. I really wish I had a membership here so that my son would be able to enjoy this more as a single mom my don't have. But they do have a deal where every second Friday is only a dollar and those are the days I love the most.",
   "Always alot to do, we usually spend 3-4 hours here. On the weekends they usually have a theme and many activities for the kids. The cost is inexpensive and you get more than your monies worth. The staff is friendly and always willing to help and include your children in activities going on.",
   "Clean, spacious and educative. Fun place for kids to play and learn. Arts and craft area is a good spot for young and adults to learn and bond. Amazing place to visit any season of the year.",
   "We had a great time. The age 3 and under section has been completely redone and today was the first day it was open so we were the first group to use it. It was also decorated for Christmas and had an exhibit section with tiny rooms we could enter decorated and dedicated to different holidays celebrated this time of year all over the world.",
   "We went during the holiday season and they had different holidays for cultures across the world. Very informative for children. Helps them learn that Christmas is not the only holiday celebrated."
  ]
 },
 {
  "name": "Robert E Lee Memorial",
  "address": "Richmond, VA 23220, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/715d5aae-9333-11ea-b9e5-14b31f159f22.png",
  "tags": [
   "family",
   "walk",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=3073916782280178816",
  "source": "GoogleMaps",
  "reviews": [
   "“We Are Fighting for Independence, Not Slavery”. - Jefferson Davis President of the Confederacy to Edward Kirk\n\n“Slavery is a political evil in every country.” -Robert E Lee\n\n“I am rejoiced that slavery is abolished. I believe it will be greatly for the interests of the South. So fully am I satisfied of this, as regards Virginia especially, that I would cheerfully have lost all I have lost by the war, and have suffered all I have suffered, to have this object attained.” - Robert E Lee\n\n“I have always been in favor of Emancipation.” - Robert E Lee \n\nRobert E Lee- Son of a Revolutionary war veteran, graduate of West Point, veteran of the Mexican American war, defender of Virginia, anti slavery, and president of a university. \n\nA great family man that everyone can admire.",
   "The whole Monument Ave is a nice walk or drive, a bunch of pretty houses, and some cool monuments, if that's your thing. Not really mine. Much pretty in spring or fall, when the trees are full & blooming",
   "Very beautiful. A sobering reminder of the lives lost during the civil war and very humbling to see. Unfortunately due to newly proposed legislation, statues and monuments such as this one may not be around much longer. So if you want to see it I would go see it soon. I saw the R.E.LEE monument in New Orleans before they tore it down. Saddening however I'm glad I was able to see it.",
   "Beautiful street to stroll and learn some history.",
   "Amazing monument. Beautifully setup"
  ]
 },
 {
  "name": "Maymont Nature Center",
  "address": "2201 Shields Lake Dr, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/71babd40-9333-11ea-aa1c-14b31f159f22.png",
  "tags": [
   "nature",
   "walk",
   "walk",
   "nature",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=17541122481027984313",
  "source": "GoogleMaps",
  "reviews": [
   "Small but awesome nature center with live fish, turtles, snakes, alligators, seahorses, river otters, and more. It's beautiful inside and very well arranged and presented. The staff are friendly. There is a discovery center with animal skeletons, pelts, shells, and hands-on activities in this nature center as well. It's also a great place to have a birthday, as you get a private room and full access to the discovery and nature centers. Worth the price of admission.",
   "One of our favorite places in Richmond. It's quiet, clean, beautiful landscape and some very cool animal rescues including two bald eagles and a bear! Who knew there were Bison in the heart of Richmond?😜",
   "I'm not sure exactly what words I would use to describe this place public park Mansion gathering spaces and just some beautiful spaces to walk around. there are so many different parts to this place it's good to look ahead to know what exactly you want to check out. Highly recommended. I wish you lived around here to come back many many times.",
   "The nature center itself is closed until April 2020. However, there are still several animals you can see outside walking around (fox, birds of prey, black bear) which was really nice. It seemed like a really great area to walk around overall and they have a farm animal section as well.",
   "Visited this park on May 2018. Beautiful, green, clean park. You can see farm animals, birds, wild cat, etc. It has a beautiful Japanese garden. My kids enjoyed the time there. They can play, run, roll down and enjoying ice cream over there!"
  ]
 },
 {
  "name": "G-Force Karts",
  "address": "800 E Laburnum Ave Gate 2, Richmond, VA 23222, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7212c866-9333-11ea-b301-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=15339173763981019030",
  "source": "GoogleMaps",
  "reviews": [
   "First time here and had a blast.  I brought my son with me and we took fastest of the day after he beat me a few times I ended up with a fast kart on our last race and  took the fastest of the day back.  We enjoyed the hospitality of the employees also which they answered any of our questions.  Excited for our next visit soon.  Thank you for the fun",
   "Fun place to go Karting, they have all the safety gear including neck braces and clean head wraps. We had a blast! Staff is Knowledgeable and helped everyone feel safe. We will come back to race again soon!",
   "The sales people here are very cool but they probably repeat the same things to everyone so they spoke rather fast about the rules.  The food bar was awesome and there is a large arcade room on the other side.  Due to rushing to get on the track I wasn’t able to take many pictures of the track but this place is very fun I heard this location will be closing soon and they are moving to the Richmond Raceway.  I hope they open up an outdoor track soon.  I think it would also be cool if they added a mini golf action too.",
   "Awesome experience. Been a while since I went go karting. Definitely doing it again. They made the prep very simple and easy. Staff is friendly and caring.",
   "Had a blast with my family. Laser Tag and Karts. Loved it. Great staff. We were short a player and they stepped in to fill in. Awesome!"
  ]
 },
 {
  "name": "Riverfront Canal Cruises",
  "address": "139 Virginia St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/72537b0a-9333-11ea-9254-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "kids",
   "tour",
   "sightseeing",
   "tour",
   "walking",
   "tour",
   "history",
   "history",
   "tour",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9322945672244578261",
  "source": "GoogleMaps",
  "reviews": [
   "The boat operator did a terrific job explaining the history of the canal and its construction. Also, I learned a lot about the history of Richmond, Virginia during the boat operator's talk.  I highly recommend this to anyone who loves learning about history, and especially for kids who are learning about American history in school. \n\nCanal tour is 40 minutes and it is in located downtown on the Canal Walk. Perfect location to include it in a day of sightseeing of Richmond's numerous attractions.",
   "I did the walking tour of the area. I inquired and got great information from the ticket booth operator about the rates, route, and time of departure. The boat departs every hour on the hour, and rates seemed very reasonable. Due to time restraints I was not able to do the boat tour, but would definitely  schedule on my next trip.",
   "Nice little tour to check out if you're in the area. Our tour guide Cotton was a nice guy and made sure we had a great time while learning the history of Richmond. Very interesting tour worth checking it out. $10 bucks a person.",
   "Forty five inexpensive minutes of fun and Virginia history education on the route designed by the Father of the USA himself: George Washington! Our steersman, \" Cotton\", was skilled and engaging.  The boat only draws a foot of water,  and the canal for the most part is three feet deep,  but you will be shown the life preservers. Have fun!",
   "I am a Native Richmond Resident and I was in awe of the Beauty it had. As a child I watched as they perfected this but time got away from me and I never thought to frequent there. It took my breath away to hear about the history of my town but it made me prouder to be able to say I was born there. I'm taking my family back soon so they can witness the beauty of this tour."
  ]
 },
 {
  "name": "Black History Museum and Cultural Center of Virginia",
  "address": "122 W Leigh St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7298c2c8-9333-11ea-af12-14b31f159f22.png",
  "tags": [
   "history",
   "walk",
   "history",
   "history",
   "field",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=6846445492592487299",
  "source": "GoogleMaps",
  "reviews": [
   "Interesting exhibits. Whole top floor dedicated to Sally Hemmings/Thomas Jefferson story. My guess is that the top floor will always be used for the featured exhibit, which happened to o be about them. Would love to see more Richmond history. Interactive screens were a nice use of technology.",
   "Really enjoyed touring the BHM.  The facility is modern, spacious and well laid out.  Having a volunteer guide walk us thru the museum, helping us to know what's available in each of the galleries was extremely helpful. Our guide was very good at prodding us w contextual questions. Like the paradox of TJefferson who wrote \"that all men were created equal\" yet built and sustained his farm at Monticello by maintaining 607 slaves. By comparison, the Virginia Museum of History and Culture currently has an exhibition: \"Determined: 400 Years of African American Struggle for Equality\". This is excellent! I only wished BHM would have half of the content and vision of that temporary exhibit. VA's history is steeped in the injustice and struggle for African-Americans' equality.  I predict BHM would grow in prominence by better telling the black experience for emerging, waking generations if told from a VA perspective.",
   "You must go the history is displayed abundantly! I'm a senior citizen and there were things I saw up close and personal that made me cry inside. The history is real. I shall  visit again with my grandson.",
   "Our trip here was AWESOME.  The guides took the time to deliver all of their information on a 2nd  grade level.  Our students and the adults thoroughly enjoyed this field trip.",
   "This museum is small but mighty. There are so many amazing stories from black history that we did not learn in school, and many took place right here in Virginia. The permanent exhibit here is wonderful. Lots to learn from the large touchscreen in the hallway.  I've also seen some wonderful rotating exhibits come through on the second floor. If you've never been here, you'll want to check it out."
  ]
 },
 {
  "name": "Pony Pasture Parking Area",
  "address": "7310 Riverside Dr, Richmond, VA 23225, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/72db23fa-9333-11ea-902f-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8690808517461629407",
  "source": "GoogleMaps",
  "reviews": [
   "Gorgeous! The area was very crowded today because the weather was beautiful! Go on a day that is not as crowded and you'll find multiple areas to go for a swim, kayak/canoe or just play in the water.\n\nWe left shortly after the cop yelled, \"EVERYONE WHO IS PARKED IN THE STREET WILL BE TOWED!!\" 😃",
   "Went on a Tuesday so it wasn't crowded. If you go on the weekends, get there early so you don't have to fight for parking. Very fun place to relax and swim. I would recommend swimming shoes for grip on the rocks",
   "Super river views. Great wading opportunities when the river is low. Wooded trails along the river. Good picnic spots. Restrooms near parking area. River provides opportunities for fishing, kayaking and canoeing.",
   "I love coming here to swim in the summer. Nice place to hang out on the rocks, take the kids and the pups. Parking can get full later in the day after noon.",
   "Nice place to cool off.  Water is a nice temperature to cool off in.  I would have given a 5 but there a lot of rude people.  We were literally on the smallest rock and a group of 15 people came and took it over.  Set up their bbq 3 feet from us which killed the whole point of trying to cool off.  It's a fun place for kids to enjoy the river and explore.  Bring food and something to sit on and enjoy."
  ]
 },
 {
  "name": "Canal Walk",
  "address": "1512 Canal Walk, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7330961e-9333-11ea-852c-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "walking",
   "walk",
   "walking",
   "walk",
   "free",
   "art",
   "walking",
   "tour",
   "walking",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9706169974446824927",
  "source": "GoogleMaps",
  "reviews": [
   "Located along the James River in downtown Richmond Virginia. The Canal Walk is surrounded by beautiful views of the James River and the city. Two islands are accessible from the Canal Walk. Brown's Island and Belle Isle. Brown's Island is grass and sidewalk covered and great for public outdoor events and concerts. Belle Isle is tree covered, surrounded by large boulders, with the James River flowing around and over the rocky terrain that encircles it. A wide walking and biking trail follows the river around the island in a circle. Belle Isle is accessible by a footbridge that is a short walk from Brown's Island. A sure bet for an enjoyable outdoor adventure for friends, family, or anyone. A+",
   "Really great place to get walking in.. walk it to the pipeline bridge and visit Brown Island pedestrian bridge near by. If you're up for it go to the Belle Isle pedestrian bridge too. All are right there together and great walks",
   "We discovered the Canal Walk going to and from the folk festival. It was a delight and pleasurable walk.  Lots to look at and take in from the natural setting to free form art work and graffiti. Great for walking or bike riding.  I will say, having walked it at night, that most of the lights were out, which doesn't compliment the rest of the walk.",
   "My first time walking this tour. Between the mix of architecture, especially in the banking district and the natural beauty of the river and forestry at play, makes for an awe inspiring scenic tour.",
   "I lived here for years! Why have I never taken this walk?! I moved out of state a decade+ ago only to visit over the 2018 winter holidays and find this gem. It's a wonderful activity to do with family and friends. The sights are beautiful. Along the canal there are historical landmarks, rock climbing, biking/walking trails, photography ops, and fresh air. It's a clean walk and was very fun with my family. We had a two year old with us too and it was a great sensory experience for him."
  ]
 },
 {
  "name": "Confederate Pyramid",
  "address": "Richmond, VA 23220, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7381c39c-9333-11ea-9832-14b31f159f22.png",
  "tags": [
   "history",
   "organized",
   "structure"
  ],
  "link": "https://maps.google.com/?cid=743385824193877392",
  "source": "GoogleMaps",
  "reviews": [
   "Cool pyramid!  Great tribute to women",
   "Beautiful monument, must see.",
   "History of our country",
   "A large haunting tomb containing the remains of Confederate Soldiers who died in the Civil War. The craftsmanship isn’t something to behold and appears more as a tall pile of stones than a organized structure.",
   "Spectacular historical monument in the middle of an important historical cemetery you should go"
  ]
 },
 {
  "name": "Richmond National Battlefield Park - Chimborazo Medical Museum",
  "address": "3215 E Broad St, Richmond, VA 23223, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/73f5aa86-9333-11ea-b1ae-14b31f159f22.png",
  "tags": [
   "learn",
   "kids",
   "history",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1930314897108867120",
  "source": "GoogleMaps",
  "reviews": [
   "Nice, small park.  There is a 15 minute movie about Chimborazo, a room with artifacts from the Connie was and a diarama with the hospital's layout.  The staff are extremely friendly.",
   "The museum is small but interesting. Learned much about medical care of the civil war . \nThe view from the hill is amazing and you can see for miles. The homes in the neighborhood are well maintained and we enjoyed the drive there.",
   "Get to learn as much about history as possible. Kids need to learn it. Great old neighborhood",
   "It’s a nice park with great views. The medical museum is really interesting. It’s packed with stuff and well laid out with lots of information. The people that work there are very nice and know a lot. It gives you an appreciation for what they went through in the Civil War and definitely makes you grateful for modern medicine.",
   "I recently discovered that my great great great uncle died here from disease. I read about the hospital and thought I would go visit it one day. Had to go to Richmond and just happened to pass this and HAD to stop. I plan to come back with my sister and actually see and learn the full history. I look forward to adding to this review. (Government shutdown was in full force so I couldn't go in)"
  ]
 },
 {
  "name": "VCU Institute for Contemporary Art",
  "address": "601 W Broad St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/743f84ba-9333-11ea-a3d0-14b31f159f22.png",
  "tags": [
   "art",
   "free",
   "art",
   "family",
   "free",
   "art"
  ],
  "link": "https://maps.google.com/?cid=5059244468169340165",
  "source": "GoogleMaps",
  "reviews": [
   "I was incredibly excited to visit the Institute for Contemporary Art.  I heard so much about it before visiting Richard for the first time, and the incredible installations they feature.  It was to my great surprise my trip fell on a weekend of an opening.  My night was topped off by meeting intriguing Artist, Lecturers and Public Figures.  The installations and films were brilliant! The staff was as contemporary and artful as the institute itself.  There are cocktails and snacks at the bar to make  sure your night is complete.  I’ll be back VCU! XOXO Lorenzo",
   "Great building architecturally. Exhibitions were on point as well. Gift shop had an amazing collection of publications that are hard to come by outside of nyc. (Shot-out to Precog mag)",
   "Beautiful new building with lovely, interesting architecture on the outside and provocative modern art on the inside. You will find three large art galleries, and large auditorium, an outside terrace, lockers and coat storage, plenty of seating inside and out, and Elwood Thompson's Cafe (they serve beer!). Plenty to see, hear, and touch. All for free! It really is a beautiful installation, and we look forward to seeing the collections as they are installed. Definitely worth checking out, and a wonderful addition to the already great museum scene in Richmond.",
   "Beautiful architecture. I like seeing new museums in Richmond that showcase modern pieces of art from around the world. Considering it’s absolutely free, it’s worth a trip. My family and I scratched our heads a lot throughout the Hedges, Ledges, Edges exhibit... was this artwork too conceptual for us? It felt sparse but I get that that’s probably what they were after.",
   "Awesome addition to The neighborhood.  Architecture is cool and vibrant.  The layout of the museum is nice, but I don't think they use it to their advantage.  I was not impressed with the exhibits on display.  We thought the lobby was more interesting!"
  ]
 },
 {
  "name": "William Byrd Park",
  "address": "600 S Arthur Ashe Blvd, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/74816fe4-9333-11ea-9797-14b31f159f22.png",
  "tags": [
   "family",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12837632018604371955",
  "source": "GoogleMaps",
  "reviews": [
   "Went jogging here on a crisp morning.  Lovely trail.",
   "Its a little park nice for families or a stroll",
   "It's a beautiful park with several beautiful, scenic areas that are great for walking or maybe a picnic.  The VITA trail is one mile and has different fitness stations along the way. It is a scenic trail with even terrain. I enjoy taking my son out on the trail in his stroller. Also what's nice about the park is it is surrounded by some beautiful lakes. Fountain Lake is very pretty. It is a half mile around and has benches all along the perimeter in case you just want to sit and take in the scenery. Also, Fountain Lake is the only spot in the area that I have found that has a building with restrooms. Swan Lake is stunning, but the sidewalk does tend to be dirty on account of the birds. Definitely worth visiting though. Swan Lake is serene. Byrd Park also has other neat areas to visit, such as the Virginia War Memorial and the Dogwood Dell Amphitheater (which I believe hosts concerts during the summer).  Overall, I am a huge fan of Byrd Park. It is family friendly, great for walks, playing, or just sitting and taking in the beautiful scenery!",
   "I recently discovered the vita course here and it's a 3.8 mile return trip from my front door. Great power walk and fitness trail for anyone to go at their own pace. A wonderful find.",
   "A nice park where I occasionally do my weekend run. Lots of ducks and geese around. Some sketchy types pop up once in a while, but the area seems safe enough."
  ]
 },
 {
  "name": "Wilton House Museum",
  "address": "215 S Wilton Rd, Richmond, VA 23226, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/74cc0ed2-9333-11ea-b8e2-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "sightseeing",
   "tour",
   "history",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=17878516887330129984",
  "source": "GoogleMaps",
  "reviews": [
   "It was late in the day (awhile back) and my daughter and I were sightseeing so the sign for this place caught our attention. The tour guide was very willing to show us about and incredibly knowledgeable. The house is very interesting even though it is not in it's original location or set up in it's original grandeur. The grounds needs lots of work, but if you like architecture and history, then it is worth a visit.",
   "Absolutely beautiful. We had our wedding here and the grounds were perfect. The Museum is very interesting and the staff is very knowledgeable.",
   "Beautiful House not too many people",
   "Very nice historical place to visit with plenty of photo opportunities. ",
   "The docent was really nice and welcoming. I went with a group and she was very flexible and patient, and willing to answer questions. Parking is a little difficult."
  ]
 },
 {
  "name": "Richmond National Battlefield Park",
  "address": "470 Tredegar St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/750e6dee-9333-11ea-bf7e-14b31f159f22.png",
  "tags": [
   "free",
   "history",
   "history",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=6088144805176640783",
  "source": "GoogleMaps",
  "reviews": [
   "Well maintained visitor center and exhibits. Surrounding area is also great to take a stroll. Easy access to Belle Isle. Free parking for an hour in the parking lot if validated. Otherwise you can park in the Belle Isle lot which is usually filled up. I'll suggest about two hours to experience this place fully.",
   "This museum was very informative, quit interesting and sad. I definitely recommend it if you had problems understanding history in school or just didn't have a teacher that brought it to life for you. Lots of trinkets, letters and clothing samples. Go.",
   "American History is usually my forte. Learning about it in history books and even in historical television reenactments / movies doesn't do too much to explain how it all went down. It was nice to find this museum on a road trip to Richmond, VA. After a search on Google Maps and TripAdvisor, I decided to spend the afternoon along the James River and visit the Richmond National Battlefield Park on a nice Tuesday afternoon.",
   "Awesome History Lessons & Time With My Family.",
   "Beautiful place."
  ]
 },
 {
  "name": "Ancarrow's Landing",
  "address": "1200 Brander St, Richmond, VA 23224, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/755d0362-9333-11ea-a659-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "historic",
   "walking",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=5256169693123061680",
  "source": "GoogleMaps",
  "reviews": [
   "Nice place needs a little bit of daily cleaning and path clearing but it is the middle of the hit summer so I kinda understand. Think it would be even nicer during cooler weather to visit. Watch out for the poison ivy",
   "The water level is said to be around 12.6 , Tuesday morning. I took these pictures around 4:15pm Tuesday. The damage to property and amount of debris is crazy. The fast pace of the river was just mind blowing, and dangerous... Please use caution when stopping and taking pictures.",
   "Great place to take my kid on a nature walk. It IS long, though.",
   "Nice little park off the beaten path right up against the James River. Great walking trails including the end of the historic Richmond slave trial. Plenty of parking and never too busy.",
   "Nice hike on a cold day, but on a warmer day the smell might be off putting from the nearby sewage treatment plant (hence the nickname the poop loop).  Trails are definitely designed more for bikers than hikers, but they do have them designated so you’re not competing for trail space with the bikers & all of the trails get equal wear & tear."
  ]
 },
 {
  "name": "Maymont Japanese Garden",
  "address": "N Bank Trail, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/75a99cf4-9333-11ea-80f9-14b31f159f22.png",
  "tags": [
   "tour",
   "kids",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=4533016140113813111",
  "source": "GoogleMaps",
  "reviews": [
   "It's a fantastic place to visit, a must see in Richmond! You can spend hours in the gardens, there's an animal park that kids would love. If you have the time take a tour of the house too, its pretty neat. I visited in February, and will definitely be going back in the spring when it is in full bloom!",
   "I was married here Halloween 2019. The staff that worked with us were amazing. They made the wedding process so much easier and I will be forever grateful for their kindness and helpfulness. This is a beautiful area to visit and I recommend it to everyone.",
   "I love this place.  The Japanese garden is beautiful. In November, Maymont Park organizes an event every year with lights at night.  It's worth the detour !  The lights highlight this beautiful garden.  I recommend this place.  Take out your cameras or smartphone, you will not regret.",
   "What a gem! It is beautiful even in winter. Get a map of the grounds to guide your walk. There are many paved paths, shade trees, gazebos,  interesting botanicals. On a sunny, mild (50F) we walked about four miles there, and loved it.",
   "It's beautiful and serene. Good for people of all ages. You can walk, rest, click pictures, play, celebrate here."
  ]
 },
 {
  "name": "Putt-Putt Fun Center",
  "address": "7901 Midlothian Turnpike, Richmond, VA 23235, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/76048e9c-9333-11ea-8704-14b31f159f22.png",
  "tags": [
   "drink",
   "kids",
   "affordable",
   "kids",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=6962794617368361639",
  "source": "GoogleMaps",
  "reviews": [
   "We went the weekend before school started. The kids have seen this place from the car and always wanted to go so we finally did and we weren't disappointed. We all got on the go carts and bumper boats, played putt-putt, had pizza for dinner, we ended the trip playing arcade games inside. It was a lot of fun and we will definitely be going back. They have good deals for families, outdoor activities with pizza and drink and indoor for games, making it a little more affordable. We had as much fun as the kids did.",
   "I have been here several times from childhood to adulthood.  It is one of the few entertainment places for kids that has outstood the test of time.  I take my children here periodically.  This particular time, we only did golf; however they have a decent arcade inside.  Outside is the golf, water boats and go-karts, all of which we have enjoyed at one time or another. You have 3 courses to choose from for golf.  We chose the first course with 18 holes of varying difficulty but just plain fun family activity.  I did notice there was a little trash and no water in the exhibit which could've taken it to the next level if corrected.  I also think there should be a better barrier around the bottom of the gate that encloses the golf area; I saw numerous people losing balls, by putting them into the parking lot accidentally.  I did like that there benches throughout so you could sit while the next person is putting and there were stations to write on your scorecards. We purchased a 12 attraction ticket for $60 so we will be back when it gets warmer for the water boats and go-karts.",
   "Been coming here since I was a kid, now bringing my daughter here to spend some weekend fun time.",
   "I used to come here when I was a kid. I loved it then and it still has it. The games and go-karts still satisfy the kiddos. Also nice the tickets go back to your game card so no keeping up with all that.",
   "A great date night spot, and a good family day out spot as well."
  ]
 },
 {
  "name": "Black Heath Meadery",
  "address": "1313 Altamont Ave, Richmond, VA 23230, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/76489c90-9333-11ea-8849-14b31f159f22.png",
  "tags": [
   "unique",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=14143299308916807906",
  "source": "GoogleMaps",
  "reviews": [
   "If you like mead, go here. Go here right meow. Also, if you like The Dude, they have The Big Lebowski glasses for merch.",
   "The absolute friendliest staff! What a wonderful remodel, and the mead is also great. Prices are a bit high, but it's all hand made, and locally sourced.",
   "Dog friendly. Cozy  great atmosphere. Very friendly people. Bill thank you for the great hospitality!!! Out of towners will feel welcomed here.",
   "This place is wonderful. Definitely get a flight to try out all the unique flavors they have to offer, and go back often because they are always changing!",
   "👍👍👍👍👍 A 5 thumbs-up rating! The owner is nice and knowledgeable. And might I say very accommodating. I tasted their Mead at a favorite beer hall called \"the answer\" and the next morning wanted to acquire a bottle or two. They were not open but the owner met me there and welcome me in. Customer service from the door through the bottle!"
  ]
 },
 {
  "name": "The Branch Museum of Architecture and Design",
  "address": "2501 Monument Ave, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7695d282-9333-11ea-9514-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=16203000609442307683",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful architecture.  Would've been neat to see it furnished in a way somewhat similar to the way it might've been originally.  Tour guide didn't seem to be extremely knowledgeable.  Wish more rooms were open.  Would be a great place to host special events.",
   "The architecture and design within the building was interesting. However I was expecting a bit more. There could have been more explaining the architecture throughout the building. Some more interior designing would've allowed experiencing the architecture in innovative ways. The gallery was being used to display the entrants of a children's design completion. Actually that was great. I love seeing community involvement.\n I would say don't write it off. The Branch is shooting signs that there is reconstruction and remodeling occurring. It should warrant a visit when spending time visiting there local museums.",
   "We could only see the first floor.  It is an amazing, huge tudor inspired home with an  architectural pedigree. It's cool.  We wanted to see more of it.",
   "Beautiful house. Disappointed only can view the first floor. Other than setting first floor, no decorations or period furniture.",
   "It was a nice old house but you only get to see the fist floor and it’s absolutely empty.  Would be a nice place for a catered event though."
  ]
 },
 {
  "name": "The Richmond Railroad Museum",
  "address": "102 Hull St, Richmond, VA 23224, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/76dc9f80-9333-11ea-a106-14b31f159f22.png",
  "tags": [
   "free",
   "tour",
   "knowledgeable",
   "history",
   "knowledgeable",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=18162312665329392746",
  "source": "GoogleMaps",
  "reviews": [
   "We came for a train day event so it was really fun for the little ones riding and jumping the bouncy train, there are also free face paint and balloon twists.\nEven the adults loved watching the miniature trains and railroads in the museum.",
   "You get a guided tour by one of the  volunteers and get to climb on some train cars. Definitely place to visit",
   "Great exhibits and knowledgeable staff. Great representation of Richmond rail history.",
   "What a great place to find out some very interesting information about the railroads around Richmond. Staff is excellent and very knowledgeable about all thier exhibitions. The building itself has so much history in it and has been around for a long time. Who would ever know this small building would offer so much. Highly recommend to check this place out. \nPlus they are a part of a great organization that does train excursions in Dillwyn Virginia. Old Dominion Chapter of the National Railway Historical Society is a fantastic organization with a lot to offer. If you love trains check them out too.",
   "Had a great time. Tremendous amount of History. Would recommend it. There's parking on the left side of the building."
  ]
 },
 {
  "name": "St Paul's Episcopal Church",
  "address": "815 E Grace St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/771f76b6-9333-11ea-8cb2-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9613757133260267398",
  "source": "GoogleMaps",
  "reviews": [
   "The Lenten weekly service is wonderful.  The luncheon is very nice and the volunteers are so special.  I highly recommend the cheese souffle!",
   "Wonderfully rich community. Open and welcoming. Generous and caring.",
   "Lenten Lunch today of cheese souffle and vegetable sides was most tasty, and of an appropriately modest size!  Kudos to the volunteer staff who prepared and served it!!",
   "A truly lovely, and loving, church. Very engaging and welcoming. Visited to attend the funeral of S. Buford Scott and came away thinking how fortunate and blessed are it's congregants. Saint Paul's Episcopal is a true treasure... for its history and its architectural beauty, yes, but also for the good it does, the good it encourages, and the good it advances in the community that is RVA.",
   "This is a wonderful church with some great history."
  ]
 },
 {
  "name": "Chimborazo Park",
  "address": "3215 E Broad St, Richmond, VA 23223, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/77622538-9333-11ea-ad14-14b31f159f22.png",
  "tags": [
   "free",
   "parks",
   "family",
   "kids",
   "pets",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12111405533705259491",
  "source": "GoogleMaps",
  "reviews": [
   "Great little info center. Learned a lot about Confederate medical care. The views from the park of the James river valley were very expansive. Free admission. Great National Parks Service educational film.",
   "I just love the view around the park and the area all together. There is another park very close by that I would visit, the view is also breathtaking. I would recommend this place if you want to go somewhere romantic, or show family and friends from out of town how beautiful Richmond is.",
   "Large park with lots of gazebos and semi-hidden paths that take you up, down, and around. For older kids, this is a pretty cool park to explore because there are trails going down to other green spaces. For younger kids, there are no playgrounds (there are two nearby, but not in the park) and not much to do. Great for strolling around or walking the pets. Plenty of nice views from on high. After a good rain, bring your mud boots!",
   "The park is lovely. Great overlook of the city. Nice place to walk or people watch",
   "It's a well laid out, scenic simple park. They have a couple battle monuments and a couple of plaques commentating the civil war hospital there. Nice park, decent parking...  Great place to relax and take in the area."
  ]
 },
 {
  "name": "Bryan Park",
  "address": "4308 Hermitage Rd, Richmond, VA 23227, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/77ba3086-9333-11ea-b956-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "walk",
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=11267719212325014202",
  "source": "GoogleMaps",
  "reviews": [
   "The park was quite lovely today. Azeleas starting to do their thing and lots of trees in bloom. This park should be great place to walk and or bike, but too many people choose to ignore the leash law for their dogs. We were accosted by 2 large dogs today. They were friendly, thank goodness, but none the less they frightened my little Grandson. So if you are walking/biking you have to be on constant lookout for unleashed dogs. It's very disturbing.",
   "Bryan park is one of Lakeside's finest features. It's huge, has one of the best disc golf courses in Virginia, and it's full of hidden treasures I dare not speak here. But spend some time walking around, you'll find little trail heads that lead you to interesting places. \n\nIt is, however, sadly underfunded by the powers that be. There is a great group of volunteers and staff that work dutifully to keep it nice for the rest of us, but $$$ is needed to really bring the potential of Bryan Park out. I wish there were more to this place, but it's still a beauty unto itself.",
   "I grew up going to this park. I lived right down the road from it for years and years. It's lost some of it's former glory, but it's still a really great place to walk the dogs or have a picnic. They've even got a kids play area now (which didn't exist when I was young. I'm jealous.).",
   "Clear, paved running paths, a disc golf course and lots of green open spaces. Great place to walk the dog get a bit of exercise in. Just not on Saturday mornings. At least not if you desire any quiet whatsoever. Local soccer teams use the area for practice. Not complaining, just be aware there's a lot of soccer mom traffic that time of day and week.",
   "Beautifully designed park offering so much for all of us who use it.  Great water to sit by, frisbee golf course, trails and my favorite Muscovy Duck !"
  ]
 },
 {
  "name": "Huguenot Flatwater - James River Park System",
  "address": "8600 Southampton Rd, Richmond, VA 23235, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/780bac3a-9333-11ea-9985-14b31f159f22.png",
  "tags": [
   "nature",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13530647582163216593",
  "source": "GoogleMaps",
  "reviews": [
   "Gotta say. I live close to this one and if it weren't for the water I would barely call it a park. I really want something great to happen here but it would have to begin with a parking lot expansion. The areas under the bridge could be used for a volleyball court, playground, you name it. It could be amazing. Right now there is barely enough room to pass on the trail. Please add features!",
   "Great paddle in Richmond. No power boats. Flatwater with little current at low water levels. Power upriver to Bosher Dam. Cruise back and enjoy the nature around. Plenty Osprey fishing today.",
   "Pretty easy to find but not enough parking spaces. Had a ton of fun with water sports. Pretty clean and has porta potty there accessible.",
   "I would say this was calm and relaxing, but we were at the rapids lol it was however very calm and relaxing. My children were happy and laughing. What more could you want when it's hot out. The day was beautiful. Please hold on to and watch your kids. \n\nThe only reason I didnt give 5 stars is bc there isnt enough parking for the amount of people who go here. There is no place to bbq, and they should clear out some of the shrubbery for more open spaces. Overall, definitely going back. Peaceful.",
   "A wonderful place to take the pups for aquatic activities, also if you're keen on fishing, or looking for a relaxing place to take a breath of air in the woods by the river"
  ]
 },
 {
  "name": "Great Shiplock Park",
  "address": "2803 Dock St, Richmond, VA 23223, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/786bf54a-9333-11ea-9571-14b31f159f22.png",
  "tags": [
   "food",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=11527419003180666532",
  "source": "GoogleMaps",
  "reviews": [
   "Such a hidden treasure! A great place to come for some light hiking, fishing and relaxation. I definitely recommend this place for a beautiful picnic with a loved one., and make sure you enjoy the food trucks next door! Great little area!",
   "This is a great place to stretch your legs and explore one of the many trails. There is a good variety of open areas and shade to suit the weather. The trails here are relatively flat without being boring. Come explore!",
   "I start my walks here every time I need to walk my demons off. It starts to calm me. I often go there when I am near critical with my demons.   It always brings me a measure of peace. Then I start my walk. \n\nI love this park.",
   "I enjoyed the paths that lead to a great spot by the water. Very quiet.",
   "Great/easy river access. Now that I have a stroller and a million things to carry I look for the easier entry. I appreciate the beautiful view of the sunset that you get here and there's plenty of fishermen enjoying the site as well!"
  ]
 },
 {
  "name": "Pipeline Overlook",
  "address": "Richmond, VA 23219, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/78c7d146-9333-11ea-94cf-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=612561127426435572",
  "source": "GoogleMaps",
  "reviews": [
   "Great experience. Narrow walkway so please be courteous to other people when they want to pass. This area is a popular attraction in summer, people get down off the walk and in the sandy beach beside the James River. Off path is some trash and homeless camps.. I've never had a problem with them when I visit. Would love to see some beach cleanup effort. Be cautious of snakes.. they are there. Take a picture and leave them be.",
   "Great place to take a little hike. It used to be a lot cooler when more abandoned places were on the river bank and the hipsters didn’t know about this place but it’s still nice to check out if you can find a time when the people without jobs aren’t hanging out and doing whatever it is they do while not working 😂. Check it out and enjoy the photo ops and lovely sound of the river !",
   "Cool. A little scary. Kinda dangerous. Careful with your car keys.",
   "Pretty cool to see especially when the water is really moving through there",
   "Very cool experience to be walking across the water!"
  ]
 },
 {
  "name": "Floodwall Park",
  "address": "Richmond, VA 23224, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/790db3ee-9333-11ea-b60b-14b31f159f22.png",
  "tags": [
   "history",
   "walk",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=878817474459620237",
  "source": "GoogleMaps",
  "reviews": [
   "It was a bit difficult to find but ended up being a great experience. The memorial bridge was my favorite...always good to reflect on history.",
   "This place is amazing at night. My son is getting crazy if we visit here at night. this is well maintained trails. it is one of my absolute favorite views in Richmond and it's easy to visit and not crowded at all. Good place to go for the walk.",
   "Great walk with the view of the city and James river. It may need some clean up with the abandoned factory and parking lot but it was a cool little adventure and it seems to be a great start of a running trail",
   "I don't know what I did but won't pop up with you across the bridge or whatever the case may go to Rohnert Park have a good day enjoy yourself let me see what's going on you know it's just a city with the flood wall I don't understand that I'm going to get back to water money rains so that's a good thing you always nice to have a friend walk in the doors are made of concrete",
   "Dramatically scenic spot ... if you're in the neighborhood, drop by."
  ]
 },
 {
  "name": "Lewis Ginter Botanical Garden",
  "address": "1800 Lakeside Ave, Richmond, VA 23228, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7956a406-9333-11ea-9ef5-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "library",
   "organized",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5246604299070095794",
  "source": "GoogleMaps",
  "reviews": [
   "Gorgeous any month of the year and most importantly, year round interest. I went in January and still found new things in bloom and winter interest. Also more kid-friendly and interactive than I would think. Hit the kids area in the back, build a gnome home, and watch your kids playing like we did as kids in the woods while you enjoy the tranquility of the flowers and the calm (obviously I have young children).",
   "Vising the festival of lights is a fun family activity. It's easy to get around and the atmosphere is very festive. Some years are better than others, but I still recommend going. Going a bit later in the evening will help you avoid the crowds. Buy your tickets online to make entry quick and easy. Small children may enjoy seeing the lights (for a little while) but there really isn't a whole lot for them to do.",
   "Visited in December during a mild evening. Beautiful light display for the holiday. The library at this garden is incredible. I was really impressed with their seed sharing program - very organized. The gift shop is massive. If I lived locally, I would visit monthly!",
   "Lewis Ginter is not only a beautiful location to visit for both locals and from out of town, but also a spectacular wedding venue. The staff are wonderfully helpful to both vendors and guests alike. I had the honor of photographing a client's wedding in the gardens during the spring and was blown away by how sweet and accommodating the workers and event staff were and my bride and groom had nothing but fantastic things to say about their experience as well. 10/10 will absolutely recommend the venue to future clients.",
   "One of our family's favorite outings.  Absolutely breathtaking.  Every season had its own magic - never a missed opportunity to enjoy nature's bounties.  Awe inspiring and effortless exercise - don't even notice the mileage you put in out there, lol.  The kids don't even complain..."
  ]
 },
 {
  "name": "James River Park Pipeline Walkway",
  "address": "310 S 14th St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/79b3b882-9333-11ea-8f45-14b31f159f22.png",
  "tags": [
   "walking",
   "family",
   "tour",
   "walking",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4474974941874133548",
  "source": "GoogleMaps",
  "reviews": [
   "This is the best kept secret in Richmond! Love walking on the historical pipe and being right next to the river and hearing the rushing water, so freeing! And if you are really lucky a train will go over your head! ❤",
   "Awesome place that's tucked away from the public. There are some rapids over here that are calming to watch and fun to ride, as well as a calmer area further down that's great for the whole family. It's a tight squeeze to get to any of the beaches, especially if you're there when other people are coming or going, but once you're there the place is just magical.",
   "I lovely and picturesque beach and rocks. Don’t let the pipeline in the name fool you. If the blue herons don’t mind it, you shouldn’t either. No wheelchair access.",
   "High adventure, walking tour around Riverfront Canal area led me to this area by accident.  I arrived with several people, I described what I was looking for. They confirmed the location. You won't find this long name spelled out. I walked the rails, didn't quite trust my balance over the Pipeline that crosses over to Brown's Island. I will return after some balance training, maybe.",
   "Very cool little land mark. Walking ontop of the pipe can be slightly scary when the railings are gone but it's fun! Definitely worth a visit when you visit Richmond."
  ]
 },
 {
  "name": "Three Lakes Park & Nature Center",
  "address": "400 Sausiluta Dr, Richmond, VA 23227, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7a133dd0-9333-11ea-a785-14b31f159f22.png",
  "tags": [
   "nature",
   "family",
   "nature",
   "kids",
   "nature",
   "walking",
   "walk",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=16801555190848446082",
  "source": "GoogleMaps",
  "reviews": [
   "The nature center is awesome. It was so much better than I was expecting. There are a lot of different species of fish and turtles. The park is nice. We’ve had some team lunches here under the covered pavilions. The playgrounds are pretty much always crowded. There is a decent amount of parking.",
   "Beautiful lake and conservatory for the family to enjoy. Lovely play equipment and picnic tables to have a meal with your loved ones. Had a great, relaxing day at this peaceful park.",
   "Great park and accessible playground. Unfortunately the nature center is only ever open starting at noon, which is right during naptime for us. Would love to see it sometime.",
   "Love this park. It has two playgrounds long walking trails. A public restroom. picnic shelters, plenty of parking, and lakes one huge one that you can fish off of a designated pier and the other one is full of wildlife and underwater life with a museum that has more detailed looks at nature and has hours from 12- like 4 ir 5. A great place to take kids.",
   "My toddler and I love coming to visit Three Lakes Park, whether it be in the morning, afternoon, or evening. In the morning, we play on the 2 different large playgrounds and chase the geese. In the later part of the day, we will walk around the lakes, under the shady and cool trees. We enjoy visiting the nature center because we get to see a variety of fish, turtles, snakes and other animals."
  ]
 },
 {
  "name": "Texas Beach",
  "address": "Richmond, VA 23220, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7a596eda-9333-11ea-bf4b-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=17601130225111901470",
  "source": "GoogleMaps",
  "reviews": [
   "Texas Beach is one of the nicest areas of the James River front.  Nice trail to get there with steps, bridges, various bike and people paths.  Not too overly crowded and a great mix of families and young people.",
   "Great little trails to take your dog walking and to play in the river. There are trails close to the river and plenty of spots if you wanted to being floats/chairs to enjoy a day out on the river. There are signs that dogs need to stay on leashes, but we saw a few people who had their super well behaved dogs offleash. Everyone we passed was super friendly.",
   "Amazing place to go. May want to be 420 friendly if you are heading here also okay with drinking. It seems to be the place young people go to swim the river and tube. But i would strongly suggest to check it out a great hidden spot in Richmond.",
   "The place was beautiful! I ended up lost and took a while before finding my way back but I'll definitely go back next time I visit.",
   "There arent as many people that come go this part of the James river as they Bell Isle is much more well know. This makes for a wonderful opportunity to enjoy the water without the crowds. Definitely will be coming back"
  ]
 },
 {
  "name": "Richmond Slave Trail",
  "address": "Brander St, Richmond, VA 23224, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7ab4b030-9333-11ea-bb8c-14b31f159f22.png",
  "tags": [
   "hike",
   "history",
   "walk",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13480393666862734031",
  "source": "GoogleMaps",
  "reviews": [
   "The information was awesome but this trail is not being maintained & is super sketchy. We went a little way & when we started seeing discarded junk, we turned around. Wish it was a safe place because the information we did get was wonderful.",
   "Love exploring this trail in our backyard with my daughter!",
   "Incredibly important piece of history. Highly recommend this if you're in Richmond. The beginning and end were easy to follow, the middle was a bit difficult. The half on the river was a nice hike with insightful information.",
   "Look we preserve the past for a reason. There is no pride in the slave history of this country but the slave trail offers a very nice walk that also offers you knowledge of our past that might be hard to swallow but if it opens minds and hearts its a perfect day.",
   "I've been hitting the bike trail every Saturday for the last three Saturdays that... Fun fun fun. The trail is clean, no glass no trash and polite courtesy people."
  ]
 },
 {
  "name": "Richmond National Battlefield Park's Civil War Visitor Center",
  "address": "470 Tredegar St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7b020d12-9333-11ea-a5f9-14b31f159f22.png",
  "tags": [
   "historic",
   "free",
   "history",
   "learn",
   "history",
   "walk",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=12796133321579974295",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best national Civil War battlefields in the East. The NPS has a visitors center in the historic Tredegar building that was used to make ammunition for the confederate state during the Civil War. There is a museum that accompanies the visitors center that tells the history of Richmond and the surrounding area before, during, and after the Civil War. The museum has treasured photos of the destruction of Richmond and maps that give a time period marking all events from 1861-1865. The museum is free to all and parking is available right next door.",
   "We stopped by at the Richmond National Battlefield and there is a lot of history to learn. There are plenty of exhibits explaining different specific events and a few different 20 minute long videos that also do a great job explaining the history of this place.",
   "Belle isle was so much more than i expected.   I will come back over and over.   So much to see and do.   Kayaking, rock climbing,  swimming or biking around the isle.   Great surprise.",
   "Wonderful is all I can say. Amazing historical sites all around this area ",
   "Incredibly historical, being that Tredegar was of of the biggest manufacturers of weapons during the Civil War. The original artifacts, pictures and unique storytelling exhibits give you a good sense of what it was like to fight as a soldier on the front lines. For those who call Richmond \"home,\" the pictures from the 19th century are near to see as compared to what the city looks like today.\n\nWhen you're done with the museum, take a short walk to the river directly across the street for some hiking, swimming, paddleboarding and kayaking!"
  ]
 },
 {
  "name": "Virginia Museum of Fine Arts Sculpture Garden",
  "address": "Richmond, VA 23221, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7b61e088-9333-11ea-97c1-14b31f159f22.png",
  "tags": [
   "art",
   "walking",
   "family",
   "free",
   "art",
   "structure"
  ],
  "link": "https://maps.google.com/?cid=12774135279952708543",
  "source": "GoogleMaps",
  "reviews": [
   "Nice park with benches and tables under some large trees where you can sit down and relax. A very lovely place.",
   "Stellar collection of Art Deco + Nouveau, lovely neighborhood accessibility.",
   "The Sculpture Garden is peaceful and lovely. I enjoy visiting or at least walking through it several times a week on my daily walks.",
   "Small but good.  Kudos for Rumors of War.",
   "The sculpture garden at vmfa features contemporary artists like Jaume Plensa and other sculptures that really make the space interesting. There are water features and an installation of red Chihuly reeds. There is the Belvedere which is at the top of the garden she's a great place to sit along another fountain. The sculpture garden is conveniently located next to vmfa parking structure. There is also a Confederate Chapel on the opposite end of the property which is also open to the public for exploration and interpretation. There's another building on the grounds of the sculpture garden called the pauley center. If you enter the police enter you'll be able to see the vmfa fellowship recipients art hanging on the walls. Inside the museum there is a cafe and restrooms along with a world-class collection of art. Pop into the cafe for a cup of coffee and then come back outside to the sculpture garden to Center one of the umbrellas under the crepe myrtles. Admission to the museum is free and the sculpture garden is free and open all the time. Parties can be scheduled weddings are held and many family days are scheduled throughout the year to activate the sculpture garden."
  ]
 },
 {
  "name": "Manchester Climbing Wall Parking",
  "address": "599 W 11th St #553, Richmond, VA 23224, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7baea11c-9333-11ea-9700-14b31f159f22.png",
  "tags": [
   "walk",
   "brewery"
  ],
  "link": "https://maps.google.com/?cid=9037009036344451498",
  "source": "GoogleMaps",
  "reviews": [
   "This place will take you to the top. It's really raised my expectations. You can legally get high here. It's has scalable infrastructure.",
   "a beautiful place to go for a walk, ride a bike and climb the truth an incredible place",
   "Sweet climbing wall in downtown Richmond.  Nice brewery right behind the parking lot too.  Some bolts are a little sketchy, but overall seems in good shape.  Fun climbs for any skill level",
   "Beautiful views from multiple areas. Great for photos!",
   "Came here for the first time for the Folk Festival, figuring it would be easier to park and cross the bridge to Brown's isle. Well lit, smooth walkways, great views, overall very pleasant experience going through here. 3 hour limit on parking according to a posted sign, I couldn't tell you how well that's enforced but good to keep in mind."
  ]
 },
 {
  "name": "Pump House Park",
  "address": "1799 Pump House Dr, Richmond, VA 23221, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7c0091de-9333-11ea-ba22-14b31f159f22.png",
  "tags": [
   "tour",
   "walk",
   "tour",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=16899866930282924998",
  "source": "GoogleMaps",
  "reviews": [
   "Very cool place. Was very happy to have been able to take a tour. I have been wanting to for years and it was even neater than I expected. The park itself is also nice. There are trails and beautiful views of the river. I absolutely love going here.",
   "Spectacular place, very beautiful.",
   "We often grab a to go breakfast and go walk around (follow the path towards the river) and sit to enjoy fresh air. It's a peaceful spot. Bonus: keep up with Friends of Pump house for chances to tour the inside! Just did it last week, very cool!",
   "Wonderful place to visit and see where they used to have dances - Friends of the Pump House are working to restore it and do regular tours!",
   "Great for hiking,  walking,  biking.  I plan to go back asap!"
  ]
 },
 {
  "name": "Deep Run Park & Recreation Center",
  "address": "9900 Ridgefield Pkwy, Richmond, VA 23233, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7c56a178-9333-11ea-b4c7-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "nature",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=9108401402824472303",
  "source": "GoogleMaps",
  "reviews": [
   "Great facility for your large gathering! Huge ballroom area for events with 50+ people. Facility was clean, large windows to let the sun and air in. Paved back patio looking towards the woods in the park. Staff was very helpful and always with a smile. I would recommend this place for your reception and/or team building events as its tucked away within the park with ample parking spaces. They even had back doors to accommodate anything that needs to be rolled in!",
   "I just visited  that park last weekend  and it's  amazing, full of nature, there is a big lake, many people goes there and take the dogs for a walk, or chill, I bet in the summer  and fall that looks stunning, beautiful  views!! there is like 2 or 3 recreation area for kids all ages, basketball court, parking lot, and you don't  pay to be there, it's  amazing  for those who like running and enjoying to be surrounded by nature! :)",
   "Has a good mix of paved and I paved trails, easily accessible from a parking lot. Great for running and other recreation!",
   "I love this park and all the different areas of it! From the trails to the lake to the fields. Last time I was here was for the annual American Foundation for Suicide Prevention (AFSP) Out of the Darkness Walk.",
   "My grandchildren love to go to the\"castle park \" we we there  on last friday fo a couple hours.  Even in this  era of virus culture,  it was good to have them outside and having fun!"
  ]
 },
 {
  "name": "Robert E Lee Bridge",
  "address": "Richmond, VA 23224, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7ca16634-9333-11ea-9616-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "walk",
   "history",
   "nature",
   "walk",
   "hike",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=1983691311271382151",
  "source": "GoogleMaps",
  "reviews": [
   "This bridge is neat! You can walk from the nearby island over to the Canal district, we did a long loop around the bulk of the greenway and this bridge was a standout. It hangs from the underside of the intersection and pausing in the middle, I was struck by the amazing things humans are capable of. Neat to be so near the river and also to see the interstate from below and marvel at our enginuity as a species.",
   "It’s beautiful walking bridge. You can view Richmond Downtown nicely. If you like taking pictures this is the place.",
   "Such a beautiful area. I highly recommend visiting.",
   "With every step we got to take in the history, beauty and conquer some fears. It didn't cost me a thing to explore the river and walk around touring  the bridges and even stopping to have a picnic while watching the train drive by. All you have to do is park and get out. Let nature and exploration of history do the rest.",
   "Beautiful view and a nice trail . Great place to go for a hike . Historical Native Land ! There's a walking bridge suspended under the over path that hangs and  wables  and is about a 20 minute walk to the other side."
  ]
 },
 {
  "name": "The Grand Kugel",
  "address": "2500 W Broad St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7cf97180-9333-11ea-b9b1-14b31f159f22.png",
  "tags": [
   "tour",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=12923071675656944386",
  "source": "GoogleMaps",
  "reviews": [
   "What more can you say about a gigantic stone sphere? It's a gorgeous ornament to the Science Museum entrance space, giving the seating area a peaceful atmosphere. A sculpture certainly worth paying a visit if you already have plans to tour the museum.",
   "Absolutely beautiful at night! Can't wait to see it during the day.",
   "breathtaking! I visited The Grand Kugel a bit skeptical. However 30 minutes later having pushed my heart and soul into spinning the giant stone earth with my Uber driver I am definitely convinced of its impressiveness.",
   "Participated in seersuckers sundresses and sounds event.  It was a fun time.  Like huge party/cookout...huge.  plenty of live music dancing food shopping and libations.",
   "For people who do not know this, the globe can be spun in different directions. It takes at least 3 people in order to attempt to do it  correctly."
  ]
 },
 {
  "name": "Monroe Park",
  "address": "620 W Main St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7d3f0630-9333-11ea-8aee-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=3620203933951305334",
  "source": "GoogleMaps",
  "reviews": [
   "I've been a Monroe Park visitor for well over a decade now. You'll hear a lot of people complain about what the city has done to the park most recently, but they're looking at the situation with rose-colored glasses. \n\nDespite a few flaws, Monroe Park has been revitalized by Richmond and VCU. On a nice day, it's filled with the bustling sounds of students and members of the community. It's now a hub where all types can come and feel safe.",
   "It has a special meaning in my heart!!! When I was roughly 3 yrs the newspaper reporter took a photo of myself & 2 other children for the paper. We were kissing the statue that used to be there before the city changed it. But I like the openness of it along w/the gazebo.......still wish the statue had been fixed. It was there more than 50 yrs ago---it  WAS  a part of Richmond.",
   "Beautiful old city park recently refurbished with support from citizens and Virginia Commonwealth University.",
   "It's so clean and beautiful, nice area to just sit and take in the view of the amazing buildings.",
   "Very clean and peaceful. A place to go read or to just enjoy the sound of the water from the ⛲"
  ]
 },
 {
  "name": "Historic St. John's Church",
  "address": "2401 E Broad St, Richmond, VA 23223, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7d9ae222-9333-11ea-a19b-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "history",
   "tour",
   "tour",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12737905364125881357",
  "source": "GoogleMaps",
  "reviews": [
   "Definitely worth a visit even if you don't pay for the tour. Free to explore the grounds and check out the graves, including several of prominent people like Edgar Allan Poe's mother. Some gravestones date to 1700s and early 1800s. An incredible slice of early colonial American history.",
   "This is a wonderfully beautiful, historical and peaceful place to visit.  If you didn't know, St. John's is where Patrick Henry gave his \"Give me liberty or give me death\" speech to the Second Virginia Convention.  The memorial to George Wythe, preeminent legal mind in 1700's and first professor of law at William & Mary - Tutor and mentor to Thomas Jefferson, Justice John Marshall, Henry Clay, James Madison among others is well marked. And if you look you'll find the grave site of Edgar Allan Poe's mother. The gift shop does have the Parish book behind the desk and provides some interesting insights over the centuries.",
   "We made a pop in visit, just a short informal tour five or ten minutes inside the church and another ten minutes in the yard. It captures an important historical moment with some local context. The church is in the middle of a beautiful old neighborhood.",
   "Nice very old place. Didn't take the tour",
   "Experience the church where Patrick Henry gave his \"Give me liberty or give me death\" speech which got the Virginia militia formed and most likely saved the colonies. Betty gave an excellent job sharing the history of the building. About a 30 minutes tour."
  ]
 },
 {
  "name": "Tuckahoe Plantation",
  "address": "12601 River Rd, Richmond, VA 23238, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7de6929e-9333-11ea-87bd-14b31f159f22.png",
  "tags": [
   "history",
   "tour",
   "family",
   "family",
   "field",
   "tour",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2678768856421148866",
  "source": "GoogleMaps",
  "reviews": [
   "This venue is absolutely stunning! We were so impressed at how spacious it was for everyone to explore and roam. The history of the home was also such a cool touch for the guests traveling from the UK. They thought that was neat. The views to the river made for great photos. The staff at Tuckahoe were kind and so professional. they even helped me find some of my vendors! Thank You!!!!",
   "Well designed and maintained garden. Historical house tour of main floor. A family lives here so upstairs and downstairs are private areas. They are gracious enough to share parts of their home and lovely property. I attended a tea and quilt event that used all parts of the space to display quilts and served tea and homemade goodies. Very nice event.",
   "Perfect historical place to roam around alone or with family. Beautiful, happy-looking flock of sheep. Endless photo and video opportunities. Tucked away and private, but close to other destinations if you're going for a day trip.",
   "There was a transcendent peace here wandering the grounds with the smell of flowers filling the warm breeze, butterflies everywhere and stunning garden spaces. I about peed myself when there was snorting in one of the beds but it was just the neighbors horse. Having been chased by an angry three-legged pig at one point in my life which started in much the same way (true story) this was the only interruption of the total serenity of this place. Meander don't run, but go. The long tree tunnel drive to the property is only the start of this magical experience. Park in the field, pay your $5 and enjoy 💕",
   "A hidden gem only 20 minutes away from the city. The Tuckahoe Plantation is an incredible building from the 1700’s that still houses a family. What makes this place significant is this is where Thomas Jefferson spent several years growing up with his parents. There seems to be several architectural inspirations here at the Tuckahoe Plantation. Try to spot them if you can.  It’s a simple place, but I would encourage you to schedule a tour before heading down. You can schedule a tour by going on their website."
  ]
 },
 {
  "name": "Huguenot Park",
  "address": "10901 Robious Rd, Richmond, VA 23235, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7e2dfabe-9333-11ea-8121-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "family",
   "parks",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7984569737700845474",
  "source": "GoogleMaps",
  "reviews": [
   "A very nice park.  Has a large children's play gym and basketball court as you come in .  Soccer fields to the back .  Lots of parking.  Don't have knowledge of restroom facilities. Glad my grandson had his soccer game there so I had the opportunity to go and enjoy this gem in Chesterfield.",
   "Beautiful place to walk trails or have a good read from the Girl Scout's donated book stand. Also a great place to sit by the river and have lunch on the picnic tables :)",
   "As a homeschool family, we go to a lot of parks but this is definitely one of our favorite... not only because there is a donut shop close by 😉 The Park is fenced so I can sit in the front of the entrance and watch the kids. Also, they have swings for adults, which I love. It has nice hiking  area too but beware of the snakes 🐍",
   "I really enjoy visiting here! It had an awesome, accessible playground, as well as restrooms,  tables, and pavilions. I think I even spotted some corn hole boards...\nOnly downside is that it can get very busy!",
   "Great place to play with the kids. They have a large sand box with some toys, that are showing heavy usage but still usable. My son didn't seem to care which is all that matters.\n\n The largest playground playset I have yet to see and designed to be used by any age really. Some swings as well, though they are only for small kids."
  ]
 },
 {
  "name": "Rockwood Nature Center",
  "address": "Richmond, VA 23236, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7e7d115a-9333-11ea-aa1d-14b31f159f22.png",
  "tags": [
   "nature",
   "knowledgeable",
   "kids",
   "nature",
   "kids",
   "walking",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=373882615678418928",
  "source": "GoogleMaps",
  "reviews": [
   "Nicely done park with widely paved trails and staffed nature building. Several fields and courts to play various sports. Very large and well-maintained. \n\nNow if only the dog folks would be consistent in cleaning up their duties.  ;)",
   "Never knew this place had a nature center! Great for hosting birthday parties. A very knowledgeable employee teaches the kids about the reptiles and you even get to pet them!",
   "What a neat place to visit at Rockwood Park definitely something to the kids. Stumbled across this while walking the many hiking trails will definitely be back.",
   "It's the starting point of a great walk. Just be ready to spend 45 minutes in the woods if you're going on a walk. If not it's just a cute place to stop in and look at stuff",
   "An excellent park with numberous route on the trail to walk through. Plenty of shaded area with friendly staff."
  ]
 },
 {
  "name": "Lucy's Restaurant",
  "address": "404 N 2nd St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7ed6ca58-9333-11ea-a9d6-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "affordable",
   "delicious",
   "eat",
   "creative",
   "food",
   "delicious",
   "drink",
   "walking",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2895909309607089632",
  "source": "GoogleMaps",
  "reviews": [
   "This is a pretty neat spot downtown Richmond. It's quaint, clean, and has a good vibe. The food is delicious 👌, the portion sizes and generous and it is fairly affordable. They made a brilliant use of the space the available space. I will be returning. I have only had lunch here so far and i am planning on coming back for dinner. Highly recommended.",
   "Good spot for lunch. I really like the aesthetics. Nice warm atmosphere with wood and bricks to bring a cozy feeling while you eat. Had the O'Brien with a soup side. The sandwich was delicious, striking a good balance between fillings and bread. The soup, can't remember the name, was the best part of the meal. A salty, sweet, creamy curry soup. Spicy with bits of nuts mixed in.",
   "Finally made it here for dinner.   Managed a bar spot at 730pm with ease.  Thet had just changed the menu so it didn't match the website which was a disappointment.    Food was good, cocktails creative but service kind of distant and strained.  I will still go back and this is a must stop especially because it doesn't always pop up on simple web searches",
   "I stopped by Lucy's on my way to Dillon on the Amtrak. This was truly the highlight of my brief stay in this city. This place is small and on the night I came, it was full but not crowded. Probably because it was the Saturday before christmas and folks were either broke or out shopping. I say at the bar and I was tended to by Katie who crafted excellent drinks and kept me filled on the most wonderful bread imaginable. I started off with the Cavender, Stranahans whiskey, Averna, Amaro & orange bitters. This was a great drink and Katie really put her heart into making it. She was a great multi tasker able to make a drink and take orders from servers walking to the bar. She also kept my water filled as well as my bread. For an appetizer i had the veggie cakes which were kind of bland and uneventful. Carrots and spinach. I am not really on the health kick movement so maybe I should have passed on this one. Next I ordered the fried oysters. These were a perfect ten. I could have ordered three more of these and made them a meal and considering how uninspiring my main dish was, I should have done just that. They came over bacon collard greens. You just know anything over bacon is going to be good. Now for my main dish I had the Colorado lamb shoulder. It sounded good on paper but I guess i got confused with lamb chops, like those tiny grilled lollipop type things with the bone sticking out, but this was like pulled pork. My problem was with the presentation. As soon as it hit the table I was like WTF is that pink stuff on top of my meat? F4om the picture you will see that it just was not appetizing. I take it that it was cranberry butter. This dish had a lot going on.Lamb shoulder, butternut squash, pecan apple bread pudding and that pinkish blob which i guess was the cranberry butte mixed into the bread pudding making it like a pink bread pudding. The apple pie was nothing special and I should have passed on that. But the menu is quite enticing. I would strongly consider either the cherry glazed duck breast or the pig and chicken salad next time. The bread was incredibly delicious and it was always delivered hot and fresh. Katie is what made this a five star experience for me. The lamb was not bad when I had it for leftovers the next morning. Overall I was extremely satisfied with the welcome i received, the attention at the bar, the expertly crafted drink, the ambiance, the timing of the presentation of the meals, the fresh bread, the creativity behind each dish and the price.  I will definitely be back again the next time I am in Richmond",
   "Delicious brunch, amazingly friendly servers, very reasonable prices, all in a lovely, cozy space. We had brunch there while exploring the street festival, and loved everything. The ambiance is great. It's extremely nice and clean inside, with thoughtful touches large and small to be found. The servers were super friendly and helpful, and all around nice people. The star of the show is the food. Our brunch was absolutely delicious. We had grits with shredded pork and eggs, and it was amazing. Our side of roasted potatoes was creamy, a little sweet, and not oily or heavy at all. My favorite were the bacon donut holes. Crispy on the outside and heavenly soft on the inside. We will most certainly be coming back, and we almost decided to come back for a second brunch later in the same day!"
  ]
 },
 {
  "name": "Perly's",
  "address": "111 E Grace St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7f202fa2-9333-11ea-a945-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11166169366289310894",
  "source": "GoogleMaps",
  "reviews": [
   "Committed the major issues of coming in with a large group during their rush and splitting all checks. They were more than accommodating, fun and gave us great service. Never pressured us to along.\n\nFood was excellent. I had the corned beef hash, made fresh in house. Tried my buddies bagel and lox. Both the best I've had anywhere around. Ate it all before my camera had a chance!\n\nWill be back and highly recommend!",
   "This was recommended to us by a lot of locals so we changed our plans for brunch from somewhere else and went here instead. Definitely recommend coming here. The food was good, the wait staff was friendly and helpful. It was a little slow which is the only reason it’s not a 5, but overall would definitely come back. Pictured is the Benny Goodman",
   "Have been here twice - enjoyed it so much the first time that we had to come back when passing through Richmond. Everything is really well done. Loved the fish board! The bagels, cream cheese, and lox options were all delicious and perfectly complemented by a variety of pickled things. Perly's has easily become a favorite that I will gladly continue to return to for an enjoyable meal and fun atmosphere.",
   "Great food and generous proportions! Authentic like my mother in law made!  Only problem, we purchased bagels to take home and they were hard and stale!  We expected them to be the same quality as the food. We certainly will give it another try.",
   "If you don't get the schlubby fries you're a heathen. Brunch isn't brunch without the salmon Benny. They have the only good bagels downtown. The wait on weekends is bananas. 45min to over an hour. But Stella's is next door and they're happy to have you wait there."
  ]
 },
 {
  "name": "The Roosevelt",
  "address": "623 N 25th St, Richmond, VA 23223, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7f6a582e-9333-11ea-8b86-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "music",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8777910959593448062",
  "source": "GoogleMaps",
  "reviews": [
   "I love their take on Southern dishes.  It is often difficult to get a table but I got lucky today!  The bar program is renowned.  Plenty of charm throughout the restaurant.",
   "Delicious food and great service. Also, the cocktails were incredibly tasty. I liked that there was a nice space in between getting our appetizer and entrees. Some restaurants tend to rush and bring out entrees before you've even finished with the app; but The Roosevelt staff were all very attentive and the pacing of the meal was perfect. Perfect place for a nice night out when you want to enjoy your meal and company and not feel rushed.",
   "Special Valentine's Day menu. Every single bite was amazing from the lamb tartar to the scallops to the chocolate cake. Best scallops I've had in years! Must go!",
   "My first exposure to The Roosevelt was a quick phone call to make sure they had bar seating. My call was answered by a charming lady who not only assured me they do, but that I could get a full dinner menu. She even confirmed my arrival time to make sure I could be seated when I arrived. The drive from my hotel was somewhat I retesting because the neighborhoods I had to drive through were somewhat sketchy, but where the place is located is actually a very nice neighborhood going through a rebirth, with lots of young professionals, although the only parking available is on-street, but not metered.  When I went into the beautifully restored building I was met by the woman with whom I spoke, and she greeted me by name. I grabbed a seat at the bar after she introduced me to the bartender, Jesse. The bar was extremely well-stocked with top shelf and local liquors and wines, but only three craft beers and one cider. Their mixing ingredients are all fresh, locally-prepared and extensive. Herbs for muddling are in a planter on the bar along with an entire collection of various shrubs and fruits which Jesse regularly utilized in the creation of a number of high-end signature cocktails. And even as busy as he was, he still made time to chat with me about music, drinks, and whatever. The menu was diverse and matched the online version, so I  was able to order based on what I had seen online. The harder part was selecting a wine from the extensive menu. I ordered the seared scallops, which were excellent, although for the price, I would've hoped for a larger portion. Since I was still hungry, I went back for dessert, an excellent little dish of absolutely decadent chocolate mousse. Overall, an excellent meal in great surroundings hosted by great people.",
   "We were spending the night in Richmond and happened upon The Roosevelt. What a fortunate find. The atmosphere is very cool, old hardwood floors, tin ceilings, very high. The service was top notch and the food was even better. My wife had the chicken fried portobello mushroom and I had the pan roasted scallops...we shared the roasted beet salad for an appetizer and the peanut butter pie for dessert. We started the night with drinks and liked mine well enough to ask for a recipe which the bartender came over and shared. Turned out to way too involved to make at home but man it was good. We will eat here again in an instant, next time we are in Richmond!"
  ]
 },
 {
  "name": "Lemaire",
  "address": "101 W Franklin St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7fbc700c-9333-11ea-9372-14b31f159f22.png",
  "tags": [
   "drink",
   "historic",
   "history",
   "free",
   "food",
   "delicious",
   "drink",
   "history",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=700416004425740364",
  "source": "GoogleMaps",
  "reviews": [
   "Celebrated an anniversary dinner at Lemaire recently. Have always loved the Jefferson for its rich history, architecture and historic Richmond feel. The restaurant is located near the hotel check-in area and has a very active/popular bar right outside of the dining area. This can be highly trafficked on a Friday evening during happy hour, but we were able to find a place to sit and have a drink before our reservation. Wait staff was helpful and kind. As with most public areas of the Jefferson, the bar and restaurant have wonderful high ceilings and mouldings that create great ambiance and character of the hotel.",
   "Beautiful, calm atmosphere. Wonderful food & wait staff. Extra touches offered free of charge.",
   "The food was delicious. The setting is rich in history. You can feel comfortable dressing up (though some people still wear jeans 🙄). While the wait staff was attentive, I was surprised that our waiter never offered the drink menu back after we finished our first drinks, even with the empty glasses moved to the edge of the table. If asked, I likely would have gotten a glass of wine to go along with my meal after I finished my cocktail, but didn't feel strongly enough to call the waiter out on it. Anyway, this is more of a 4.5 because we have had great experiences in the past too.",
   "High-end experience during the holidays\nWhat's not to enjoy?  Always have a great time celebrating at Lemaire. Food and service is exceptional.  The butternut squash soup was spectacular.",
   "Excellent service and food was very good. The salmon was phenomenal. The honey pot dessert was delicious."
  ]
 },
 {
  "name": "L'Opossum",
  "address": "626 China St #626, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/80016864-9333-11ea-8478-14b31f159f22.png",
  "tags": [
   "art",
   "food",
   "delicious",
   "unique",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16001242917669512221",
  "source": "GoogleMaps",
  "reviews": [
   "I took my boyfriend here for our second anniversary and we had a memorable experience! We looked at previous reviews for this place before we arrived and were not disappointed. The escargot was absolutely amazing. Not at all chewy and rubbery like one would think snails would be like. I’m not even a fan of escargot, but these were seriously the best I’ve ever had and would recommend to anyone who enjoys escargot. Don’t be afraid to ask what a dish is. The wait staff are prepared and ready to answer in detail to any questions you may have.  The ambience and decor.. is certainly interesting. Very quirky and fun place. If you are planning on dining here, I would advise to make a reservation a few weeks ahead as this place is very quickly booked.",
   "The atmosphere is cozy, with a contrast of dark woods and beautiful light. The decorations are new but have a nostalgic feel to them. The long bars are inviting and the staff is really nice. And there's something about a nice atmosphere that relaxes everyone and makes them friendly, which is part of what I love about this place. I always make new friends here without even trying.",
   "Everything about this place is aMAZing! The people, the decor, and definitely the food. It truly was art. The crab cakes were by far the best I've ever had. Absolutely an adventure beginning to end.",
   "Unique atmosphere and one of a kind food for the most part. Some variations on some old classics that are used all over. But delicious non the less.",
   "This place was highly recommended to me and I found it to be underwhelming. I was excited upon entering, the staff were excellent and the decor was amazing. The water was mint infused and delicious and I couldn't wait to sink my teeth into some yummy food. We ordered their special appetizer, a creamy crab concoction on top of pureed spinach (sort of looked like flan). Which was yummy, my partner enjoyed it but the mushiness threw me off. I was still excited as this was a personal preference turn off.  Alas, while the food was good I did not feel it was good enough to justify the price and it did not blow us away. I got the Swank Bank, which was advertised as mac n cheese, but it was served with shell pasta (not macaroni) and had a liquid creamy cheese sauce rather than the gooey cheese that I had anticipated. It was very buttery and while it was good, I was not blown away. My favorite part about the dish was the asparagus and the leafy greens at the bottom. My partner ordered the Beef \"Swellington\" which he said was over salted, but still good. He shared the same sentiment that I did, good food, but not amazing food. The best part about his dish was by far the mushroom, which he generously shared half of the only mushroom on his plate with me. The mushroom was amazing and very yummy. We opted out of dessert and alcoholic drinks. All in all I don't regret my visit, but I am not salivating to return."
  ]
 },
 {
  "name": "Rappahannock Restaurant",
  "address": "320 E Grace St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/805024da-9333-11ea-ac3c-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13109198040100887727",
  "source": "GoogleMaps",
  "reviews": [
   "This is probably my favorite Richmond restaurant. It’s a go to for any special occasion. I’ve never had a meal I wasn’t satisfied with and it’s really great to get fresh seafood, perfectly prepared. I would LOVE to see more local, Virginia caught fish on the menu.",
   "Everything was delicious! Atmosphere is laid back and chic. Customer p is on point. Definitely will be a repeat customer.",
   "Great raw oysters, a nice selection. Nice decor, and our waiter was outstanding. Nice selection of wine by the glass. Interesting menu- and everyone agreed that the food was good, but... Not great.",
   "3-1/2? Overpriced, but accessible. As a seafood enthusiast, I respect the preparation and attention necessary for quality. The cost is simply not comparable to the meals that either myself or my friends have experienced on multiple attempts. Optimism in the variety brings us back, but we are always underwhelmed by bland flavoring or small portions. The staff is excellent, informed and courteous.",
   "We had a fabulous dining experience at Rappahannock's! Quaint atmosphere and food served tremendously fresh and quick due to an event we were attending, in which we asked the server and they provided with a \"Wow\"! Recommend the cheese tray small plate and anything/everything from the entree menu."
  ]
 },
 {
  "name": "Shagbark",
  "address": "4901 Libbie Mill E Blvd, Richmond, VA 23230, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/80af350c-9333-11ea-8eb8-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2744824437803504061",
  "source": "GoogleMaps",
  "reviews": [
   "The decor is modern rustic.  I love the large vertical slices of wood separating the rooms.  Plenty of outside, covered tables.\n\nFood presentation is a number one priority.  It's a very imitative place.  The service was a little spotty.\n\nThe meat and cheese appetizer was amazing, probably better than the main course.  The pimento cheese could be the best I ever had.  It's a must have.",
   "On of the best restaurants in Richmond. Our experience was outstanding. I had the rabbit but there were many awesome selections for people not as brave as I.  The wine list was good as well. \n\nOn the way in I noticed several great selections of whiskey. It was quite and cozy with an excellent wait staff. 👍👍",
   "Magnificent restaurant with local ingredients, wonderfully prepared dishes and outstanding customer service.  The restaurant boasts a gorgeous dining room in the newly constructed Libbie Mill development.  It has very few competitors in Richnond who can deliver at this level!",
   "Wonderful salmon, excellent service.\n\nThis is a little higher end than I usually eat, but this place doesn't throw it in your face the same way some places do. Their focus is on providing quality food with quality service and by both measures they succeed.\n\nGood for couples or groups of varying size, with a good range of selections to fit most diets. They also know their way around a duck, a particularly valuable trait these days.",
   "The food was great, and the rest of the dining experience was about what I would expect of a three dollar sign restaurant.   \n\nI'm only giving 3 stars because I hope management takes note of below to improve future interaction with others.\n\nI am however sadly disappointed in the care of customers needs.  We had made a reservation early in the dining timeframe, and I had clearly requested in my reservation a seating request to help the evening go more smoothly.  However, when we arrived, and we were the first guests to be seated in the dining area, the complete opposite of my request was granted.  One seat backed to the middle of the dining room, and the other backed to the bar and beside the waiter station/service bar.  The place was empty so I didn't make a fuss about it as I figured it would make little difference when not busy,  I wish I had.  About half way through our dining the place near instantly filled and all the difficulties that I had hoped to avoid were as bad as they could be. \n\nI hope that in the future, when your establishment receives a request that someone took the time to write and explain why, that at least a shred of effort is put in to accommodating that request."
  ]
 },
 {
  "name": "Heritage Restaurant",
  "address": "1627 W Main St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/80fc921e-9333-11ea-8e1f-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "drink",
   "family",
   "food",
   "delicious",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18005161700568328054",
  "source": "GoogleMaps",
  "reviews": [
   "Food was phenomenal. It’s very close to 5 star food no question. Cocktails were 5 star as well.  Phenomenal duck breast. Perfect tuna tartare. Great desserts. \n\nWhy I’m only going 4 stars though. Reservation was for 6:15, actual seating was 6:45. The dessert course got lost and ended up about 30 minutes between main and dessert. And lastly tuna steak was cooked medium well. It was still super tasty, but that’s too much for tuna.",
   "The booth by the door, next to the front windows are a tight fit. They have maximized their space with tables and seating for guest. So if it's a full house it will feel like a full house. This placed seems to be very popular. You are treated like a VIP once you step inside. Our server was excellent. She knew the entire menu & drinks menu. The drink she suggested was delicious. In fact I had 2 of them🍹 \nLoved the specialty names for their signature drinks. The food was great. The portions filled me up. Very very nice place for an evening with friends or family. Staff seem to work well together. It was all smiles from everyone. Totally enjoyed my visit and would recommend stopping in.",
   "Delicious food excellent service. I had the smoked sausage with potatoes and it was so crispy. Def going back",
   "My husband and I booked Heritage for our rehearsal dinner the night before our wedding, and it was some of the best food, service, and ambiance we've ever had. We had about 60 people in the restaurant, which was the perfect number...full but not crowded. Emilia and all of the staff were so wonderful to work with for every part of the process, they made it easy and stress-free! Every single guest loved the fabulous food and specialty cocktails, we got so many compliments about this restaurant. Many guests said they would want to come back to Richmond just to eat here. My husband and I will be lifelong fans of Heritage, it honestly could not have been a better experience! Thank you for your wonderful work!",
   "The place was full but the four of us could still carry on a conversation.  Our waiter, Cate, was great.  Best of all was the food!  Wife had the soft shell crab and enjoyed it.  My monk fish was even better than the rock fish we had shared our first time here.  Fried broccoli is a must have.  This is our most favorite restaurant in Richmond - more enjoyable than the famous hotel."
  ]
 },
 {
  "name": "Saison",
  "address": "23 W Marshall St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/814ad958-9333-11ea-8179-14b31f159f22.png",
  "tags": [
   "food",
   "creative",
   "food",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=7037896821980750662",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful service (at the bar), staff are very polite and welcoming. Drinks were tasty, but not a good selection for vodka drinkers. There appeared to be several varieties of every other type of spirit though. Nice wine selection. Tasty small plates. Great atmosphere. Overall pleasant experience.",
   "Amazing food, great service, loud as hell. Really flavorful dishes, not overtly Latino in the usual way but perfectly inspired. Cauliflower and skate wing small plates and pork and hanger steak large plates were all hits. Otherwise an excellent date spot but it was deafeningly loud and the tables are a bit crowded.  I would definitely still return.",
   "This is one of my favorite Richmond gems. It is tiny so you will need reservations. We had a large group of people and ended up ordering just about everything on the small plates menu and it was all amazing. This place is known for amazing cocktails. If you're not sure what to order tell your server what you like and the bartender will be able to come up with something fabulous. Our server was amazing and super sweet all night.",
   "Great experience! Food is innovative and Rich. At first glimpse of the menu, you may be thinking that there is not a lot here. Oh, but it is! The food is super creative and flavorful. This was our first visit here and we will be back for sure!",
   "Have been here before for food and it is definitely 5 stars! But also a great cozy place to swing in for a cocktail or two. It's in a GREAT location for easy walking to some fun entertainment! Love the super kind and efficient service I have gotten every. single. time."
  ]
 },
 {
  "name": "Brenner Pass",
  "address": "3200 Rockbridge St #100, Richmond, VA 23230, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/819b4376-9333-11ea-9412-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=14318501577777972168",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful Restaurant, amazing food and generous drinks. I visited Brenner Pass for New Years with my husband and friends. Located in Scott’s Edition and away from the busy area. Parking was available close by. Everything we ordered was delicious. I can’t recommend this place enough. Be prepared for a pricier meal but it is well worth it. Service was great. Come here for a special occasion. Lobster Risotto and Scallops just melt in your mouth. Best dessert was the tiramisu.",
   "Service that was both fantastic and above 'n beyond any expectations. Phenomenal food and cocktails, with a few special liquor selections too. A great place for celebrations of all kinds - especially anniversaries.",
   "I like this place more for the ambiance than for the food. But if you really want a fun experience, ask for the cheese cart. If you are ordering a cheese plate they will bring around this cheese cart (like a dessert cart) and explain all the cheeses to you. Then you can sample the ones that peak your interest before you place your cheese plate order. Genius.",
   "Another great restaurant in Richmond Virginia. The garlic soup as an appetizer is simply amazing. The service was stellar. As expected the roysters were way overpriced. The Friday wasters were delicious. And the artichoke was incredible. It's a little cold inside. It she can modern but lacks a little character. Over all the experience was grand. I will be back to taste more...",
   "This evening we have enjoyed a fabulous meal at Brenner Pass. In the past we have liked some offerings at this eatery but tonight absolutely everything was perfectly prepared. I began with the Ocean Spray Cocktail which was tart and refreshing followed by the Arugula and Apricot Salad with Pistachio Vinaigrette which was delicious and large enough to share. For entree I chose the Saffron Risotto with Crab which was extremely fresh and flavorful. My husband enjoyed the Halibut with Charred Vegetables with an unusual and altogether tasty sauce. We concluded our meal by sharing a fantastic dessert of fruit, toasted hazelnuts and pistachio ice cream on spicy pound cake...I've forgotten the name of the dish but not the great taste. The flavor combinations at Brenner Pass are unusual and sometimes surprising but you won't find a better meal anywhere and service that is prompt efficient and pleasant. A truly great experience!"
  ]
 },
 {
  "name": "Nota Bene | Restaurant & Bar",
  "address": "2110 E Main St, Richmond, VA 23223, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/81ea9c28-9333-11ea-b38b-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13964363273157417156",
  "source": "GoogleMaps",
  "reviews": [
   "For my wife’s birthday we always do Italian food. We decided to go away for her birthday so we ended up in Richmond. Found this place and it had good reviews so we checked it out.\n\nPro: The ambiance was great and the restaurant is really nice. The service was good/helpful as well. The food was fine, nothing to write home about but not bad. The pizza was good though, that I recommend\n\nCon: We originally order Focaccia as an appetizer. When they brought it out we were told this was the last one they had. What they gave us resembled, both in look and taste, was regular table bread. We told the waitress who told us this was their focaccia. They took it back and it wasn’t on the bill(thank you by the way). The other food we got was fine.",
   "Nota Bene is one of my favorite Italian restaurants in Richmond.  Actually, one of my favorite restaurants period.  The food is delicious, and the service is warm and welcoming.  It's a great place to have a fancy date, or just a casual meal at the bar.  Always happily full and pleased with my experience every time I eat here.",
   "This is my FAVE place in Richmond. My boyfriend and I are regulars there now, and the staff always welcome us. Our favorite thing to do is go for Tuesday Date Night ($60 for 3-course meals, for 2! And a bottle of wine). We both highly recommend Nota Bene––authentic, delicious, and memorable.",
   "I ordered white bolognese and it was amazing eventho portion wasn’t filling and I felt I needed a lot more to feel stuffed. My wife ordered this branzino and it was super aesthetically pleasing and can’t comment on fish taste since I don’t like seafood specially fish.",
   "The food was excellent. I'll go back again for the mushroom pasta. Heirloom tomato appetizer was outstanding."
  ]
 },
 {
  "name": "Edo's Squid",
  "address": "411 N Harrison St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/823f4c0a-9333-11ea-b367-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "food",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5701039095442980863",
  "source": "GoogleMaps",
  "reviews": [
   "I had the rock fish!!! It was delicious!! Very bold in flavor and filling as it was served with pasta. \nThe fried squid was great as well. The seafood mixed pasta was great as well. It was spicy.",
   "Amazing food, huge portions, attentive waiters. The mussels were delicious, the mixed seafood spaghetti and the meat sauce were fantastic. However, it is quite noisy, and the fish are quite expensive.",
   "Sausage, Broccoli Rabe - a meal to rave about! A perfect amount of heat spices this pasta and Italian sausage dish.  I crave it. Huge portion allows for ample leftovers fit for another meal. Lunch time is my favorite time to go; relaxing with great people watching from the second floor windows overlooking Harrison. Perfection.",
   "Hidden gem! It’s a must go to in Richmond. I can’t get enough of the broccoli rabe and fried squid. I take everyone that’s visits here! They definitely know how to cook and make the best combinations of flavor I’m each meal. The staff so friendly and welcoming. It can be noisy when busy but the food is so good it doesn’t matter!",
   "Way underpriced for what you get!  My daughter and I were looking to catch a quick bite before the symphony at the Alistra and this place came up in reviews.  It's only about a  9 minute walk from the theater. \n\nAdmittedly, we weren't sure we were in the right place when open the door and see a sketchy looking walk-up you assume you're going to the employee entrance of the restaurant that's downstairs. We were going to pass based on the entrance until we saw happy faces coming out. \n\nI'm glad we went up that sketchy walk-up.  It's a single room restaurant, with moderate bar and you can see into the alley kitchen from the dining area, but those quirky things make it charming. \n\nThe servers were fantastic and the menu is simple.  The food was incredibly good and I especially liked the steamed muscles.  The portions are very large for lunch and the price was much lower than I had anticipated.  \n\nIt is a small area and were literally sitting side-by-side with other diners, so if you're looking for a quiet restaurant to have a private conversation, this isn't it.  However, everyone we sat near was pleasant and happy."
  ]
 },
 {
  "name": "Mama J's Kitchen",
  "address": "415 N 1st St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/827f1450-9333-11ea-a818-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=17021004273803830438",
  "source": "GoogleMaps",
  "reviews": [
   "It's fairly small so be prepared to wait for a table right around the busiest windows. \n\nMenu revolves around chicken, catfish, pork chops, crab cakes and ribs. With sandwich or entree takes on those main proteins. \n\nSide dishes are generously sized and really big enough for two people. Salads are very large. \n\nVery friendly staff and reasonable prices round out the experience.",
   "This place is fantastic. Everything I've ever ordered here has been just delicious. I highly HIGHLY recommend the catfish. They have the best collard greens I've ever had in my life and their sweet tea is amazing too. Don't forget to finish your meal with a very generous slice of cake- it doesn't matter which one you get because they are all fantastic. Their staff are all super friendly and service is prompt as well. All around 10/10, you can't go wrong choosing to eat here.",
   "This restaurant is amazing! We went on a Monday night and had only a 15 minute wait to be seated. My party of four all enjoyed their entrees. I had the fried catfish with a side of cabbage. Perfect crisp on the fish, succulent cabbage, both nicely spiced but not too much. The rest of our group had the fried chicken. They raved about the crispiness, moist meat and flavor. We got coconut cake and peach cobbler to go--yum! We will definitely be repeat customers, we all loved Mama J's Kitchen!",
   "Fries catfish was delicious. The catfish nuggets were similar to the fried catfish. Candied yams were a little too sweet as expected. Peach pie was delicious. Fried chicken plate was also great. The Mac and cheese was a little disappointing. Staff was super friendly. Easy to find parking",
   "Honestly wasn’t impressed with what we ordered.  (Ribs and chicken) The sides were decent but nothing to tell your neighbor about.  However the couple sitting next to us seemed to enjoy their picks.  We may just need to revisit and try something else on the menu. The cake looked amazing, may also be worth another try."
  ]
 },
 {
  "name": "Bookbinder's Seafood & Steakhouse",
  "address": "2306 E Cary St, Richmond, VA 23223, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/82c4a926-9333-11ea-aa54-14b31f159f22.png",
  "tags": [
   "history",
   "delicious",
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2013131468746429427",
  "source": "GoogleMaps",
  "reviews": [
   "Our first visit to Bookbinders was in January. It's located in a nice convenient area, and has a little history to it. The service is quite good, but not spectacular. The ambiance was a bit dull during our visit. They have a great wine list. Standard cocktails. All of the dishes are cooked perfectly, especially the steaks. They must use high quality meats because the fillet and strip are to-die-for amazing; get an accompanying sauce. The lobster is wonderful and tastes so fresh. The scallops are also good. All of the appetizers are good, you can't go wrong with any of them. The sides are okay, not so special. Do not order the lobster mac and cheese here, as there was no visible lobster at all in ours. They say they pre-measure out 2 ounces of lobster for each lobster mac, but ours was definitely sans-lobster. They couldn't remake ours because the kitchen was closing so the waitress was to take it off our bill, but forgot. All of the deserts are good, as well as the desert wines. I would recommend Bookbinders for: specials group outtings, an anniversary, business dinners, a date night where you want to be treated.",
   "Family holiday dinner was superb! Party of 6 we received excellent and friendly service. The food was delicious and of course we shared a few cups of cheer. Really one of the best RVA restaurants. Merry Christmas!",
   "Food and service were amazing. The menu looked so good, we were undecided on what to get. Definitely a top class place with great service and an amazing chef. We will be back to try some more menu items.",
   "I took my wife to Bookbinders for a romantic evening.  We ended up paying a little over 200 dollars for our meal, and to be honest it was more than worth the price.  Actually, I would have gladly paid 300 for our meal. \n\nI have dined all over the world and Bookbinders is now in my my top three for overall dining experiences ever.  Definitely top two for dining in Virginia.  \n\nI would like to thank the manager and staff for a truly top shelf experience.\n\n5 stars for every aspect of our incredible dinner.",
   "Food was excellent.  Everything tasted like it was well made and with care.  Waiter was very helpful in recommendations for both food and drinks (Wine).  Service was fairly fast and prices were decent for the quality of restaurant."
  ]
 },
 {
  "name": "Dutch & Company",
  "address": "400 N 27th St, Richmond, VA 23223, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/830f6dee-9333-11ea-b651-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "food",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5065721847839764775",
  "source": "GoogleMaps",
  "reviews": [
   "Wanted something special for Valentine's Day.  Luckily, I planned several weeks in advance because it was almost sold out.\n\nWonderful prefix 5 course meal.  The app were mind blowing.  The craftmanship and presentation was truly amazing.  The handkerchief pasta was a little salty but it worked perfectly.  The oysters and chorizo with some mashed potatoes was super tasty.\n\nThe steak was a little spicy and nicely cooked.  The desserts were very unique.  Overall, the service and food presentation made a wonderful special occasion.",
   "Went for our anniversary, my wife and I did the prix fixe (3 courses for $30 apiece) and we greatly enjoyed the food and ambiance.  Our waiter was very good.  The house red was on point.",
   "Dined here for my birthday and had a wonderful experience. Service and food were excellent. Great  cocktails and wine selection. The perfect egg.... is unforgettable. Will be a new fav spot for us.",
   "Had dinner last night for Richmond Restaurant Week, and it was fabulous! Staff was super friendly, environment was cosy, easy parking, and the food was exquisite. They are not lying when they say it is \"the perfect egg!\" can't wait to come back again soon and try the regular menu as well.",
   "Went to Dutch and Company with my wife and was very delighted by the bar selection and unique food offerings. We’ve been back four times and love every single dinner and cocktail. I even got to meet the owner last time and Michelle is lovely. Will definitely be back."
  ]
 },
 {
  "name": "Kuba Kuba",
  "address": "1601 Park Ave, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8358b446-9333-11ea-9903-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6418345565789670430",
  "source": "GoogleMaps",
  "reviews": [
   "Great hidden gem in the fan district. The portion sizes are huge. You can definitely share with someone. The atmosphere is energetic. The food is pretty decent. The tres leches cake and Cuban coffee is awesome. The only reason I give it four stars is the service is pretty slow. Also there isn’t much seating so prepare to wait. But other than that, definitely recommend.",
   "absolutely LOVE them! Service, prices and food😁 I just wish I had more pics to share! All I know is you will not be disappointed here!",
   "Awesome Cuban restaurant in Richmond. Was in town for about an hour and stumbled across this place to be greeted by lovely staff and delicious food. It was my first time trying Cuban and it sure won’t be my last (if it’s usually as good as this place’s food). Would definitely recommend, but a word of caution - it’s very filling! :)",
   "The food and coffee are always amazing!  We tried dessert for the first time and it won't be the last time.  The Guava Cheesecake was phenomenal.   The bread pudding was good but cold.  Not used to bread pudding being cold but that may be the way the serve it.",
   "Wonderful food, great service, Coke products. Things are a little expensive, but the portion size is worth the price!!"
  ]
 },
 {
  "name": "Acacia mid-town",
  "address": "2601 W Cary St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/83aa08e2-9333-11ea-ae52-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5382460126641091915",
  "source": "GoogleMaps",
  "reviews": [
   "The prix fixe menu is an excellent bang for the buck! The food is good and it’s obvious there is lots of care put into the dishes. The service was good and attentive, but the delivery of the food was a bit slow. All things considering, the price for these three courses and some wine on a Saturday night was excellent. Just make sure you have enough time to enjoy!",
   "I've had many fantastic meals with the quality of food, drinks, and service all being top notch. So disappointing that this iteration is closing as it's the one place I could always count on for a quality meal for the last 10 years. The best things here were the crab cakes, most fish, scallops, duck, and especially the ceviche. Hopefully it will all be back and as good as ever sometime soon!",
   "I’m sad to hear this place is closing. My one and only meal here was last night and it was one for the books. Beet Salad, scallops with gnocchi, crab cakes with grits...The chef truly knocked it out of the park with our meal and the service was as good as it gets. This restaurant will be missed!",
   "Seriously good food. Makes reservation, enjoy yourself. They have valet parking if you don't like hunting for a spot.",
   "Tasty food, really good work trying to get into fine dinning. The food has a great flavor and comes to the table really hot. The service needs to organize better but overall they did a great job."
  ]
 },
 {
  "name": "Amuse",
  "address": "200 N Arthur Ashe Blvd, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/83e93512-9333-11ea-9fc0-14b31f159f22.png",
  "tags": [
   "creative",
   "art",
   "art",
   "food",
   "creative",
   "food"
  ],
  "link": "https://maps.google.com/?cid=199495301374230169",
  "source": "GoogleMaps",
  "reviews": [
   "We came here for brunch on Sunday. I only wish it opened at 11 instead of 11:30. Good thing we got here a couple minutes before it opened because we did not have reservations. The restaurant went from being empty to almost full very quickly! \n\nOur server was informative and did a great job. Their brunch menu had some good choices. A welcome surprise was complimentary chunks of soft bread with fruit in it, one for each of us that came out before our meal. \n\nFor brunch, we went with the quiche and the stuffed apple French toast. Portions were much bigger than expected! Very generous. The quiche was divine— so soft and it practically melted in your mouth. It came with some salad greens. \n\nStuffed French toast was like a sandwich, and it also came with bacon and tiny square-shaped cut apples around it. Dessert was the chocolate tarte which was a square shaped chocolate mouse with raspberry sauce around it and a scoop of cream with a raspberry on top. It’s one of my favorite brunch places thus far.",
   "Thanks to a bartender who took the time to listen to the things I enjoyed, I decided to have lunch at the wonderful Amuse Restaurant, located on the top level of the museum overlooking their beautiful grounds. The space is flooded with natural light that immediately lifts your spirits, and prepares you for your amazing meal and cocktails. Perfect for a small group or large. Just remember to make a reservation!",
   "Consistently rated as one of the top fine dining restaurants in Richmond, Amuse serves creative dishes in a delightful setting, within the Virginia Musem of Fine Art. There are two dining rooms indoors, an adjacent  bar area, and a large outdoor balcony for dining as well. It is only open limited evenings during the week, and it is best to make reservations.",
   "This restaurant goes hand-in-hand with the art museum it sits on top of!  Beautiful, natural lit location with fantastic decor.  The menu was a bit limiting, and the options weren't as tasty as we thought they would be, but it was still good food with great atmosphere and staff!",
   "Love Amuse. We've visited this restaurant several times. I dont think we have had any complaints. The staff is wonderful, the drinks are creative, and the food is great."
  ]
 },
 {
  "name": "Croaker's Spot | Richmond",
  "address": "1020 Hull St, Richmond, VA 23224, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/843580ae-9333-11ea-baae-14b31f159f22.png",
  "tags": [
   "delicious",
   "hospitable",
   "delicious",
   "food",
   "music",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=5585636315989936631",
  "source": "GoogleMaps",
  "reviews": [
   "We went on a weeknight and it was busy, but we were seated immediately. I ordered the restaurant week special, which was delicious and a really good deal. Everyone else was happy with their meals, we took lots of leftovers home, but the thing that impressed me most was the service. Mia was so hospitable and took very good care of us the whole time, even when she had another large party to attend to. Thank you for a great dinner!",
   "We went to celebrate Valentines Day! A bit of a wait but not too bad and we expected it. Great atmosphere BUT the bar room dining waitress ONLY serviced the white patrons!!! YES! Totally overlooked us and then I watched her the entire time. Even when I very kindly asked if she was our waitress, she said yes, but then sent one of the bartenders to service us. That bartender/waitress was nice however, just prior to her waiting on us I went to the bar to order us drinks(thinking that would prompt our waitress to come to us after waiting on the white couple that was seated after us). Got our drinks but was told she didn’t swipe my card and handed it back to me saying they’d just add it to our food bill. Well guess what? She did swipe it and charged my card for  the drinks and then they also put the drinks on our bill!!!!  That was so disappointing! The food was delicious though.",
   "Our waitress was wonderful- professional yet personable. We got fried shrimp and Mac. THE BEST I’ve had since relocating here from Boston area. The music choice was perfect and the atmosphere- the atmosphere!\nCan’t wait to go back- O wait/ we got 4 different slices  of cake to go just because. Fabulous \nThank you Croaker!!!",
   "This place is amazing, the staff works really hard. The food is excellent. I came all the way from Newport News this past weekend and it was well worth it...Talking with the locals while waiting was awesome as well. Keep up the good work. Scale of 1 to 10, I give it a 12",
   "Serving size was fantastic. I was able to eat on my fish dinner for 2 days. I gave 4 stars because my broccoli was barely steamed. It may have been an off day... the mac n cheese looked fantastic but wasn't flavorful."
  ]
 },
 {
  "name": "Christopher's Runaway Gourmay",
  "address": "2-98 S 12th St, Richmond, VA 23219, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/84997290-9333-11ea-af8d-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=8204923536720327533",
  "source": "GoogleMaps",
  "reviews": [
   "Oh my goodness, best chicken salad ever.\nI was looking for a hot dog and found them.\nI will attempt to pass them when ever I'm downtown.  The price is very reasonable. I had cucumbers and fruit  with it .\nI WILL BE BACK !!",
   "Cash only. Absolutely love the chicken salad. The sesame noodles are also quite good. ",
   "got chicken salad here on a recommendation (i'm generally not a big chicken salad fan) a few years ago and it is awesome. been getting the chicken salad with a side of fruit and cheese ever since. one of the best bangs for the buck around (note that it is cash only)",
   "Cash Only.\n\nExcellent flavors - sesame noodles, marinated cucumbers, tarragon chicken salad, pesto pasta, block of cheese or chunk of bread.\n\nGenerous servings of quality ingredients.\n\nMemorable staff making jokes with their regulars and newcomers.\n\nVery reasonable pricing.",
   "Not only is this the best value in Richmond.  Christophers undeniably has the greatest chicken salad ever!  If you’re downtown around lunchtime you must pass by all the other food carts and treat yourself to this amazing lunch!"
  ]
 },
 {
  "name": "La Grotta Ristorante",
  "address": "529 E Broad St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/84f3eef8-9333-11ea-8676-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "delicious",
   "food",
   "knowledgeable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17713486208040596313",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely restaurant with multiple cozy spaces for dining. The staff was friendly and very knowledgeable about the menu and wine pairings. We had the wine dinner and we were not disappointed. The servings were large and every bite was delicious. We were dressed for a casual concert at The National and it wasn't an issue. We'll be back for sure! Thanks!",
   "La Grotta was recommended to us by a friend and boy are we glad that did. This is the quintessential Italian date night restaurant.  Great wine, pasta, and bread.  We had the ravioli with ricotta and spinach and a fettuccine with creamy tomato sauce. Both were so creamy and delicious, despite being full we ended up eating all of the food! It was a great meal and we will be back if we are ever back in Richmond.",
   "Upscale Italian restaurant in downtown Richmond, located at the neighbor of Hilton. You can use the parking lot on either side of the restaurant (remember to pay).\n\nThe restaurant is suitable for dinning from two to the group of around 40. You can choose 3, 4 or 5 dishes or just select your entree. I’ve tried seafood, beef and chicken, all are cooked with great texture and flavor. Different wine choices. The dessert is the best I’ve ever had in Richmond. Chef is from Italy.\n\nWaiters and waitresses are professional. They tried to understand your need and give helpful suggestions.\n\nReservation is recommended, especially if you have a big group or you are to take dinner. They have a view of the Broad Street.",
   "Awesome service, great food and great wine selection! Our server Carolina was fantastic! We asked her to pick out our meal for our 5 course dinner and she did an amazing job. She also recommended our wine which was great! Very knowledgeable staff and great food. A must try for any Italian lovers.",
   "First time here and we chose the 3 course wine menu.  It was great.  They paired a different wine with each course.  It was nice to try wines we otherwise might not select.  Food was fabulous and plentiful."
  ]
 },
 {
  "name": "Garnett's",
  "address": "2001 Park Ave, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/853edae4-9333-11ea-90ec-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "free",
   "food",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=6267985726756366818",
  "source": "GoogleMaps",
  "reviews": [
   "Another fantastic fan restaurant. Quaint but full of personality, the inside reminds me of an old soda bar. \n\nThey're missing a Reuben, but nobody can be perfect. Sandwiches, both hot and cold are all unequivocally great. If you're into salads, they've got some interesting ones there too. Grab a soup and a slice of cake before you head out. As of today, they have a great deal for a date night.",
   "As good as the reviews say it is, got \"The Manny\", next time will try \"The Teacher\". Great fresh food and great service.",
   "What a nice little, neighborhood sandwich shop.  You walk into the small restaurant and you feel like you're in your Grandma's house.  The food is fantastic, there are always seasonal soups that are off beat but delightful.  The sandwiches don't reinvent the wheel but they show you what a classic is supposed to be and do it better than anyone else.  To top it off, there's always a few options for desert (usually pies and cakes) which are top tier in the city.  Some of the deserts are even gluten free (for any of you with Celiac's) and you can't tell.  Go check this place out.",
   "Great cozy place, the sandwich was delicious (The Point Guard). And to top off the great experience, they had Modest Mouse's \"The Moon and Antarctica\" album playing. Can't beat that!",
   "Great little deli in the neighborhood. Fantastic sandwiches and salads. Potato salad is amazing. Large portions of meat on the sandwiches and they have nice happy hour specials. \nIf it’s a nice day it’s great to eat at the small park across the street!"
  ]
 },
 {
  "name": "Julep's New Southern Cuisine",
  "address": "420 E Grace St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/85bd331c-9333-11ea-885b-14b31f159f22.png",
  "tags": [
   "creative",
   "comforting",
   "food",
   "delicious",
   "walk",
   "kids",
   "family",
   "food",
   "drink",
   "delicious",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11527931627601803369",
  "source": "GoogleMaps",
  "reviews": [
   "We came for a special night out and loved it! The food was delicious and creative with enough of a comforting southern touch to let you know you’re still in Richmond. We had excellent service and can’t wait to visit again.",
   "I made a reservation online @12:42pm for a party of 6 for me and my family (4) kids. I received an email @4:32pm stating that the reservation was declined. I walk in not having any idea that a reservation can be declined. Fine that is my fault for not checking my email. However......the hostess makes a recommendation for me and my (4) kids to sit at the bar......like really? Been here 3 other times and absolutely love the flavor of the food. After this last episode though not sure if I’ll be returning.....the bar ma’am really???? With my (4) kids.....c’mon",
   "Nice place to go to relax.  Bartender was awesome and served drinks that were well made.  Only 1 TV is available here so not the best place to go to for watching sports while having a drink.  Happy hour prices were fairly good!",
   "I came here for Restaurant Week and made reservations. They asked if we could sit outside since they didn't have space inside and the weather was nice so we sat outside. It was fine but what bothered me was that bare tables outside were kinda dirty. They didn't wipe them down or anything. They would put new utensils on the table before each course but they put the utensils on the dirty table without a napkin or anything underneath. Also some  of the courses came out not hot. For example, I had the biscuits and gravy appetizer and the apple pie dessert and both came out very lukewarm/cold. I did not enjoy either. I did however get the shrimp and grits for my main course and that was delicious. I also thought the waiter was nice and always kept our water glasses full, but the girl who greeted us and sat us to the table was kind of rude.",
   "I had been meaning to go here for years, but last night was my first time. I was blown away by the service, the food, the chef, and the ambiance. I want to start with the hostess. Her outfit and demeanor was stunning with her pink dress and pearl necklace. So nice and polite and attentive. Then our waiter... so this guy... the class of this guy. Outstanding service all around from him. He even accommodated us when she said she couldn't eat the cornbread that came out first by giving us other options. The food came out later, and it was delicious. Fantastic shrimp and grits. Some of the best I've ever had, and definitely the spiciest. I was unaware I needed this in my life. I would happily come back here. Nothing but praise to the staff in all regards. Everyone should go. Now. Stop what you're doing and go. Even if they aren't open, just set up shop outside and wait til they do."
  ]
 },
 {
  "name": "Citizen",
  "address": "1203 E Main St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/861405ca-9333-11ea-a7e5-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "food",
   "delicious",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11288180026112275613",
  "source": "GoogleMaps",
  "reviews": [
   "The food is consistently good! Their soups are excellent. They are usually hearty, delicious and gluten-free. The homemade jams are unique and tasty. This is my favorite breakfast spot in downtown Richmond.",
   "I had the Disco Eggs w/ Avocado with squash salad as my side and a Thai iced coffee. Everything was so flavorful and cooked to perfection. The local eggs especially were amazing with delicious orange runny yokes. No pretentiousness here to my eyes but dishes that are executed to a level that many other higher priced establishments don't match.",
   "Awesome breakfast/brunch spot.  Good spot for Bloody Mary’s and laying down a solid base before hitting the breweries.  Very eclectic mix of breakfast options with amazing flavors, spices and taste.  Loved the Disco Eggs!  Go!  You won’t be disappointed!",
   "Great place for breakfast. I had the pupusas and beet soup. Both were extremely delicious. The staff is very friendly and the vibe here is very cool. I'll definitely come back here again. The staff told me this gem of a place is shutting down in March, so eat up, people!",
   "The food was amazing and nicely portioned.  Staff was quick and professional in terms of service.  Seating is difficult and your party must be complete before they will seat you."
  ]
 },
 {
  "name": "The Hard Shell",
  "address": "1411 E Cary St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8662c278-9333-11ea-8cff-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11863953875350174303",
  "source": "GoogleMaps",
  "reviews": [
   "Tasty food. We went for lunch.  The baked oyster and baked mussel appetizers are great. For light eaters, the 3 small crabcake appetizer is fine. She crab soup is tasty, get the small one, very rich. The shrimp and scallop is a bit light for the price, 3 shrimp, 2 scallops. Service, was not impressive, water and ice team refills required flagging down a waiter. If the photos I submit stay attached to this review, take a look at the building shots, the place is hard to find and they have a very small sign.",
   "Very nice place to spend an evening. The food is delicious, the waiters are attentive, and the location is really nice. I loved my scallops and shrimps, and my son's steak was great. The prices were also reasonable.\nThe only downside is the strong smell of seafood.",
   "Just ate lunch here and it was amazing! The service was fast and the food was incredible at reasonable prices. We shared the lobster dip and I had the lunch special of the day which was grilled salmon over Brussels sprouts, goat cheese, and strawberries in an apple cider vinaigrette. This might be our new go to lunch spot!",
   "The Hard Shell has a lovely setup! The atmosphere is light and great on a Sunday evening! A group of us experienced them for a birthday dinner. The food was good, the were minor adjustments needed, and a few of our meals had to much seasoning as we asked for our shrimp and scallops to be blackened. Our waitress was amazing and tended to our every need. Another staff assisted me with a different hand soap for the bathroom because the original one had an ingredient I'm allergic too. The only other thing to think about when planning your experience is keep in mind parking. Hope you enjoy your own experience!",
   "We dined here on a Saturday night and choose to enjoy their lovely outdoor seating. Service was good and their bread service was respectable. My friend ordered a steak that was over cooked and I ordered the she crab soup and scallop appetizer for my dinner. The soup was bland AF but had a fair amount of lump crab. The scallops were amazing and the three you are served are worth the $15 price tag. One thing to note, while passing by the kitchen to use the restroom I heard a kitchen staff member (Caucasian male with a full on beard) berating the wait staff on their lack of speediness to deliver food. There is a way to go about motivating someone and away from customers is the first step. Other than the scallops The Hard Shell is average and I would not dine here again."
  ]
 },
 {
  "name": "The Savory Grain",
  "address": "2043 W Broad St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/86a4fb7a-9333-11ea-aead-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13602417026112247316",
  "source": "GoogleMaps",
  "reviews": [
   "This is the best bar and in my opinion the only one that means anything in Richmond. The fries were great and the whiskey was not watered down. They had a guitarist who had acoustic and electric solo act who was incredible! And the people beside us had the best smelling dish with artichoke hearts. Would stop here again in a ❤️ beat. Great service and bartender!!!",
   "Lisa Adams reviewing. We had a business meeting here and it was great. We came in around 11:30 am and were seated in the back in a charming room that fit all 10 of us nicely. The menu is eclectic and since they make a lot of their food items fresh, it allowed me to ask for certain ingredients, which are not on my diet, to be withheld. They were quite accommodating. We had 3 appetizers with our meal and when we ran out of bread for our dip, they brought us more. Everyone seemed to enjoy their meals and the atmosphere. Parking at this time was easy. All in all, a wonderful experience.",
   "Great food great service. They checked allergens for one of my friends. And made my sister's birthday party pretty awesome.\n\n$5 burgers and bourbon. really awesome crab dip and Fried brussel sprouts as well.",
   "Great food and beer selection.  Much better than typical bar food.",
   "I ate here once.  The food is good.  I sat at a table and a person took my order.  I liked that too."
  ]
 },
 {
  "name": "Millie's Diner",
  "address": "2603 E Main St, Richmond, VA 23223, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/86fe8d7a-9333-11ea-9a8d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8574670865951826409",
  "source": "GoogleMaps",
  "reviews": [
   "Come on, Millie's has been a staple of Richmond for over 20 years at least.  have been multiple times.  Great food, made to order and always fresh.  Like that the menu changes, depending on what they are getting fresh that week.   The only really downfall that I can see is sometimes parking downtown and with a small cooking area, if they are busy food can take a little longer, but usually well worth the wait.  Thanks for good food through the years!",
   "I came with my wife and brother in law and the food was great! I got the Castro mess which was basically pork, eggs, beans, green peppers and cheese with home fries. The meal was fantastic! My wife got the eggs Benny which was really good. I would highly recommend this place. It's a little small so seating could take some time. We showed up with our whole party and got seated right away. The service was good as well. If you're in the area and looking for a great brunch spot check this place out!",
   "Our first time at Millie's was very good! We were promptly greeted in a friendly manner and seated quickly. Ally our server was great. I ordered the Eggs Benny with a side of grits. My friend ordered the Scrambled Eggs with Lobster. We split the Lemon Pound Cake & Lemon Curd. The food was delicious and we'll definitely return again.",
   "First diner/brunch place that came on my search when I was in town. Don't underestimate the size and looks of this place. This small little joint understands what flavors and seasonings are! The potatoes are amazing! I would have order another plate of it if I wasn't already overweight. Definitely on my list of top notch brunch restaurants.",
   "We were for team lunch and all of em like this small little cozy place tucked at end. Been here several times but for team it was mostly first for most of em. Food is really good, have to hit the place on time to avoid rush. They have street parking and also small dedicated parking right opposite over the hill adjacent to the gas station. I recommend this one and would go back soon."
  ]
 },
 {
  "name": "Comfort",
  "address": "200 W Broad St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/875fdb68-9333-11ea-acd4-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16354636683069018231",
  "source": "GoogleMaps",
  "reviews": [
   "Great food! I loved the Mac and cheese and the tofu jambalaya. We went here with a work group and I don’t think anyone was disappointed. My husband loved the collard greens and the catfish. I also usually dislike okra (the texture is not my favorite) but the okra at Comfort was really good and crunchy. A really pleasant surprise.\n(My only gripe would be that there was no changing table in the bathroom. My 4 month old and I made do with what was there, but it definitely took some finagling. I acknowledge that we’re probably not the target demographic but still it’s good to know if you have a baby with you and are going out in an attempt to feel like an adult person.)",
   "I will be sad to say goodbye to this RVA Institution.  That and all the good that Jason & Michelle have done for the community.",
   "Excellent fried catfish and veggies—including sweet-sour collards I could not stop eating, which is saying a lot for collards.  Our daughter works at a highly rated BBQ restaurant and she liked the pulled pork. The cornbread was not appealing at first but with butter is actually very good and is probably more authentic than the sweet, cake-y stuff we are used to. Velveeta fans will like the mac and cheese but it was not to our taste.  We stayed at the Quirk and Comfort is right across the street",
   "One word, Butter! I could taste it in all the food it was so delicious. Even the broccoli was covered in some butter. The corn bread was to die for. The staff was wonderful the restaurant was cute, I love how they serve their water in Mason jars.  The only complaint I have is with any restaurant, I am trying to watch my sugar intake and if the servers wouldn't take it so personally if I only asked for water. I get it you want to make as much money as possible in a restaurant and some customers are cheep, but please don't give anyone an awful look when they ask for water only. You don't know if they trying to watch out for there health.",
   "Was excited to share in the farewell dinner. Jason was a gracious host and every single bite of food was wonderful. What a beautiful send-off!"
  ]
 },
 {
  "name": "East Coast Provisions",
  "address": "3411 W Cary St, Richmond, VA 23221, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/87ae49a8-9333-11ea-ab25-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=13209674723397228949",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for seafood. Service was wonderful. They take reservations and the atmosphere is warm and inviting.",
   "I did not take pics of the entrees but the Burrata was absolutely perfect. The tomato jam brought the perfect amount of acidity and slight sweetness, the nuttiness from the pistachios were an outstanding touch and the slight bite from the micro greens really rounded things out. An absolute must try!",
   "We had a quiet corner upstairs, where we were able to have conversation. The food was good, and I especially enjoyed the colorful and fresh vegetables that garnished the plate.",
   "My very first time here. We had a small family gathering of eight of us and we all seemed to get something different. All the plates were empty, even after the large servings you receive. I had the simple egss, bacon, toast and potatoes. I eat my eggs sunny side up and they were perfect. The potatoes were delicious and the bacon scrumptious. I will definitely be back.",
   "Solid seafood spot sporting seasonal specials, spirits and such. Miso crab soup was a nicely rich entreé to more substantial dishes. Octopus was pretty good (mind the garlic) but the star on my visit was the PEI Mussels. Perfect. *ask for the bread grilled to hell and back tho*"
  ]
 },
 {
  "name": "The Tobacco Company Restaurant",
  "address": "1201 E Cary St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/87f84b38-9333-11ea-90d3-14b31f159f22.png",
  "tags": [
   "hospitable",
   "food",
   "food",
   "walk",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11210208283093704074",
  "source": "GoogleMaps",
  "reviews": [
   "I like going here after work. The bartender, Kelly, tries to really connect with frequent customers and I appreciate that! I’ve actually mentioned to her at work and others have mentioned how hospitable she is to them as well. The other bartenders are really amazing as well, but Kelly always seems to go above and beyond.\nDrinks are great...food is eh....but I’m usually only here for drinks.",
   "Food was good.  Needs some additional vegetarian entree options.",
   "I’ll start off by echoing the usual comments about the decor and atmosphere, this is an amazing place. I had nothing but great and attentive service the whole time as well. Great bartenders and one of the better martinis I’ve ever had. \nI was very surprised with the food, some people have told me that this is the part that is somewhat lacking but that was not my case. The salad and apps were amazing, and I had some of the best crab cakes ever. Tons of lump crab meat. My wife had a filet which was perfectly cooked and I had a few bites, it was a stellar steak. \nThis makes a great place for a special event or date.",
   "Beautiful and historical, 2 of my favorite combos. Staff is friendly and take time to walk around and check on the tables. The food was incredible, I had salmon and my friend had NY Strip. My friend asked for his meat to be rare. Initially he received a piece that was cooked too much. They took it back no questions asked and gave him a whole new piece, sides included again as well. He said it was the best piece of steak he ever had and it cut through like butter. Manager came by to check on the 2nd cut as well. Very happy that I got to experience a place of our history with amazing friends and food.",
   "Great place.  Drinks, light fare and ambience is some of the best in the city.  Courtney was very patient and accommodating to our group but I am disappointed in her not stopping my mother from attempting to embarrass me during my birthday through the band that night. Ha Will definitely swing by on my next stop in Richmond."
  ]
 },
 {
  "name": "LEVEL Restaurant & Bar",
  "address": "2007 W Broad St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/88435f38-9333-11ea-97d4-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11543713402525454881",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing vibe, really good drink choices. A little small so plan a reservation or sit at the bar. I'm a bar goer myself so the bar is just at good. The food is really well done and cooked pretty good, good flavors and good portions. Check this place out for a good date night In the RVA. Top place here in this beautiful city",
   "Best place in Richmond to eat sushi. They have a very cool bar, and the best staff they could buy. If you want fish in your mouth this is a place to go.",
   "Cool sushi place in downtown Richmond. We ate there while in town visiting. The ambience is cool including a bar that lights up when you touch it. The sushi was very good although it took quite a while to get it. Overall we were pleased and would return.",
   "The food was fresh and tasty. They had a variety of options. My daughter is a picky eater and she also enjoyed the food. The restaurant had a nice atmosphere as well. Will definitely go again.",
   "I don't know how other sushi places exist when you can go to Level. It's the best."
  ]
 },
 {
  "name": "Kitchen 64",
  "address": "3336 N Arthur Ashe Blvd, Richmond, VA 23227, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8892cc68-9333-11ea-aa63-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2225821935156100548",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped off here on our way north as it was highly reviewed and near the highway. It did not disappoint as it is very much an established local favorite. The food was delicious and service was great. It is a funky old style dinner with a huge menu selection. They have their own off street parking.",
   "Ample parking, Spacious and clean restaurant. Menu has a large selection. I opted for the sliders with cheese on a bed of fries. I was not impressed. The fries felt like there was no potato inside, and the burgers tasted like White Castle. The pickles were great. I wish I had opted for something else. The nachos seemed appetizing. \nThe friend I went with loved his burger of the day with fries.  The waitstaff is very friendly and attentive. \nOverall, not a “knock my socks off” experience. It was just average.",
   "This was our first time here. The food was good but the service was slow. No clean tables when we walked in. We were told to sit down at any table, so had to choose a dirty table and ask for it to be cleaned. It wasn't busy for a weekday so not sure why it was so slow to get service. I had the grilled zucchini and tomato sandwich which was delicious and my daughter had the pizza. It was okay. Bottom of pizza was soggy. We will try it again next time on that side of town.",
   "We came during the weekend for brunch. It's a nice location close to museums and the stadium. Price is right and the quantity was surprisingly generous. We will definitely come again.",
   "At first glance, this seems like a small, hole-in-wall place.  Done be fooled....this place is excellent.  I ordered the lamb chops, and I was very impressed. I am fairly picky about my meat and can't stand it overcooked.  They did a great job cooking it how I wanted.  It was moist and tender.  As well, the mixed vegetables were perfect. I live squash and zucchini, but I hate it when restaurants serve them over cooked, soggy and mushy.  These were nicely done, yet firm and crisp.  The staff was very pleasant and helpful.  I enjoyed my dinner and will definitely be back."
  ]
 },
 {
  "name": "Lunch. | Supper!",
  "address": "1213 Summit Ave, Richmond, VA 23230, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/88e384b8-9333-11ea-9327-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "unique",
   "tasting",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=6278520063202205726",
  "source": "GoogleMaps",
  "reviews": [
   "Had the Pickle and Fried Chicken Sandwich, friends had the Lions Den- both were delicious! Loved the outside covered area, beer garden. Will be back!",
   "Food was amazing. The drinks also hit the spot and we're very tasty. Lots of variety to choose from for everyone. The dinner side has the same menu as lunch, however, somethings were not included for breakfast/brunch time. Limited seating in both buildings, but there is an outside area to enjoy drinks.",
   "First visit, and I believe I was seated on the \"lunch\" side which is the smaller dining room to the right.   Got there around 2pm on a Saturday and it was busy but was able to be seated within 5 minutes.   Had the pork rinds and dip for an app and they were pretty good.  My entree was the Ferrytown sandwich, as I recall.   It was short rib meat topped with a small amount of macaroni and an onion ring.  Unique, but not all that great tasting.  The Texas toast bread was actually the best part.  Bathroom was tiny, had no paper towels.  Parking is a challenge.",
   "Showing my 22yr old niece Richmond and we stopped at Lunch, for lunch.  She thought it was one of the best meals she has ever had.  Atmosphere is great, we sat outside, had some good drinks and she tried some Ruby Red Moonshine, which she loved.  4 of us and we all enjoyed our meals.  I thought they had some very unique and southern blended menu items, like the pork rinds nachos, I want to give them a try.  Staff was attentive and friendly.  Will be going again.",
   "Winner! For lunch we shared some apps that were beyond good. Service was friendly, informed and spot on. Dinner has been excellent in the past and there is no disappointment for lunch. Treat yourself and friends. It is wonderful."
  ]
 },
 {
  "name": "ZZQ Texas Craft Barbeque",
  "address": "3201 W Moore St, Richmond, VA 23230, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/893638d4-9333-11ea-90ff-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "free",
   "food",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14167451885031456101",
  "source": "GoogleMaps",
  "reviews": [
   "Food was amazing. The options are great for whatever you want. Even the sides that we had were good. Everyone was very nice and welcoming as well. Will definitely be back to try some other meats with some more brisket.",
   "Best Brisket I've ever had! Collards were extremely flavorful and delicious. Red cabbage slaw was crunchy and fresh. Jalapeno mac & cheese was Awesome. I'm sure everyone in town already knows how good the food is, the other stand out is how well thought out this concept is. There is a cafeteria style serving line where guests can see how fresh and high quality the food is before purchasing. Free loaf bread is available to enjoy with your meal. At the end of the serving line I paid for my food and the cashier offered to leave my tab open so I could get drinks from the bar, so I didn't have to run multiple tabs. Within 10 minutes of entering I had my food, my drinks, a clean table, and was enjoying myself in a warm upbeat environment. The only thing I think ZZQ could do better would be to offer some more kid friendly options, my son felt like the mac & cheese was too spicy.(it's not that spicy) I went back to the serving line for a few more pieces of loaf bread and put some brisket on it and that was good for him. Great food, great experience, five stars, definitely going back.",
   "Incredible experience front to back. Being greeted at the door by one of the owners and having the process explained is truly a great opening hand. Drinks are offered while you wait in the long (without fail) line. Once you get to the counter, the staff are all smiles and offer samples for some of the dishes. Everything was delicious, tender, and flavorful. Quite easily the best barbecue I've ever had in my entire life. Believe the hype.",
   "I'm going to make this simple. ZZQ has the best brisket of all time. Not even exaggerating. Super nice spot with indoor and outdoor seating. They gave us samples of the brisket while we were in line. One of the owners stopped and spoke to us while we were waiting, and checked in on everybody in the dining room. Really enjoyed ourselves. They also have a well stocked bar with plenty of good spirits. If you're in Richmond and love BBQ this should be your first stop. Get there early though. The word is out and you don't want to get there after they run out. This place is so good we actually heard about it on a radio station in DC!",
   "The food here is hands down delicious. They know how to handle the meats. We drove really fast to get there... because that's just how good it is. Lines out the door.. but the wait is more than worth it. A little pricey $$$. About $20 a person."
  ]
 },
 {
  "name": "Sabai",
  "address": "2727 W Broad St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/898b0ff6-9333-11ea-a25e-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "unique",
   "food",
   "delicious",
   "food",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=14565758680540498179",
  "source": "GoogleMaps",
  "reviews": [
   "Went for a late night drink and was blown away! Limited late night options but the calamari was perfect as well as the tangy sauce that went with it. The vibe on the inside is very chill and peaceful. Nice place to sit and have a good conversation with a friend. I had the \"what lurks beneath\". Be prepared to drop some good money on your drink but the presentation and quality is well worth it.",
   "Delightfully fresh Thai food on Broad Street. The curries were incredible, as was the decor... fresh plants dripping from the industrial ceiling, accented by tons of bright wood tables and seating. Staff was friendly and fast. I can’t recommend this place enough!",
   "Excellent service waiter was very responsive to whatever we needed. Atmosphere is airy and hip lots of cool plants hanging around and they have a swinging table which is unique. Food comes in huge portions two people could probably split one thing unless you’re in collage and broke then you might wanna order two. Bathrooms are really cool and you can just tell in general that they put a lot of effort into the small things in this restaurant. Was very impressed and would absolutely return.",
   "Probably one of the best Thai food places I have had in Virginia and definitely the best in Richmond. 🤩 \n\nBeautiful ambience, street views are amazing, terrific spicy basil fried rice and delicious ginger chicken",
   "This was my first time trying Thai food and boy they did not disappoint! I loved it all. The service, the vibe and the food were great! They have a parking lot but it's small but there are places to park that is in walking distance. I will be going back!"
  ]
 },
 {
  "name": "Wong Gonzalez",
  "address": "412 E Grace St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/89d18ecc-9333-11ea-aac4-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3073839460541619469",
  "source": "GoogleMaps",
  "reviews": [
   "What a cool place! I can definitely say I've never tried anything like it and was not disappointed. They had a pretty large selection of drinks and the house margaritas still seemed very high quality. The food was really good and had a nice balance of the Latin and Asian flavors.",
   "Excellent all around experience. Friendly and attentive service, straightforward menu and ordering process. Food did not take long to come out. We got the fried chicken burrito and the bulgogi burrito. Highly recommended, will be coming back.",
   "I hate we popped in here for a quick lunch, because  I would have enjoyed staying a while and people watching.   My food was delicious and the service was quite enjoyable.   My cocktail was just what the doctor ordered on this busy day.  Absolutely take the time to read the whole menu before ordering because there are so many yummy options and you can’t go wrong with the specials.  \nDefinitely will enjoy Wong Gonzalez again the next time I’m in Richmond.\nXoxo Lorenzo",
   "The food is amazing!!! So many options and small enough to try a few different things. Also very reasonable prices and it's such a nice atmosphere. It is a small place so reservations are the way to go but a seat at the bar was cozy and perfect.",
   "Tacos pretty good. The old fashioned was one of the best. They offer Blanton's!"
  ]
 },
 {
  "name": "Ipanema Cafe",
  "address": "917 W Grace St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8a398842-9333-11ea-b48f-14b31f159f22.png",
  "tags": [
   "food",
   "free",
   "food",
   "food",
   "delicious",
   "family",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=554257138522997177",
  "source": "GoogleMaps",
  "reviews": [
   "We stopped in as we were passing through town and my partner and I really enjoyed our experience. The food was great. The menu was clear and easy to understand what was vegan and what was vegetarian (those vegetarian items are all possible to be made vegan). They were sadly out of some really attractive menu options that night but it was late and understandable. Service was very nice and friendly. We felt very cozy in the space too. Great for long dinners and conversations.",
   "Cool underground atmosphere at night. Helpful staff, and very accommodating for vegan and gluten free needs. The food is a bit expensive and tastes good... For vegan food.\n\nPictured is the sweet potato fries, the okonomiyaki-style vegetable pancake (I would recommend this), and an oyster-mushroom steak (would not recommend this).\n\nExtra tidbit: Ipanema is the name of a neighborhood in Rio, and the restaurant bears the name because the owner liked the song \"Girl from Ipanema\"",
   "A vegetarian and vegan eatery that is always a good trip. It is situated in a basement and on the VCU campus and a consistently rotating menu. Portions are a little small but they will always be good! I strongly recommend getting a pot of the vanilla tea to go with your meal too! They will drop off a whole kettle and small cups so you can keep refilling.",
   "Cool, lowly lit inside with booths and nice bar area. I’m a carnie and thought the food was fantastic. Recommend the jackfruit mushroom dip and the Beyond Burger. Went for lunch on a Thursday and easily got a seat.",
   "I was welcomed warmly by the hostess as soon as I entered into this hidden gem. With my new years resolution of eating better it was great to find a vegetarian place that was affordable. I came alone and was greeted by the bartender who was very friendly while I sipped on the delicious house red wine. I ordered a beyond burger with sweet potato fries and they were both cook immaculately and soothed my taste buds. While eating the owner stopped by and asked about my experience and started a brief conversation with me which made me feel like family. I will for sure be back for more in the future. The atmosphere, food, drinks, and staff were splendid and made my evening amazing. Thank you Inpanema."
  ]
 },
 {
  "name": "Maple & Pine Restaurant",
  "address": "201 W Broad St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8a7cfa10-9333-11ea-b071-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "affordable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6861513853507569088",
  "source": "GoogleMaps",
  "reviews": [
   "The setting is amazing. Lots of nice people around. The food was ok service was excellent. If you have a first date, this is definitely the place to come. I would definitely be coming back for the food and the setting. Also you can go up to the rooftop for a cocktail and the ambiance is like Miami.",
   "Nice, bougie place. The decor is very nice and the food and service is also good. If we are talking fine dining in Richmond  there are better options for better food. You just have to know why you are coming to Maple and Pine for.",
   "I’ve been here numerous times and always received great service and food but didn’t know they could do even better! I made a reservation for my friend’s birthday the day of and they made a special menu for her with champagne waiting and it truly made her and my day! The staff were friendly and the food was amazing. I was already planning to return but I may have to make this place a part of my routine because the service was phenomenal. Thank you all for an amazing time! We all plan to return soon.",
   "Maple & Pine Restaurant, located in the Quirk Hotel, was a great experience. The ambiance is more reminiscent of a restaurant in Miami Beach than Richmond. It made me feel right at home. A simple and affordable one page menu, which had a nice selection of paninis, entrees, salads and starters, made selection a breeze. I had the chicken curry and noodles, which had spices and hints of coconut. I will definitely visit again and highly recommend to others.",
   "I wouldn't go there again for a romantic dinner for two, since it is a busy lobby/bar with close seating arrangement. Also the doors are a little drafty. But the food was great and reasonable priced. Staff was nice as well."
  ]
 },
 {
  "name": "Cafe Rustika",
  "address": "414 E Main St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8abdfab4-9333-11ea-a1fa-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7501815113187984321",
  "source": "GoogleMaps",
  "reviews": [
   "Pleasantly pleased!  Space is small but warm and cozy with a relaxed, friendly atmosphere.  Food was delicious and German authentic.  I had marinated beef with egg noodles and cucumber salad and was blown away.  The beef was melt in your mouth out of this world and I could slice with my fork.  The egg noodles were spectacular for just being egg noodles and butter and the cucumber salad was just as good!  Good wine and beer selection. Oh, and the home made bread is excellent!",
   "The reviews did not disappoint. European pub ambience, delightful German beer and food. Sumptuous serving sizes as well. The sides were just as good as entrees",
   "First time dining here, and it was a great. Small place with limited seating however its cozy. They have a nice beer and wine selection. We had the schnitzel with a couple sides. The food was very authentic German. The meals are very reasonably priced. I definitely will back. Thanks Mike.",
   "From the moment I walked in the door, I knew I would love this place. Met with a warm welcome and a sense of pride for the culinary delights I was about to experience. Solid selection of German imports and wine to start. The menu is full of all the favorites and everything sounds delicious. The portions are overly generous and full of flavor. I would have no problem saying this is the best German food in Richmond, and probably the region.",
   "German food in the heart of Richmond! They have several different schnitzel options as well as other items (bratwurst, sausages, etc) that we found to be very good. The schnitzel can be pork, chicken, or veal depending on what you like. The only vegetarian main was a spatzel option that is basically “German mac and cheese” it is a lot of the same flavor by itself but also pretty delicious."
  ]
 },
 {
  "name": "Little Nickel",
  "address": "4702 Forest Hill Ave, Richmond, VA 23225, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8b01e1b8-9333-11ea-96e5-14b31f159f22.png",
  "tags": [
   "foodie",
   "food",
   "delicious",
   "creative",
   "affordable",
   "kids",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6907967727519365578",
  "source": "GoogleMaps",
  "reviews": [
   "I'm in love! The menu here is obviously created by a true \"foodie\" - the flavor combinations are spectacular! If you haven't tried eating here yet, do yourself a favor and go right now! We've only been once, but we have vowed to keep going back until we've tried everything on the menu.",
   "What a gem that Richmond has gained! From the cocktails to the appetizers and desserts to the entrees, I was beyond impressed with what Little Nickel brought to the table. The shining star of this place, besides the incredibly friendly staff, is the remarkable attention to detail in the restaurant decor. It was adorable, lux and weaved such a lovely vibe. You should just drop everything and go here now. You won’t regret it!",
   "An eclectic restaurant in both style and substance, with a creative, tasty menu, fast and friendly service, and affordable prices (though drinks can add up quick). The menu seems to find inspiration from all corners of the world, and you're bound to find something tasty and inspiring here. The kids menu is a bit typical, which is probably a good thing because your kid will need to have a willingness to push their boundaries if they will be sharing a plate with you. The service is awesome. A 10 minute wait was really 2, and our waitress made sure my daughter had crayons and was overall just wonderfully nice. The food came out quick, was hot and delicious, and portions were giant. Everything we had was great. The restaurant is decorated with an island retro flair. You'll find lots to look at. The bar is particularly interesting. Overall, great!",
   "Little Nickel is unashamed of their love of Hawaiian shirts. You have to appreciate that!  Everything I tried was thoughtfully flavorful and delicious.  I’m still thinking about the special from last night: fried risotto balls with a roasted pepper sauce.",
   "This definitely a spot to check out. It's warm  and quaint with an eclectic vibe. Although slightly pricey, they have fun drinks.  The food is delicious, the portions are generous and curiously better prices than the drinks in my opinion. The staff listens and caters to the patron's need. If you are looking for a new fun place to dine in Richmond, check them out."
  ]
 },
 {
  "name": "Peter Chang",
  "address": "2816 W Broad St A, Richmond, VA 23230, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8b4fdcc0-9333-11ea-aa22-14b31f159f22.png",
  "tags": [
   "unique",
   "family",
   "food",
   "food",
   "walking",
   "unique",
   "free",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11983415462827802980",
  "source": "GoogleMaps",
  "reviews": [
   "The food is just fantastic! They have a lot of unique in new variations on the Chinese food. Most is served family style so it's kind of cool that everyone can order something different and then you can try different things. The staff is very helpful in selecting in answering any questions. The food comes extremely quick, except for a few things. We ordered some soup bones and the waitress told us they would take about 20 minutes for them to come out. I've been here a few times I've always enjoyed the food, and haven't had a bad experience yet. Would highly recommend!",
   "Food tasted great and the restaurant had a good vibe.  The menu was smaller than the one in Williamsburg but still good.  I took 2 stars away because of parking. There is about 4 spots in front but if you don't get those wear walking shoes and don't park in the empty lot next door because they tow or charge $10",
   "This place has flavorful and unique foods. Everything is not only beautifully seasoned but also well presented. The meat eaters of the group strongly recommend the crispy pork belly appetizer, and we all loved the novelty of the bubble pancake.",
   "We moved here from Northern Va a year ago and tried Scots edition Peter Chang. So good!  The menu recently changed and there seems to be way fewer options, which is fine. I like that anything on the menu (just about) can be made gluten free. The restaurant interior decor is colorful, vibrant, and festive, and they also offer quick and easy take out if you prefer.",
   "I love this restaurant. The food is amazing. Friendly servers, clean environment, and delicious food. What more could you ask for? Have a blessed day...."
  ]
 },
 {
  "name": "Morton's The Steakhouse",
  "address": "111 Virginia St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8b9485b6-9333-11ea-8faa-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10371846614046070675",
  "source": "GoogleMaps",
  "reviews": [
   "Mary and I enjoyed the entire dining experience. Our server was excellent. The dishes were delicious. The ambiance... what can I say... it's Morton's! You pay for the ambiance and it's worth it.\nI hope we can return soon. Life is short - so enjoy it!",
   "Ordered the Easter special for takeout and it was delicious. The filet and lobster tail were excellent and the creamed spinach and shrimp cocktail portions were huge. Alex took my order over the phone earlier in the day and it was ready later in the day when I arrived to pick it up. Alex brought the order out to my truck and I was on my way.  Can’t wait to return when my wife and I can enjoy the entire restaurant experience.",
   "I made reservations to celebrate my birthday and engagement. They made special menus and took pictures. They moved the table so we didn't have to slide into the booth. Warm greetings all night. The waitress knew the menu and the steak was the best we ever ate. We will definitely return to this location. Loved the ambiance.",
   "Lived up to expectations. Despite having a glass of wine spilled by the server (quickly replaced), and a bit of a delay on dessert (prompt dessert drinks), it was spectacular. Knowledgeable courteous wait staff, perfectly seasoned and prepared dishes. The price and experience are intertwined.",
   "We ordered take out Easter Sunday. What a staggering disappointment. The cost was $175 for meal for 4. Creamed spinach, potatoes au grotten,  2 small Caesar salads, 2 small steaks, a new York strip and lamb medallions, 4 cheesecake slices. Hardly enough food for 4 people. Worst of all the steaks and lamb were raw. Had to be cooked! We had to order pizza to feed everyone. Never again."
  ]
 },
 {
  "name": "True's Cultural Kitchen",
  "address": "415 W Grace St ste a, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8c0ac768-9333-11ea-9b0a-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "delicious",
   "free",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5224369767819203985",
  "source": "GoogleMaps",
  "reviews": [
   "I tried this spot after hearing about their vegan options through social media. I was not disappointed. I got the curried potatoes and chickpeas. A little hot! But delicious. What I’m here to spread the good word about, though, is THAT SPINACH PATTY. That was the best thing I’ve ever put in my mouth! Perfectly chewy but crispy patty, filled with deliciously cooked spinach. The perfect balance of spices and texture. They KILLED IT. I want to eat 5 for every meal. I can’t wait to go back. Last but not least, the hospitality is outstanding. I’ve communicated with the owner over social media and have been astounded by the responsiveness, honesty, and gratitude. I am so happy to support this local spot.",
   "First impressions mean a lot and True's Cultural Kitchen gets 5 stars in every category!!! The customer service is by far the best I've had in a long time. The young woman taking our \"to go\" order explained there was only one cook today and there would be a slight wait...others that were waiting longer than I, were offered free beverages.  She was courteous and responsive, nicely dressed, too.  The place was clean and neat.  The food was absolutely Amazing!!  I ordered a vegan dish called Honey Hennessy Stir Fry...sooo delicious. My friend had the Veggie Tacos, which looked out of this world scrumptious!!!  I will certainly be a regular 🤗🤗🤗🤗🤗",
   "I’ve always had a FANTASTIC experience at True’s. The staff is always friendly, the food is out of this world amazing, and the drinks are delicious. What more could you ask for? As a person who is leaning more towards plant based options, trues has an amazing selection of vegan foods which are delicious. The stir fry, the salmon, the patties...everything I’ve tried has been a hit.",
   "I had my first experience with True’s cultural kitchen at the Stick a Fork in it event this weekend. I have sadly been missing out of this gem since it opened and I have truly been missing out. As a vegan, I was excited to see a variety of plant-based options available. And it did not disappoint, the vegan Mac and the African fried spinach were a delicious experience and I hope these items will be a mainstay on the menu. I look forward to the next opportunity to visit True’s Cultural Kitchen and allow my taste buds to be blessed again!",
   "The food was made to order and very fresh. All of our entrees and sides had really good flavor and was not salty👍🏽. I look forward to trying more entrees the next time."
  ]
 },
 {
  "name": "Helen’s Restaurant",
  "address": "2527 W Main St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8c97ece8-9333-11ea-af73-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "walk",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=613900015520894865",
  "source": "GoogleMaps",
  "reviews": [
   "I stumbled across this place by one happy accident and I will forever be grateful Brunch was packed and it was raining. I ordered the chicken biscuit and it was so delicious I had some sort of out of body experience where I forgot where I was and showed zero shame whilst licking my fingers in the middle of a crowded restaurant. It's the perfect blend of sweet, savory and spicy. It's heaven. The curry potatoes are perfectly spiced. The service is the perfect blend of attentive and leave you alone. The guys in the kitchen are insanely talented and focused. With good reason, the food coming out of it is perfection. 20/10 will totally go again!",
   "Fantastic, super cute, delicious. Had the bay Benedict and my eggs were perfect. Curry potatoes were also so good. Highly recommend",
   "It was little things that spoiled the visit. No one seemed to be in charge of greeting and seating guests. We were seated quickly after I asked.The Breakfast BLT was fine as were the curried potatoes. The The Chicken Biscuit was not. A thin piece of chicken stuck in the middle of lots of breading which was fried just shy of inedible.  Plus the honey pepper bacon was so heavy on the black pepper that I could still taste it 15 minutes later.  Two sandwiches and one glass of ice tea for $29 would feel a little high under normal circumstances. When one of the sandwiches was was as poor as this one, we weren't impressed. Nothing wrong with the vibe or the decor, but with as many choices as there are in RVA, it's not likely we'll be back.",
   "I had a $14 tab.  I had a $50 bill I needed to break.  It was a Friday night.  They couldn't break it.  I paid for my tab on my card and they gave me $25 back.  They basically stole $25 from me.  I didn't tip because of that. I'm never going back",
   "My friend and I went here on the 11th of March, around 8pm. We walk in, request a booth and the waiter (male, around 25 or so) immediately told us we couldn't have a booth because it was for dinners only. We didnt even get the chance to tell him we wanted food too. Naybe he got the impression we were there to drink and nothing else, that wasn't the case at all. No big deal, we said we'd sit on the bar side. He wouldn't even guide us to a table or tell us to sit where we wanted. The whole time his body language was very hostile, he was abrupt and rude. We ordered a drink but decided to go someplace else where the atmosphere wasn't so negative.\n\nMaybe he has person things going on at home, or maybe his previous guests were rude and he was projecting his anger. Regardless, the way he treated us was unacceptable. We won't be going back, there are ample amounts of restaurants in Carytown. You lost a potential regular customer that night."
  ]
 },
 {
  "name": "McLeans Restaurant",
  "address": "3205 W Broad St, Richmond, VA 23230, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8d44821e-9333-11ea-a551-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4660069247983360598",
  "source": "GoogleMaps",
  "reviews": [
   "So my order was given to someone else and I still can’t understand because when you call in an order they take your name and also they charge way to many taxes to customers one in particular being the carry out tax which I feel since it is not an option to dine in at this time the customer shouldn’t have to be taxed. I cannot wait for City Diner to reopen. Good food, fast service at good prices. BRUNCH is my number one favorite but they are also closed.",
   "The food was delicious!!  Well seasoned and good sized portions.  Efficient and kind staff.👍🏽🍽🥰  And seated within 5 minutes.  We should have been in sooner, but we'll be back often!!",
   "Great food, kind and friendly staff. Very welcoming atmosphere!  We had a small group  and everyone was very accommodating.  Great experience overall, we'll keep coming back!",
   "Great local gem, food is good and service is always above and beyond",
   "Elaine placed several orders for me over the phone. She was very polite and accurate. When I arrived the food was ready and I was in and out.... she’s a great asset to your team... food was delicious as well..."
  ]
 },
 {
  "name": "Alewife",
  "address": "3120 E Marshall St, Richmond, VA 23223, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8dc21824-9333-11ea-a291-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "walking",
   "food",
   "creative",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1538459407818252098",
  "source": "GoogleMaps",
  "reviews": [
   "We have been to Alewife a handful of times without making a reservation. Talk about getting lucky multiple times with walking into a table that just emptied or an open spot at the bar!! If you want to experience this awesome restaurant and don't want to take any chances MAKE A RESERVATION. I say that because Alewife is no longer a secret and everyone knows the quality of this place. The dishes and cocktails are fresh, tasty and well prepared!! The staff is always on point and Alewife's menu and drink list has looked amazing every time we have gone in. The plating of Alewife's dishes are always beautifully done and the food tastes like perfection! We must return after this pandemic.",
   "We went to this cool restaurant on Easter Sunday last year and our meal was divine. The service was pleasant, efficient and not too over the top. Love the open concept and the ability to see the chef at work. I have missed being able to go into the restaurant and can’t wait to return as soon as possible.",
   "Had a great meal here with my wife.  We had a table in the window, prompt & professional service & perfectly paced delivery.  The food was fantastic.  The menu is seasonal and always changing. They had seven non-alcoholic beverage options on their bar menu!",
   "I don't know where to start with Alewife. The reviews have been expansive in their praise for Chef Lee's latest project and we went with high expectations. After loving The Roosevelt and Southbound, we hoped Alewife would live up. As usual, Lee's creativity was the surprising thing. He's taken the menu in a different direction but the common thread with the other projects is that creativity. We had an array of appetizers and then somehow managed main dishes too, with some effort as we had already tried so many amazing things. It's so new but it looks like it will be a neighborhood gem for years to come. The recipe is fresh fresh fresh, Chesapeake, Virginia, fresh again, with a heavy dose of creative. 5 stars.",
   "First of all Tony and Andon at the bar were superb! Blown away! This place rocks! Great vibes. The food is amazing! The crab claws, tomato salad, shrimp and oysters were outstanding! One of the FEW 5 star reviews. Its takes a lot to get 5 real stars and Lee Gregory gets them all. The staff was great, food out of this world. Fried oysters to die for! Homemade hot sauce that stays with you. AMAZING!"
  ]
 },
 {
  "name": "Parterre Restaurant",
  "address": "100 E Franklin St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8e25bb06-9333-11ea-835c-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "drink",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17227451493157736838",
  "source": "GoogleMaps",
  "reviews": [
   "I attended a conference at the convention center fall 2019 and enjoyed dinner by myself at Parterre afterward. Of course, the Poe reference on the sidewalk chalkboard piqued my interest! It is comfortable and at the same time clean and sophisticated. I was greeted promptly for dinner. I have special dietary needs and they were able to advise me on what I could eat on the menu. The menu was a mix of modern and classics. I had a well seasoned shrimp and grits and iced tea. I would definitely eat here again if I'm in downtown Richmond for lunch or dinner :)",
   "Pretty setting and prices were good. The dish we ordered was not good. Sausage gravy was under seasoned. The tater tots were over seasoned (too salty). The egg was ordered over easy and came out overcooked and rubbery. The menu states two biscuits with the sausage gravy. It looked like one cut in half. Waitress was nice, and did take the egg off the bill.",
   "Good evening I just needed to say that Parterre Restaurant is absolutely excellent hospitality so friendly and very welcoming this morning I came in for coffee they were so sweet and kind I asked them about their menu as I was waiting they explain the menu you showed me the menu so I was able to come other times to explore their wonderful Hospitality with the other menus lunch and dinner looks like Excellent food on both of the they seem to have almost everything you would want to try and I had the opportunity to to experience the Hospitality with Celeste 👌🏾and Jess👌🏾 absolutely warm and inviting Wonderful Hospitality I came back and had an appetizer and drink this morning I got veggie wrap it was actually made with tofu and it was delicious with vegetables peppers and onions and so forth and potatoes delicious please come and try them you will always come back the place is so cozy the decor is absolutely beautiful beautiful wood decoreven if it's a beautiful day you have outside patio which is absolutely beautiful as well just so inviting Love love love 🙏🏾💝🤗👌🏾",
   "I stopped in for an early afternoon meal with my wife. We live in the neighborhood, but it was our first time visiting. It won't be our last. Everything that we had was fantastic. The entire staff was warm and inviting. I was really impressed with the happy hour selections. What a great place.",
   "This place is awesome. I frequent this outstanding hotel the Lindon Row Inn that resides adjacent to this restaraunt.  The strawberry pound cake coffee is very good.  Admittedly I do not smell strawberries.  After plunging my epinephrine into my thigh due to an allergy to strawberries.... I tried the red wine.  Unfortunately grapes and strawberries reside in the same family.  Just kidding.  This place has great charm and street access close to broad street.  Very good food.  The fried chicken looks like a turkey dinner.  The staff is very friendly.  And we can all confess that this is what's missing from good service.  Combined with quality it's a refreshing experience.  No hipster douches or beef tartar here."
  ]
 },
 {
  "name": "Brunch...",
  "address": "2600 W Main St, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8e93e8a2-9333-11ea-a1e1-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "drink",
   "art",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12611962426894331335",
  "source": "GoogleMaps",
  "reviews": [
   "I went to Brunch for the first time today and LOVED my meal. I was pleasantly surprised by the amount and kinds of breakfast they offered. The space was lively and full of plants! The food was delicious; I had the Happy Herbivore bowl and a side of the seasonal fruit with a cup of coffee. I loved every bite! The staff was kind and helpful as well!",
   "Very good atmosphere. Sitting up towards the front where the sunlight can come in the skylight makes it even better. We of course had brunch and it was superb! I ordered the Waffle Flight because I couldn't pick just one of the types that they offered. I also had a side of Breakfast Sausage. The waffles were amazing and each came with a sample of the butter or syrup they are normally served with. This was definitely a pleasant twist on a typical breakfast staple. They even managed to revamp the typical sausage links. The breakfast sausage was clearly hand made ground sausage made into patties. If I am visiting Richmond again this place will definitely be one of my stops! Don't think twice. Just do it!",
   "Possibly the best breakfast in Richmond. I went with my wife for a breakfast in honor of a special day. Everything we ordered was delicious and well presented. I had the waffle flight and an espresso drink. The drink was well made with art and the waffles were well presented and delicious. It's a pretty popular place so you might have to wait 15 minutes or so to get a seat. The staff is friendly, well trained, and courteous. I definitely recommend this for any of your needs for a great breakfast.",
   "Killer pancakes and Monte Cristo, with a delightful atmosphere and wonderfully helpful and attentive staff. The mimosas are splendid and the food is delicious. Highly recommended, but do prepare to wait on a Sunday morning",
   "We went for brunch and I had a party of 7 and a hour wait and I would wait an hour again!!!! The service was awesome the food was amazing. Ms. Jacqueline helped our party get seated and Luke was our server. His recommendations for our meal was EVERYTHING! It was our first time in this wonderful resturant so we asked a million questions and he answered all with no problems. He told us his favorite dishes and he was spot on about everything. I plan on going back really soon and bringing more friends. This was such a wonderful dining experience!"
  ]
 },
 {
  "name": "Restaurant Adarra",
  "address": "618 N 1st St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8f0bfdec-9333-11ea-aaab-14b31f159f22.png",
  "tags": [
   "drink",
   "unique",
   "art",
   "food",
   "drink",
   "knowledgeable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1125890491680584162",
  "source": "GoogleMaps",
  "reviews": [
   "Experience: Home-run both time we were there. 👍🏼\n\nLocated in Jackson ward, close to the art infused neighborhoods along W Broad St, Restaurant Adarra feels like a house on the street that happens to serve food. It’s presence highlighting the sense of community that you see in many places around Richmond (think Sub Rosa on Churchill).\n\nOn the eye: Being Basque-inspired meant some of the menus are tapa-like — in smaller bowls and plates that forms a picture of adventure, bringing delight for the diner. Colors are never dull nor added without purpose, most distinct would be the different peppers and beans.\n\nTaste: labeled as Modern European, it shakes off any potential “New American” branding in its carefully curated dishes — crafting flavors that are unique to the region and yet carries with it an air of creativity. Many bringing out wonderful flavors without being stingy on the portion, allowing you to taste and fully enjoy each plate.\n\nDrinks: Cava is the “champagne” of the land and it’s presence is indicative of their priority — a drink menu focused on imports from Spain that draws a great authentic undertone for the meal.\n\nService: The service were casual yet confident. On both visits we were impressed by the knowledge of the server with both the food and drink menus. It’s hard to miss their pride in the restaurant and all that it provides.\n\nDefinitely a gem in Richmond.",
   "Celebrated a birthday dinner on a Saturday night.  Our meal was excellent, more enjoyable while sharing.  Service was slightly under expectations, and just shy of attentive.  It took a good 10 minutes before a server approached us for drink orders and also rambled unintelligibly though the specials, my partner had to ask for a refill of a beverage twice, and it was noticeable that regular patrons received a ton of attention but the rest of us not so much.  But generally, we had a good experience.",
   "We had an excellent dinner at Restaurant Adarra. The menu is made up of small plates that can be shared. This is great as it allows you to try multiple things from the menu. We had a group of four and got to sample a pretty good portion of the dishes. The flavors were amazing and everything was pretty good. The skate and rabbit really stood out in particular.\n\nWhile I was extremely pleased with the food, the cocktails were possibly even more impressive. The Little Italy was my favorite, by far, but I would highly recommend talking to the bartender about what kinds of things you like and then letting him come up with a concoction based upon those preferences. I tried a few different things and liked them all. the bartender was very knowledgeable and seemed to be able to get a good feel of what I would enjoy.\n\nThe restaurant is very small, so reservations might be hard to come by, especially on short notice. This isn't usually an issue for us as we enjoy sitting at the bar. However, the night we were there, they were giving out the corner section of the bar as a reservation. This really cuts down on the number of bar seats available for walk-ups and was an unwelcome surprise. Definitely not a deal-breaker, but something to be aware of if you can't get a reservation and it looks like there might be space at the bar.\n\nOverall, we had a great time and would definitely return.",
   "Super food, great decor and atmosphere. Staff and owners were friendly and great. One of the best in Richmond. Can’t recommend enough! Will be back for sure.",
   "Chef Doetzer never disappoints. You can't go wrong with anything on the menu. Make sure to ask for the perfect wine for pairing"
  ]
 },
 {
  "name": "Perch",
  "address": "2918 W Broad St, Richmond, VA 23230, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8f671690-9333-11ea-b43c-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "delicious",
   "food",
   "eat",
   "food",
   "tour",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11145722429761153255",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing service!  Sunday Brunch was a wonderful experience.  Brought a group of friends to celebrate one of their birthday.  The chef cooked an awesome non menu item special for her and it was incredible.   Everyone else ordered from the menu and the food did not disappoint.  Live tiki lounge music was great and relaxing.  Great time!",
   "Fantastic cocktails and fancy menu. Hip space up front but the back room (which may be good for a small party) doesn’t have the same vibe - feels a bit stuffier and more old fashioned than the vibrant front area. Got the heirloom tomato salad and PayPal salad - both lacked greens. Probably overlooked that on the menu but it was a bit unexpected. Great interior design and service was pretty good.",
   "If I could give 6 stars  I would. The food was fantastic; the servers were amazing. In addition, I have multiple food allergies (soy, dairy & gluten). When I arrived, I told them the allergies. When I sat down, they brought over a customized menu which included the chefs adaptations to remove any of my allergens. No restaurant has ever been able to customize so many menu items. I was in food heaven!  An unquestionably delicious meal.",
   "Oh my! There are no words to describe the culinary genius that is PERCH but I will try. We had the whole fish and the special, rock fish. The flavors were amazing, they just exploded on your tongue! The decor is very pleasing to the eye and it compliments the type of food beautifully. My advice is to make time and eat at PERCH! We are praying that Perch will expand and come to Charlotte. Until then we will have to visit Richmond more often!",
   "Each time I come to Perch, the experience amazes me. The first time we sat at the chefs table and were treated to several things to try, a lovely conversation with the chef and the folks working in the kitchen, and were served amazing food (the duck pizza, calamari, oysters were all incredible). The second time was for a friends birthday and again, the chef and staff treated us like we were royalty. They gave my friends a tour (I was late) and gave them some things to try, the service was spot on, refills without asking, never having to wait for our wait staff.  Then we were served a couple desserts for our friends birthday which were absolutely amazing. I can't get enough of this place. It's worth a visit or 10. HIGHLY RECOMMEND!!!  I wish more restaurants would take note from how Perch does business."
  ]
 },
 {
  "name": "Crafted",
  "address": "4900 Libbie Mill E Blvd, Richmond, VA 23230, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/8ff1a49a-9333-11ea-be3f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=3725123549759856677",
  "source": "GoogleMaps",
  "reviews": [
   "Service was excellent.  And the food was delicious. I didn't give 5 stars because I requested a \"seasonal\" cocktail that was not in season and they were unable to make.  But the seasonal cocktail i did order was very good! 3/4 of us at our table loved our meal! I recommend the pimento cheese for a starter, crab soup, the country pig salad, and the blackberry chop!!",
   "Cute space, great staff, yummy food.  The staff were very helpful and attentive.  Food was good.  The Southern Gentleman burger is delicious and indulgent.  Biscuits are fluffy and soft.",
   "Get the Lady Bird. Let me say it is the best chicken sandwich I’ve had in a long time. Cooked to perfection and the potato wedges were perfectly crisp. Staff is considerate and keeps a clean establishment. I will be coming back again and again for that sandwich!",
   "Picked up lunch this week. Super friendly staff (Jaymie and Justin) quickly had my order perfect and the cold crowler ready to go. Definitely recommend the Beef n cheddar with wedges! That cheese sauce was da bomb! Got the Korean and dry rub wings; both were delicious. Love the draft list! Can’t wait to go back! New fave spot!",
   "Great neighborhood kind of place with a variety of beers, wines, and mixed drinks. They have a kind-of bipolar menu with a $22 entree (which was very tasty), a couple of other entrees, then it drops to burgers (which I have not tried but looked delicious). I think this place is trying to find out who they are and will get there. My recommendation -- give it a try."
  ]
 },
 {
  "name": "Chez Foushee",
  "address": "2 E Grace St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/904f5462-9333-11ea-ab38-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "unique",
   "free",
   "tasting",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=3937521158802158400",
  "source": "GoogleMaps",
  "reviews": [
   "What an impeccable dinning option! They have never disappointed me. That's cuisine is artfully delivered and their specials are unique. I've found that while reservations are appreciated, they are able to accommodate walk-ins. It's been very crowded when I've been. The wait staff is very kind and welcoming.",
   "Wow this place is great. The staff is on point and the food is excellent.  The omelette was superbly French complemented with perfectly seasoned crispy potatoes. I will be coming back next time I'm in town.",
   "We went here for brunch and it was surprisingly empty. It’s a fancy restaurant and it was hard to chose from their tasty-sounding menu, but we ended up getting the crab Benedict and creme brûlée French toast.\n\nThe crab Benedict came with hash browns and fruit, and the French toast came with strawberries and whipped cream on top. Creme brûlée French toast was more like a pound cake though it made it more unique— it could function more as a dessert than an entree.\n\nCrab Benedict had only a complete pieces of shell that I noticed, and the poached eggs on top we’re good. We also got some Rose tea (which had a fancy-sounding name). It was aromatic yet quite strong. \n\nSince we ‘checked-in’ using Yelp, we got two free truffle pieces. It is worth trying their brunch as they have some unique and good tasting menu items to choose from.",
   "I am sorry guys I was so immersed in the food experience that I forgot to take any pictures... but this place does not need pictures to be described. Chez Foushee is by far one of my favorite places in Richmond. It wasn't just about the drinks and food but an overall amazing experience with the faint fragrance of lillies, interesting conversation with the bar tender, the beautifully decorated place and most importantly a perfectly cooked duck breast paired with the right wine.",
   "Risotto with shrimp was delicious. I was there with 2 couples. Everyone was pleased with their meal and the service. A real plus was that it is not a loud restaurant."
  ]
 },
 {
  "name": "Salt & Forge",
  "address": "312 N 2nd St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/90b08754-9333-11ea-87b5-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=735878823594282071",
  "source": "GoogleMaps",
  "reviews": [
   "Was visiting with a friend in the city for the day. Plenty of space on a busy Saturday for a party of 5. The sandwiches were great, although the service might have been a tad slow but it was fine. Bathrooms were very clean as well. Nice interior design too. I would recommend. The BBQ chips are very good :)",
   "Wonderful food. The owner is always there making sure the food comes out perfect. Love Salt and Forge for the biscuits and the care that’s out into every meal. If i could give 10 stars i would.",
   "Amazing! Get the Ashville Chicken sandwich (the one in my pic). They open at 7 so they're perfect for breakfast, but also have extensive lunch/dinner options. I need to go back and try more of their menu. The service is friendly and it's a clean and happy environment!",
   "This place is incredible, can't wait to come back! Their homemade biscuits are to die for. We got the bacon, egg and cheese and the sausage (house made!), egg and cheese. The tomato jam is a must! Thank you Adam and Melissa, your food is amazing!",
   "Incredible food, perfect recipes, quality ingredients, generous portions, and exceptional customer service. I’m unsure of what else one could ask for in a restaurant, hence this spot has become a frequented favorite."
  ]
 },
 {
  "name": "Nile",
  "address": "306 N 29th St, Richmond, VA 23223, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/910a4086-9333-11ea-8677-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "free",
   "delicious",
   "food",
   "family",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4013139605543737296",
  "source": "GoogleMaps",
  "reviews": [
   "Homestyle Ethiopian food prepared with skill; delicious and so good for you. Meatless and meat options are available on both starters and main courses with plenty of vegan choices. Can't decide? The sampler platter is a filling way to try it all! The space is small, with only a few tables, so come early, and expect not to hurry - the food is freshly prepared and meant to be enjoyed and experienced, not rushed through. Street parking is plentiful; do be aware the only bathroom is downstairs and not wheelchair accessible.",
   "It was good. I an not a fan of the gluten free injera. Also this is in a gentrified area. I feel like the seasoning is catered to pallets in that area. While it was good. I've had better ethiopian in Richmond.",
   "Traditional etheopian food, spicy and delicious! Was cooked right away, this is real food. Looking forward to going back in the future!",
   "Fantastic family owned place! I was too excited about finding an Ethiopian restaurant, and utterly geeked out. The owner was calm, supportive, and (appropriately) mildly amused. \n\nThey were INCREDIBLY understanding of my food allergy, and helped me navigate the menu.\n\nI ordered dinner for my sister's family, then went back the next day for my own. \n\nTheir injera is GLORIOUS!!!",
   "We ordered the 2 meats combo platter with 3 veggies and also had the lamb (all pictured here). Everything was delicious! Service was great. Food was fresh."
  ]
 },
 {
  "name": "Metzger Bar and Butchery",
  "address": "801 N 23rd St, Richmond, VA 23223, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/918a6d38-9333-11ea-b16d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "eat",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=14538484459593295887",
  "source": "GoogleMaps",
  "reviews": [
   "Food was delicious. So nice to see things that you don't find at other restaurants. For example, rabbit. Service was great. And it was great to see them taking extra care in cleaning during this trying time. Like cleaning the door handle at least 3 times while we were there for dinner.",
   "Cozy place with very good food. If I remember correctly, the corkage fee was only $20. I love bringing my own wine to restaurants when I can. The charcuterie board was out of this world. Our server was delightful. I wish I could remember her name. \n\nTry to sit away from the door in the winter. It’s cold with a big draft when the door opens.  \n\nMy only complaint is that the menu changes often so if you find a dish you love (and you likely will) it may not be offered the next time you’re there.",
   "Went with my girlfriend during Richmond restaurant week. The restaurant has an interesting aesthetic. It feels like an upscale bar/pub because of the small size. Service was terrific. They serve three course meals here and I had the Smoked Sweet Potato, Eggplant Schnitzel, and Apple Strudel. The Schnitzel was particularly delicious and was the highlight of the evening. Would recommend to others.",
   "This is a fascinating place to eat! I had the chicken schnitzel Which is kind of like a country fried steak with gravy and fried eggs on duck fat fried potatoes underneath! It was a decadent brunch unlike any I have had!",
   "Absolutely delightful brunch. Perfect dishes to share excellent mix of cocktails and beer.  Very authentic take on German and euro dining and a comfortable space. The cheese spaetzle with egg carried me back to my youth. Missed the pretzels but I'm sure they are delicious as well."
  ]
 },
 {
  "name": "The Daily Kitchen & Bar",
  "address": "2934 W Cary St, Richmond, VA 23221, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/91ebc758-9333-11ea-98e1-14b31f159f22.png",
  "tags": [
   "drink",
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4862219624325100046",
  "source": "GoogleMaps",
  "reviews": [
   "This is my third time dining at The Daily. I always sit at the bar. I always get the fried calamari and a drink. Both have been amazing each time. \n\nThe bartenders are always pleasant and well-informed about the menu, dietary restrictions, and available substitutions. They go out of their way to make me feel welcome and appreciated. That means a lot. That means that they care about their customer's experience.\n\nGo here for dinner, lunch or brunch. You'll love it!",
   "Delicious food but pretty darn pricey.\n⭐️⭐️⭐️ Particularly because of cost & our service wasn’t great. We waited nearly an hour after ordering our food. Something definitely went awry but our waitress never said anything about it. Unfortunately we didn’t either so, maybe that’s our fault. 🤷🏻‍♀️\nUnsure if I’ll go back even though it tasted good, just not sure that it’s really worth it for me.\nIf you like “finer things” and spending $$ then def hit this place up! You’ll probably like it better than I did. \n*Sandwiches are def the best bang for your buck\n**Banana bread is also surprisingly delicious (my friend ordered it)",
   "Hubby brought me brunch @ The Daily. Yum. The restaurant has a trendy vibe, the front of the house is decorated in a cool mix of organic meets clean lines. The  food came out hot. Our service was good. The back of the house was running smoothly as it did not take a long time to get our food.  My favorite part of the restaurant having enough room to have a private conversation in public.",
   "The Daily Kitchen & Bar was a great experience. The organic food they serve here is delicious. The lime cilantro sauce was fantastic and made my spicy chicken avocado bowl, also was a good dip for the fried. Overall I will definitely go again to enjoy more of the delicious meals.",
   "It's a little on the loud side when they are busy. Love the health options. Service was good. Food was just alright. But I didn't feel it was over priced."
  ]
 },
 {
  "name": "Addis Restaurant",
  "address": "9 N 17th St, Richmond, VA 23219, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/925bc770-9333-11ea-b019-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17464160699033137694",
  "source": "GoogleMaps",
  "reviews": [
   "Had a great lunch here. Really enjoyed it.",
   "Delicious food, family style, authentic experience! Prices are fair for the quality and location. Highly recommend “all 6” vegetable options with one or two meats for a table of 4. We were stuffed! Can’t wait to come back!",
   "Good food with great taste and quality. A single entree with an extra side should be good for two. Especially loved their minced chicken dish",
   "Incredible. My wife and I have now eaten here around 10 times. Each time, we worry it won’t live up to how good it was previously. Each time, it’s as good or better. Quickly becoming my favorite place in the city. \n\nIf you are unsure of what to order, do a specialty platter and ask for recommendations. You can’t go wrong.",
   "Went there for my birthday. Food was amazing. Service was great. We had a party of 9, and even with a large group, everything went really smooth. Would highly suggest trying a little bit of everything. We did!"
  ]
 },
 {
  "name": "MOSAIC Restaurant",
  "address": "6229-A River Rd, Richmond, VA 23229, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/92dfebcc-9333-11ea-a903-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=16534513264998684593",
  "source": "GoogleMaps",
  "reviews": [
   "This was our first night out after having our daughter so we were very excited.  When we arrived a waitress helped us since the hostess (short haired female) was on the phone.  She attempted to sit us next to a large party so we asked if a booth was available. As she was looking the hostess was rudely shaking her head no and putting her hand in the air as if we were bothering her.  We finally just accepted the table by the party.  The food was average. Not bad, but nothing special.  Since we rarely go out we got drinks, apps, dinner, and dessert.  We were at the table approximately an hour and I had just paid my bill (maybe 5 minutes) before the hostess came over and said we needed to leave because she needed the table. This was just not a pleasant experience and considering we are blessed with multiple great restaurants all around Richmond we will not be heading back.  Go spend your money somewhere else.  Like Azzuro right next door.",
   "Read until the end — Friendly service, and the food was OK. Though, there are two single occupancy restrooms. One of which has an “out of order” sign taped to the door. Unfortunately, this sign is misleading. The restroom works fine, the employees are just \nusing it as their own private restroom..Smh.",
   "Wasn't great, wasn't bad, just kind of mediocre.\nThere's no list of their draft beers, so you have to rely on the handwritten chalkboard on the wall (like you would find at a dive bar). I picked my beer off of the chalkboard, and my wife picked her wine off of the (printed) wine menu. They were out of both (so back to the chalkboard for me). Not a big deal, but having an accurate beverage listing on a Saturday night should be a given. The food was good, but that's about it (our waitress was great, I must add).\nMaybe I'll try again, but not somewhere I'd go out of my way to eat or recommend.",
   "This is the absolute worst experience I have ever encountered with a restaurant. I made a reservation for my family on Christmas Eve at 3:30 pm. When I got to the restaurant, we were informed that this was impossible as they closed at 3 pm. When I went to show them the confirmation, my Open Table said that it was for December 26 at the same time. They were extremely rude about it, basically shoving us out the door and telling us better luck next time. I figured it must have been my mistake, so I let it be and thankfully found another last minute reservation elsewhere. As you can see in my email confirmations, my reservation was originally for when I thought, but changed late the night before without so much as a phone call. I have been a host at many restaurants that use the same Open Table system and know it is not possible to completely move a reservation on the restaurant end without changing the amount of people. If they had simply called to let us know that they were closing early, rather than being sneaky, rude and unaccommodating leaving my family with no Christmas Eve reservations as far as they knew, that would have been much preferred. Even if this was my fault, which as the email confirmations show it was not, the absolute snottiness to my family was absurd. Due to this experience, I will not be returning to this restaurant, nor recommending it to anyone I know. If it were possible to post this with zero stars, that is what I would give them and their staff.",
   "Visited this restaurant for a friend's birthday celebration. I arrived late and it took a very long time to be waited on.  It was a Monday evening and the place wasn't extremely packed but it appeared the waiter was also the server and bartender for the evening. I didn't find anything I was thrilled about on the menu and the prices were very expensive, so I just opted for a sangria. My friends ordered calamari for an appetizer which was pretty good, but there were no raves for their individual entrees.  One friend ordered what she thought was a loaded baked potato which came out as loaded mashed potatoes instead another friend had some type of pesto meatball which she was disappointed with as well.  The gratuity was already included with the tab.  Overall the space was a little tight inside, it had a nice eccentric atmosphere but I would not personally choose to visit again."
  ]
 },
 {
  "name": "Gersi",
  "address": "805 N Davis Ave, Richmond, VA 23220, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/934b5846-9333-11ea-8cc9-14b31f159f22.png",
  "tags": [
   "delicious",
   "cheap",
   "delicious",
   "knowledgeable",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4281160065912283405",
  "source": "GoogleMaps",
  "reviews": [
   "Hands down, absolutely the best service in RVS extremely welcoming from start to finish, literally every single member of the staff provided outstanding customer service. Drinks were good (varied selection), appetizers, entrees, and dessert were delicious. We'd tried a few times over the last 2 months to get in, but it just hadn't worked out, it was most certainly worth the wait! Reservations are definitely recommended, gets busy very quickly during peak hours.",
   "All four of us loved Gersi.  Great drinks (not cheap) and an excellent menu with some entrees priced in the mid teens.   Risotto entree was great,  friend said the sea bass was the best he'd had.  Same story with the Bolognese and linguini with clams.  Place was packed and loud,  which seemed right for this Brooklyn based restaurant.  We'll be back for sure!",
   "Great cozy spot with amazing Italian food - homemade pasta is so delicious - all The staff were very attentive and knowledgeable and super friendly we would totally go back here again and recommend all our friends to go out here for a great dinner in the fan.  so glad this place has come to our neighborhood!",
   "We came on a Saturday night and though we quickly realized we should have made a reservation, we decided that the 1-1.5 hour wait was worth it and we would wait. We waited and waited and checked back an hour and 45 min later (they said they’d call and they never did to update us) only to be told we still had another 20-30 minutes and they couldn’t guarantee us a spot because they “only seat reservations”. After explaining to the hostess and who appeared to be a manager that I understand they can’t predict timing of parties leaving, it would have been nice to know they seat reservations and they book out 2 days ahead so the likelihood of getting a table before 9 pm was almost zero. At this point it was 8:50 pm and we left to go to Mama Zu’s which has never left us disappointed and we got in immediately. I’m all for reservations but it should be made clear that they book their restaurant out with reservations instead of leaving tables for walk-ins. This situation would have been much better and I honestly wouldn’t write the review if it wasn’t for the way the manager talked to me and was incredibly rude talking to me like I was dumb and should be grateful they’d eventually seat us. Like you’re less than the people who made reservations. If that’s how you want to do business I’m fine with spending my money elsewhere. Also my friend wrote a review for this place and we had a terrible experience back in early November and they said they’d reimburse us for the food because of how awful the time was there and they never did which is incredibly annoying to be promised something by a business and then never follow through. Don’t come here without a reservation. It’s a waste of time and they’re rude. Maybe Gersi should explain that reservations are the only option on the weekend. That’s fine, but don’t tell us we’ll get a table you can’t guarantee, and don’t be rude.",
   "Beautiful atmosphere and amazing food! Great place for a romantic evening. Will definitely come back"
  ]
 },
 {
  "name": "Bottoms Up Pizza",
  "address": "1700 Dock St, Richmond, VA 23223, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/93b082dc-9333-11ea-acf7-14b31f159f22.png",
  "tags": [
   "food",
   "free",
   "tasting",
   "delicious",
   "walk",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=18251744461374941135",
  "source": "GoogleMaps",
  "reviews": [
   "We celebrated my son's birthday there tonight. Great food and a great time. Our waiter Jesse gave us wonderful service and Nick (manager) made sure my son's night was special!",
   "the first time I was here was in 2001 and remembered it to be the best tasting pizza ever. What stuck out was the crust. The texture and the flavor. I have always talked about it through the years. I almost never find myself in Richmond but have always dreamt of going there when I was in Richmond. After waiting for many years, decided to make a special trip out there since I had a complete free day with no commitments. Taking advantage of this rarity I drove the 2 hours to try it. My waitress Grace was very friendly and suggestive of pies to try. Did the Smokehouse and the Chesapeake and both were FANTASTIC! It still hold the record of my most favorite pizza place",
   "Great pizza, love the crust! Haven't had one I didn't like. Salads good too.",
   "My 2nd time here and I can only say it is perfect! Pizza was delicious and 1 slice is so big I had to take half of it home. Finding a parking spot can be a bit tricky, but once you solve that, the experience is worth it. Server was a brand new employee but did a great job. When done eating, you can take advantage of their great location and walk to Main Station, Farmers Market and many other wonderful places around. Delicious Pizza, good service, great price. 5 Stars indeed! Thanks!",
   "Well made pizza. We liked the thin crust more than the regular. We had the crab with white sauce & brisket with bbq sauce pizzas. Unique flavors done well. We ordered mediums- they were definitely bigger than typical individual sized pizzas but seemed little smaller than a typical medium size."
  ]
 }
]