[
 {
  "name": "Old Sacramento Waterfront District",
  "address": "1014 2nd St #200, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/94197e50-9333-11ea-a36a-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "tour",
   "history",
   "kids",
   "eat",
   "walk",
   "eat",
   "history",
   "eat",
   "structure",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15253741825792373872",
  "source": "GoogleMaps",
  "reviews": [
   "Fun place to see the old buildings. If you are there at Christmas time the light show is fun for the whole family. The underground tour is full of history. There are good places to eat lunch and lots of specialty shops. The train museum is really fun with old train cars and a old locomotive you can walk in. They also have train rides they are not lo g and the train moves slow but fun for kids. I would recommend this place during the day after dark more homeless people start coming around.",
   "A great little slice of history there is lots to see and eat. The California railroad museum is awesome and very informative.there is a pedestrian walk through over to the mall we can grab lunch at Yard House or anything there. Yard House has a great happy hour starting at 3 weekdays and old Town is not very busy at that time. There are lots of options to parking weatherby meter or in garage or at the mall with validation. One of my favorite places to go in Sacramento. Did the underground to her it was pretty informative and really cool.",
   "The train museum is really cool and gets five stars. There are few good restaurants but need more to do. Lots of empty shops and store front. Plenty of parking near museum. A few more homeless people laying around than you would like to see in a tourist area or anywhere really. Not San Francisco bad, but bad enough to mention. I hear lots of money going into the area but still has a ways to go. Fun during the day but pretty creepy at night. Streets lights aren't great and not many people, other than bums, when we were there.",
   "Definitely one of my favorite places. From the train museum to the candy shop to all the places to explore and eat. There's something for everyone on a day trip. Parking is a little hard unless you park in the structure and other than front Street most of the area is under construction so there's less to do. But we enjoy the experience. it is a step back in time. We find something new each time we are here.",
   "It's a fun place to visit if you haven't been there. I wouldn't plan on spending an entire day there, but there are some fun shops and nice restaurants.  The train museum near by is fun for kids. Old storefronts and boardwalks. Some grassy areas with picnic spots. You can walk down to the riverfront. You will have to pay to park here. Either meters on the street, or under the freeway."
  ]
 },
 {
  "name": "California State Capitol Museum",
  "address": "1315 10th St room b-27, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/94738666-9333-11ea-a422-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "free",
   "tour",
   "kids",
   "field",
   "learn",
   "free",
   "walk",
   "history",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=378875291323442389",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful building. Highly recommend the free tour which starts on the hour. I tried grabbing a self guided tour map and going at it alone while on a business trip but the tour guide gets you into places you wouldn't think you have access to as the general public. The tour guide was very knowledgeable. The tour drops you off at the governor's office by a hallway which houses displays from every California county. It's fun to try finding your county if you live in California. Overall I had a very good time here when I needed to pass some time. Good for kids learning about civics and adults who are interested.",
   "If you've never been, I'd definitely recommend to go! I am a California native and have never had the opportunity to go visit. The location is beautiful and we'll kept. A lot of great facts to learn and perfect for a field trip.",
   "I came here to kill some time but ended up really enjoying myself! It is free, the building is beautiful, and you're free to roam around and watch Assembly and Senate sessions. There was a wonderful volunteer stationed near the north security entrance who let me know that the Assembly would be issuing an apology for the Japanese internment camps while I was there. I am so glad she mentioned it and that I was able to watch.",
   "It was SO fun to check out our Capitol. It's beautiful and has so much history. It was cool to see the different counties represented as well as one of the chambers. Also there's a nice garden area to walk around just outside the Capitol.",
   "At the State Capitol, the past, present and future of California interact with equal force. The building serves as both a museum and the state’s working seat of government. Visitors to the Capitol can experience California’s rich history and witness the making of history through the modern lawmaking process.\nHours:\nWeekdays 7:30 am - 6 pm\nWeekends 9 am - 5 pm\nAdmission is free\nTours available hourly 9 am - 4 pm"
  ]
 },
 {
  "name": "California State Railroad Museum",
  "address": "125 I St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/94ecfb78-9333-11ea-bd16-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "history",
   "family",
   "history",
   "walk",
   "learn",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13064911033240821480",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place! Total train nerd here and I always can find something to check out at the Museum! Make sure you have enough time when visiting because the exhibits are amazing. Also make sure to watch the movie in their theater that explains how the big four came to create train routes out west.",
   "The best place to visit while in Sacramento. The staff and may I say volunteers are amazing! I don't remember the gentleman's name he's in his late 80s and he has been volunteering there I believe almost 32 years he was such a delight.",
   "This is a clean and well-maintained exhibition. The staff is friendly and polite. They are knowledgeable and give you a good insight into the history of railroading in California. If you haven't been by all means go.",
   "I visited this museum over 4 years ago and I have never forgotten it. I got the opportunity to go again and it's still as impressive as the first time I went. \nI love trains and this museum had really taken care of the trains they have. It's all set up in a very interesting way with a nice flow to it. \n\nThe docents have so much information and definitely have a passion for trains & history. It you or anyone in your family likes trains or history - this place needs to be on your list.\n\nThe trains are well maintained compared to other train \"museums\" I've been to where they have become rusty. They also have lots of great artifacts.",
   "It is really a neat experience for all ages and kind of a go-to place for us when we have visitors in town. In addition to a number of really interesting trains on permanent display, they also have a gallery that rotates frequently. It is a fun place to learn about railroad history. They have a nice model train display upstairs and a newly revamped kids' play area. After the visit, you can walk around old Sacramento."
  ]
 },
 {
  "name": "Crocker Art Museum",
  "address": "216 O St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9547c5d8-9333-11ea-ac77-14b31f159f22.png",
  "tags": [
   "drink",
   "learn",
   "art",
   "family",
   "free"
  ],
  "link": "https://maps.google.com/?cid=15651045380592154937",
  "source": "GoogleMaps",
  "reviews": [
   "The staff are friendly and quite helpful! Each exhibit is well arranged. Check online or flyers for exhibit info. It is worth going!\n\nI will warm you that the parking in some of the lots has a quirk: as of this writing, the meter in front of your parking space is NOT the one you pay and isn't always clearly marked.\n\nA couple years ago I payed the meter and the $42 ticket.",
   "My friend over here ordered berries n cream and it was the bomb dot com. And then I ordered a flower power which is a springtime drink and man mine tastes like really good cardamom. I think it's a nonprofit cafe too oh my gosh, thank you so much!",
   "Any place you can learn is worth it. They were presenting American Indian art/history and it was an amazing learning experience about the past and present America that some may not know exist. Wish I lived in the area I would get a membership because they have an interesting calendar for 2020.",
   "My favorite museum in Sacramento. I have visited dozens of times in my life and I fall in love every time. Shocking mix of an old Victorian mansion and a clean white state of the art modern annex. Chock full of a wide range of art styles, mediums and age.",
   "Definitely Five Stars. Me and my family went together and it was absolutely wonderful. The atmosphere was great. I got so inspired while there. You also have free roam of pretty much everywhere in the building. The gift shop was also fantastic. The people working there and the entire museum were so nice. I am definitely going to go all the way back down to Sacramento so I can go there again."
  ]
 },
 {
  "name": "Sacramento Zoo",
  "address": "3930 W Land Park Dr, Sacramento, CA 95822, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/95af4470-9333-11ea-b6e5-14b31f159f22.png",
  "tags": [
   "learn",
   "family",
   "food",
   "knowledgeable",
   "family",
   "active",
   "learn",
   "nature",
   "kids",
   "educate",
   "food",
   "knowledgeable",
   "kids",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=6430915052866730629",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing place to bring your family. There's all kinds of animals here to learn about and watch. I had a good time here. You should definitely bring your own food and drinks. If you're visiting in the Summer, be sure to bring stuff to stay cool for everybody. Sun shades will be a must and sunscreen depending on the time of Summer you're visiting.",
   "This place is great! My little ones had plenty to look at, and plenty to excite themselves with. We had an easy time locating all the exhibits. The staff is both friendly and knowledgeable about the zoo. We ate close by the zoo at a great restaurant. I love the location of this place because it's so conveniently located in the middle of everything you May need/want.All in all i would declare this to be a great family fun zone.",
   "This little zoo is very well kept. We were fortunate that the animals were active and easily seen. My three grandchildren delighted in having such up close views of the animals. They also enjoyed feeding the giraffe. Activities such as this do have additional costs. This zoo is easy to navigate. You could spend an hour or all day    and learn something new about nature.  Animals in captivity are controversial. A zoo provides an opportunity for humans to experience animals. When a connection is made between humans and animals hopefully compassion is felt.",
   "This is definitely an amazing place to visit if you’re ever nearby, especially with kids. The price isn’t too high, and all the animals are treated with so much love and care their behaviors indicate this. I’ve visited it several times and it never gets old, the gibbons have to be one of my favorite for their calls. I’ve noticed people complaining about the animals not being out, and please ignore these people. The animals not being forced outside is a good thing, it means they’re being treated with respect and care. And the volunteers and employees are so nice, respectful, and kind. Especially that one Grace, made the entire experience a lot better as her and her colleagues help educate the kids and they have fun with it too so they don’t even know they’re learning. The food too is actually really good, the stir fry was killer, and I’d seriously buy it if it was in a restaurant. A lot of zoos feed you slop, but not here. And one last comment, if you’re a kind soul please donate to this zoo, they care for the animals and they fundraise for animal preservation in the wild.",
   "We have a membership to the zoo, and we do not even have kids. Nestled right near William Land Park in Sacramento, you are able to get up close and personal with giraffes, lions, gibbons, meerkats, and so much more! With over 500 animals, including exotic and endangered varieties, there is something for everyone. They host special events, have a Zoo Train, and the staff are very knowledgeable about their inhabitants. There may be no way that you would ever think that all of these animals could be right in your backyard, but guess again! Please do something for yourself, and put this affordable outing on your calendar today...you will not regret it. No doubt that your children or grandchildren will certainly enjoy seeing the animals, but then again, so will you!"
  ]
 },
 {
  "name": "Sutter's Fort State Historic Park",
  "address": "2701 L St, Sacramento, CA 95816, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9603f59e-9333-11ea-80f4-14b31f159f22.png",
  "tags": [
   "tour",
   "knowledgeable",
   "historic",
   "unique",
   "history",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17280317289212065050",
  "source": "GoogleMaps",
  "reviews": [
   "Really enjoyed the couple of docents who were there.  If you are planning a class trip be sure to get the guided tour or have a plan for students.  They no longer have paper scavenger hunts in the kiosk as the website says.  We had a hard time finding one online as well.  You may want to visit first and make one yourself.  But I believe guided tours are the way!",
   "Neat historic site. Exhibits were great; just the right amount of information. They have actors dressed in period clothing. I typically don't like that sort of thing, but they were very knowledgeable and I enjoyed talking to them here.",
   "Sacramento has a rich history. Not the most tantalizing or salacious, but interesting nonetheless. Sutter's Fort is one of those interesting places that makes Sacramento unique. It's always interesting exploring the little nooks and crannies within its walls and imagining what life was like a hundred and eighty years ago.",
   "This is a fun random spot in the heart of Sacramento. It's interesting to hear the raw real stories of Sutter and early settlers. There was an elementary school class there when we were visiting. Apparently classes can visit, stay the night, dress in colonial clothes, and do fun old time activities. Definitely something to check out!",
   "We had such a great day here.  So much history presented in an interesting way.  A real look into the past and what daily life looked like. Fun for adults and kids.  Dont forget to stop by the gift shop...they have so many fun souvenirs."
  ]
 },
 {
  "name": "Tower Bridge",
  "address": "Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/96563380-9333-11ea-9f59-14b31f159f22.png",
  "tags": [
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=13769130253514038132",
  "source": "GoogleMaps",
  "reviews": [
   "Just a beautiful bridge. I walk there every day. The homeless have started to move in, so there's places you can no longer walk to (the dock). I've watched the bridge go up and down (to let boats through) many times and it never gets old. At night the bridge is even more beautiful.",
   "It's a good first attempt at an iconic regional bridge. Although it offers good views of the east bank with Old Sacramento and the goose poop walk with the ziggurat building on the west bank, it could be much more walkable. Installing bubble machines, giving tours of the control room, and a grilled cheese cart would be nice touches that could help earn another star.",
   "The view at sunset is breathtaking with all the angles of the bridge and the glow of the sun reflecting off the gold.  You can also see the river and Old Sac from here.  \n\nAlso, have you seen the bridge when it's rising?  It's unlike any other bridge I've seen.\n\nSacramento has been my home for 16 years and I consider this iconic Sacramento. \n\nA photographer's favorite, be sure to stop by at golden hour sometime soon!",
   "Beautiful piece of architecture. A highlight of Sacramento without a doubt. As a backdrop to Old Sacramento and the waterfront district it is a must see.",
   "I go over the Tower Bridge Tuesdays and Thursdays in the morning between 4:30 and 5 in the morning it's beautiful whenever the lights are on and I can see the sun coming up have a wonderful and blessed day"
  ]
 },
 {
  "name": "William Land Regional Park",
  "address": "3800 W Land Park Dr, Sacramento, CA 95822, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/96c0400a-9333-11ea-814d-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "walking",
   "field",
   "family"
  ],
  "link": "https://maps.google.com/?cid=16981455694722865729",
  "source": "GoogleMaps",
  "reviews": [
   "I really enjoyed it here, it's very peaceful and well kept. I really enjoyed the flower garden, and the park is huge with different sections, to explore. Like, the golf course and etc... But, there is one small problem, exiting out of the park, you have to navigate your way around the park to exit out...the no outlet sign has you guessing. Other than that: this park is lovely.",
   "This park is very big! Has a lot to offer. It's right next to the Sacramento zoo, has a few ponds with ducks and nice flower garden. Great Local park. Definitely love the  Lotus flowers that come out in the pond every year, it's a sight to see.",
   "Clean park. Good location. \nNine swings, one of which there's a tire swing, four toddler swings, and four regular swings. Two play structures, one for older kids and one for toddlers. The ground is covered in bark and sand.\nClean restrooms.",
   "I do enjoy going to the park and just breathe in the air right here. It is a nice park with big tall trees and cute ponds. Many families take their kids here on weekends and its so nice that I have seen people doing outdoor photo shoots. \nI can sit here for hours just watching people walking and the ducks swimming while enjoying my espresso. \nSacramento can be crowded with so many different things. It is good to have a park like this.",
   "I grew up close to the park and zoo and fairytale town. It's still the same. A beautiful park with many different areas. It includes a golf course, baseball field, picnic areas and to public stages. Plenty of ducks to feed and the Sacramento Zoo and Fairytale Town adjacent to the park make it a wonderful family attraction."
  ]
 },
 {
  "name": "Fairytale Town",
  "address": "3901 Land Park Dr, Sacramento, CA 95822, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/97394292-9333-11ea-8ab6-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "creative",
   "kids",
   "walk",
   "kids",
   "affordable",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1554805342647957096",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome place. Much better than the zoo for really little kids (under 4). Basically a huge park with fairy-take themed slides and play structures. As an adult, it’s just fun to walk around! The crooked mile is the most fun, but I recommend going when it’s not too busy.",
   "Fairytale town and Sacramento Zoo are just across the street to each other. Fairytale was more fun for the kids. All the slides here are amazing and creative. Like you go inside a house and the climb stairs and boom you are ready to slide, crooked street walk was fun for both our toddler and my cousins 5 years old kid. There is a castle too. If there is no party going on you can go there too.",
   "Amazingly wonderful, perfect for young kids! I love all the low tech interactive activities for young children. The fun slides, the amazing connections to familiar stories, the timeless wonder .. It's all so fun for everyone! The animals are a great bonus! My kids loved the teepees!!",
   "Found this place on the way back from Tahoe. It's a nice stop for the kid. This is a fun&cute theme park with affordable price. Highly recommended.",
   "Great. Especially for the little ones. And even much older folks too. It's been upgraded since I took my kids. Now I'm taking grandkids. Great day out."
  ]
 },
 {
  "name": "McKinley Park",
  "address": "601 Alhambra Blvd, Sacramento, CA 95816, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/979a9b10-9333-11ea-be45-14b31f159f22.png",
  "tags": [
   "kids",
   "structure",
   "parks",
   "walk",
   "kids",
   "library",
   "walking",
   "library",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9817515343663866372",
  "source": "GoogleMaps",
  "reviews": [
   "Clean playground with lots for kids to do.  The play structure is massive with lots of different elements to keep kids entertained.  Only downside is that the play structure is so large and tall a parent cannot just sit in one place to monitor children and the fact that there are multiple access points to outside the playground I felt the need to constantly follow around for safety as there were several homeless/transients very close.  \n\nEnjoyed the pond as well and children enjoyed watching the geese and ducks.",
   "One of my favorite parks in Sacramento. Big enough to jog around (it's about 1 mile all the way around) with lots of tennis courts to hammer out your ground strokes. Space for gatherings large and small make McKinley Park a great weekend spot. The McKinley Rose Garden is also located here and one of Sacramento's many floral gems.\n\nLooking forward to the completion of the water vault project so that McKinley Park can return to its full splendor!",
   "Busy park with a huge playground for kids of all ages. My son loves this place! Also there's a nice pond and lots of walk paths for running or walking a dog. There is a beautiful rose garden on the other side of park as well. The playground is located right next to the library. A little tough to find parking sometimes since its downtown.",
   "Clunie Library and Meeting Rooms very comfortable and clean. Attendant on duty for inquiries. Numerous activities did not interrupt one another. A Well Kept Secret for Events and Meetings.",
   "Beautiful park, but half of it is being ruined by the sewage tanks they are putting in. It was so much better 3 years ago, but it's still a fantastic park. They have a pond, a huge wooden jungle gym for the kids, tennis courts, a basketball court, a rose garden, and ample outdoor space. It's a really big park that you should definitely check out."
  ]
 },
 {
  "name": "Cathedral of the Blessed Sacrament",
  "address": "1017 11th St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/97fdf110-9333-11ea-97d6-14b31f159f22.png",
  "tags": [
   "learn"
  ],
  "link": "https://maps.google.com/?cid=9564782502343456227",
  "source": "GoogleMaps",
  "reviews": [
   "I've been a long time visitor to the Cathedral of The Blessed Sacrament. The building is very nice and the people are very welcoming and helpful to anyone. Parking near the church is quite expensive, normally $10-$15, so I would suggest for you to park a little further so you don't have to pay the fee. The masses teach me a lot about different things that I could use in my life myself. The architecture looks really nice and you could learn a lot about how buildings were built in the 1880s, the Renaissance Revival times. I like a lot of Cathedral that I can't tell you right now, but I just love it overall.",
   "Visited this beautiful sanctuary for a community worship gathering! Absolutely stunning. Parking can be difficult. I highly recommend going to hear the pipe organ!",
   "Beautiful church. At the right of election I got to meet the bishop we had a very blessed day here. 🙌🙏",
   "I'm the owner of Over The Top Events Parties, and two weeks ago my bride wed here. This cathedral is beautiful, dramatic backdrop for your wedding. I look forward to planning more event's.  Titi is their coordinator for cathedral and her team was great.",
   "If you ever want to escape the crowds of Sacramento and want to have some peace and quite then there is no better place. The wonderful architecture will keep you in awe and the prayers that are always going on inside will keep you grounded in reality."
  ]
 },
 {
  "name": "California State Capitol Park",
  "address": "1300 L St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/98714c92-9333-11ea-87ec-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=5243745298811035407",
  "source": "GoogleMaps",
  "reviews": [
   "A beautiful and fun park, surrounded by stately architecture, filled with many playful squirrels and only a few well behaved transients. Walked around for a couple of hours enjoying the memorials, the horticulture, and the very entertaining squirrels.\n\nPlenty of clean benches spread throughout, very safe (many joggers, police patrolling every so often, quite visible). Could use some more wayfinding aides, especially nearby & notable experiences/institutions.",
   "This beautiful park is filled with just about every kind of tree that is native to California. There are paths winding throughout and more squirrels than you can count. The park is kept very clean and there is plenty of places to sit, or picnic, or run. The sidewalk surrounding this park is exactly one mile around so you can monitor your distance.",
   "I always come here because I run the California International Marathon.  It's a beautiful place for having the finish line. The park is nice and big and very well maintained. Kids love to play and hangout here.",
   "Nice place, very nice and family friendly park. We love visiting it to enjoy blooming magnolias and roses. Love it!",
   "Huge park,  they keep the homeless out and it's well maintained.  6 place for a walk, run, picnic, or a game of catch.  Just needs more parking."
  ]
 },
 {
  "name": "Sacramento History Museum",
  "address": "101 I St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/98dba76c-9333-11ea-bcc6-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=10840619245750513748",
  "source": "GoogleMaps",
  "reviews": [
   "Do the underground tour, I like this museum you will be able to take some fantastic pictures and get a lot of historical information. Be aware it’s not a large museum but plan like 1 -2 hours and you will have a great time.",
   "This was a great your. Sap was our guide and he was great. Very interesting to look at and listen.",
   "Only had a brief time to explore but some cool agricultural and historical info. A small section of old Sac Bee printing equipment and lots of nice displays of local artifacts. It's a great to shop around in Old Town and see the museum as well. Took the Sacramento Underground tour, which is good to do at least once if the history interests you.",
   "Great place to see what Sacramento was built on literally and figuratively! Beautiful tour",
   "Great museum! Excellent displays and info, self guided, no time limits to view!!"
  ]
 },
 {
  "name": "Leland Stanford Mansion State Historic Park",
  "address": "800 N St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/992f4622-9333-11ea-a69c-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "structure",
   "tour",
   "history",
   "structure",
   "walk",
   "parks",
   "tour",
   "free",
   "free"
  ],
  "link": "https://maps.google.com/?cid=9698962424916610549",
  "source": "GoogleMaps",
  "reviews": [
   "Love history beautiful home just didn't have time to take the tour. Every hour the top of the hour. Admired the structure around the mansion though.",
   "Amazing place of history. They only allow you to take photos outside. Inside photography are not allowed. I don't know why. It doesn't matter. The tour was short, but excellent. Amazing structure. Definitely will visit again for a full tour. I'll post more photos later.",
   "Beautiful mansion that was the office of the Governor during the Civil War.  More recently it was the second office of Schwarzenegger.  The grounds are kept vintage Victorian.  The entire mansion and grounds are operated by California State Parks. Walk up Tours available...check the State Parks website for hours.\nI took these photos in the early morning.  The juxtaposed image of Victorian Sacramento against a 1960s high rise is beautiful.",
   "The mansion offers excellent free tours of the house. \n- You'll get to see what the house looked like over the years. The house and most of the levels showcases beautifully well preserved architecture and furnishings. Other levels show off what the house looked like when it was remodeled to become an orphanage. \n-The tour guides are friendly, interesting, and can answer pretty much any questions you can think of. Definitely pay this land mark a visit!",
   "A great historical place to visit! Can't beat the price! It's free! Guides in every room to give you some historical background. We will be back!"
  ]
 },
 {
  "name": "California Museum",
  "address": "1020 O St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9991ff98-9333-11ea-8af3-14b31f159f22.png",
  "tags": [
   "history",
   "family",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11483930431888689310",
  "source": "GoogleMaps",
  "reviews": [
   "This place has wonderful hands on displays  for  children and young people. People of all ages will be educated and impressed with the exhibits.  The information is presented very well.",
   "Great museum with so much California history. Their new Gold Mountain exhibit on Chinese contributions to California is excellent! Take the time to push buttons and watch the videos on individuals who helped make California what it is today!",
   "Great displays and a good place to take the family. Lots of great exhibits. Gift shop has a variety of souvenirs to choose from. Staff was also very friendly.",
   "Went here for the opening of the Chinese-American exhibit with my family.  It was great!  From the native American area to the healthy eating area - great education for kids.",
   "My Neighbor and I spent about 2 hours here; although I think we really needed more time! The museum needs a map  because you can easily get lost in the place!! We loved the gift shop!"
  ]
 },
 {
  "name": "State Indian Museum",
  "address": "2618 K St, Sacramento, CA 95816, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/99e1316e-9333-11ea-9888-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12160493566533878444",
  "source": "GoogleMaps",
  "reviews": [
   "If you're like me and grew up in California than the last time you probably gave the native Americans any more than a few seconds of thought was back in the fourth grade. Growing older I realize the importance of recognizing the history of the land that is underneath your feet-- especially where you call home. If you call Sacramento your home I implore you to visit museums such as these and do a little \"time travel\" within a few thousand square feet.",
   "This is an interesting museum that provides insights to local Indian history. For those who are unfamiliar with Indian culture and visit from other International First Nations Peoples it would be advantageous to be able to take photos. Further displays have better lighting to easily read the displays.",
   "Informative and very well taken care of! \nNice experience!",
   "I have not made it to the State Indian Museum as of yet. But I'm definitely looking forward to getting there sometime.",
   "This is a wonderful museum that highlights California Native Americans."
  ]
 },
 {
  "name": "Discovery Park",
  "address": "1600 Garden Hwy, Sacramento, CA 95833, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9a49b8a4-9333-11ea-86e9-14b31f159f22.png",
  "tags": [
   "music"
  ],
  "link": "https://maps.google.com/?cid=6608359273538838528",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful park! Lots of parking and great views of Downtown Sacramento. It’s very peaceful and nice here. Great spot for a picnic or just time outdoors.",
   "It's a very large park, but not much to do here. It has parking, bike paths and restrooms. Buy it looks like it used to be nicer.",
   "Great place for a concert but the crowd was TERRIBLE. ABSOLUTELY AWFUL. And nothing was done to keep people from being straight up TRASH in every way. Will never attend an Aftershock ever again, the only thing that made it worthwhile was my favorite band System of a Down, who put on an incredible proformance",
   "Aftershock festival 2019 was amazing. Discovery Park is a great setting and venue for event like this. We had such a fun time, being in the park was beautiful. The shade was a life saver mid day.\nI'm sure this park is great at being a park too. This weekend the music took over and did the park killed it.",
   "My wife and i went to have a picnic and enjoy the view of the river. It was quiet, peaceful, and a bit romantic, just as perfect a day as i had hoped for. There's picnic benches and plenty of parking. There's bike trails and a boat launch, and plenty of trees with the leaves begining to turn all those incredible colors that they do. It's a great time to go there....."
  ]
 },
 {
  "name": "Old Sacramento Schoolhouse Museum",
  "address": "1200 Front St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9aaa4e3e-9333-11ea-b64b-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=3990039449381827264",
  "source": "GoogleMaps",
  "reviews": [
   "Good place to learn about the history of school house.",
   "Cute. Quaint. Worth a look, but don't expect to spend much time there",
   "This cute museum is run by friendly voulenteers with a passion for history. If you happen to catch it while it's open, (weekday mornings/early afternoons are your best bet) come on inside, look around, and say hello! You can write on the slates on the desks, flip through the old textbooks, and maybe take something home from the small gift shop. All in all, a great place to stop by if you're in Old Sacramento.",
   "Jo Ann is a truly an amazing woman with so much history and knowledge. Thank you for the beautiful experience.",
   "Definitely take your children here! So cute! Make sure to read the picturea. It ia very interesting."
  ]
 },
 {
  "name": "Powerhouse Science Center",
  "address": "3615 Auburn Blvd, Sacramento, CA 95821, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9b06a192-9333-11ea-8890-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7410459183606639728",
  "source": "GoogleMaps",
  "reviews": [
   "I participated in a 1st grade field trip to the planetarium. The show was fun and informative; the kids enjoyed the experience. However, the Q&A portion of the event made me aware the staff is either uninformed on the basics of science or cannot answer the simplest of questions on the spot. If it wasn't for the fact the audience was a class of 1st graders, I'm sure someone would have challenged quite a few of the answers given.",
   "A fun little interactive museum. Great for kids or kids at ❤️. I had fun exploring the exhibits and played as much as any kid there. Definitely worth a visit and I can't wait to see what they do with their new location next year.",
   "Think of it as a condensed version of a normal science museum, appropriate for 4-8 yr olds. My daughter enjoyed the time there. Many sections are closed off for groups, which I feel is a bummer.",
   "The science museum was lots of fun and interactive learning. The planetarium was amazing!!! The gentleman, David, really knew his stuff and I learned so much. It was fantastic.",
   "Great, fun and fascinating place to take children. Lots of hands on activities. Fun and education all bundled in one."
  ]
 },
 {
  "name": "River Walk Park",
  "address": "651 2nd St, West Sacramento, CA 95605, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9b5d2582-9333-11ea-bc1b-14b31f159f22.png",
  "tags": [
   "walk",
   "free",
   "walk",
   "walking",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=10897376119093369278",
  "source": "GoogleMaps",
  "reviews": [
   "Nice little picnic place. Very little free parking so will most likely have to park in garage. Great little walk to the Tower Bridge and into Old Sac. My small kiddos always enjoy it. Only downside is the trash cans are always overflowing.",
   "Had a nice time on the river Walk Park with my friend very beautiful outside and a nice scenery thanks Brit for getting me out of the house I needed that",
   "It's great every sunday I go walking with my boyfriend out there",
   "Looks like a nice place during the day. However, being downtown, in the evening and weekends when the business are closed homeless people move in around the benches and under the bridge.  The grassy park area and walking path are still nice and the area was clean.",
   "Very beautiful vantage to view downtown Sacramento. It's funny though. Everyone is busy staring at their phones. Beauty all around and they can't stay off Facebook."
  ]
 },
 {
  "name": "Fredrick N. Evans Rose Garden | McKinley Park",
  "address": "3255 H St, Sacramento, CA 95816, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9bb8ca28-9333-11ea-beb8-14b31f159f22.png",
  "tags": [
   "family",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10004303626528593950",
  "source": "GoogleMaps",
  "reviews": [
   "Had a good time in the beautiful scenery rose garden. A great time to shoot here is at sunset. The park was pretty empty when we got there. The park has so many different scenes you can choose from. Overall it’s a great place to spend time with your family",
   "Beautiful and extensive rose garden in McKinley Park. We visited out of season but it was still worth the visit. Can't wait to visit in the spring when  all the buds pop!",
   "A very beautiful, must-see park of Sacramento. People young and old will enjoy coming here ( a little ways down they have a great playground & tons of shade thanks to the huge trees. There is also a really cute 'fairy door' at one of them). Plenty of parking & people are friendly; the only downside was some littering but that is at the fault of the visitors not the park itself.",
   "Beautiful park for a walk with the family any time during the day. Lots of flowers that makes beautiful backgrounds for memories and photography. \n\nCome here to explore for at least an hour and bring your loved ones for great colorful pictures!",
   "Lovely place for taking photos in the Rose garden or taking a casual stroll around the park. Garden is on the same grounds as the Playground which has a dedicated section for toddlers and youth. Sadly I don't know what the outcome will be but,there is also a sewer/overflow plant being built in the same compound of the park. Residents I've spoken to in the Victorian homes are not happy. That is also why I gave a 4 out of 5 stars."
  ]
 },
 {
  "name": "Old Sugar Mill",
  "address": "35265 Willow Ave, Clarksburg, CA 95612, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9c1606c6-9333-11ea-b313-14b31f159f22.png",
  "tags": [
   "winery",
   "tasting",
   "tasting",
   "kids",
   "food",
   "tasting",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=822544920457326505",
  "source": "GoogleMaps",
  "reviews": [
   "An old sugar mill that has been converted into a winery and picnic ground. It’s a little out of the way of everything else but I definitely recommend stopping by for at least a wine tasting if you’re in the Sacramento area. I’m pretty sure they host wedding and other events as well. Cheers 🍷",
   "this place was a blast. Good wine, really nice to have a whole bunch of wineries offering tastings in one place. And dog friendly! Our pup loved our tasting  trip.",
   "Incredible place, lots of options for drinks and food. Great grass area for picnics. Definitely a place to bring a significant other and the kids.",
   "First time going to the Sugar Mill was amazing. We were not expecting such great wines and people.   The wineries are all pet friendly, giving our four legged friends much love.  We never had so much fun tasting wine as we did here.  It is a place you must visit",
   "Really great place to go on a date. They had great wine and a nice picnic area to eat at on the grass"
  ]
 },
 {
  "name": "Sacramento RiverTrain",
  "address": "400 N Harbor Blvd, West Sacramento, CA 95605, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9c85c3e8-9333-11ea-ade8-14b31f159f22.png",
  "tags": [
   "tasting",
   "music",
   "food",
   "food",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=12629213574916730842",
  "source": "GoogleMaps",
  "reviews": [
   "Do visit when you are in Sacramento. You will experience beautiful natural beauty through your journey of 2hrs 30mins. I visited with my hubby during valentines so was just an icing on cake. You would love the variety of wine kept for tasting. Do visit and have fun.",
   "Loved the train and the staff. The on board show was cute but it needed a little extra. Maybe some Christmas music in the background, livelier lights, a little more show, some displays?  For the price they charge per person, they can certainly afford it. I don't know their options as far as the train path but I wish it would've been longer or some nicer scenery.",
   "An absolutely fabulous event to do for couples or a group of friends. Beautiful train ride with great views, tasty food and wonderful wines.",
   "Fun train ride, especially if you like themed rides. This was the Great Train Robbery, complete with \"money\" that the bandit on board takes during the hold up. The stop for lunch was good, though hot out (is about summer here). BBQ served. If vegan or vegetarian, will need to find out if food for diet is available ahead of time. Relaxing, slower  (approx.10 mph) ride through farm land and river area.",
   "We were celebrating a birthday on the Beer Train. There were three craft brew tasting stations and a snack bar.  There was a live band and we were dancing. There is even a stop at a mock town for corn hole games and more dancing. The staff members were pleasant and helpful. I look forward to taking the Sacramento River Train again."
  ]
 },
 {
  "name": "Scandia Fun Center",
  "address": "5070 Hillsdale Blvd, Sacramento, CA 95842, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9d44ef52-9333-11ea-93e0-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "kids",
   "family",
   "kids",
   "free",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=11134347639740409132",
  "source": "GoogleMaps",
  "reviews": [
   "Fun center should be followed by only if you’re willing to pay top dollar for games made in 2003 and Also paying to win. There’s no specials here they just make it sound good and then tell you you have to “upgrade” to actually win. This place used to be awesome to go to and have fun with the family but now it’s just becoming an extortion scheme. Garbage food Way overpriced. Don’t waste your money just go to Chuck E. Cheese or Sunsplash instead",
   "Great fun but a little run down. New fun card system sucks due to still not changing process for better so don’t understand why the new haste for the same results. But mini golfing is great, early special is amazing will go again before 12 to cash in on unlimited golf for $6+",
   "Huge fan of the mini golf.  Went with kids and good family fun at very reasonable prices.  It is a bit aged but that's totally ok.  Staff were great too.",
   "This a while\nBack. Me and the kids always have fun here. Batting cages miniature golf, a few rides, a decent game room and I can't forget about the food I got decent food there. For the most part, when me and the kids did go we always went at the lucky time even though I don't remember what time that was but usually is nobody there so free rides for us. Just joking but the guys operating the rides were so bored after we ran out of tickets after a couple of hours they let us slide on a couple of rides just due to the fact there was nobody ther.",
   "Scandia Fun Center is a good place to take the littles. It's free to reserve the party room for 1.5hrs  but you have to bring your own decorations and food....so we did. It worked out! Next time we have to come earlier to enjoy all the rides and activities."
  ]
 },
 {
  "name": "Swanston Splash Park",
  "address": "2350 Northrop Ave, Sacramento, CA 95825, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9db564dc-9333-11ea-a001-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "structure",
   "kids",
   "family",
   "pets"
  ],
  "link": "https://maps.google.com/?cid=2692970662869892358",
  "source": "GoogleMaps",
  "reviews": [
   "The playground area is usually well kept with areas for younger and older kids to enjoy themselves. Theres a nice large field with beautiful trees providing plenty of shade. There's tennis courts, basketball hoops and a water splash park when its warmer.",
   "There is a variety of spray ground features. The splash pad is usually packed in summer because there's a camp here. It has restrooms, baseball diamond, benches, shades, multiple sand pits, a play structure and a community center.",
   "My kids had a blast! We will be returning. The splash pad was awesome. I even went through a few times to get wet and stay cool. There is also a playground the kids also enjoyed. There are a few shady spots but if you have a shade umbrella I recommend you bring it. This park also has a bathroom.",
   "Nice clean park with lots of amenities! Water Play Area, Playground, Tennis & Basketball Courts, etc. As well as, plenty of parking! Great place to spend a sunny Sac Cali Day with family, friends & pets!",
   "Great park, I live pretty close and love to hang out with friends around there. Definitely worth visiting."
  ]
 },
 {
  "name": "K1 Speed - Indoor Go Karts, Corporate Event Venue, Team Building Activities",
  "address": "3130 Bradshaw Rd, Sacramento, CA 95827, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9e1eae28-9333-11ea-a935-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=18088301146301519307",
  "source": "GoogleMaps",
  "reviews": [
   "The racing was fun (5 Stars)! But the young girl (Leigh) working the food part needs MORE training on dealing with the public!\n I can understand she was working on getting the race results done. But don't  ignore me standing there! How about saying I can take your order in two minutes. \n It took over seven minutes to get a hot dog! Did not see her and went downstairs to get a refund when she pop up. If she can't do two jobs at the same time just do one!",
   "This place was so much fun. The only thing I wish could be different is the time because it just goes by way too fast. A definite must check out on your own and see how much fun it really is. FYI  it is all at your own risk, so be smart have fun remember there are other people are racing with you accidents do happen so be wise, careful, and respect others on the track.",
   "Hope was very helpful and fun to talk to! Everyone at K1 speed provides great customer service which is hard to find nowadays. Our work team bonding experience there was awesome and we all can't wait to go back! Thank you",
   "We had a wonderful time. Online we paid a total of $50 for 6 rides for 2 people. We had a blast! Tbh the food court was super expensive & not very good. I only took video's & took a pic of the prices. I'm thinking of doing my son's 14th Birthday party there.",
   "We love this place fun atmosphere but expensive for a family.  My only issue with it is how expensive it is and wish you got more time on track for the money you spend.  I hope that they will offer some family discounts in the future."
  ]
 },
 {
  "name": "John C. Fremont Park",
  "address": "1515 Q St, Sacramento, CA 95811, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9e6b95f4-9333-11ea-a899-14b31f159f22.png",
  "tags": [
   "family",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=8683370967494108768",
  "source": "GoogleMaps",
  "reviews": [
   "Park in the middle of a bustling scene! Lots of restaurants, bars and coffee shops that are walking distance. They usually have events going on like Chalk It Up and other family friendly things to do. \nThere is a great playground that's gated and has a stream of children for my child to play with. Restroom access is lacking so if want a clean place to go you may want to buy something at Karma or Starbucks to use their facilities.",
   "Cool little pit stop area. Always interesting stuff going on especially on the weekends.",
   "Late night/ early morning walks have been safe and without incident. I'm impressed with how clean the park is!",
   "the sign says improvements by our tax dollars ,all i see is they took out the beatiful fountain the kids loved and replace it with an old statue from k st. and still no rest rooms like every other park in this town,perfectly good restroom locked up tight",
   "A fairly nice place for the public to gather and enjoy the finer side of their city which of Sacramento."
  ]
 },
 {
  "name": "Raging Waters Sacramento",
  "address": "1600 Exposition Blvd, Sacramento, CA 95815, USA",
  "avg_visitor_review": 3.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9f4ca7a8-9333-11ea-b149-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "cheap",
   "family",
   "food",
   "kids",
   "cheap",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1161378912808127314",
  "source": "GoogleMaps",
  "reviews": [
   "Great for disabled, old people, kids 2-5. Has many rides/slides! Lazy river goes everywhere for people who get tired easy/can’t get around. Lots of lifeguards. Wave pools for baby’s!  Good food Carl’s 5$-10$. Pizza so so...The bad news prices right off the bat! Parking lot 10$. So go park  down street like 2 blocks! Locker 12$ so don’t bring stuff bring old stuff you don’t mind losing.  Don’t wear cotton(life guards will not let u ride stuff! No cotton! People say dirty water but it’s got lots of shade from trees. I don’t care about 🍁 in water.  But the owner could fork out for more signs no directions ❗️Not a place for someone who wants super scary rides.",
   "Super pleased after our first trip! We bought season passes (which were super cheap) because it seemed to be the only military-friendly family park and the discount was unbeatable. \nPark was really fun. As a mom I was grateful to see so many lifeguards (actually working - I watched one quickly jump in after a little girl) who were attentive and professional. Security was on point. Parking was not far away at all either. My 7 year old loved the river and slides. Even my teens were happy. \nFood was a little pricey but it is a theme park so that’s to be expected. \nWill definitely be back! Highly recommend!",
   "Slides were super fun and the park was really clean. I was surprised that the lines weren't ridiculous but, I should still have got to the park earlier. I wasn't able to make it to every ride before they closed but I didn't get there til 1pm",
   "This place is super cool for little ones to teens and young adults or mom and dads for their kids. This isn't as great for us older adults who like the big rides!! Sun splash is better for the older kids and adults but raging waters is a cool spot and your first entry gets you a season pass! Can't go wrong there!",
   "Average water park. Wave pool was pretty weak (4 inch waves --yawn--) No boogie boarding or rapids of any kind. A few decent water slides, nothing epic. The fair was pretty decent. Price was cheap for season pass combo fairgrounds / water park ($31). Food options were typical and normal fair prices (mostly high). Parking was good but a tad high ($15). Website and signs there show they open at 9am but it's actually 10am so we had to wait a bit. I'd give them 4 stars if they had any kind of rapids ride. The lazy river thing was meh. Seating was ample everywhere. Not too crowded even for a Sunday during the middle of fairgrounds season."
  ]
 },
 {
  "name": "East Portal Park",
  "address": "1120 Rodeo Way, Sacramento, CA 95819, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9f99684a-9333-11ea-abea-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "music"
  ],
  "link": "https://maps.google.com/?cid=6232221424537422510",
  "source": "GoogleMaps",
  "reviews": [
   "This park has a playground that is enclosed which makes it nice for littles. There's also a bunch of toys and ride ons (trikes, cozy coupe, etc) that kids are able to play with. The main reason I decides to go to this park was to have the ability to take my kids to the bathroom however the bathrooms were locked on Sunday. I'm not sure if the bathrooms are open on the weekdays.",
   "Loving the music shows the park and recreation put on for local residents of Sacramento and Placer County to enjoy great music with family and friends.",
   "I took my brother-in-law to this park. It was well kept and they had lots of dogs running around. It was a nice park.",
   "Great space. Clean park. It does get kind of dicey at night sometimes.",
   "Beautiful mature trees, gated playground, excellent Bocce court, restrooms, clubhouse, open space."
  ]
 },
 {
  "name": "Sutter's Landing Dog Park",
  "address": "20 28th St, Sacramento, CA 95816, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9fe58ca4-9333-11ea-83c3-14b31f159f22.png",
  "tags": [
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=3616968734830525883",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great fenced in and large dog park. There is separate areas for large dogs and small dogs. Seems like a great community spot with plenty of nice dogs. Also near some river walking trails and skate park. I rated 4 instead of 5 because I was worried the gravel would be hard on my dogs feet, grass would be better.",
   "Its a great place to let your dog interact with other dogs of all breeds The river is just a stones throw away so you can  take your dog's for a swim to cool em off on hot summer days",
   "This is one of Sacramento’s best kept secrets. It has some beach area along the river, a rope swing, and even some shade. What more can you ask for?! This is also perfect for trail running.",
   "Nice dog park. There isn't too much shade so it can be uncomfortable in the heat, but there's a lot of open space to run around in. Mostly dirt, so it can get muddy if it's been raining recently. On the bright side, it's usually pretty clean.",
   "Nice to walk; too many offleash dogs of the homeless"
  ]
 },
 {
  "name": "Southside Park",
  "address": "2115 6th St, Sacramento, CA 95818, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a036e122-9333-11ea-986c-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "parks",
   "kids",
   "kids",
   "delicious",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13270338647500460689",
  "source": "GoogleMaps",
  "reviews": [
   "My kiddo and I have been coming here for years. 1st for the super fun kids playground. Spinning cups, good sized fort and a real merry go round (spins really fast). The duck pond is fun when the birds are around. There's plenty of open grass area. A little to uneven for soccer, but works great for letting my dog chase the RC car around. There are fun activities here all the time too. Last few times I've been the homeless WERE NOT A PROBLEM. Something you can't say for most of the other parks downtown. Great place for a family week day picnic.",
   "Great park lovely attractions the kids had a blast. Easy to find and convenient parking.  Just use the bathroom before you go cause they need some work.",
   "Very nice park! My kids love this playground. We never went to the swimming pool yet. We like going there on Sunday before or after going to the farmers market.",
   "Great park for the kids and adults! Its spread out and there are many things to play on. Also the basketball courts have pick up games and there are tennis courts! On Sunday you can always find vendors near by selling delicious treats!",
   "I go to many events here and always have fun. SacCirque park takeover is my favorite! All these circus people come out and are available to talk and teach at discretion. Great park."
  ]
 },
 {
  "name": "Truitt Bark Park",
  "address": "1818 Q St, Sacramento, CA 95811, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a07cc41e-9333-11ea-b963-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=1033400233903595356",
  "source": "GoogleMaps",
  "reviews": [
   "Nice medium sized dog park with 2 different sections for small and big dogs. They have a water fountain for dogs and people, 3 benches with shade and balls for the dogs. Its always clean and the people are friendly. The only downside is that the parking is limited. I had to park 2 blocks away but didn't mind the nice stroll there. All in all its an A for me.",
   "Everyone is so nice here. My dog has a blast coming here! :)",
   "Small and large dog enclosures, sun/rain shades. The trees are still pretty young. Decomposed granite footing. Nice community of dog owners who use it. Might not be safe for women after dark due to homeless but fine during the days or if it's busy. Leak times probably around 6pm.",
   "Great little dog park, lots of room to run. Big and small dog side, water, trees and benches for sitting. It's is a bit dusty though, but not too bad. Will definitely be back!",
   "Great little park in the middle of midtown. There are usually a ton of people here, which is great for my one dog that thinks she's a human. For the other one, she has a great time running in big circles around the small dog park with her friends."
  ]
 },
 {
  "name": "Museum of Medical History of the Sierra Sacramento Valley Medical Society",
  "address": "5380 Elvas Ave, Sacramento, CA 95819, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a0da9c4c-9333-11ea-9278-14b31f159f22.png",
  "tags": [
   "unique",
   "learn",
   "history",
   "field"
  ],
  "link": "https://maps.google.com/?cid=3420595281311531569",
  "source": "GoogleMaps",
  "reviews": [
   "One of my favorite places so far. Very unique and educational. I'll be coming back soon. ^_^",
   "Terrific, examples of medial equipment used by physicians in the past, examples of old elixirs sold to consumers,  pharmacies and stories of the pioneering physicians. Highly recommend!",
   "Some real kool stuff. Learn and saw some awesome things that are great lessons on the history of medicine that have read about. Good for anyone that may love any history",
   "Very cool! Went here for a nursing school field trip and we thoroughly enjoyed ourselves. The curator is very friendly! All exhibits are well maintained. My favorite part was the heart valves and the iron lung. It’s not very big, but if you read every display you could spend a couple hours here.",
   "Such a fantastic stop in Sacrameto. Curator is very helpful and friendly!"
  ]
 },
 {
  "name": "Cesar Chavez Plaza",
  "address": "910 I St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a1153412-9333-11ea-b773-14b31f159f22.png",
  "tags": [
   "free",
   "library",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=11965970014328975112",
  "source": "GoogleMaps",
  "reviews": [
   "I recently stayed at the Hotel across the street. Several times throughout the night, I was awakened by homeless people yelling and fighting in the park. The park looks like it could be a really nice downtown park if they did something to address the homeless issues.",
   "Nice small park in the heart of downtown. City Hall and the Sacramento public library are both across the street. Sometimes you will find homeless in the area. Free concerts in the summer time. Also a farmers market during the summer.",
   "Central place to bike through but definitely community space used by homeless, skateboarders, & people walking through on way to restaurant or somewhere else",
   "Amazing park when they do concert in the park, or have a small outdoor event. Between those times (which is the vast majority), this place is filled with homeless and drug addicts. I wouodnt bring my kids there during the daytime, if there isnt a special event happening there. Its embarrassing and unfortunate.",
   "Nice town center. Shopping places are kinda random but they have good stuff."
  ]
 },
 {
  "name": "North Natomas Regional Park",
  "address": "4989 Natomas Blvd, Sacramento, CA 95835, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a17862ca-9333-11ea-950b-14b31f159f22.png",
  "tags": [
   "parks",
   "walking",
   "kids",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=6600637697089665875",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for walking, running or biking. Has new dog parks, covered space for farmers market but market is open only during summer months. New aquatic center going in which should make this a 5 star park. Park has a fishing lake but is not wheel chair accessable. Really nice baseball fields but no soccer fields.",
   "Amazing pond great areas  but saw a fish left for dead on a stringer when I went fishing. If you go out to fish be respectful towards the fish, if you kill them then what will you fish? I understand catch and cook for large fish but when you just leave the fish to die  You are killing the future of this pond. Whoever is doing the poaching i will be looking for you! And ill find you!",
   "Visually beautiful, peaceful quiet even with the sound of kids playing in background. Water fountains that shoot up from the ground great place to cool off in summer. I love to go here meditate and eat lunch a couple time week.",
   "Peaceful, clean and safe.  Included pic of the moon, Venus and Jupiter (from left to right).  Happy Thanksgiving",
   "My children play baseball and softball at this park and they love it. Its a great place to bring your children to play and have fun."
  ]
 },
 {
  "name": "California State Archives",
  "address": "1020 O St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a1bff33a-9333-11ea-86b4-14b31f159f22.png",
  "tags": [
   "history",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=6217981684959366623",
  "source": "GoogleMaps",
  "reviews": [
   "Sacramento Archives Crawl was amazingly interesting. History, history, history!",
   "Impressive collection of records dating back to California's (as a state) inception. The archivists are super helpful and offer some great incite as to how and where to search.",
   "Very impressive collection of the states historical records. ",
   "Very cool place to visit and learn about history and how its preserved.  Go learn a little bit about California's rich history.",
   "Went for the yearly archives crawl. I will definitely be back to research."
  ]
 },
 {
  "name": "Shasta Community Park",
  "address": "7407 Imagination Pkwy, Sacramento, CA 95823, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a20efdd0-9333-11ea-946c-14b31f159f22.png",
  "tags": [
   "library",
   "structure",
   "field",
   "library",
   "field"
  ],
  "link": "https://maps.google.com/?cid=9256175901176920998",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice park. Amazing play structure. Very close to library. Clean except for the women’s bathroom. Been there twice and both times the bathroom was disgusting with overflowing toilet",
   "Nice, medium-sized Park with a story book theme. It is located next to the public library. Well-maintained tennis court and basketball court. Two playgrounds with a nice covered picnic area in between. Also has a soccer field and a small outdoor Amphitheater.",
   "Recently moved from the east coast & I always wanted to go. & It was everything I expected & more. They have some of the best burgers I've ever tasted 😋",
   "Greatest jungle gym in the world. Best time when lights are on at night.",
   "The facilities were very nice and well maintained. The play park was very enjoyable for our students(we visited for a field trip). You can reserve the pavilion for lunch for a fair price. My only complaint was that we encountered some rude homeless near the restrooms."
  ]
 },
 {
  "name": "Garcia Bend Park",
  "address": "7654 Pocket Rd, Sacramento, CA 95831, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a260c79c-9333-11ea-97ea-14b31f159f22.png",
  "tags": [
   "parks",
   "family",
   "kids",
   "family",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=1541911654827959529",
  "source": "GoogleMaps",
  "reviews": [
   "A beautiful spring day in the capital of California in one of the multitudes of parks is a pleasure you must bestow upon yourself.  Garcia Bend is one of them. Nestled in a nice upscale neighborhood along the banks of the Sacramento River it is a treat and a half. Quiet, serene. Amenities are path for jogging and biking, fishng, Boat launch. Tennis anyone? Or if you want to just  relax under the trees lying on the green grass.  I just moved from Texas and there is no sitting in the grass. Besides the various bugs, fire ants are not fun nor friendly. Just one can ruin your day if they bite you. This is my hometown and I'm glad to be back after living in Texas over 15 years.  You can't beat the weather here in a park like Garcia Bend.",
   "Iused the boat launch.  Pretty uneventful.  I noticed the park was well maintained.  I saw a sign that said pay at a booth but never saw one.",
   "Perfect park for family fun. Plenty of shade and seats for us hard working parents lol",
   "Nice park. Very cool for family with  young kids and great for parties, exercising and enjoying nature",
   "Super cute park , my 2 year old enjoyed being able to see the water while we were there aswell . Make sure to take off before the mosquitos arrive"
  ]
 },
 {
  "name": "Effie Yeaw Nature Center",
  "address": "2850 San Lorenzo Way, Carmichael, CA 95608, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a2afc118-9333-11ea-8b6f-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "walk",
   "family",
   "free",
   "hike",
   "kids",
   "nature",
   "walk",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=789343853855929792",
  "source": "GoogleMaps",
  "reviews": [
   "This is a very nice park/nature center. The nature center is quite small, but I personally enjoyed the park the most. They have wild deer, birds,turkeys and wildlife to see as you walk the trails. Great place to take a walk and enjoy nature and wildlife.",
   "What a great place to get out with the family and see a bunch of wildlife right inside the city. Check the calendar for there free guided hikes, or show up early in the morning and take a walk quite hike. There are plenty of short trails that will take you all through out this one time walnut farm.",
   "Loved this place. Got to see deer up close and there was such beautiful scenery. It was very peaceful and relaxing. Easy trails and no way you can get lost. There are also benches along the trails to rest if you get tired. You have to pay for parking but it's definitely worth visiting.",
   "Is a great place to get kids in to nature. They have a couple of owls a hawk and snakes. Also a little museum and puzzles depicting wildlife and life of American Indians. Kids love it especially the younger set. Outside lots of short trails and American river.",
   "Lovely trails through woodlands, meadows, and river, all in an easy walk.  The staff was very knowledgeable and passionate about the animals.  Good parking."
  ]
 },
 {
  "name": "Sacramento Children's Museum",
  "address": "2701 Prospect Park Dr, Rancho Cordova, CA 95670, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a2fb372e-9333-11ea-a308-14b31f159f22.png",
  "tags": [
   "free",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15104424772155538293",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great place to visit with toddlers and younger children. My granddaughter is 2-1/2 years old and she had a wonderful time, as did her 3 year old friend. It won't offer much of interest to older children, but that is not their goal. Highly recommended for the little ones and their parents and grandparents.",
   "I went to this museum on free museum day and had a horrible experience. It was my first time coming there, and I wanted to give my 1 year old daughter a chance to enjoy learning and exploring. Right off the bat, I was told by a worker at the entrance that I would need to wait in the extremely long line that stretched along one side of the building and continued out along the side of the parking lot. She said this in a patronizing way, telling me that it was free museum day (as if I didn't already know!), and treating me with very little empathy or concern. After coming to terms with the situation, I stood in line for a while, enough to know that it wouldn't be ethical to have my daughter wait with me, seeing as the line only moved 2-3 feet every 5-10 minutes. She was already fussing and about to cry. I think it would've taken upwards of 2 hours before we reached the entrance, at which point we both would've had sunburns and tear stains on our faces. I quickly got out of the line. Then, in a final act of desperation, I asked one of the other workers at the entrance if there was any way that I could bypass the line because my daughter was having a hard time waiting. She said no, with zero compassion in her voice. Needless to say, I left! And I must admit I shed a few tears over just how bad of an experience that was. I don't know much about how good this museum is on a regular day, but now I know that the staff there can be very cold and insensitive.",
   "Not as much of a museum as a play and create event. Lots for kids to do. Craft area, water area, dress up with stage, get and grocery store area. Kids love it... Just don't expect an actual museum. Staff is great and very attentive!",
   "This place was wonderful. It was raining outside for most of our trip out to Sacramento, so this was a perfect spot for our almost 3 year old. She had fun with everything there. The staff were amazing and responsive as well. No doubt the next time we are in the area, we'll be back!",
   "What a great place to take your children without a worries of them breaking something. The place is super child proof, staff is nice and caring. \n\nSpent 3 hours there also having fun watching my kids doing all sort of things, from driving a bus to entertainment in the water section.\n\nI recommend it for an indoors afternoon activity or any day."
  ]
 },
 {
  "name": "Crocker Museum Parking",
  "address": "2nd St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a3485c9c-9333-11ea-b1ce-14b31f159f22.png",
  "tags": [
   "free",
   "unique",
   "art"
  ],
  "link": "https://maps.google.com/?cid=5297468138705250332",
  "source": "GoogleMaps",
  "reviews": [
   "The Crocker has always been my favorite museum in Sacramento I love the new additions that they've made in the past couple of years in the continuous strive to bring new Arts to Sacramento. I choose to take advantage of the first weekend of the month program that they have with Bank of America because admission is free and I usually find that time to see any new additions that they've brought to the museum and stop by to their Cafe and have lunch these are just some of the favorites from the last visit I had.",
   "An Amazing collection of art practices; Each conveying one's unique grace for us all to witness.",
   "One of the best parking Lots open for the best price $10 for 24 hours 6 a.m. to 6 p.m. $5 after 4 p.m. $5 on the weekends",
   "Jazz Night. White Chairs.",
   "Enjoyed this visit very much with my daughter.  The guide was exceptional."
  ]
 },
 {
  "name": "Glenn Hall Park",
  "address": "5415 Sandburg Dr, Sacramento, CA 95819, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a39236e4-9333-11ea-b93b-14b31f159f22.png",
  "tags": [
   "walking",
   "kids",
   "food",
   "walk",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=8961910427815339717",
  "source": "GoogleMaps",
  "reviews": [
   "Lot of bikes and unleashed dogs on trails. Scary at sunset while I am walking my dog on  leash and bikers (not allowed on dirt trails + w/unleashed dogs comes riding up on me from behind w/no notice. Pls bikers stay off trials where you are not allowed. And whenever you are out with your dog on AM River Parkway, pls keep dogs on leash. .It's safer for all + it's the law. .",
   "Food truck mania was a hit! Faves were Rudy's Hideaway and Flavor Face. Water was $1 at the beer tent. Dogs and kids had a great time. Next time I'll bring a soccer ball and burn some beer calories off.",
   "Great spot for a quick nature walk.",
   "Beautiful multi-sport park",
   "Nice baseball park area.  Good river trail access"
  ]
 },
 {
  "name": "McClatchy Park",
  "address": "3500 5th Ave, Sacramento, CA 95817, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a3e33d8a-9333-11ea-b04c-14b31f159f22.png",
  "tags": [
   "walking",
   "family",
   "food",
   "music",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16181549773739951775",
  "source": "GoogleMaps",
  "reviews": [
   "81 me and my grandkids had an awesome time at the park",
   "It is a very fun skate park. Well maintained. Depending on the time of the day when you go there could be some weird characters hanging out there on the park.",
   "This place is a treasure to the neighborhood. Great shade. Great walking path. There is a man who sells bean pies on the corner. They taste amazing.",
   "I've always had a great time at the park when ever I've gone. The playground is very nice & my son's summer camp uses the pool facility to bring the children swimming. Today, my Church had our annual \"Praise in the Park\" event. I love when we come together with other churches & the Oak Park community to praise the Lord & just enjoy the day with family & friends. Gospel music, Sermons, Vendors, Food, Family, Friends & Fun...a GOOD TIME for ALL!! 😇🙏💪✊👊✌💞",
   "Nice place for kids to play. I liked the creativity."
  ]
 },
 {
  "name": "Exit Strategy Games",
  "address": "9833 Kent St, Elk Grove, CA 95624, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a4429ba6-9333-11ea-af63-14b31f159f22.png",
  "tags": [
   "pets"
  ],
  "link": "https://maps.google.com/?cid=6923543728477114692",
  "source": "GoogleMaps",
  "reviews": [
   "My 12 year old wanted to do an escape room with her friends for her birthday, so we booked \"Pet Snatched\" for her and a few friends.  I didn't go into the room with them because that wouldn't be cool, but I did wait for them in the lounge area.  I could hear them laughing and talking excitedly during their time in the room.  They had so much fun, and I'm happy to report they escaped with almost 4 minutes to spare.  I would definitely book with them again, and I hope to get a chance to do one myself soon.",
   "So. Much. Fun!  We had a group of 10 for some birthday fun and we chose \"Conspiracy Theory\".  We did our best of getting out of the escape room and used only 2 hints.  We were SO CLOSE!  It's an experience that is memorable and I highly recommend it.  Our host, Michael, was hilarious and SUPER nice and helpful.  Thank you, Exit Strategy!",
   "We had a total blast at Exit Strategy Games! It was my second escape room experience. We booked Pet Snatched for four people, and it was just the right amount of challenging and has certainly made me excited to come back and try the other rooms. \n\nOur game master was Gigi, and we are officially her biggest fans. She joked around with us and made sure we were having fun and laughing throughout the whole game. I’m pretty sure she barked over the intercom at us at one point to simulate the snatched pets.\n\nI definitely recommend the Pet Snatched room, especially for smaller groups! I’m looking forward to trying out the Spy vs. Spy room and the Wizarding School room. \n\nIf you want to have a good time, go to Exit Strategy Games. And ask for Gigi!",
   "Awesome room! Michael was a great game master and got all my references :)",
   "This was a great escape room experience. The puzzles were challenging, but not too stressful for a casual experience. Our game master, Gigi, was fun, friendly, and helpful. I can't wait to go back!"
  ]
 },
 {
  "name": "Miller Regional Park",
  "address": "2701 Marina View Dr, Sacramento, CA 95818, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a4880946-9333-11ea-9e98-14b31f159f22.png",
  "tags": [
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=11976131073669494559",
  "source": "GoogleMaps",
  "reviews": [
   "Perfect place for events. The dead trees do appear a liability and it would be better for the city or property owners to clear them out the way. But other than that it's really a great big place to go run with the kiddos. Can't go wrong with that.",
   "It's a beautiful park right on the river. Love the sunsets for I'm here.",
   "Low key park, great for family events.  You're able to fish at this park so bring your license and gear.  There are a lot of shaded tables and a few grills.  There's men and women restroom, no doors, soap, or paper towel.  Lots of people biking, walking and some with dogs.",
   "Nice little fishing spot. Boats where flying past here all the time. Didn't catch anything that day I was there. But that's how it goes, also you need to pay for parking. I forget how much it was. Not too bad tho. Not a LOT of trash but there was some. Overall, cool little spot. I will go there again sometime.",
   "It's calming to just go sit by the water get your mind off things. See a horse every blue moon. Its a nice park."
  ]
 },
 {
  "name": "South Natomas Community Park",
  "address": "2881 Truxel Rd, Sacramento, CA 95833, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a4dedc1e-9333-11ea-80db-14b31f159f22.png",
  "tags": [
   "free",
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4032954067309391745",
  "source": "GoogleMaps",
  "reviews": [
   "This park does \"Free\" live concerts that all you do is being a friend or a group or just yourself and bring a chair to relax with a cold one from your ice chest or the vendors that are there to help you unwind. Worth going. Wish summer didn't have to end.",
   "Best park in the area, lots of play variety available. Big open spaces for kites, soccer and baseball. Lots of cool surprises tucked away. It even keeps my 12 year old interested.",
   "Very cute with a toddler section. However, there were a lot of older kids in that area. Still my nephew enjoyed it and I could easily navigate with him. Cool looking fort for kids to play around.\n\nPlease clean the areas though, there was a lot of litter in the toddler area and ice cream on the ground. I wish kids would respect the park better.",
   "Perfect park for my kids and my family's kids",
   "Safe but when there are many kids is not too safe"
  ]
 },
 {
  "name": "Granite Regional Park",
  "address": "8200 Ramona Ave, Sacramento, CA 95826, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a521d8cc-9333-11ea-ad56-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=14335333687345977325",
  "source": "GoogleMaps",
  "reviews": [
   "It's a nice park with plenty of parking and bathrooms....It has soccer fields, skate park, and my favorite a pond to fish near benches and bbq pits....clean with the exception of some geese and/or duck droppings...I come here often and eventhough I haven't caught a fish I've sewn catfish pulled out of here ...they do stock the pond and you can find dates for Granite Regional Park and all other Sacramento locations to be stocked....",
   "Peaceful but very small and limited parking that has a 3hour time limit. Not bad but not my park of choice for those reasons.",
   "I had an awesome time I caught a 5 lb largemouth bass at about 4:30 in the afternoon on a red sparkly Gary Yamamoto rubber worm",
   "Cool little local park. Pond has fish in it, but they're hard to catch!",
   "Nice, it has about 3 soccer fields, lights, a scate park with a lot of obstacles, and it's very beautiful. It does have a homeless camp but they are kind of far away by the train tracks. They stay to themselves. It has a lot of parking and it's very beautiful."
  ]
 },
 {
  "name": "Jacinto Creek Park",
  "address": "8600 W Stockton Blvd, Elk Grove, CA 95758, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a576baae-9333-11ea-8a0b-14b31f159f22.png",
  "tags": [
   "parks",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2898956831812656186",
  "source": "GoogleMaps",
  "reviews": [
   "Very cool! Lots and lots of space, kiddie pools with hoses that work , water fountains for dog and people, lots of friendly faces. only thing I can think would make it better is baggies for the people, alot of the people parks around here keep stocked on bags so I figure if anywhere, they should have them at the dog park . That's all! (:",
   "A well-maintained half basketball court, a modern playground, and covered picnic area, make this a good park for family outings.",
   "My dog loved it. Plenty of room for dogs to run and play. She even made a friend. A cool mellow, playful dog named Bones.",
   "Nice dog park. Very big. Friendly dog owners.",
   "Nice and quiet in the morning. Playing ball with Gretchen."
  ]
 },
 {
  "name": "Franklin D. Roosevelt Park",
  "address": "1615 9th St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a5d0256c-9333-11ea-8f8e-14b31f159f22.png",
  "tags": [
   "field",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=13188058692473487980",
  "source": "GoogleMaps",
  "reviews": [
   "Best place to ball in Downtown Sacramento with some actual competition and good sports. Love the trash talk and how many people come back every weekend. Love coming here with my friend",
   "Got some new kinda workout contraption.  Looks pretty useful. Saw 4 people working on it . At noon some soccer goes on. And basketball afternoons.",
   "The surrounding area is lovely and the workout center is great! I go there with a fitness and self defense group on Sunday mornings, and I love it! My one suggestion would be to add more amenities in the rest of the park.",
   "I've been playing softball here for years. Field is well taken care of for a public park. Location means cops drive by all the time so it's safe. Great basketball courts (2) and a new public gym setup. No quality bathrooms.",
   "I only go here for the annual beer n chili festival. Some years there are not enough trees for the amount of people to enjoy some shade. I do love that it is close to me and that it's got a fence around the perimeter so we can do beer tasting without being penned in"
  ]
 },
 {
  "name": "River Bend Park",
  "address": "2300 Rod Beaudry Dr, Sacramento, CA 95827, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a6291c38-9333-11ea-832d-14b31f159f22.png",
  "tags": [
   "hike",
   "field",
   "family",
   "walking",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=13299131916403720630",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to feel like you're getting away from the city. Lots of trails to get a little hike in. The wildlife is lovely.. Expect to see numerous species of birds including hawks, wild turkeys, valley quail and waterfowl. Blacktail deer and coyotes are around as well. Lots of mushrooms in the fall/winter and lovely flora in the spring. It's in the native range of the pipevine swallowtail, a gorgeous butterfly that you don't see in many places.",
   "The scenery is pleasant. Good place to hang with Family for bar b ques, fishing, boating sports. Boat launch as well as vehicle and trailer hitch parking(parking pass required w/trailer).\nPlayground and recreational field. Bike trailer for walking, or biking.",
   "Wonderful hiking and bike trail. Great places to be next to the river and see wildlife or go to the grassy area and have a picnic.",
   "Nice park, and when you cross bridge there is another park just as nice.",
   "Fabulous  to be walking  to tha river so much fun for the kids"
  ]
 },
 {
  "name": "Jensen Garden Park",
  "address": "8520 Fair Oaks Blvd #2504, Carmichael, CA 95608, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a67d7cc8-9333-11ea-aa84-14b31f159f22.png",
  "tags": [
   "eat",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=16892941792940698414",
  "source": "GoogleMaps",
  "reviews": [
   "This Botanical Gardens park is Beautiful, It's always a wonderful place to stop & eat our lunch.. or if you're up to it, It features:\n* paved walking paths,\n\n* A Ton of Gorgeous Vibrant colored flowers of all sizes, shapes & breeds...\n\n* It's Nesseled in this cute little knoll\n\n* Perfect for Pictures, Groups, or Couples..\n\n* Best time to go is Now - Oct\n\nEnjoy !!!!",
   "Such a lovely peaceful garden. I've wanted to come here for years. I was not disappointed. I'm looking forward to returning again.",
   "Beautiful small garden! Loved the little walk! So many beautiful flowers!",
   "beautiful park. great for pokemon",
   "A safe place to relax. Admirable sequoia trees!"
  ]
 },
 {
  "name": "Bertha Henschel Park",
  "address": "160 45th St, Sacramento, CA 95819, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a6c9c862-9333-11ea-86d1-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "structure",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2520282942102896956",
  "source": "GoogleMaps",
  "reviews": [
   "Great little park tucked away in this residential area. Nice kiddie water feature and tons of jungle gum equipment.",
   "Some bumps and holes in the grass on the field but a very nice play structure for kids and a refreshing water feature in the summer.",
   "Nice park with playground and dog areas. Wish the fountain worked... it doesn't. Always plugged up and obviously not safe for human use. No dog fountain is a shame since so many folks bring dogs to the park.",
   "Great place to bring your child(ren) to interact with other neighborhood kids. Lots of community toys to play with and at a great location!",
   "Fun park with a tot splash pad in the summer. 4 basketball hoops and a large green area for other sports"
  ]
 },
 {
  "name": "North Natomas Community Park",
  "address": "1839 N Bend Dr, Sacramento, CA 95835, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a71a80b4-9333-11ea-bacc-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11036858702759218556",
  "source": "GoogleMaps",
  "reviews": [
   "Very clean and nice park. The park is very interesting.  The place has ever green grass.  The view is very interesting.  Here the grass was well maintained and the grass is well watered. There are little tree in the area.  It is so spacious and attractive that it creates a special joy.  It is a great place for children to play and play as they do.  It is a place that creates a special feeling for adults as well.",
   "Its a big park. If you don't give specific locations you could end up on the other side of the park. We use it to host a flag football league for kids on Saturdays. The league is call Refugees community service. Its a great environment for kids to play without worries of a negative surrounding.",
   "Nice park for a walk or to kick around a soccer ball. Walkway connects park areas (tennis courts, volleyball nets, multiple play areas). Mature trees, playgound, benches, and pretty sculptures are highlights.",
   "Great park and infrastructure for the whole family.  Large and easy parking, accessibility for wheelchair users, playground and water playground in good conditions.",
   "Nice quiet park."
  ]
 },
 {
  "name": "Sand Cove Park",
  "address": "2005 Garden Hwy, Sacramento, CA 95833, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a793cf90-9333-11ea-92c7-14b31f159f22.png",
  "tags": [
   "cheap",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=18418416716734933467",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice spot. Great beach. You can fish. Pet friendly. Everyone that we met was very nice and all people just relaxing and enjoying the beach.",
   "There is an automatic gate, that opens at sunrise and sunset. Prior reviews state the gate closes at 6 pm. I have heard the rates for admission have changed, so I won't post that info until I can confirm. It's a great beach and sometimes during the week, there are not many folks there",
   "We always go this place beer can Beach it's great for kids nice Beach but last time I went and got a bladder infection pretty bad so adult probably should steer clear of the water... Idk.. but other than that nice when people no one bite the good place to just come and chill off Garden Highway. For cheap",
   "Nice place to bring the kids and have a picnic. You do have to pay for parking",
   "It was awesome. We celebrated my sister's birthday there. A lot of people were fishing and catching some good sized salmon."
  ]
 },
 {
  "name": "Tanzanite Community Park",
  "address": "2220 Tanzanite Avenue, Sacramento, CA 95834, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a7e37666-9333-11ea-adcc-14b31f159f22.png",
  "tags": [
   "kids",
   "nature",
   "walking",
   "free"
  ],
  "link": "https://maps.google.com/?cid=629470903424847191",
  "source": "GoogleMaps",
  "reviews": [
   "Nice park this is ! They have a covered BBQ area, playground items for the kids, restrooms, a man made lake and a skatepark.\n\n  The park appears to be well maintained for the most part and even though this park is next to the freeway it still feels fairly quiet in a nice place to go if you're looking to relax for a few. \n\n  I would advise that you be careful of walking and stepping in the \" goose fecal matter \", which is just nature being nature.  I'm sure the park's maintenance for the city does the best they can but still be careful of stepping in it. Other than that a well rounded enjoyable park that I would recommend. Hope you have fun with your kids over there.",
   "Great place to come bring the dog, have a picnic/BBQ, play frisbee, basketball, soccer but they have a skate park that's free as well as a lil fishing pond that has big mouth bass, bluegill, and a few other species of fish...there is a bathroom that's clean, it's well lite and easy to get to from the freeway and surface streets....its in a nice neighborhood that's well kept and looks to be very proud of their community...there's plenty of stuff for the lil ones as well...a big sandbox that has a modern jungle gym with slides and all the fun stuff needed to let them let you enjoy a minute ...",
   "This park is a great park. We love it but the pond needs to be cleaned. More trash everyday. Clean up your mess people!",
   "I went to the skatepark. I had a really good time and made some awesome friends. I busted hecka tricks too Gang gang",
   "Nice to have ducks and dogs!!"
  ]
 },
 {
  "name": "Howe River Access",
  "address": "7971 La Riviera Dr, Sacramento, CA 95826, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a83b81b6-9333-11ea-851d-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "parks",
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=8552954561972950516",
  "source": "GoogleMaps",
  "reviews": [
   "This access us behind Sac State University. You can park at the road or inside the  parking area. Good running and biking trail. Recharge myself every time when jog or bike on this trail.",
   "Less clay, more sand on rivers edge. More \"beach-like\" than other parts of the American river. Beautiful bird's around. Numerous water fowl that are accustomed to a human presence so you may get to see em up close if you go here! We found a group of kids swimming and had lots of fun.",
   "Been coming here since I was a kid. Now my kids get to enjoy it they love it",
   "These \"off-shoot parks within a park\" are absolutely awesome and a great escape for some peace of mind along with quiet, cool, and serene surroundings.",
   "It's free if you walk or bike in. I think it's $5-6 with a car. Probably more with a truck and a boat trailer.\n\nIn the winter, it's relatively quiet, a few cars and trucks in the lot. During the spring/summer the lot is pretty full."
  ]
 },
 {
  "name": "Kokomo Park",
  "address": "4901 Kokomo Dr, Sacramento, CA 95835, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a89a43f0-9333-11ea-90fd-14b31f159f22.png",
  "tags": [
   "field",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3905020757990526479",
  "source": "GoogleMaps",
  "reviews": [
   "It was a 5 star experience cause I was with the boys, but the park itself is somewhat small. It is perfect for one big party but not more than one. However, if you're here for some playground time and that's it, you won't need to fight for space.",
   "This is a cute neighborhood park. There is a large field with soccer goals, basketball courts, 2 wonderful shaded playgrounds, and a BBQ area you can rent out for small family gatherings. The huge drawback is the lack of a restroom facility, as well as there is no fence along the boarders near the main road leading out of the small community. They do have 2 porta potties along the main road, which I think they should leave near the BBQ area for safety.",
   "Not a bad park definitely a step up from the rest",
   "Kokomo has playground equipment, a walking path, volleyball nets and soccer goals!",
   "A bit smokey from the fires this morning. I love the open space"
  ]
 },
 {
  "name": "Oki Park",
  "address": "2715 Wissemann Dr, Sacramento, CA 95826, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a8e35af6-9333-11ea-bd7a-14b31f159f22.png",
  "tags": [
   "free",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=16480946097406757310",
  "source": "GoogleMaps",
  "reviews": [
   "Nice, clean, quiet park. Splash pad is free, $2 to swim. Bbq pits and picnic tables available. Very reasonable price to reserve space for a picnic.",
   "Great Place for Kids and Family to take rest and fun.",
   "Quite a lovely place to lay down in the shade",
   "We reserved the large area here for a bbq celebration. Signs are up that's great. Nice to be right by the pool and playground. But you couldn't take two seconds to get the trash off the table.",
   "Nice gated play ground"
  ]
 },
 {
  "name": "Underground Tours",
  "address": "101 I St, Sacramento, CA 95814, USA",
  "avg_visitor_review": "",
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=5587770366607390174",
  "source": "GoogleMaps",
  "reviews": []
 },
 {
  "name": "Ancil Hoffman Park",
  "address": "6700 Tarshes Dr, Carmichael, CA 95608, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a93c50a2-9333-11ea-9637-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "food",
   "walk",
   "nature",
   "family",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=14936912369318475925",
  "source": "GoogleMaps",
  "reviews": [
   "It's an amazing getaway hidden in the middle of Sacramento proper. A golf course, driving range, a wonderful nature center and best of all nature trails.  The deer and wildlife are so sweet to see and enjoy in their natural habitat.  It's my favorite walk and run trails.  3.25 miles around.  The blackberries are a wonderful treat in the summer!",
   "We love Main Event!  Great place to catch a game with a cold beer and fries (we love the sweet potato fries).  Service is great, you can sit on the patio and watch the first tee drives and swap golf stories with the locals.  Food prices are very reasonable, wish they offered a full breakfast though!  They also have a trivia night and live entertainment some weekends.",
   "Beautiful park with wonderful wildlife and bird watching opportunities. There is a nice building with some special animals and interesting information about the local fauna as well as some gift shop items. It's very inexpensive for parking and worth a visit for anyone who enjoys nature. The trails are ideal for a walk and the river is nearby.",
   "I've been bringing my family here for years.  It's a perfect family park with restrooms, nature trails, and access to the river. Good for catching frogs and playing with dogs.",
   "Just wanted to share this information with everyone, since Ancil is a local gem, and I see some confusion in the comments below...You do have to pay for parking....unless you visit the golf course or the pro shop. All it takes to get in is to tell the ranger at the gate \"pro shop\", and you won't be bothered further. I wouldn't go park at Effie Yeaw, that makes it pretty clear you aren't hitting the links. Hope this keeps more money in your pocket and less in the states hands."
  ]
 },
 {
  "name": "Firehouse",
  "address": "1112 2nd St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a98c93a2-9333-11ea-a741-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "eat",
   "food",
   "delicious",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=4308825681509741004",
  "source": "GoogleMaps",
  "reviews": [
   "Their pasta melts in your mouth. The Risotto dish, was wonderful. All around the restaurant were happy faces. I enjoyed every bite! Will definitely come back to try the other entrees!",
   "Just look and see.  Fantastic Happy hour eats and drink.  Tahoe Blue as their well for $6.00 during happy hour.  $10 appetizers.  Fabulous.",
   "The day after Valentine's Day was my first time at the Firehouse. The decor and lighting were wonderful, with plenty of space between tables, adding to the intimacy it allows for conversation. The service was top notch, with continual water, and bread refills. Our waitress was amazing, and wonderful, making great suggestions, and checking on us regularly. The food price may seem a bit high, but every course was easily worth it's price. Perfect portions, and the food tasted impeccable. I will definitely be back.",
   "I went there for a Best Friend's Wedding. It was quite the ambiance. Certainly demonstrated a measure of beauty and elegance that fit the wedding reception quite well. The staff was very friendly. The food was very tasty. The drinks were well-made that goes especially for the cocktails. If I live in California I would certainly have more events here and definitely eat there on a regular basis but alas I am from the East Coast. I look forward to going back there one day",
   "This place had always been my favorite restaurant in town. Love the service her, it's always up to standard. I had my wedding her in January and staff was awesome, Randy was fantastic. Went above and beyond! This is a beautiful place to have your wedding if you haven't considered it. I would say this place is affordable once you add it up comparing to some places nearby. The Firehouse has a beautiful courtyard in the back and is lovely for an outdoor wedding.\r\n\r\nFood was delicious! All of my guest couldn't stop raving about how great the food was. I got the Filet Mignon and Daily catch duet plate for my guest.\r\nFirehouse had a wedding showcase once a year and I was able to bring my future mother in law to that prior to booking the Firehouse. She was able to sample the appetizers. From there, we narrowed down to what she liked, which made it easy to choose for my wedding menu.\r\n\r\nAll my vendors had a good experience setting up and did not have any problems on the day of (or at least no complaints). If you're thinking of having your wedding here and have outside vendors, don't worry about it, Randy will take care of it for you!\r\n\nAnyways I don’t think my review does this place justice. Give Randy a call and he’ll make wedding magic happens.\n\nOf course you can dine in and see if you like the food too!"
  ]
 },
 {
  "name": "Localis",
  "address": "2031 S St, Sacramento, CA 95811, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a9d90650-9333-11ea-b9e1-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "tasting",
   "food",
   "delicious",
   "knowledgeable",
   "tasting",
   "delicious",
   "tasting",
   "food",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=3414495589440294193",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing attention to detail. The food was outstanding. With each dish the chef would explain where his inspiration came from to create it, how it was constructed, and what was in it. Me and my wife felt like celebrities in their. Unfortunately I don't have any Michelin Stars to hand out, so I will only do what I can, which is write a review and tell all my friends and family to go experience this amazing restaurant. 🥰😍🤩🤗",
   "All the food was fantastically prepared, well-balanced, and the flavors were spot-on, if a touch on the salty side (which I like, but beware of you don't; this is the only knock).  Two main complaints:  the glacial pace, and a few blocks away, I thought, \"I could really go for some food.\"  The full plates vary widely in portion size/\"fill-up\" status, from what I could see, and not all are equal.  Mine had few, albeit tasty, bites.  They're apparently known for their tasting menu, so maybe give that a swing.",
   "Inconspicuously located, Localis has an interesting and delicious experience to offer. The staff was all pleasant and knowledgeable about every step of the way. We ordered the fixed tasting menu as well as a small plate and a large plate. The scallop course was a wonderland of texture and the octopus was cooked excellently. Would definitely recommend.",
   "I had the best 4course take-out tasting menu last week and wine pairing in little mason jars!! Delicious food & Amazing wine! Plus the fried chicken and dry Riesling wine pairing I picked up Monday was outstanding!!!!",
   "Make a reservation and plan for a long and memorable dinner. We had a 7:15pm seating and ordered the 7 course tasting menu with wine pairing, we wrapped up dessert just after 10pm. There are no words to describe what an incredible experience the dinner was. By the time we got to dessert I forgot to snap a photo! This was our second time in and we will definitely be back any time we have something to celebrate."
  ]
 },
 {
  "name": "Mulvaney's B&L",
  "address": "1215 19th St, Sacramento, CA 95811, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aa2b6c5c-9333-11ea-994a-14b31f159f22.png",
  "tags": [
   "food",
   "tasting",
   "food",
   "creative",
   "delicious",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7899576876787695894",
  "source": "GoogleMaps",
  "reviews": [
   "This restaurant has consistently been a fantastic place for great food and great atmosphere. We take out-of-town guests here. They have a family-style meal once a month that is SO much fun! That's an experience everyone should try. We have done it several times. Very reasonable price and terrific food and fun!",
   "Extraordinary ambience and very amiable service. The meals were crisp and enchanting. Will surely recommend this restaurant to others. Reasonable rates and generous meals. Good job.",
   "I love this restaurant! They offer high class dishes, their menu is nice, The cook in that place is a specialist, I like very much tasting all their food. The dishes are consistently of high class, the service towards the clients  is good. I visit often this place and I not even once was disappointed.  I highly recommend it.",
   "Wonderful restaurant - the menu is true to farm-to-fork, with some very creative offerings. Well prepared and absolutely delicious. We started with the heirloom tomato salad which was large enough to share, and then had the pork tortellini’s and duck for the mains. Perfectly done. Great bar, excellent, friendly service. It is a bit on the noisy side when the place is full, but it quieted down after a few tables cleared. Reasonably priced for a high quality restaurant...our waitress was nice enough to waive the corkage fee. The wine list has a lot of local wineries, also nice. Our only small complaint was being seated at the kitchen counter when we had reserved a table, but the hostess moved us to a two-top when we commented on that. The counter (see photo) is supposed to be a great place to sit, since it opens on the kitchen and the staff let you sample other dishes. Maybe next time...and there will be one.",
   "The ambiance is great! The smell of the food being prepared makes your mouth water in anticipation of the meal to come! There is a courtyard for small weddings or gatherings. Parking is hard to find due to the downtown location, but worth the walk if you end up a block away. I highly recommend this B&L!"
  ]
 },
 {
  "name": "The Kitchen Restaurant",
  "address": "2225 Hurley Way, Sacramento, CA 95825, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aa7ce7ba-9333-11ea-81dd-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "drink",
   "food",
   "unique",
   "food",
   "tasting",
   "walking",
   "eat",
   "unique",
   "food",
   "foodie",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=14106886741384964200",
  "source": "GoogleMaps",
  "reviews": [
   "Greeted by a smile from Chef T - warm & pleasant welcome to his customers! Our waitress was very attentive and sweet. This Elegant Modern Cuisine food was served with a beautiful presentation and awesome taste. Chef T prepared Salmon & Grits for me, the best grits you'll ever eat. Salmon was cooked to perfection! He specialized my moms Vegan Dish (Vegan Burger w/ Baby Green Salad). If you have a sweet tooth, order the peach cobbler for dessert. Make sure to stop by while your in Mercer Island!",
   "This is the food experience you’ve been wanting you’re whole life. The staff and chefs are entertaining, the food is unbelievably good and the experience is hands down amazing.\n\nThe menu changes, but the quality and flavor is always top notch. If you haven’t experienced the Kitchen, make your reservation today!!",
   "This place is incredible. Amazing service, fantastic food. They make the night so much fun and very memorable! (Depending on how much you drink) Obviously expensive, but worth every penny. You need to experience this at least once in your life.",
   "Fantastic and unique experience ....walking in the kitchen tasting food before we even sat down to eat was a real treat.  At one point I had a glass of champers an oyster and a cookie dough ball!!!  Definately high end cost ($$$$$) but we went all out. Staff were awesome and relaxed...but very efficient.",
   "This is a one of a kind dining experience. A foodie who loves fine dining this food was some of the best ever experienced. Not only is the food worthy of its Michelin rating, the way the meal is presented is super unique. You have an opportunity to be in the kitchen along side the chefs and servers watching the preparation, ask questions, observe plate presentations and watch table service. The staff was incredibly knowledgeable and friendly yet non intrusive to the whole experience. Worth every dollar spent."
  ]
 },
 {
  "name": "Lucca",
  "address": "1615 J St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aac0809e-9333-11ea-84a0-14b31f159f22.png",
  "tags": [
   "music",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17258455834806891267",
  "source": "GoogleMaps",
  "reviews": [
   "If you want to surprise anyone for a nice dinner. This is the place. Very nice atmosphere. Music is great. Went there during first week of Jan. The outdoors area can be very cozy and warm. Expect to pay more than you are used to. This could easily be a place for a nice romantic dinner.",
   "A large, dark, romantic eatery. For fifteen years excellent meals have been plated for both patio and restaurant seating. As the night is comfortable, we sat on the heated patio.\n\nThe appetizer, \"Zucchini Chips,\" is a little like potato chips only so much better. Leah, our server, informed us the chips are vegan and fried in rice brand oil.\n\nThe accompany rustic Italian bread is served with both butter and olives oil with balsamic vinegar.\n\nThere are four vegan offerings. I selected the stuffed peppers which turned out to be delicious.  A half of both red and yellow peppers are stuffed with rice and white beans, given a kiss of a rich tomato sauce, then sprinkled with arugula. I drizzled a bit of the olive oil/balsamic vinegar bread dip on the arugula.\n\nThe meal finished with an incredibly rich raspberry/champagne sorbet.\n\nEverything is wheelchair accessible.\n\nThis is a very special restaurant and I highly recommend it.",
   "This is a really nice place to eat in the evening! They got either a nice patio or a dining room you could eat in! The service was really nice and pretty relaxed! The atmosphere was very relaxing, especially with the nice dark wood ceiling and candle lights. The light bulbs stringing around might have been a little to excessive, but the 2 small fountains is what really made the difference! For starters, i ordered the zucchini chips which were a pretty healthy alternative to regular chips! I had the burger for the main entree and it was cooked pretty well and everything from the bun to the lettuce felt fresh and crisp! The fries were salted and seasoned as well! I would come back here if i was in the Sacramento area for dinner! Hopefully they'll keep up their really good service and freshen up the menu!",
   "Very good food! The pork chop is a must have. It's cooked perfectly and is a nice big cut. You can't go wrong here..",
   "Their pasta melts in your mouth. The Risotto dish, was wonderful. All around the restaurant were happy faces. I enjoyed every bite! Will definitely come back to try the other entrees!"
  ]
 },
 {
  "name": "Bacon & Butter",
  "address": "5913 Broadway, Sacramento, CA 95820, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ab127194-9333-11ea-9518-14b31f159f22.png",
  "tags": [
   "organized",
   "food",
   "food",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16334098121250348844",
  "source": "GoogleMaps",
  "reviews": [
   "Love Bacon & Butter and food is superb but would not recommend takeout during COVID.  They don't open until 9 and then get so many orders that the crowd descends at 9:45 like the website directs but it's another hour before you get your cold food.  I'll be back, but not for takeout - the system is just not organized enough for their level of popularity.  Maybe it would be better on a weekday",
   "Food was good.  Very popular place.  Long wait at 9am on a Saturday, about 30 minutes.  Once seated, food is served fast.  Friendly service.  Warm atmosphere.  I went with my best friend so of course we had a nice time.",
   "The food was excellent. The coffee was fantastic and frequently topped off. The wait was long on a Sunday morning, but totally worth it. I got the kitchen sink it was very good. Friends got the biscuit sandwich and the cinnamon roll and both said they were amazing.",
   "Great service, great food, clean place.  Don't let the long line dissuade you, I have never waited more than 15 minutes to be seated.  I would be willing to wait longer than that to eat here anyway.",
   "We went here for a breakfast date on 02.08.2020. The wait was about 30 minutes for 2 people which isn't bad for this place because it's always busy.\n\nThe food was awesome, we tried the chicken and waffles with a side of the house bacon. Drinks were average and personally a fresh orange juice or water or even plain coffee would have sat better.  \n\nThe checkbook of poems that you can sign when you're through was a nice touch that we enjoyed and I have photos of the pages we signed.\n\nPricing was reasonable. If you're willing to wait a bit, I would recommend this place."
  ]
 },
 {
  "name": "Biba Restaurant",
  "address": "2801 Capitol Ave, Sacramento, CA 95816, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ab571e86-9333-11ea-87b2-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17984189045659692349",
  "source": "GoogleMaps",
  "reviews": [
   "The perfect Italian Cuisine experience. Glad the competition was too busy to seat us. Would have never found this gem. Potion sizes are small for a big eater like me but the quality was excellent. With appetizer, meal, and dessert, I was satisfied. Highly recommend.",
   "I have been visiting Biba for a few years and believe their menu and flavors are dynamic and improving. \nThe presentation is excellent showing an unlimited creativity.\ni believe Biba has done a great job at teaching... viva Bologna!",
   "There's nothing like fresh pasta. The food was good. Great service! Yummy desserts. Fine dining atmosphere.  We like to go there on date nights or birthdays.",
   "The food is amazing! The service is amazing! We had the lasagna last night and the our friend raviolis never was and pesto sauce that was absolutely delicious you cannot go wrong with this restaurant! There's a great tribute to Biba and her family as her Legend lives on!",
   "The service was excellent.  Clean friendly and quick to be seated.  The foods taste was awesome.  The plating and decor could use some updating but overall was a great experience.  If you get a chance stop at the bar first and chat with June.  For an appetizer drinks and two entrees it was only about $150!"
  ]
 },
 {
  "name": "Kru Contemporary Japanese Cuisine",
  "address": "3135 Folsom Blvd, Sacramento, CA 95816, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ab96bfca-9333-11ea-a0ca-14b31f159f22.png",
  "tags": [
   "food",
   "knowledgeable",
   "food",
   "food",
   "delicious",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=11811366522740469602",
  "source": "GoogleMaps",
  "reviews": [
   "Met with some colleagues for dinner. Nice, classy spot with great service all the way around. I ordered the Firecracker Roll and the Lobster Tempura! Both of them were fantastic! Do not hesitate if you like fresh tasty food with an amazing atmosphere. The rest of the group had several different sushi orders, oysters, etc. and they were raving about every bit of it.",
   "Arguably the best place for sushi in Sacramento.   One of the best in Ca.  I usually go for Omekase.  The bar is superb.  Service in the dining room is excellent.  The atmosphere is lively without being frenetic and posh without being forced.  Parking can be a bit dicey but a valet is available.  One of my very favorite restaurants full stop.",
   "Changed from 4 to 5. We went back and the food, service, drinks, atmosphere... could not have been better. The menu rotates enough and servers and knowledgeable on the menu and made great recommendations. Very happy and cannot wait to go back.",
   "Yesterday was our first time in this place. But It is absolutely not the last. We enjoyed the evening very much with the courteous service, with the magnificent  food and fine drinks and with the honest payment. We will definitely visit there soon.",
   "The decor, food, service and value are all top tier. Everything I've tried here is delicious and fresh. Even the table top seating is nice and comfortable. I haven't sat outside yet, but when walking into the entrance, glancing over at the outdoor seating, it does look very inviting. I'd recommend this place for a romantic dinner, and for a large group, as it has a large room to accommodate around 20 people. Looking forward to returning soon."
  ]
 },
 {
  "name": "South",
  "address": "2005 11th St, Sacramento, CA 95818, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/abe0e84a-9333-11ea-8149-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11976946661895372883",
  "source": "GoogleMaps",
  "reviews": [
   "Always great food and service. The Petey’s Fried Chicken is the best fried chicken I have EVER HAD! And the homemade biscuit with the honey butter is to die for. I also love their wine and beer selection.",
   "Stumbled upon this Southern food dynamo just blocks away from the State Capitol. AMAZING food and service. Between all of us, pretty sure we tried everything. Get here and EAT!",
   "Great food and a cute place. The place has a very relaxed and I pretentious feel. It is light, airy and comfortable. You order your food at the counter and then seat yourself. Service is quick and friendly. The food is fantastic! We had hush puppies to share. They were crispy on the outside and nice and moist on the inside. The homemade buttermilk dressing is out of this world - creamy and flavorful and the perfect dip for the hush puppies. I ordered the fries chicken which again, was perfectly crispy on the outside and moist and flavorful on the inside. The grits were super cheesy but maybe just a tad bit under. That said, I still really enjoyed them. The corn bread had a honey butter glaze. It was good enough to be dessert for me. \n\nDo yourself a favor and go have a meal at South. You won’t regret it.",
   "Great southern style Staples, huge portions, friendly service. Definitely come here for some tasty food. Recommend the fried chicken, hush puppies, and fried cod.",
   "I give South a 3 star rating because I use a power wheelchair and could not enter into the building without help! It took 2 other people's assistants to get through the door. Because there is a 1\"1/2 lip at the door that I could not get over with my power chair! The door does not meet ADA standards! I'd like to thank the 2 people who helped me get Into the building! The food however is outstanding! As is the sweet potato pie! My wife and I sat outside and enjoyed our dinner along side another couple. However another couple who went inside to place their order and left their 2 teenagers outside to sit at their table, were chased off by staff  As I guess you can't keep tables for the rest of your family as they order   food for everyone else. As I said the food is great. However I could not get into the building without help from 2 other people. So we will not be back again!"
  ]
 },
 {
  "name": "Tower Café",
  "address": "1518 Broadway, Sacramento, CA 95818, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ac2bad54-9333-11ea-b9c0-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=17467647007537499128",
  "source": "GoogleMaps",
  "reviews": [
   "A great local dining experience. No wait to be seated outside at 5 pm, but the time we left there was a short wait for people arriving (and more limited parking). We ordered Dutch mushrooms and Polynesian guacamole, both were incredible. Portion sizes leave you with leftovers. I  was very happy with my fish and chips. Save room for dessert!",
   "The host was very nice, there was no wait to be seated. Our server took a while to come by our table to even greet us. My food was good, this is the second time I ordered an omelette here. I wish they had a create your own omelette option.",
   "The food was delicious. All 10 people in our group enjoyed their selection. The service was excellent, fast and efficient. Atmosphere was relaxed. I like the fact that they posted at the table not to exceed 90 minutes is awesome. It was a great experience all the way.",
   "WOW! This place NEVER disappoints. There’s a reason there’s a wait to get seated! The service is always friendly. Quality and taste of food is on point. A staple for Sacramento! I always bring my out of town guests here!",
   "I eat in this lovely spot quite often! This is the best place to grab a bite.  I visit this spot at least once a month. The cooking is very good, the crew is professional and the charge is decent. I enjoy eating in this restaurant to have a rich lunch."
  ]
 },
 {
  "name": "Ella Dining Room & Bar",
  "address": "1131 K St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ac7d01be-9333-11ea-801d-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=17300120321353988894",
  "source": "GoogleMaps",
  "reviews": [
   "This restaurant is absolutely one of the most pleasant restaurants in the area. Always when I go there I am extremely glad. They always keep their high  level service and the highest level of dishes  they give. You can never go wrong with this place. Highly  recommended.",
   "My boyfriend and I went out for an early Valentine's Day dinner to Ella and I am so glad we made that decision! We ordered the Shrimp cocktail and Bone Marrow for appetizers and it was delicious! Afterwards we had the Tomahawk steak with the golden potatoes and we barely finished it. Everything was so delicious and the staff was superb. It's best to make reservations right away! There's parking across the street at the Hyatt or there's Valet. All in all it was such a great experience and a wonderful evening! Definitely recommend for a night out and good eats.",
   "The food, atmosphere, staff - everything is phenomenal. I can’t recommend this place highly enough for a special dinner out! \n\nWhile nothing in the menu is specifically listed as gluten free, many dishes were naturally gluten free or we were able to modify it to be served gluten free.",
   "This place is my number one restaurant.  Of all restaurants I know I like it most. I never miss an opportunity to go to visit this restaurant. everytime  I feel like having a fair meal, this is the place that comes first to my head. very good and   food and a large menu.courteous team, and pleasant atmosphere. In addition to that, the price is reasonable. I suggest this place with great pleasure.",
   "Perhaps one of my favorite places to eat at. Did a birthday dinner this past Friday for my friends birthday. We had a 9pm reservation and had to wait 30 minutes at the bar while waiting for our table. The staff eventually gave us a private room and 3 complimentary appetizers! Wow! We didn't expect that at all! Thank you Ella! Staff and service is bar none."
  ]
 },
 {
  "name": "Cafeteria 15L",
  "address": "1116 15th St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/acbffe4c-9333-11ea-bdd9-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "family",
   "eat",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15700142467618480941",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious appetizers and entrees, loved the brussell sprouts with bacon... great wait staff, attentive and fast service... fun atmosphere, really big restaurant, weird restroom... it would have been nicer if the hosts in front bid my party of 8 goodnight as we leave the restaurant... definitely coming back for the food!",
   "4.826759\nAmazing food that is perfect for all occasions!\n\nWant brunch on the weekend? Need dinner before a concert or basketball game? Just passing through? Cafeteria 15L is the go-to spot that will make you come back again and again!\n\nI've been multiple times, and have always left incredibly happy and satisfied. I highly recommend the Chicken and Waffles, and the chicken is always juicy, and the waffles are perfectly nice and fluffy! Off of the brunch menu, I love the Breakfast Waffle Sandwich, which comes with some of the best potatoes ever.\n\nSeriously, Cafeteria 15L has food for ever occasion and always delivers and excellent meal! I cannot recommend it enough!",
   "This is a very cool place to eat. Very wide open feel. Great staff with excellent food!\nYou will find something for every taste pallet here!! Very family friendly with reasonable pricing. Great menu selection of just about anything! Delicious!!\nVery good!!\nThank you!!",
   "Met a friend here for lunch - delicious food and great service. Our waitress was very kind and on her game. Lots of light and the ambiance was cool. Overall a pleasant experience; will definitely be back soon! *Valet parking available .. and the Spicy Ahi Tuna Poke was nothing short of amazing. Also, the mixed greens were on point.",
   "Been to Cafeteria twice in the last 6 months. Was there for lunch one day after a conference. Was super impressed by how fast the food came out, but it was also freshly made. When we went for breakfast, same thing! Their potatoes were delicious. It’s such a great atmosphere, and a pretty cool bathroom as well."
  ]
 },
 {
  "name": "Il Fornaio",
  "address": "Wells Fargo Center, 400 Capitol Mall, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ad17949c-9333-11ea-9206-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "family",
   "food",
   "knowledgeable",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16108666349360360117",
  "source": "GoogleMaps",
  "reviews": [
   "We've never had a poor experience here... Servers are always VERY professional, VERY knowledgeable... The place is beautiful inside, very high ceilings and very open. Its the perfect place for a romantic date night!",
   "Service was excellent but food was just okay.  We had 2 family appetizers and mm7 entries.  My entree was the Mare or seafood.  It was good but a little too much sauce and mussel quality could have been better.  Overall, it was a good dining experiencw.",
   "Our first time at your restaurant left a lasting impression. First and foremost our waiter paved the way for an incredible dining experience. Jose was very kind and very knowledgeable of the dishes. \nI had mesquite Salmon and Pene. My wife settled in on the lasagna and it will be hard to go back without ordering the same two dishes. The atmosphere and table setting was superb. We will be back ! Complements to Jose and all who made our dining experience over the top!",
   "Food 4 good but not outstanding; Ambiance 5 comfortable space with plenty of seating; Service 5; Reliable go to restaurant when in Sacramento. Call for reservations, the link on Google maps aren't accurate. Save space for dessert!",
   "My family and I had a wonderful time at this location. Our food was delicious and our experience was even better. Kaitlyn was a wonderful server who made our entire dinner smooth, fun, and worthwhile. She was so friendly, it just added to the whole experience. We’ll definitely be back and hope to see her again."
  ]
 },
 {
  "name": "Mayahuel",
  "address": "1200 K St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ad5f9a36-9333-11ea-808c-14b31f159f22.png",
  "tags": [
   "learn",
   "knowledgeable",
   "food",
   "food",
   "delicious",
   "drink",
   "food",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=6722228718714225425",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place! The staff is so knowledgeable, I learn something every time I come (especially about alcohol). The food is extraordinary",
   "Loved the server! He was fabulous; the food was really good too. Very authentic. They could use some sound absorbers in the dining room though. :) Will definitely be back.",
   "From the first moment  you arrive in this place  the waiters give you an enjoyable feeling. Very warm team, it is a kind place to to go out with buddies or with your date. heavenly  cuisine, talented  chief cook and stuff, decent  price and excellent  service. Warmly recommended.",
   "We love Mayahuel! We are from Seattle and found it a few years ago and we come back whenever we’re in Sacramento or passing through. Their food is fresh, beautiful, authentic and mostly delicious and the drink menu is fantastic. They use fresh ingredients and the staff is welcoming",
   "Stopped by to have a drink with my parents for my husband's birthday! Had a great time and tried the watermelon margarita! He loved it and the bartenders were very friendly!!"
  ]
 },
 {
  "name": "Seasons 52 - Takeout & Delivery Available",
  "address": "1689 Arden Way, Sacramento, CA 95815, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/adb9ea24-9333-11ea-807a-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "food",
   "tour",
   "free",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13133964754178194356",
  "source": "GoogleMaps",
  "reviews": [
   "We were seated in less than 2 minutes. Very pleasant server took our order. The first time I have ever seen food sent back. Food arrived quickly maybe to quickly. My scrambled eggs were perfect. As was the chicken fried steak w/gravy, so tender, country potatoes and sour dough toast and regular Coffee was delicious. All in all I'd say food delicious with generous portions, pleasant family atmosphere and friendly staff.  I give Crickets - 5 Star overall.  Gotta try it, you won't be disappointed.",
   "Great restaurant, friendly staff who checked on us regularly to see if we needed anything. The food was great, bathrooms were very clean. Our food arrived quickly. I’d recommend this place.",
   "This has always been the best steak I’ve ever had. I’ve come here about 10 times and always order the steak. It’s packed with flavor. The asparagus did mash potatoes  that come with it is also great. It is a little tricky to park but, the relaxing environment makes up for it. There are candles with sand at each table with a big water fountain in front of the restaurant and the lighting is great for the style of restaurant they have. I love it. It’s the perfect amount of modern mixed with restaurant. The waiters are nice and friendly. The manager even gave my mom a free meal when she did not like the one she ordered before. The prices are a little bit higher than a normal restaurant worth it when the deserts come! The are absolutely amazing. I don’t even know how to describe it. They come to your table and give you a tour of all the deserts they have. My favorite is the key lime with gram cracker crust. This is the perfect restaurant to go on special occasions!",
   "I love this restaurant. The food is amazing, and I love the ambiance. Additionally, they focus on using fresh and healthier ingredients for their dishes. I especially love that aspect. This is my restaurant if choice for special and intimate occasions. If you have not tried it, don't be fooled because it's attached to a mall. You will not be disappointed. I can't wait for my next opportunity to dine at Seasons 52.",
   "The ambiance of the restaurant is really nice. Our server was great,  super kind and patient. The food left a little more to be desired. Chef was very light on the seasoning. Although it was good,  it could have had some more flavor. Don't know that I'll be back...maybe to try some appetizers but that's probably it."
  ]
 },
 {
  "name": "Ryujin Ramen House",
  "address": "1831 S St #100, Sacramento, CA 95811, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ae0bebf4-9333-11ea-80aa-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=5120187166616658433",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best Ramen place in Sac. Service was quick and food is yummy! I have been here three times and great service and tasty food every time.\n\nService: 5\nAtmosphere:5 \nCleanliness: 5\nValue for money: 5\nFood Taste: 5\nRecommendation: must visit for yum ramen.",
   "This place amazed me! It’s almost as if they don’t abide by the laws of physics. \n\nI’ve been going here before and service is always consistently good, but today just blew me away. This place must be very well managed and staff is extremely well trained.\n\nIt started when we were seated. It was busy and several people were in front of us, but the receptionist found way to find us and get us to sign in.\n\nWe sat down and before I could even warm my seat up they already had a table ready despite how packed the place was.\n\nAfter seating us they got our order within a minute.\n\nWhat amazed me was it felt like as soon as I gave the server my order, I took one glance at my phone I looked up and the food was ready in an instant.\n\nIt really amazed me.\n\nThe people to might left, and as soon as they stood up, the busboy took the plates, cleaned the table and got it ready within a minute or so. \n\nStaff was friendly enough and very attentive. Everything went like clockwork. The lady was able to check on us several times despite how busy the place was.\n\nI’ve seen so many other restaurants encounter the same kind of rush hour traffic and they start struggle and Ryujin just cruises through it.\n\nReally great job to the management and the staff. Keep it up.",
   "Tried this place in the past with a friend and I am obsessed ever since. I liked the great atmosphere and yummy food and beverages. I recommend this place.",
   "Favorite ramen place in Sacramento that I’ve been too.  Great selection of broths and toppings and everything I’ve tried has been delicious.\n\nThey have a sister store across the street that serves ramen versions with thicker types of broth but I prefer the lighter types. \n\nCan be a bit crowded at certain time and parking can take a small bit of extra time, but well worth the effort.",
   "Absolutely love this place! This is by far the best ramen in town. The service is great as well, they're very fast and friendly"
  ]
 },
 {
  "name": "Mikuni | Midtown Sacramento",
  "address": "1530 J St STE 150, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ae537b80-9333-11ea-8008-14b31f159f22.png",
  "tags": [
   "food",
   "affordable",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=546996793465807736",
  "source": "GoogleMaps",
  "reviews": [
   "Unbelievably good sushi!!  A little pricey (actually, very pricey...at least for my budget), but it was such better sushi than what we can get in our neck of the woods.  Very attentive and friendly server.  Great atmosphere.  Loved it for a special date night!  Highly recommend!",
   "We met with friends at this restaurant for dinner. my friend recommended this spot.  Well, we were not disappointed. The staff welcomed us with a smile and we felt good. The meal was great. We had a great time and we shall absolutely come back again. Recommended.",
   "This is some great, high quality sushi. The main dining room is a bit loud for my taste and always packed. While this is good for their profit and I'm happy they are busy, I wouldn't recommend taking a group here with the intention of having a deep conversation.",
   "I meet with friends this lovely spot  a lot! This is my favorite spot to grab a bite.  I go there at least once a month. The food is just great, the staff is professional and the payment is affordable. I enjoy eating in this restaurant over a good dinner.",
   "This is certainly one of the best place to eat in the area. Always when I come to this place I am deeply pleased. They maintain their very high  level service and the topmost level of dishes  they serve. You can never go wrong with this restaurant. Very  recommended."
  ]
 },
 {
  "name": "Tres Hermanas",
  "address": "2416 K St, Sacramento, CA 95816, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aea3e9ec-9333-11ea-8eb2-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7964327952740155632",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing little Mexican spot with a diverse menu, and delicious margaritas! The place is small so expect a wait on busy nights, grab a drink from the bar while you wait. We had a veggie burrito and ceviche... Both delicious, but huge portions! We could have easily shared. New favorite spot, we will definitely be back!",
   "Don't confuse this place with Three Sisters on Folsom. There is a BIG difference in the quality of food, service, and ambiance. This place is fantastic! If you're in Midtown and want some authentic Mexican cuisine, do yourself a favor and check out Tres Hermanas!",
   "My niece loves this place so we went to check it out. For the most part it was an ok experience. I'd like to try it again during a less busy time. Our waitress seemed in a hurry everytime she came to the table and didn't make it back with whatever we'd have time to quickly ask for until she'd come again to the table and be reminded of what we'd asked for. The food was delicious and quite tasty. I left very full. Possibly more from those delicious chips they give while you wait😁",
   "Excellent Mexican food regardless of what you get. Small but homey with friendly staff. If you go, definitely get the salsa and chips. They are all hand made that day. It doesn't get any better  than that.",
   "Always a hit. And they don't use lard. The food and the service is good every single time I visit."
  ]
 },
 {
  "name": "Bangkok@12 Thai",
  "address": "900 12th St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aeeeaec6-9333-11ea-9455-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7636942438402523213",
  "source": "GoogleMaps",
  "reviews": [
   "BANGKOK ORANGE CHICKEN - Chicken breast in light batter, fried to golden brown, and topped with homemade orange sauce, bedding with vegetables.\n\nPORK PAD SEE- EW -  stir fried with rice noodle, egg, broccoli and carrot in sweet soy sauce.\n\nCHICKEN PAD THAI - Rice stick noodles stir fried with choice of meat, egg, tofu, bean sprout, green onion in Pad Thai sauce, topped with ground peanut.\n\nPOT STICKER - Deep fried ground chicken and vegetables wrapped in sealed dough, served with sweet and sour soy sauce.\n\nBEEF GARLIC LOVER - Stir fried your choice of meat in garlic and pepper, served with sliced cucumber.",
   "Came here for dinner before a show at the Community Center, and was pleasantly surprised. The vegetarian fried spring rolls were delicious, as was the vegetarian spicy eggplant. The eggplant was different than what I've had at most other Thai restaurants--it was more of a broth than a sauce--but let me tell you, that broth was DELICIOUS. I could have had a bowl full of the stuff.\n\nI'd definitely come back here again.",
   "The food is so yummy. Servers are pretty friendly but there is zero sense of urgency. I spent 90 min here during lunch. It took forever to get my food. I came at noon. After I got my food I had to ask for the check and a box. No one ever came to get the check. It's like they forgot about me again. Unfortunately I'll be back because the food is good and it's close to my job.",
   "I've been coming here for years, and this place always offers great customer service and consistent quality. I recently brought a work group of 17 people. I called ahead, they set up a nice space, and they even split up all the checks without even being asked, which I thought was nice and above and beyond. Every single person was happy with their food, which is a miracle in and of itself!",
   "A fresh and delicious food. Place was good. Services was great."
  ]
 },
 {
  "name": "Aïoli | Bodega Española",
  "address": "1800 L St, Sacramento, CA 95811, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/af3554e8-9333-11ea-8ae8-14b31f159f22.png",
  "tags": [
   "drink",
   "eat",
   "food",
   "music",
   "delicious",
   "food",
   "eat",
   "food",
   "affordable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4141554459402315687",
  "source": "GoogleMaps",
  "reviews": [
   "I cant even begin to tell you. Live acoustic music. Beautiful setting, amazing wait staff. The owner greets you and seats you at your table. The food was out of this world. Awesome drink selection to choose from. Just a wonderful evening out. \nEat with confidence.",
   "This place exceeded all expectations. Ambiance was sweet and romantic; the service was the best I've ever received, and the food was delicious. The wine was great too! My husband and I will be returning soon, so great.",
   "The lighting and decorations were great we sat at the bar because it was a little bit packed for the time we went. No complaints there\n\nWe were instantly greeted and the bartender really cater to our needs.  He explained the menu and listened to our wants and was very conversational and compassionate.\n\nThe food was very good and quickly plated, I am a meat eater whilst my girlfriend doesn’t partake in eating meat. We both found something we could eat and be satisfied with.\n\nThe prices are affordable and the serving sizes are moderate, so if you’re looking for a cozy place to grab a Tapa in downtown Sacramento give this place a go",
   "Great food, but I didn't like how fancy the place was. Fancy restaurants always make me feel bad about myself, I never think I'm good enough to be eating there. I would have preferred if the same food was served at an establishment that looked more run down, like IHOP or something. To try and mask my insecurities, I ended up having a bit too much wine. I got to the point where I was talking too loudly, but was also aware enough to realize I was talking too loudly. I kept apologizing for talking too loudly before anyone even told me to lower my voice. It was like every time I spoke, I surprised myself by how loud it was. It would have been nice to have been a bit more drunk, then I couldn't have realized how obnoxious I was actually being. The tables around us must have been grateful when our food arrived because then I couldn't talk as much. My dad and I ended up splitting the paella. He felt it was very salty, I thought it was too, but it was perfect for me because I love salt. Overall, we had a good time, but I can't say the same for the tables around us.",
   "Best tapas place in Sac. Their paella is bomb. Takes 25mins to cook, please order it with your apps order. Totally worth the wait!\n\nUpdate (2/9/20): stopped by for dinner again. Loved it again. Amazing service and awesome taste as always. This time around I ordered paella the moment I sat down as it takes 30mins to prep. Had scallops, lamb, ahi tuna tartare. Please check pics!"
  ]
 },
 {
  "name": "Rio City Cafe",
  "address": "1110 Front St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/af8a555a-9333-11ea-90d6-14b31f159f22.png",
  "tags": [
   "food",
   "performance",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2429984542036846162",
  "source": "GoogleMaps",
  "reviews": [
   "We ordered dinner to go tonight and Rio City really delivered. Super friendly on the phone and at pick up, asked questions to make sure we were getting everything we wanted, AND offered us G&T’s to go in little cardboard soup containers!  The food was fabulous. Give them some business during quarantine, they deserve it.",
   "We stopped in late after attending a live performance. The lights were on, but we didn't see too many people. As it turns out, they were mostly sitting on the covered patio along the banks of the Sacramento river. We were quickly seated and informed of the night's specials, which we didn't have. My brother in law (BIL) had the fish and chips. I had jambalaya, and my wife had a sirloin steak. Everyone liked their meal. The service was good, the employees friendly and the atmosphere, pleasant. I would return to this restaurant and encourage you to give it a try.",
   "Fantastic view of the Sacramento River and the marina. The food is very good and well priced. Happy hour is a must do with plenty of food and drink specials. Rio City Cafe is where you should go if you're visiting. With its close proximity to old Sacramento there is plenty to do.",
   "We had a wonderful dinner. The server was very attentive from the moment we walked in till we left. Food was very good. Would highly recommend it.",
   "We were so disappointed in the service we received, or I should say,  \"lack of service\". We got one of the worst servers we've ever had. She waited on all the tables around us and completely ignored us. We had asked for water several times and she never brought it. We saw her visiting with her coworker for about 10 minutes and then she brought water to other tables in front and behind us.  When I tried to get her attention she snapped at me and said she would get to our table when she was finished waiting on the other tables. She was horrible! We I had asked her to refill our empty water cup several times and she didn't do it. She was not only rude, but then she went to the table behind us and started talking to them about us. For that reason we will not be returning. We were so disappointed due to the horrible service by this particular server. She needs more training."
  ]
 },
 {
  "name": "Dawson's Steakhouse",
  "address": "1209 L St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/afed72ca-9333-11ea-9b09-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13669076535829048301",
  "source": "GoogleMaps",
  "reviews": [
   "This site is my first choice site.  Of all restaurants I know I prefere it most. I always suggests to my friends to go to visit this restaurant. when  I want to go to a good meal, this restaurant comes immediately to my mind.  Great and all sorts of  food and a rich cuisine.professional staff, and agreeable spirit. Not less important, the charge is modest. I sent my friends to this spot with great pleasure.",
   "We started at the bar with  Dawson's Manhattan drink.   Moved to the table and we had an amazing dinner and drinks, our waiter Brandon was the best!!!",
   "I celebrated my PhD yesterday in this excellent restaurant. I am glad to say that we passed a awesome evening and the venue was unquestionably the reason for the successful event. The crew  cooperated in a lovely way, the food was yummy and my friends were extremely  pleased. We shall no dout come back again for more joyful events. Thank you very much.",
   "For the price of the dishes I expected a lot more. A friend made the reservation and for a restaurant in a hotel I was shocked by the prices on the menu. I admit I ordered the cheapest entree on the menu, which is out of the ordinary. I ordered the burger without lettuce. The burger showed us with lettuce which was disappointing but easy to remove but the flavor of the meat was not worth $20.00 for a burger. A known CA burger joint known for an easy in n out would tastes a lot better and has a lot less grease.",
   "Food quality, taste, and service was all far under what it should be for the cost. When we arrived we waited 10 minutes for anyone to acknowledge we were there. No it was not busy and I had eye contact with the bar tender two different servers. Finally one server said hello and they will get the host. Another five minutes waiting and I believe the manager sat us without even apologizing for making us wait and having none up front. \n\nNext the food was bland and dry. Our steaks lacked flavor and tasted as if they were previously frozen. My rid eye had no marbling throughout the steak which is very odd for a rib eye. The lobster tail was undercooked and had the flavor of tap water and the texture of instant mashed potatoes. \n\nIf you are going to spend 300 bucks for dinner there are so many other places where you'd get better food and way better service."
  ]
 },
 {
  "name": "Burgers and Brew",
  "address": "1409 R St #105, Sacramento, CA 95811, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b0441fc6-9333-11ea-b9d1-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "structure",
   "food",
   "food",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=7789769035650669353",
  "source": "GoogleMaps",
  "reviews": [
   "The food was great, everything came out super quick and they had vegetarian accomodations which was nice. The burgers were really flavourful and had a good amount of toppings but weren't overflowing which was nice. The French Fry Nachos (w/ no meat) we had as an appetizer were great and had a lot of salsa and guacamole on them. The salsa and guacamole were seasoned and rated fresh. They also had really nice fries that were kinda crispy and paired nicely with their ranch.",
   "Delicious burgers and fries. Parking can be found on the street or a structure. We ordered Greek burger, avocado burger (generous portion of avocado), and New England fries (clam chowder/bacon/cheddar). We had the sweet potato fries and onion rings and both were quite delicious. I have been to many places where the burgers are good, but fries are decent, but this place has both. Finished it off with a strawberry shake which was fairly simple and basic and nothing super special. Would come again if we ever in Sac Town.",
   "Customer service was great and the food was decent enough. Great beer selection too! I had the chowder fries (highly recommend) the buffalo burger and sweet potato fries. All pretty decent.",
   "We had a fantastic experience in this spot. We enjoyed the wonderful environment and the food. The staff members are very amiable. I am glad we ultimately decided to try this restaurant.",
   "First time here with my daughter and her friend.\n\nIt is a pretty good size place and was so busy. Showed up around 6. We got seated immediately.  Our drink order was taken right away.\n\nIt is a very cozy place.\n\nI ordered the pastrami burger with onion rings and my daughter the hickory cheddar burger with garlic curly fries.\n\nWe both really liked the burgers. They were the bomb. The garlic curly fries were amazing. Onions rings hot and crispy.\n\nI would for sure come back.😊😊😊"
  ]
 },
 {
  "name": "Canon | East Sacramento",
  "address": "1719 34th St, Sacramento, CA 95816, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b08f3198-9333-11ea-a999-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13486606481910076035",
  "source": "GoogleMaps",
  "reviews": [
   "The food here is exploding with flavor! It's served family style so you can share and sample a handful of dishes. The menu changes regularly, giving you plenty of opportunities to try something new. I loved the barbecue carrots.\n\nThis place is perfect for everything from a romantic evening out to a celebratory dinner to a get together with friends to a quick stop to get dessert. Personally, I'm going to find every excuse to stop by.\n\nThe dessert is out-of-this-world! Make sure you save room.\n\nThe staff are fantastic! They're friendly, professional, and the work together to provide an elegant dining experience. You truly feel like you can relax while they take care of your every need. My water glass was never more than half empty. \n\nIf you are looking for the full dining experience, this place will not disappoint.",
   "Really delicious! Went here with my boyfriend for Valentine's day. Highly recommend the oxtail. It literally melts in your mouth. Best thing on the menu. P.S. their menu changes like every 6 months. Oh and their pineapple/basil cocktail is strong but doesn't taste like alcohol at all -- dangerous but good!",
   "Well crafted cocktails.  Good wine list at very reasonable prices including a nicely put together wines by the glass.  Good selection of beers.  Service is efficient.  Space is a very loud, so certainly not romantic.  Good is artfully presented but the quality of the ingredients and the execution falls short.  At this price point, you should receive balanced nuanced flavors.  Instead, most dishes were over salted and reflective of a single note.  Dessert was a complete disappointment.  Nothing local or sustainable on the menu, oddly.",
   "The food, service, and atmosphere were all phenomenal. There wasn't a thing that our group ordered that wasn't delicious. The crispy Brussels sprouts were especially outstanding and the banana cheesecake dessert was really special. I would never have thought that Szechuan pickled pineapple would taste so amazing.",
   "We finally made it to Canon and we can’t wait to go back! The food was fantastic. Our duck was perfectly cooked. The consommé was unctuous and flavorful. The dessert was also a standout. Definitely worth a visit!"
  ]
 },
 {
  "name": "The Pilothouse",
  "address": "1000 Front St #3231, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b0dba41c-9333-11ea-96fd-14b31f159f22.png",
  "tags": [
   "walk",
   "historic",
   "music",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14085433736997093987",
  "source": "GoogleMaps",
  "reviews": [
   "Honestly, I was confused. The meal started with a Mediterranean meatball, then a Cajun risotto. It was awkward to walk into. The dining room had 8 diners at 6:30pm. They stacked all customers on top of each other, even though there was plenty of seating. My risotto was bland and was all kind of one note. Could’ve really used some acid. The dessert was fine. I don’t understand putting a a whole leaf of mint as a garnish, it’s pointless. If you want mint in the dish then incorporate it. This should’ve been a great dining experience. Historic location with great ambiance, except no music to drown out some of the loud chewing from the other tables. That said, the bar seemed to be popping and I really regretted eating in the dining room",
   "The food is so good!!!  Coming from LA we have plenty of great food joints but I will put the pilothouse food up against any steakhouse in LA . Great stake and crunchy flavorful potatoes. Risotto was creamy and so so good.",
   "This was a lot of fun. I think the experience we had was a little better than the food. The Queen, the river, Old Sac were all part of a very nice experience. We had great food and the services was pleasant. I would come back.",
   "I like to go with friends to this restaurant with my highest recommendations. I  go to this restaurant often. I get very good feedback from my friends. The meals are delicious and the team is generous and cooperative. always when we go to this place we enjoy a lovely time.  warmly recommended.",
   "Great food. Super Hostess.   Great views. Great evening"
  ]
 },
 {
  "name": "Magpie Café",
  "address": "1601 16th St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b1283d9a-9333-11ea-8ecc-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=10249005004272975796",
  "source": "GoogleMaps",
  "reviews": [
   "The veggie hummus bowl is great. Surprisingly hearty and filling. The veggies have a nice char but remain crunchy. The hummus brings all the flavors together and makes what could be a sad flavorless dish into something special. Good service and a nice atmosphere. A good date restaurant.",
   "Dined for our 16th year anniversary. Very relaxed atmosphere, we opted for alfresco dining. \nOur server, Jen was awesome. She knew when to come and when to give us our space. \nThe food was delicious as always. Reminds one of home and a warm hug from Dad. \nSee pics for what we ordered. \nAn awesome start to our anniversary week off! \nThanks Magpie Cafe, we will be back.",
   "Food was great. Drinks were fabulous. Service was a little slow.",
   "This place was great! I got the hummus and vegetable bowl with a 6 minute egg. The egg was perfect and creamy. The humus was delicious and creamy. The vegetables were all deliciously seasoned and crispy not soggy. The sourdough bread that came with the dish as well was tasty. Wish I could have tried more, will definitely be back the next time I'm in town.",
   "One of my fave brunch places! Magpie has fresh, healthy ingredients. Their selection is great! I have loved every single thing I’ve ever had there. Addicted to their house-made granola. Love their avocado toast. Great view of the park and a fun outdoor patio. A must try if you haven’t been there yet! Just talking about it is making me hungry! Can’t wait for Saturday, think I know where I’m gonna be eating breakfast. \n\nDinners are great too! Their pork tenderloin is melt in your mouth! I typically eat brunch here but I’m sure their dinners are all just as delicious!"
  ]
 },
 {
  "name": "Frank Fat's",
  "address": "806 L St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b17154be-9333-11ea-8178-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "food",
   "delicious",
   "history",
   "art",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8222084348643122330",
  "source": "GoogleMaps",
  "reviews": [
   "Finally made it to Frank Fat's downtown location. A group of us stopped by for dinner after a conference and they were able to quickly accommodate us. Everything is ordered family style, so we got 5-6 dishes for the six of us. It was just the right amount for everyone and we finished all the dishes. Everything was delicious and full of flavor. The staff were wonderful, from the hostess helping my friend get gum off his crutch to the server checking in the perfect amount. I also placed a separate order to go and it was done very quickly.",
   "Excellent experience at Frank Fats. We were in town for a conference and stopped for lunch before heading home. The food was excellent, and the service terrific. Everyone was engaging and helpful. There were 4 of us and we all ordered different dishes - everyone loved their food. Will definitely visit the next time we are in town.",
   "We were lucky to get a table without a reservation. The ambiance was good, staff was very friendly, food was good. We especially liked the spring rolls and immigrant beef. The banana cream pie was awesome. I would definitely go back.",
   "Travel to Sacramento a lot for work and this has become a staple for delicious food every time. Highly recommend the honey walnut shrimp and the immigrant beef. The restaurant itself is really beautiful, art deco asian decor along with some items with history behind them. The menu tells you more about them which is really cool.",
   "I celebrated my PhD last night in this fine place. Well we passed a sensational evening and the venue was undoubtedly one of the reasons for that strong evening. The team  helped in a graceful style, the cooking was extremely good and my friends were very  pleased. We shall no dout visit again for more events. thanks very much."
  ]
 },
 {
  "name": "Pushkin's Restaurant",
  "address": "1813 Capitol Ave, Sacramento, CA 95811, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b1bf74ec-9333-11ea-856b-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "food",
   "free",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=4968278957176335691",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful place, super vegan friendly! My friends loved it. There’s a bit of a wait so I recommend reserving a spot around 30 min before (depending on what day you come, we went on a Saturday and it was PACKED) the service was absolutely amazing! My waiter literally made a sauce (Francis I think his name was) like combined a couple of sauces to make me a honey mustard sauce🤧super sweet guy & super genuine. I was happy with my meal but expected a little more, maybe I just not a very big breakfast sandwich gal but I’ll 100% be comming back to maybe try their chicken & waffles or a different brunch item! (Nice bathrooms as well, sinks are public)",
   "How did I not know about this place!  Everything is gluten free.  So many delicious options.  The staff were very friendly and informative.  Weekends expect a 20-30 minute wait to be seated.  Worth it!",
   "Got there at about 8am, so just beat the Saturday morning brunch rush by a hair!  I love the open atmosphere and fresh ingredients.  Food should feel good in a body, and my deconstructed lox fit the bill!  Had a brown sugar latte as well, which was not as sweet as I expected, but exactly as sweet as I'd hoped.",
   "I’ve been here a couple times now and the food is very good for gluten free food. Comparing the food to normal, gluten-full food, it would fall short. But keeping the category strict to gluten free, it’s definitely at the top. I’d warn hungry visitors that it is often a 30+ wait to get a seat and then a good long wait for them to bring out the food from the time you order.",
   "Always worth a stop even if I'm not staying in or near Sacramento. If I'm even somewhat nearby I make a point to stop here. The best gluten free vegan options I've ever seen in a restaurant. They're also so clean and modern it's really a beautiful spot. We LOVE pushkins!"
  ]
 },
 {
  "name": "Café Rolle",
  "address": "5357 H St, Sacramento, CA 95819, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b2061b0c-9333-11ea-87ed-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "delicious",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14749383308921464942",
  "source": "GoogleMaps",
  "reviews": [
   "Went there for lunch with my brother since he knows the owner and what can I say french food. I had the prawn sandwich which was perfect . Prawns were cooked right and break was slightly warm and crunchy. The waiter ( wish I got his name) was excellent and very professional. We did get the lunch special which include a drink and dessert ( we picked of course an orangina and creme brulee) . Will definitely come back!",
   "Simply the best ham sandwich I have had! Sriracha ham and Gruyere. The bread was amazing.",
   "Fabulous foods, excellent and cosy services. Had a great time here.",
   "Cafe Rolle is my favorite French restaurant of choice in Sacramento. You will not find another with more delicious sandwiches, both hot and cold than from Cafe Rolle. Please try the hot duck Pate sandwich. It melts in your mouth!",
   "This is a nice little place. Gets busy right away once they open up. Food is fresh and tasty. Lively and friendly service. Parking is limited but possible, many Park down the street and walk back to the cafe."
  ]
 },
 {
  "name": "Paesanos Midtown",
  "address": "1806 Capitol Ave, Sacramento, CA 95811, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b252dbca-9333-11ea-a91d-14b31f159f22.png",
  "tags": [
   "food",
   "free",
   "food",
   "music",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=12471758481082505616",
  "source": "GoogleMaps",
  "reviews": [
   "This place is buzzing. Very busy, but still quiet and intimate enough to enjoy your meal. There mostly is a  waiting time, but you get a buzzer to warn you when your table is ready. The food was not that expensive and tasted absolutely wonderful. The wine was great for its price and the staff was friendly. Definitely recommend!",
   "This place is great! Lots of gluten free options decent service and not over priced.  Food tastes great nice and hot. Its a very rustic feel in the building. Kinda 80s and r&b music playing. Would definitely come again.",
   "You can never go wrong with the shrimp scampi! Any pizza here is good and the tortellini is perfect also.  top off your meal with a picture of their amazing sangria and you will have an outstanding dinner experience.",
   "two days ago was the first time in this restaurant. But It is definitely not the last time. We enjoyed the evening very much with the attentive service, with the first-rate  meal and booze and with the decent payment. We will absolutely go back there soon.",
   "Amazing vibes and very attentive service. The meals were fresh and delicious. Will clearly recommend this place to friends and family. Convenient rates and generous portions. Good job."
  ]
 },
 {
  "name": "Mamma Susanna's Ristorante Italiano",
  "address": "5487 Carlson Dr, Sacramento, CA 95819, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b2914474-9333-11ea-b54e-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17156688979861896042",
  "source": "GoogleMaps",
  "reviews": [
   "Would be better if they were open more than 3 1/2hrs a day. Haven't had the chance to try...I WORK. Today I had the day off and passed by. The kitchen was dark and empty, pots and pans sitting idol. How can you make good Italian food w/o simmering through the day...before 3pm? I'm guessing all sauces are Costco frozen and warmed just before opening. Just boil some noodles and call it good?",
   "Wonderful experience here, I was with a party of 6, and they let us place a reservation for 6 people at 8pm, an hour before they closed and were extremely accommodating to our party.\n\nThe food was great and we had no complaints with the service.",
   "Just the way it should be. Simple atmosphere wit great food and service. I will return.",
   "Great little spot, big portions and small prices! Find a great deal on groupon!",
   "Good food, extremely friendly staff!  They serve classic Italian fare at decent prices.  Would definitely eat here again!"
  ]
 },
 {
  "name": "The Porch Restaurant & Bar",
  "address": "1815 K St, Sacramento, CA 95811, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b2d308ca-9333-11ea-8898-14b31f159f22.png",
  "tags": [
   "unique",
   "sampling",
   "tasting",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11112432521410577067",
  "source": "GoogleMaps",
  "reviews": [
   "Delightful mid-town eatery. Unique menu printed up daily--today's focus: Southern. Our group of four put a decent dent into sampling the selection. Not one disappointment. One happy customer here.\n\nDo be sure to order the Purple Cow Cake!\n\n['19/11 1st try/review]",
   "I was SO not impressed with their food. I sat in the bar area and the best thing about this place was the bartender who took my order. He was very nice, talkative, and engaging. The food, on the other hand, left so much to be desired. The presentation of the food and portion sizes were plentiful and mouthwatering; however, the food did not taste good. The flavors were odd and extremely disappointing. I ordered the Roasted Brussels, an appetizer, and they were probably the best tasting of all the other dishes I ordered. I also ordered the Candied Yams; there was absolutely NOTHING candied about them. Yes they had brown sugar and marshmallows, but they were NOT sweet or bared any tasty resemblance to the candied yams I was raised on. I also ordered the Collard Greens. SMH. Maybe some people like their collards sour, or tart, but I do not. I like collard greens, not mustard greens, which are usually more sour than collards. I was VERY disappointed. Lastly, I ordered the Apple Walnut Slaw. Again, disappointing. However, it has a vinegar base and not mayonnaise, so that may have been why I wasn't a fan. Finally, they charged me $3 more than what the menu indicated, which is weird when their menu changes frequently. Ultimately, I took the food with the intent to give it to a homeless person, and lo and behold, there was a young man with a sign reading, \"Just Hungry,\" near the Arden Fair shopping area. Just his luck tonight. I probably won't be coming back unfortunately. I was hoping the food would have been better.",
   "Charming place that is actually bigger on the inside than how it looks on the outside. There is a variety of brunch and side menu options. You can go basic or try a specialty item.  Their menu does change depending on what they have in store. If you find this on their menu when you're there,  you have to try their cornbread. It was so good,  put some butter and jelly on it and let it explode in your mouth.  Yum yum yum!Parking can be a challenge but just be patient, and you'll find a spot. This place is like stepping on your grandma's porch.",
   "Southern charm and decor to match. Everything looked really appetizing from the menu. Nice to go with groups. Had the shrimp pirlo and it was great. Wanted to try the chicken but was told that would always be on the menu and went for a seasonal option. Will be back to try other choices. Service was excellent as well.",
   "this place has a full bar with a good selection. The staff are friendly but the food was just ok. There's a good selection of all the fried food you could ever want. Fried chicken with unseasoned. The vegan meatballs had a tangy sauce but crumbled when as you eat it. There was quinoa everywhere. Just really hard to eat."
  ]
 },
 {
  "name": "Fixins Soul Kitchen",
  "address": "3428 3rd Ave, Sacramento, CA 95817, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b32f0b7a-9333-11ea-81c7-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=706499510659611245",
  "source": "GoogleMaps",
  "reviews": [
   "FYI: this visit was about three weeks after they opened. It was a busy Saturday afternoon. We waiting for a party of 10 about 15 min. We called ahead of time and let them know what time we were coming but unfortunately they had to split is up to accomadate the size. The waiter was good and are good came in a very reasonable time. I wad taking back a bit by the pricing but taste wise I can't complain. I haven't had the flavor combo of the green tomatoes since I left the south. My chicken was crispy and tender. The parking out front is very limited but they have overflow parking around the corner next to the bookstore. The bar has television but the outside seating was not being used on my visit.",
   "There has been a bit of a buzz with this place. It's definitely worth every bit of the hype. We did have to wait about 15min for a table but that's expected when a place like this is so popular. I tried the pimento cheese dip which was meltingly good. The fried chicken was so darn crispy on the outside and so tender on the inside. The hot chicken sandwich is like the name says, hot. But a good hot. The Mac and cheese and potato salad were delicious as well! I can't wait to come back to have more chicken. And try the other sides.",
   "The chicken is fine. \nThe mac & cheese is fine. \nThe beans and rice are fine. \nWhat isn't even fine was the $10 peach cobbler soup. It was liquid when in a plastic container. There were bits of pie crust dumped in it. I didn't want deconstructed peach cobbler soup. $10!",
   "It was our first time here and I will definitely be back.  Started off with the deep fried deviled eggs, the filling was great, as for the white being deep fried, not necessary.  The catfish was light and the cornmeal batter was flavorful.  I don't like hush puppies much anyway, these were fine.  The Mac and cheese was very good with lots of good cheesey flavor.  The collard greens were excellent, only place I have found around here that makes them as good as my wife, these were sweeter than hers, but a very close second.  I would come back for a big bowl of these.  My daughter had chicken strips, 4 big pieces and fries, they were good.  My wife had the shrimp and grits, 5 or 6 big shrimp in a delicious sauce that got spicier the more you ate it.  The service was great, our waitress was busy, but did an awesome job.  We will definitely be coming back, I want to try the rest of the menu.  The best southern food we have had in Sacramento.  Keep up the good work.",
   "Love the food. Came out pretty fast too. The only reason that I did not give 5 stars because of the slow service. We actually got all of our food too before we got our drinks. I think our server forgot about it. Had to asked another server for it."
  ]
 },
 {
  "name": "Empress Tavern",
  "address": "1013 K St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b3b32ff8-9333-11ea-a7b5-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8676758340953247458",
  "source": "GoogleMaps",
  "reviews": [
   "The Empress Tavern is an intriguing and mysterious experience. It is tucked neatly underground, next to the Crest Theater on Downtown K Street. At first, we didn't even know where the entrance was. It's really mysterious. When you are in the restaurant, it feels like you are in a secret vampire cave! The food is exceptional. Try the Beef Stroganoff. The bread is also yummy. The staff is friendly too. Try out this hidden gem!",
   "I never rate anything 5 stars unless its the best. This place was amazing. The location, the atmosphere, the staff. Staff ushered us to our reserved table promptly. Wait staff never let our water or drink glasses go close  to empty.  Food was amazing, from the appetizer to dessert, i was overly impressed with everything",
   "This place is obviously one of the most attractive restaurants in the region. Anytime I come to this place I am awfully pleased. They preserve their very high  level service and the highest level of food  they serve. You definitely will enjoy this this restaurant. Highly  recommended.",
   "This spot is the one I always prefer. I go to a lot of restaurants but to this restaurant I  constantly return again and again. The stuff is very chummy and the cuisine they place on your table is so yummy. I never decline to have a decent dinner in this restaurant. I highly recommend this place.",
   "I gave this restaurant 3 stars because i liked the beautiful brickwork. The inside is worth seeing. \nThe food was okay for the price. The beef cheek stroganoff was okay the biggest twist being the dill. I was happy that the meat was tender, Not chewy and did not have gristle.  \nMy husband loved the scallops and said they were the best he's had in a long time.  \nOur dinner friends had the fried chicken which they said was breaded well and very tender. \nAll of us agreed that our favorite part was the artichoke dip appetizer which came with crunchy potato chips.  Even my husband liked it,  (he usually does not because restaurants often leave the chewy harder leaves in with the dip which he doesn't care for),  but here it was diced tender leafy creamy perfection. \nI thought the price was way too steep for the food, and it was very very loud. The waiter left much to be desired.  But.... we all really did enjoy going and loved seeing this building as well.\nI also appreciated that the bathrooms were very clean and had lots of room.\nWe loved that this place was so close to the theater. (We were attending a show later so it made it easy)"
  ]
 },
 {
  "name": "Allora - Italian Restaurant",
  "address": "5215 Folsom Blvd, Sacramento, CA 95819, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b4045d90-9333-11ea-beed-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "walking",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13172056962919010503",
  "source": "GoogleMaps",
  "reviews": [
   "The food was simply amazing. All of the dishes were obviously given the utmost thought! From the beginning appetizers to the main course the dinner had flow you know what I mean. Everything came to our table at the perfect moment. The food was only to be matched by the fabulous service that was given. Heck of a way to spend our anniversary. Thank you so very much!!",
   "Pretentious manger not worth your time\n\nGiving 2 stars not because of the food but the lack of customer service.  We (my girlfriend and I) walked in on a Monday night and to our surprise it wasn't very busy.  A few tables open, no one at the bar, and multiple tables finishing up, and seemed like a mellow night.  The hostess was nice quickly helping us and asked if we had a reservation, I replied no but looks like you guys aren't very busy.  The manager walks over and starts messing with the computer when I over heard him tell her that it would be a 25 minute wait.  Uh a 25 minute wait huh?  He looked at me with a very pretentious look and I felt like walking out immediately, but the hostess offered us a seat at the bar, which I didn't care for but we sat anyways.  Food was decent and our server was great.  The manager came to deliver our food and served us the wrong food..... nice one bud.  As we finished our dinner at the bar I couldn't help but notice not one person sat at the tables he said were reserved (multiple)",
   "We came to this restaurant for dinner. we heard about this place from many people.  Well, it was a winning. the staff were so friendly and we felt very good. The food was just great. We enjoyed every moment and we will visit this place again. Highly recommended.",
   "Gourmet Italian food with great taste, but selection and size can be lacking. Parking is on the street only unless you're handicapped where there's one space in the back, so parking can be challenging when busy. Main dining area echos a lot so having a conversation with your table is very difficult when there's a loud drunk party across from you. Oysters were fresh and excellent. Overall, service was friendly but understaffed so our waiter was ultra busy while other staff helped out. If possible I'd give an extra half star for a 4.5 star rating because I still enjoyed my dinner here with friends!",
   "Modern take on Italian. Emphasis on seafood but also has a separate vegetarian menu (be sure to ask for it!) The wait staff was attentive and friendly. Large wine selection. Chic / clean ambiance"
  ]
 },
 {
  "name": "Public House Downtown",
  "address": "1132 16th St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b4545274-9333-11ea-9654-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=16853232613450279244",
  "source": "GoogleMaps",
  "reviews": [
   "Tried this place tonight. We got the Philly cheese steak and prosciutto pizza. The food was amazing! Great quality ingredients and the service was great. Not bad pricing at all for what you get. We will definitely return.",
   "We visited here on a Saturday afternoon before a concert at Golden One. We were seated quickly and our server Tonya gave us great service. Both the beer and food were very good. Plenty of seating and nearby parking.",
   "This place is the one I like best. I go to a lot of restaurants but to this place I keep coming back again and again. The stuff is very welcoming and the cooking they place on your table is so yummy. I never miss an opportunity to have a good dinner in this restaurant. Highly recommended.",
   "I visited this place for a girls night out and loved it. The ambiance and food is great. Great for a date night or just hanging out with friends or watch the game. I am a beer fan and loved their options for beer. Must try the monkey ale beer :)",
   "Great place to meet for lunch or dinner. The menu has large variety. Some of my favorites include the grilled salmon salad and the wild mushroom pizza. The beer is always fresh and delicious! The waitstaff is very knowledgeable and attentive. I come here every time I am in Sacramento."
  ]
 },
 {
  "name": "The Melting Pot - Sacramento",
  "address": "814 15th St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b49c3140-9333-11ea-b6e6-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15176463785022977326",
  "source": "GoogleMaps",
  "reviews": [
   "The wait staff here is some of the best, and most enjoyable people i have had as servers. The food is super fresh. You cook it yourself at the table if course! Also, bring your appetite because this will be an eating experience like no other. We ordered the yin&yang martinis throughout the night and loved it all! Can't wait to go back.",
   "The food was just okay. Nothing that I’d return for, even at half the price. The service was slow and our server was not very attentive. I was expecting a 2 hour experience but watched other servers get their tables out a good 30 minutes faster than our server got us out. When you’re waiting for a hot minute between courses, you people watch. Other diners' meals seemed much more seamless. Our server would check on us and we’d be almost finished with a course (maybe 2 pieces of something) and he’d tell us he’d check back in a minute. 15 Minutes later he’d show back up. My husband wanted a cheese fondue but I didn’t. Either I got it or he didn’t. What if someone wanted it who dined alone? They’re stuck with 2 portions? Let’s just say I was not impressed.",
   "Cool place for sure!  Ambiance is amazing and food was even better. Server was on point and treated us newcomers well!  I would have done five stars but wasn’t a big fan of our table. It was in the corner and it felt a bit cramped!  I will be eating here again but will be requesting another location.",
   "Get ready for an experience.  This is dining like nothing you've ever had. First off, let me say that they validate parking,  however,  if there is an event, you may have a harder time finding parking.  We were greeted warmly, and assisted quickly.  The customer service was on point and our drinks were always full. The food was absolutely delicious. You can try the 4 course meal for about $50, or you can pick the courses you want. The entire meal took about 2 hours and it was definitely worth every penny. I suggest making a reservation in advance.",
   "We love the melting pot! We go here for almost every special occasion. The food is wonderful, the service is stellar and it isn't just dinner, it is an experience! Plan to be dining for at least two to three hours. The mood is romantic and upscale, but you'll stool feel comfortable showing up in jeans. The manager Casey is a gem, so if you get a chance to talk to her you will be happy you did!"
  ]
 },
 {
  "name": "Scott's Seafood on the River",
  "address": "4800 Riverside Blvd, Sacramento, CA 95822, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b4dedf9e-9333-11ea-a76f-14b31f159f22.png",
  "tags": [
   "frugal",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1001237714312084911",
  "source": "GoogleMaps",
  "reviews": [
   "I would expect a MUCH higher quality from employees here, especially considering that it’s supposed to be a high scale restaurant. Super unfriendly staff. This is the first time we came here to check out the place and were really excited, but have no desire to come back. We entered from the parking area (which is not the main entrance as we figured out later) and didn’t know where to go for the seating, so we came up to the waiters’ station where 2 waiters were standing. We stood there for like a minute - they gave us a weird look once (like why the heck are you standing here), twice, and only then bothered to ask if we need any help. When we came to the host’s stand no one was there. After she came back to her stand she was doing her stuff for some time and only then asked how can she help us. After we found out that they don’t have any tables available due to reservations we went to sit at the bar. Again, waited for some time before the bartender took away previous customers’ empty glasses and threw the napkins for drinks to us.. when we asked for a menu he gave it to us and said that it’s better to hurry up with ordering as they’ll switching the menu in 5 minutes. At this point we felt super uncomfortable with the treatment from all the staff that we just got up and left. Went to a “regular” scale restaurant where apparently all the staff smiles and is being friendly. It just doesn’t make sense - when you go to the high scale restaurant you expect a special kind of service, and it turns out to be completely opposite.",
   "Very tasty. Expensive and SUPER packed. Met good friends for dinner and it was their choice,  we most likely would not have ever been otherwise. If you like a crowd and dont mind spending a pretty penny, I think you'll enjoy this place. If you're frugal and/or like an intimate feel-steer clear.",
   "We like a lot eating out. Yesterday we  visited this magnificent restaurant which friends recommended to us. We had a lovely time there with fine dishes and a well-trained team and a talented chief cook. We  added this fine restaurant in our phone list  and we will certainly come back soon. We highly recommend.",
   "We met with friends at this spot for lunch. This spot was recommended to us by a friend.  Well, we were not disappointed. we were warmly welcomed by the staff members  and we had a great feeling. The meal was great. We loved this place a lot and we shall definitely come back again. Highly recommended.",
   "The atmosphere was spectacular, our food was flavorful, beautifully presented and took a reasonable amount of time. We also sampled a few different cocktails and enjoyed all of them, and Miguel our server was friendly, attentive and mindful of our needs. If you want somewhere to go for a special occasion, make a reservation and you won't be disappointed."
  ]
 },
 {
  "name": "Zocalo Restaurant Midtown",
  "address": "1801 Capitol Ave, Sacramento, CA 95811, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b5244d4a-9333-11ea-9de9-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "unique",
   "eat",
   "food",
   "drink",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=10634976273381356455",
  "source": "GoogleMaps",
  "reviews": [
   "Unfortunately my photo of my dinner didn’t come out, but the food was fantastic! Just the right sized portions. The staff was very pleasant, and that atmosphere was great. I’d highly recommend if you’re in the area!",
   "I have been to many places downtown and mid town and have never come across a place as unique and as welcoming as this restaurant. the bartenders and staff are amazing and the food is so delicious, I cannot recommend any other place but this. this will soon become your most favorite and cherished place to visit and eat from.",
   "Great mid-town location.  Good food and good service.  Extensive drink menu and lots of great tequila choices.  If you like a little quieter, choose the outdoor patio",
   "Best pitcher of margaritas I have ever had and the food was excellent! Super busy Friday night yet we had amazing service and they were extremely fast. New favorite place!",
   "Beautiful restaurant and bar with soaring high ceilings. We were there for a catered party and the service was excellent, but I did not get to choose or see their menu. Great margaritas & fancy street tacos, delicious guacamole. VERY loud inside."
  ]
 },
 {
  "name": "Hook and Ladder Manufacturing Company",
  "address": "1630 S St, Sacramento, CA 95811, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b56acc48-9333-11ea-a6b8-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "walk",
   "eat",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7999967063206118367",
  "source": "GoogleMaps",
  "reviews": [
   "If you want a 10/10 atmosphere this is the place. We got dinner and drinks here and the only spot they lost points were in the drinks. We sat at the bar before getting seat and order some from the bartender. They were tasty but had no traces of alcohol in their mules, kind I’d disappointing to say the least. Food was great as well as the service. I would suggest another place for drinks which is disappointing because they have such a great bar for it.",
   "One of my coworkers recommended Hook and Ladder for lunch. We arrived and there was plenty of seating available for the lunch hour. I ordered the burger and it was one of the best burgers I have had. It was very flavorful without being greasy. The fries are also very good. Everyone at our table enjoyed their meal.",
   "We went early and found the place nearly empty. Throughout the morning, customers came in and started their own meals. This isn't an unpopular place, just that it's a bit quiet that early. The food is really good and we're looking forward to going back in the near future.",
   "Walked in at 4:15pm by myself for dinner. I travel a lot for work and just needed a place to sit down and eat. This is not a place for that type of thing. It was happy hour and they were just doing appetizers. They were fully booked for dinner at 5pm. I just wanted a place to sit down and eat, now I have to figure something else out. Will the next restaurant I walk into simply let me sit down and eat? Hopefully. I was simply searching for quality, unfussy service and found the opposite here.",
   "This is such a great brunch spot in Sacramento! We were on the hunt for a good place to eat and spotted Hook & Ladder and got curious. While the interior is spacious with plenty of seating, we were seated outside on their cozy back patio which seemed to hide itself away from the bustle of 17th & S. The food was outstanding; they had something that satisfied each of our tastes and diets. Drinks were also on-point, having a good selection of beers, wines, and mixed drinks, we were more than satisfied! Service was excellent and couldn't have asked for more! If you've never been here, try this place for sure!"
  ]
 },
 {
  "name": "Selland's Market-Cafe East Sacramento",
  "address": "5340 H St, Sacramento, CA 95819, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b5b283c0-9333-11ea-aa3b-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16536943771662239674",
  "source": "GoogleMaps",
  "reviews": [
   "Really good food and excellent variety.  A little slow when busy.  Large tables good for families or just meeting random people.",
   "Loved the locations and it seems this place provides a bit better customer service than the Broadway Location. Parking might be an issue for some but there is space throughout the residential neighborhood. What really made me give this place 5 stars was the customer service. Normally it doesn't seem they provide refills on some of their drinks but they were happily to oblige. Selland's has always had a good selection and the quality is what I have come to expect from the other location on Broadway which I have visited on numerous occasions.",
   "Arrived just as the restaurant opened. Met friends there for lunch. Ordering is easy. Menu is posted. Paying for food was quick and efficient. I ordered the Crab Louie. Crab was fresh, lettuce was crisp. Salad accompaniments were fresh and flavorful. Ordered salad with dressing on the side and that's the way it came. Every item in the display cases looked yummy. Staff friendly and helpful. Parking is limited. You may have to park on residential streets.  Be mindful of neighborhood parking restrictions.",
   "We came here with a party of four on a Friday night before the Epic Obstacle Course Race. \nYou seat yourself and we found a table in the main dining area, but it was pretty busy, so I’d imagine it’s pretty difficult at peak times. Our hosts, natives of the city, were astounded and told us it was hardly ever that busy (classic them). \nWe ordered at the counter and the price was very reasonable for two people and a dessert to split (and booze!)\n\nLemon Chicken Breast-\nMy wife and her high school friend both had this. The high school friend said that it was one of his favorite dishes, which just shows how much he’s grown, emotionally since graduation. Adulthood is loving lemon chicken for low it’s low carb, high protein ratio. He had it a la carte, splitting the large salad with his girlfriend. I didn’t hear any complaints about the quality from either of them and the bits I ate when they weren’t looking were delicious. \n\nTeriyaki Chicken Thigh-\nI chose this with a side of mashed potatoes and it was fantastic. It was lovely and juicy, with the bone in to preserve some of the flavor of the meat. The skin was slightly crisp and caramelized. It paired well with the mashed potatoes because of the great combination of salty and savory with creamy and buttery. And because anything potatoes is delicious. \n\nAsian Salad- \nMy wife and I split this cold salad between us but I ended up eating most of it because that is my lot in life. It was similar to a Costco salad, with mandarin oranges and the sweet sesame dressing, but it had a great crunch from the purple and white cabbage. \n\nMashed Potatoes-\nThis is one of their more popular side dishes. It’s made from potatoes that have been “mashed”! Who knew?\n\nBroccoli-\nPretty standard steamed broccoli. Inoffensive flavor and a kind-hearted, spiritually-satisfying portion. \n\nGoat Cheese and Apple Salad- \nThe native Sacramentals ordered this and were generous enough to share an amount of it (it was massive). Lovely mix of sweet and savory. Definitely a great summer salad. \n\nCarrot Cake-\nWhile this cake was made with carrots, it does not have all the inherent health benefits one would expect. However, this is my wife’s favorite cake, so, inevitably, I ate most of it. \n\nDouble Chocolate Cake- \nTwice the chocolate of a normal cake! What’s not to like?\n\nOverall, it was very cool experience and the staff was super helpful and patient with us, considering we made our choices and then completely threw them out when it was time to place our order. They gave great recommendations and, ultimately, helped us stop panicking and decide what to eat.",
   "We absolutely love Selland's and have always had a great time there. Their food selection is excellent and everything we have and there is delicious. My favorite is their Eggs Florentine Pizza with added prosciutto from their brunch menu. I recommend this place for any time you want to dine in or takeout, but their brunch is phenomenal!"
  ]
 },
 {
  "name": "Petra Greek",
  "address": "1122 16th St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b5f95114-9333-11ea-b608-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "delicious",
   "food",
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17382637796955879687",
  "source": "GoogleMaps",
  "reviews": [
   "There isn't too many options of Greek food in the Sacramento area. That being said, this is probably the best current location if you ever are craving it. The beef/lamb gyro was filling and the meat tasted great. The Petra fries were also a treat without being too overbearing. Try the fry sauce! They also have a selection of beer that I did not get a chance to drink but I definitely will when I come back for happy hour.",
   "All time favorite restaurant. I used to come here and spent good time. Service is very good. Delicious food. Super friendly staff. Decor of the restaurant is outstanding.",
   "This is a nice low key spot to have great food. The food is fresh and well seasoned. The portions are amazing for the cost. The Petra crew are all awesome. I've been here like five times and no matter what I order, I am completely satisfied. In fact, this restaurant is in my top 3 suggestions to family and friends. \nParking can be a challenge. However it's downtown so it's not a surprise. And trust me, this food is amazing!!!",
   "I love this place! Only Greek restaurant in this town that has the best flavor. If you like Greek food this is the only place to go. Fast service and a lot of food for the price.",
   "This place clearly knows how to take care of their clients. Constantly with a very welcoming approach. The food is reasonably priced, regularly tasty and clean."
  ]
 },
 {
  "name": "The Rind",
  "address": "1801 L St #40, Sacramento, CA 95811, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b63d168c-9333-11ea-ade7-14b31f159f22.png",
  "tags": [
   "food",
   "sampling",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=191724803962776993",
  "source": "GoogleMaps",
  "reviews": [
   "This was one of the best meals I've had this year.\n\nReally neat space, and they were able to accommodate our party of 5 rather easily. Food came out at a nice pace- enough to really enjoy each course.\n\nThe charcuterie plate was nice. We asked for their pairings with the wine we ordered, and the cheese monger had some nice selections.\n\nBoth the mac and cheeses and grilled cheeses are great- I can especially recommend the \"Not Your Mom's Mac\" and the \"T-Brie-D\". \n\nI can't wait to go back. If you haven't been here yet, you're missing out on a FANTASTIC dining experience.",
   "I went here very briefly with a couple of friends one day. They have good wine available as well as some other interesting options. I didn't try anything on the menu other than the wine, but we took a look, and the happy hour looks great.\nIt is a super cute interior, small and cozy, with a little classy (has to be with the wine and cheese, right?)\nThe waitress was very friendly and helpful. She gave us a sampling of the wine we got before we went all in for a glass.\nGreat experience overall, and I hope to be back for a Happy Hour soon.",
   "We stopped by here for some lunch and the food was really good.  It was really pricey though, so I knocked a star.  We got a Charcuterie Board, 2 grilled cheese sandwiches, a cup of sour and 2 beers.  Cost us $100 bucks.\n\nThe grilled cheese was good, but should have been bigger at those costs I think.  The service was great though.  Our server (Britney) was super awesome and deserved this shout out for her outstanding service.",
   "FlameMango - best grilled cheese of my life. They additionally have an excellent selection of wine and beer and do build-your-own cheese boards. Great vegetarian options as well. Mac n cheese is decadent.",
   "Yum. All I can say is yum. From the cheese board to the beverage selection The Rind never disappoints. When you are in the mood for a classy take on the ultimate comfort food there is no other place I'd recommend. Adult mac and cheese + grilled cheese for the win!"
  ]
 },
 {
  "name": "Beast + Bounty",
  "address": "1701 R St, Sacramento, CA 95811, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b688ecc8-9333-11ea-8bcc-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8088116232466330338",
  "source": "GoogleMaps",
  "reviews": [
   "The ambience is amazing here. Love the decor. Really good and unique options. They're a little pricey but the food is really good and so was the service. We got drinks and didn't like it at first but they remade really well. Food takes a little while. Lots of vegan and vegetarian options. Recommend the pizzas. Most bang for your buck as well",
   "The decor was a big factor in visiting this place, and I loved how the brick from the original building was saved and incorporated into the space. The food was tasty as well, so it was definitely a good find. If you come for brunch, I definitely recommend getting a pitcher of their pomegranate mimosas with your meal, you won't be disappointed!",
   "It’s absolutely beautiful!! but the food is basic for me. The beast burger want that amazing & the fries were too thick for me ( sweet potato fries, wish they were thinner I would absolutely love to have them) first time trying the fries and I’m kinda into it🤷🏻‍♀️ the burger I asked to have cut (recommended) I could barley eat it but the bread wasn’t that good, wasn’t bad but I just had really high expectations for the price. Also bathroom are nice they have a phone holder pretty cool & I just love their aesthetic wish they would have more dessert options:/ I would give it another try definitely. My friend tried the vegan burger and she gave it a 3/10 so I think that speaks for itself but she isn’t vegan just always wanted to try it. She won’t be having that again lol but the waitress was sweet & helpful",
   "Get a reservation! Every part of the menu is off the chart!!! Had the pair salad and the kiwi. Amazing! Followed by the short rib then split a burger w/avocado and bacon added. We literally cleaned our plates",
   "Very Nice Restaurant, You Won’t Be Able To See It Unless You Put Ot On The GPS. Romantic, Cozy, And Clean. I Tried Two Alcoholic Cocktails 🍹 The Rabbit Revenge And The Martini 🍸They Do Taste Really Good, But The Liquor Amount Was Pretty Small; Minimum If You Will, I DiDn’t Even Get Tipsy After Two Drinks, And I’m Not A Huge Guy 😄 My Wife Is Pregnant, So She Got A Non Alcoholic Cocktail And It Was Super Good, With Vanilla And Pear 🍐Flavor, Highly Recommended. We Ordered The Char Grilled Octopus 🐙 And It Was Delicious 😋 The Price Was Reasonable, We Also Tried Their Kale, And Walnut Salad 🥗 It Was Alright, But Over Priced For A No Protein Salad With Some Kale And Walnut (15$ Plus Tax) For Entrée My Wife Ordered The New Yorker And The Steak Was Cooked Really Good And I Ordered The Mixed Grill Plater; Honestly For 88$ Plus Tax I Expected Some Bigger Portions Specially If The Waiter Had Told Me It’s A Very Decent Amount Of Food, On The Other Hand All What I Got Was A Very Average Piece Of Lamb, 2 Average Size Piece Of Kind Of Beaded Fried Ground Beef, And Two Pieces Of Salmon; The Thing Is That It’s Not Even A Salmon Fillet, It’s A Bone In Salmon, And I Barley Literally Barely Found Any Salmon Meat In There. \nFor A 88$ Course I Expected Way More Food Than What I Got ☹️ And I Consider My Course The Least Recommended One Out Of All What We Ordered.\nFor Briefing: Nice Place To Try, Good For First Dates, And Anniversaries, But That’s It...It’s Not Worth It To Visit Again; Good Food Quality, But Super Expensive For The Amount Of Food You’re Getting. And That’s Why I Gave Them Three Stars Only ."
  ]
 },
 {
  "name": "Frankenwaffle",
  "address": "1119 Alhambra Blvd, Sacramento, CA 95816, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b6dcb236-9333-11ea-a3b3-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "adventurous",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17301783022190900781",
  "source": "GoogleMaps",
  "reviews": [
   "Just had a complete breakfast waffle... simply amazing! Definitely coming back to try more waffles in the future. Great microbrew and cider selection. Also have Sierra Nevada Celebration on tap! Highly recommend to try this place.",
   "This place was super fun, and the food was really tasty! I got the taco flavored dog, and my sister got the vegan dog, and a waffle. The gentleman behind the counter was very friendly, and knowledgeable. The food was prepared fresh, and tasted amazing. I would recommend checking this place out if you’re feeling adventurous.",
   "Great food, great service and very clean facility. Loved it, I will be back.",
   "Awesome sausages and waffles. Delicious! The theme is cool and they do a great job of keeping with the theme in their food names and decor. They always have a horror movie on and records playing. Great selection of beer on tap and in cans.",
   "The Frankenwaffle was great. Its like a corn dog but with a waffle, dip it in the house mustard and your taste buds do a happy dance. (Spicy house mustard)I also had a plate of waffle topped with bananas and cream they were so good I didnt even put syrup on. Service was friendly I enjoyed it all. Great place!😃"
  ]
 },
 {
  "name": "Plan B Restaurant",
  "address": "555 La Sierra Dr, Sacramento, CA 95864, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b7230b6c-9333-11ea-a3c4-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9873554848907085351",
  "source": "GoogleMaps",
  "reviews": [
   "This is a very cozy place with a mello atmosphere. The food was delicious. I had the rack of lamb and the muscles. The lamb was cooked to perfection and seasoned beautifully. The chefs were light on the salt so you could really taste the flavors. I would highly recommend trying the rack of lamb. The muscles also were full of flavor but left me wanting more of the sauce. This is a nice place to go for small parties or a date night. I definitely want to try other items on their menu next time I go there, I will definitely be going back.",
   "I celebrated my PhD this evening in this excellent restaurant. I am glad to say that it was a pleasant evening and the place was absolutely the reason for the outstanding evening. The team  contributed in a very nice way, the food was tasty and my buddies were very  joyful. We shall absolutely return for more events. Thank you very much.",
   "This restaurant is obviously one of the most attractive place to eat in the neighborhood. Always when I go there I am deeply satisfied. They maintain their very high  standard service and the highest level of dishes  they provide. You are always happy with this restaurant. Very  recommended.",
   "Good food great service. This is an old school chef run restaurant that never disappoints. They pay attention to the details and it shows in everything from decor to food and service.",
   "Amazing filet mignon, salmon, appetizers, and cocktails"
  ]
 },
 {
  "name": "Iron Horse Tavern",
  "address": "1800 15th St, Sacramento, CA 95811, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b76ff318-9333-11ea-b38d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8268656273988749765",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic place to grab some dinner. Nice atmosphere, good food, and cold drinks. \n\nWait staff is super friendly. Everyone is so pleasant. \n\nMeal was fantastic. Started with fried pickles and onions as an appetizer. Saved a few of the fried pickles to put on the Tavern Burger. Good choice.\n\nI would definitely come back here again.",
   "This is such a great spot. I love their patio with the dogs allowed. Service has always been good, often great. The food is yummy and a good range of options. Drinks are great.\nI like the look of the place, nice open area inside with wood and tile. The only downside to that is how loud it can get.",
   "Looked on Google for a good Sacramento lunch and was rewarded with trip to the Iron Horse Tavern. \nWow, a great lunch ! The Cuban sandwich was first rate and with a “real” ginger beer, a delightful meal. I was lucky to find a parking spot, it’s a little tight, but worth the effort.",
   "Stopped in for dinner on my way to Tahoe. Great location. Near plenty of other bars. Food and service was excellent. I'll be coming back here amd highly recommend.",
   "They have good French donuts. Perfect place for a brunch. Lovely patios."
  ]
 },
 {
  "name": "Binchoyaki",
  "address": "2226 10th St, Sacramento, CA 95818, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b7c89986-9333-11ea-892e-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "eat",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=6210665144539574572",
  "source": "GoogleMaps",
  "reviews": [
   "Friendly staff. Farm to fork. Innovative food. Not your typical Japanese restaurant serving sushi. So much better and tasty food. Small plates. Grilled items using Japanese Maple charcoal which creates a high heat, smokeless fire while still imparting a grilled flavor. And, a great selection of Sake.",
   "2nd birthday at one is the best restaurants I've ever been to. It was wonderful! The best way to spend a birthday lunch-great service! I can't wait to go back! ♥️♥️",
   "Great restaurant with a quaint and welcoming environment. Came in for lunch, didn't take too long to order and get settled. The Curry Udon was absolutely delicious, and the salad was crisp and perfectly refreshing. Food and service were exceptional. Highly recommend",
   "This place is doubtless one of the best place to eat in the region. Always when I come there I am awfully happy. They always keep their high  standard service and the highest level of meals  they provide. You definitely will enjoy this this place. Highly  recommended.",
   "Fantastic! Unique items on the menu that would make the pickiest of Japanese to be more than pleased! Definitely going back!"
  ]
 },
 {
  "name": "Ruth's Chris Steak House",
  "address": "501 Pavilions Ln, Sacramento, CA 95825, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b8100d74-9333-11ea-9062-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8761612271716306543",
  "source": "GoogleMaps",
  "reviews": [
   "Easily one of the best steak I’ve had. Great upscale ambience and friendly staff. \nMy steak was perfect, and there was an extensive selection of wines to choose from. Mashed potatoes and lobster bisque tasted amazing too!\n \nAs expected, price was on the high side. Will surely be back here again.",
   "Great value for the happy hour items. $9 per good or drink. Nice interior and attentive services.\nHappy Hour is 4:00 pm - 7:00 pm Sunday - Friday. Open seating, first come first serve.",
   "I don't think I have ever been here and been disappointed. The food, no matter what you get, is always consistent. I have never had a bad steak here-always cooked perfectly and tastes phenomenal. The sides are \"shareable\" (I don't like to share tho) for two people. Extensive wine list available and of course a full bar. I enjoy being able to come here and enjoy an upscale meal without having to put on a ballgown.",
   "One of the best steak houses I have ever been to. The staff was very friendly and super helpful. The price was a little high but for the quality of food and service it's worth it. They bring your steak out on a 500 degree plate to keep your steak warm the whole time you're eating it. They also bring out a selection of knives to use. I will definitely be going back some day.",
   "Very nice place for a special dinner.. impressive first date location.. engagement/proposal restaurant. Food was good. Service was great, prices was hitting them pockets but it was very good.  (Get the sweet potato casserole and you won't need a dessert)"
  ]
 },
 {
  "name": "Yue Huang Restaurant",
  "address": "3860 Truxel Rd, Sacramento, CA 95834, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b85aa9f6-9333-11ea-87c9-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11201680395126058971",
  "source": "GoogleMaps",
  "reviews": [
   "Staff are on point with their services along with their food. The tea is super good too.  I know people have different taste buds and may not like this place but me and my little family love it!",
   "The food here is phenomenal. We've ordered a few times for delivery/pickup since quarantine and are for sure making this a regular stop for us. All of the dim sum we've tried was great, as well as the moretl traditional Chinese food dishes they serve.",
   "This place is an absolute delight!  Amazing dim sum! Amazing service!  Amazing restaurant!  This should be a stop on everyone’s list. Get here now!",
   "Service was good, very unusual items on the menu, like sea cucumber and conch. We ordered what we were familiar with: egg rolls, fried shrimp, dumplings, salt and pepper chicken wings, noodles, and fried rice which was outstanding. It had pork and shrimp in it. Very well seasoned and not oily at all... Probably the best I've had in a while.",
   "fresh tasting food and fantastic customer service"
  ]
 },
 {
  "name": "Claim Jumper Restaurants",
  "address": "1111 J St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b8ae2164-9333-11ea-bd8e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "drink",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8550487617887574972",
  "source": "GoogleMaps",
  "reviews": [
   "Their lunch deals are really great. Can get food for 10$. The ambiance is great, service is good and food is tasty. The happy hours are another good reason to go here.\n\nPlease do ask for their complimentary bread during lunch. It's delicious. \n\nI'm docking a star as the fries didn't feel that great during the happy hour. They were kind of chewy, and I didn't feel like they were freshly made.",
   "Absolutely wonderful!!! Took my wife out for our 25th anniversary, service was exceptional, Mule on Fire drink was amazing. Ordered the rib eye steak medium rare, Perfection! Had a great time. Will be returning for certain.",
   "I will start with the good. We had reservations for our anniversary.  My husband had been telling me about this place a d I was so excited to try it. We got their early and I was happy that they could seat us early. In fact, the place was pretty empty. It took a server 10 minutes to get our drink order. We ordered appetizers,  which mine was wrong. There was absolutely no pacing of the meal. We had appetizers,  salads, and our dinner on our table all at the same time. We ended up having no less than 3 servers that night. Getting drink refills was almost impossible, but the place was empty!! Parking is a total nightmare around there too.",
   "Food was very good. My only compaint is they didn't have any of the complimentary bread they usually give out and the baked potato was over baked. The carrot cake was super moist. I would come back to this location.",
   "We met with friends at this restaurant for dinner. This restaurant was recommended to us by a friend.  Well, it was a winning. The staff welcomed us with a smile and we had an excellent feeling. The food was just great. We loved this restaurant very much and we shall absolutely come back again. Recommended."
  ]
 },
 {
  "name": "El Novillero Restaurant",
  "address": "4216 Franklin Blvd, Sacramento, CA 95820, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b907da36-9333-11ea-94a2-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "food",
   "food",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7024779659322439060",
  "source": "GoogleMaps",
  "reviews": [
   "Atmosphere was good. The food, exceptional!\nI recommend the shrimp soup. Its crazy good!\nSalsa was WAY TOO SPICY HOT!",
   "Excellent authentic Mexican food. The best I’ve ever had. Portions are massive, food is flavorful, family atmosphere! I had the super burrito — couldn’t even finish half. Steak was tender! Absolutely delicious!",
   "Large authentic Mexican restaurant! The food was good, large portions at reasonable prices. The margarita did taste like a mix but it wasn't the worst marg I've had. The restaurant isn't very vegetarian friendly, however I appreciate their honestly writing in the menu what's made with lard (chips, anything fried) chicken stock (rice, etc) and so on... Friendly staff, quick service.",
   "Great food and service. I've been eating here for several years and have never been disappointed. I'm always amazed at how quickly the food is served and how fresh it tastes. I now live 20 miles away and still take the time to make the trip when I want really, really good Mexican food!",
   "For the real experience of Mexico taste this is the place. Its all here. Service courtesy, warm family traditions and price. Try it I know you will feel and taste it. Betty Gray thank you!"
  ]
 },
 {
  "name": "Español | Italian Restaurant",
  "address": "5723 Folsom Blvd, Sacramento, CA 95819, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b94f43b4-9333-11ea-9a12-14b31f159f22.png",
  "tags": [
   "family",
   "eat",
   "food",
   "family",
   "historic",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14016122678623749138",
  "source": "GoogleMaps",
  "reviews": [
   "Español is a really fun place to eat Italian food.  Yes that's right, Español is a really great place for Italian food!  The four of us celebrated my wife's birthday.  The service was outstanding; they kept up the good service throughout but did not intrude at obvious family moments, very smart.  We had spaghetti and meatballs and raviolis what's great meat sauce.  Of course, they started with a standard salad with blue cheese or Italian or French dressings.  Then, came a wonderful minestroné soup that they kept bringing as long as we wanted until we had our fill.  The entrees reserved as we finished our soup and salad; in other words, they paid attention to the progression of our dinner and waited until we had finished soup and salad before bringing us the main entrees. I like eating establishments that pay attention to detail and do not clutter the table.  The pricing of the menu items is priced well, and I would say moderate.  Not only would I recommend Español, but I give it five stars for it is a great family atmosphere too!!  Español also has a nice cozy little bar that serves bottled beer, wine and liquor.  I like Italian food and we'll be revisiting Español!!",
   "My parents took my Husband and I out to Español. And I have to say this place is amazing...Has a historic touch, with a home like feel and of course the food was amazing. You can get dishes with spaghetti and ravioli. Comes with salad, soap and warm bread. I got the eggplant Parmesan for dinner. Yum!! Family friendly and great for big events too. No need for reservations but would help with big groups.",
   "My daughter had spaghetti and meatballs; I had spaghetti and ravioli combo. I wasn't expecting authentic Italian cuisine, but I figured a place like this should be solid, tasty Italian-American food—a classic red sauce joint. But I was disappointed by the food we got: everything was pretty bland, and the meatballs were dry and chewy. I'd rather spend less and go to The Old Spaghetti Factory.",
   "9 of us came here for a birthday celebration. Love the service here. Friendly personable service. Plates cleared, water filled in a timely matter. Minestrone soup is still very good. The pasta is just alright. The go to dish is the fried chicken with garlic. The chicken cacciatore is another favorite. The pork chop was dry and tough.",
   "Great Italian food just like mom would make. Dinners come with lots of tasty soup, salad and ice cream. Reasonable choice of dinner wines. Would recommend for a nice family dinner."
  ]
 },
 {
  "name": "Veg",
  "address": "2431 J St, Sacramento, CA 95816, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b9988238-9333-11ea-8efa-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "music"
  ],
  "link": "https://maps.google.com/?cid=11596873541539107259",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped here for brunch on the way up to Tahoe. Everything we had was delicious, high quality and healthy. We ordered a French press coffee, a bourbon cold brew coffee cocktail (their cocktails are delicious), a Kale Caesar salad, the breakfast burrito and the tofu scramble and potato hash. The food was really tasty, big portions but didn’t feel bloated after. Nice artsy atmosphere with really friendly staff. Highly recommended!",
   "Had brunch on our first visit, cozy but spacious upstairs space, price point $12-$18 per dish but portion size was very generous. Staff were friendly and food was amazing. Great selection of teas, beer choices more limited. The chicken (fried oyster mushrooms) and waffles was especially delicious. Will definitely visit again.",
   "Get the CREPE FLORENTINE (and ask for hot sauce). Absolute fire. This place is cute as hell with a nice view. Not ADA accessible tho — you need to climb a flight of stairs to get to the entrance.",
   "4.5 stars. Great service and great food with well done vegan menu.\n\nIf pressed I would say that I enjoyed the falafel burger over the more traditionally prepared option, but both were good. The curry bowl was also good. The potato wedges were excellent. Definitely will be coming back.",
   "This place is so delicious. The coconut curry is incredible and the potato wedges (YOU GUYS, THE POTATO WEDGES) were incredible. It is a bit more! We paid about 12-16 a plate and drinks are around 5, but the quality is more than worth it. \nAnd the ambiance! It’s a nice upper story restaurant with a view and some calm music. The service is great! I’m going here again for sure!"
  ]
 },
 {
  "name": "La Trattoria Bohemia",
  "address": "3649 J St, Sacramento, CA 95816, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b9e01292-9333-11ea-8ef2-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "delicious",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=5210646223740466303",
  "source": "GoogleMaps",
  "reviews": [
   "Best pizza in Sacramento! Also, the ambiance is very chill and it has a cool neighborhood vibe. We have been coming here since we moved to East Sac.  I do the gluten free thin crust combo. My husband does the regular combo. The pic of the GF combo speaks volumes to the deliciousness of the pizza. Here is a pic of my leftovers!",
   "Overall a good a experience. The food was really good and the service was quick. The down fall was truly not any fault of the establishment. A reservation for 8 that didn't show up on time and a table of 2 that lingered at their table for almost an hour after paying their bill caused seating to be tight leaving a cold and drafty table by the door our only choice. Make a reservation if you choose to come here and stay away from the table by the door and you should enjoy yourself. Cheers.",
   "Wow wow wow please try this place! Papricas,  schnitzel and patato pancakes are to die for!!! Please just try it I also recommend the beef goulash and the apple strudel everything is out of a grandmother's kitchen homemade and absolutely fabulous the beer is amazing too",
   "The food was fantastic. I also took a bite of my boyfriend's meal and it was equally delicious. I felt the service was rushed and out of sync. It will definitely be worth another try. Also, do not sit at the table by the door. The door kept opening and freezing me out. 😔",
   "We had a family meal here on Christmas eve.  The menu is quite diverse and everyone enjoyed their meal. I shared a  Chicken Paprikash pizza which was phenomenal!  I will reserve the right to \"bump up\" my rating when we have an opportunity to revisit this restaurant on a less busy day.  I  could just trash the wait staff and service based on that evening, but I realize it was busy,  obviously busier than anticipated,  and will be back to enjoy their offerings again."
  ]
 },
 {
  "name": "PARAGARY’S",
  "address": "1401 28th St, Sacramento, CA 95816, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ba3f70b6-9333-11ea-b365-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14688789438092656079",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice setting (music was just the right volume). Outstanding service (the waitress was there enough to be attentive but not too much to be obtrusive). Excellent food. Price was average to excessive. Was here on day with Prix Fixe menu, so selection was minimal, but the composition and presentation of the food was truly exceptional.",
   "We came to celebrate our anniversary because this is where we had our first date. We were shown to a table where is was so noisy that we would not have been able to talk. The staff had no trouble finding us just the right table.\n\nMy pork chop was tougher than I would have liked and my husband's salmon was under cooked. Service was very good.",
   "I haven't eaten at this place yet. Which I am ready to try when the weather gets warmer (since they have a lively outside patio). However, I really like the ambience and their specialty drinks. I would also like to mention the great hospitality from the bartenders and host.",
   "Had a wonderful time at Paragary's for a large group brunch! Avocado toast was the best I've ever had, anywhere! And the lemon ricotta pancakes (topped with blueberry compote) were fabulous, too (sorry, didn't get a photo of the pancakes).",
   "The food and service were excellent. My wife had the fish special and she said it was delicious, I had the short rib stuffed ravioli which was also very good. The only issue we had was that the portions were small for the price we both left the restaurant feeling under fed."
  ]
 },
 {
  "name": "Morton's The Steakhouse",
  "address": "621 Capitol Mall, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ba9224d0-9333-11ea-9983-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15563778445890099694",
  "source": "GoogleMaps",
  "reviews": [
   "This will be a bad review. I did not want to post it right after the visit. I was hoping that my brain will a bit erase all the negative, but it did not.\nIt was our anniversary. I am not a steak person. But my husband is, so i decided to make him pleased and chose the steakhouse. The food was awful. My husband’s steak was burnt. It was super oily and did not taste good at all. I ordered prosciutto mozzarella it was also bad. The sides were bad. Cocktails were disgusting. If you charge $16 for the cocktail- you have to make it right! The service was terrible. We put my husbands jacket at the chair next to us. Every time when the server was near our table he leaned on the chair and put both of his hands on the jacket!!!! It was every time! And he was at least 5 times near our table. We also ordered a draft beer and got it in the bottle. We won’t come back for sure and never suggest it to anyone.",
   "This site is my preferable site.  Of all restaurants I know I like it most. I never miss an opportunity to go to that place. everytime  I I need a decent meal, this is the place that comes straightaway to my head.  Great and   food and a rich cuisine.professional staff members, and great mood. In addition to that, the charge is reasonable. I recommend this spot with pleasure.",
   "we went to celebrate an occasion, three adults. All three agree this is some of the best food we've ever eaten everything fantastic. The only one that wasn't to my par was the lobster mac and cheese but everything else was fantastic. The bill was $530 for 3 but we splurged and we'll do it again get reservations and enjoy a fine restaurant. Our waiter was David and he did a fantastic job as well. We had two appetizers a piece and a few drinks, a main course and boy was it good.",
   "Less than expected. Ordered curbside pickup. Steakburgers weren't juicy & fries were cold. Soooo disappointed!",
   "I dine in this great restaurant quite a bit! This is my favorite spot to grab a bite.  I go there routinely. The meals are just great, the crew is welcoming and the prices are reasonable. I enjoy meeting in this restaurant over a rich lunch."
  ]
 },
 {
  "name": "The Red Rabbit Kitchen and Bar",
  "address": "2718 J St, Sacramento, CA 95816, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bb08668a-9333-11ea-87d6-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "eat",
   "music",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=14175224407522235114",
  "source": "GoogleMaps",
  "reviews": [
   "Great atmosphere, beautiful place to have a drink and conversation. The food is good but nothing spectacular. I do recommend this place to let loose and enjoy a meal. Great spot for a date.",
   "The Wellington was only for the dine downtown. It was made perfectly. Crispy on the outside and juicy and tender inside. The pork osso buco is my all time favorite there. Also very crispy!",
   "Didn't beat here because the menu was too limited... Like the music atmosphere and splendid lavender fragrance they had... But without a varied menu selection I didn't bother sticking around to eat because they just didn't have anything I wanted.",
   "This place is my preferred one. I go to a lot of restaurants but to this restaurant I  constantly return again and again. The stuff is very amicable and the cooking they place on your table is so appetizing. I never miss an opportunity to have a decent meal in this place. Highly recommended.",
   "The people who make you drinks are very cool and chill. They aren't rude if you personalize your own drink to your liking. Very cool people. They make sure your attended"
  ]
 },
 {
  "name": "Foundation Restaurant & Bar",
  "address": "400 L St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bb5c2c12-9333-11ea-88b2-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "knowledgeable",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5677275065133499595",
  "source": "GoogleMaps",
  "reviews": [
   "Great for lunch in that they have happy hour menu. Between three of us we ordered fish tacos, burger and French dip. We all very much enjoyed the food, with the onion rings being fantastic, but French fries were just so so.  One issues may be parking, but there is a garage across the street, otherwise there are meters along the front and side, but they may be taken up or restricted based on events.  I'll be returning for dinner to see how the main dishes are, and I have a feeling they will be quite good. I recommend this spot.",
   "This site is my favorite site.  Of all restaurants I know I favor it most. I never miss an opportunity to go to that place. Whenever  I want to go to a delicious dinner, this restaurant comes first to my mind. splendid and diverse  food and a large menu.courteous team, and agreeable vibes. Also important, the price is modest. I praise this restaurant with great pleasure.",
   "This place was busy. We were seated quickly. Our waiter was great, friendly,  knowledgeable, never left us wanting. \nThe food tasted as wonderful as it looked.  I had the fabulous braised short ribs  and it was as generous serving. We will be back.",
   "Amazing vibes and super attentive service. The meals were crisp and delicious. Will absolutely recommend this restaurant to friends and family. Convenient rates and generous portions. Keep up the great work.",
   "This place is located on the corner of 4th and L Street. They have a really friendly atmosphere and the bar is separate from the tables. It is handicap friendly. I joined some friends for Dine in Sacramento. The food is outstanding. I chose the spicy green beans, braised short ribs and the chocolate brownie pie. I was not disappointed. I even took home a doggie bag. Try the brussel sprouts with bacon."
  ]
 },
 {
  "name": "Backbone Café | Organic Health Food Sacramento",
  "address": "729 J St, Sacramento, CA 95814, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bba2a046-9333-11ea-bc7f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "sampling",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11669446604837847690",
  "source": "GoogleMaps",
  "reviews": [
   "Such a little gem right in J St.. great organic food, lots of vegan options, amazing smoothies and I can wait to come back for the broth bowls.\n\nSuch a cozy environment, ultra local vibe, healthy delicious food all the way. They even have a cool book, game and coloring section.\n\nThey take cash and cards so no worries there. \n\nGreat salads and even the burger was delicious. Can’t wait to come back.",
   "Yet another great cafe that has a solid selection of vegan options in the Sacramento area. I went with the Vegan BLAT and a side of fries. It was a very flavorful mushroom cap and sauces weren’t too overpowering. Also, the fries were really good. IMO not all places have fries that genuinely hit the spot. \n\nThe location feels a little tucked away but quaint when you get inside. The decor is fun and very mushroom forward. I loved that they had cards on the tables describing different mushrooms and where to find them.",
   "Wow. Who knew? Tucked on the corner I would have never ever have found this place if it wasn't for local guides here.  A group of us gals had a good sampling of their delicious fries and portobello mushroom burger. It was probably one of best organic healthy food restaurants in downtown Sacramento.",
   "This place was a surprise and a great one. The staff were super kind and friendly. The food was amazing and the place has such amazing decor. Its a wonderful place to catch up with friends and coffee/lunch break, a date time or even has a quick bite to eat. Definitely will be coming back here.",
   "Nice little cafe. Enjoyed the power bowl and the Golden milk was as really good, first time trying it iced (cashier’s suggestion, thank you!). Very cozy spot, I look forward to my next visit."
  ]
 }
]