[
 {
  "name": "Riverfront City Park",
  "address": "200 Water St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bbfa8480-9333-11ea-9272-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "active",
   "walking",
   "walking",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=7136328767004271992",
  "source": "GoogleMaps",
  "reviews": [
   "Love it. While I need some repairs it really is a cross-section of Salem. Dog walkers and hikers, picnics and kids playing.  You can even walk across the railroad trestle to Wallace Marine Park and visit the homeless camps the City of Salem just put up. That was said tongue in cheek.  If you live inside the Salem City limits, please remember to fire the mayor and city council when you vote.",
   "I've always loved this park! It has grown and have been molded into something that other towns are envious of. With the newly built walking bridge across the river, it allows people to be much more active. I can't wait to see more to be added to the park.",
   "This iconic park has always been a staple for Willamette Valley residents. When they installed the carousel two decades ago it was a very appropriate monument to a time with less technology. For the longest time this park had one of the last phone booths in Salem. This park has just about everything. The carousel, it shares property with the children's science museum, copious walking trails and direct access to the Minto Brown Park trail system.",
   "Really nice park space for all ages. Splash pad in the summer, regular park activities and movie nights in the summer. Being connected to Minto-Brown island opens up tons of new day adventures and bike riding opportunities.",
   "So great to see the connectivity of the park system with a waterfront appeal! Nice amenities and large grassy areas. One of the better downtown parks in the NW"
  ]
 },
 {
  "name": "Minto-Brown Island Park",
  "address": "2200 Minto Island Rd SW SE, Salem, OR 97302, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bc4a32ba-9333-11ea-bc70-14b31f159f22.png",
  "tags": [
   "walk",
   "parks",
   "walking",
   "pets",
   "parks",
   "walk",
   "field",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=17999432541665570614",
  "source": "GoogleMaps",
  "reviews": [
   "I have been coming here since I was a little kid, i grew up walking all the trails in this park and even as an adult today I continue to do so. This is one of my favorite parks to roam endlessly through and you can definitely do that here. There are hours worth of trails you can walk around whether you want to walk through some wooded areas or fields or walk alongside the river, this place has it all. Its peaceful, its serene, its clean, and it's safe.",
   "👍👍HUGE, beautiful park. Floating dock to fish from or swim in river from. Off leash pets welcome. Salem Park Operations does an AMAZING job taking care of our parks, which there are approximately 70 or so. Check them out and bring your appitite... there are barbecues!👩‍🌾",
   "Incredible dog park we're talking football field maybe longer and significantly wider, walking paths and trails for miles, kids play set doesn't compare to keizer rapids but they have a nice gazebo area and lots of room for a grassy picnic.  Water access pretty close to parking areas but if your fishing you might have to walk a distance to get to that honey hole.",
   "I have grown up in this park. There are enough paths to explore almost perpetually. The dog park is one of the largest I have ever found and the Pokemon hunting is prime. The playground could really use an update, I played on the same structures as a child.",
   "This park is awesome!  It is beautiful with tons of trails, both paved and natural paths, and it felt safe.  The dog park is huge and so nice!  I really appreciated how dog owners were responsible and attentive to their dogs off leash, and every single time a dog went #2, the owner picked up after their dog! (This is important to us dog people who like a clean environment.) Love this park!"
  ]
 },
 {
  "name": "Bush's Pasture Park",
  "address": "890 Mission St SE, Salem, OR 97302, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bc94a936-9333-11ea-a915-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1185901318333610358",
  "source": "GoogleMaps",
  "reviews": [
   "This park is nuts. When I say nuts I mean the squirrel population is booming. They are everywhere. My dog is super crazy here because there's so many squirrels to see. They take very good care of this park (yes the squirrels). I love running here as there is so much to see. My favorite part though has got to be the squirrels.",
   "Bushes park is a wonderful place to go when you want to relax, read a good book, run or play on the playground with your kids. Very clean and the landscaping is GEORGIOS.  A GREAT PLACE TO BE WHEN YOU WANT THE COUNTRY IN THE CITY.",
   "This is an awesome  Place so much things  To do their great for families but they do not have a disk golf course I walked the whole park and did not find one basket all in all though they have playgrounds hiking trails creeks it's very beautiful for being in the middle of a city you really forget that you're in a actually city. Great place to go spend time with family go walk around exercise or just think",
   "Absolutely love this place. The oak trees are just amazing and the grounds are kept so clean! This is a great place to visit on a day off and I'd love to see if Salem still makes use of the soapbox derby track.",
   "This is the biggest park in Salem. Great place for Bar B Ques or family reunions. The grass is always so green and freshly mowed. A very Beautiful Park."
  ]
 },
 {
  "name": "Gilbert House Children's Museum",
  "address": "116 Marion St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bcded1e2-9333-11ea-a4ba-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "kids",
   "family",
   "kids",
   "library"
  ],
  "link": "https://maps.google.com/?cid=6029049214506534978",
  "source": "GoogleMaps",
  "reviews": [
   "Pleasant children's museum located in the beautiful old homes. The indoor displays are simpler than the ones in other newer children's museums, making them interesting for about second grade and younger (my preschool niece lived there whole thing!). My middle school aged daughters really enjoyed the motion sensing dance room (see pic).\n\nWe were there on a rainy day, so we couldn't enjoy the outside playground. All the of our kids would have enjoyed this! There are also nice picnic areas outside. You can bring your own picnic food with you (no restaurant or snack bar on site).",
   "Our girls ages 12, 9, and 6, love the outdoor climbing maze with it's slides.  Indoors we love the silhouette room and doctor and vet rooms where we can view x-ray pictures.  Our three year old loves the farm room milking the cow and guiding the submarine.  We took our friends there and had an outdoor lunch under the covered area.  All their boys and all our girls had a blast!",
   "We have been coming here for 7 years and they constantly keep on working on things getting them cleaned up, coming up with new displays. Our kids really enjoy this place and it is wheelchair accessible in case you have a grandparent that wants to come watch your child play outside. We highly recommend the family membership it also works for other places around oregon as well",
   "This is a great children's museum! The rooms don't change a lot, but they're a lot of fun! The playground outside is fantastic and big enough for adults to play too! The bummer with a museum on an old estate is that you really feel it if it's busy since there's only one way in and out of rooms into narrow hallways. Still, a great children's museum for exploring little minds!",
   "Great place to take your little kids to play. Lots of rooms to explore and plenty to do to keep your kiddos busy! Fun to meet a friend for a play date here. My daughter loves the kitchen, atm/money, and tools area the best! Using your library pass for a visit is an added bonus!"
  ]
 },
 {
  "name": "Deepwood Museum & Gardens",
  "address": "1116 Mission St SE, Salem, OR 97302, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bd20bd02-9333-11ea-8a0e-14b31f159f22.png",
  "tags": [
   "learn",
   "free",
   "history",
   "knowledgeable",
   "history",
   "walk",
   "knowledgeable",
   "tour",
   "free"
  ],
  "link": "https://maps.google.com/?cid=14005878407034981796",
  "source": "GoogleMaps",
  "reviews": [
   "The museum was open today for free tours provided by ladies wearing correct time period apparel. Nice to learn some history.",
   "Even if you aren't a history buff, the house and the grounds are beautiful. It is worth it to come during all seasons to get a wonderful feel of the Pacific Northwest and all of its seasonal plants. The staff is very friendly and knowledgeable and took all the time to answer all of our questions",
   "Was such a lovely day, had a peaceful walk around the grounds. Love this place!",
   "First time visiting.  Didn't look at many things, but what I saw filled me with peace and contentment.  I ate my sandwich and rested in the shade of two beautiful trees as I waited for my doctor's appointment.  The volunteers and staff were kind and knowledgeable about the species of flowers and trees.  Wish I had the time to wait for more doctor's appointments there.",
   "This is such a charming, historical place! I highly recommend going on a free house tour. The exhibits are constantly changing and they even hold high teas here every month. If you want to take a step back into time, definitely put Deepwood on your list."
  ]
 },
 {
  "name": "Willamette Heritage Center",
  "address": "1313 Mill St SE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bd68277a-9333-11ea-9302-14b31f159f22.png",
  "tags": [
   "history",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=774131211214114254",
  "source": "GoogleMaps",
  "reviews": [
   "Went for the yarn store inside. They where closed despite the door and the desk saying they should be open. Really made me mad because i was so excited to go in and look. From the window it looked like they had some good colors and yarns but cant definitely say.",
   "Nice little museum, interesting history and exhibits on pioneering missionaries around Salem and Marion county and the establishment of a textile mill there. There is some limited associated Native American history mostly in one area kind of pushed off to the side in the main building as I recall. You can go into several old buildings of the period on site (you'll get a key with your admission).  Also you can go into the textile mill building. If you want to see one of the old automated  looms in action and no staff are there, call the front desk on your cell and they'll send someone to turn it on (albeit briefly) for you to watch. I visited in November.",
   "Loved our visit! I learned so much about the area and about the mill process. The tour had many interactive pieces which added to the experience. There is so much to see so give yourself time. We like to read all the signage and our visit took about 3 hours. Wonderful place to stop! Staff were very friendly. The shops were also fun to check out at the end.",
   "This place is a wonderful event venue! Charm, character and history all wrapped up together! Lots of space - it can be configured easily to fit your needs.",
   "This is a very interesting collection of buildings that are each a small museum on their own that tell about an early industry in Salem.  The early hydropower display is particularly interesting.  There is a holiday light display in season where various groups have demonstrations.  The garden scale railroad and blacksmith displays are favorites of mine."
  ]
 },
 {
  "name": "OSH Musuem of Mental Health",
  "address": "2669, 2600 Center St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bdafb6ee-9333-11ea-8f78-14b31f159f22.png",
  "tags": [
   "walk",
   "knowledgeable",
   "kids",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=16362032939317579734",
  "source": "GoogleMaps",
  "reviews": [
   "informative and interesting! I highly recommends stopping here if you're ever in Salem.  It costs $7 to get in and see the exhibits and walk the grounds. One Flew Over the Cuckoo's Nest was filmed here and there's amazing memorial outside (the copper cans). The staff are knowledgeable and friendly.",
   "Went in today to see what changes and progression they have gained by making the historical, still standing part of the building a museum. \nWas very informative about mental health care and how far it has come in the last 100+ years. I was hoping they had more information on the museum building its self and the history it has been subjected to through the years but,  since only the front bottom nodule its limited. More information on this specific museums history would be great. $7 a pop for adults... Students are less. \n\nDont forget to go see the memorial they situated for the forgotten urns that where discovered concreted into a \"room\".\n\nThey also left a lot out about the untold history of the building and \"not so good\" events. \n\nOverall.... Great host (thank you Bob), very informative about mental health history. Great displays,  time line is nice,  straight jacket was fantastic and the grounds are nice. Good for kids (that do not touch)!",
   "Truly enjoyed learning how mental health treatment and views have changed throughout the years.",
   "Cool and sad at the same time. Worth a quick stop to check it out",
   "I found it a fascinating adventure! I love the fact that it was a self-guided tour and I could take as much, or as little, time as I wanted. I read a lot of the information there, as well as taking some pictures, to read information later, as there was so much. I'm really glad I did it, as were both of my friends that want with me!  Downside: limited available parking at times."
  ]
 },
 {
  "name": "Oregon State Capitol",
  "address": "900 Court St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/be006b0a-9333-11ea-846e-14b31f159f22.png",
  "tags": [
   "unique",
   "walking",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=2901398585821012041",
  "source": "GoogleMaps",
  "reviews": [
   "The grounds at this capitol building are more beautiful than any grounds I've seen elsewhere! There's so much grass to relax on and gorgeous rows of trees lining the fields. At the center of it all is a unique water fountain. The very best time to visit the capitol is in the spring. The flowers are blooming and the trees are in full blosom.  The inside of the capitol building is beautiful as well and fun to explore.",
   "It was wonderful walking through the halls of power for the State of Oregon. I was most impressed with the Sergeant at Arms calling me over to sit with him as he explained to me the proceedings of the day since I arrived early and was wandering through. I was also able to witness the Senate opening ceremony including a poem by a local student and the Pledge of Allegiance. What struck me was every few minutes someone would yell out loudly into the hallway. At first I thought it was an emergency but seeing everyone else continue like normal I figured it must be a regular occurrence. I found out later that it was the job of pages to call the elected officials back into the chamber for votes. So a minute before the vote closes they run into the hall and yell out that it’s time to return and vote.",
   "Visiting Salem and took the opportunity to visit the grounds of the State Capitol. Hadn't been here for a long time and it still is beautiful. I love the granite used in the construction of the buildings and also the architectural design. And what's not to like about the gold leaf statue on top? 👍",
   "Beautiful Area but Oregon Lacks Proper Stewardship. Instead on kindling a Pioneering spirit inclined to prosperity. They trade that and feed the spirit dependency. We need to Help and assist the Retirement class and Truly disabled people.",
   "It is worth visiting if you are near Salem. The Capitol building looks amazing from the outside. I didn't take the tour or go inside the building."
  ]
 },
 {
  "name": "Honeywood Winery",
  "address": "1350 Hines St SE, Salem, OR 97302, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/be46c2e8-9333-11ea-b5bf-14b31f159f22.png",
  "tags": [
   "winery",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=7113722236894777328",
  "source": "GoogleMaps",
  "reviews": [
   "Ordered some wine online as a gift to my friend who lives in Georgia. Her favorite wine is the raspberry, and it was a birthday present. I though maybe they would put a card that just said happen birthday, but instead the wrapped it in a bow and even filled the box with confetti! Definitely went above and beyond my expectations!! Will be ordering again!!",
   "Friendly Staff. One if Portland's oldest Wineries",
   "Fantastic experience. Large store with a great selection. All wines are available to taste with out any issues. Just ask. If you're from out of state you can pay to have your selected wine shipped to your residence.",
   "Great winery! We have gone for wine tasting and went home with a few bottles. Loved everything we’ve tried. I went this evening to pick up some more wine and received excellent customer service yet again. Thanks",
   "Went to here on the 29th and I loved the service I received. The worker was also named Crystal which I loved and she had great recommendations for me! Enjoyed the flight I did and learned about the third Friday events! Looking forward to coming to the next one.\n\nThank you for the wonderful wine and wonderful service other Crystal!"
  ]
 },
 {
  "name": "Cascades Gateway City Park",
  "address": "2100 Turner Rd SE, Salem, OR 97302, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/be874eae-9333-11ea-a50c-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=7209668964653568091",
  "source": "GoogleMaps",
  "reviews": [
   "It's fun if you are just getting started fishing. Usually pretty well stocked with rainbow trout. A lot of geese activity though.",
   "Fish the lake when they Stock it proves fun ! Watch the Osprey fish too they put on a great show ! Bring the kids fishing or pack a Picnic lunch & watch others fish ! Frisbee Golf coarse at this park as well & Keeps Your Dogs on Leash 😎",
   "This is a very beautiful place to take a walk, and even though the county is working very hard to clean it up by cutting out the brush and over grown bushes so that the homeless cant hide there; I still wouldn't suggest walking it alone, or at least with out a dog and some pepper spray, or some sort of protection! The water path though is remarkable for picture taking! Enjoy and be safe!",
   "The park is great in the summer and you can take a dip in the creek.\nThey also have a nine hole disc golf course but I haven't personally used it.",
   "Just a lot of fisherman and the trails aren't great.  Looks like a decent disc golf course though. Just not really a place to get your steps in."
  ]
 },
 {
  "name": "The Peter Courtney Minto Island Bridge",
  "address": "230 Front St SE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bee12ec0-9333-11ea-8e3f-14b31f159f22.png",
  "tags": [
   "nature",
   "walking",
   "family",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6071222248036149452",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice bridge for walking. Offers great views of the river and parts of downtown. Good access from downtown river front to minto Brown park and nature.",
   "Sunday - July 21, 2019.  Salem's high daytime temperature was 83* and  plenty of folks were enjoying the great views from this bridge at sunset.  I love riding the bicycle trails in Minto Brown Island Park and remember the days prior to the Summer of 2016 when Riverfront Park did not have this amazing walking, biking, rollerblading and skateboarding connection with the largest park in Salem, Oregon (1205 acres).  Highly Recommended this great venue to all your family, friends / neighbors - and especially folks visiting Salem and the Willamette Valley.  *****Ten Stars*****",
   "Beautiful bridge to have a quick walk Into mento brown. Or park in mento brown and bike across it to enjoy a nice croissant from cascade bakery across the street. Very beautiful views of the river Bend and worth the a little walk over.",
   "A surprising modern bridge next to the water front",
   "Beautiful pedestrian bridge"
  ]
 },
 {
  "name": "Salem Art Association - Bush Barn Art Center",
  "address": "600 Mission St SE, Salem, OR 97302, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bf2cddd8-9333-11ea-ace3-14b31f159f22.png",
  "tags": [
   "unique",
   "tour",
   "art",
   "art",
   "history",
   "family",
   "wander",
   "art",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10736624357247897585",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely display of artwork and locally made items. The desk representative was helpful and polite. This is where you buy the Bush House Tour tickets. Great place to find a unique or special gift for someone. They have everything from yard art, cards, jewelry, kitchenware and decorative items. There is a small Park located near by with a drinking fountain and picnic tables. :-)",
   "A great place to see art of artists doing their work.  This is the work of one my favorite artist that is doing his work during his residency. Roberto Oran. Great talent. Here is a video of how it looks inside. Come in and enjoy this art in salem Oregon",
   "Very interesting place to go loved it my daughter put her artwork in there people very polite and the history of that Park is amazing highly recommend it to anybody",
   "Excellent show I've ever seen for public viewing. Beautiful setting in park and very clean and neat. Art works were original and not copies.  Some were better than others.  Jewelry prices were a little inflated, but that comes as a personal opinion.  People were friendly and vendors were helpful . Easy access for wheelchairs and people could wander through exhibits at their leisure.  Food vendors available, but I didn't try. Nice place with the family. Wish they did it more often.",
   "My step mother handles most of the lovely events and she does a fabulous job."
  ]
 },
 {
  "name": "Wallace Marine Park Softball",
  "address": "200 Glen Creek Rd NW, Salem, OR 97304, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bf6d1b6e-9333-11ea-a043-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=9861279265263946587",
  "source": "GoogleMaps",
  "reviews": [
   "It's a great park to walk your dogs. They put in new trails and have taken out a lot of blackberry bushes. The ball fields looked the same as always but we didn't really visit them this time.",
   "It's a great place to go and right on the river too. If you go to go swimming,  there are lots if rocks so have water shoes or strong feet. They had bathrooms and some picnic tables. The nearby park was nice, too. A company Woodward surf company had kayaks for rent there, I didn't do them but will next time!",
   "Aside from the bulldozed tent troll dope mess, trails were expanded from the previous years and improved access to ponds. Nice people though. But unleashed dogs in unfenced campsites. Let them be. Change their dope.",
   "The same park I always had fond memories of growing up.   Swim area looks different and train bridge is now a pedestrian path (love it) but still a great place.",
   "Fields were SO clean and well maintained."
  ]
 },
 {
  "name": "Keizer Rapids Park",
  "address": "1900 Chemawa Rd N, Keizer, OR 97303, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bfbd105c-9333-11ea-b5cf-14b31f159f22.png",
  "tags": [
   "hike",
   "kids",
   "independent",
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12256561629591777913",
  "source": "GoogleMaps",
  "reviews": [
   "Great trail! Huge dog park. Nice play structures. River access when it isn't flooded. The hike is partially shaded, so excellent for people who want to avoid the sun or just stay a bit cooler A great place for a quick hike with puppies!",
   "Great park. The 5 and under section is so important with how many visit the park. Paved path is great for kids to ride on. There is also a dog park and beach volleyball across the way.",
   "best park ever! kids playground is so fun and fenced in so you can let them run and be Independent  plus there is no busy road nearby like Bush park for example where the kids could take off to quickly(all.parents know you just have to look away for a half a second and anything can happen) here I dont have to be anxious the entire time about imminent danger(note: I am far far from being helicopter mom but these things still freak me out) we can just have fun and play!!",
   "This is the best time of year for Keizer rapids disc golf... For not losing discs in the woods. You might want to skip hole 12 if you don't have a boat. It would be nice if the baskets had bright flags or top rims.",
   "So much to do here! Upon entrance is the big dog park attached is the little dog park. The Big Toy playground is across from the sand volleyball courts. Beautiful trails to walk; some paved some unpaved. Access to the boat ramp is down the drive plus additional parking! Plenty of benches to rest any weary bones! Many friendly people stop and say hi!!"
  ]
 },
 {
  "name": "Powerland Heritage Park - Antique Powerland",
  "address": "3995 Brooklake Rd NE, Salem, OR 97303, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c01b842e-9333-11ea-8fd5-14b31f159f22.png",
  "tags": [
   "family",
   "tour",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=6348905678555973674",
  "source": "GoogleMaps",
  "reviews": [
   "Please take your children & family this will open eyes to look back and see what a Grandpa or great Grandpa did to raise crops or build machinery whichever the case please go and take the time to visit. There is so much to see and touch and the stories that the old timers tell of is worth it in itself. I've been going for a long time and it never ceases to amaze. Like I said it's a blast your children will love it!",
   "I have been coming here for years and I love the changes and the improvements that they have done it really brings the old into the new thank you for everyone who has participated",
   "Went to the steam/ equipment show, there was so much to look at and enjoy about the machines our forefathers used to farm, log, etc. Took a full day to see it all! Well done!!",
   "We did a tour and the staff did an amazing job of explaining any questions we had. They have 14 different museums, everything from large trucks, classic cars, train and Trolley museum. It's definitely worth seeing. I know young boys would absolutely love it. It's family friendly and can also picnic on the grounds.",
   "Fabulous place to visit if you love history and antiques. Great collection of antique tractors, trucks, cars, motorcycles. Loved riding the old trolley and viewing the old-time sawmill. My husband and I spent about 6 hrs here just looking around and enjoying the past."
  ]
 },
 {
  "name": "Hallie Ford Museum of Art",
  "address": "700 State St, Salem, OR 97301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c06c3c70-9333-11ea-ab36-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "free"
  ],
  "link": "https://maps.google.com/?cid=3093486555167494098",
  "source": "GoogleMaps",
  "reviews": [
   "It was sadly empty when we went (sad because this little museum has some great stuff and deserves more attention, though fun to have an entire art museum to ourselves!) But the staff was lovely and helpful and they had some very cool pieces and exhibits. Worth a visit.",
   "Thoroughly enjoyed the current exhibits as well as the permanent collections. Excellent museum with great art pieces and well laid out.",
   "This is a wonderful museum. I initially visited in October 2019. I shall return.",
   "Allowed our sketching group to spend time there. Wonderful museum, really loved the native exhibit",
   "Really enjoyed visiting this little museum( felt a lot like a gallery) Permanent exhibits of ancient artifacts, coins,icons, eastern and western were a happy surprise. Downstairs modern Oregon artist works on display. Very nice, small but wonderfully curated, gift shop. Enjoyed my,stumbled upon it , visit! Visited after the Cherry Blossom Festival at the Capitol which just happened to fall on a free admission day.. My granddaughter really enjoyed the interactive exhibits"
  ]
 },
 {
  "name": "Bryan Johnston Park",
  "address": "400 Mildred Ln SE, Salem, OR 97306, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c0b2bdee-9333-11ea-92c9-14b31f159f22.png",
  "tags": [
   "kids",
   "structure",
   "walking",
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=12951222030463627656",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great spot for the kiddos or the dogs or the Pokemon trainers. The playground is very modern with a play structure suitable for five and younger as well as some very entertaining modern moving play structures for the older kids. Lots of spinning toys. With a fairly large sized hillside and walking path, the park is excellent for dogs. Picnic tables and a small basketball court complete this great neighborhood attraction.",
   "This is a great place for the little ones like infant walkers and toddler aged even up to maybe age 5 but the bigger kid section is just that set up for older aged kids. I feel like it leaves out the in-between ages from 6-9 where they aren't big yet and yet are not small. Sometimes this park can feel over crowded really easy. I have a 7 year old and she has a hard time having fun here due to the limit of activities and play structures she is even limited to those as well.",
   "It’s a neat park for kids. I love the view of the mountains when the sky is clear.",
   "This is what a great neighborhood park looks like. The addition of a vault toilet would increase this to a 5⭐ park.\n\nIf you're an adult, I suggest you stay away from the playground equipment in the photo... I was spinning so fast on this thing once, I almost lost my lunch 🤢 I dont think it's designed for grown men. But my 3 y/o niece had a laugh, so it was worth it ¯\\_(ツ)_/¯",
   "Great cute park quite quaint. Good for kids and dogs"
  ]
 },
 {
  "name": "Orchard Heights Park",
  "address": "1165 Orchard Heights Rd NW, Salem, OR 97304, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c10cc3e2-9333-11ea-9059-14b31f159f22.png",
  "tags": [
   "field",
   "walk",
   "kids",
   "kids",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=2378970507129601921",
  "source": "GoogleMaps",
  "reviews": [
   "Nice park. Big dog park is up trail nice big field surrounded by trees but not fenced.",
   "Nice park with loads of wild rabbits hopping around.",
   "Great place to just walk or jog on the trails. There's a kids playground, two baseball fields, some tennis courts, and dog friendly area where you can let you pooch of the leash. Lots of parking too.",
   "Great place to take the kids to play. Has a nice nature trail as well.",
   "Nice place to do sports, bike, fly planes/drones, and just hang out."
  ]
 },
 {
  "name": "Coria Estates",
  "address": "8252 Redstone Ave SE, Salem, OR 97306, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c1603bd2-9333-11ea-98f8-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "tasting",
   "music",
   "tasting",
   "tasting",
   "music"
  ],
  "link": "https://maps.google.com/?cid=12918581999619030339",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely gorgeous views. I love their seating arrangements outside. Very relaxing atmosphere. One of my favorite winerys by far. Wine is delicious, the staff does a great explanation on each one",
   "Beautiful location and great staff, but their wines were brutally acidic even for the Willamete Valley, and bit forgettable. If you go bring food to preserve your palate.",
   "The wine has improved. The wine tasting area is a spectacular improvement over their old one. The music was perfect. The weather was gorgeous. Sharing it all with a friend made it all so much better.",
   "This is a hard post to write....my first experience here was very decent....it was late 2018 and my wife and I stopped in to try some wine early one morning.  The selection was limited but we left with three bottles and a smile.... memorial day weekend 2019 on the other hand....same selection of wines but expanded.....as the new vintage had yet to be bottled....and we left after a short bit having felt the tasting fee was a waste.....whatever happened over the winter needs attention....",
   "Fantastic experience all around!  Myself, my boyfriend, and a good friend all went for the Memorial Day event and loved it!  My boyfriend isn't much of a wine person but still loved the views, service , and live music.  The biggest thing that made this vineyard stand out was that it's dog friendly.  We sat in the grass looking over the hills while enjoying our tasting, all the while not having to leave our furry best friend home! I'm now looking into their wine club!\n5/5 - would recommend"
  ]
 },
 {
  "name": "The Oregon Garden",
  "address": "879 W Main St, Silverton, OR 97381, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c1adc064-9333-11ea-a4bf-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "tour",
   "eat",
   "food",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8041950590625160754",
  "source": "GoogleMaps",
  "reviews": [
   "We actually went to the restaurant at the hotel that sits above the Oregon Garden (Oregon Garden Resort & Spa). Husband and I were late for lunch and early for dinner service, so we tried the pub there. The pub is comfy, big fireplace in middle, nice bar, good beer, and food is yummy like the restaurant but with a more limited bar menu. Had the Hop Valley ale (lighter, very smooth beer) - really liked it! Also ordered the steak tacos. A little spicy, garlicky, and very generous serving of 3 tacos. Husband had popcorn shrimp and a Caesar salad. The salad looked delicious - individual cloves of roasted garlic, bacon, etc. He thought the shrimp were a little over cooked, but overall quite good. I really liked the bar. Service was quick, server very pleasant and attentive. Will be back! Really like the setting, the restaurant, and now the pub.",
   "What an amazing Garden. This place is beautiful and well maintained. I visited while the magnolias were in bloom and was pleasantly surprised by the variety of early season blooms I was able to enjoy while having the whole garden nearly to myself. I would have liked to have spent more time enjoying the garden and will definitely be going back for another visit ASAP.",
   "Beautiful garden and it is large enough to take hours to look around the whole area. There are couple small trails to take as well. Just make sure you are coming after fall, otherwise most areas will be not fully blossomed yet.",
   "Very nice weekend and we will definitely return:\nFood: We didn't eat in the restaurant but had happy hour in the lounge and it was nice. Breakfast was very good, everything fresh. Good coffee.\nThe room: Nice, not luxurious but quite comfortable and very quiet. Bed not the best and bring you own pillows. The room was clean and quiet.\nThe garden: outstanding. Everything maintained well, pleasing to the eye and even the ear. Well worth the time and price of admission. Having it included with the room added value.\nTour tram: Wild Bill was our driver and we really liked him, he was very pleasant and informative, he made it a real treat. The tram tour gave a wonderful overview of the garden that made us want to explore.\nAll in all a great experience we would recommend highly.",
   "A delightful day spent strolling through the gardens, enjoying a family meal at the provided picnic tables, and learning so much about the history of the Garden. I highly recommend a visit. Mobility issues can be alleviated by the shuttle service within the grounds."
  ]
 },
 {
  "name": "Willamette Valley Vineyards",
  "address": "8800 Enchanted Way SE, Turner, OR 97392, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c1fb6a74-9333-11ea-afec-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "knowledgeable",
   "food",
   "tour",
   "tasting",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=17761011812422266167",
  "source": "GoogleMaps",
  "reviews": [
   "Superb vineyard with tastings and excellent menu of appetizers and entries in the Willamette Valley.  They offer a large selection of varietals from around the valley and in nearby AVAs (as far as Walla Walla). Private tours are available by appointment for members, and are well worth it. Every wine we tasted here was fantastic.",
   "I love this place! Such a great view of the valley, and a nice place to catch up with loved ones. Their flights are a great way to try several types of wine and find a new favorite. I also love that the bottles are reasonably priced. All I’ve ordered food wise is the fries - which were tasty for sure! I did love the tualatin semi-sparkling muscat, I’m more of a white wine girl and it was sweet like peaches. The staff was prompt and courteous (though I would love the option to bus my own table). Sarah was our server, super friendly and easy to talk to :)",
   "Amazing experience! Not only is the wine and food delicious but the customer service was outstanding. Brian went above and beyond to ensure that we had a great time and we definitely did. He was knowledgeable, attentive, and all around his customer service was top notch. The views are also breathtaking. We will definitely be back",
   "My friends and I had a great time touring this vineyard and I would definitely urge people to go on the tasting tour. It took us about 2 hours and was decently prices for getting wine tastings as well as cheese and almonds.  The stories on the tour were great and our guide, Tori, was very personable. I would highly recommend the wine as well as they had wine for all our varying tastes! The dessert Riesling was the biggest hit for our group as well.",
   "We are staying in the lower suite and did the tour yesterday with Victoria.  Wow...we love it here. Spectacular views, amazing service, and beautiful wine! Highly recommend a visit here."
  ]
 },
 {
  "name": "Bethel Heights Vineyard",
  "address": "6060 Bethel Heights Rd NW, Salem, OR 97304, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c254c992-9333-11ea-a3de-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tasting",
   "delicious",
   "learn",
   "tasting",
   "winery",
   "winery",
   "tasting",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=947557987659795031",
  "source": "GoogleMaps",
  "reviews": [
   "Jan 2020 My friends and visited Bethel Heights for group wine tasting! Awesome wine great view and cozy spot for tasting! Before our arrival Kate build us a roaring fire! Kate is very knowledgeable about their wines. Thank you so much Kate, for a GREAT visit! Definitely recommend!",
   "Had an awesome tasting experience the other day with Kate. The wines were delicious and views of the property are exceptional. It’s cool to learn about the ways they’re managing the vineyards on site. I will definitely be recommending this winery",
   "Stunningly beautiful view of wine country from this high up winery. Classy tasting room, fabulously decorated, and always warm and welcoming. Fantastic wines. You will be so happy you made the trip to this winery.",
   "Supporters of cap & trade,  never again will we ever buy any of your products,  let me know how that works out for ya mini Casteel.. Chow",
   "Great tasting experience 100% Pinot Noir grapes and the entire selection is vinified from their local estate. Most of the vines are 40+ years old and dry-farmed."
  ]
 },
 {
  "name": "Oregon Electric Railway Museum",
  "address": "Salem, OR 97303, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c29d1d46-9333-11ea-a19b-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=13244597270326404967",
  "source": "GoogleMaps",
  "reviews": [
   "Really fun!",
   "They are having the Great Steam Up and Quilt Show this weekend Aug 4th and 5th.\n\nPowerland Heritage Park has over 10 museums with tons of oldtime moble vehicles of all kinds. \nThis includes various types of tractors. It is all volunteer run.",
   "Family fun! Several museums!",
   "Yearly trip to the steam up...Amazing weekend!",
   "Love this place."
  ]
 },
 {
  "name": "Waldo Park",
  "address": "605 Summer St NE, Salem, OR 97310, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c2f883f6-9333-11ea-a6fc-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "historic",
   "history"
  ],
  "link": "https://maps.google.com/?cid=11250766902460195574",
  "source": "GoogleMaps",
  "reviews": [
   "It's, a beautiful, stroll by the, Creek Around, The State Lands Building. Very, clean.",
   "If you fancy yourself a great place to walk around for those pokemon. Here's the park for you. Perfect location for gyms and stops. Tons of friendly people who are willing to play with you. Enjoy and good luck",
   "Historic Bethabara Park is a wonderful piece of history near Winston-Salem. The buildings are well maintained and have excellent tours & guides. The Visitor's Center is modern, well-maintained, and used for educational meetings. They have a nice little gift shop too! There are special community events scheduled almost every month of the year, geared for families and kids. Their heirloom herb garden is one of the best in the Southeast. They maintain a website to keep the community up-to-date. My personal favorites are the Summer evening concerts and the Highland Scottish Games!",
   "I love how small this park is because it has been created to honor a humbling tree planted over one hundred years ago. I respect that Salem, Oregon had space that was set aside to protect and preserve the tree. The 'Where's Waldo\" jokes may begin!",
   "It's a nice little patch of land with a beautiful Sequoia that provides excellent shade for a quick rest on the bench nearby. Not only that but it's also a Pokéstop! "
  ]
 },
 {
  "name": "St. Innocent Winery",
  "address": "10052 Enchanted Way SE, Jefferson, OR 97352, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c348a048-9333-11ea-a11d-14b31f159f22.png",
  "tags": [
   "tasting",
   "delicious",
   "knowledgeable",
   "tasting",
   "food",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=5252490650956883441",
  "source": "GoogleMaps",
  "reviews": [
   "Went to this charming spot for the first time on Friday. Had a lovely experience wine-tasting! Alec was very attentive and informative about the various varietals. The wine was very enjoyable and reasonably priced, they even offer half-bottles. So glad they moved to south Salem as the area needs more wineries. Looking forward to returning!",
   "The new tasting room is open! Beautiful patio and room.",
   "Incredible Pinot Noirs, beautiful tasting room and grounds! Lovely staff - Michelle was so nice and knowledgeable. Loved that they offered some food: delicious homemade Cassoulet (French bean soup) and bread. It was just perfect!",
   "Had a wonderful glass of wine here and enjoyed the calm atmosphere. Bill was so friendly and very helpful as well. Highly recommended!",
   "Did a wine tasting and lunch with 12 people or so and could not have had a better experience.  These people really care about their wines and their service.  The prices are reasonable.  The experience was personable and genuine.  Go here and enjoy!!"
  ]
 },
 {
  "name": "Cristom Vineyards",
  "address": "6905 Spring Valley Rd NW, Salem, OR 97304, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c38f4624-9333-11ea-b6d3-14b31f159f22.png",
  "tags": [
   "winery",
   "knowledgeable",
   "tasting",
   "knowledgeable",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=16103805495199053380",
  "source": "GoogleMaps",
  "reviews": [
   "This was our very first winery during our trip to Oregon, and it was an amazing introduction to Oregon wines. Holly was a fantastic person to take us through our wine tasting, and she was so personable and friendly. She is very knowledgeable about wine, and we learned so much about Oregon wines and Cristom. We enjoyed the wines at Cristom so much that we left with several bottles to enjoy back home. This winery was still our favorite even after visiting several others in the area.",
   "Our first visit to Oregon vinyards and this was our absolute favorite for the selections.  Not a spectacular view unless you enjoy a view of the beautiful vinyards.  But are you looking for a special view or fabelous wine?  We can't just visit the vinyard from over here in Florida but we have ordered 5 cases of Rose and Pinot Gris and have thoroughly enjoyed them..  very knowledgable staff and everyone is super friendly.  If you're out this way definatly one not to miss.",
   "I can highly recommend a visit to Cristom, known for its whole cluster \nfermentation, low staff turnover rate and outstanding wine/\nwinemaker, Steve. Many people have been there for over 25 years!\nJulie and Darcy love working there, and it shows. They speak very \nhighly of Steve, and his old world style. Both ladies were very knowledgable, yet down to Earth and engaging. Julie was a lot of\nfun and made the entire experience a blast. The views are lovely and\nyou will have a wonderful experience too.Thanks, ladies! Elizabeth",
   "Best wine in Willamette valley by far",
   "I LOVE Cristom. I love their wine. Dustin was probably a HUGE factor in us joining the wine club. He is SO knowledgeable, funny, friendly and he has the same palate for wine that I do. I have NEVER EVER had bad wine here. Cristom is more upscale than a lot of other vineyards in their pricing. They don't offer you a tasting OR a glass of wine as a member, and I understand why they don't want to cheapen the tasting room experience, but it will pinch the purse a bit more to make it a pop in for a glass if you're a member. I haven't yet gone to any of the member events, but I am really looking forward to it. This wine will not disappoint you, be prepared to pay for it though because it is GOOD wine."
  ]
 },
 {
  "name": "Pacific Northwest Truck Museum",
  "address": "3995 Brooklake Rd NE, Salem, OR 97303, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c3da591e-9333-11ea-8e12-14b31f159f22.png",
  "tags": [
   "history",
   "walk",
   "history",
   "tour",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=11668527255825107308",
  "source": "GoogleMaps",
  "reviews": [
   "If you love old trucks, the history of trucks or anything else about trucks you need to go!",
   "Beautifully restored vehicles, steam powered behemoths, models, antiques...this place has it all.",
   "Visited during the Brooks truck show. This place is very nice, and has some beautiful historical trucks inside the museum. Very clean, and lots of nice people. I would visit again.",
   "MASSIVE collection of trucks, some over 100 years old. Incredible history you can walk up to and see.",
   "Family of four with kids age 8 and 10 and we had a fantastic time! The kids surprised me by being really into it and wanting selfies with almost all the vehicles. \n\nThe volunteers were not only engaging they were extremely outgoing making it a great customer service experience. We got a guided tour by an expert on the collection and we learned so much! \n\nThe park of museums/collections has dozens of attractions and we got in for 10 bucks, ate packed lunches and spent a little more on optional activities.\n\nWe can't wait to go again!"
  ]
 },
 {
  "name": "Hanson Vineyards",
  "address": "34948 S Barlow Rd, Woodburn, OR 97071, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c42285d2-9333-11ea-b774-14b31f159f22.png",
  "tags": [
   "family",
   "affordable",
   "winery",
   "family",
   "delicious",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=16593081834818141369",
  "source": "GoogleMaps",
  "reviews": [
   "Family and kid friendly, big yard with games.  Affordable wines and generous for $10 flight sample.",
   "Loved the rural feel and intimate atmosphere. Great small family winery. Don't pass by!",
   "Found this gem via Google and decided to check it out. The location is lovely, lots of outdoor seating with picturesque views. All 6 wines we tasted were delicious, I came home with 3 bottles. Highly recommend for sure!",
   "We love this place. It's amazing. Great visit with the wine grower and large variety of wines that are all excellent.",
   "Mr Hanson is a wonderful, knowledgeable host who makes clean, honest wines."
  ]
 },
 {
  "name": "Salem's Riverfront Carousel",
  "address": "101 Front St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c469a152-9333-11ea-bd59-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=17101151948747463013",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome place,  great place to take kids.  They accommodate people and children with special needs or disabilities, even offer free ride tickets. Super friendly staff who are honest good hearted people",
   "What’s not to love about this carousel? Great people working there. We tend to get popcorn and cotton candy. But of course the main attraction is the carousel, with its painstakingly crafted horses, the occasional giraffe, cow, frog, etc., seem to the kids to have personalities. We stop in regularly when we are in the area and come to visit for events, like Santa Claus arriving by train.\nThe gift shop has brilliant buyers and is always a good place to get just the right present.\nThe playground outside is a nice treat too, and it’s right on the Willamette river.",
   "The people running the carousel were extremely friendly and put my skittish son at ease. It was open past any other kid friendly to-do in the area and was inexpensive as well. Because it was indoors we were able to escape the cold weather, and the carousel was beautiful and well maintained.",
   "There are beautiful hand-carved horses and other animals to ride on the carousel. The facility is clean and safe for children and people with developmental disabilities. They have a special ramp for people in wheelchairs to get on the carousel. And, there's a special place for them to ride. It's very thoughtful and inclusive for all!",
   "Salem's best attraction.  Fun and inexpensive.  Go on a nice day and enjoy Riverfront park as well."
  ]
 },
 {
  "name": "Gaiety Hollow",
  "address": "545 Mission St SE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c4b35498-9333-11ea-a1b3-14b31f159f22.png",
  "tags": [
   "historic",
   "art",
   "history"
  ],
  "link": "https://maps.google.com/?cid=5961604059588442847",
  "source": "GoogleMaps",
  "reviews": [
   "Attended a  lovely Botanical Painting workshop with Jeanne Debon, here, during Spring 2019. Super lovely hosting of our group, beautiful spaces, and pleasant, happy times!! Thank you!  Here is my Allium flower I was so proud to paint!!!",
   "Loved learning about all the historic renovation going on, and move about the two amazing early landscape architects and the important role they played in the northwest! Can't wait to watch how this garden changes over time.",
   "Beautiful grounds! Would highly recommend.",
   "This is the loveliest place you've never heard of. Most definitely worth the drive from Portland. This is the personal gardens and home of landscape architects Lord & Schryver. The gardens are slowly and carefully being curated and restored to their original glory. Although the garden is a work in progress, it's beautiful to see anytime. For a nominal fee you can see the ground floor of their lovely but modest home. There are framed garden plans drawn by the designers themselves. They are really works of art and very interesting to see. There is a short talk that was very informative and well done. You get a piece of Oregon history that many haven't heard! These two trailblazing and entrepreneurial woman started their firm in 1929 after the market crashed! Their story will make you want to find out more!",
   "This is a display garden that was designed by Lord & Schryver. They were the first women-owned landscape design business in this area back in the 1930s. they designed the gardens around Deepwood, Bush Park, North Salem High School, and this home among many many others. Volunteers lovingly maintain this garden and it is worth that or if you are into gardens."
  ]
 },
 {
  "name": "Evergreen Aviation & Space Museum",
  "address": "500 NE Captain Michael King Smith Way, McMinnville, OR 97128, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c529967e-9333-11ea-bd90-14b31f159f22.png",
  "tags": [
   "family",
   "history",
   "tour",
   "walk",
   "cheap",
   "family",
   "history",
   "free"
  ],
  "link": "https://maps.google.com/?cid=14958905982325145340",
  "source": "GoogleMaps",
  "reviews": [
   "Place is awesome. So much to do and in with the family. I have a 4 year old that loves space and rockets and he always has a blast. There are some of the interactive exhibits weren't functional but there are so many that you could find one that did. It's not overpriced and you can easily spend hours here including a choice of movie with admission. The Spruce Goose or Hercules is awesome and the people running that exhibit are full of fun facts.",
   "Home of the spruce goose. Military and civilian aircraft and aerospace museum. The displays were exceptionally well done and even the buildings are architectural wonders. I was very excited about my visit and we'll go there someday when I am back out in Oregon. I would highly recommend the evergreen aviation & space museum to anybody having an interest in aviation space and history",
   "We had a great visit! The director was engaged and engaging during our tour of the Spruce Goose. Plenty of things you are allowed to touch. Can't wait to go back to see the space side.",
   "Not a cheap play day for families, but the Annual Passes are well worth it for multiple visits &/or visitors. One visit may not suffice, because there is a LOT to see. Aviation buffs will love it. The building housing the Howard Hughs Flying Boat has many other aircraft, as well as displays of engines, propellers, flight history developments and personal stories of key events in aviation. There is a super gift shop,  children's play area & suitable grill for a burger, chili & beer. Lots of monitors with genuine footage. The volunteer staff is solicitous and the restrooms are large and clean. There is a second building across the parking lot dedicated to rocketry which is every bit as thorough in its displays, and provides a neat walk through of the major events of mankind's expanding exploration into space. Not just the equipment, but the stories of the individuals who developed and rode said are chronicled. There is a theater between the two which has ongoing showings of different aviation related documentaries. The grounds have perhaps another 20 aircraft, and are well groomed. This is a full day museum visit (if not 2), and one which merits sharing with out of town guests on a family pass.",
   "Seeing the Spruce Goose in person was on my bucket list, it was mesmerizing. There aren’t words to describe how absolutely amazing it was to see in person I was in complete AHHH of it. It was ginormous, even bigger than you’re imagining reading this. My husband is military so we got in for free so that was wonderful too. I also loved looking around at all of the other airplanes and outfits they wore on the planes it really takes you back in time and you feel like you were there. This was such an amazing experience"
  ]
 },
 {
  "name": "Santana Village Park",
  "address": "850 Shawnee Dr SE, Salem, OR 97317, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c5748228-9333-11ea-89e8-14b31f159f22.png",
  "tags": [
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7401251199973015304",
  "source": "GoogleMaps",
  "reviews": [
   "This park seems to be well maintained. It is kept up by volunteers on the neighborhood. Depending on the time of day this park can be a place of solitude. During summer break and in the late afternoon and evening there are usually others there. When I went today about 1 o clock, there was no one but myself there. \nThis park offers a walking path, baseball diamond, picnic tables, a basketball and tennis court as well as playground equipment and swings. There is also porta-potty stationed near the basketball court.",
   "Play area is way too small. Kinda takes away from the word 'park'.  & the head \"neighborhood watch\" guy is way too weird. He approaches kids and tells them not to play for too much longer. & bugs the adults and threatens to call the police if you're there too long for his liking. Happened to me 4 times.",
   "Is not what it used to be. Trash everywhere. Soppy mess. Unkempt.",
   "Great neightborhood park. Owned and run by neighbors. Enhances the value of the community.",
   "Nice little park nothing too special"
  ]
 },
 {
  "name": "Mt Angel Oktoberfest",
  "address": "Box 1054, 5 N Garfield St, Mt Angel, OR 97362, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c5cd2af6-9333-11ea-91ea-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "food",
   "kids",
   "food",
   "family",
   "organized",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1505222558342732273",
  "source": "GoogleMaps",
  "reviews": [
   "I've been going to this festival since I was a baby. It's had over 125 years to perfect itself into the best Oktoberfest on the West Coast. It's all non profit, so you are getting good food and supporting schools and churches and other charities. Finally, while the fest halls require wristbands for entry (small cover charge) the Kindergarten for the children is free. Free rides, free shows, free face painting, free pony rides. The whole event is spectacularly put on from start to finish. Don't forget to stick around for the street dance at the bandstand every evening! There's a married couple that's been teaching and leading the street dance for over 20 years! Absolutely worth a visit with kids or not!",
   "The Oktoberfest is an event that you should experience at least once in your life, if not every year. The food is great and there are so many choices that everyone will be happy.  There is a huge Kindergarten for the kids to play, and lots of craft booths, heritage point of interest, and bands for the adults. Oh, did I mention the beer?",
   "Fun for the whole family. Multiple beer gardens to choose from to get out of the sun and rest while listening to classic songs and some surprising \"polka covers\" of modern pop. I was amazed at how many blocks filled with vendors there were.",
   "This festival is amazing.  Lots of culture and great food.  Layout is well done.  It is organized and efficient.  Despite large crowds there was never a long wait for anything.  All of the volunteers were pleasant and well trained.  I enjoyed myself and can't wait for 2020",
   "My once a year birthday stop.  Love the food carts that make it feel like a buffet of marvelous choices.  Cinnamon rolls for breakfast, cabbage roll for lunch, dough boys or elephant ears for desert.  Pure delight.  Gotta love the entertainment, the atmosphere, and the food, but most of all, IT'S THE GRAPEFRUIT BEER!!!  I can only hope that it will be on tap in heaven!!!"
  ]
 },
 {
  "name": "Baskett Slough National Wildlife Refuge",
  "address": "10995 Oregon 22, Dallas, OR 97338, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c61cd08a-9333-11ea-ae79-14b31f159f22.png",
  "tags": [
   "kids",
   "nature",
   "kids",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=9959316058891725402",
  "source": "GoogleMaps",
  "reviews": [
   "Not the best park for kids, no play structures, And most of the time it's, well, its a Slough. 5 stars for its beauty. You can come to the main rest area off the highway and take in this pristine and vast open space, or you can travel farther West and find a back road that leads to the middle of the slough. A wonderful place to nature watch.",
   "There isn't anything that is a real WOW about it. But the area is pretty and there are always lots of birds to see. Mainly waterfowl. \n\nIt used to be a great spot to stop for a little break when driving to the coast. There's never a ton of people and a couple picnic tables, but they tore out the pit toilets years ago and never replaced them. Not even a porta potty.",
   "Breathtakingly beautiful every step of the way. Great for short open ares hikes or with small kids.",
   "Wait for migration time, exquisite sunsets, many species. Some great places to set up your camera without disturbing anyone. Lots of water, some swampy. Beavers, foxes,  herons, birds of prey, mergansers, shockers and more. Traffic is respectful to this nature sanctuary, a pit stop on the migratory path.",
   "Gorgeous, not crowded. Thousands of birds. Bring your long lenses."
  ]
 },
 {
  "name": "Frank Lloyd Wright Gordon House",
  "address": "869 W Main St, Silverton, OR 97381, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c66c27b0-9333-11ea-98b8-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "tour",
   "economical",
   "knowledgeable",
   "tour",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=8176210741578648812",
  "source": "GoogleMaps",
  "reviews": [
   "Loved the history of this place. Fabulous architecture. To be able to see a home designed by Frank Lloyd Wright was a dream come true for me. I am so thankful this great home was saved. Definitely worth the fee for this great tour.",
   "I did not get to take the tour. The house looks amazing from the outside. Peeking into the windows, the house looks amazing inside. It's amazing to think that these house designs we're considered economical. Today they seem so forward & modern.",
   "The tour is a must see. What a wonderful example of Wright's Usonian houses. The docent was warm and knowledgeable. We loved it.",
   "Twenty dollars per person is too high to go in, but the grounds were beautiful.",
   "Must see for FLW fans and architecture buffs. Make reservations online for one of the 1 hour tours as there is no guarantee they can fit you in if you just walk up. Only example of FLW’s work in Oregon."
  ]
 },
 {
  "name": "Dallas City Park",
  "address": "266 SW Academy St, Dallas, OR 97338, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c6b93666-9333-11ea-9170-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walk",
   "parks",
   "history",
   "walking",
   "art"
  ],
  "link": "https://maps.google.com/?cid=11557915917909136153",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice disk golf course. 18 holes and nice park, lots of trees too. Easy to find and worth the visit.",
   "Such a wonderful park and definitely the place to be on the weekends with so much going on. I used to go crawdad fishing here as a kid and it's nice to see that's still popular. \n\nThere's disc golf with some small biking trails going through the course which is a lot of fun. There's covered areas with large tables, plenty of restrooms and parking, and it's connected to the arboretum -- which you should walk through because it's wonderful too!\n\nPlus the new waterfront path is beautiful! I can't wait until that path connects to the other part of town.",
   "Nice spacious park with a great frisbee golf course and nice combination of open spaces and wooded or shrubbery areas. The garden is pretty neat and the creek flowing through is beautiful and not a bad place for kids to play or cool off on hot days. This park has a lot to offer.",
   "I absolutely love the trails of this park! My two year old never get bored. Theres a couple play grounds and a lot of places to explore.",
   "The Dallas City Park is Stunning! One of it's kind! A must see when visiting Dallas Oregon. \nThere are 4 entrances for vehicles. Basketball hoops at the parking lot at Walnut and Levens streets w/ Horseshoe pits on opposite side.\nEntry there leads into the park where there are 2 more parking areas.\n There's a walking bridge conjoining the parks 2 sides.\n The Rickreal Creek winds it's beautiful way through the cottonwood trees with walking Trails surrounding and along side the creek.\n You'll find covered picnic areas w/BBQ grills, electrical outlets and Kitchen sinks. 2 Gazebos, 1 has a Fire Place. Picnic tables and bbqs are scattered throughout. \nThere's an arboretum.\nAlso there's displays inside of local insects, moths and butterflies. \nAs you walk the trails, there are informative kiosks with history of our area and its native people and plants.\n\nPopular for it's year round Frisbee Golf course & for the\n Annual events held the final weekend in July - \"Art in the Park\", \"Breakfast in the Park\" and a Car Show, The Dallas City Park brings people here to compete, compare, & share. \nWhen all that excitement is passed we still have the playgrounds, the beauty & the serenity that our city park has always offered. I hope you'll at least check it out if u find yourself in Dallas Oregon, enjoy!  : )  "
  ]
 },
 {
  "name": "Redhawk Vineyard & Winery",
  "address": "2995 Michigan City Ln NW, Salem, OR 97304, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c70fe20a-9333-11ea-822b-14b31f159f22.png",
  "tags": [
   "tasting",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=6971539201427909413",
  "source": "GoogleMaps",
  "reviews": [
   "I've always enjoyed my visits for wine tasting and events at Redhawk. I highly recommend!",
   "Beautiful view and great wine!",
   "The estate wines are very good.",
   "All of the wines were delicious and the staff was friendly and inviting.",
   "Incredible views, great wines."
  ]
 },
 {
  "name": "Ankeny Vineyards & Winery",
  "address": "2565 Riverside Dr S, Salem, OR 97306, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c76bbe10-9333-11ea-a2a7-14b31f159f22.png",
  "tags": [
   "tasting",
   "delicious",
   "tasting",
   "delicious",
   "tasting",
   "food",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=8737534238848098384",
  "source": "GoogleMaps",
  "reviews": [
   "The wine flight showcased a wide range of wines. I loved two of the six, and the other four were pretty good. The hummus plate was really great, as was the pizza! The tasting room is small, and can get loud if there are lots of people. It was chilly when we were there yesterday. They have a wood stove but didn't seem to be using it. They have outdoor seating with heaters as well. The road it overlooks is pretty quiet, so it seems like it'd be a nice space to sit, but we were too chilled to do that.",
   "We had a lovely visit. We did a wine tasting and had two pizzas. Everything was absolutely delicious 😋! We left with a delicious bottle of chocolate port, and plan on having a wonderful dessert in the near future 🍧🍷. After our meal we walked along the beautiful grounds. It was definitely worth the (scenic) drive.",
   "Beautiful place, great wine tasting and food was delicious. We truly enjoyed our afternoon. \nThe brick oven Pizza was delicious and you must try the dessert chocolate 🍷 wine. Omg I never tasted anything some Yummy. \nServices is a little slow, however she was super friendly and we weren’t in any rush.",
   "Very quaint tasting room but extremely friendly staff members. Love the views and look forward to visit in the summer to enjoy the patio.",
   "A beautiful farm with fantastic wood fire pizza."
  ]
 },
 {
  "name": "Delbert Hunter Arboretum and Botanical Garden",
  "address": "Dallas, OR 97338, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c7af7df8-9333-11ea-b815-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=15938052529792216522",
  "source": "GoogleMaps",
  "reviews": [
   "All the trails loop back around, there are multiple benches to hang out at, there are 2 benches overlooking the river, a gazebo, a rock garden, a little mini waterfall, and they seem to have things being worked on all the time by volunteers. It's kid friendly, dog friendly, and my daughter and I love taking snacks like a picnic. People clean up their trash and doggy messes. It's safe and next to the Dallas City Park. Also, people paint rocks and hide them. Join in for the fun!",
   "It's such a beautiful place. You can swim in the river which is just relaxing.",
   "Pretty! It reminds me of some of that the places I go near Packwood, Wa.",
   "Nice little walking trails, and rock hunting!",
   "One of the reasons the Dallas City Park is stunning and so beautiful is this Gem."
  ]
 },
 {
  "name": "Eola Hills Wine Cellars",
  "address": "501 S Pacific Hwy W, Rickreall, OR 97371, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c7fed690-9333-11ea-b29e-14b31f159f22.png",
  "tags": [
   "tasting",
   "tasting",
   "winery",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=1614857928575427870",
  "source": "GoogleMaps",
  "reviews": [
   "Love this place, but really miss the Sunday and Valentines Day buffet they used to offer. It was the best!",
   "We parked in our RV at this location. We enjoyed a tasting and Sunday brunch. The Pinot noir was my favorite, my partner the merlot.\nThe staff was helpful. The koi pond was so peaceful. I'm glad we stayed here.",
   "Legacy Estate is such a beautiful place. We have enjoyed the concert series & weddings held there. We have been to both tasting rooms & had great experiences. We aren’t wine club members but still are treated with respect.",
   "Spent the night in our RV.  The TEMPRANILLO was wonderful.  Nice body and richness.  The winery has done a great job setting up little places for guests to sit and enjoy their wines.  The sunset was amazing if you can be there when they are open that late.  The only thing annoying was the deer bombs but of course, in this part of the world without them there'd be no wine.  We'd HIGHLY recommend Eola!",
   "Friendly staff, large tasting room and complimentary tastings! Really enjoyed the pinot noir and the raspberry dessert wine. "
  ]
 },
 {
  "name": "Enchanted Forest",
  "address": "8462 Enchanted Way SE, Turner, OR 97392, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c84bbe86-9333-11ea-b2f8-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food",
   "unique",
   "family",
   "kids",
   "family",
   "food",
   "kids",
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=11310391501878656992",
  "source": "GoogleMaps",
  "reviews": [
   "This place is amazing my kids absolutely love it and it's great for the whole family definitely bring something for lunch because food there is a little outrageous. Admission isn't too bad. It's a lot of fun and makes great childhood memories",
   "The best thing in Salem, Oregon is not even in town... it's just outside of city limits on I-5, no matter who you are you'll find something to smile about at this family owned & operated unique theme park. A hooded sweatshirt from this place is worn like a badge of honor among locals, to show their culture to those in the know of this hidden gem just off the highway. RIP Thrillville, but the forest continues to enchant!",
   "So much fun here! The whole family had a great time exploring and riding the rides. We enjoyed the attractions and entertainment. The whole experience was just a little bit magical. Kids and adults alike had fun. In all honesty bringing a child does make it even more fun. Food was good, price was decent, parking was easy.",
   "Fun, a little creepy in some areas (see online stories of the haunted house that is reported to be actually haunted), and some of the attractions are even a bit goofy, but still worth the trip and price of admission for kids young and old.  Plenty of fun rides, lots of typical food offerings, quaint paths with beautiful old growth shade trees (the park is nestled into a mountainside that rests beneath a lush, full forest canopy), benches and picnic tables. My favorites include the Western town and whimsical characters displayed throughout the different themes within the park. The Enchanted Forest is an Oregon landmark and icon, if not adorable oddity.",
   "This place is fantastic. If you are visiting that state this is a must go. It's fun for everyone. Kids or not. The employees are kind and helpful. I've been coming here annually since I was a kid. Kids love the slides and the carousel."
  ]
 },
 {
  "name": "Bells Up Winery",
  "address": "27895 NE Bell Rd, Newberg, OR 97132, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c89f5cc6-9333-11ea-bb68-14b31f159f22.png",
  "tags": [
   "winery",
   "knowledgeable",
   "winery",
   "history",
   "learn",
   "knowledgeable",
   "tour",
   "tasting",
   "tasting",
   "tour",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=13879114228179250729",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best wine tastings we went to in Willamette Valley. Dave was friendly and very knowledgeable. He had some of the best wines we tasted during our week long visit to Oregon. If you like fine wine and a boutique winery this is for you. By appointment only.",
   "First I want to say this a new winery! I was very impressed with Bells Up Winery. This winery was easy to find. You won't believe this! When me and my clients made the turn up to the winery, the owner David Specter was waiting for us outside smiling and he was very happy to see us! I love the positive energy that was given to us! David told us about the history of the property and the winery! The wine was amazing! I believe this winery can compete with any WINERIES in this industry! I HIGHLY RECOMMEND THIS WINERY!",
   "Wonderful stop for my wife and I along our Pinot tour of Willamette Valley! Dave is a great guy who is passionate about his vineyard and Super knowledgeable! Was ecstatic to be able to have a tasting with the actually winemaker and was able to learn so much about the process and wines!",
   "Dave was so awesome! Not every tasting does the winemaker himself pour for you and share his knowledge and passion for growing grapes and making wine. Thanks so much!",
   "What an awesome experience to have David the winemaker give us the tasting and tour. I really appreciate his passion for wine.  🍷🍷😊"
  ]
 },
 {
  "name": "Brooks Wine",
  "address": "21101 SE Cherry Blossom Ln, Amity, OR 97101, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c8e98658-9333-11ea-bbd2-14b31f159f22.png",
  "tags": [
   "winery",
   "food",
   "winery",
   "food",
   "winery",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=1680272101492796060",
  "source": "GoogleMaps",
  "reviews": [
   "Mike, our wine steward was personable and a great conversationalist! I love his facts about the wine. Thank you to the young couple who gave us their seats so that my 80 year old mother in law could be more comfortable, wonderful cheese plate and great wines...$600 later...",
   "Love Brooks Winery! The view is one in a million the wine and food is fantastic and the staff are so friendly and helpful! A must to visit when driving around the wine country in Yamhill county Oregon.",
   "The worst greeting experience ever.  The greeter said “maybe we can sit you maybe you can get food downstairs. I’m not sure.”  We sat ourselves at the bar and shared that we had never been here and were quite confused by the greeter and this server was no better.  Clearly volume is their goal not experience or quality.  Sent us downstairs and provided no details. We wanders then found downstairs after being pointed the wrong way by the greeter.  Customer service is lost by this organization. The food is amazing and is possibly the only saving grace.  I can’t say enough bad things about the people that work here. Complete disappointment.  \n\nPlease don’t waste your time. There’s too many wonderful wineries in the area to experience over the lack of professionalism that the Brooks winery staff has.",
   "Lovely winery and tasting room. We got a red and white flight and everything we tried was good to buy-able. 😉 Their Monks Gates Riesling was excellent. We also got the Plateau de Paco; it was also very good.  They also have lunch selections. Lovely views!",
   "What a wonderful Winery/Vineyard.  Great heated outdoor patio and even better Wine.  Friendly and attentive staff.  Would recommend to any wine aficionado.  I will be returning soon."
  ]
 },
 {
  "name": "Silver Falls State Park",
  "address": "Silverton, OR 97381, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c9322768-9333-11ea-be06-14b31f159f22.png",
  "tags": [
   "tour",
   "nature",
   "hike",
   "walk",
   "free",
   "nature",
   "hike",
   "walk",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=5081895815672268015",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful place. Highly recommend to anyone that enjoys nature and hiking. The location has many different hiking trails from short to long, so it's a great hike for any experience level. There should be a couple of different loops you can choose from, or get to see all of them (there should be 10).\n\nPark also has picnic area, cafe, tour guides for additional activities.",
   "Such an insanely beautiful state park. Possibly my favorite state park in Oregon, Silver Falls State Park is a dream for Waterfall lovers. Over 10 individual waterfalls with two you can actually walk behind. It truly is a magical place. An oregonian must visit destination. Can not stress the beauty of this park enough.",
   "Stayed a few nights in cabin 2. The cabins sleep 5 easily with a table and 4 chairs. Only 2 outlets in the main room so plan accordingly. The bed padding was very comfortable. The curtains keep out a lot of light. The nearby bathrooms and showers are restricted to cabin campers use only. Plus the shower is free! Was able to bike around quite a bit. Hiking options galore. Free lectures twice a day targeted to the young campers. $5 wood bundles. $2 ice bags. $1 firestarter disks. \nThere whole place is alive with nature animals and plants. So green! Will definitely be returning asap.",
   "This was the off season, so it wasn't crowded. Beautiful waterfalls! There's a long hike we hope to do some other time, that leads to a number of other waterfalls.",
   "Silver Falls State Park is a must see for anyone visiting the greater Salem Oregon area.  The hiking and picturesque waterfall viewing locations are spectacular!  If you are up to it physically make the full hike to see all of the falls.  As an option, there are excellent parking and picnic grounds with very short walk to the easy viewing areas for the first fall."
  ]
 },
 {
  "name": "Champoeg State Park",
  "address": "8239 Champoeg Rd NE, St Paul, OR 97137, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c98c2e86-9333-11ea-8fd0-14b31f159f22.png",
  "tags": [
   "walking",
   "family",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=14309584445586515280",
  "source": "GoogleMaps",
  "reviews": [
   "Had a great time! I brought my small dog with me and it was lovely.  He had a blast and so did I.  The yurt was roomy, and had plenty of space for several people.  It was a wee bit cold, but for February,  I expected worse.",
   "Great place for walking on paved trails next to the Willamette River.  Covered picnic areas, sink, bathrooms with running water, showers, camp sites, RV dump site, great place for a bicycle ride. \n\nThe visitor center is awesome, education exhibits, it's a small museum.\n\n$5 day permit per car.",
   "We have had so many awesome family reunions here! It's a very quiet park, surrounded by manicured greenery and well kept picnic tables. Very easy to reserve covered spaces for special events.",
   "Beautiful park with lots of walking trails. Pet friendly. Campground with RV spaces. Oregon State Park day use fees apply. Best for folks who want open space with few other amenities.",
   "Love this place it was a great walk and beautiful forest. I can't wait to see it when the trees have leaves again. I will definetly come back to walk through the trees again."
  ]
 },
 {
  "name": "Champoeg State Heritage Area",
  "address": "Champoeg State Heritage Area, St Paul, OR 97137, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c9d5a68a-9333-11ea-b128-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "historic",
   "history",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=15791894822344653673",
  "source": "GoogleMaps",
  "reviews": [
   "I haven't been here for years. It's still pretty place.",
   "I love this park! It’s super pretty with all the oak trees. Great disc golf course, great camping sites(can book online) there is lots open areas. If your looking for good reliable park, this is the one.",
   "This is a great bike trail to teach kids how to ride bikes.",
   "The Champoeg State Heritage Area is a must visit for those visiting Oregon and native Oregonians. The picturesque views of the Willamette Valley are worth it alone. Champoeg includes a visitor center with an impressive museum detailing the history of not only the area, but also the Oregon Country's first steps toward government. The gift shop included many books on local history. Both adults and kids will enjoy these, as well as the heritage garden and a historic barn. Hiking / biking trails abound, including one down to a historic store in Butteville with amazing ice cream sandwiches. The camping is also excellent. Showers, and restroom facilities are at or above average. The area is ideally located halfway between Portland and Salem with easy access to Interstate 5.",
   "Wonderful place! Very historic in relation to Oregon becoming a state. Be sure to check out the museum at the Visitors Center."
  ]
 },
 {
  "name": "Ankeny National Wildlife Refuge",
  "address": "2301 Wintel Rd S, Jefferson, OR 97352, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ca259b80-9333-11ea-85c3-14b31f159f22.png",
  "tags": [
   "structure",
   "nature",
   "walk",
   "kids",
   "nature",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=248587716559889777",
  "source": "GoogleMaps",
  "reviews": [
   "I had difficulty finding the trails but did find the impressive boardwalk along the stream which ends at the observation structure. Appreciated the bird lists and maps in both English and Spanish available at the sin posting at the parking lot. The signage along the wooded boardwalk was well done. I’m looking forward to the expected opening of the newly built Ankeny Hill Nature Center with new trails, observation platforms, and parking lots. There are three partners who will be managing the Center. Those partners are the U. S. Fish and Wildlife Service, Salem Audubon Society and Friends of the Willamette Valley National Refuge Complex.  US Highway Dept has reportedly had a delay in the completion of the work for safety reasons and I understand the new date will be next summer.",
   "The one it led us to was literally a 0.2 mile walk. Board walk is well kept up. Idk if we missed a section or what. We went up the road to another \"section\" of the park but it wasn't pet friendly and we had our pup with us.",
   "Absolutely beautiful place to take a stroll and observe the wildlife. Lots of birds and other natural wonders to behold. Thoroughly enjoy my trips out here.",
   "So much to explore that you dont want to leave. I always find a good spot and campout for a few hours with my uke and guitar just strumming along. The best way to reset and take some time for quiet.",
   "Totally enchanting area. I highly suggest this scenic wildlife reserve to all nature lovers.\nThe boardwalk takes you over waters that raise and lower with the seasons to gazebos that look out into different landscapes. Bring your binoculars and spot all kinds of birds. \nIn the fog early morning, it feels like your walking on clouds in the trees. \nGreat for families, the area will have closed signs if waters are too high or anything is unsafe. Bring the kids, bring your leashed dog, and enjoy the natural beauty!"
  ]
 },
 {
  "name": "Wings & Waves Waterpark",
  "address": "460 NE Captain Michael King Smith Way, McMinnville, OR 97128, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ca73e2c8-9333-11ea-b7cf-14b31f159f22.png",
  "tags": [
   "structure",
   "family",
   "active",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10641730898009710281",
  "source": "GoogleMaps",
  "reviews": [
   "More like Wings & NO Waves.  The Kiddo's play structure was down due to waiting on a part to fix it.  The wave pool was down due to maintenance.  I read the reviews about how the paint is peeling - so I was expecting that when traveling to the facility.   I could complain, but really we still had fun.   My kid's (6 and 14) loved the slides (Green is the favorite).  Even though the wave pool wasn't working it was still a cool experience.  The whirl pool feature was fun too.  All in all - we had fun.... most of all my kid's had the most amazing time and that is worth every penny I spent for the experience.  Yes - we will most likely be back, but will definitely call first to ensure everything is working properly. ;)",
   "Wing and Waves is a great location to take the whole family. My wife and I love that we are able to give our seven year old more freedom with going down slides by himself while we stay with our four year old. We love how open the water park is and easy it is to see all the different areas and pools.",
   "Great place for the whole family.  Lots of parking, large areas to bring your own picnic items.  Descent in store snack bar, prices were fair for the descent portions.  We purchased our admission on Groupon for 4.  However, they offer a substantial active duty military discount and 10% for vets all of the time.  Lines went fast, wife and two of my kids had a great time.  I do wish they had a separate hot tub for adults, some people don't manage their children well, and it is packed with small children at times.  However, it's still a great time, well worth checking out.",
   "We came on President’s Day 2020 for the first time. We brought our 6 year old thinking it would be great fun. We were charged full price even though  all of the attractions designed for her age were closed for repairs. Such a disappointment. They should have offered a discount due to the current status of the facility. I recommend making sure the place is in full operation before you spend your money to get in.",
   "Good but when we visited the wave pool wasn't working and the toddler area was also closed down. The hot tub had so many people in it .. it was overflowing to the pool. The price was pretty hight for half the park being closed. not sure we will be back but not sad we went."
  ]
 },
 {
  "name": "Trinity Vineyards",
  "address": "1031 Wahl Ln S, Salem, OR 97306, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cac27838-9333-11ea-a808-14b31f159f22.png",
  "tags": [
   "music",
   "music",
   "food",
   "tasting",
   "music",
   "delicious",
   "drink",
   "family",
   "music"
  ],
  "link": "https://maps.google.com/?cid=6288258904038821954",
  "source": "GoogleMaps",
  "reviews": [
   "Great wines, really nice place for summer music and taking your love for a relaxing time while taking in the spectacular views.",
   "Great wine at reasonable prices.  If you didn't attend one or more of the music concerts, you missed out.  I hope the BBQ folks are back next year!",
   "Visited today and was very sadly unimpressed. My wife and I bought two glasses of wine and were told that the wine we chose from the menu displayed wasn’t available yet. I then asked if I could order a cheese plate to go with the second wine choice only to be told they could not sell me a cheese plate because there was a pizza food truck on the way. It was 4:45. Apparently if your there at 4:45, you have to pay a cover charge for a band that starts at 6. So, 2 glasses of wine and $44 dollars later we did not stay for the band, and I kindly asked since were not staying after we paid could I please take the glasses as a souvenir since we were visiting from Alaska. I was kindly told no, “he” (whoever that is), does not sell the glasses. I have traveled to many wineries. I am not writing this as a bash. As a matter of fact, I rarely write reviews because I believe if good service is presented, that places will soar. I am simply suggesting that I saw Trinity as a bit unorganized and not really in tune to market the wine and want customers to enjoy the experience but rather use it as a glorified backyard bbq with a band. I wish them well and hope this helps their path to better customer service",
   "We love Trinity Vineyards. Conveniently located in the South Salem hills. They are typically offering 2 flights: one white and one red. For certain occasions they'll have a complimentary snack bar laid out in the tasting room. They also host live music once every other month of so. The estate is small, but beautiful. There's a nice balcony outside with a great view. Their 2014 Pinot Noir and 2009 Reserve Pinot Noir were amazing. Steve and Leanna have both treated us very well. I'd highly recommend to anyone in the area!",
   "This is not only a spectacularly beautiful location but a wonderful place to gather with friends, listen to music and drink delicious wine. The owners/hosts will make you feel like family which will make you want to return again and again. Viva la Trinty Vineyards!"
  ]
 },
 {
  "name": "Courthouse Square Park",
  "address": "402 3rd St, Dayton, OR 97114, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cb1616c2-9333-11ea-934f-14b31f159f22.png",
  "tags": [
   "cheap",
   "family",
   "free",
   "music",
   "structure"
  ],
  "link": "https://maps.google.com/?cid=8285700190828549950",
  "source": "GoogleMaps",
  "reviews": [
   "Family friendly and super fun. Dayton Friday nights runs Memorial day - Labor Day. Free music, classic car show, cheap eats, activities and vendors. Every year and just gets better and better. Don't miss the Lantern Parade celebration on the last Friday of Dayton Friday nights which concludes this entire summer weekly.",
   "The park is well-maintained. The Blockhouse is historically significant with informative signs. The structure is in great shape.",
   "A beautiful park for such a small town",
   "Small town America at it's best! A farming community that has a Big Heart for serving young and old. A common sense Mayor at the helm with a strong community support.",
   "I miss the old swings but love the new equipment. People there are so friendly!"
  ]
 },
 {
  "name": "Bryn Mawr Vineyards",
  "address": "5935 Bethel Heights Rd NW, Salem, OR 97304, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cb6b65e6-9333-11ea-ae65-14b31f159f22.png",
  "tags": [
   "tasting",
   "tasting",
   "unique",
   "tasting",
   "knowledgeable",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=3048536869843196086",
  "source": "GoogleMaps",
  "reviews": [
   "Had a wonderful experience in their beautiful, new tasting room last week!  The service, wine, aesthetic, views were all incredible.  They are going to start offering weddings there - it would be an amazing venue for one!  Ordered wine to ship home and it promptly arrived, but one bottle was different from what I ordered.  I emailed them and within an hour they had replied, shipped me the correct bottle the very next day, and let me keep the extra bottle.  Such great customer service!!!",
   "Visited Bryn Mawr for the first time today and I think I'll have a hard time finding other vineyards that can compare. The view from the tasting room is stunning, the wine is perfect, and everyone we encountered there was so friendly. Hope to be back soon!",
   "Beautiful view, friendly staff and fantastic wine",
   "Had the opportunity to spend some time at the new tasting room at Bryn Mawr. What a stunner! The wines were balanced, the staff was knowledgeable and the views could not be beat! We had a wonderful time and looking forward to getting back soon. Highlights included a fireplace (Feb is a bit cool!), charcuterie board, and long list of unique varietals to taste.",
   "Beautiful location and some amazing wine.  David was fantastic and poured a flight of wines equal to the view from the tasting room. Well worth the drive down from Portland. Looking forward to a trip back when there is some green in the vineyard"
  ]
 },
 {
  "name": "Spirit Mountain Casino",
  "address": "27100 SW Salmon River Hwy, Grand Ronde, OR 97347, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cbbd08b0-9333-11ea-9e22-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "eat",
   "food",
   "free",
   "free",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4075782737456862240",
  "source": "GoogleMaps",
  "reviews": [
   "Always fun. Even though I haven't ever had a \"big win\", MY biggest personal win was almost $500 off of only $20! I was happy for that. But they've got a wide range of machines, card & table games. Their buffet is GREAT! We've went for our holiday dinner two years now. I haven't attended any events there yet myself but am definitely open to the idea & they have many good events all the time. Any time my family comes to visit from Alaska, Spirit Mountain is one of our stops.",
   "Honestly, in comparison to Chinook winds, it is amazing. Their new smoke-free side is huge and it genuinely does not smell like cigarettes. That was so impressive because Chinook wind is absolutely horrible. Not Only is it of average size and just about average in every other way, it is absolutely awful for the smell of cigarettes. Their non-smoking section as a joke and the smoke just comes right in. I’m not sure why they even called us non-smoking section. Spirit mountain is not like that. They have better games, they have more space, and they have a phenomenal non-smoking section. Everything from food to the machines, to the rooms, is better at Spirit Mountain.",
   "We were there on the 18 of January to see Smokey Robinson. Great concert, well worth it!!! However the \" Famous Buffet \" was NOT!!!  I have worked many years in service industry where we lived off of tips, if the wait staff and table cleaners from Spirit Mountain live off tips, they will not make it!! They did not smile, were not friendly or welcoming or even helpful really. The food was less than great, bad actually. Prime rib was tough, and pizza was cold, and pot roast was different. It just seems to me that if you work with people and in public you would be nice and at least polite. Other than the food and dining experience my  time there was great. I will eat before I go next time!! \nSpirit Mountain needs to tighten up their employees and hire more friendly people!!!\n\nMichele Horne\nPortland",
   "Nice casino, pretty big. Great non smoking area, it even has table games in non smoking. Free soda and coffee on the casino floor. Great buffet and sports bar. Rooms are being remodeled at this time, ours was magnificent! Friendly staff, all and all, it's a great casino to spend a night or weekend at.",
   "Took honey here for his birthday. Pro tip: check their website for deals and special rates. Paid around 60 for a night and free breakfast coupons for their buffet were included. I'm not a gambler so I can't really rate that but their buffet is the stuff dreams are made of! (Insert Homer Simpson drool). The wait staff let us go and look at the food first before we paid which was so nice because I'm not a fan of buffets. The food was super good. I wish I had an extra stomach to bring with me just to get everything I wanted to eat in there.I would literally drive back up there just for their beef ribs alone. That's how good it was. We will definitely be back. I was disappointed in the lack of native American items in the gift shop though. When I'm on the reservation I like to spend my money on authentic Native American souvenirs."
  ]
 },
 {
  "name": "Elsinore Theatre",
  "address": "170 High St SE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cc0d2492-9333-11ea-b5a1-14b31f159f22.png",
  "tags": [
   "family",
   "performance",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2987231666418540748",
  "source": "GoogleMaps",
  "reviews": [
   "The Elsinore theater is a fantastic asset to Salem Oregon. I'm impressed at how well it has evolved over the years into a first-class venue.  it's a great place for comedy shows as well as other smaller gatherings.  it's not really the kind of place that allows for much dancing because it has theater seating.   It is close too many really good restaurants in downtown Salem.   parking is a bit of a challenge as it's on streets and an empty parking lots that are normally used during the daytime like at the bank nearby, but you really have to watch the signs and the time so that you don't get nasty parking tickets.",
   "My family watched \"A Christmas Story\"  at Elsinore Theater. The venue is beautiful and the performance was amazing. The actors were top notch. The orchestra was great. It was fantastic for the whole family.",
   "Absolutely amazing place for all people of every group. Take your spouse or the whole family. Enjoy a night with a group of friends taking in all the culture and beauty thats litterly coming out of the walls. It's like a fine wine in the sense its only gotten better with age. Add a little love, life, and laughter. You have the recipe for master pieces being created and reproduced. Please take the time to support this local diamond downtown Salem and you won't soon forget it.",
   "One of the most beautiful theatres in existence. A true hold over from days when ornate architecture was more than steel and glass. From the comfortable seating to the three register organ, this magnificent beauty is always a memorable affair.",
   "Beautiful theater. Only complaint was the distraction of letting in latecomers who stood in the aisle having a conversation with the chaperone flashing her light around during the performace.  Show up early and respect others time."
  ]
 },
 {
  "name": "The Grand Hotel in Salem",
  "address": "201 Liberty St SE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cc52b940-9333-11ea-b111-14b31f159f22.png",
  "tags": [
   "delicious",
   "walk",
   "family",
   "free",
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16661077243830452005",
  "source": "GoogleMaps",
  "reviews": [
   "This was the most elegant hotel I have every stayed in.  The staff was so attentive they made sure my every need was met. The meals were grand and the drinks at the bar at the end of a long day was perfect with delicious desserts to satisfy me before bed.  I think the bartender was fantastic and we had great conversation while I was winding down after a long day of training at the convention center attached to the building.",
   "I was more than impressed with the customer service at this hotel. They went above and beyond to answer questions and to make us comfortable. The food is AMAZING, from the included breakfast buffet to the moderately priced cuisine in the attached restaurant. Room service was free and quick. The pool and fitness room were beautiful and clean. The bed was a dream, and the convention center modern and efficient. The surroundings are beautiful with a great park to view scenery and walk along the river. I’ll be back, but next time I’m bringing my family!",
   "Everything very nice , clean and customer service was excellent. I went down to the lobby a few times and Robin was excellent and took good care of me. Plus the kids loved the room. Def will be staying here again .",
   "Room service staff was impeccable and super friendly, maybe the evening front desk girls can take a lesson from Emily - this is how you treat a guest! Horrible front desk staff and not much for sound protection in this hotel you will hear loud exhaust all night with the highway next to us and hope u have normal neighbors because the front desk did nothing about the stomping on the floor above us from 5pm to 1am. Traveling for work event and didn’t get much sleep at all. To boot never experienced certain things I experienced at this hotel and I travel all the time.\n\n***Truly appreciate your response, was trying to speak to you directly however front desk and gen mgr Scott would not provide me with this information. Would love to share with you so it does not happen to another client.",
   "the room that i stayed in was very clean and well taken care of. the workers there were friendly and very helpful. would definitely come back again."
  ]
 },
 {
  "name": "Domaine Serene Winery",
  "address": "6555 NE Hilltop Ln, Dayton, OR 97114, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cc9c6ca4-9333-11ea-be2c-14b31f159f22.png",
  "tags": [
   "winery",
   "food",
   "winery",
   "knowledgeable",
   "family",
   "art",
   "tasting",
   "food",
   "winery",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=11654520107320175280",
  "source": "GoogleMaps",
  "reviews": [
   "The grounds are beautiful and the wine is very good. Our semmelier (Jim) was fantastic too. This place is upscale so expect to pay a little bit more, but it was worth it. I only wish there was more outdoor seating and the cheese and meat plate was more descriptive.",
   "Wow! Just....Wow. Like a five-star resort in San Diego or Palm Springs. I'd rate it five-stars just for the facility alone. But the view is also five stars as was the wine, food and service. You won't find a better winery than this anywhere.",
   "Honestly, no words. Mine and my families decision to stop at this winery over the weekend was a great one. It was my moms birthday, and we reserved the “Prestige Experience” for our family. There was 8 of us... our hostess, Autumn, was incredibly knowledgeable and very fun to interact with. She had us laughing the entire time, and you can tell she has a passion for her job, which says a lot. The facility is state of the art... I mean it’s unreal. You feel like you’re in a place out of a fancy Hollywood movie. They also have a hotel in burgundy and make wine in France and import the bottles.. so Autumn poured us an extra pour of French wine and it was amazing. Seriously can’t say enough positive things about Domaine Serene. I wish we lived closer, because we’d be back frequently, and would sign up for their membership. Absolutely worth it!",
   "Beautiful tasting and property. Friendly staff and great wine. Very limited food selection during wine tasting, but overall a good experience.",
   "03/17/19:  4.75 out of 5 - Domaine Serene has wonderful Pinot Noirs and other whites and roses.  The estate is expansive with wonderful and spacious features and outside seating with great views.\n\nThe staff are very nice, accommodating, and knowledgeable.  But, quite welcoming.  Enjoyed the non-intrusiveness, as well.\n\nDefinitely a great winery to try once for all its wonderful wines and to decide for yourself.\n\nEnjoy!"
  ]
 },
 {
  "name": "Portland Japanese Garden",
  "address": "611 SW Kingston Ave, Portland, OR 97205, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cce02ca6-9333-11ea-88f7-14b31f159f22.png",
  "tags": [
   "walk",
   "art",
   "food",
   "walking",
   "hike",
   "learn",
   "tour",
   "performance",
   "music"
  ],
  "link": "https://maps.google.com/?cid=11424717693547273965",
  "source": "GoogleMaps",
  "reviews": [
   "In the middle of the hustle and bustle of Portland is the beautiful refuge of the Japanese Gardens.  Built high above Washington Park, the Gardens are quiet, serene and a step back in time.  Not all is ancient, however. There is a modern cafe where true Japanese food is cooked and served to order.  There is a building dedicated to traveling art exhibits.  It is worth the time to visit the Gardens, walk the wooded paths and believe for a short time that you are on the other side of the Pacific Rim.",
   "It is a blend of incredible trees, bushes, paths, sculptures, water features, and serenity. Here you will find a fresh new tale of wonder being told every day as you journey through winding paths, experience waterfalls and see color explode around you. A not to be missed experience! Took about 2 hours to get through the garden. The tea house was also lovely but would recommend making a reservation or getting on the wait list before you start walking around. The tea house was also lovely but would recommend making a reservation or getting on the wait list before you start walking around.  I think the price is fairly reasonable considering how beautiful the gardens are, and I would definitely recommend for anyone visiting the area! Loved the little water features, the changing leaves, views of the city, and how well kept everything was.",
   "A great place to spend part of your day while in Portland. \nA great mix of statues,  structures, plants,  trees,  water features, and the like.  Lots of serenity strolling around the grounds. Could be a great place to sit with a book and just relax.  The Umami Cafe has a great selection of teas and treats.  Be ready for a small hike to get up into the garden.",
   "Very beautiful and peaceful.  If you can go in the off-season when it isn't crowded I would suggest that.  There is a beautiful rose garden across the way as well.  I was surprised how small the area is.  I wouldn't recommend going in the summer when it's packed.  This is a great place to go to read a book or ponder life when it's not busy.",
   "Beautiful garden! Enjoyed the guided tour and highly recommend you take it as you learn so much more depth of meaning that isn't posted. Also enjoyed the music performance in the education centre while waiting for rain to pass."
  ]
 },
 {
  "name": "Jackson Jewelers",
  "address": "225 Liberty St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cd36d866-9333-11ea-9948-14b31f159f22.png",
  "tags": [
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9167028534694526979",
  "source": "GoogleMaps",
  "reviews": [
   "Brett helped me design and create a custom ring using diamonds from my grandmother’s engagement ring. He was patient, thorough, and kept in close communication with me throughout the process. The ring is absolutely beautiful and perfect for my lifestyle. Thank you, Brett!",
   "Jackson Jewelers is awesome. I went into the store several times to look at the diamonds to figure out what I wanted. They have an amazing selection.  Their prices are good too.  My original ring was from a brick and mortar store so not the best quality. They helped me design the perfect ring and I just love it!!!  It’s sparkles like crazy and is the perfect ring for me.  It really is.  I worked with Tyler, mostly, and I just love him too. Everyone that works there is amazing and I love that it is a family business that has been in Salem for like 75 years.  😄",
   "I’ve always had amazing experiences working with Jackson jewelers.  They somehow make me feel like part of the family!  Truly an organization of honest experts and I look forward to working with them again.",
   "Always a pleasure doing business with Jacksons.  We’ve been coming here for years, always the best quality product and excellent customer service!",
   "Best jewelry store in Salem and around! Very pleasant and experienced staff, high quality jewelries, great location in town. When you buy something here at Jackson Jewelers, they support you all the way to the end!"
  ]
 },
 {
  "name": "Keeler Estate Vineyard",
  "address": "5100 SE Rice Ln, Amity, OR 97101, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cd7e41cc-9333-11ea-a83c-14b31f159f22.png",
  "tags": [
   "tasting",
   "approachable",
   "family",
   "knowledgeable",
   "tasting",
   "winery",
   "active",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5084317874001136084",
  "source": "GoogleMaps",
  "reviews": [
   "A lovely estate and very warm hostess Gabrielle who will help you understand their operation, ecological practices, and enjoy their fabulous wines.\n Dog friendly too!",
   "Wonderful wines of many variatals, a beautiful setting, and warm staff!  A must visit on your wine tasting trip!",
   "My friend and I went there two weeks ago and this was our first winery stop. The tasting room is so comfortable, the grounds are beautiful, the wines are fantastic, but most importantly the customer service was beyond great. Kelly was our tasting room attendant and she was very knowledgeable, friendly, approachable, and made us feel like we were a part of the family. Highly recommend the stop and if Kelly is there ask for her because you will not be disappointed!!",
   "My husband and I had a wonderful experience hosting a picnic for ~ 40 friends at Keeler Estates on the day after our wedding.  Gabrielle, the vineyard owner, worked with us to prepare a wonderful spread of high quality appetizers, and arranged an intimate setting for our group to gather.  The wines are fabulous, and the landscaping is really gorgeous - perfect for an intimate stroll for couples or for families with active kids.  We're planning to come back for another visit soon!",
   "The only thing better than the wine is Mrs. Keeler.  Fantastic wine and good people...the textbook definition of what a proper vineyard experience should be."
  ]
 },
 {
  "name": "Arcane Cellars Winery",
  "address": "22350 Magness Rd NW, Salem, OR 97304, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cdde3c5c-9333-11ea-8b4b-14b31f159f22.png",
  "tags": [
   "winery",
   "family",
   "winery",
   "tasting",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=16943901961779075272",
  "source": "GoogleMaps",
  "reviews": [
   "I had a wonderful time at this relaxed family owned winery. Next time out-of-state friends come to visit I will definitely bring them here. The location is right on the Willamette river. You can even take the nearby ferry across the river if you're coming from I-5 (always check first to make sure the ferry is running). Bocce, horseshoes and corn hole lawn games are a great way to pass the time while sharing a bottle with friends. Bring a picnic!",
   "Truly friendly people who make a huge selection of wines. Each of their wines is amazing too! Such a beautiful location, right on the Willamette River.",
   "Joined the wine club.  Look forward to coming back to pick up my wine orders each quarter!",
   "Great little winery, friendly staff, and great tasting wine.  Relaxed setting on the Willamette River.  ",
   "I discovered an excellent wine in the tasting room, which I just had to buy, and listened to a wonderful bluegrass band outside on a sunny summer day. Worth the trip. Great for weddings, with a tiny house on wheels for such occasions."
  ]
 },
 {
  "name": "Salem Radiology Consultants",
  "address": "2925 Ryan Dr SE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ce33afa6-9333-11ea-bc35-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=6932782960227912367",
  "source": "GoogleMaps",
  "reviews": [
   "The staff was professional and knowledgeable. The MRI was thorough and the technician explained everything in detail and kept me informed of each step during the MRI. The technician was patient and was quick and efficient.  The machine had more space than any other MRI machine I have ever been in.  I would highly recommend Salem Radiology Consultants.",
   "If there were 10 Stars, I would give them! Everyone was so kind and accommodating, and they really relieved my anxiousness over a procedure. Ive been an RN for many years and know how important it is to make clients feel comfortable. If ever I need these services again, I will go to Salem Radiology. Thank you so much!",
   "The people here are kind & helpful. I had a surprisingly short wait; I even joked that they didn't give me enough time to look at their magazine. They did a fair job of explaining what was going on ~ and would have answered my questions, if I had thought of any :-) I've gone to them for many years & many procedures. I believe they do a great job.",
   "Great experience from the beginning to the end. Friendly helpful courteous and knowledgeable staff and technicians. \nA special mention needs to go to Travis Fromwiller M.D.\nHe did a wet read for me and showed me where my wrist was fractured. He really went the extra mile. His compassion, understanding and kindness will not be forgotten.",
   "Friendly and considerate staff from entrance to exit. All of the staff were professional and treated me with respect. No one was at all condescending towards me. This something I appreciate more and more the older I become."
  ]
 },
 {
  "name": "Rafns'",
  "address": "479 Court St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ce743b36-9333-11ea-acb2-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=3802065674405605621",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely lovely evening.\n\nIt's small, quiet, with gentle music.\n\nThe server was helpful and charismatic and everything felt extremely special.\n\nThe food was exquisite. The portions weren't large, but they weren't small either. A full course left a very satisfying feeling.\n\nA little pricey, but not really that bad at all, and the food and drinks were well worth it.\n\nWould definitely recommend.",
   "Attentive service and excellent food! A delightful dining experience. The salmon dip is divine!",
   "Looking at it from the outside there's nothing to betray what's inside Rafn's. There is nothing extravagant about the niceties of this place. The surprises are printed on the menu and wine list, the servers' description of the night's specials and the suggestion of complimenting combos from the kitchen for your enjoyment. This restaurant is what you hope for when you decide to expend your hard earned money on a great night out or a leisurely afternoon nosh.",
   "This is our favorite restaurant in Salem.\nThe menu is clean and delicious, and the customer service is unmatched. Always choose the soup because no one does soup like Rafn’s! Thank you for a consistently delicious and pampered experience!",
   "Nice folks!"
  ]
 },
 {
  "name": "The Sassy Onion Grill",
  "address": "1244 State St, Salem, OR 97301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ceb981b6-9333-11ea-bcef-14b31f159f22.png",
  "tags": [
   "food",
   "tasting",
   "food",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=4704237863891611240",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food! Definitely go in and try it. Even when there is a decent line it goes quick. I love what they have done with the place. Looks so nice and modern now! Fantastic staff!",
   "Horrible. At least what I chose to order was not sure how the rest of the menu is. I ordered corned beef hash plate. No flavor. Very blan and watery tasting. They didn’t include silverware in a lunch take out order. Nor did they think to include salt and pepper packets for a breakfast menu item with eggs etc. \nMy order was ready fast... just not impressed. I don’t know if I’d be back for the price. $16 for that plate was such a waste and they served me burnt toast. \n:/ So sad to write this review because I love diners and cafe style food. The pictures looked great online. I was so hungry it would have been easy to please me today, so that’s why I had to write this review. Choose some where else to support during these times in my opinion.",
   "The stuffed\n French toast was amazing,  the BTA scramble was creamy and huge.  The fresh homemade toast and sassy jam was worth the trip itself.  Large portions, fresh hot coffee and friendly service in a very clean updated location.",
   "We love Sassy Onion. I have been many times and yet every time I have a hard time deciding what to eat. Everything is so delicious and the portions are huge! Pricing is good. We have always had very friendly staff and great service! Even with people waiting for a table the wait is never very long. They are so efficient! I highly recommend Sassy!",
   "Excellent place for huge portions of diner classics. Tried the chicken fried steak and the beef brisket hash, both of which were fantastic. The thick slice of toasted sourdough and the biscuit were also very tasty, well worth the carb overload. Definitely a solid destination for breakfast or brunch on Salem."
  ]
 },
 {
  "name": "Annette's Westgate",
  "address": "1311 Edgewater St NW, Salem, OR 97304, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cf07f00c-9333-11ea-bc5f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10033046002116077379",
  "source": "GoogleMaps",
  "reviews": [
   "So delicious and the serving sizes are so HUGE! More food than we knew what to do with. Thank goodness for to go boxes. The 20 minute wait was totally worth it. DON'T BE TURNED AWAY BY IT. Come a little early and plan for it. Food service was fast and courteous. Coffee refills a little slow but with a packed house, we can all be patient. \nThank you for amazing meals!",
   "Went to Annette's for the first time this weekend, and were not disappointed! The portions were huge for the price, and customer service was quick. Moving forward remember to bring your own beverage straw, as they are participating in the 'no straw initiative' that the city of Salem is beginning. The food was very fresh and tasted great! We will definitely come back. I hope to try the desserts next time, they looked divine!",
   "I love the salad bar here. It's always fresh and delicious. Today,  I had the pulled pork cheeseburger. It was great. (Get the salad bar as the side)",
   "Always solid food! Favorite is \"Build Your Own Mac and Cheese\" where you add your preferred meats and veggies to their Mac and Cheese. Friendly and helpful staff. Cook Joseph does a fantastic job! Cozy and down home atmosphere.",
   "So laid back and incredible food. Our server was so sweet (we sat in the bar). The portions were more than generous and even though my food was fried, it wasn't overly greasy. I had the fish and chips with tots and a cup of chowder. The chowder was so flavorful! Adding tobasco to it seemed wrong! I was informed by the server that they change their fry oil twice a day to ensure freshness. 10/10 would recommend."
  ]
 },
 {
  "name": "Amadeus Restaurant",
  "address": "135 Liberty St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cf4f59d2-9333-11ea-b82c-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5787508041424431798",
  "source": "GoogleMaps",
  "reviews": [
   "I am so embarrassed that I have never tried this restaurant until the other day after knowing of it for over 10 years.  I enjoyed it so much for lunch, I brought my friends back in for dinner.   This is hands down the best  gourmet food in all of Salem and the prices are ridiculously cheap for the quality.  Somebody definitely knows what they are doing.  Service is impeccable as well.   I so so so enjoyed this place.",
   "Came in just as they were opening for dinner, and what a perfect time to dine here. Started off with drinks and the lamb sliders. Great bartender, friendly and amazing service. Had to go with the classic cooked medium rare, tender and to perfection. Topped it off with dessert and a Irish coffee. Will definitely be back.",
   "We've been there twice, once at the bar to dine and another time at a table. Dining at the bar which is small, was very good. We found the menu to be amazing. We found the service and food to be very good. And they were very accommodating as my sister does not like potatoes, so they gave a bit more of the veggie. We'll be back again as our son will be at Willamette on the baseball team for another 3 years!",
   "I've never been disappointed at Amadeus. From the greeting to the appetizers, dinner through dessert. I had their delicious pork chop with gnocchi, apple-bacon compote and broccolini. Then their amazing bread pudding to finish. I'm stuffed and my pants hardly fit. But man, am I glad I went!",
   "Absolutely incredible! The food was out of this world, service was wonderful and the dessert was to die for! Our new go to, couldn’t recommend more!"
  ]
 },
 {
  "name": "Ritter's Housemade Foods",
  "address": "102 Liberty St NE Suite 100, Salem, OR 97301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cf9c429a-9333-11ea-b840-14b31f159f22.png",
  "tags": [
   "eat",
   "eat",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17073553686870339936",
  "source": "GoogleMaps",
  "reviews": [
   "Outstanding! It was my first time here and I absolutely loved it. The ordering process is so quick and easy.. then you sit down, eat, and leave (obviously). I love the atmosphere here. Such a cute restaurant that is well put together. They also have a cute bar area as well that I didn't get to sit at, but next time!",
   "Favorite Friday spot!!  Finally warm enough to eat outside!  The best lemon drops!  Very lively and “hip” place. Fun atmosphere.",
   "My first visit here, with a friend. We decided to split two entrees. A ham and cheese omelette with red potatoes and French toast. I had decaf coffee, she had an espresso. The inlets and red potatoes won my vote, tasty and very good. The French today was good, but a little dry if you didn't use syrup, and i didn't want to that as it came with fruit and cream already. Good service and no ridge to move you on quickly.",
   "First time at Ritter's for a late lunch. After a Oregonzola Burger, cooked as ordered, medium rare and a Italian Sausage, Peppers & Goat Cheese pizza we were all smiles. 2 great lunches for less than I expected, $28. As visitors from the coast that enjoy our day trips to Salem we'll be back. Great service as well. I should also mention the bar looked well stocked and inviting. For the younger set a stool at the bar looked like fun.",
   "The food was very good especially for the prices. Everything tasted fresh and like it was made with quality ingredients. I didn't have a drink but since they need a ladder to reach all the different alcohol I'm sure their selection is extensive. The happy hour deals were really good, I'll definitely be back."
  ]
 },
 {
  "name": "Happy Bibimbap House",
  "address": "635 Chemeketa St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cfe18934-9333-11ea-ac1b-14b31f159f22.png",
  "tags": [
   "sampling",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14059349515504100535",
  "source": "GoogleMaps",
  "reviews": [
   "Food just like I enjoyed in Korea years ago - fresh, flavorful, and hot.  I highly recommend this restaurant to experience a different, flavorful and wonderful cuisine from an under recognized culinary culture! They have an excellent sampling of Japanese favorites, including good sushi, too. I always look for local Asians and foreign students in Asian restaurants because they know authentic, and this is one of those! Staff are excellent, too; friendly, considerate, and truly want you to experience their best.",
   "We love this place. Their spicy pork is excellent and the sides are always fresh and made on-site. Also try their kimchi pancake. Sounds weird but it is really good.",
   "I ordered takeout from here today. I got the noodles with chicken. it was really good and I was so impressed with the size of the portions. They also threw in some scallion pancake appetizer and kimchi. It was a huge lunch at a very reasonable cost. I'll definitely be back!",
   "Each dish has been made with clean, fresh ingredients. My favorite restaurant down town. The staff is more than helpful. Dining area always clean. So much food to eat. Menu has so many selections, I guarantee you will find something you'll love. Sushi is top notch. ❤🍣",
   "Good service and decent food. It definitely hit the spot and I would recommend it. I would like to see the kimchi with a little bit more flavor. I am sure it is not the easiest thing to get in Salem, Or. though."
  ]
 },
 {
  "name": "DaVinci Ristorante",
  "address": "180 High St SE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d035eb00-9333-11ea-8f6e-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "drink",
   "food",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11132567880130069555",
  "source": "GoogleMaps",
  "reviews": [
   "Very fancy/ expensive Italian. Friendly, helpful staff. Beautiful and tasty food and drinks. Great atmosphere with piano player.",
   "Food was good but small portions for the prices. I would lower prices or increase portion sizes. Service was also not attentive and tries to rush you out instead of making you feel welcomed. I would coach staff on hospitality and welcoming the customer. Also the Martini I ordered taste like vodka without any vermouth. I would make sure all bartenders are not over pouring or know how to correctly make the top 10. Decent place and atmosphere but room for improvement.",
   "Not sure if I've ever given 5 stars to a restaurant, my memory is flaky in my old age phase....but I will absolutely remember DaVinci. It is saturated with elegance & class in decor, service, food & drink. Lots of thick wood & mirror wall hangings, arches, curtains, antique metal ceiling tile, pleasantly soft lighting, PIANO. The chow was impeccably presented and exquisitely good. If you want to have a special date night, this a VERY good spot to start.",
   "Beautiful restaurant that we were thrilled to discover unexpectedly! The wine was delicious. The entrees were fantastic. The dessert was incredible. And the service was WONDERFUL! Huge recommendations from our family!",
   "I recently celebrated a milestone birthday.  Sixty.  Six-Oh.  You, dear reader, must imagine that a day this special comes once in a lifetime (well, duh!) and that you yourself would probably lean towards a very festive and special way in which to acknowledge the occasion."
  ]
 },
 {
  "name": "Rudy's Steakhouse",
  "address": "350 Chemeketa St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d087dbc6-9333-11ea-bf28-14b31f159f22.png",
  "tags": [
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=6609782822477822713",
  "source": "GoogleMaps",
  "reviews": [
   "This is my kind of real 5 star dining experience yummy! White table cloth and napkin settings with a salad fork and top rated fine dinner service! The price was NOT outrageous very worth the quality and under the normal expected cost for this fine of a place. I would recommend this for an impressive first date with prime rib and a glass of wine bread salad and dessert for 2 it’s a hundred dollar bill and a damn great night out and amazing food",
   "Had date night and we picked Rudy’s to eat at. Honestly, couldn’t have picked a better restaurant for the evening. Made the reservation on Google and the we got there about 15 minutes early and he actually told me that they were putting our table together then. Very courteous host/hostess staff and just all around great staff and phenomenal service. From the junior weight staff making sure our drinks were kept full and and bread on the table to our waitress. She did a great job for sure. \n\nWould definitely recommend to anyone. The dining room is very big.\n\nThank you and good night....",
   "First time dining here. Excellent date night dinner! Great service provided by Charles. Fast meal service too. Will definitely try again",
   "Lovely atmosphere. Wait staff was friendly. Dishes were served quickly, and we're very tasty. Very extensive wine list at this location.",
   "Great business. Very responsible management.  They do the absolute maximum to make sure you get the best dining experience even during the covid era."
  ]
 },
 {
  "name": "Wild Pear",
  "address": "372 State St, Salem, OR 97301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d0d07e06-9333-11ea-ba44-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "free",
   "comforting",
   "eat",
   "delicious",
   "food",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10003579718967746441",
  "source": "GoogleMaps",
  "reviews": [
   "When my daughters and I want to go to lunch, this is our special place! We love their coconut butternut squash soup as a starter, which is always wonderful. Their pear salad is always a must and we usually get one of their pizzas to share. We are also a fan of their Blackberry Italian sodas. Their dessert case has wonderful cupcakes and their cookies are deliciously well.. we love the ambience of the old brick walls and the chandeliers. I have celebrated many birthdays here with my girlfriends! Love this special place!",
   "Hidden gem amongst many choices in downtown Salem. Good location with great food choices. Food is definitely well sourced. Service was really good; Heather was attentive and kind! Had the BLTA, good comfort food with great flavors. Definitely recommend checking it out.",
   "The atmosphere here is perfect. The mix of old school charm and themed decorations make it a comfortable and warm place to eat. The place is busy and well liked so we had to check it out. Food was fantastic. The khalua pork sandwich on a gluten free bun was delicious. Salads and soup were great. Everything tasted homemade and comforting.",
   "Midday you're usually going to run into a wait (especially during the noon hour), so plan ahead. Their food has been delicious every time, regardless of what I've ordered. The service is usually pretty good--some days/servers are better than others, but overall pretty good. The space can get a little loud and a little crowded (some of the tables are very close together), so keep that atmosphere in mind when you're planning. Overall, it's one of my favorite lunch spots in Salem when I'm meeting up with my girlfriends.",
   "This was my first time at the Wild Pear and I was impressed. They were full to capacity unless we wanted to sit at the bar, which we did. The very nice lady that waited on us was attentive even though the bar was full as well. I had the Deluxe BLT and it was delicious. It came with lightly salted chips but we ordered Truffle Sweet Potato fries as well. Everything was as warm or cold as it should have been. I would highly recommend this restaurant to all of my friends and family."
  ]
 },
 {
  "name": "Word Of Mouth Neighborhood Bistro",
  "address": "140 17th St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d1188312-9333-11ea-bafe-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16341808560466529678",
  "source": "GoogleMaps",
  "reviews": [
   "I am a huge fan of breakfasts and I’ve tried everywhere all over the world but this is truly THE BEST BREAKFASTS IVE EVER HAD MY ENTIRE LIFE. Not only it’s right in my neighborhood it’s cozy and adorable, AMAZING SERVICE! Gabi is the best, she always offer quality service. Even tho she’s not our server she always check up on us, deliver what we needs with a smile. I come here for comfort and it’s truly the best. Thank you to the owners for providing such a wonderful comfort place for the community and for my tummy!",
   "The food is AMAZING. It is worth the weight. They even text you when your table is ready so you can go hang out in town. The staff is friendly, quick, and on their toes at all times. The cinnamon role pancakes were AMAZING and that meal literally lasted 3 meals and 2 snacks. We got a little \"random acts of yumness\" french toast thing for being patient. Oh my god its the best french toast of my life. Go here. And be nice to the staff!!!!",
   "Very good food and very friendly staff! The biscuits and gravy are done all from scratch and probably the best I’ve ever had! Definitely worth a visit. Well known for their food they do fill up fast. We got there at 7 AM and had to sit at the bar which was totally fine but just know they are busy.",
   "Their bacon is to die for. Thick and cooked to liking. The cinnamon pancakes with cream cheese style icing...huge and delicious. Any change to an order is no problem. We love to do take out too. Sometimes the wait can be 2 hours, but they take your phone number and text you your wait position...so you always know. Great place. Great food. The cinnamon roll pan cake was to die for! There is about an hour wait, but you can give them your phone number and they will text you about 20 minutes before your table is ready. That was delicious also!!!",
   "Website says open today, but they're NOT!!! I've been checking everyday & it said temp closed on the website. Today it says open until 3pm,  so I got excited. I went there and they are closed. I tried calling before going and the phone just rang. I figured they were busy, so that's why I went there. Only been there 1 time before and I loved the French toast. I had my ❤ set on French toast... So went to Sassy Onion. 😂 Word of Mouth fix your website!!! 😠"
  ]
 },
 {
  "name": "Robert's Crossing Restaurant",
  "address": "3635 River Rd S, Salem, OR 97302, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d1647f0a-9333-11ea-a6b4-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family",
   "food",
   "cheap",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13508379960092924730",
  "source": "GoogleMaps",
  "reviews": [
   "I've been here a few times and it has always been a pleasant experience! A majority of their entrees are very flavorful and well cooked.Their smokey mac and cheese is amazing. The smokiness is not too overwhelming! Love to come here for dinner since not only is the food good but the service is friendly.",
   "I went Robert's Crossing for the first time today. They were great. Beautiful place. Can't wait to try out the patio seating when they reopen.  Food was very delicious!😊 They really go the extra mile to make your experience better. Support local. Great people! Thank you!",
   "Parents' 50th Anniversary was a very special night thanks to all the great folks at Robert's Crossing! In a beautifully lit private room, they made our family celebration festive and unforgettable. The food - divine!",
   "Very tasty foods!  Nice and calm setting!  My partner love his meatloaf dish and clam chowder.   Exceptionally delish!  Excellent service!",
   "Haven't eaten there yet, but planning a function there. The coordinator has been extremely helpful,  and the menu looks great.  This place is not cheap, which was our only reservation. But, if the food lives up to our experience so far, it's going to be well worth it."
  ]
 },
 {
  "name": "Marco Polo Global Restaurant",
  "address": "300 Liberty St SE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d1a8db40-9333-11ea-9c6f-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "free",
   "cheap",
   "free",
   "food",
   "family",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16253079425082749470",
  "source": "GoogleMaps",
  "reviews": [
   "I had a chicken dish (can't recall what exactly) and it was so tender and juicy. It was some of the most heavenly food I've ever had. I went with my family, and their food was delicious too (we all had to try each other's). My mom is on a diet and can't have gluten. They had a special gluten free menu as soon as we came in and at the end when they brought us the fortune cookies, they brought her a gluten free cookie. Best service ever. Loved it and would go again when I have the money. Its not a cheap place but for good reason.",
   "My favorite Asian restaurant. They have all the Asain styles on each page on menu. I’m gluten free and I love how the put on round plates and gluten on square... nice! \nGood prices and great food. Nice location, nice scenery. 6 blocks from waterfront carousel.",
   "This restaurant would even make Chef Ramsey happy! I got the Chicken Saltimbocca and it was absolutely awesome! The staff was delightful and the place was clean and beautiful, despite the busy day they had experienced!",
   "This is a rather sprawling restaurant in downtown Salem with an extensive menu of Italian and Asian dishes. We were impressed with the food, as our expectations were exceeded for this family style restaurant. We visited on a week night, so they were not super busy. Service was very good. I had the seafood fettuccine that was wonderful; the seafood was cooked perfectly and was excellent considering that Salem is not on the coast. My partner had the stir fried asparagus, onions, carrots & garlic with shrimp that was cooked to perfection over brown rice that was cooked perfectly. The wine by the glass was reasonably priced and very good. We highly recommend this restaurant.",
   "Without a doubt the worst dining experience my wife and I have had in Salem. We went out for a lunch experience on this first day of daylight savings time and decided to try something new. We were seated and only offered dinner menus. I asked  about that and the response was they only do lunch menus on weekdays. I ordered Cashew Chicken and my wife went with a Burger. The Cashew Chicken was the most tasteless food I have had in a restaurant. I mean it, no flavor, no sauce, just veggies, chicken and a pan of rice. The ingredients looked fresh but it was as if they had been steamed with no seasoning or sauce. I was able to eat almost none of it. Fortunately my wife's Burger was a bit better but only marginally. I left my whole meal on the table and  my wife left most of hers.\n\nThe service was poor as well. In fairness I believe she got I was disappointed and just avoided us. We had been wanting to try this place for a while but now we will not be back."
  ]
 },
 {
  "name": "Best Little Roadhouse",
  "address": "1145 Commercial St SE, Salem, OR 97302, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d1f41894-9333-11ea-8fbd-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13047928202772907697",
  "source": "GoogleMaps",
  "reviews": [
   "We love this place!  Food is consistently delicious. Servers are usually pleasant, generally a bit of a wait for seating and food. Wish it wasn't so loud though.",
   "This was our choice for eating!  What a busy little place.  Parking is a pain especially for those who just can't seem to park in the lines or take the time to fix the parking job!  The Nuclear margarita was very good and better than the regular one.  We had the creole burger and the chicken sandwich.  They were both really good and everything was hot.  The service was great.  Laura was a sweetheart and so helpful with all of our questions.  The rolls were very good and a great little snack.  After dinner we went out to enjoy a round of mini golf.  It was a nice end to a great day.",
   "This restaurant lived up to it's expectations and reviews. Our group order three different cuts of meat, all cooked perfectly (medium rare, as it should) and seasoned well. The only complaint would be the beef being under salted. The specialty drinks were a play on old fashioned favorites, like the \"Tennessee Tea\" (essentially a long island ice tea). The prices are very reasonable given the salad, rolls, and side dish you get with an entree. Well worth it!",
   "We have gone there twice now after my daughters cheer leading competitions, and both times service was great! This last time our girls won championships, and our waitress got the staff to clap for them, congratulate them, AND even give them ice cream! They accommodated all 16 of us parents and children! If you ever have a large party I highly recommend coming here for some good food and drinks!",
   "This was one of the best country food dinner places I’ve been to! Nice atmosphere and delicious food and the desserts were huge and to die for! Burgers, steaks, Mac n cheese, salads, etc. My cousins friend had a birthday and the server shouted and got the whole restaurant to sing happy birthday! We’ll never forget that moment!"
  ]
 },
 {
  "name": "ACME Cafe",
  "address": "110 Hansen Ave S, Salem, OR 97302, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d2389be4-9333-11ea-87b7-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15825398254052978069",
  "source": "GoogleMaps",
  "reviews": [
   "One word comes to mind regarding our dining experience at the Acme Cafe: “OUTSTANDING.”  My wife and I ate an early dinner there for the first time.  I tried their fish and chips and was pleased that I did.  Our food was fresh, served hot, and absolutely delicious.  Our server was very friendly and attentive.  The food portions were generous and commiserate with the price paid for our meals.  We would highly recommend this restaurant to anyone looking for quality comfort food.",
   "Delicious as usual! My wife and I have been coming to this establishment for years and love the great food, service and atmosphere. We've always been treated well and is always clean with excellent and friendly staff.",
   "The food(tomato pie)was delicious...and our waitress(I never caught her name - small, slight build, med brown? hair...😟)was sweet, delightful & helpful. My friend & I were there Tues, 2/25, noon - 1:30. Loved that when we were leaving, the 2 gentlemen behind the glass counter area called out to us, \"Thank you for coming in, ladies! Have a wonderful day!\" Yes! We will be going back! :)",
   "Quaint place. Service is good. Food is very good. We had breakfast; scramble, and eggs and bacon. The mimosas were delicious!",
   "Amazing food! Really enjoyed it. Great staff and cool environment."
  ]
 },
 {
  "name": "The Original Pancake House",
  "address": "4685 Portland Rd NE, Salem, OR 97305, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d2864a5a-9333-11ea-b3ae-14b31f159f22.png",
  "tags": [
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16368631751134570163",
  "source": "GoogleMaps",
  "reviews": [
   "Exceptionally good breakfast and excellent service.  This is a Salem institution, and for good reason.  Consistently great food and consistently excellent service.  I honestly don't think I've ever had a bad meal here, and I've been many many times. I had the mushroom Omelette and it was outstanding.  It came with buttermilk pancakes and I had them topped with seasonal fresh strawberries. YUM!",
   "Gluten free pancakes galore! Nice and fluffy ones, too!!\nI love their Irish inlet. The potatoes are yummy and everything is made fresh, and in house!\nWe frequently go here and have never been disappointed.... no matter what location it is!!",
   "I can only think of nice things to say about Te Original Pancake House. This restaurant has a coziness that you would expect from a rural breakfast place. The food is outstanding and the service is quick and friendly.",
   "Had the pumpkin pancakes with an Irish omelette! The staff was very accommodating and let us make substitutions for our meals. I even got homemade whipped cream for my coffee and pancakes! This was our second time here as a large group (15+ people) definitely worth the wait!",
   "We have visited the last 3 weeks at the south location on Commercial. I have sampled French crepes, blueberry waffle and last week - Swedish pancakes. The latter was a first time experience and it was terrific. Three large, thin pancakes with a lingonberry covering. It was a very special treat. The staff is very helpful and friendly and eating there is a pleasure. The setting is great with a fire in the fireplace. It does get crowded later on Sunday morning."
  ]
 },
 {
  "name": "Gamberetti's",
  "address": "325 High St SE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d2d5f46e-9333-11ea-9dda-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9914751242142002575",
  "source": "GoogleMaps",
  "reviews": [
   "This place used to be really good. But recently due to owner changes and lowered quality product and food the experience has become decidedly sub par. Canned sauces, clearly store bought pastas and raised prices ensure I will not be returning after several attempts to recapture the original enjoyment of this restaurant.",
   "Gambarettis has brought a high-end Italian restaurant to downtown Albany. The price is what you would expect for delicious and complex Italian food. \n\nWith a mix of cocktails that have modern flair, a good selection of wine, great pasta, I would recommend that you try this restaurant.",
   "I had the Brie cheese and mushroom Mac and it was a savory explosion of flavor. I also got to try their Soprano Mac which is always tasty as it has a little heat to each bite and is paired excellently with the sun-dried tomatoes. I've never had the Mosquito IPA before either and I was a huge fan, thanks for the amazing evening!",
   "These folks make the Italian in me very very happy. From the Antipasti to the Bolognese, the crusty whole grain bread and the Willamette Valley olive oil, these folks are the best Italian food in the region. The service is excellent, I've never once felt as if I was lacking in anything. One more thing. I'm a non drinker, and the Shirley Temple is bomb! Thanks folks, I look forward to my next trip.",
   "Gamberetti's Dining Experience: Very warm and relaxed. Real nice vibe! Tina served us and did a spot-on job. The fare: Inventive, fresh, and delicious. \n\nEach phase of the meal was delivered right on time with an \"attention to detail\" presentation. Tonight, was Caesar's salad, calamari, and their marinara teamed with three savory-filled meatballs. \n\nBoth a most excellent date night and entire family and friend affair. \n\nThank you and much love! 5 Stars! \n\nOttimo cibo, from this Sicilian family! :-)"
  ]
 },
 {
  "name": "The Kitchen on Court Street",
  "address": "466 Court St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d3126134-9333-11ea-a63d-14b31f159f22.png",
  "tags": [
   "foodie",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6770471002007306115",
  "source": "GoogleMaps",
  "reviews": [
   "A restaurant with a large diner-style menu updated with great surprises. It also has a shop to grab sandwiches, soups and pastries to go. A great point for me is being open 24/7 (in downtown Salem!). Full bar is available as well. I have tried a few different options and they were fairly good to good. My recent favorite is their fried green tomatoes (by the time I took the picture, half were already gone!) Service is always prompt and courteous but is a small place so you may have to wait depending on the time.",
   "Another foodie must!! Gotta say my favorite are the Pancake tacos!!! If you are like what?! Go try them! They have a pastry/coffee side if you must wait to be seated. Seating is usually 20mins but worth the wait!!",
   "If I had any constructive criticism to offer it would be the space.  They ate crammed into such a narrow space I literally felt like the strangers to my right and left were family... and I'm an introvert so my personal space is very important to me so that does stand out as something that would impact my decision to go back there.   Besides that, the food, service and price were all perfect.  I couldn't criticize a single other thing.",
   "The Kitchen on Court Street is the best 24hour restaurant in Salem. They serve their whole menu all day and night. They have a fairly diverse menu with their slightly bougie take on classic diner foods. They are a little pricey but they use fresh local ingredients. You are definitely getting what you pay for!",
   "Thanks for the great meal and excellent service. \nI was very impressed with my meal! If anyone is looking for good Benedict for breakfast, I'd recommend this place! \nThank you so much for the meal, as a furloughed employee I really appreciate the warm warm meal before a job interview."
  ]
 },
 {
  "name": "Bentley's",
  "address": "291 Liberty St SE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d384d276-9333-11ea-b4ee-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "eat",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8227144518079099469",
  "source": "GoogleMaps",
  "reviews": [
   "Food description was off. I ordered seafood risotto and it was basically chewy seafood in a tomato sauce with white rice on top. Poorly seasoned. Appetizers included a grilled slice of cheese with peppers, and creamy texture crab cakes. \n\nI had high hopes for this place, but it didn’t turn out great. The food were things I could easily make (better) at home. They comped our meal though, as we didn’t want to eat it. \n\nThe drinks were great though. \n\nThere are a lot of great reviews, so maybe it was just an off night?",
   "I recently had lunch at Bentley's for the first time. The service and ambiance were great, and the food was fresh, well-prepared and attractive. As a long-time vegan, however, I would have been happier to see more vegan options (including ample protein) on the menu. It was also too pricey for me to eat there very often.",
   "Bentley's is attached to the Grand Hotel and as such, has a beautiful interior. Slight disappointment at first as we entered in off the street rather than through the hotel and therefore it took a while to be noticed (had we walked around to the other entrance, we would have been seated quicker). After that small snafu, we were given a table and served very quickly. We got our food so fast after ordering and it was very hot! The meal was delicious and our server was nice, fun, and lovely. Overall, it was a great dinner experience.",
   "Very attentive service, that when truly watched shines.\nThere are clearly Silver Service and Sommelier trained staff about the place and that really impressed me, I didn't expect it.\nThe food was excellent, my party had all sorts of requests, each taken in their stride by the staff. I enjoyed the drinks too. I ordered a Russian Mule and it came in a metal vessel, whilst not copper, it was a nod that someone knew, and gave a damn.",
   "Bentley's has never disappointed me! Tonight was a little weird, as they were filming something, so the vibe was different. But the food was great and we had wonderful service from Jeremiah!"
  ]
 },
 {
  "name": "Sisters Irish Bistro",
  "address": "189 Liberty St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d3cab680-9333-11ea-b3c6-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "family",
   "historic",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13060765057879916672",
  "source": "GoogleMaps",
  "reviews": [
   "This is specifically a food review as I ordered the shepherd's pie off of grubhub today while I was at home sick. Nothing hits home like a hearty warm meal when you're sick on a col rainy day so this dish sounded perfect!\nThe portion size was great for the price. A little too much cheese on top for me but that's no big deal. However, the amount of mashed potatoes and peas was INSANE. There were so many peas in the pie that I could barely taste the lamb and seasoning. Had to push the mashed potatoes to the side, must have been at least 3 full cups on top! I still ate it but not something I would pay that much for again.\n\nReview subject to change once I go in person for a visit! :)",
   "Today, I had the pleasure of experiencing a heaping slice of Ireland tucked inside a historic masterpiece and topped with the kind of perfectly executed classic Irish kitchen cooking that transports the diner seven thousand miles in the time it takes to consume one home cooked meal. Sister Irish Bistro, a true labor of love for the multi-generation family that runs it, offers excellent service, freshly prepared classic Irish cuisine done right, and an atmosphere that is nothing short of perfect. Located in the below ground level of the historic Reed Opera House in downtown Salem, it is more than worth the trip whether you're entertaining large groups or just want a quiet drink (anyone looking for a place to get a perfectly poured Guinness, look no further). In one night, Sisters Bistro became one of my favorite places to simply be. You won't be disappointed.",
   "Listen . If you want genuine and exceptional irish fare, get down there. Perfect atmosphere. Tonight there was a musician playing guitar, flute and harp. Great service. We ordered 6 different plates among our group and everything was delicious. Couldn't keep my fork on my own plate. 🤷‍♀️",
   "Hidden Gem in Salem. We were driving through and found this spot! (Hint..its downstairs at the old opera house). Great food, great beers and great staff. Many of the recipes are from the owners family....delicious!! Highly recommended and we will definitely go again !",
   "My wife and I ordered this through ubereats. We got the shepherd pie and sausage rolls. Extremely good quality food absolutely delicious and even pleasing to a one year old."
  ]
 },
 {
  "name": "Patty's Off-Center Cafe",
  "address": "1741 Center St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d41db8c6-9333-11ea-9412-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3874640350855179507",
  "source": "GoogleMaps",
  "reviews": [
   "Cozy little restaurant. The staff are nice and welcoming. The decor is chicken themed which is pretty fun. The food is good and it came out fairly quickly. Been here a couple of times now and will continue to come here!",
   "Cute smallish breakfast/lunch cafe. Excellent service, good coffee never ran empty. Veggie options but great bacon too. Benedict choices and daily specials that looked good. We had the standard eggs, meat and yummy country potatoes (w/onions and red peppers). Others had the blueberry pancakes said they were excellent with lots of berries. Though we didn't try them the herb biscuits are truly a treat. Fairly priced with lots of parking, easy to find. One of those places you could make a habit for breakfast.",
   "It was fantastic, as usual! I always gravitate towards the Eggs Benedict, because it's the best version I've ever had. He also ads fresh spinach to mine (I prefer). Then, I get a side of gravy to put on the potatoes. Pure Heaven. I don't even order eggs benedict anywhere else anymore. \nBest Clam Chowder (w/toast points) in town as well (Fri/Sat)...says my Daughter. \nCheers! 🏆",
   "We are first time visitors from out of town. Patty’s Off-Center Cafe (literally off of Center St) may not look like much from the outside but as soon as I walked in the door, it felt like I was at home in Mom’s kitchen ready for some good, home-style cooking - and that’s exactly what it was! The food was delicious and the presentation of the plates by far exceeded my expectations. You can tell that they truly take pride in their cooking! Not only did the food taste good but the pricing was definitely reasonable. The staff was super friendly and always made sure we were taken care of, the chef even went the extra mile to give us some bacon for our pupps outside! I highly recommend this restaurant!",
   "The quality and flavor of food here was amazing.   There is no better food in Salem and the owners are terrific hosts in this quaint and comfortable setting.   This is my fourth visit and every time I'm more impressed.   The daily specials are very well named - German Hash and the Club Sandwich!"
  ]
 },
 {
  "name": "The RAM",
  "address": "515 12th St SE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d46dadc0-9333-11ea-ae90-14b31f159f22.png",
  "tags": [
   "food",
   "economical",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16483862017824896941",
  "source": "GoogleMaps",
  "reviews": [
   "Service was very accommodating and food was mediocre. The club sandwich was a little large and dry (not enough mayo) but they corrected so. This place has some of the best home made potato chips I’ve ever had. I highly recommend it. \n\nThey also brought out a pitcher of root beer rather than small glasses and charged the same as the small glass which was very nice.",
   "I've been eating here for years, even cooked at the RAM for a bit in my youth. What a great place for a summer lunch! Shaded or sunny seating can usually be had out on the deck over the creek. The food is great, service is usually good and the drinks are above average. This trip was nice because it was on a Monday, happy hour prices all day! This meant a nine dollar burger was 4 and change, two more bucks to make it a meal. The ram is a nice place to eat, and you will usually spend more than at a quick lunch spot, but you can make it economical by choosing wisely. I would have taken a Star off for the two day old topper on my Bloody Mary (which was otherwise good) but the waiter kindly comped it after seeing it. It was a rare miss and they fixed it.",
   "Awesome place to grab a bite and watch the game. The steak was cooked perfectly and the appetizers were just as great. Friendly service! Dorothy, our waitress, provided one of the best dining experiences I have had. Very approach able and communicated well. Will definitely be coming back again",
   "Great place to meet with your parents for an afternoon beer, or two! Friendly staff, great food, amazing brewers making some impressive beers back there. Outdoor patio with a lovely creek view. See you all there!",
   "The service at the bar top is always great.  And while there have a few times where the food is really good, generally they can't get the proteins to the right temp.  A general overhaul of the restaurant would be a good thing.  UPDATE the place for goodness sake.  Chipped plates, bent silverware, dirty rugs, a full deep clean would be a great idea!"
  ]
 },
 {
  "name": "Bo & Vine Burger Bar",
  "address": "176 Liberty St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d4bd7d4c-9333-11ea-8ef5-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "unique",
   "eat",
   "drink",
   "music"
  ],
  "link": "https://maps.google.com/?cid=5883002821105535394",
  "source": "GoogleMaps",
  "reviews": [
   "Trendy Burger joint meets local diner prices! The burger was excellent, with tasty toppings and a juicy patty. The sides are an amazing addition. The mixed fries basket that we got was the \"sharing\" size, and it was more than enough for 4-6 people, let alone 2 of us. It's a great value as well, for 5 dollars gets you all those fries in the picture! On top of that, the dipping sauces are interesting, delicious, and varied. I couldn't recommend this enough to even a casual burger fan. Excited for our next visit!",
   "Man, Saturday night and an empty stomach, I was ready to chow down on some amazing burgers. I've been to the other Bo & Vine locations so I had a pretty good idea of the burger I love. This location has very limited seating which I understand, they have made the best out of the space they have but when people are standing around waiting to take your spot it's a little much. But the food made me feel pretty sick. The burgers were so covered in grease that the first time picking it up, streams ran down our hands. Not the good stream where its buttered and delicious. But like the food was slapped on right out of the greaser. Both my hubby and I couldnt finish either plate. The fries came to the rescue in the end. But I think we'll try some other burger places instead",
   "Got some fries for social hour. They were good as usual, and way too much for my wife and I to finish in one sitting. Their sauce selections are great. Staff is friendly and helpful.",
   "Straight forward menu with just enough selection to satisfy everyone without feeling cluttered. Absolutely loved the fries and burger so I'm looking forward to their HUGE tater tots and unique Chicken Sandwiches next time. Just can't stop thinking about that maple bourbon reduction so if anyone who works there can hook me up with a jar of that I'll let you eat some with me.",
   "Wow this place was amazing! I've been hearing about this place for months and I finally tried it. The burger was yummy once I got past the unusual spices and the fries were some of the best I've ever had. Crispy and a little oily (perfect!) Oh, and their Fry Sauce tastes like Arctic Circle's!!!!\n\nEverything about that place seems top shelf, from Jones Soda in the soda fountain, to the high quality salt to the very sturdy chairs (important to me as a man of size). \n\nThe atmosphere was very relaxed. Music in the background loud enough to hear it, but not loud enough to hear the words, lots of dark woods, I felt totally comfortable sitting alone.\n\nOh, and the prices! Burger, fries, and a drink for $10.50 at lunch!"
  ]
 },
 {
  "name": "table FIVE 08",
  "address": "508 State St, Salem, OR 97301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d51e8c70-9333-11ea-93fc-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "drink",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12247425433049906684",
  "source": "GoogleMaps",
  "reviews": [
   "I brought my daughter in for dinner. Neither of us were impressed. 🙄 The pickled beets on the burger we're not pickled beets, they were bland, canned and a flavorless disappointment. The Rosemary fries were good unfortunately all of our fries came to the table cold. The pickled eggs were close to being okay but for the price, ridiculous! The lemon curd cheesecake was very good and the best thing it we had. My daughter did enjoy the macaroni and cheese. All in all we probably won't be back since our server had better things to do then take our order. The majority of our food was Small and Unsatisfactory. I tried to order a couple more things on the menu. We like to try a variety when we go out. I had not let on to the waiter I was unhappy. When he finally came to the table he gave us a \"humph\" attitude, I said I'm ready for the check. Not a place I would recommend to my friends and family when they come to visit. ☹️",
   "I have been here several times.  Always have enjoyed the atmosphere.  Food is very good.  Drinks are prepared by an exceptional artist with more personality than a full season of Seinfeld episodes.   Great exposure and location in Downtown Salem.   Close the Theaters!  (Yes plural).  Great asset to Salem.  Our hostess was cheerful, happy and nice!  Thank you.",
   "Our hotel recommended Table Five 08 for dinner and we weren't disappointed. It is a nice downtown setting with a bar area and dining area. The service was very good--friendly, helpful, and attentive. The drink list included several interesting looking cocktails, some regional beers and an extensive wine list, mostly by the bottle but several by the glass. Interestingly, if you don't finish a bottle they will re-cork it with argon to keep it fresh to take home. The food menu had interesting choices and variety. The food we ordered arrived promptly, with a nice presentation and tasted good. Our server helped with wine recommendations to pair with our meals and the pairing worked well. The noise level was quite loud. There was fairly loud background music which encouraged louder conversation from all the diners and which made comfortable conversation nearly impossible. If it wasn't for the noise level this would be a spot I'd be eager to return to.",
   "The table 508 burger is amazing! You may be tempted to ask them to hold the picked beets...but DONT it all works together amazingly! The horseradish sauce is to die for! A definite must if your in the mood for a artisan burger!",
   "Nice atmosphere. Good for lunch or dinner. Very friendly and attentive staff. Food is reliably tasty"
  ]
 },
 {
  "name": "La Margarita Express",
  "address": "515 Chemeketa St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d564209c-9333-11ea-ad66-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13888805989778890720",
  "source": "GoogleMaps",
  "reviews": [
   "The food was amazing, but the service was only okay. It took a long time for someone to take our order, we ended up spending over an hour and a half for lunch because it took so long to get food ordered and arrived. Would recommend, but would plan for more time.",
   "Spicy and delicious! Highly recommend considering good, traditional Mexican/Salvadoran eating is hard to find. They were super quick in the middle of lunch. Staff was very attentive, you won't go wrong here.",
   "Good food, good service. I always get the pupusas and they are always good. They bring beans and salsa out with the chips which is nice when we have the little one with us because he doesn't get impatient. One bummer is they don't have Mexican coke or Pepsi.",
   "I absolutely LOVE this place and the Arroz Con Pollo w/cream sauce is life changing. No seriously, every person that I have ever taken to lunch here has tried mine and are now addicted like I am. The restaurant is clean, the service is good, and the food is fantastic!",
   "I had a chicken dish and the chicken was shredded and had so MUCH flavor. The place is really big inside with different areas decorated so colorfully. Will be back."
  ]
 },
 {
  "name": "Christo's Pizzeria & Lounge",
  "address": "1108 Broadway St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d5abff2e-9333-11ea-a3f8-14b31f159f22.png",
  "tags": [
   "performance",
   "food",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10997640678846785406",
  "source": "GoogleMaps",
  "reviews": [
   "We had a large group and were informed of the 20% mandatory gratuity ahead of time. I don't necessarily have a problem with that, even though the industry standard is 18% but it's not a big deal. We had the worst service I've ever experienced there. Yet we were forced to tip 20% \nI'm not in the habit of \"punishing\" staff for poor performance. I just felt like the waitress knew she was going to get a great tip no matter what, so why even try. \nI wouldn't consider this place for a group dinner again.\n\nThe food was fine.",
   "Went to this place when I was in Salem for the day. Had a great experience! The quality is top notch and I felt like I was in a actual restaurant in Italy. The pizza crust was the perfect blend of soft with a small bit of crunch. I was also very impressed with the prices for the quality of food that I had. Highly recommend!",
   "Finally made it to Christos after hearing much about how great the jazz is. The marvelous Nancy Hamilton performed there last night and wow wow wow, she is well worth driving an hour to hear! Because the reviews of been spotty, we weren’t sure what to expect about the food but it was great! Wonderful garlicky calzone, Italian varietals by the glass, delicious Caesar salad, we will definitely be back just for the food! we will always come whenever Nancy is playing, I’m glad to not have to drive all the way to Portland or Seattle to hear her!",
   "Good pizza, great staff! It was a bit of a wait to get a table, but the tasty food was well worth it!",
   "First off I want to say the atmosphere was great. For those who like traditional Italian food I would say try the shrimp and risotto it was divine. Now where the restaurant falls short. First I’ve never been to a good Italian restaurant that didn’t serve good Italian or French bread with dinner. I asked for bread and was served slices of some horrible sandwich bread. The ravioli was sad tasted like it came frozen from Walmart. As a suggestion to the owners ;  serve your customers elegant Italian food with good bread and sauce and butter and people will come. Including little extras shows class and believe me what you want is not higher prices but more satisfied customers that will keep coming back again and again."
  ]
 },
 {
  "name": "Roger That BBQ",
  "address": "1492 Brush College Rd NW, Salem, OR 97304, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d5f38fe2-9333-11ea-a359-14b31f159f22.png",
  "tags": [
   "food",
   "affordable",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6472780185400524294",
  "source": "GoogleMaps",
  "reviews": [
   "Baked beans are awesome. The brisket tacos are delish. Wings are amazing. For a part time place it rocks.",
   "Tried this place for the 1st time. They sold out of ribs so I had to get the Brisket plate. It was $16 for only 3 slices. The meat had a good looking bark, smoke ring, and the meat was moist without any of the greasyness. Despite the appearance, the Brisket was just OK. The meat didn't seem to have any flavor. I had to use quite a bit of BBQ sauce to make it better. The Hot Link also wasn't that great. It did have a kick though. All in all, the food wasn't really memorable or anything special. I will still go back to try the ribs even though I prefer Spare Ribs over Baby Backs and give the Brisket another shot. You might enjoy this place if you're a casual enjoyer of BBQ and have the craving for decent BBQ.",
   "Wonderful for and atmosphere! BEST BBQ I've had since Smoke & Swine was in town. Staff is awesome and took the time to explain what the items were on the menu. I highly recommend this place. Very affordable!!",
   "Ok, so I am giving three stars for a couple reasons. I am going to start by saying I didn’t really care to much for the food. Now I only had the chicken and the ribs and I haven’t had the chance to try anything else yet. So first thing is the people here are very nice! Super upbeat and helpful. You can definitely tell they love what they do and really appreciate each customer they get. Second, the building it self isn’t all that big. But the setting is really cool. I like the decor and the lights and it’s set up pretty awesome. Clean and well taken care of. Back to the food. The chicken breast I had was ok. I ate about half and was more disappointed that I had to use bbq sauce to give it any flavor. The sauce was really good. But was just a little dry and bland on the chicken. The ribs I ate just one rib and was really unhappy. It felt really chewy and hard to eat and didn’t have much flavor. Overall I was disappointed because all the reviews said it was super amazing. I will try it again eventually and maybe the next time it will be different. it does seem a little high on the price side so might not be right away.",
   "I have eaten at many BBQ joints in Oregon. This is one of two that get it right. If you know good BBQ then you know it is hard to find in the area. This place is worth the trip. The Beans will change your life."
  ]
 },
 {
  "name": "Chira's | Restaurant and Catering",
  "address": "189 Liberty St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d63a5d1c-9333-11ea-bcb5-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "delicious",
   "eat",
   "food",
   "drink",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1328142460777892111",
  "source": "GoogleMaps",
  "reviews": [
   "Went for brunch on Sunday, best breakfast I have had in a long time. My husband ordered the steak and potatoes, now I am not a potatoes person but theirs are dangerously good. The steak was moist perfectly cooked and seasoned. I ordered the stuffed French toast. I have never tasted it's equal. Coffee was always full and our waiter was very attentive.",
   "Been here a few times and every time was amazing. The very big chicken nachos are amazing. I love some good nachos! Also their tacos are tasty. The southwest in my opinion are the best. I could them every day. They have fair prices on their food Especially for downtown.  Their drinks are great, knowledgeable bartender. Will keep coming back.",
   "I’ve eaten at most restaurants in Salem and all I have to say is this place is the best!! I had the prime rib and my wife had the fettuccine Alfredo. Both dishes came nice and hot and absolutely delicious. This place is the bomb. They were packed and pretty busy service was a bit lacking but the food was with the wait. Much better than I expected in Salem. We will visit them again!! Finally a great place to eat in Salem.",
   "My wife and I had never been there. We heard the food was very good and they had a jazz band playing. Good reasons to go. What happened was it took 35 minutes to get our 1st drink. The server helping us was covering all the tables including a table of 8. Two other guys were behind the bar with the bartender and were shooting the breeze for about 40 minutes before they did anything. Maybe they were off the clock. We stayed because of the music and when the food finally arrived it was very good. The 3 star is for the poor service though our guy was working his but off to get to everyone.",
   "The salads looked good and my soup was excellent but my burger was tasteless. I had to put ketchup on it to add some flavor. One of my friends had pasta and she said it had good flavor but it was dry. The server was very attentive and nice, but it took a long time to get our food even though it wasn’t busy."
  ]
 },
 {
  "name": "Xicha Brewing Co.",
  "address": "576 Patterson St NW #140, Salem, OR 97304, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d67e4fa6-9333-11ea-b013-14b31f159f22.png",
  "tags": [
   "food",
   "sampling",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=14752993410592573916",
  "source": "GoogleMaps",
  "reviews": [
   "I’ve been to Xicha’s a couple times, have tried quite a few different items and their food is always great. Their pickled onions are the best part. Definitely elevated Mexican dishes. But some of them have been quite messy/messy looking. I really enjoyed the fried avocado but the salad part was kinda just plopped on top. And every time I go there they always forget my main dish and I end up having to take it home because the people I’m with are already done eating.",
   "1st time here, and it was fantastic. Off the beaten path in West Salem, it's a wonderful venue. Full of life and color, the service was as perfect as the food. They offer a $7 flight, and my partner and I both had one. It was a great sampling of the brews they have to offer, and the paella is to die for. Highly recommended! A definite go to.",
   "The food is excellent. Service is pretty good as well . Beer is a hit and miss. I'm a homebrewer so I've made a lot of mediocre beer in my brewing journey. I'll admit that the beer seems to haven't gotten better since they first opened. Getting to know your brewing equipment helps so I'm sure this had a lot to do with it. Not quite 4 stars yet but it's getting there. I continue to go to help support what they're doing. Brewing is a hard business so I appreciate the effort. Not a huge fan of \"Latino\" theme that clearly caters to non Latino customer base clearly in the non-Latino part of town. It's Salem, so you take what you can get I suppose.",
   "We have been here multiple times end it honestly just keeps getting better. The pictures say it all. Their customer service is spot on, and I love the twist and the amount of thought that goes into each and everyone of their plates. Will recommend them anytime of the day.",
   "This is our second visit to this fun restaurant! We love the staff here-so friendly and helpful! I enjoyed a delicious raspberry margarita with my two tacos. My partner had a couple of his favorite beers and he also had tacos but he also tried the potatoes (papitas) and I went for the homemade corn chips-delicious! Next time I will have the paella again-too good to wait too long!"
  ]
 },
 {
  "name": "McGrath's Fish House",
  "address": "Willamette Town Center, 3805 Center St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d6c5e04c-9333-11ea-ba28-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6434871258652064228",
  "source": "GoogleMaps",
  "reviews": [
   "I have been going to McGraths for years. It has always been good. I think the entire chain is now lacking In all departments.  The food was mediocre.  The staff was also mediocre. They need to change with the times and step up their game. I had a bloody Mary, was not good. I do not recommend getting one. I also had the Captains Platter,  the best thing on it was the friend shrimp. My friend had seafood pasta, it was alright. Just overall not as good as they use to be!",
   "We had great service, the food came fast even though they were very busy. It was prepared perfectly and well displayed on the plate.  The amount of shrimp for the price was outstanding.",
   "Always excellent. Today was above and beyond. Noel was our server and he was polite, kind, and on top of our table in the best possible way. A fully earned 5 stars.",
   "I ordered the captain's plate. My friend ordered the shrimp.  Both were excellent in flavor and the amount was huge. The dinner salad was awesome.  Very high quality lettuce.  Service was very good.  I will be back, for the quality, value and service it was well worth it.",
   "My church had a Christmas supper There. Over a month ago customer service was great. Went to this establishment. A few months back after Christmas and they had a dish on the menu called jambalaya and being from south, Louisiana It sure wasn't jambalaya. Was a pasta dish. Not jambalaya And their prices went up. And their portions downsize tremendously. But the food was okay. In the customer service. Was all right."
  ]
 },
 {
  "name": "Bari Restaurant and Bar",
  "address": "136 High St SE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d70951fa-9333-11ea-82d5-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7258403327697788122",
  "source": "GoogleMaps",
  "reviews": [
   "Love this place. My first experience started out hanging with a friend, and ordering a bunch of appetizers during their happy hour. The food is delicious. My husband and I visit a couple times a month. We love the bone marrow appetizer which you can then take a whiskey luge from. Friendly and knowledgeable staff. The owner is also very friendly and loves to chat with us. Also a nice diversity of beers and cocktails. Love the pomelo cocktail.",
   "Went to birthday dinner with friends who went for the first time. They were wowed. From calamari and shrimp appetizers, mojito and old fashions, to the special pork chop and salmon, every bite was flavorful and scrumptious. The salmon was rolled with shrimp layered on grilled vegetables on top of mashed potatoes about six inches high. No room for dessert. Owner Bruce is always friendly, welcoming and informative.",
   "Bruce, the owner, was also our bartender, and was awesome.  Great cocktails.  House made bread...so good, we bought an entire loaf to take home, which was made fresh while we waited.  Beet salad was fabulous.  We had the specials for our entrees...flank steak with blue cheese and mushroom glace, and the mushroom ravioli.  Superb!  We will be back.",
   "Excellent drinks, fantastic service and tasty snacks. I am interested trying all of the cocktail specials. It was hard to choose one!",
   "Excellent food and service! Meghan was our waitress and was very attentive! Best charcuterie plate and cheese plate in Salem that I have had so far!"
  ]
 },
 {
  "name": "Nagoya Japanese Steakhouse & Sushi",
  "address": "3760 Center St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d761d2ac-9333-11ea-bb71-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "free",
   "eat",
   "delicious",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1927083096221053595",
  "source": "GoogleMaps",
  "reviews": [
   "This place is so fun! We brought our kids (8&6) and they just loved the entertainment and the food! My husband and I also get to enjoy a nice time out to a restaurant (which is uncommon) because the kids just love everything going on! You get to watch all the chefs prepare everyone's meals as well so it's a blast. The food is GREAT and the sushi is fresh! (Sorry about the pics, they were a last minute thought because the food was too good!!!)",
   "We were completely wowed by our experience here . They were abled to accommodate my Gluten Free  needs. Everything was so flavorful.  We will definitely be back here to explore more of the great Flavors Nagoya has to offer.  Both plates are the Nagoya Special  with one being scallops and the other Shrimp.  We tried the live oysters and were not disappointed in both presentation and flavor.",
   "My grandson wanted to celebrate his birthday and he picked this place out. I have never been a fan of this place, and especially since a few years back one of our local stations did a segment where they had rodents in the place. The chefs are great. it's the waitress staff that have no clue what customer service is all about. there was 14 of us and one grill. I had about 12 inches of space to eat. They first had us at two tables and moved us to one. I told my daughter we should go elsewhere. but she said her son picked it. So we stayed and I did not order anything, because if I am spending $30.00 on meal. I want to have elbow room and not be bumping elbows. My two cents and I will never go back there or would ever have a meeting with others there.",
   "I always love coming here. The sushi is fresh and delicious, and the beauty of the presentation is delightful. On the hibachi side, the food is always cooked to perfection, and their fried rice is the best I've ever had. The chefs are entertaining, if a little predictable if you've ever been to a hibachi place before. Prices are perhaps premium, but what you get I believe is worth it.",
   "An impressive dining venue, offering table dining, group hibachi dining (and, I believe, a bar?); a seemingly vast menu of food and drink; and, foremost, a very friendly and attentive staff. My first dining experience here guaranteed a repeat visit. Per the photos, the quality exceeded expectations; from the rice, to the tempura and battered chicken, everything was savory and rich in flavour. Strongly recommend the pear sake. I wish this restaurant long-lasting success."
  ]
 },
 {
  "name": "China Gourmet",
  "address": "1405 Broadway St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d7af2f54-9333-11ea-a4de-14b31f159f22.png",
  "tags": [
   "kids",
   "eat",
   "food",
   "food",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2328478311548933860",
  "source": "GoogleMaps",
  "reviews": [
   "Our favorite Chinese restaurant in Salem (quite possibly our favorite restaurant in Salem - we've truly never had a bad dish). Our kids eat all the vegetables here, even big chunks of onion, and we credit them with expanding our kid's palates to enjoy more veggies. Tip: they don't joke around with spice, so go mild if you aren't sure, or, try their non spicy dishes first. Some of our favorites are cashew chicken, shrimp fried rice, chicken mushroom noodle, garlic sauce anything, and the curry fried rice (amazing). This is not the greasy, gloppy, MSG laden Chinese dishes you've seen elsewhere in the States - this place is truly perfect.",
   "Amazing, friendly service and great food. \n\nEdit: Still the best place to go get Chinese food love this place",
   "This is possibly the best Chinese food in Salem, a true gem. The first thing I noticed about the food is how incredibly fresh the produce tastes. The service is super friendly and the restaurant is warm and intimate. Plenty of vegan options as well. Do not skip out on this place!",
   "I’ve driven by this place many times and finally tried it on the recommendation of a friend. I ordered a takeout meal and my wife and I enjoyed it very much. My order consisted of BBQ pork, pot stickers, broccoli chicken, and their crispy gourmet noodles (with BBQ pork, chicken, beef, and shrimp). I will definitely order another takeout meal from China Gourmet the next time I’m heading home from work and hungry for Chinese.",
   "Best Chinese in Salem. This unassuming place had the best food in town. As soon as you order you can hear the cook working the wok and in a few minutes you will be tasting the best Chinese to touch your lips."
  ]
 },
 {
  "name": "Almost Home | Restaurant and Steak House",
  "address": "3310 Market St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d7f50b50-9333-11ea-9de5-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17291865233179701604",
  "source": "GoogleMaps",
  "reviews": [
   "My wife and I went here yesterday for breakfast and had a very nice meal. For the two of us we got two meals, a pancake and coffee. We ended up paying $18 plus tip.  It was far better than Denny's, but it's still very much a standard cafe and similar to Shari's pies. Our server was very attentive.",
   "Great place to eat while staying across the street at a hotel on a very rainy night during a road trip. Friendly staff.  Good, hot food.  Comfortable atmosphere.  Even packed us up a desert for later at the hotel.  Hometown good food.",
   "This is a great little breakfast spot for a hearty meal to start your day off on the right track. The homemade biscuits and gravy are simply the best that I've ever had! The put a sausage patty on each biscuit half then smother it with creamy gravy.",
   "Very impressed. Bryce the waiter was exceptional. Super efficient ! Great food, great service. Definitely coming back next time I'm in town!",
   "Nice improvements are being done to place!  All employees work hard. Prices are a bit high for portions of food received. Food is good, service is quick!"
  ]
 },
 {
  "name": "Flight Deck Restaurant & Lounge",
  "address": "2680 Aerial Way SE, Salem, OR 97302, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d84d8c00-9333-11ea-87c3-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "delicious",
   "kids",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8841567726597134979",
  "source": "GoogleMaps",
  "reviews": [
   "This little gem in Salem, Oregon is one of the places my wife and I will frequent whenever we are in the area.  It's kind of out in the middle of nowhere but that's one of the great appeals of this restaurant.  It sits right on the runway of the Salem Municipal Airport and has been open since the late 1960's.  We love to go there for dinner mostly but have been there a few times for lunch and even brunch.  My wife loves the homemade meatloaf and Chicken Marsala.  I am a HUGE fan of the Chicken Almond Crunch!  I get that almost every time we go for dinner.  \nIt's a shame at the moment that we are devoid of being able to frequent our favorite eateries. So, while I have some free time, I am happy to post some reviews for places I had been meaning to for quite awhile.  \nMy wife and I have never had a bad meal here and the atmosphere is casual (Very \"aeronautic\",  when you sit in the dining area, you will immediately know what I am talking about.), the staff is super friendly and occasionally even the guys in the kitchen have a good time.  They have a full-service bar with cocktails that do not disappoint!  When you enter the building you are sitting on the second floor overlooking the small airport where occasionally you get to see small airplanes both come in and take off from.  In the spring and summer it's especially nice in the evening as you also get to see the colorful sunsets as well.  Overall this is a wonderful spot with BETTER than average food, good service, nice views and a casual atmosphere.  If you are ever in Salem, my spouse and I highly recommend checking out the Flight Deck Restaurant for any meal!  YES, they have happy-hour too -  from 4 to 6 pm, M-F if I am not mistaken.  Might want to check the website to verify.",
   "I love the setting and the atmosphere!  I really enjoyed the view!  Very nice open space!  Good energy all around! The Flight Deck Scramble was so good!  Very fresh veggies!  A perfect egg scramble!  Very delicious!  Staffs were super friendly and nice!  It was a very enjoyable breakfast with great location!  Excellent service!  I will be back!!",
   "The location is a bit obscure, but I'd go back. The food was very good and pleasantly plated. I thought my sandwich (Off the Runway Melt) was a bit small, but it tasted great.\nThe plane/airfield theme is cute and it could be fun to bring kids. When we were there (lunch on a Thursday) it was almost empty. The wait staff were very pleasant and accommodating. Apparently my parents have been going here on dates for years, so I guess it doesn't ware out too quick. \nI'll definitely be going back sometime.",
   "Love coming here . People are great food is good. We are staying home now tho. Cant wait to come back  Looking forward to seeing you all again as soon as we can!!",
   "Had breakfast here and the biscuits and gravy were absolutely scrumptious. The biscuits were fluffy and moist. The bacon was crisp and not too salty. And our server Jackie was so friendly and helpful(so was the other server Blake) despite being swamped. They worked as a team to make sure everyone had their order and was satisfied. I would give the servers 10 stars if I could!"
  ]
 },
 {
  "name": "La Hacienda Real",
  "address": "3690 Commercial St SE, Salem, OR 97302, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d891e82c-9333-11ea-802b-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3786965256940036832",
  "source": "GoogleMaps",
  "reviews": [
   "The food is terrific! Service is only slightly less than terrific. The staff is always friendly. Tables for groups are packed a little too tight. I'd suggest eating there anytime but not in a group. Truly a great place to eat.",
   "Margarita is the best in town for flavor.   Food was hot and fresh however a bit lacking in seasoning.   Would like to return to try other dishes.  They have so many choices and there are excellent explanations in for each dish in their extensive menu.",
   "We were seated promptly, server gave us just enough time to make up our minds - but did not make us wait too long to return and take our order. They did not mind that we took our time and talked with our family who we had not seen for some time to catch up. Some green sauce was requested instead of salad dressing for one of the salad, it never arrived with the meal. The server did finally check back after the salad was almost done being eaten. This won't stop us from visiting again.",
   "Good food.. Friendly staff.. The prices are a little high but the portions are huge... Prepare to be served a big plate.   The menu is like a book though- alot of options hard to decide.",
   "We love this place. It has the best flour tortillas ever. Great friendly service. It is a bit of a drive from where I live, but the food is amazing."
  ]
 },
 {
  "name": "White's Restaurant",
  "address": "1138 Commercial St SE, Salem, OR 97302, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d8d755ae-9333-11ea-b2a4-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "affordable",
   "delicious",
   "drink",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14095886273820181954",
  "source": "GoogleMaps",
  "reviews": [
   "This was a great place to eat. It was a very affordable restaurant with good food. The staff was welcoming.  The restaurant was clean for an older restaurant.  The bathrooms are small and pretty clean. The pancakes where fluffy and delicious. I wasn't impressed with the corn beef hash. It was okay but I've had better. Food quality is good and the prices are even better.",
   "We had the best experience! When my niece has a sleepover, we always go somewhere she hasn't gone for breakfast the next morning. On a Sunday, we arrived with my 2 year old in tow. We picked our table and were quickly greeted by our waitress who brought water and took our drink orders. Without even asking she put my son's juice in a cup with lid and straw. She even brought crayons and a coloring menu even though we'd brought him things to do\n She even asked beforehand. It was so respectful.\nWe placed our orders and holy cow everything was delicious. My niece raved about her french toast with crunchies! I had the 15 1/2 and was so happy. The sausages were a bit spicier than expected but still tasty. \nI am so glad our tradition brought us back to White's. It was a really great meal and so comfortable. We will be back again for sure.",
   "I've been searching for a good diner and have not had luck in Corvallis, but I will absolutely make the drive up to White's when I have my next craving! The turkey club was everything I wanted it to be: super buttery perfectly toasted sourdough, delicious oven roasted turkey, and crispy bacon. Service was very friendly, too! No wonder they've been open since 1936! Can't wait to go back and try breakfast 😋",
   "Whites is fantastic! Friendly staff, great food and a small town cafe feel. Lots of regulars, but friendly to new faces. I felt very comfortable and welcome. The omelets are filling and yummy and the hash browns are crispy but not burned. Loved it!",
   "Always friendly and the food is great. My wife and I get Don's big mess and split it with a pancake on the side and always leave full."
  ]
 },
 {
  "name": "Venti's Cafe + Basement Bar",
  "address": "325 Court St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d924d9f8-9333-11ea-8633-14b31f159f22.png",
  "tags": [
   "free",
   "tasting",
   "food",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10471053064507061119",
  "source": "GoogleMaps",
  "reviews": [
   "Vent's Cafe Basement Bar is a wonderful treat in Salem.  The beverages are excellent, great beer and wine selection plus a full bar.  The menu provides an outstanding selection and variety, generous portions, and reasonable prices.  When you step down the stairs and enter Venti's Basement Bar you truly feel as through you are stepping back in time to the era of prohibition and the speakeasy.  Give Venti's Basement Bar a try, you'll be coming back for more.  If you find the review and pictures helpful, please give them a like! Thank you",
   "A friend recommended Venti's for the vegan options, and I was pleasantly surprised when I walked in and found three separate menus, one regular, one for vegan options, and one for gluten free options. It made it incredibly easy to find something to order and be certain that it was vegan. We ordered the chorizo burger with tots and the grilled cheese with spicy tots. The food was exceptionally good, and the service was top notch. The tap list for beer had over 20 options and they offered pints as well as imperial pints. Overall I really enjoyed the restaurant, the prices are a bit higher, but after tasting the food I would say it's worth it.",
   "I came here tonight with two friends. The atmosphere was really cute and had a really nice flow to it. We walked up to the register to order, I got the spicy Mac and cheese, my friend got the plain Mac and cheese, my other friend got a mushroom blue cheese burger, and we ordered an appetizer of spicy tots. The wait wasn’t bad at all, our food arrived about 5-10 minutes after we ordered. Although the food wasn’t bad, it wasn’t super great either. My spicy mac was spicy, but had very little flavor. I feel like it definitely needed some thing. One of my friends said the same thing about her plain mac, saying that she thought it lacked salt. My other friend said his burger had great buns, and sauce, but again said it lacked seasoning. However, the spicy tots were amazing and I would definitely come back just for those.",
   "Venti’s has an awesome menu for vegetarians, vegans, and meat-eaters! Their artichoke spinach dip is amazing and their bowls are tasty, too! Plus, they always have a good beer on tap. I can’t wait to go back!",
   "The food was spot on. The staff- -front and back--are concerned with making good, healthy, tasty food. \nHuge selection of options on three menus  (Paleo, gluten free and non restricted)\n\nThey have entertainment and a full bar.\nNoisy as all get out, even on the Monday evening we were there. College aged crowd.\n\nWe are from out of town, the restaurant and business district is an interesting and tasty visit."
  ]
 },
 {
  "name": "Busick Court Restaurant",
  "address": "250 Court St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d9860cc6-9333-11ea-b466-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3803949121175493757",
  "source": "GoogleMaps",
  "reviews": [
   "Really good food. Big portions as well. We had to wait for a while to get our menus  because our waiters were busy talking but other than that they were friendly and it was good.",
   "I was seated immediately even though the place was crowded. The food was hot, filling and flavorful. The prices are decent. Good service. The first impression as a first time customer, Busick Court Restaurant is quaint and has a very historical ambiance and decor. I had the Chicken Fried Steak, Eggs and Fried Potatoes with Coffee and Toast. My breakfast was delicious.",
   "The environment was very pleasing.  It made me feel very welcome.  A very charming little place.  The food was exceptional and the service was very good too! Will definitely go again.",
   "The food was delicious, the place was packed with people & we enjoyed our time with sisters for brunch 😊",
   "Finally got a chance to give this place a try. We arrived Saturday a little after 10am I believe. Waited around 15 minutes for a table, service was great, we received our drinks and placed our orders shortly after sitting down. \n\nI ordered the Chorizo Rancheros. It was wonderful, great flavors, nicely sized portion. I chose biscuits and gravy as my side. Awesome biscuits and gravy I must say. Super tasty gravy with a fluffy light biscuit. I'd definitely be back to try some of the many other items off the menu."
  ]
 },
 {
  "name": "Venti's Cafe + Taphouse",
  "address": "2840 Commercial St SE, Salem, OR 97302, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d9cd7778-9333-11ea-973f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "free",
   "food",
   "brewery",
   "food"
  ],
  "link": "https://maps.google.com/?cid=43825044470117573",
  "source": "GoogleMaps",
  "reviews": [
   "I've never eaten here before until the other day and now I've been here twice.   You guys if you like health conscious food made to order by passionate people, this is definitely a must go to.  I was absolutely shocked that I got these 2 fish tacos for only $8.25. If you were in Portland these would cost you $12 all day long just for 2 tacos.  Organic corn tortilla with amazing fish and toppings.  This is definitely my new go to spot for beer and food. Service is spot on without being overbearing and the place is really trendy on the inside.",
   "This place is amazing! Great parking, easy to turn into and get out off. The atmosphere is intimate but fun at the same time. It's a bit like Cheers! Hang around on a Monday night for trivia, it's a hoot. The food is great. Many options for those that have dietary needs or specialties. Great selection of Taps as well that rotate and you have the option to fill a growler. Thank you Venti's!!!!",
   "I can't recommend this place enough. The sweet potato fries are the best I have ever had. Every meal I have had here has been so delicious! I love that they offer the Vegan Beyond Burger. They have lots of meat free and gluten free options. Staff is really friendly. Amazing restaurant.",
   "Nice comfort food with lots of vegan options.  The \"burger\" with Beyond Burger was really good and of course, tots are always great. My wife tried the street tacos and they were good but I don't like how you can't mix and match (they said we had to get two of the same).  Great beer on tap from local brewery and the vegan nachos were good but we ate way too much food.  I would recommend this place and look forward to hitting it up again the next time through Salem.",
   "The food here never fails to disappoint. Plus the play area is wonderful. Normally at restaurants it can be difficult with small children especially overly hyper ones but not here, I can go over and he can play with toys while we wait for our food. Staff have always been extremely friendly as well!"
  ]
 },
 {
  "name": "Gerry Frank's Konditorei",
  "address": "310 Kearney St SE, Salem, OR 97302, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/da16dba4-9333-11ea-84d1-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2211313563620338983",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped here for dessert on a recommendation of a friend. Oh My Goodness! We ended up having half a sandwich (egg salad which was delicious) & a cup of soup (spicy asparagus which also was delicious and not terribly spicy), plus a chocolate cake with butter, mocha, chocolate mousse for  filling & frosting for dessert. My friend and I split the cake because the piece was huge! We also had a hot mocha to go with our cake. Everything was fresh and delish. The employees were all very friendly and helpful. And the atmosphere is so cute. We will definitely be going back & recommending it to our friends.",
   "My wife and I came for desert because of people telling us how good it is. They were not kidding. I had carrot cake and my wife had chocolate peanut butter mousse tort. Both were awesome. We'd definitely recommend a stop here. We plan on stopping again to check out other things on their menu. We had excellent attentive service by a young waiter. No question about leaving a good tip for him. Smaller  place but well worth the visit",
   "Colorful, bubbly little cafe with superb desserts. The mounds coconut chocolate cake and the mocha almond mousse torte are fabulous! \nWe were seated quickly and had a pleasant waitress.\nIt is well worth your time to drop by this charming shop.",
   "Very friendly service.  The lunch choices are many and are so well done.  The desserts are very high quality, numerous and of great variety.  So much so that my child choose a cake type he'd never had - coconut puff.  This is a fun way to try new things! The interior is very clean and gives the impression of a European bistro though my use of the French word is incongruous with the fact it is modeled after a German cake store.",
   "You have to try all of their dessert selections! \nMy group got 4 different cakes, and it seemed like each one was better than the last. \nThis place maintains a small town cafe feel and it seemed like everyone knew each other and was very friendly. \nTheir savory food items were spectacular as well. All around, a great place to eat and catch up with friends."
  ]
 },
 {
  "name": "Pietro's Pizza Salem",
  "address": "1637 Hawthorne Ave NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/da5d3368-9333-11ea-8f5b-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "delicious",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=18241438793377577794",
  "source": "GoogleMaps",
  "reviews": [
   "This place is a good value for the family friendly crowd. Their pizza is good if you like a thin crust pizza. Say have a small salad bar also available. The staff are hardworking, and accommodating. They have an arcade that is discreetly set off to one side of the building so that you can still enjoy your meal in peace without the constant clamour of video games and bells clanging. The miniature golf is actually pretty well done. The lighting and sound effects Are great. And there laser tag arena is really quite good. Overall, we've had some fun nights there with the kids. And some pretty good pizza too.",
   "So much fun!  Laser tag!  Putt putt glow in the dark 3d!  Arcade and ticket prize booth!  Pizza!  We had 3 birthday parties here, lots of fun!",
   "Our first time to this place first impression very well was greeted quickly professional  with a smile. They claim to be  the number one pizza place, sadly I disagree little bit of a high price on the pizza, and sadly they don't offer any specials.\nThere macaroni and cheese is served at room temperature I had to ask them to heat it up which they happily did. \nAbout the salad bar, my wife and I were waiting for this young man to clean it up and refill and as he did he took his sweet time as if no one was around and at the end he did refill them but then he didn't clean on the surface. We will try them again so hopefully we'll have a better experience.",
   "Really interesting place! My first time. The pizza was really good but the games were par. Only did the games, didn't do the put-put or laser tag. I had the 3 yo with me and she only liked 1 game that started eating coins.  If your kid is over 8ish then will enjoy the games.  Under 6, not so much. Overall,  great people, really helpful.  Nice place.  I would go back, especially when she gets older.",
   "I was really hesitant about dining here after reading the reviews, especially for my sons birthday. I tried looking for other venues & am so glad I failed!! \n\nWe had a wonderful time!! The venue was clean and inviting. Plenty of seating for big parties with room for the kids to run without loosing site of them. \n\nI whole-heartedly recommend the Mediterranean Pizza as one of your choices. It was so delicious!! The prices were better than I even planned for and the pitchers of drinks came with 5 refills! \n\nThe family had a blast and we will be back!!"
  ]
 },
 {
  "name": "Yan Yan Chinese Cuisine",
  "address": "3305 Lancaster Dr NE, Salem, OR 97305, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/daae60f6-9333-11ea-b39d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12496861225644512944",
  "source": "GoogleMaps",
  "reviews": [
   "I've been coming here For 6 or 7 years and they are as polite and fresh as ever. Great quality for the price, the best you're going to find in Salem that still allows combination meals and special requests. Theyve never messed up one of my orders or made me feel like they were too busy to serve me . Love supporting this business!",
   "Placed a to go order 40 minutes before closing and still fresh as if they had just opened.  I really appreciate that because I was super hungry and wanted a good meal to end the day and they didn’t let me down.  And for everything you get with the orange chicken dinner special is GREAT!!! Soup always comes with. A++++ 1",
   "My boyfriend and I got take out for our 3 year anniversary. This is our favorite restaurant and we've been coming here for about 3 years. The staff made everything really simple and easy for ordering and pick up. The food was still amazing and fresh by the time we got home, and the portions were so big that we even had enough for seconds the next day!",
   "Yan Yan is our go to restaurant when we're in Salem, OR. I'm always amazed at the quality and quantity of food for a ridiculously low price. Food tastes fresh and is never over-sauced. Service is excellent and efficient. We always take home half our order for a later meal. We always leave a big tip since it is such a great bargain. We want them to stay in business.",
   "This is an American style Chinese restaurant. Decent food decent prices. Good staff. Seems to be busy with lots of patrons. They accommodate well and are friendly with kids and families. It is our go to restaurant for Chinese style food."
  ]
 },
 {
  "name": "Thai Cuisine of Salem",
  "address": "2916 Commercial St SE, Salem, OR 97302, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/daf41c9c-9333-11ea-8f6f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "family",
   "food",
   "delicious",
   "free",
   "music",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=9122085442743785016",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome food! Love getting my Thai food fix here. Their curries are very good. Right on point with the spice level I ordered.\n\nThank you very much!!",
   "Absolutely amazing food! Great service! I will be coming back!",
   "Not the best thai food I've ever had, but it was really good. I will be coming back purely because I have a lot of vegan friends and they have an expansive vegan menu and even offer multiple plant-based meat alternatives. The service was also super friendly. Happy to see more places cater to vegan folk and have a menu they can order from without having to go through all of the substitutions and worry of the kitchen forgetting about them. Very exciting to have a place where people without dietary restrictions and plant based folks can feel comfortable and welcome :)",
   "We looked for a place with variety and vegetarian, vegan and gluten free options. This place was perfect. One person had vege stir fry that was not spicy, one had a noodle vegetable dish with a pinch of spice and one had yellow curry that was delicious. Everyone was pleased and there were so many more options to try on another visit. The owner was willing to customize a dish to specific food sensitivities and the dining area was tastefully painted with attractive paintings and quiet background music. We will definitely return and make this a regular spot for dining for our family.",
   "Very cute and cozy Thai Restaurant on Commercial. The Pineapple Fried rice and Thai iced tea were very flavorful and the appetizers were delicious. Definitely worth a visit!"
  ]
 },
 {
  "name": "Kim Huong Restaurant",
  "address": "2950 Silverton Rd NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/db68fecc-9333-11ea-b665-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "kids",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17377455080337970358",
  "source": "GoogleMaps",
  "reviews": [
   "This is a decent place with a handful of vegetarian options. We had the crispy veggie rolls. They were tasty and came with a pretty standard sauce. For our meals we had Spicy Tofu with Lemongrass and Tofu with Mixed Vegetables. Both were good, but the sauce on the Spicy Tofu was amazing - it has peanuts, though, which weren't listed in the description. It was fine for us, but wouldn't be for everyone. The rice seemed as though it had been sitting for a while - a little hard and not easy to break apart with chopsticks.\n\nChopsticks are available, but you may have to ask for them. Same with hot tea. They prefer that you order by number, not by the name of the dish. They brought fortune cookies with the bill.",
   "I have eaten here many times over a couple of decades, and while the menu has changed some, and prices have crept up some, the food is always outstanding. The vegetables are always fresh and crisp, the sauces are always mouth-watering good, and every dish is just right. This is a family owned and operated place where the family clearlr cares about getting it right. I have eaten at Vietnamese restaurants around the US, especially the DC area, in Europe, especially around Cologne, and while I have eaten at some other good places, and I have eaten at some way more expensive Vietnamese places, I have never eaten at one I would say is better than Kim Huong in Salem. Always plenty of room to park, and one can easily get a good meal and not be late getting back from lunch.",
   "Showed up here 40 minutes to closing on a Friday and this place was busy. That's the sign of good food.  We ordered and got the food pretty quick. Very enjoyable I would highly recommend.",
   "Sorry, were hungry enough to start eating and not enough time to snap our ordered dishes before they got “torn up”.  Kids loved the food, wife and I as Pho lovers approve it here as well. Portions aren’t huge, but I believe that’s perfect to keep one from overeating, considering that we did it even finish ours. Sunday night they were full of clients, to me it just means that this is a proper place with good eats! If you want 5 star everything, go to a brand new construction spot with fresh paint and new toilet fixtures, this is a good neighborhood spot, seems to be served by owners themselves!",
   "Been eating here for years and the food taste just as good. The pho is very delicious perfect for cold weather or anytime you’re in the mood for a good soup, the roasted chicken is also a great dish they serve. It comes with rice and some sauces. The spring rolls are a great appetizer they’re good in size and the peanut sauce that it comes with it good too."
  ]
 },
 {
  "name": "Cuisine India",
  "address": "1220 State St, Salem, OR 97301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dbc2041c-9333-11ea-9915-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1507874121829018886",
  "source": "GoogleMaps",
  "reviews": [
   "Love this place. We go there for buffet lunch several times a month. The food is very very good and there are enough dishes to choose from.  The price is great also. We have never been there when it was not packed which tells me that so many others love it too.!😁",
   "Very clean, excellent service. Fast delivery. Indian tea w/milk was tasty. Rice very good. Naan with vegetables (#69) excellent. Chicken dish with vegetables (#39), my main course was disappointing. The chicken texture was rubbery, like boiled vs baked and the vegetables WERE FROM A FROZEN BAG OF MIXED VEGGIES! As an organic gardener whose main diet primarily consists of fresh, organic veggies, i was very disappointed in the dish. The sauce tasted like curried stew gravy. Don't think it was cooked fresh for my dish. I would rather wait longer to eat, and be served fresh food. I will try this place again with friends who like Indian food. The prices were very reasonable. About $23 which includes the tip. The owner nor cashier said thank you, or asked me to come back soon. I looked at him to say good bye, he shifted his eyes away. Awkward.",
   "I ordered for pickup. Quantity and quality is very good 👍 so yummy 😋 \n\nGoing to visit again",
   "Good Indian restaurant in Salem. Low prices and huge quantities. Their tandoori is great. Most of the items were kind of bland, may be due to lack of more Indians in the city. Good wine collection though. Their buffet options are really good, must try. Too many varieties at a very low price. Over all good restaurant, just a little more desi touch needed in taste.",
   "I often take my friends to this place with my highest recommendations. I  go to this restaurant often. This recommendation is always successful. The dishes they serve are flavorable and the crew is welcoming and cooperative. always when we go to this place we enjoy a delightful evening.  I warmly recommend this restaurant."
  ]
 },
 {
  "name": "Epilogue Kitchen and Cocktails",
  "address": "130 High St SE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dc05462c-9333-11ea-980a-14b31f159f22.png",
  "tags": [
   "creative",
   "adventurous",
   "food",
   "unique",
   "eat",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16599287575792726017",
  "source": "GoogleMaps",
  "reviews": [
   "Go support local businesses and have good inspiring interesting food and cocktails. I love that the kitchen is right upfront, highly visible chef etc. Because the dishes are varied and creative some do miss the mark for certain palates. But life is not about eating the same thing over and over. Be adventurous and open to new things. The staff have also been really nice on both visits. They do have a full bar and again some very creative drinks. We had a cornmeal cocktail and it was wild. Not my favorite but I def went back for more sips. I recommend sharing with your group. Go support local. They also do a discount if your seeing a show at the Elsinore.",
   "Excellent food, quite a unique menu.  This place is a hidden gem, right under your nose downtown.  Definitely check out this owner operated business.  The owner is an awesome, friendly guy, who you will usually catch behind the grill.  I highly recommend this as a Salem must eat.  Try the Western Philadelphia Cheese Steak!!",
   "The service was prompt and kind. Very clean atmosphere. Small- but quaint. Perfect for our table or 4. Appetizer were FAST! Drinks were chilled and quick. Dinner options are unique and so full of flavor and color. I will return for sure. Great date night spot. I was impressed.",
   "Have tried this place twice. Both times have been an excellent experience. Prompt, friendly service, great cocktails and tasty food. Tried the ox tail and the crab cakes. Both were fantastic!",
   "It's fried chicken week!  Crispy and tasty!  Has good flavors!  Very good!  Wonderful service!  I like the biscuits too!"
  ]
 },
 {
  "name": "The Coin Jam",
  "address": "439 Court St NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dc516aa6-9333-11ea-8dbb-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8936172138352656194",
  "source": "GoogleMaps",
  "reviews": [
   "Great place 21 or older arcade! Tons of older and some new arcade games. Fair prices to play. Food and drinks are also tasty. For people playing the games there are two change machines and an ATM. Just a good place to hang with friends to have a drink and play some games!  There always seems to be a different arcade here when I drop in. Also for all those Pokemon Go fans there are two pokestops near by that can be swiped 🙂",
   "What a trip to your 1980's childhood! Food seems to have a Scottish flare. It's good. Good beer selection. They have coin dispensers. It's easy to spend money there!",
   "So much fun and a great group of people we were lucky to have behind the counter. I had a big ice cream cake for my partners birthday and they cleared out their freezer to stash it for me, cut it and brought out the plates and silverware. We'll definitely be going back for some more memories.",
   "A really awesome arcade and bar. So many really fun vintage games and newer ones. The staff there is also super nice!! The only thing I wish is there were a few more non-alcoholic drink options, but it was such a blast it didn't bother me that much. And the rootbeer I did get was very tasty. Highly recommend if you're looking for something fun to do.",
   "As with all arcades it's a little on the noisy side, but they got a decent pinball selection and I would figure pretty good on the alcohol too. Food is above average"
  ]
 },
 {
  "name": "Sybil's Omelettes",
  "address": "2373 State St, Salem, OR 97301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dca900b8-9333-11ea-98ef-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2417359258329903427",
  "source": "GoogleMaps",
  "reviews": [
   "I'm not personally wild about the omelettes, but this place has a lot of other things to love.  The coffee is the best sit in in town for starters, only two places all my life I can take the coffee black and Sybil's is one of them.  Their lunch sandwich options are phenomenal as well as the restaurant made dipping sauce that comes with all their fry options.  I haven't had a chance to try all of their options yet but give me some time and I'll be sure to catch up.  😉",
   "Really welcoming, busy place. Solo but didn't feel odd or left out. Generous food portions, lots of choice. Staff very helpful and cheerful.",
   "Great family place for down home good food. Every  omelet combination you can think of plus the diced ham with cream cheese and eggs are really nice. I normally just let my wife order a meal and I'll get a Waffle because they are the best and the portions are big enough that my wife shares her leftovers.",
   "Food was delicious. Portions were smaller than the last time I ate there. Way too crowded. Tables were too close together and at one point I had to move the entire table into the walkway to get out from between the tables on either side of us. Very loud. It was hard to have a conversation. But... the food was still delicious.",
   "Wow!  The place might not look like it, however the food was delicious,  service was great, portions are huge and the staff is friendly."
  ]
 },
 {
  "name": "Olive Garden Italian Restaurant",
  "address": "1302 Lancaster Dr NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dcf85a9e-9333-11ea-84c3-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1711236406453762794",
  "source": "GoogleMaps",
  "reviews": [
   "Today was our first time doing pick up. We were so pleased with everything. It was all packaged nicely. I mentioned extra peppers for the birthday girl they gave us lots. They also added a birthday dessert that said Happy Birthday on it. And with all the Covid precautions going on theirs were superb. Thank you so much we will do this again.",
   "Best deal is $12 all you can eat pasta. They have $5 drinks, $5 take home entrees. I recommend the meat sauce or a blend of the garlic and mushroom sauce.  Coffee is great. Salad and bread sticks are a favorite.  Tiramisu and cheesecake are excellent dessert choices.  Coming here just for coffee and dessert is an option.\n\nIt's a good to great experience depending on your server, but we seem to usually have great servers. And that puts it at 5 star awesome because the service and food are consistently great.",
   "my wife and i have had the pasta pass for the past 3 years. its a great deal and we love coming to olive garden. they have a great deal on pretty good pasta. have always had great service and with call ahead seating haven't had to wait more then 10 minutes usually if its really busy. i chose 4 stars today as one thing i do notice is that the consistency of the food is not great. one day its super hot and fresh and cooked right, and the next day its under done and cold. one day its SUPER saucy and the next it may be just right. its a little issue but its not one that has stopped us from coming and loving it.",
   "Not bad. My server was great. He was very friendly & attentive. He also made sure to explain everything & show me in detail how everything worked (the tablet like devices they have on the tables) as I've never used them. It was a pleasant visit & the food was good. Not great but good.",
   "Went on New Years Eve. Even though the place was packed, they staff were calm and happy in the busy atmosphere. Our waiter was awesome and attentive. We didn't have to wait long to be seated or get our food and quick refills. Despite how slammed they were. So impressed and love this place!"
  ]
 },
 {
  "name": "Geppetto's Italian Restaurant",
  "address": "616 Lancaster Dr NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dd42824a-9333-11ea-a2d7-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "food",
   "kids",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16889087021473050828",
  "source": "GoogleMaps",
  "reviews": [
   "I've been hearing good things about Geppetto's and finally got the opportunity to visit. The food was fantastic and the service was friendly and timely. We sat in the bar because the dining room was full. Not going to complain about that. The bartender was friendly and knowledgeable. I highly recommended.",
   "Could this be Salem's best kept secret? I think so! I LOVE Italian food & have tried them all in this area...never found one worth going to twice. Today was Geppetto's turn. AMAZING & AUTHENTIC! The atmosphere, service, & food were outstanding! Definitely the best I've had in The Valley! And that Minestrone soup....it doesn't get better than theirs! The icing on our cake? They DELIVER! I HIGHLY recommend Geppetto's for Italian dishes, and pizza. That meat sauce....🌟🌟🌟🌟🌟!!!",
   "Mediocre and overpriced. We were greeted and seated promptly, our server came out quickly and took our orders. Very polite. Dinner salads were iceburg lettuce, shredded carrots and one cucumber slice. No tomatoes. My family had pasta dishes; portions were fine, but they didn't taste all that great. Flat, overcooked, lightly seasoned. Dinner for two adults and two kids, no drinks was $47. If grandma wants to go out for Italian food, has never left Salem and has never had proper Italian food, this is the place.",
   "Last night I decided to order Geppetto’s for dinner through delivery since I have always been a fan of their pizza. After receiving it and noticing that the experience was not up to par with their usual amazing  quality, I decided to call in and explain what had happened. It’s always scary to call in to give feedback as some people don’t respond well, however my experience was incredible and I want to thank Geppetto’s for an incredible follow through! \n\nI spoke with both the husband and wife owners and was pleasantly surprised with their response. I calmly explained some of the issues with my order and I was told a few things: \n\n1. We are so sorry this happened and thank you for calling in because we would not know otherwise. We take this as an opportunity to do better next time.\n\n2. How can we make this right? \n\nKey factors in running a successful business with return customers! Julie (one of the owners) offered to replace my entire meal ($34 + tip worth) whenever I wanted it, and said she would inform her staff to make sure that they redo my order correctly and make it right the next time. \n\nBusinesses and restaurants are going to make mistakes. No entity is perfect. However, the way you handle your mistakes says a lot about you and the way you run it. I am a very happy customer who will rave about the service I have received. Thank you Geppetto’s for making it right and being so kind in the process. You will always have my business!",
   "The only place I've found in Salem that makes Chicago-style thin crust pizza, which is THE BEST style of pizza. Apparently it's also called tavern-style. I have been so disappointed with pizza since moving to Oregon. I've tried nearly a dozen places. This place is the only place I've found with what I consider really good pizza in Salem."
  ]
 },
 {
  "name": "Lucky Garden",
  "address": "4157 Rickey St SE, Salem, OR 97317, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dd927726-9333-11ea-a3d5-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "food",
   "food",
   "family",
   "adventurous",
   "food",
   "affordable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12989913047422152178",
  "source": "GoogleMaps",
  "reviews": [
   "I have been a long time customer but no more tonight.  I will most likely not go out for this reason.  I called for take out and was told the ‘combos’ were sold out.  Ironically I can order each individual item for 3 times the price.  Now of course I get 3 times the food this way right.  I guess what bothers me most is the customer service has ALWAYS been amazing here.  During the COVID-19 I feel everyone is feeling the pressure and any business experiencing high volumes should be extremely happy to have this available.  My family wanted the comfort of this place at home tonight and I mostly feel disappointed and taken advantage of as a consumer.  I called back and explained you can’t be out of order and in the next sentence be told I can order each individual item separately. I was then handed over to the manager as the original person in the phone understood my concern.  The second person (possibly the manager) explained they were extremely busy tonight and his staff couldn’t handle the extra burden of making combos.  I thanked him for his honesty, and yet still seem just as confused. Perhaps I’m lacking in restaurant experience, but as the customer I’m left feeling it was more about making money in a time the consumer is already “splurging” and supporting local businesses.  Before you call me a ‘Karen’ please know our family order would have been $40.25 with combos, and $72.50 ordering each item separately.   \nLucky Garden, if you care to retain long term customers, make this right, & I’ll happily change my review the moment you do.  I want zero for free, I want to be treated the same as if you were open and had me sitting in your restaurant without stay-at-home orders.   :-(",
   "Best Chinese food I've had in Salem since moving here 3 years ago! Fresh and perfectly cooked. Lots of veggies in the Chicken Stir Fried Noodles and cooked just right. Highly recommended.",
   "This is definitely a place I would take my friends and family! It is soo fresh, and very affordable. One thing I love is the consistency of their food quality as well as the time it comes out. They both serve simple dishes such as sweet and sour pork, or adventurous plates such as salt and pepper squid, both in which they execute perfectly. I highly recommend Lucky Garden!! ❤️💯👌",
   "This is my favorite Chinese restaurant & I treat myself every other week. The food is awesome & you get a whole meal.... soup, entrees, hot tea & fortune cookie. . Lunch specials are the most reasonably priced in town. . Restroom is super clean & the service is exceptional.  Check it out!",
   "I enjoyed the green beans and beef lunch special for under $7. It came with hot tea, soup and a spring roll. THE BEST I HAVE EVER HAD thus far! Everything was cooked to absolute perfection! So Sooo good. I finished everything, savoring each bite. The spring roll was flaky and crispy! Perfect! Perfect service, perfect portions, perfectly cooked-TRY this place!"
  ]
 },
 {
  "name": "Cafe Yumm! | Candalaria Crossing",
  "address": "2755 Commercial St SE #100, Salem, OR 97302, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ddd9925e-9333-11ea-91f3-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12544846194037317601",
  "source": "GoogleMaps",
  "reviews": [
   "Cafe Yumm is my go-to when I’m looking for something quick and healthy. I always get their smoky bowl and am so in love with their sauce that I keep it in stock at my home at all times. It’s so good!!",
   "Average Cafe Yumm, which means it's amazing! Delicious, guilt-free bowls and plates, friendly service at this location too!",
   "Constantly messing up my order. Not hard; vegan and no sauce. Every time, I have to drive back, because there is sauce or sour cream hidden in the middle of the bowl I order. They always apologize and give me a coupon to come back for a \"free\" med bowl, to make it up. Which I appreciate, but it shouldn't be necessary. The food is very good and the temph is really good. But I'm allergic to the sauce and need my food dairy free. It is what it is. The ginger cookies are fantastic, btw. Even with the errors I have in my orders, I still enjoy the food, when I get my correct order.",
   "Really appreciate the outstanding service here at Cafe Yumm in the Candalaria Crossing mall.  They allow almost any substitution so I can get my vegan (dairy free) gluten free meal.  Nice clean tables and restrooms too:)",
   "Quite possible one of the best choices one could make for a healthyish fast food meal.  And it tastes really good too!"
  ]
 },
 {
  "name": "Fuji Rice Time",
  "address": "159 High St SE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/de2ecc40-9333-11ea-aa41-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=4768674650348533427",
  "source": "GoogleMaps",
  "reviews": [
   "We love this place. Although they might not have a huge selection like big places, what they do have is service with a smile and high quality, fresh fish. The latter being the most important at a sushi restaurant. The best in Salem IMHO.",
   "I just had the best sushi experience ever! This place serves delicious, fresh, and authentic sushi. I tried the Ladybug roll and it was phenomenal. Hands down the best sushi place I've tried in Salem!",
   "The Tuna Trail is fantastic! Always great service and fresh, quality food. We tell all our friends who like sushi to go there and have turned non-sushi eating friends into sushi lovers.",
   "Great sushi! Amazing staff. If you are in downtown Salem definitely a place to go and bring the family, they have the room!",
   "Best around! Thanks James."
  ]
 },
 {
  "name": "The Original Momiji Sushi Restaurant",
  "address": "4590 Silverton Rd NE, Salem, OR 97305, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/de8bb9a8-9333-11ea-91ee-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "unique",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10486918788907745775",
  "source": "GoogleMaps",
  "reviews": [
   "Always a pleasure coming back here to the best Sushi in Salem, Oregon.  Thanks!",
   "I've been eating here since it opened. It started off with near perfect food and service then I feel it took a bit of a fall as the original crew slowly left, but they seem to have got it back together. I was very happy with our food and service tonight and will continue to eat here as much as I can justify.",
   "I have eaten here several times over the last 6 years. Usually very pleased with the quality of food received. Except for yesterday I felt like maybe the person who made my food was new? I will post a photo. There is so little ingredients in my sushi roll that there is actually an extra amount of rice rolled inside the seaweed to make the roll \"normal\" sized.",
   "This \"original\" location offers a more authentic/Japenese-styled venue for sushi. If you like restaurants that are unique and homey, this location will feel like a hidden gem; if you like eating in restaurants that are more spacious and contemporary, I recommend their West Salem location. Either way, the food is good and the specials and combos have attractive value!",
   "Been here multiple times over a few years. Used to be very happy with the food and service. Though the last time I've gone and the food I just received today was sub par. Rice was obviously old and mushy, my girlfriends tempura was soggy and under battered. Her sauce was almost vinegar. \nOn top of it, I called in to take out and got put on hold for 10 minutes to get hung up on. Had to call back to place my order.\nSeems the place is going downhill."
  ]
 },
 {
  "name": "Wild Pineapple Grill",
  "address": "1255 Howard St SE, Salem, OR 97302, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ded56d1e-9333-11ea-a71c-14b31f159f22.png",
  "tags": [
   "walk",
   "eat",
   "food",
   "delicious",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=10259442100008070424",
  "source": "GoogleMaps",
  "reviews": [
   "Always look at their website to make sure they are open. The owners do travel back and forth to the islands so making sure that a long trek isn't done in futility, look at their facebook site and verify. This last trip, they put up a new fence around the location. Reminds me of some of the fencing on the islands. It does add to the charm of the place and makes it in my opinion - easily more pleasant for walk ups to sit down and eat.. What is my Friday meal? Poke with brown rice - extra sauce - hot & spicy. Two orders because if I get it and not bring any back for the better half ...... Also a pulled pork bowl with the brown rice. Is this a place I travel 10 miles for? Well, it is 15 miles from my house. Going into Salem on a Friday, I plan on stopping here. Why Friday? That is the only day for Poke.",
   "Staff is what makes this place great. They are so kind a genuine. You can tell they are happy and that they love what they do. Small little corner lot in Salem. For a food truck, the food is great, full of flavor. The menu is kept simple with limited options. Dishes are fairly plain, your choice if bowl, plate, platter or a few others. They also have daily specials. Nice little spot to check out!!",
   "Their Hawaiian food is so Delicious ! The people making it are the sweetest.. Thank you",
   "Wonderful Tri-tip stew...I was recently told by a Chinese Medicinal Masseuse that I eat too fast. But, I truly couldn’t help it with this dish mmm mmm mmm",
   "If memory serves, the owner is from Maui.  That's a great way to start authentic grinds.  We've tried Hawaiian time and it was doodoo on a platter.  So, husband was almost hesitant and still very hopeful.  He got kalua pig and a poke bowl.  He was in paradise.  He ate it fast."
  ]
 },
 {
  "name": "Garibaldi | Mexican Restaurant & Cantina",
  "address": "1111 Edgewater St NW, Salem, OR 97304, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/df19cb46-9333-11ea-8ae2-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12570626806142979057",
  "source": "GoogleMaps",
  "reviews": [
   "Quick dinner before a show and it was ok.. Average eats for a Mexican restaurant. Ordered the 3 tacos was hoping for street tacos but got deep fried instead. The restaurant was not busy and the staff were not pleasant. Never did get a drink refill or asked if things were ok.",
   "Excellent food. Had a good time. Very nice customer service 👌",
   "We have always ate here and have had excellent service but today we waited for an 1hr for our food.",
   "Two of us had the Chile verde. Pork was dry, they don't cook it in sauce but just put the dried out pork on top of the sauce. Lousy tortillas. Very disappointed. Try La Hacienda real for much better food.",
   "Our favorite Mexican restaurant in Salem. Family owned.\nThe food is amazing and the staff are courteous and friendly.You won't find better in Salem...Straight up!"
  ]
 },
 {
  "name": "Kuong Chan's Chinese Restaurant",
  "address": "2290 Fairgrounds Rd NE, Salem, OR 97301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/df5ee690-9333-11ea-85b1-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14007768477931499351",
  "source": "GoogleMaps",
  "reviews": [
   "Oh my gosh! My 1st time here and so delicious! And large amounts of food. I will be returning for sure!! So glad to see them wearing masks and gloves too. Very kind man that brought out my food. This is my new favorite Chinese restaurant in Salem! Thank you! 😊",
   "First I'll just say...You should eat here.\nNow I'll tell you why. We have driven by this place a hundred times. Can't tell you why we never stopped,we just didn't.\nLast week we did. It is now my go to spot for Chinese. Thirty two years in Salem for me and I've had some pretty good Chinese. I judge it by the fact that I lived in San Francisco for five years and I ate a lot of Chinese food. In SF's Chinatown there are literally hundreds of small Chinese restaurants.It is of this experience that I say this, Eat here.\nPersonal favs: Pepper salted Shrimp. The Hot & Sour soup(so good) and of course the Beef Brocolli. Seriously,everything we've tried has been amazing.",
   "Got the Kung Pao Chicken to go. Real good flavor, though a tad too much rice.  Greeted by a very friendly owner.\nWill be back",
   "Best hot sour soup in town!  Always good, fresh and served by friendly people.",
   "Great food, no msg and fantastic prices.  Highly recommend if you are looking for the best Chinese restaurant in Salem."
  ]
 },
 {
  "name": "Momiji Japanese Restaurant",
  "address": "3411 Commercial St SE, Salem, OR 97302, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dfab0c50-9333-11ea-b341-14b31f159f22.png",
  "tags": [
   "food",
   "affordable",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=4360705231834980219",
  "source": "GoogleMaps",
  "reviews": [
   "Had a excellent experience in here with my wife. The food arrived rapidly and the customer service is just excellent. Prices are affordable.",
   "Food was very good. Wait staff did just what was required nothing above...brought our bill and no asking if we wanted anything else first.",
   "The waitresses I've met are lovely, the atmosphere is comfortable, and the sushi is fantastic!!! Plus they're affordable! 10/10 recommend.",
   "Not to be confused with the other two restaurants in Salem with the same name. Different management. I love the other two and went here thinking it was affiliated, so I was a little disappointed. However, the service was friendly & attentive; the venue was clean. Think a rebranding would help set this place apart.",
   "This is always a solid choice. The presentation is usually very nice and the staff is friendly. The fish seems really fresh."
  ]
 },
 {
  "name": "Cachet Tamale Shop",
  "address": "1105 Wallace Rd NW, Salem, OR 97304, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dff757ae-9333-11ea-8663-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "eat",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=8011274828592397393",
  "source": "GoogleMaps",
  "reviews": [
   "This place is delicious! Their tamales are very  filling and the black beans and rice they serve with them are super tasty!",
   "Have a look at my reviews I don't give everybody 5 stars.\nGreat customer service the lady I spoke with was genuine and nice.\nThis place is great, authentic tamales also Guatemalan tamales.\nGood prices $6 a tamale plate, two tamales cilantro rice and some great black beans that actually have flavor!\nI also seen on the menu half dozen tamales $10 and a dozen for $20.\nI would recommend this place.",
   "Love this place!! Pork tamales are so good that I could eat here every day! I like to get a dozen to share with my family throughout the week but they never make it past a few days before they are eaten up.😋",
   "The tamale plate is simply delicious! The tamales are not what you are normally used to, these are made with being covered in banana leaf, similar to what the Hawaiians do with their cooking, the result is a delicious and moist tamale unlike the Mexican tamale with can be and almost is dry because of corn husk covering. If you are looking for something different to enrich your palate, this is the place.",
   "This place is a hidden little gem. Love the tamales, probably will get to go not much seating. The owner was super friendly and it was a great experience. Probably my favorite little stand in Salem.I ordered the vegetable tamale plate (2 tamales, black beans, cilantro ride, sour cream, green salsa, and cheese) and two jalapeno cheese tamales on the side. I'm so excited that they have vegetarian tamales!"
  ]
 }
]