[
 {
  "name": "Temple Square",
  "address": "50 N Temple, Salt Lake City, UT 84150, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e04550c0-9333-11ea-8f7e-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "walk",
   "family",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=10112787064908179005",
  "source": "GoogleMaps",
  "reviews": [
   "Christmas-time is one of the best times to come and visit Temple Square.  They always have nativities set up as a tribute to other nations, and the grounds are decorated nicely.  I know that in the upcoming years, as they do construction on the Salt Lake Temple, that the grounds will not have nearly the same amount of lights and display as they have had recently, but that's alright.  Just make sure that you plan appropriately.  The grounds are beautiful and they always have flowers or lights or something that is seasonally appropriate going on.  A nice quiet area in the heart of the city to eat lunch and ponder on life.",
   "I love everything about Temple Square! We went to see the lights turn on for the Christmas season. It was so magical! The sister missionaries were singing beautiful Christmas hymns on the steps of the Tabernacle. I always get teary while viewing the Nativity and listening to the story of Christ's birth. One of my favorite parts is visiting the Christus in the North Visitors Center. My daughter was also able to perform with her school choir in the Assembly Hall. Temple Square is a must for the Christmas Season.",
   "Just incredible. Beautiful, peaceful and spiritual atmosphere. The architecture and plants and layout of temple square are breathtaking. There is lots of space and green grass and fountains and big sidewalks, along with good food and shopping very nearby. Highly recommend spending a day to check everything out.",
   "I've always loved this place.  It is a beautiful building and the grounds are immaculate.  I always feel at peace here and love to walk around looking at the various buildings and monuments.  There are tons of thing to explore from the history of the Church of Jesus Christ of Latter-day Saints to geneology and family history.  The architecture is inspiring and much of the history of the area has been preserved.",
   "Great place to be during the winter with Christmas lights and also during other times of the year. The gardens are beautiful and even if you are not a member of the Church of Jesus Christ of latter day saints there are things to do. Cool musical events and interesting museums that explain the culture and church's history."
  ]
 },
 {
  "name": "Salt Lake Temple",
  "address": "50 N West Temple, Salt Lake City, UT 84150, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e0956ccc-9333-11ea-9af9-14b31f159f22.png",
  "tags": [
   "walk",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=9189346696497674589",
  "source": "GoogleMaps",
  "reviews": [
   "What a beautiful temple. This is by far the most impressive temple I have been to. The artwork and decorations inside and out are simply amazing and breathtaking. \nWhen we think that this building was built in a time when Salt Lake City was but a small city out in the middle of nowhere, to see how much effort the pioneers put forth to glorify God!",
   "Of course not everyone is allowed inside the temple but you can roam around the place for its beauty and architecture. Located in the center of downtown, this place depicts the Mormon culture and religion. You can park in the city center mall and walk around the place. Prayer hall is open to all which is in-fact  the most beautiful prayer halls I have ever seen. It’s grandeur is amazing.",
   "Splendid architecture and this place gives a good insight in to the Mormon culture. I would recommend spending time in the adjacent Mormon museum which explains the origins of their travels west in to Utah in 1800’s. I tried booking their tour in their HQ but the slots were fully booked. Always loved their missionary zeal when I came upon Mormons from US in Bangalore, they even took public buses and always travel in pairs.",
   "Always such a place of peace and comfort. I love the salt lake temple and how beautiful it is inside and outside. It's breathtaking. My husband and I were sealed there in December and even though it was insanely busy, we were shown where to go and there was always someone there to answer our questions. Such a beautiful place and can't wait till it opens again.",
   "The Salt Lake Temple is always a beautiful place to visit in Downtown Salt Lake City. The grounds are quiet and serene, and you can really meditate about life in a place like this. Remember, it is closed for the next 4-5 years - so all you really get to do is come down here and look at the construction as it is renovated... but when it is open, it's a great place to be."
  ]
 },
 {
  "name": "Land Cruiser Heritage Museum",
  "address": "470 W 600 S, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e0f9110a-9333-11ea-b878-14b31f159f22.png",
  "tags": [
   "organized",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=10792909025692742397",
  "source": "GoogleMaps",
  "reviews": [
   "This place is outstanding!  I’ve been to quite a few car museums in my life, this one ranks near the top. I look forward to returning. I believe they currently have 95 Land Cruisers from 1955-2020. I’ve always admired the Land Cruiser, and hope to have another some day. They had so many variants from all over the world. How they’ve been able to put together such an extraordinary collection is beyond me. On top of all the vehicles, they have a huge collection of literature and memorabilia. Not to mention a fantastic docent.",
   "I had been waiting to go here for over two years. I was not disappointed. The location is clean and extremely well organized. The staff are friendly and very helpful. My friends and I had an awesome time enjoying their collection of almost 100 Land Cruisers. They are going to have updates to the collection by mid May!",
   "What a gem of a museum. My wife & two young kids had a wonderful time inside. So much fun history and so many beautiful makes and models to drool over. \n\nThe staff is so friendly and helpful and know everything about these vehicles. \n\nDon’t sleep on the cool schwag. This is a really well done automotive museum. \n\nWe will be coming back!",
   "This place is truly epic! A land cruiser fan's heaven.  Mad Matt was on site filming while I was there, he was saying he needed two days to take it all in. I only had an hour before my flight but I will be back.  Got to talk to Dan on some repair advice.  Very well set up and all trucks have an info placard.  They also have toys and models of cruisers that are rare.",
   "Amazing inventory and so cool to see all different models of Toyota vehicles from over the years and around the world! Crazy how the vehicles are held up in such a great condition! Definitely worth checking out!!!"
  ]
 },
 {
  "name": "Hogle Zoo",
  "address": "2600 Sunnyside Ave S, Salt Lake City, UT 84108, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e1497b08-9333-11ea-b33a-14b31f159f22.png",
  "tags": [
   "kids",
   "history",
   "unique",
   "art",
   "active",
   "kids",
   "free",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=8354643522834437222",
  "source": "GoogleMaps",
  "reviews": [
   "It’s a smaller zoo compared to eastern zoos, but it’s the best in Utah. They do have a lot of nice exhibits and it is really fun to go. There was a baby monkey in one of the exhibits and the elephants were especially photogenic. It wasn’t too busy and took a few hours. My younger siblings loved it. It’s not too expensive. Very fun!!",
   "I have been coming here since I was little and the zoo just keeps improving the quality for the animals and also for the guests. I really love the interactive displays for the kids and think that it really is the best way to get them hooked on conservation. I think that the zoo could do better at having feeding times, also having more of the animals that kids can touch and have an awesome experience with. The Natural History Museum has the spiders, centipedes, and cockroaches that they have crawl on you if you are willing and the kids loved it. Hope to see some more awesome changes! Keep it up!",
   "A fun little zoo to visit. We visited before we had to fly back it took about 2 hours to go through the whole zoo at a leisurely pace. \n\nOne of the few zoos that I've been to that has a art gallery you can pick up some very awesome and unique art.\n\nI definitely recommend coming here if you need to kill some time between plans.",
   "We love our zoo pass! Go at off peak hours and through the fall, winter, and spring months for less crowds. Today when we went it was a little snowy (in March), but the animals were very active and there was only a handful of other people there. If you have a pass avoid the free days because it gets a little crazy. During the summer my kids love the playground and splash pad. They also love the bird show.",
   "Beautiful zoo! Spacious, clean, and features a wonderful variety of species. Nice to walk through the whole zoo. Everybody has large exhibits and enough space. The harbour seal show was amazing as well, and it was great finding a place where the seals could participate in the show (instead of just the sea lions) and the seals looked like they enjoyed it. The viewing area for the zebras and giraffes was gorgeous, and they had loads of space. The gift shop was also beautiful. One of my favorite zoos, and I hope to visit again!"
  ]
 },
 {
  "name": "The Church of Jesus Christ of Latter-Day Saints Conference Center",
  "address": "60 N Temple, Salt Lake City, UT 84150, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e19159d8-9333-11ea-a132-14b31f159f22.png",
  "tags": [
   "free",
   "knowledgeable",
   "tour",
   "tour",
   "free"
  ],
  "link": "https://maps.google.com/?cid=5358528386492333639",
  "source": "GoogleMaps",
  "reviews": [
   "Must visit place even if you believe in religion or not, when you are in SLC. The volunteer are extremely patient and will give you a free guided tours. Though you can roam around the four floor building on your own, there are certain areas where you need a volunteer to enter. Try going to all the floors. The auditorium they have within the building is huge with 21k seating capacity. Its simply stunning. Also, on the 3rd floor they have a mini display of temple square showing whats it like inside the actual temple. \nHighly recommended!!!",
   "The staff & hosts here were wonderful and incredibly knowledgeable. They are passionate about what they're doing and loved receiving questions. The establishment was quite beautiful and has a lot of story to it! I highly recommend getting a tour!",
   "The Conference Center is an enormous example of stunning architecture and original paintings and statuary. The hosts are friendly and helpful. Best of all is the peace and beauty. There is such an uplifting feeling.",
   "Special experience to finally visit the place i have only seen on a screen for 24 years 😍 all worth the travel. Wish everyone will experience a similar feeling of reaching destination goals that have personal value. If this is one of them I hope you'll go!",
   "I love the conference center! It is a peaceful, beautiful place.  If you are visiting from out of town you should take a tour.  It is free and there are volunteers that will show you around.   There is a rooftop garden with water features as well where you can get good views and sit and relax."
  ]
 },
 {
  "name": "Red Butte Garden",
  "address": "300 Wakara Way, Salt Lake City, UT 84108, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e1dbf776-9333-11ea-84c8-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "hike",
   "history",
   "music"
  ],
  "link": "https://maps.google.com/?cid=16232989996537460657",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to visit in the spring, summer, and fall, if you like native plants to Utah. It is a very big garden with many paved trails. Most all of the plants, shrubs, vines, and trees have descriptive markers.\n\n During the spring and summer you can purchase plants here.\n\nAlso during the summer months you can go to live concerts of many quality musicians here, which is an awesome venue. But get your tickets early on most shows before they sell out.",
   "I love the concert series that they have here.  They allow you to bring in your own food and your own alcohol and the band selection is always really cool. The outdoors during the summer is pleasant and makes the atmosphere really fun.",
   "This large stretch of land is absolutely gorgeous! If you want to take an invigorating hike or just a peaceful stroll through the garden you can do both here. There is also an educational value to visiting Red Butte Garden; there are little signs that give the names of all the vegetation along with how much water and sunlight they need. They also have various opportunities for volunteers. \nThe garden also hosts some concerts and seasonal events like Garden After Dark.\nIt's a great place for people of all ages.\nNot to mention, it's a short walk to the neighboring Utah Museum of Natural History so you can go to one after visiting the other.",
   "Red Butte Garden concerts are so enjoyable. It’s such a beautiful and quaint setting.   Concerts are relatively small so you don’t have to fight a huge crowd like you would at USANA amphitheatre.  There’s nothing better than listening to great music on a beautiful summer night at red Butte Garden amphitheater",
   "Very beautiful botanical garden. There are a variety of gardens to explore, each featuring stunning yet pristine arrangements. Fantastic location for families, dates, and even weddings. Took my girlfriend as part of our anniversary celebration, and we loved it! Got some great photos and enjoyed the peaceful environment. Would highly recommend."
  ]
 },
 {
  "name": "Natural History Museum of Utah",
  "address": "301 Wakara Way, Salt Lake City, UT 84108, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e229f0b4-9333-11ea-b3ca-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "walking",
   "field",
   "family",
   "history",
   "family",
   "free",
   "history",
   "kids",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=16883338492971324750",
  "source": "GoogleMaps",
  "reviews": [
   "This museum is fabulous and worth every penny. The diversity exhibits is incredible! The creativity behind each interactive explanation of the world we live in is truly impressive. A visit here is truly a treat and inspires one to learn more and care for the amazing world we live in.  Aside from the experience of walking through history and peeking into multiple branches of science, the employees were kind and bathrooms clean. You should definitely visit!",
   "As a history nerd I LOVE this place. My daughter has had field trips multiple times here and I am at every one. We always come back as a family to spend more time and just explore it all in even more depth. There is so much to see and do while here that it truly could be an all day experience! They always tend to have a new exhibit every once in a while that keeps me wanting to come back and check it out.",
   "So many cool exhibits and a great place to let your little one or “little one” at heart roam around and see all the neat things that Utah has to offer. Clearly the dinosaurs are pretty amazing but all of the different levels fun experiences that your family will love. If you are an employee or student of the University of Utah you get in for free. It’s a pretty sweet deal since the museum can get pretty expensive depending on how many people are in your group. While there we got to go into the archives which was pretty amazing. I’ll definitely be back.",
   "A Fantastic Educational Experience\nThe NHMU is a fantastic museum. The variety of exhibits is amazing. From the history of the indigenous people, the dinosaur exhibits, how the Salt Lake was formed to the info about conservation and recycling. Everything was well presented and informative. One of the best exhibits was the observation deck on the roof. There is an amazing panoramic view of the Wasatch mountains and the Salt Lake valley.",
   "We always enjoy a trip to the Natural History Museum.  It is a lovely museum in terms of architecture as well as in the lay out of the exhibits.  Great views of the city as well on a nice clear day when the upper terrace is open.  A great place to visit with kids if you are in town visiting or if you have family in town. \n\nWednesdays are also a great deal where the museum stays open late and you can get a ticket after 5pm for $5!"
  ]
 },
 {
  "name": "Tracy Aviary",
  "address": "589 E 1300 S, Salt Lake City, UT 84105, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e2768a24-9333-11ea-83fd-14b31f159f22.png",
  "tags": [
   "kids",
   "educate"
  ],
  "link": "https://maps.google.com/?cid=11622129915973632856",
  "source": "GoogleMaps",
  "reviews": [
   "Don't hesitate, just GO!!!  If you like birds, wildlife, or conservation this is the place for you.  They've got lots of cool exhibits with birds from all over the world and great, educational kids programs.  Located in Liberty Park so it's near other cool things too.",
   "Lots of fun for a surprise date night. I love birds and it’s such a beautiful place, staff were all so friendly and you can tell they love their jobs! Definitely going back and scheduling one of their special events",
   "I absolutely love visiting the Tracy Aviary. Their birds always look healthy and well taken care of. In addition to this the staff has always been informative and happy to educate about their flock. They represent the highest level of stewardship for the animals they care for.",
   "This was so well worth the price of the visit (only $9!) and I could definitely see myself coming here again and again once it gets warmer! Every single bird was an absolute beauty to look at and the indoor exhibits with all of the plants are so swoon worthy.",
   "It was snowing and cold when we visited, but still so much fun! It has been a while since the last visit and I forgot how many exhibits there are. The kea were playing in the snow and with their toys, and we went to the bird show which included an adorable painting parrot. Great activity, even with the snow!"
  ]
 },
 {
  "name": "Utah State Capitol Building",
  "address": "350 State St, Salt Lake City, UT 84103, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e2b84e62-9333-11ea-b41f-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "historic",
   "tour",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17036286960393059658",
  "source": "GoogleMaps",
  "reviews": [
   "I’ve been in Utah 2 years now but never to the Capitol Building. Went today and loved it. The views, architecture, and Christmas tree were stunning. A bit freezing but we did peak at some of the grounds and can’t wait to come back in warmer weather. \nThe rotunda area was incredible. There were no tours but we wandered around with the self guided tour and did just fine. Parking was convenient, just be prepared  to get a lot of steps in!",
   "The view up here is breathtaking! Be sure to find the best spot avoiding trees distracting the views. You could see the mountain far away as well as the whole landscape of the city. Here're the pictures taken from the building.",
   "Beautiful, clean grounds. Well kept. The inside of the capital of spectacular. We enjoyed the old fashioned elevators. The murals were beautiful and taught us the history of Utah. What a beautiful and ornate building. Outside of the capital you can find great views of the mountains and the City",
   "Beautiful building and grounds.  Building is open until 6 so I went in after 5 and did a self guided tour.  Very peaceful after hours and better opportunities for pictures.  Rotunda depicts historic events of state history.  West wing has basic history of the building and state information.  Parking is free and tours are free.",
   "Beautiful building with exquisite views that line up with the cities grid. Great place for a picnic or to catch a sunset."
  ]
 },
 {
  "name": "Salt Lake Tabernacle",
  "address": "50 N West Temple, Salt Lake City, UT 84150, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e3066eb6-9333-11ea-adaf-14b31f159f22.png",
  "tags": [
   "music",
   "historic",
   "history",
   "history",
   "music",
   "tour",
   "history",
   "music",
   "tour",
   "free",
   "music"
  ],
  "link": "https://maps.google.com/?cid=15253612239857555189",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing place!!! Words alone can't possibly describe the experience. Please come and see for yourself—you'll love every second! I went to the organ recital and the music and spirit it brought was nothing short of amazing! The acoustics of this place are superb (you can literally hear a pin drop from the other side of the room). I love being here and can all but guarantee you will too!",
   "What a beautiful historic and spiritual place to see.  The history of this place is amazing.  The building and pipes (organ pipes) are made from wood near my home in Southern Utah from what I've read.  I saw the Saints Unified Voices and another choir perform there (Polynesian choir) and it was one of my most memorable experiences in this building and possibly anywhere.  Glad it was in this building.",
   "The acoustics are amazing! The choirs who preform here always sound amazing. If you like historical architecture than this is a great building to stop into while in Salt Lake as well. There is a lot of history on Temple Square and always someone, missionary or volunteer, to tell you about it. Try to catch music and the spoken word while they are in the Tabernacle as well, it's amazing. The organ is also wonderful. The degree of sound and movement that the really good organists have are amazing.",
   "Beautiful building with very interesting history. \nWe were there while an organ recital was going and had the opportunity to listen to an amazingly talented organist.  This place is great for people with little ones too, there is a room that you can go in and listen to the music if tour little one is being fussy.",
   "Beautiful building, free to tour. Amazing organ! Lots of free events, especially musical events like organ recitals and music and the spoken word by the Tabernacle choir. The sound is amazing in the building. Definitely worth a visit!"
  ]
 },
 {
  "name": "Sugar House Park",
  "address": "1330 2100 S, Salt Lake City, UT 84106, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e351cfb0-9333-11ea-a1ac-14b31f159f22.png",
  "tags": [
   "kids",
   "adventurous",
   "learn",
   "parks",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=9609012369130441100",
  "source": "GoogleMaps",
  "reviews": [
   "Sugar House Park is really great place to go - especially with kids. There's a creek, a pond with geese and ducks and several awesome playgrounds. You can fly a kite, ride your bike, jog, or cross the creek on large logs. The park is awesome in all seasons - sledding in the winter is a popular activity. There are clean restrooms, drinking fountains and picnic tables with barbecue pits. Short but adventurous trail takes you to Sugar House Commons shops and restaurants.  I highly recommend it !",
   "This park is a great place to learn how to drive your car.  However, be careful.  It's also a great place for young parents to teach their children how to ride a bike.  New car drivers, just like well seasoned drivers are fully liable for running over any and all pedestrians.  Please drive carefully.",
   "Loved it! Lots of land for strolling. It was very spacious, had an amazing view of the surrounding Salt Lake City mountains! Very dog friendly! The goose pond has lots of poop around fyi but still very pretty",
   "This is one of the biggest and most beautiful parks in and around salt lake city. There are a number of play grounds, walking tracks, picnic spots with seating arrangements, a big lake full of ducks. A number of parking areas around the park. During summer the park gives a look of  beautiful green contours and during winters when it snows the whole area becomes white all around and children's favourite place for sledding.",
   "Great running trail! Good amount of foot traffic in the summer but always plenty of room on the trail. Plenty of parking all around the park and along the trail. Even in the summer when the fields are packed for activities. There’s 6 parking lots all along the trail as well. Great park all year round."
  ]
 },
 {
  "name": "Church History Museum",
  "address": "45 N West Temple, Salt Lake City, UT 84150, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e3aa501c-9333-11ea-b784-14b31f159f22.png",
  "tags": [
   "free",
   "learn",
   "organized",
   "history",
   "knowledgeable",
   "free",
   "history",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=6437620250390955766",
  "source": "GoogleMaps",
  "reviews": [
   "One of the fun things about the museum is an original pioneer log house outside the front entrance. It was locked when we arrived, but when it's not (probably in warmer weather) you can step just inside the door and see the furnishings. We could tell that by looking in the window.\nThe museum is not large, but the two floors of exhibits are modern and attractively arranged, with a number of interactive features. There are plenty of volunteers on hand to answer questions.\nI took my two sons, ages 12 and 5, hoping to see the special exhibit for children, but it doesn't reopen until Feb 12. There was, however, a room with a few toys and books, including some old fashioned pioneer toys. My boys spent 15 or 20 minutes each on a painting app on a screen mounted on an easel, and another 15 minutes with other items.\nThen we walked through another exhibit I was interested in, but only for a few minutes because my 12 year old was ready to go. My 5 year old could have been happy for a while longer, I think, because there were so many things that caught his eye.\nOurs was a short visit, and we didn't see much, but since it's free it wasn't a lost investment.\nAnother plus was the free parking behind the museum.",
   "Although I am not Mormon,I went here just to learn about the History of Mormonism. It was wonderful! The museum is very well organized and the staff is incredibly helpful and will answer any questions without making you feel silly. They also had a women's suffrage section upstairs that was a pleasant surprise! Beautiful quilts and fabric work that you could spend days looking at.",
   "What an amazing experience! I tell myself that I don't enjoy museums but after the fact I usually do. If you are a member of The Church of Jesus Christ of Latter-day saints or not, it will still be an enriching experience. The staff was very friendly and knowledgeable. It is free to experience and you don't need a reservation. You could spend 10 minutes or several hours here. There is something for the whole family, interactive displays, movies, artifacts, and some juicy facts! Have a wholesome time at the Church History Museum.",
   "We were visiting from Texas and our hotel was just around the corner from us so we decided to check it out. This is a beautiful Museum, but most importantly, the people here were genuinely kind. We truly enjoyed our conversations with everyone we came in contact with. It was very educational. We highly recommend that you stop in and check it out!",
   "Had an fun visit to this museum together with my family. We particularly enjoyed the women's suffrage exhibit, which was interesting and informative - I would never have guessed Utah was so early in passing legislation allowing women to vote. Convenient location with parking, and interesting exhibits for adults and children of all ages."
  ]
 },
 {
  "name": "Memory Grove Park",
  "address": "300 N Canyon Rd, Salt Lake City, UT 84103, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e3fc67e8-9333-11ea-9751-14b31f159f22.png",
  "tags": [
   "nature",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=4140555976655699573",
  "source": "GoogleMaps",
  "reviews": [
   "One of my favorite outdoor areas. It’s amazing for a hot day to get under some shade. Great for dogs that love water. They have open fields for your dog to run. Great for doggy dates! The trail does get a little slippery when wet or snowy so keep good footwear in mind.",
   "Great for pictures during slow times of day, especially in the fall. Good off leash area for dogs on the north trails.\n\nOnly downside is no enforcement of \"leashed\" zones. My dog got best a few times here and some dog owners dont know how to responsible humans. \n\nPark is still great and well maintained.",
   "Best location in Salt Lake City for trivial / non-original photos / brides / bands. There are about 10 different groups taking pictures now.\nAmazing! Great space for walking or running. For those who are not from the city, here are the best running trails. 5 miles of asphalt, hill and beautiful nature!",
   "It was a beautiful day for a stroll in the park. Lots of dogs in and if leash. Everyone was having a great time! It's well cared for & I enjoyed the memorial/history displays.",
   "Beautiful neighborhood park with a huge off leash trail. \n\nWe parked the vanabus on top of the hill, just across from the Capitol building. Then, walked down the trail. Easy walk down and up with paved trails. \n\nThe park is beautiful, with a meditation building and a river. A great place to spend an afternoon exploring. Perfect stop for travelers like us!"
  ]
 },
 {
  "name": "Clark Planetarium",
  "address": "110 400 W, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e442e718-9333-11ea-b931-14b31f159f22.png",
  "tags": [
   "cheap",
   "free",
   "learn",
   "field",
   "kids",
   "free",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=7437435684685201556",
  "source": "GoogleMaps",
  "reviews": [
   "Been here several times. There is always plenty to do free and even the shows are fairly cheap. Plus they are in 3d. How cool is that. If you love space like I do then I highly recommend this place. Or you are just starting your journey learning about space then you won't be disappointed. At least I wasn't.",
   "What a great spot to visit while at the Gateway. I love that there is no charge for admission to the facility and the shows are pretty reasonably priced. My son and I love the interactive exhibits. I think it’s an awesome environment for people of all ages to learn and see something different. This is definitely a place that will bring out your inner child and keep your children captivated.",
   "Super cool exhibits & it’s free!!! Can’t beat that! Just make sure you don’t come when there’s a field trip.... that was really annoying. Screaming kids everywhere and hard to see all of the exhibits. But tons of cool stuff to see, make sure you leave lots of time for it!",
   "I enjoy this museum. Even at the age of 21, it allows me to have fun. A ton of different interactive displays and it’s all free. I haven’t tried the shows. The gift shop is good and has astronaut ice cream which is a childhood favorite for me. It wasn’t super expensive either. If you’re looking for a fun way to spend the day with the kids I highly recommend it.",
   "Love this place! Fun exhibits, interesting games, great shows! I always enjoy myself when I visit the planetarium. The only downside is that the staff selling movie tickets seem to change policy every time I visit. Sometimes they'll let you in if you're 2 minutes late, other times they won't. But if you're on time for the show that'll never be a concern. \n\nAnyways, 10 out of 10, would recommend."
  ]
 },
 {
  "name": "Salt Lake City Tours",
  "address": "230 W 200 S #4874, Salt Lake City, UT 84110, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e4a097b0-9333-11ea-9af8-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "tour",
   "parks",
   "tour",
   "wander"
  ],
  "link": "https://maps.google.com/?cid=2070025004369241145",
  "source": "GoogleMaps",
  "reviews": [
   "I'm very glad I took this tour. I found it on Google looking for a good downtown tour. This was a great way to see a lot of the interesting parts of Salt Lake City in a short amount of time, and there was so much to see that it was actually a very good value for the money. The guide was full of information and humor so it was a very enjoyable experience.",
   "Terrific tour of Salt Lake City, 6 stars! Great Salt Lake tour was good but maybe just 4 stars. Overall I rate 5 stars for both tours then. Not much to see at Great Salt Lake but I give credit to my guide for trying very hard to make it as interesting as possible. Without him the lake would’ve been a complete bust. So at least he made it informative and somewhat fun. The City tour was outstanding though!",
   "Just finished our Explorers tour of Temple Square in Salt Lake City and wanted to give a big shout out to our awesome tour guide, Chris! He was fantastic! We didn't expect much from Salt Lake City as we're just passing through on our way back from Yellowstone and on to the national parks. This tour ended up being a highlight of our trip thus far! Chris had a lot of great stories and factoids to share about the buildings and culture. He really seems knows his stuff and have a passion for what he does! A gentle soul who was very concerned about answering the questions posed by those in our group. Great experience and highly recommend it!",
   "I enjoyed the tour this past Sunday. It was a great way to see all the downtown sights without having to wander an unfamiliar city. Our guide was fun, humorous, and very informative. The tour covered lots of things and we even got to hear the Tabernacle Choir and the famous pipe organ. I liked that the tour left just the right amount of time to see things.",
   "Excellent guide gave a great narration. We never would've known what to see or seen so much on our own. The \"souvenir photos\" were a nice touch. I wasn't too interested in that aspect when reading up on their website but now I'm glad we have them, they're of very good quality and didn't add much to the cost."
  ]
 },
 {
  "name": "Cathedral of the Madeleine",
  "address": "331 E S Temple, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e4e47ed0-9333-11ea-aed1-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=14810443952583014462",
  "source": "GoogleMaps",
  "reviews": [
   "I LOVE LOVE LOVE this Cathedral!!! I come here whenever I need solitude to pray and can sit in their candle room, light a candle for someone and then pray for them or pray for my own strength. Such beautiful stained glass, you can also walk into the chapel and sit and pray ... everyone is very respectful and quiet. Sometimes they play the organ and sometimes they start a ceremony (in English or Spanish). I'm not a Catholic but i still find comfort in coming here to pray and find hope.",
   "They have one of the most beautiful Catholic choirs I have ever heard.  When the Bishop is present for services, usually holidays, he fills the church with laughter and it is lovely.  This cathedral is not a typical looking cathedral in the sense that it does not have intricate stone carvings, or gold leaf everywhere, instead it is fairly modest looking in both size and aesthetics.  However, the people and the choir easily make up for the lack of sparkle in the church.  The choir is angelic and brings me to tears every time as it is spiritually moving in a big way.    I do wish they had weekday noon mass.  In Denver, I went to noon mass at the cathedral almost everyday and it helped me through some really difficult times.  I wish that they would do that in SLC.  I get that the Mormons are a huge part of the population, but we should have at least one church that offers this type of service for those of us that chose to spend lunch hour in the house of God.  Even if it was just once a week on Wednesday, it would be better than nothing.  I highly recommend attending high mass so that you can celebrate your faith through the incredible choir.  It is life changing, soul lifting, and they will make you want to jump out of the pew and applause like crazy.",
   "Nice stop if you are around the neighborhood. Wouldn’t go out of your way to go here. It is a great experience when you get to go inside. Great architectural wonder.",
   "I grew up in this church, and it's simply beautiful. The congregation is gracious and friendly and the singer does the songs/mass beautifully. The priest speaks a little daddy and i missed things at times but i enjoyed the mass altogether.",
   "I worked her for a few years way back. It’s changed. Went for Adoration of the blessed Sacrament then fail Mass at 5:15p. The priest is young and very good. He seems very spiritual. The place was dirty. The public restrooms were very dirt. I saw a few cockroaches going along the floor."
  ]
 },
 {
  "name": "The Leonardo Museum",
  "address": "209 E 500 S, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e5438ed4-9333-11ea-91bd-14b31f159f22.png",
  "tags": [
   "music",
   "food",
   "tour",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=14588013555272096232",
  "source": "GoogleMaps",
  "reviews": [
   "Very cool! I went to see the Pompeii exhibit earlier this year, the first time I had ever been to the Leonardo. I was pleased with my experience! The Pompeii exhibit was well thought out, informative, and my ticket included access to the rest of the museum as well. I loved the flight exhibit - they had a flight simulator that was very cool. The top floor had exhibits that taught about design and music, which was also pretty awesome. What a great way to spend your Saturday!",
   "I've been here quite a few times, always for the featured exhibits and a couple of times for the adults wine and dine events. It's always fun, informative and the exhibits are always very good.\nThey have some different classes for adults and children that you can take part in, and while I haven't done any, they sound fun and I need to get back and try them.\nThey also have a little gift shop that sells educational stuff and of course items from the featured exhibit. As well as coffee, soda's, wine and food.\nYou can take your chance on street parking or just park in the libraries underground car park, which connects to the Leonardo. For me this is much easier and what I personally recommend.\nIf you're looking for something different, educational or just want to get out and do something. I'd recommend the Leonardo!",
   "My wife and I thoroughly enjoyed the Pompeii exhibit at the Leonardo. We were in Pompeii, Italy last year and toured the ruined city but all the artifacts had long since been removed and were displayed elsewhere. It was fascinating to see things like the bowls and plates they ate off of, the jewelry they wore, the artwork from their homes, the statues, and hear descriptions of much of what was on display with the audio equipment. The grand finale of the tour is poignant and touching. Well worth the price.",
   "We went to see the Pompeii exhibit. It was amazing. The price was reasonable and the pieces were breathtaking. The history and audio was great. What an amazing and sad part of history brought to our little state. Thank you!",
   "We saw the airplane exhibit and the Pompeii exhibit. I love museums and this one was just okay. Great subject matter but left a little bit to be desired. The plaques for information and audio tour devices were quite often so low or in odd places that they were easily missed when there is a crowd. (I'm 5' 7\") I did like the video of the 3D models of the inside of the homes of Pompeii."
  ]
 },
 {
  "name": "Utah Museum of Fine Arts",
  "address": "410 Campus Center Dr, Salt Lake City, UT 84112, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e597f0a4-9333-11ea-aea1-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "art",
   "kids",
   "tour",
   "art"
  ],
  "link": "https://maps.google.com/?cid=14972137298745324525",
  "source": "GoogleMaps",
  "reviews": [
   "Gorgeous space with all kinds of art from ancient, to island, to modern. We went on one of the museum's free days and it wasn't crowded at all. While I loved seeing the European sections, my kids enjoyed the African and Egyptian sections. We also sat entranced through the making art movie",
   "Really nice museum. Big enough to spend a couple of hours but not overwhelming. We saw the whole thing in about 1.5 hours, taking our time. They've got a good variety and it's very well curated, with great, thought provoking signs by the artwork. I've never seen museum signs that asked questions of the viewer! Also all signs were in Spanish and English, which is awesome. Too few museums are bilingual. Keep up the great work Utah Museum of Fine Arts!",
   "This place was great. It's a lot bigger than I thought it would be, and has several different galleries with different themes. Really fun time, will be back!",
   "Lovely place.  It is not as large as some cities' but it still has a great variety of artwork from all over the world on display. The variety held my children's interests as each room had a separate theme.  There is a cute interactive kids corner on the second floor that captured my young children's imaginations with musical instruments and building blocks.",
   "It’s so pretty, and the place has good atmosphere. It’s best on days where it’s not crowded because you can spend time admiring the art and the small spaces where they have religious statues. I love the tour guides too they take time to explain symbols and the importance of each piece. Best place in UT!"
  ]
 },
 {
  "name": "Ensign Peak Trailhead",
  "address": "Ensign Peak Trail, Salt Lake City, UT 84103, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e5e2194c-9333-11ea-8e8a-14b31f159f22.png",
  "tags": [
   "hike",
   "walk",
   "hike",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=1507120655692938581",
  "source": "GoogleMaps",
  "reviews": [
   "This site was recommended by a local. Wonder  views of the entire down town of salt lake city. About 200 degrees of stunning mountain views. Two separate view points. Didnt make the top one due to mud. But ultimately enjoyed the light hike.",
   "Don't miss this if you do d yourself here. It's a little steep and does not half a cement path but it's a very clear pathway. It's a little muddy still because of the weather but it's very scenic. You can stop on the way up for a breath and always have a good view. This is half way up and at the top! It's well worth the walk. Bring a backpack with some snacks stay up there a while. Check out the monuments on the way up! Very neat, lots of information and a good place to sit down and think, meditate if that's your thing. It's kinda windy at the top so prepare for that. 🌞",
   "It took me years to finally visit this beautiful spot. I'm so glad I finally went! It's a steep hike, but worth it! The trial head is really nice. After that much of it isn't paved. After storms it can get kind of rough.",
   "What an awesome place to be! Climbing the peak is about a 10-15 minute hike depending on your fitness. I made a few rest stops en route to the top. At the top the view overlooking the Salt Lake Valley is breathtaking. My friend took along a fairly powerful scope and we were able to get close up views of prominent icons in the city. It was an amazing experience.\n\nStanding atop Ensign peak is a monument in honour of Latter-Day Saint pioneers who were instrumental in settling and developing the Salt Lake Valley back in the 1800's.",
   "It was a short but awsome hike. The view was great. My only concern is that it was too steep for my children."
  ]
 },
 {
  "name": "The Beehive House",
  "address": "67 E S Temple, Salt Lake City, UT 84150, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e6308798-9333-11ea-9045-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "learn",
   "tour",
   "knowledgeable",
   "tour",
   "history",
   "tour",
   "free",
   "history",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13413033720393268724",
  "source": "GoogleMaps",
  "reviews": [
   "It was a very enlightening experience. The missionaries are so knowledgeable and insightful. I recommend it to anyone visiting the area. I've been living here for months and finally walked across the street. Should have done it earlier. I had a great time and learned a lot. Their historical memorabilia is to die for. Will be back with more time and bring friends next time.",
   "I have lived in Utah 20+ years and FINALLY did the tour. So worth it to learn more about the early settlers. If a big group (over 10), get a reservation ahead of time, otherwise you can pop in any time and get a tour. Tours are about 30 minutes, but they'll spend more time with you if you ask questions. Grateful that this gem has been preserved over the century!",
   "Oh my goodness! The quality of this tour has grown 10O0% better now that the Church history department has taken the reigns from the missionary department.\n\nI highly recommend this. You get the historical aspects of the home and of the period. Polygamy is not hidden or glossed over, but stated as a matter of fact way of life. \n\nThe guides are knowledgeable and accurate and there is no missionary pressure or out of the blue testifying that can turn off non-members who are there for the history and asking members for referrals of their friends which has been a guilt-ridden staple of historical sites in the past. \n\nSuch a pleasant and professional change!",
   "A fun free educational tour of Brigham Young's home and the beginning of Salt Lake City. The tour starts every 30 minutes with the last one at 530pm. It is not long and kid friendly. I recommend it to anyone religious or not as a great history lesson.",
   "Loved the tour. It is done by guides now who know their history and we are able to get a feel about what it would be like to live there back in the day and the busy lifestyle they all had. Tour was nice and quick and they were able to  get through quickly since we were on a tight schedule."
  ]
 },
 {
  "name": "Gilgal Sculpture Garden",
  "address": "749 E 500 S, Salt Lake City, UT 84102, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e67ad730-9333-11ea-bb8c-14b31f159f22.png",
  "tags": [
   "unique",
   "unique",
   "free",
   "wander"
  ],
  "link": "https://maps.google.com/?cid=3513613529593432811",
  "source": "GoogleMaps",
  "reviews": [
   "The only downside to this place is you can tell the homeless have started camping here which takes away from the beauty. Wish they'd at least clean up after themselves. In every other way though this place is amazing i walked in not knowing what to expect when i accidentally found the park. The sculptures are amazing and i love how they depict the prophecies inscripted below them from the scriptures.",
   "It's a cool place, if only it had descriptions of each statue, to get a better understanding of what the whole place is about. I like all the Scriptures, I could not figure out what some of the sculptures or statues, no description. Overall, really cool place",
   "Definitely a unique place to visit! I wish there was more information about the pieces abs the garden. Also, super tiny, so if you're traveling just to see it, combine it with another activity.",
   "What a great little Park hidden in downtown very cool sculptures not very big but very pleasant and quiet nice place to sit and relax definitely recommend to go to wish it was a little bigger though",
   "While I would not consider it a MUST SEE, it is free and in the middle of the city.  I would give it 3.5 stars if I could.  It’s a unique experience for sure.  If you are in the area and have a few min to wander, I think it’s worth your time and stroll into the gates and give a look around."
  ]
 },
 {
  "name": "Salt Lake City Public Library",
  "address": "210 E 400 S, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e6e33674-9333-11ea-8d7d-14b31f159f22.png",
  "tags": [
   "walk",
   "library",
   "library",
   "library",
   "food"
  ],
  "link": "https://maps.google.com/?cid=66428271525700298",
  "source": "GoogleMaps",
  "reviews": [
   "This library is pretty awesomely huge and really fun to walk around in! The  bottom level has cute little shops and snack options. The rooftop was unfortunately closed when I went but I'll definitely be coming back to see it and roam the shelves again!",
   "My favorite library is in a small town in CT, this place a really big. I lost my child here. There were books on how to handle that. Nice people though!",
   "This library was awesome! The atrium is beautiful and you can take a glass elevator to the top floor and see everything below. You can go up to the roof where there is a rooftop garden and path that has been and seating. There is a great view of the skyline from there. The children's section is great with little alcoves in the wall where they can sit and read. Coffee, pastries, and hot chocolate can be purchased inside the atrium on the main floor and there are plenty of places to study.",
   "I like how phallic the foliage is!...🤔  Backup on GPS and take a look at the landscaping along 300 east... I wonder who signed off on that landscaping design?   \"Frank and beans\" 😅",
   "Quiet clean and beautiful. Good food \nA lot of homeless people. 😢"
  ]
 },
 {
  "name": "Pioneer Memorial Museum",
  "address": "300 Main St, Salt Lake City, UT 84103, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e72cc2a4-9333-11ea-b6d9-14b31f159f22.png",
  "tags": [
   "field",
   "family",
   "walk",
   "walk",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=4938251624975435045",
  "source": "GoogleMaps",
  "reviews": [
   "AMAZING...did not have time to see everything due to being part of a field trip.  Definitely returning and taking my whole family. Printing out the scavenger hunt form and questions was so fun!!",
   "My Dad and I spent hours on this building. Many of the pioneer tools used for blacksmithing were the same tools his father used. It was an awesome walk down memory lane for him. He also saw exhibits of floor installation tools that were like the ones he had used, only older. It was awesome. No photography allowed.",
   "This place is fun to walk around and learn about Utah's roots. The museum contains pioneer artifacts that are interesting and nostalgic.",
   "This museum was surprisingly cool. Especially downstairs. They've got some really cool artifacts. Once you do the basement and first floor the rest felt kind of redundant... The hair wreaths were kind of creepy.",
   "I loved every minute I was there. This museum is awesome, and the price is right."
  ]
 },
 {
  "name": "Liberty Park",
  "address": "600 East 900 South, Salt Lake City, UT 84105, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e77b5802-9333-11ea-9b33-14b31f159f22.png",
  "tags": [
   "educate",
   "kids",
   "eat",
   "parks",
   "walk",
   "music",
   "free",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3840677276212609488",
  "source": "GoogleMaps",
  "reviews": [
   "It was so much fun, to s of different parks for big and little kids, musical instruments put out to play with, kid proof, and tons of dogs. There is also lots of space for the dogs to roam around, the grass is perfect for picnic part. It also has tables, if u prefer not to eat of the floor. There is a ton of cool stuff to educate your kids with too. You can teach them how people found N, S, E, and W on one of the first ever compass, or tell time on the first clock ever made! You can fun around and play tag for age's, it's the perfect park for many occasions. I highly recommend it!",
   "This park is the biggest park in salt lake city. The bird aviary is one of the main attraction here.\nThere are a number of grounds suitable for outdoor games, a large duck pond and specific areas for picnics with seating arrangements. \nThere are tall trees and beautiful lush green grass contours. A series of walk ways connects various grounds and other areas.\nThere is ample parking area.",
   "It was a pretty cold, wintery day when we went to Liberty park but we still had a lot of fun. There is a nice mix of play equipment, paths, green spaces, and plenty of shade. The equipment was well maintained and there was ample parking while we were there, although I can imagine it gets busy in the summer. There is a slightly unusual one-way system as you enter the park so you might want to plan accordingly where you will want to be and where you will need to park.",
   "Great local park for Salt Lake City. There are many events that are often his at this park. Bark at the park is one of my favorites. This is where you get to bring your dog to a big event and play with, literally, hundreds of did and dog living humans with vendors and live music. \n\nMy wife loves running around the park which is about 1.4 miles per lap and I love to take the dog out and throw the ball around.  \n\nBe careful in the later hours. There can be Time has been there is a homeless problem",
   "Great place to ride your bike or jog around the park. Lots of people walking dogs and if you are into birds the Aviary is pretty cool. Sundays during the Summer this place is packed. Cool old cars on display. Hint: don’t try to find parking inside the park - park just East of the park ( no parking meters; it’s free)"
  ]
 },
 {
  "name": "Family History Library",
  "address": "35 N West Temple, Salt Lake City, UT 84150, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e7cc125a-9333-11ea-bd56-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "learn",
   "family",
   "library",
   "history",
   "learn",
   "family"
  ],
  "link": "https://maps.google.com/?cid=12915356771584392465",
  "source": "GoogleMaps",
  "reviews": [
   "Such a wonderful experience! The helpful docents greet you and offer assistance as soon as you walk in the door and throughout your entire stay! I had 3 helpers, so many confirmations of the work I've already been doing and so many helpful tips and tricks to continue to help me with my ancestors! EVERYONE interested in genealogy should go!",
   "Anytime I am in Salt Lake City, I make sure I visit this wonderful facility. The volunteers and staff are so helpful. It’s amazing the resources available to find your family ancestors. I am amazed by the entire operation. Thank you.",
   "The Family History Library delivers and incredible experience for everyone, whether you are an advanced genealogist, or whether you just walked in off the street.  The discovery activities on the main floor are great for anyone age 5 and up. (My daughters want to come back here anytime we visit downtown)\n\nYou can learn so much about where you are from and who you are.  I would highly recommend a visit to the Family History Library to anyone who is passing through.",
   "Incredible resource. Not everything one needs can be found searching online. There are many records that are only available through their system or via a book. Great place to do your genealogical  research. The staff is helpful too.",
   "I had such a great experience here! I didn’t know what I was doing, but Glenda helped me out and was so kind and funny. I was able to learn a bit about my family!"
  ]
 },
 {
  "name": "Discovery Gateway Children's Museum",
  "address": "444 W 100 S, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e81eed90-9333-11ea-8887-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "kids",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=17951860003333878379",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of the greatest children and family spots in the state of Utah. Absolutely phenomenal and interactive activities. Wish prices weren’t quite as steep as they are but it is a ton of fun to bring family and friends if they have never been. I make sure that this is at least a yearly stop off. When you are done here head over to any of the dining that is close! Great location for great times.",
   "The place hadn’t changed much over the years. If your kids are over the age of 4-5 this place isn’t going to entertain them or at least for long. We brought our 6 y/o and she found about 30-45 minutes of fun. They charge $12.50 a person which seems a little pricey for the amount of time you actually spend inside the museum. The good thing about the price is the museum never stays that busy. Overall not a bad place for younger children, but once you’ve been here you’re probably not likely to return.",
   "This place is pretty fun to bring your kid to! You would probably want to play with some of the exhibits there, too :) My daughter loved it when she went for the first time :D was a little hard to get her out, though. She didn't want to leave :P you can have your birthday here as well. It's super fun!",
   "Fantastic place to bring young kids! We celebrated my two year old grandsons birthday there in a private room! Best party we've ever organized for toddlers!! Highly recommend this amazing place! It's truly a kids paradise!! The hardest part is simply getting then to leave when the place shuts down.",
   "My son and I love this place. We’ve been to many birthday parties here. I decided to purchase the year membership and it was the best decision I made. Well worth the price especially during the winter. The facility is clean and well kept. The staff are all well professional and accommodating. My son loves every aspect of this place."
  ]
 },
 {
  "name": "This Is The Place Heritage Park",
  "address": "2601 Sunnyside Ave S, Salt Lake City, UT 84108, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e868c7fa-9333-11ea-8a7b-14b31f159f22.png",
  "tags": [
   "hike",
   "kids",
   "learn",
   "kids",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=16090868871749510884",
  "source": "GoogleMaps",
  "reviews": [
   "They are under construction at the moment, building a beautiful new visitor center. The end of the building will have 40 foot wide window, that the big statue will be visible from. It will get gorgeous! It's a nest little state park that had been built up and renovated a lot during the last 14 years. Totally worth visiting. Beautiful mountain view up there and across the valley.",
   "This is the place where Brigham Young allegedly exclaimed \"This is the place\".  I suppose after a long and treacherous hike across the mountains, they were all happy to see a nice empty valley.  Then they settled down, built a beautiful city, toyed with the idea of starting their own country and wisely choose against that and in the end created a successful and peaceful society.  Nice job!",
   "Interesting place. I would like to come back in the summer when more buildings are open. The Pioneer Children Memorial was very nice. Would be nice if they had people around to answer questions",
   "Google Maps says I went there three weeks ago but I actually went last spring. Every year they have an event where you can bring your kids to pet/feed the baby animals, ride the ponies and make crafts. It's fairly inexpensive and was really a lot of fun! The baby animals are so cute and your kids will LOVE it!",
   "I love this is the place. They have a lot of old pioneer buildings all put in a row like they would in the old days. These homes are really well kept up for how old they are and they have guides to help you almost everywhere you go. \nThey have information plaques everywhere and they give you a map to everything that you can and would ever want to see. \nThis is a great way to learn about the history of Utah how it was settled and why. They also have old pioneer games that my kids loved playing. There is so much to do that it is hard to get it all done in one day. \nThe best and worst days to go are the free ones. They have so much going on and a lot of extra activities but it is also packed and if you are pushing a stroller around the dirt Rhodes really make it hard."
  ]
 },
 {
  "name": "Utah Museum of Contemporary Art",
  "address": "20 S W Temple, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e8ab014c-9333-11ea-adba-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=13364217412011724080",
  "source": "GoogleMaps",
  "reviews": [
   "It was small.  Didn't really like the current exhibit.  Walk way to downstairs seamed unstable.  Nice atmosphere.",
   "So amazing. There is a 5 dollar recommended fee. But you can pay it at the end.",
   "This was a fun place to visit during an afternoon I spent downtown with my wife. There is no entry fee, but they encourage donations. I spent about an hour perusing the upper- and lower-level exhibits and saw a surprising array of art in a multitude of unique forms. \n\nThey had videos, paintings, a live musician, and all kinds of abstract artwork. All of the art in the museum was strikingly evocative. If I have a single complaint, it's that I felt like the descriptions of the artwork and the inspiration behind each piece were all forceful attempts to shove the artists agenda or perspective down my throat instead of letting the art speak for itself.\n\nAll in all, a very fun place to visit.",
   "Fantastic art installations, but unfortunately the staff are extremely rude and honestly homophobic. I would have loved to enjoy the beautiful art without being constantly pestered and “encouraged” to come back another time. Honestly a horrible experience and I will never return.",
   "Was under construction for this visit. Optional donation for entrance. We paid $5 each, due to their Construction some of the displays were closed, but what we were able to see was interesting and informative. I always enjoy my trips here."
  ]
 },
 {
  "name": "City Creek Park",
  "address": "Salt Lake City, UT 84103, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e8f0bd14-9333-11ea-9f67-14b31f159f22.png",
  "tags": [
   "hike",
   "walking",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12389509335901379207",
  "source": "GoogleMaps",
  "reviews": [
   "It is a very lovely park with the water of a stream running through it. \n\n It's built on a Hill that is fairly steep and good exercise to hike up. The views in the park are of the city all around it.\n\n Salt Lake City is a very clean city and has wonderful architecture and the park is very close to the capital implying that it is very secure which it is. \n\nI remember they had a water phone but I don't remember any bathrooms.",
   "A small park, mostly covered in trees with benches galore. A little man made pond and waterfall sit in the middle of it all, babbling away. A few gorgeous bridges to cross and snap pictures of! A good place to rest while walking around town.",
   "Cool little park to walk around and spend some time while in the city.",
   "Love taking my dog here to run around in the middle of the night. It's not too crowded and it's not fenced in. Great park.",
   "Well maintained, friendly people, lots of various trails in the back to walk around. Plus it is dog friendly! I would have done 5 stars but there were too many dogs off their leashes."
  ]
 },
 {
  "name": "Ensign Park",
  "address": "Ensign Peak Trail, Salt Lake City, UT 84103, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e93e8f1e-9333-11ea-9ee8-14b31f159f22.png",
  "tags": [
   "hike",
   "historic",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=3254052131324887055",
  "source": "GoogleMaps",
  "reviews": [
   "Very easy trail up to the peak. The current conditions with the snow melting makes the trail 100% thick mud. Wear shoes and pants you don’t mind getting wrecked or that you’d toss out after. Once April rolls around it will dry out. Just in time for the smog to clear up making the view that much better.",
   "It was a fun little hike. Its not very steep. It’s about half a mile and it has a pretty view. It’s very historic. We went at about 9 in the morning and there wasn’t really anyone.",
   "A beautiful place to hike. It’s not too long which is nice and the trail is very wide. The view of the city is gorgeous! A must do if you’re in salt lake",
   "There are a gorgeous sunset and a view that you can watch. Although it is hard to go up and even harder to go down. Make sure you are wearing nonslippery shoes",
   "Be careful parts of the trail are really muddy and the view is worth it!"
  ]
 },
 {
  "name": "Brigham Young Historic Park",
  "address": "North Temple & State Street, Salt Lake City, UT 84103, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e9953b00-9333-11ea-a714-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10290825926277477096",
  "source": "GoogleMaps",
  "reviews": [
   "Just love go here because it's so peaceful and always seem to feel the spirit no matter what time day or night it is I'm there",
   "Attending one of the summer concert series performances.  Beautiful park manned by friendly welcoming people.",
   "Nice little park next to the temple, and church office building. When Pokémon Go came out this park was crowded on summer nights because there are three stops tucked away in the back. It is also filled with some fun facts about pioneers and early Utah living. Like Brigham Young’s “large” family.......",
   "Throughout the summer there are free concerts held here and they are always high quality shows. Plus on a nice Summer night it's just nice to be able to hang out outside. You can park in City Creek and the concerts are short enough that you can make it back before you're two hour limit, and free parking, expire!",
   "Incredibly peaceful park. Great for relaxing and spending time with the family, with plenty of shade and room for sunshine. Very lovely statues, and a small stream that runs through it."
  ]
 },
 {
  "name": "Tanner Park",
  "address": "2660 Heritage Way, Salt Lake City, UT 84109, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ea067374-9333-11ea-87ac-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "walk",
   "hike",
   "pets",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=10537182527460400915",
  "source": "GoogleMaps",
  "reviews": [
   "Great little park to take your fur friend. All year long the dog pond and trail is open to hike. Moderately easy hike, the trail is nice and wide with plenty of room for your leashes dog and others to walk freely. Great in the summer and fall. On warm winter days it can also be great with minor snow fall.",
   "A great place to take you dog for off leash walks. It's a fairly long trail with lots of places for your puppy to run around. Just have to be careful around other people's dogs since not all dogs are trained as well as they should be.",
   "The beautiful views! Right at the mouth of Parley's Canyon, this park is a wonderful place to hike, walk, relax and play with your dog(s). There is even access to a shallow creek for dogs and people alike. So fun!",
   "I really wish people were more responsible with CLEANING UP AFTER YOUR PETS!! \nThis is a great park that's is being ruined by careless people... more than enough donated bags are provided. Just bagging it and leaving it on the trail does NOT count... -_- come on people...",
   "Great dog park! Generally the park is open to everyone but it's primarily seen for the Dog park aspect. The trail system is decent and spans far enough that you can do the whole walk in about 30 minutes depending on how well your dog keeps up and how long you let them play vs walking. This is also the exit side for \"Shoot the Tube\",  but I've never seen a dog find it too distracting. I have seen multiple dogs need to be saved from the currents though, keep an eye on them in the water."
  ]
 },
 {
  "name": "Pony Express National Historic Trail",
  "address": "2423-2599 Sunnyside Ave S, Salt Lake City, UT 84108, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ea5074f4-9333-11ea-874b-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12388642014696977619",
  "source": "GoogleMaps",
  "reviews": [
   "Interesting monument near This is the Place Heritage Park dedicated to the Pony Express. Well worth visiting for a good overview on the Pony Express, which came through this canyon.",
   "Fun to visit and read about all the events the riders had to endure.",
   "Was hoping for a really cool monument and it wasn't bad. If you are in the area stop by and see the monument. There are a couple of attractions in the area that you can see. Maybe in the summer there is more actions but in the winter nobody was there. So parking was easy and no admission fees.",
   "A great walk through history. The information at the monument was instructive. The views from the monument are breathtaking! A beautiful place to visit.",
   "Great history"
  ]
 },
 {
  "name": "Memory Grove",
  "address": "288 N Canyon Rd, Salt Lake City, UT 84103, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eaa65d5e-9333-11ea-baab-14b31f159f22.png",
  "tags": [
   "hike",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=17376800103985223676",
  "source": "GoogleMaps",
  "reviews": [
   "My dogs love the trails and water. They actually look like there smiling when we are there.",
   "Beautiful little place to go on a short hike or a longer hike if you go up City Creek, with dogs or friends. It sometimes gets busy and you can't find parking, so you may have to plan your adventure in advance.",
   "Great park to walk your dogs. Just make sure you get to the off-leash part of the park before you take their leash off. It's a nice alternative to Tanner Park and has a stream running throughout.",
   "I love this place. It’s so peaceful. Beautiful scenery",
   "One of my favorite places.."
  ]
 },
 {
  "name": "Jordan Park",
  "address": "1060 S 900 W, Salt Lake City, UT 84104, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eb02ae6e-9333-11ea-bce9-14b31f159f22.png",
  "tags": [
   "walk",
   "free",
   "field",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=11716568978489141569",
  "source": "GoogleMaps",
  "reviews": [
   "They have a nice dog park here with trees. Glad that there is at least one decent dog park on the west side. It does need a slight improvement on one of the spring loaded gates on the north side. Majority of people that show up to this dog park are decent enough to clean up after their dogs.",
   "Cool Chinese monuments/statues. Cool park to walk around and look at stuff, as well as play Pokemon go, there's lots of gyms and pokestops here. Good place to take pictures also. I recommend this park",
   "Beautiful park! The peace gardens are amazing. It’s a free international museum. Highly recommended if you’re around any time of the year",
   "This place is so nice. Diamond in the rough of this part of the city. Gardens, sculpture, play grounds, skate park, pavilions, dog park, baseball field, open grassy areas. Love it.",
   "What a great park! It seems newer since the trees are pretty small and that means there's not much shade. But go on a cloudier day and you will have a great time.\n\nThere's a flipping zip line! It's a once in a lifetime experience, for sure.\n\nAlso, the covered seating areas are pretty nice and there's plenty of space to walk around and play."
  ]
 },
 {
  "name": "Fort Douglas Military Museum",
  "address": "32 Potter St, Salt Lake City, UT 84113, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eb59345c-9333-11ea-8ad6-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "history",
   "free",
   "history",
   "knowledgeable",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12782092009642707819",
  "source": "GoogleMaps",
  "reviews": [
   "Great museum with lots of displays with a very knowledgeable staff.  Patrick was our guide and did a great job explaining the exhibits to our group.  \n\nThere was NO admission fee.",
   "Staff hospitality was great! Educational...my 8 year old son loved it! I loved the tribute to nursing!",
   "A very interesting look into military history of Utah, the staff were very helpful and friendly.  My son loved all the exhibits, thanks and helicopters.  That stop made his trip to Utah even more exciting. A must go if you are in the area.",
   "If you love history this is the place for you. It has really cool stuff! Especially outside in the back. Big helicopters and tanks! Free admission. Donations are always welcome. Definitely worth your time. I would highly recommend.",
   "Must see if you enjoy history of Civil War, WWI, WWII. Takes about 90 min to see everything,  the volunteers were friendly and knowledgeable. Entry is free, donations welcome. Good for all ages"
  ]
 },
 {
  "name": "City Creek Natural Area",
  "address": "375 120 E, Salt Lake City, UT 84103, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eba11302-9333-11ea-832a-14b31f159f22.png",
  "tags": [
   "nature",
   "walk",
   "hike",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=14860600713721067024",
  "source": "GoogleMaps",
  "reviews": [
   "One of my favorite places to explore. It’s very well maintained. I love how fast you can feel immersed in nature. I’ve done some fishing lower in the river. The hiking is great. Dog friendly up until the water treatment plant.",
   "Absolutely wonderful area to walk, hike, explore, jog, bike ride, and take the dogs out for a walk. Lots of trails for all fitness levels. Guards at gate are friendly and helpful when available. Numerous trails available which are not on any maps. A variety of animals roaming at times if you happen to be lucky enough to spot them. Lots of picnic tables, restroom, and water fountain for use on paved road near the stream. Nice place to relax near the stream at the picnic tables at times. The tables are located about 3 every 1/2 mile on paved road. The road is 5 miles up to the rotary club park. There are 30 picnic tables up to the end at 5 miles which evens out to roughly 6 per mile and 3 per a half mile. There are some markers for the first 2.5 miles that mark each 0.5 miles up road from the guard post. During main season around June to October they alternate days between allowing cars and bicycles on the road. Even days are cars since most holidays are on even days. Odd days bicycles are allowed. Pedestrian are allowed any times. The area is open daily until 10pm. The restrooms close at 6pm during off-season and 10pm otherwise. During off-season both bicycles and pedestrian are allowed to use paved road and it remains closed to vehicles except for the main season. A few miles away for one week only in October there are deer hunting.  Water is turned off from around December? until May due to weather and freezing of pipes. A must visit in fall when the leaves change color and at sunrise or sunset and view the color of rising/setting sun across the valley to the South. \n\nThe only thing to keep in mind is that after spending some time in the natural area or it's trails, a person might enjoy it enough that they fall in love with the area due to the wonderful aspects it provides.",
   "Love this area, beautiful views and so many activities to choose from. Great biking or hiking trails and very pet friendly too!",
   "Awesome place! Totally recommend for a nice walk, take the dog, bike it, or even grab a longboard if your feeling it. Great place that's close to the city, like 5 minutes from downtown close.",
   "Very well laid out area. Fin to visit with family friends for events, going for walks on their beautifully laid out trail that's paved. Excellent views of The Valley from above and of olympus mountain."
  ]
 },
 {
  "name": "Washington Square Park",
  "address": "451 State St, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ebece800-9333-11ea-974e-14b31f159f22.png",
  "tags": [
   "food",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=13193277812690702236",
  "source": "GoogleMaps",
  "reviews": [
   "Mayor's office and others related to Salt Lake City Corporation. Great place to stage protests like this one: Mom's Demand Action on gun control issues. Washington Square park hosts the Living Traditions festival and others. It's a beautiful building that was recently refurbished, the gargoyles , clock and the outside of the building. A huge project lasting several years and of course it was stabilized for earthquakes.",
   "Very pretty. Was able to take some great pictures!",
   "It's pride weekend! Food is amazing. Make sure to check out the food truck side and try a completo from Noemi's catering and cheese empanadas 😍",
   "What an amazing 'City and County Hall'-building! Outside aswell as inside. I didn't know where to look first, let alone if you like taking pictures, this historic building definately has it all.\nAmongst the citizens of SLC this beautiful piece of architecture is commonly known as \"The Castle\" where you have to go to to pay your parking fine... 😉",
   "Beautiful architecture. Quiet and peaceful."
  ]
 },
 {
  "name": "McCune Mansion",
  "address": "200 Main St, Salt Lake City, UT 84103, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ec4da600-9333-11ea-8543-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=1758710367364677384",
  "source": "GoogleMaps",
  "reviews": [
   "Recently went to the McCune mansion for my wife’s company party and it was a great experience. The house is very well maintained and you can roam around with plenty of access. Rumors were that the house was haunted, I however was not able to experience the haunted aspect even after a few drinks haha. Good place.",
   "The McCune Mansion is one of the impressive homes on Capitol Hill in Salt Lake City, Utah.\n\nBuilt in 1900, Elizabeth and Alfred McCune had it built as a replica of a home they saw in New York City.\n\nThe 21 room mansion overlooks Temple Square and downtown Salt Lake majestically from a small hill and has materials from many parts of the world.",
   "This place is breathtaking! We had a meeting in this mansion. The rooms have marble fireplaces. The painting hung threw out the home are unbelievable!",
   "Such a beautiful, vintage venue. It worked so well with our couple's vision for their wedding day. The staff was so kind and helpful!",
   "Exquisite mansion that we went to while in town for the doTERRA global convention.  It was catered and the grounds are beautiful with a wonderful view of salt lake city."
  ]
 },
 {
  "name": "The Living Room Trailhead",
  "address": "383 Colorow Rd, Salt Lake City, UT 84108, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ec929e5c-9333-11ea-8f99-14b31f159f22.png",
  "tags": [
   "food",
   "walking",
   "kids",
   "hike",
   "hike",
   "adventurous"
  ],
  "link": "https://maps.google.com/?cid=15482283410364032344",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great walking trail.  It was a little more tricky than i expected, some of the trails are very narrow, with steep drops if you get it wrong.  I went in February, so trail had some \"ice\" on it.  i forgot to bring my ice cleats with me, I strongly recommend you bring them.  Beginning of trail is very muddy, and in some sections it is also very muddy in \"gully\" areas.  Most of trail great for walking on.  The views are spectacular, well worth the effort.  There are no facilities here , no rest room or water.  So bring your own water, some food, fruit, as it is a good work out climbing this.  On the trail today I saw people from all ages, as young as four years of age to what looked like over 55 years of age.  Great views, multiple trails to take.  No real signage, so suggest you have alltrails app or something similar.  There is plenty of parking spaces at trail head.",
   "Nice trail. We went during winter so there was snow on the ground. It was quite muddy due to the snow so I'd recommend boots. Parking is along a road and I believe there is a nearby parking lot, but we just parked on the side. It was an easy trail. We took 2 toddlers and a dog so we only did half of it since the kids weren't up for the full trail. It had beautiful views of the mountain and the area though. I'd definitely go back again, but maybe ending of spring would be nicer for us.",
   "Really nice intermediate trail with lots of options to increase the difficulty if you like. Great views of SLC. We opted for the less traveled paths and it took us right at 2 1/2 hours total (up and back). Worth the time.",
   "Such an amazing hike I did it twice in one day. Breath taking views and a must for anyone who enjoys a moderate challenge. Close to downtown too.",
   "For out of towners- Not \"easy\" but definitely possible. It starts in a nice little wooded area then you come up and out onto the main flat trail on the Bonneville shoreline. Continuing across you start a gradual climb weaving up and up and up. It gets narrow in a few places and they are single file. Then you start making a big turn to the left and more rocks and elevation. Along the way was beautiful wild flowers and on this left turn you can start to look out over slc. Continuing further the climbing trail feels very steep and but keep going! You turn again to the left and things get easier and smoother and the views increasingly get better! When you come to the top of that gentle rise you can get your view of all SLC and the Salt Lake. We came at sunset and it was worth it. There indeed is furniture in the form of rocks that have been compiled together for sitting places. If you are adventurous you can turn to your right and make your way up further on this summit. But you will have to actually climb and there are large slates of loose rock to watch out for. \n\nThe trip back down after sunset was a breeze. And the cool air was great! And you get to see the night scape of the city on the way back down. I definitely recommend good shoes for loose rock on downgrades. It was a lively hike!"
  ]
 },
 {
  "name": "Millcreek Canyon",
  "address": "3800 Millcreek Canyon Rd, Salt Lake City, UT 84124, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ecdb404a-9333-11ea-ab57-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "family",
   "free",
   "hike",
   "kids",
   "family",
   "food",
   "hike",
   "hike",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7866801674116300986",
  "source": "GoogleMaps",
  "reviews": [
   "My family and I love this canyon. I’ve been coming here my whole life for Cub Scout camp and for campfires and picnics. We’ve tried to continue with our kids so they can experience the beauty of the canyon. There is a ton of shade near the picnic sites with the water running nearby. The canyon is well known for its many hiking trails. You pay when you leave the canyon, it’s $3 per car.",
   "I’ve gone to Millcreek a lot. It’s really nice and has a lot of trails that are long or short and all are absolutely gorgeous. Some are just right off the road too, so there’s no need to travel far for them. Others lead to beautiful waterways, or fantastic lookouts. Some trails are paved, others are not. There are also a lot of free picnic areas you can sit and snack at before or after your hike. However, whatever trash you bring in you take out - they don’t have garbage cans up there. Definitely a place to take your family and furry friends.\nThey also give discounts to seniors and if you come on certain days dogs are allowed off leash.",
   "Great place for picnic and easy hikes. The stream goes along with picnic area and hiking trail so you will always can feel fresh air, the sound of running water helps to heal your soul, really relaxing. They have nice picnic tables with fire rings so you can grill food and enjoy the wood with your family. I definitely recommend this place for families, kids and dogs to hike.",
   "Such an absolutely beautiful canyon. Extremely close to the city, it's very clean, roads are excellent, so many trails to hike, bike and dog friendly, cute bridges everywhere, the restaurant is amazing. \n\nThis canyon is perfect for so many activities! Picnics, biking, amazing trails, family reunions, ect",
   "Such a beautiful canyon with many hiking trails, picnic sites, beautiful creek, ample parking and pit toilets. Go early during summer because it gets very hot as the day gets long. Take plenty of drinking water and hiking poles are quite helpful.\nHiking is easy to strenuous depending on the trail, dogs are allowed on leash on odd days, cyclists on even days.\nThere is a fee or an annual pass."
  ]
 },
 {
  "name": "Rotary Play Park",
  "address": "Salt Lake City, UT 84105, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ed4a561a-9333-11ea-bce2-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "eat",
   "kids",
   "learn",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7738975773777340005",
  "source": "GoogleMaps",
  "reviews": [
   "This was a fun place to stop for a picnic while visiting Salt Lake. There were plenty of trees, offering some shade, and lots of space for the kids to run around. There are also several play structures and swings. It looks like they have water features to play in, though these were turned off while were were there. My older boys liked the chess boards built into the tops of the cement tables and wished we would have brought a set to play with.",
   "Fantastic park for adults and kids. Plenty of space to eat and play or watch you kids play!",
   "Great play place for kids. Located in Liberty Park. It's the bigger play ground and there is tons to do.",
   "Other than a little needed upkeep it'sa great place for kids to learn and explore.",
   "My son had a lot of fun playing here. Sucks that the mallets to the instruments are often missing though."
  ]
 },
 {
  "name": "Salt Lake City Council Hall",
  "address": "300 State St, Salt Lake City, UT 84103, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/edaa515c-9333-11ea-8b9d-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "history",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=16037682323626406678",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to see and just hang out. Everyone really knowledgeable and nice. Nice history",
   "The great gift shop that used to be here is gone.  Ok place to visit, but could be great.",
   "Loved the store. Lady there was extremely helpful. She also said we should get lunch at the cluck truck across the street.  We did and we were very impressed by the whole experience.  Hawaiian wraps were delicious!",
   "It was closed when we stopped by, but a nice view from the place.",
   "Nice place to start the visit."
  ]
 },
 {
  "name": "Lindsey Gardens Park",
  "address": "426 M St, Salt Lake City, UT 84103, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/edf786b6-9333-11ea-bb30-14b31f159f22.png",
  "tags": [
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7644625146495477231",
  "source": "GoogleMaps",
  "reviews": [
   "Lindsey Garden Park is the perfect place to take your child with an irrational fear of the undead. Just let your child play for a while on the lovely playground equipment and then point out The cemetery nearby full of dead people. Your child is sure to realize that the dead do not come back to life. They stay dead in their graves and playing at Lindsey Garden Park is fun.",
   "I think this might be my favorite park in Utah,  when memories are concerned.   One of the best days of my life happened here!   I'm still mad for this Girl and I wouldn't have it any other way even though we're both in pretty crappy situations.   Mine is getting better day by day though.  So, when I am good she will have a place to find herself and her own good.   Lindsey Gardens will always get five stars from me because it is part of my Love story.",
   "Big open area for dogs to run around. This is not a fenced park so make sure your dog comes on command. It's a nice area in the avenues with a good view of the valley.",
   "Great park, there's a lot to explore and walk around",
   "The park is incredibly nice lots of shade baseball diamond kids love the playground"
  ]
 },
 {
  "name": "Chase Home Museum",
  "address": "1150 S Constitution Dr E, Salt Lake City, UT 84105, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ee56bdb6-9333-11ea-bd68-14b31f159f22.png",
  "tags": [
   "walk",
   "free",
   "family",
   "historic",
   "history"
  ],
  "link": "https://maps.google.com/?cid=121215376597454015",
  "source": "GoogleMaps",
  "reviews": [
   "Cute little Museum nicely placed in the middle of the park, Interesting stuff in the museum, quick walk throw is worth the time.",
   "Perfectly sized for lunch break viewing. Great variety in the displays between the 3 galleries. Honestly it left me wishing it was twice as big",
   "An interesting and free little museum and historical home.",
   "Very little to see here that was historic.  Turned into a cultural museum about other countries.  Nothing about Mormon pioneers or the history of property or original family.",
   "The exhibits were interesting, and the man at the desk was helpful. There's a whole reading room with activities for children that we all enjoyed. It was a good experience, but I'd like more explanation for the exhibits, like what the tools were used for or why they made these things."
  ]
 },
 {
  "name": "Sunnyside Park",
  "address": "1735 Sunnyside Ave S, Salt Lake City, UT 84108, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eea5a14c-9333-11ea-9146-14b31f159f22.png",
  "tags": [
   "walking",
   "field"
  ],
  "link": "https://maps.google.com/?cid=568697047625706983",
  "source": "GoogleMaps",
  "reviews": [
   "The city works really hard to keep this park clean.  They do an amazing job.  Baseball fields.  Tennis courts.  Walking paths.  A few homeless.. winter months no restrooms but they do provide a port a potty.  Dogs on leash please and bring a snack.  Covered pavilions with tables.  Enjoy your tax dollars at work.",
   "The fields are kept in great condition. There's lots of space to run, and plenty of trees for a shady sit-down.",
   "Large parking lot, a ball field, bathrooms, space to run swings and of course playground equipment! What more could you need. This park is also a location for child lunches from the school district for the 2018 summer. There are shaded areas and benches. Also a drinking fountain. Fun place to be located near the university of Utah.",
   "We play on a coed flag football team here and I absolutely love it.  The bathroom is always clean and the overall park is taken care of.",
   "Great for very early sunrise hikes."
  ]
 },
 {
  "name": "Wheeler Historic Farm",
  "address": "6351 S 900 E, Murray, UT 84121, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eefff698-9333-11ea-b1ec-14b31f159f22.png",
  "tags": [
   "walk",
   "field",
   "unique",
   "walking",
   "family",
   "history",
   "family",
   "field",
   "kids",
   "family",
   "food",
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=5316276837559437855",
  "source": "GoogleMaps",
  "reviews": [
   "I love wheeler farm. The southern parking lot is great for when the farmers market is in season. Southern parking lot also has the playground and a large field for frisbee or football or anything like that.  The northern parking lot is smaller but I prefer it because you can walk straight up the paths to the animals. Further past the animals is a nice set of paths that are great for walking. We've seen snakes, squirrels, voles, foxes, red tailed hawks and during migration seasons there are a ton of unique birds flying through the farm. Great place to walk the dog. Love this place.",
   "Been a long time since I have come here but worth every minute of time you spend. Beautful scenery, entrenched in the rich history of the area. I have visited here many times with family and friends. I love coming back to catch old memories and feel the joy of this wonderful area. Thank you for keeping it so nice!",
   "This is a Utah gem! I’ve been coming here for years. Love seeing the animals. Love the activities and love being able to take my son and have him run around interact with animals and participate in the different activities. This is also a cool place to have birthday parties or just having picnics with friends or family.",
   "This is a wonderful place to take the children. Go for family photos even if you take it yourself. They have different events through the different seasons. you can no longer bring your own bread as it's actually bad for the birds. You can bring proper duck food or buy some there when they are open during business hours. The farm is always open to go see. The kids still love the old clubhouse to climb into. The large park is in a great open area. They even have a smaller park for the little ones right next to the big one. A mom could sit on a bench and see both kids. They have a large open field as well if you want to bring a bat and ball. We've done a few birthday parties here.",
   "This is a great place to visit with children, but I visit all the time by myself just to go for a walk. It is free to walk around the property and they have everything from farm animals, to vegetable gardens, flowers, a river, natural grass and forest areas, ducks, wood carvings, and a children’s play area. I really do like the farm!"
  ]
 },
 {
  "name": "Governor's Mansion",
  "address": "603 E S Temple, Salt Lake City, UT 84102, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ef5d8048-9333-11ea-843e-14b31f159f22.png",
  "tags": [
   "tour",
   "historic",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=6475818472059632294",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful, historical architectural building which is  great for shooting pictures. I only managed to do so from the outside last week but thoroughly enjoyed soaking in as much details as possible. \nFrom downtown SLC it's a beautiful stroll down this street where you'll find lots more of historical, interesting buildings and Mansions!",
   "CLOSED to the public. It is pretty from the outside but there is nothing you can review about it because it is CLOSED TO THE PUBLIC. \n\nThe \"US Bus Utah company\" hop-on bus tour we took advertised this as a stop. It isn't even open to the public. It's very pretty from the outside but why would anyone want to get off the bus especially when the bus won't be back for 2 hours on the next run. \n\nDO NOT ADVERTISE THIS AS A TOURIST ATTRACTION  because you cannot even go inside it. This Google Places listing is misleading. And if you're a tourist visiting Salt Lake City, beware that US Bus Utah hop-on bus tours is very deceptive and dishonest.",
   "Agree one of the most gorgeous historic buildings on South Temple.",
   "I took a tour of the governors mansion June of 2018. Beautiful architect, beautiful home inside, I wish we could have seen more of the home such as the ballroom (top floor)and perhaps a design, sketch or floor plan of the 2nd floor- the private residence of the Governor, because the tour was too short. Also, we did not get a tour of the yard, and I felt rushed to leave otherwise I would have taken a picture of me outside because taking pictures inside the mansion is not allowed.",
   "Second most impressive building of the East Side of the South Temple Street. Belonged once to an old billionaire of Utah, who himself had a very interesting life."
  ]
 },
 {
  "name": "Cottonwood Park",
  "address": "1580 W North Star Dr 300 North, Salt Lake City, UT 84116, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/efc0d61e-9333-11ea-8924-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "family",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=6023943320872334749",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome local park, not huge but party that runs parallel to a quasi River or Waterway. The grass is well-maintained.",
   "The dog park here is amazing! I met some great people while letting my dogs play here! The park is a fun place for kids, teens, and adults! They have cute plastic hammocks that I love to lay on while letting my siblings play here! The homeless community seems scary from afar but they are actually very nice and great to talk to! I highly recommend coming to this park to walk your dogs, let them play, and let your kids play!",
   "We loved this dog park. It is well kept. The locals help with that and someone brings gallon jugs of water for all the dogs and sets them on the tables. The people we met were all so nice and great dog parents. My do had so much fun. I highly recommend this dog park.",
   "Cottonwood Park is small urban park in the Fairground community, near the Jordan Meadows community. During the summer the park is very busy. People come to enjoy family outings, play volleyball, basketball or even cricket. The small playground is often filled with children.\n\nWalkers and runners use the paved paths in the park year round. The park's east boundary is the Jordan River. Across the river is Jordan River Parkway which is also heavily at times.",
   "If the parks Dept would remove the homeless hut built just ten steps after the bridge that goes over the water on 5th N and Jordan parkway I would feel safer. It is too scary with all the debri to hide people in the very large hut."
  ]
 },
 {
  "name": "Tunnel Springs Park",
  "address": "1080 Eaglepointe Dr, North Salt Lake, UT 84054, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f0234248-9333-11ea-9784-14b31f159f22.png",
  "tags": [
   "field",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11141488769796364163",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful park to take photos in. It has a big open field and you can see the sunset come down just beautifully.  I would suggest taking mosquito repellent. The mosquito's are bad up there. The amount of people that were there taking photos was unreal. But it sure was beautiful and our photos turned out great.",
   "If you come here in the heat of the season you will find the hillsides dotted with the Wild Bride and her oft accompanying Groom. Observe them in their complex mating rituals. Some will be successful, some will not. \nIf you look closely in the accompanying photo, you will see that I have captured an image showing this mating ritual. You too, may be successful. \n-David Attenborough",
   "Love this park for photos! Doesn't require much walking/hiking for brides, and it's beautiful pretty much any time of year. There's also an area with some tall reeds that's really nice!\n\nPhotos by Natalie Michelle Photo Co.",
   "Wonderful location.. Great spot for family pictures.  We were extremely fortunate that the inversion was not bad today. At 3:30pm, the temp was 26, but the photographs were beautiful.  Can't wait to see it in the summer.",
   "Beautiful park, well kept, great for photography."
  ]
 },
 {
  "name": "Mueller Park Picnic Area",
  "address": "Mueller Park Rd, Bountiful, UT 84010, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f075e350-9333-11ea-b206-14b31f159f22.png",
  "tags": [
   "hike",
   "family",
   "walk",
   "nature",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=10949295748272591533",
  "source": "GoogleMaps",
  "reviews": [
   "This has to be one of my top 10 favorite places to hike. Amazing anytime of year! There is a good combination of shade and sunshine. Pretty rocky the further up you go. Also watch out for bikers!",
   "I love going biking at Mueller Park. It's a challenging trail going uphill, but totally worth it. Usually gets crowded during sunny days, people on bikes, people hiking with dogs or people running. Watch out on corners! Beautiful from Big Rock to look down at the Great Salt Lake and surroundings. I would choose the sunset time to go up there. Grab some water with you!",
   "I love that park. It's perfect for the little ones and to take pictures during any season. Perfect spot for family hangouts with firepits on location and facilities for picnics... It's perfect!",
   "Such a beautiful place to go! Walk around, enjoy the nature, have a campfire and enjoy life.",
   "Easy 7.3 mile out and back trail.  Wide and well maintained.  Popular with mountain bikes who aren't courteous and expect the hikers to always get out of their way.  Overall a nice hike except for the pushy mountain bikes.  Maybe everyone could start following the \"party going up hill has the right of way\" rule."
  ]
 },
 {
  "name": "Murray Park",
  "address": "296 E Murray Park Ave, Murray, UT 84107, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f0cbcbb4-9333-11ea-a6c4-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "food",
   "music",
   "walking",
   "family",
   "walking",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1242524381665348101",
  "source": "GoogleMaps",
  "reviews": [
   "This park is fantastic! It's big and secluded enough that you sometimes wouldn't believe that it was in the middle of a city. There is a path that goes directly up the middle of the park that is a lovely walk. There is such a variety of things here too there are multiple play places and even those adult exercise equipment things! This would be a great place for a family activity or a date or really anything! I also love the anti Audra gun bear the West entrance.",
   "I absolutely love love love this park!! I’ve been coming to this park for years. It’s a massive park and there is so much you can do. There is a kid play area that has awesome musical features. There is an outdoor work out area. There is a community center and indoor pool with an outdoor pool. There is a pickle ball court. There are large fields for soccer and there are a couple of baseball fields. There is an amphitheater, picnic areas, and a stream that flows through the park. There is a farmers market and food truck type events that happen often. My son and I will continue to visit. It is a jewel of Murray City.",
   "So much fun for all ages. From the swing sets, to the multitude of slides and fun spinning devices on the playground. It's great for even my 18 month old, she really enjoyed the music features that were built in next to the playground. There are loads of walking areas and the park was very well maintained.",
   "My family and I love this park. There are so many fun walking trails. There are a few different playgrounds to enjoy as well.\nWe have seen soccer games/practices going on here. Baseball games as well. It is very family oriented, and is usually popular with people as the weather warms up.",
   "Great park, awesome kids pool.  Indoor pool has a really nice baby play area and a big slide for older kids that parents can take the toddlers down as well.  Great way to kill a few hours as a family for less than $20."
  ]
 },
 {
  "name": "Cytybyrd Cafe",
  "address": "450 S 200 E, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f1188c4a-9333-11ea-9efe-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2336467422585109709",
  "source": "GoogleMaps",
  "reviews": [
   "Really cool place.  The food was awesome. We did the stir fry bar they had and Ruben sandwich with Cajun waffle fries.  The price was very reasonable.  The waitress and the chef were very polite and friendly.  Only complaints are that they didn’t do very good at filling my water and the baby chair we used had no table on it( it looked to me missing).  Even with those, it definitely deserves 5 stars. We for sure will be coming back. Loved it.",
   "It's a cute little cafe inside the city building. The food was good, and our waitress was polite, but they took a little while longer to get our food than we expected. Perhaps we were in too much of a hurry.",
   "What a wonderful spot tucked in the split basement of Washington Square.  They pay attention to detail and taste. Bravo.",
   "The cafe is inside the City Hall, underground.  The interior of this cafe is more upscale restaurant than a cafe, with arts, high multiple arc ceiling and classy bar counter.  The server is friendly and attentive.  The steak was a bit over done, meat already cut when served, savoury, taste evenly spread.  Yet it was $14.  The place was not crowded.  Highly recommended.",
   "Totally disappointing. At the time I'm writing this review this place has 4+s with over 200. reviews I stopped by at lunch time and ordered their grapefruit and beet salad with chicken and my friend got a breakfast sandwich with fried eggs, sausage and cheese on toast. It took them around half an hour to get us our order, by the time we got our food we had finished way ago our glasses of prosecco. There were only four pieces of chicken in my salad and the bread that came with it was cold as they just got it out of the fridge. The salad did taste good though. My friend's sandwich was rock solid, but also tasted good. Definitely not a 4+ stars place."
  ]
 },
 {
  "name": "Gardner Village",
  "address": "1100 W 7800 S, West Jordan, UT 84088, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f165c218-9333-11ea-b167-14b31f159f22.png",
  "tags": [
   "kids",
   "wander",
   "eat",
   "kids",
   "food",
   "knowledgeable",
   "delicious",
   "eat",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12644309139147506003",
  "source": "GoogleMaps",
  "reviews": [
   "Gardner Village is such a great place to go wander and eat. It's so relaxing and we especially love going during Halloween to see the witch displays. I also love taking my kids at Christmas to see all the elves. The shops are fun, but they change too often. We miss the doll shop and Christmas store!  I would definitely recommend spending an afternoon at Gardner Village.",
   "The shops are cute little shops with things ranging from kids toys to books to antiques to clothing to costume pieces to food, e.t.c. There's even a petting zoo across the street. The themed times (like around Halloween, for example) can be fun, but very crowded. Most stores are NOT stroller friendly, though there's often \"stroller parking\" just outside. If you like fighting crowds go whenever. If you don't, try in the morning on a day there's school.",
   "American Rust Company is the place to stop at! Such amazing antiques and all decently priced! Not to mention the manager of the store Dawn is so knowledgeable and is willing to help answer questions! Definitely  definitely do not pass up this shop!",
   "Glover Nursery had their company Christmas party at The Gathering Place in Gardner Village. It was so lovely and cozy. Their chicken was creamy and delicious. I didn't get to eat the vegetarian pasta dish, but it looked amazing too! All around gorgeous and alluring atmosphere. 😉👌🏼",
   "We always make a point to go there each holiday because they do such a spectacular job decorating.  It’s also fun to meet with friends and walk around then end with a yummy lunch at Archibald’s. ❤️"
  ]
 },
 {
  "name": "Church Fork Picnic Area",
  "address": "5802 Millcreek Canyon Rd, Salt Lake City, UT 84109, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f1e579c6-9333-11ea-a20d-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=3093274270988600222",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful scenery for a picnic and family parties. Multiple waterfalls and a river.",
   "Clean campground with a lot of spots. It was a busy day, but people were nice. I wasn't excited about the park fee on the way out, but then the person in front of us paid it for us! \nThere was a reserveable group spot, and lots of private picnic areas that all had firepits. The area is on a river that Cascades though the picnic areas, and it has a nice ambiance to it.",
   "This place is beautiful. It’s great for picnics with small and large groups, and everybody has their own secluded “space” to picnic. \n\nEach picnic spot I saw seemed to have a few picnic tables and a fire pit. \n\nYou do pay $3 per vehicle on the way out and they don’t accept the national park pass. But for a pleasant picnic spot, it’s worth the small fee. \n\nThe scenery is gorgeous. It’s great for an outing in the mountains.",
   "Some of the most picturesque picnic sites you've ever seen, nestled in a steep side canyon within Millcreek Cayon. A stream rollicks through the sites, creating a beautiful atmosphere. These sites can be busy on weekends, and parking can be a problem. This serves as the trailhead to Grandeur Peak as well, which contributes to the crowding of the area.",
   "There is plenty of shade. The creek is beautiful. And it is clean. Overall an amazing place would totally recommend."
  ]
 },
 {
  "name": "Salt Lake City Cemetery",
  "address": "200 N St E, Salt Lake City, UT 84103, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f2574eb8-9333-11ea-aa32-14b31f159f22.png",
  "tags": [
   "historic",
   "history",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7071906759071785393",
  "source": "GoogleMaps",
  "reviews": [
   "It’s an incredibly historic and beautiful cemetery. It’s a fun place to do a scavenger hunt for the gravestone of the prophets of the LDS church. You have an incredible view of the valley at several spots through the cemetery. It’s just a beautiful and peaceful place to take a stroll on a relaxing afternoon.",
   "A beautifully situated cemetery with great views of the Wasatch Mountains, Salt Lake City, and the University of Utah. This serves as the final resting place for many leaders of the Church of Jesus Christ of Latter-day Saints, including most of the presidents of the church, as well as many church apostles. A lot of history preserved in the cemetery.",
   "My Dad is buried in the upper Veterans section. Nobody cares for the Veterans section. Many of the older grave markers in the ground for distant war casualties are long forgotten, overgrown at the edges. I go twice a year to clean up my Dads headstone and pay my respects. Usually on Memorial Day Sunday when is quiet nobody having their picnics in the other sections. Clean up the bird poop on the Bird Colonel's gravestone. He isn't actually buried there in a casket. Just some ashes in a vial.",
   "I love to just visit here you never know who you'll get to see.",
   "A peaceful and interesting place to walk around or jog around.\n\nWant a safe place to walk head to your local cemetery. "
  ]
 },
 {
  "name": "Salt Lake 2002 Olympic Cauldron Park",
  "address": "451 1400 E, Salt Lake City, UT 84112, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f2aa29d8-9333-11ea-881a-14b31f159f22.png",
  "tags": [
   "learn",
   "field"
  ],
  "link": "https://maps.google.com/?cid=16497914731659068532",
  "source": "GoogleMaps",
  "reviews": [
   "I had the opportunity to go to some of the Olympic events in person. It was such a great experience.  I would reccomend  here to anyone who would like to learn more about the Olympics",
   "Not what I had expected. It was not open to public and there isn't a clear view of the cauldron from the entrance to the football field.",
   "Not much to see, acctually. Its better to go TO Olympic park, you will see more there.",
   "Only has cauldron, nothing else. \nAll museum/visitor center materials moved to park city Olympic Park.",
   "Not much to see beyond the university's stadium. There was only 1 banner we saw that was related to the Olympics. I always dreamed of seeing the SLC arena or a more welcoming area."
  ]
 },
 {
  "name": "Herman Franks Park",
  "address": "1371 700 E, Salt Lake City, UT 84105, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f2f0d000-9333-11ea-a02e-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=17239526261908821600",
  "source": "GoogleMaps",
  "reviews": [
   "We love this dog park it keeps getting better all the time they just added some new benches a new dog agility course. The only thing is I have an older dog who doesn't like the tiny gravel rocks and there's not really much grassy area but my young 2 Aussie boys love running in that Park",
   "This place is awesome! Has a lot of room for plenty of dogs. It has a grass side and a gravel side. Lately they've been building more and I can't wait to see what they do.",
   "Always a great place off leash park for dogs",
   "Lot's of dog come to visit there.  A mean dog is there every once in a while but owners are usually pretty good about keeping and eye on things.  It's a fun little getaway for our pup.",
   "We come here often to let our babies socialize and play. Have yet to have any kind of negative experience here. The dog and the people have always been friendly and it looks like they are in the process of adding things so I'm excited to see how it turns out"
  ]
 },
 {
  "name": "First Encampment Park",
  "address": "Salt Lake City, UT 84115, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f33bbbf6-9333-11ea-ba34-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=1352025684555124105",
  "source": "GoogleMaps",
  "reviews": [
   "I love all the rocks and the landscaping is awesome. It would be even more awesome is they added waterfalls to the landscaping to go with all the rocks. Cool and chill place. Loves you all.\nAsalaam peace",
   "Nice little park in a nice little area. It has a few benches and places to lay on the grass. Plenary of shade as well. They have a few flower patches that get a lot of insect life which is fun to catch and snap some photos of. They do seem to have a lot of homeless people hanging around but they try and hid so they stay out of the way. Defiantly a cool spot to check out if you are on a walk but nothing to make a special trip for.",
   "Quiet, quaint with nice rock piles to entertain almost anyone who loves random rock gardens.",
   "It's all about the water baby. Up and down between 200 e a nd 300 e there were the only fresh water springs in the valley.",
   "Like it enough to volunteer again this year. Happy 24th."
  ]
 },
 {
  "name": "Neffs Canyon",
  "address": "4326 White Way, Salt Lake City, UT 84124, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f3a81e4a-9333-11ea-8071-14b31f159f22.png",
  "tags": [
   "kids",
   "hike",
   "nature",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=15241600594789598837",
  "source": "GoogleMaps",
  "reviews": [
   "I can't say enough about the beauty of this hike. Sledding here is a thrill and adventure. My pups can run off leash and I'm pretty sure if they could ask me to take them anywhere it would be here. It's a winter wonderland in winter and I will update my review when summer arrives. Please don't bring your kids here if they are afraid of dogs because this is a very populated canine trail!",
   "I wouldn't say this place is okay. I'd give it 3.8 out of 5. The snow really adds another level of beauty to this short but great trail.",
   "At least in winter and beginning of spring it it is either fluffy Cold Snow(Great for sledding or it's Icy and slippery, and painful if you fall. During that time it's a good idea to wear all snow gear and \"grips\" on the bottom of your snow boots.  You'll be less likely to slip.\nI wouldn't recommend the winter version for beginner hikers. I've never been after snowmelt, I'm guessing that's much easier,  but not Easy.",
   "One of my favorite places to get to quickly and find a little nature therapy. Dogs are allowed and many people have them off leash. \nSo many different trails up this canyon. It really becomes a “choose your own adventure” kind of trail and that’s what I love about it.",
   "Very beautiful stream and has somewhere to sit down and chill at the very top. The weather was nice today. Cool breeze with just enough sun to keep you cozy :) it's a bit steep at first, but there will be a little bank up the stream. From there it's cruising. I believe the trail is a little over a mile which is nice if you want a short hike."
  ]
 },
 {
  "name": "zest kitchen & bar",
  "address": "275 S 200 W, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f400ed08-9333-11ea-8f0d-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "food",
   "drink",
   "food",
   "creative",
   "unique",
   "food",
   "delicious",
   "delicious",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10303443288671584193",
  "source": "GoogleMaps",
  "reviews": [
   "I love Zest! It's hands down the best vegan establishment in the state. Delicious, locally sourced ingredients & an amazing hardworking crew - you can't go wrong. Try the Chocolate Beet Torte, it's guaranteed to blow your mind.",
   "I was traveling on business and, as a vegetarian, it can be difficult to find restaurants with good options.  I'm so glad to have discovered Zest!  The atmosphere is laid back, service was great and the food was amazing.  Everything is fresh and not processed.  They have a great drink menu, but also got a tea to go and I would highly recommend!  Love this place and will be back.",
   "I visited Zest with a group of friends one afternoon a couple of weeks ago. We split the bill two ways, and have had a number of troubles with it. Drinks somehow ended up all on one tab, so I simply repaid that person with cash, while he charged his card. That means my bill should have been for $52 worth of food (2x$16 entrees + $9 chips, + a $9 cheesecake) plus tax and tip.\n\nWhen I got my credit card statement the charge was $99 even. My friend's card was also charged for a completely different amount than the receipt he signed. I think they tried to fix the drink mixup, but the numbers don't add up, and altering a receipt after you've signed and left is shady. All told, my girlfriend and I are into one small meal for $125. Not worth it. We had to open a credit card dispute.\n\nFor what it's worth, the food was okay, but not great. There are much better vegan options in town. The cocktails were really very good, but I wouldn't visit just for drinks.",
   "We’ve been coming here since the day before they got open. Hands down THE BEST vegan restaurant I have ever been to in the world. \nFresh, unique, delicious, complex, flavorful, creative and kind food in stylish, cozy environment. \nEvery bite is filled with flavor and so much joy. \nMy partner who is the biggest carnivore and can’t imagine eating his food without animal protein, LOVES coming here with me and always leaves fully satisfied and 100% satiated.\nThe desserts are otherworldly. \nYOU HAVE TO COME HERE, YOU WILL REGRET IT IF YOU DONT!!! Get the nachos. Just get the nachos.",
   "Zest!!! What an all around amazing experience. Great tasty food that is all plant based. Everything from the drinks, appetizers, main dish, and dessert looked and tasted delicious. The ambience is perfectly set with dimmed lighting and unique light fixtures. Table seating is kind of close but it worked. The service was on point. Patrick made excellent recommendations. Taylor, the manager, was super accommodating. I will be back."
  ]
 },
 {
  "name": "Settebello Pizzeria Napoletana",
  "address": "260 S 200 W, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f44ff768-9333-11ea-99e6-14b31f159f22.png",
  "tags": [
   "delicious",
   "free"
  ],
  "link": "https://maps.google.com/?cid=12007428317260851680",
  "source": "GoogleMaps",
  "reviews": [
   "Gluten free people this is your place! My sister has to order gluten free because of an allergy. It's $4 extra for gluten free crust which is a bummer, but in this case it was worth it! Fluffy, delicious crust instead of flat cracker crust. So great for gluten free people who crave good old fashioned crust! We tried the Margherita which was delicious! They have authentic Italian pizza, my favorite!",
   "I was really optimistic about this place since they had a wood fire oven, turns out I got excited over nothing. Crust was heavier than usual and the toppings weren't really all that fresh. The olives tasted like mayonnaise...",
   "This was one of the best brick oven pizzas places I have eaten at, in a long time. It wasn't overcooked at all. The best pizza hands down would be the margarita pizza. Service was a bit slow when it got later in the night, but it was quite busy. This would be an amazing lunch! Thank you all for the awesome night.",
   "The Pizza was amazing and it was ready really fast. The meatball was tasty and the salad we got was really good too. After dinner we had Gelato in the next room.",
   "This is good pizza. Chatted with the pizza makers and they were able to answer any questions I had as well as super friendly. \n\nI've never has neopolatin pizza before this but I'm a fan. A little pricey for personalized pizza but I'd go again in a heart beat."
  ]
 },
 {
  "name": "Takashi",
  "address": "18 W Market St, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f49c42f6-9333-11ea-81b3-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3530387266263894461",
  "source": "GoogleMaps",
  "reviews": [
   "First time here and it was amazing. Be prepared to wait to get in. We were on wait list for about 50 minutes for a table of two. Waitress was super friendly and knew the products. She was able to explain most of the rolls with no issue. Once seated she was quick to get us started. Food came out fairly quickly. They were good about bringing out the rolls as they were ready. Some places try to make a grand entrance with everything at once. Not here. Amazing dishes. Everything was super fresh. People kept our drinks filled as well, not just our waitress. Team effort.",
   "Sensational sushi selection! You can taste the freshness of all the ingredients. However... Coming here after 6pm should be considered an all night venue. Weekend wait times usually reach 3 hours. Nonetheless, the meals are worth the wait. \n\nAlso, they have a small bar/restaurant with a shared entrance right beside them. I don't remember the name but they have some good cocktails and an eclectic menu that can cater to many.\n\nAnyhow... If you haven't been to Takashi, then you need to go at least once. The ambience is superb and they have a wall of Fame in the front. They are plates that are meant as plaques for each year that they will an award for best food (or something along those lines).\n\nYeah... They're doing something right. 😏",
   "Undoubtedly one of the best sushi restaurants in the country. Comprehensive selection of Japanese beers I’ve never seen elsewhere in the US. No reservations so you can expect a wait, but it’s worth it. I suggest sitting at the bar rather than a table. At the bar you can converse with the sushi chefs and probably do better than ordering off the menu.",
   "Yesterday was our first time we came to that restaurant. But It is definitely not the last time. We enjoyed the evening very much with the attentive service, with the fine  cuisine and wine and with the friendly price. We will definitely go back there soon.",
   "This is one of the best sushi places I have gone to. The rolls are what they do best - if you sit at the bar, the sushi chef can help you navigate the menu. He helped me pick a roll with salmon, avocado, and lemon. I also got the small sashimi plate, and was less impressed, so I would stick with the rolls if I returned. Everything is presented beautifully, though!"
  ]
 },
 {
  "name": "Red Iguana",
  "address": "736 W North Temple, Salt Lake City, UT 84116, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f4e88e8c-9333-11ea-905b-14b31f159f22.png",
  "tags": [
   "food",
   "free",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11516129657914646960",
  "source": "GoogleMaps",
  "reviews": [
   "The sign on the building says it all! “The Killer Mexican Food” has never been a truer statement! The food is amazing! The staff is friendly! The restaurant is cozy and and comfortable, it’s not too packed and it’s not too spacious! Everything on the menu is absolutely spectacular and you can’t go wrong with anything! Authentic Mexican food that won’t disappoint!",
   "Wow!  The wait was SUPER LONG for dinner even though it was a Saturday night.  It was cold outside but the restaurant is small and has no room for folks to wait inside, which is super crummy.  But they had heaters outside and provided hot cider to sip on for free so that was a nice touch.  Once inside we had a great time!  Service was great, food was great, drinks were great!  We had lots of questions about the many mole sauces so they brought out a dish with each sauce on it so we could try them before we ordered. Very good experience overall!  And judging by the line this is a local favorite.",
   "Amazing!! Well worth the wait.  The food was outstanding.  I’m from California so finding Mexican food on par is not always an easy task.  This place does it right.  Service was also great! Try the fried ice cream for dessert.",
   "Been here in 2017, and we still talk about this restaurant every month.\nEverything was just fantastic. There was a line to get in, but it was really worth the wait.\nThe best beef fajitas we had in a very long time. Great atmosphere, would really recommend going for diner here!",
   "Does anyone else really need to tell the world how amazing this place is?! Google asked me to... so here goes: Red Iguana is the first place tell people from out of town to visit for the best food in the valley. It cannot be missed... except for once you are too far away to get there again anytime soon."
  ]
 },
 {
  "name": "Just Burgers",
  "address": "135 E 100 S, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f53e28d0-9333-11ea-a0f3-14b31f159f22.png",
  "tags": [
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18002369266935946919",
  "source": "GoogleMaps",
  "reviews": [
   "Dubai lands in Salt Lake.  Just wow!\n\nJust Burgers found out the pefect burger cooks in the same amount of time that Queen's \"Bohemian Rhapsody\" plays.\n\nThe first flip: \"Mama, i dont want to die\"\nAdd cheese: \"so you think you cam stop me\"\n\nThen the burger finishes at 155 degrees as the song fades away.",
   "I ordered a cheeseburger meal. It was cooked quickly. It definitely hit the spot on a Sunday afternoon. The patty was tasty and the bun was toasted golden brown. The fries were the perfect texture. They had a ton of toppings from pineapple and roasted garlic to hoards of fry sauce. I’ll be back for sure.",
   "Keep it simple. That's what these guys do and their burgers are fantastic. Everything is fresh and tastes amazing.",
   "I don't usually eat burgers, but someone is going to have to restrain me. Easily better than some of the fancy restaurant burgers I've had.",
   "Burger is amazing. This is like a food truck burger and fries. It is cooked with love, and care. The fries are natural cut fries which are always the best. You also get to load up your own toppings which makes it that much more enjoyable because you can handcraft it each time. \n\nI highly recommend this place."
  ]
 },
 {
  "name": "HSL",
  "address": "418 E 200 S, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f5991a22-9333-11ea-a293-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5378933735807336709",
  "source": "GoogleMaps",
  "reviews": [
   "WOW. One of the best meals I’ve ever had from start to finish. Every dish we ordered was beautifully crafted in flavor palette as well as presentation. I was truly struck by the dynamic flavor pairings, the freshness of ingredients and level of service. This was truly an elevated fine dining experience. My favorite was the apple toast- absolutely superb.",
   "Loved our experience at HSL!\nDefinitely recommend making a reservation ahead of time. There is a small, SMALL parking lot behind the restaurant, but chances are it will be full so plan on parking on the street. The ambience to this place is lovely, with dim lighting and beautiful decor. I especially loved their cute seating arrangement ideas, with some couches/fancier chairs scattered in different places. The table was set beautifully and the waiter explained the menu very well. This was our first time here so we didn't know much about ordering, so wait for your waiter to explain things if you haven't been here before. We ordered the Peppers as an appetizer- came in a hot bowl with spiced hummus and they were good. For the main meal, we ordered the HSL burger, medium rare, and the fried chicken. The fried chicken was DELICIOUS! It wasn't heavy AT ALL and was somehow pretty light, considering it was fried chicken. The burger was AMAZING! I hate medium rare anything because I can't stand the blood, but there wasn't a trace of any liquid on this burger and it was absolutely perfect! It is also the cheapest thing on the menu, so that was a plus. \n\nOverall, really neat experience. Definitely try it!",
   "Amazing food and service! I’ve literally never tasted anything like it...simply delicious! My mom suggested it for dinner. We started out with the sourdough toast. I had the fried chicken, and she had the sea bass special. I can’t remember the name of the dessert, but it had chips, caramel and pecans.....another perfectly balanced dish. I’ll definitely be going back!",
   "We love HSL! It's our \"go-to\" for anniversaries, birthdays, and other special occasions. The menu changes quite a bit, but everything we have tried has been great! The dishes have so much thought put into them and it shows. \n\nSome of my favorites that I included pictures of are the seeded cracker, the pork shank, and the whiskey caramel pudding.",
   "Ordered from the starter and hot/cold menu, interesting and lively flavor combinations. The cauliflower, and the meat and cheese dishes are divine.  Reservations recommended for this busy hot spot. Staff was attentive without hovering. Their in-house tonic is tremendously yummy. Street parking available."
  ]
 },
 {
  "name": "Valter's Osteria",
  "address": "173 Broadway, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f5f60794-9333-11ea-83c4-14b31f159f22.png",
  "tags": [
   "family",
   "history",
   "food",
   "food",
   "eat",
   "foodie",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=860515460789347979",
  "source": "GoogleMaps",
  "reviews": [
   "Valter's is so much more than just an excellent restaurant. It's somewhere you can experience a poetic food odyssey. Every dish is a painting of vibrant colors and interesting flavors that each pay homage to Valter's rich family legacy. It's like celebrating love, history and tradition on a plate. I can't wait to go back.",
   "Highly recommend coming here. The food is amazing and the service is even better. If you're lucky you will get Eduardo as your server and Lee as your bartender. You cant go wrong with anything on the menu. There is Valet for $8 or street parking for $2.50 an hour. You should try and get a reservation but if not there is a small bar with 4 seats at it so it may be full.",
   "Went here for my anniversary dinner and I'll just say I wasn't impressed.  The restaurant was small and over packed.  For someplace you have to make reservations for I didn't think I'd be crammed into a tiny space.  My wife paid 80+ dollars for the steak and potatoes. She did not eat it we took it home with us. I had the seafood scampi dish or as I like to call it the tomatoe water with a couple noodles. Only like one or two of the mussels had meat in them. I've had better experiences at a busy Olive Garden. As a foodie I'm always up to try new things... this I did not enjoy.",
   "Excellent food! One of a handful of favorite fine dining restaurants in Utah. One of the best Italian restaurants I've ever dined at. Meat and fish is always cooked perfectly and usually seasoned well. Noisy and somewhat cold decor but fun atmosphere. Excellent service ☺",
   "This place has the best street tacos I've ever had. The pastor and chicken are incredibly flavorful and seem to just melt in your mouth. They have some of the best homemade chips n salsa I've tasted. These guys know what they're doing. Order at the counter and take to your table so it's a chill atmosphere when you just want some bomb food and got stuff to do."
  ]
 },
 {
  "name": "Caffé Molise",
  "address": "404 S W Temple, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f645fc6e-9333-11ea-967e-14b31f159f22.png",
  "tags": [
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3702760611557437477",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing vegetarian options! Wonderful ambiance! The only issue I had was being placed in a seat directly across from the door and the air coming inside was freezing. Otherwise we had a lovely evening.",
   "Everything was good here.  My only complaint would be my lamb was over cooked.  When I asked I was told that I could not pick my temperature.  I prefer my meat rare and it came out at a medium well.  Beyond that, the flavors of everything were great and I'll definitely come back",
   "My husband and I went here for his birthday dinner a few months ago, it was so fun to try a new place.  You did not disappoint!  Such good food!  Nice inviting atmosphere and our waiter was so professional and friendly.  Thank you!",
   "Great atmosphere, was a little noisy. The service was great but slow.  I had a dish that I never had before and it turned out not to my personal liking. Our server was amazing and brought me something else that was great. It not that the dish was bad, I ventured out and tried something different. It just wasn't me. The family loved everything and ate most everything on their plates.  The flavors were more on a mild side so don't expect that pop of flavor.  It was good though.  The presentation was too notch.",
   "This is a beautiful venue. The waiter was attentive and patient while we waited for all in our party to arrive. The salmon, ribeye and gnocchi were all liked by the people in my party. The Mediterranean salad was excellent with peppers. I had the lasagna. It was a large portion but overall too much tomato. The bathroom had very plush paper towels in contrast to the 1(!) ply toilet paper."
  ]
 },
 {
  "name": "The Bayou",
  "address": "645 State St, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f6938082-9333-11ea-9a41-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5917083357752039808",
  "source": "GoogleMaps",
  "reviews": [
   "Great food and great beer selection! It's no joke when they advertise their beer selection. The list looks almost like a book, sorted by every different type of beer you could ever want. To go along with the beer selection, I haven't found a food dish that I didn't enjoy. On Friday I had their pizza special which was a chicken cordon blue pizza, and it was phenomenal! Last thing, The Bayou is a great place to try out Epic Brewery's selection. The mark up on Epic's beers is very small, equal to that of the liquor store pricing. I would definitely recommend The Bayou if you want to try out Epic's amazing selection of local beers.",
   "There are a few issues I had the lunch at the Bayou. \n\nFirst was slow service. We got there shortly before noon, were seated, and our drink orders were taken but then we waited for about 10 min waiting for drinks. I noticed others being served their drinks that arrived after us. Honestly, I think we were forgotten. \n\nSecond was food. The fries were good and the fry sauce was an interesting twist with the Cajun seasoning. The turkey burger I ordered was not that great. It hardly had any flavor and was SO dry. The menu urged the customer to resist adding sauces but it was like eating sand. Honestly, if I hadn’t been as hungry as I was, I probably wouldn’t have eaten it. So, food-wise, it left much to be desired.",
   "We had some of the best service that I've had at any restaurant in quite some time there. The food was excellent and served quickly. One downside to it was the gumbo was too smokey in flavor for us. Other than that, the Cajun fettuccine is awesome as was the blackened salmon. We really enjoyed the  Cajun Seafood ball appetizers  too. Really hard to fault the selection of beers, either; incredible variety on hand!",
   "Stopped in after a long drive from California on Fat Tuesday and was greeted with cold beer, amazing food and a New Orleans style brass band blasting into the night. Such a great experience and felt like that was exactly where I needed to be that night. Thanks y'all.",
   "This is a great locals restaurant with a southern vibe. If you are in town, check out this  local place. Get here early because it will fill up fast."
  ]
 },
 {
  "name": "Tacos Brazil",
  "address": "160 E 300 S, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f6e7bb58-9333-11ea-a178-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=2973255426772760529",
  "source": "GoogleMaps",
  "reviews": [
   "I simply enjoy their food. I always get awesome customer service there. The place is well organised and the cashiers are always very welcoming. Will come back again.",
   "Best Tacos in the city",
   "I simply liked their food. I always get awesome customer service here. The place is always clean and the staff members are always friendly. Highly recommended.",
   "One of my favorite spots to grab something to eat. great location, well organised, and awesome service. Keep it up!",
   "I love this place.  The burritos are on point and the prices can't be beat."
  ]
 },
 {
  "name": "Stoneground Italian Kitchen",
  "address": "249 E 400 S, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f7358d40-9333-11ea-a620-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "delicious",
   "library",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3987031668526137360",
  "source": "GoogleMaps",
  "reviews": [
   "This place is conveniently located near the light rail stop and the ambience was really nice, especially with the fireplace. I had a pizza and it was the perfect size for me and the ingredients tasted pretty fresh. Service was good and I had an overall pleasant experience.",
   "Really good Italian food. Lots of vegetarian options. Staff was great and the ambiance was just really nice. We really enjoyed our time there.",
   "Black Tagliatelle, is a must. Very delicious. Staff is also great. Will be back.",
   "I visited with 3 co-workers, and all 4 of us really enjoyed our meals. The side salad that I added to my lunch exceeded my expectations. For $2 I expected greens and a little dressing, but received mango and plenty of flavor. \n\nWe shared an order of focaccia after asking for a recommendation and we're all impressed. \n\nThe baked Ziti was also good. A cheese lover would particularly enjoy it. \n\nRecommended.",
   "This is our go to date night.  The food is always delicious.  Well we only order three things but we can confirm the lasagna, margarita pizza and doughnuts  are delicious. Parking is easy and there servers are attentive.  The atmosphere is also pretty nice with the view of the library and mountains."
  ]
 },
 {
  "name": "Eva",
  "address": "317 S Main St, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f78d4a5e-9333-11ea-ad3f-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15824877643389436344",
  "source": "GoogleMaps",
  "reviews": [
   "(Um,..)  Yumm!   Looks cool inside, I liked the lighting!  Also the lamb was mmmm!  And the vegan pizza was good qith the pumpkin sauce(?).",
   "We held a small dinner meeting here and were surprised by 1) how good everything tasted, and 2) how much more talkative we were because of the \"family style\" dining. Reaching across the table, picking at each other's plates, and asking one another about our food got us talking and sharing stories so quickly and easily, we didn't even notice the time pass. I can't wait to come back with my family! Thanks to the Eva team for a lovely dinner, and for many to come.",
   "Place was awesome. Interior was beautiful. Staff were courteous. Seating section was comfortable and clean. Great eating experience.",
   "Great downtown location! Cool vibe. We didn't have a reservation on a Saturday evening but we got there pretty early and they got us in. We sat in the back room which was like a long hallway, rustic but definitely inviting. Loved the place. The food was delicious. Small plates shared. We ordered a pretty big selection of small plates, all of which were really good. I ordered the drink, Foret and it was seriously one of the best cocktails I've ever had. This place has a great vibe with excellent food and great staff. Will definitely return.",
   "Cutest place, definitely a good place for a special night! We spent Valentine’s day there and it was a very good choice! They have daily/weekly alcohol and food specials that are from local places and the ambiance is 10/10. I’ve recommended it to so many people!"
  ]
 },
 {
  "name": "Bambara",
  "address": "202 S Main St, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f7d2b7f8-9333-11ea-a5a0-14b31f159f22.png",
  "tags": [
   "delicious",
   "adventurous",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=993997300387982801",
  "source": "GoogleMaps",
  "reviews": [
   "Love this restaurant! Even their room service at Monaco is amazing! From the decor, to the cocktails to the entrees, you’ll enjoy every minute of it. The atmosphere is comfortable yet fashionable. If you haven’t had a Sunday brunch here with all your friends then you’re definitely missing out. Mimosas and Eggs Bennie! And save room for dessert... you won’t be sorry! 100% compliments to the chef! Great for a date night, great for groups, and great for any other occasion.",
   "Not a fan of the location. It is inside of a hotel.There was a weird smell coming from the vents. The filet is to die for! And melts in your mouth. Even though the presentation of the cheese board was beautiful it came out on what looked like a white lazy Susan and was disappointed it was not presented on a beautiful shaped block of wood, which is half the fun of ordering a cheese board. The mustard was delicious! But the cheeses were extremely disappointing and bland. I like really funky cheeses, that slap you in the mouth, and these were for beginner cheese tasters that are not that adventurous. My friend loved them because they were not scary to try. The quail was tiny but very good.",
   "Bambara and the associated bar, The Vault, are both located in the Hotel Monaco.  Often hotel bars and restaurants are mediocre but that is not the case with these two spots.\n\nThe atmosphere in The Vault on Pride weekend was convivial and service was very good.  I ordered a wedge salad with chicken which was delicious.  The cocktails, while pricey ($16) are thoughtfully created and original.\n\nIt's a great spot for a quick bite and a delicious cocktail.",
   "This night was planned for my wife and I for our 3 year anniversary. I called a little late to get reservations on Monday this week, and today is (Saturday). I called and talked to someone, didn't write down the name or recall what her name was (horrible with names). The conversation went with explaining that I needed a reservation but it was booked. I then asked how long the wait would be for walk-in, and was told it just varies. So I explained we would just show up right before opening and wait for a table. Well we travel up, show up 15 minutes early to opening and ask that we get on the wait list. Well they then tell me that the tables are completely booked. I asked why I was told on the phone that we could walk-in and there was no explanation. We are now sitting in the bar, and as I sit here writing this, I'm very angry. This ruined our night and I should have just left and took my business elsewhere, but I have a large gift card for us to use. So I guess I will leave a 1 star review and sit in the bar that smells like alcohol and cigarettes while we try and have a nice evening.... Thanks Bambara",
   "My wife and I had our Valentine's dinner (a few days later on Monday to avoid crowds) and loved every bit of it. We both ordered the filet of beef and both agreed it was one of the top two or so steaks we've ever had in our lifetime. The service was great and attentive. The drinks we're perfect as well as the tempura veggies appetizer. Couldn't recommend Bambara more! Can't wait to eat there again."
  ]
 },
 {
  "name": "Current Fish and Oyster",
  "address": "279 E 300 S, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f80f7300-9333-11ea-92e0-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16459791606718121793",
  "source": "GoogleMaps",
  "reviews": [
   "Fabulous place! Food is phenomenal, staff is amazing, and the atmosphere is perfectly charming. I've been a few times, and everything has just been wonderful. The Grilled Oysters have RUINED me from any other preparation! Go and eat here, you won't regret it",
   "Freshest seafood and best atmosphere! That patio is everything! If there's ever a measure of great taste, it's that the stew distracted me from fries... and the fries were amazing!  Oysters + Grilled Oysters + Clam Dip + Seafood Stew and fries = \"Hell uva\" good choice! No one does it quite like Current -- that's a fact!",
   "The pricing is high but the food is so, so worth it.The oysters here are so damn good and the entrees were perfect. The lighting and the decor feels intimate even in such a large space. Service was excellent too!",
   "Went here as a special treat (as I’m definitely not well off enough to enjoy this regularly). But a treat it was! The food was so, so delicious. The scallops are out of this world and lived up to all the hype I’ve heard about them. Great location. Only critique, which cannot be helped, is the acoustics in the building. Sometimes it gets pretty loud and is hard to hear people across the table. However, I am a big fan! This was a great place to splurge on.",
   "Absolutely one of the best dining experiences I’ve had. The staff was able to accommodate a last minute reservation time change on New Year’s Eve, after my daughter fell while skiing and was injured. We were treated exceptionally well, and our waitress Katie was AMAZING! The food was beautiful and delicious! I highly recommend this restaurant!"
  ]
 },
 {
  "name": "Siegfried's Delicatessen",
  "address": "20 W 200 S, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f86115c6-9333-11ea-af27-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "eat",
   "food",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18349637309020801440",
  "source": "GoogleMaps",
  "reviews": [
   "My friend and I stopped into this place on a whim and we are so glad we did! \nThe feel of the place is very German. We were informed that they have been there for 70 years and I bet not much has changed. \nI ordered a cold corned beef sandwich with everything on it as well as red cabbage and warm potato salad on the side.\nIt was fantastic food and very German. The lady ringing up my order was very nice and attentive to my needs. \nAfter lunch we spent some time looking at all the other goodies and sweets they had to offer.\nI will go back.",
   "Siegfried's is one of my favorite lunch places in Salt Lake. Everything I have tried is delicious, but my all time favorite is the corned beef Rubin. It is absolutely delicious! Have that with a side of fried potatoes and you can't go wrong.",
   "I am from Wyoming and my Mom was stationed in Germany before and she has an infinity for German food because of her living there but as part of our heritage and this place has a little bit of everything for someone!! I would visit this place weekly if we had a place like this in Wyoming!! They even have places to sit and enjoy your food as well daily lunch specials!! I can't wait to come back!",
   "I have been here several times and usually get the schnitzel and bratwurst with spaetzle with gravy. They have a wide variety of German meats and treats like candy, chocolates, and packaged baked products. I've only ever had the freshly prepared food and the German soft drinks they sell by the check stand.\n\nI like how, when you eat there, you get an actual plate and metal utensils, that are then left on the table. A worker then cleans up when you leave. It's a nice service for such an informal ambiance. They provide yellow mustard, spicy brown mustard, ketchup, and curry ketchup to go with your meal. There is not a ton of space here to sit, especially during busy times, so don't plan to go there if you have more than maybe four people in your party. There is approximately 16-24 places to sit. Enjoy!",
   "Fun little place. I've been a few times, but recently went with my German sister-in-law so she showed me the things she grew up with (malt beer - they called it \"kids beer\", purple sauerkraut, and the sausage). Food isn't bad, I think I'm just not a huge fan of German food. Everything tends to have a similar texture and there's not a huge variety of flavor, but then again I love some good Indian or Mexican cuisine with loads of flavor!\n\nI got the wienerschnitzel with sides of purple sauerkraut, potatoes, and cucumber and tomato salad and shared it with my wife. We weren't starving so it was enough for us."
  ]
 },
 {
  "name": "Manoli's",
  "address": "402 E 900 S #2, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f8a8f46c-9333-11ea-b238-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "food",
   "food",
   "food",
   "delicious",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8460563921969348154",
  "source": "GoogleMaps",
  "reviews": [
   "We loved Manolis! I hadn’t tried it earlier because when I looked at their menu they didn’t have a traditional Greek salad, which is typically my favorite. We decided to try it the other night and LOVED it! They have their own unique spin on Greek food and it was delicious! The hummus was amazing, along with the fresh cooked bread. I loved the Brussels sprout salad as well. We will be back!",
   "I've only been here once, but I must say that it had great ambiance and wonderful food!  I plan to return soon. Great outdoor seating and lots of GF options!",
   "Some of the best food in Salt Lake City. I can't stop thinking about it. We shared about 8 small plates and every one was out of this world. The desserts were also excellent, and the servers were friendly, attentive, and helpful.",
   "I was so excited to finally give Manoli’s a try, I was putting it off until I had a chance to go with friends to share multiple dishes to get a real sense of this Greek flare. We started with the Yemista (stuffed piquillo peppers) and Tyropita (crispy stuffed phyllo dough). The Yemista was a bit too charred - had more of a burnt taste to them. The Tyropita has a unique flavor to it but it was tasty.  We continued with the Paidakia (lamb riblets), and Brizola (wagyu steak). Both of these were absolutely delicious! The lamb with capers chimichurri was so tender and tasty. Anytime I see wagyu steak on the menu I have to try it. It was paired with a celery root purée and pomegranate wilted radicchio - I thought it was perfect, others thought it was too sweet.  We also tried a buttermilk crusted quail    garnished with red pepper and feta cheese. The crust on the quail was a bit salty but the meat was tender and tasty.  We also ordered the Garides (grilled shrimp with Greek coffee bbq sauce), the sauce overpowered the amazing herbed polenta cake at the base of the dish.  The shrimp were overcooked and again the “char” tasted burnt. If I were to order this again I would mention the shrimp were overcooked last time and only add a light drizzle of the bbq sauce.  We finished with the Papia (seared duck breast), some of the sear on the duck was overdone and tasted burnt, and the butternut squash purée was cold.  The duck breast was cooked perfectly and tasted amazing but the garnishes missed the mark on this dish. We topped off the meal with soft serve ice cream garnished with all-spice, cherry reduction and toasted almonds - a nice refreshing finish with a little holiday flare from the all-spice.",
   "We liked the place. Food is good and they cook everything very fast. Great service. Kind of expensive."
  ]
 },
 {
  "name": "The Coffee Shop at Little America Hotel",
  "address": "500 S Main St, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f8fe8ecc-9333-11ea-b53a-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3104452751086414074",
  "source": "GoogleMaps",
  "reviews": [
   "This may well be a Hidden Gem with The Travelers. But the locals absolutely love this fantastic place. There halibut and prime rib are to die for. All my kids love the turkey dinner. All food items are of high quality food. You always can get seconds or thirds on their magnificent rolls. It may be called a coffee shop but is more like fine dining.",
   "Great atmosphere and great views of the city from street level. I had the Little America Burger that had Swiss cheese, onions, and mushrooms. It was very good, and you can really taste the difference in the wagyu beef patty. Our server, Patty, was so sweet. She overheard my daughter say it was my wife’s birthday, and Patty brought out a cake just before we were about to leave perfect timing nice little surprise.",
   "We've been going here for quality comfort food for many years. Great prime rib. \n\nComes with a fresh side salad with homemade dressing or homemade soup. The baked potatoes are fluffy packets of heavenliness. \n\nThe vegetables are always fresh and not crunchy or mushy. The service very good, consistently. \n\nAnd the rolls are the best in Utah other than Maddox. Plus you can get some of their amazing raspberry jam if you ask. \n\nThe Little America is the #1 best upper end comfort food in Utah.",
   "Great spot for grub! Long wait on Holidays but one of the few where you will get awesome food at reasonable prices (considering everyone else is closed.) As long as you have the patience, dining here is wonderful. Crisp salad with perfect dressings, always served on the side. Dinner consist of full course meals, soup or salad, entree, potato, vegetables, rolls, and ice cream for dessert and everything else is prepared as much to precision. It really is a best deal on days everyone has rolled up and is staying home with their own families. Bless these people for being there for the rest of us! P.S. Decorations are also really hard to beat!",
   "Our visit to the little American coffee shop was great 😁 met up with some friends to have breakfast here after reading some reviews, and we had a good time. We got seated at a table that was too small, so we were able to move to a bigger table. It took a little longer than regular wait times to get our food, but not too bad. I ordered two eggs with their \"cottage-fried\" potatoes and a biscuit and it was very filling. My husband got the poached eggs with Holondaise (however you spell it) sauce and he enjoyed them. My friends got the Southwest Omelet and the French Toast and they enjoyed their meals. It took awhile to get our checks and even longer to pay, which is where the 4 stars comes from. That and the price. This place is two $$, which is accurate. The average plate is around $10.99 and above. I don't think that price is reflective of the food in comparison to other breakfast places. Definitely worth a try here, and I imagine lunch/dinner is great from the reviews I've read."
  ]
 },
 {
  "name": "Penny Ann's Cafe",
  "address": "1810 S Main St, Salt Lake City, UT 84115, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f9464636-9333-11ea-ba52-14b31f159f22.png",
  "tags": [
   "delicious",
   "walk",
   "food",
   "food",
   "kids",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2086721776750025768",
  "source": "GoogleMaps",
  "reviews": [
   "Brunch with your best friend is a mandatory event when you both are off for Christmas break so naturally we went to Penny Ann's. Their pancakes are lovely and their Eggs Benedict is high on my list of favorites. Good coffee. Great staff. Awesome place for brunch.",
   "Always a great experience! Staff was very friendly and accommodating fro. The second we walk in to the moment we ask for our check. Food portions were generous and the Hot Cakes were simply amazing. I ordered the pot of gold and it was top notch. On our table, we also had the Southern Omelette and the French toast (that was loaded generously with Whipped Cream) and those were equally delicious.  Everything was seasoned perfectly and I wouldn't change a thing. Order the Penny Puffs when you can!! Would definitely recommend!",
   "This cafe was great! It definitely had the small town feel to it and has a great atmosphere. Not necessarily the easiest place to find and parking can be tricky, but you can park on the street. There was a ton of food that came with the meal, definitely left feeling satisfied.",
   "Loved our visit here! There's always a wait, so plan ahead for that. They say their pancakes are \"famous\" and I questioned why and talked about it with the waitress. Well, let me just say, THAT'S THE HONEST TRUTH. They mix something in that batter to make it just a smidge better than the rest of the pancakes I've eaten in my lifetime. I got the omelet that has jalapenos in it...I forget the name. Pretty spicy, so order with caution. My husband got the chicken and waffles and that was seriously SO COOL. They make the pancakes WITH the chicken, not just put on top. My kids got the pancakes and loved them, of course. I had a side of French toast and seriously, the pancakes blew them out of the water. Definitely worth a visit, and more!",
   "Delicious classic breakfast food. We went around 10:45 on a weekday and there were empty tables, but you can tell they often have a wait. The server was incredibly efficient and the food came out very quickly. Portions were generous and everything was tasty."
  ]
 },
 {
  "name": "Tuccis",
  "address": "515 700 E #1D, Salt Lake City, UT 84102, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f993f134-9333-11ea-af5a-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14604102933758616717",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely fantastic Italian food and high-quality service in a very unique and pleasant atmosphere. The pasta was not overdone or over-the-top; it was simple Italian food at its best. The sauce, which can be especially hard for some to get right, was done perfectly, and the pasta-to-sauce ratio was right where it needed to be to properly enjoy all aspects of the dish. Also, our waitress was incredibly friendly and attentive. I'm definitely going back as soon as possible to get my Italian fix.",
   "Incredible service! What a great local business to support right now. Everyone needs some classic Italian cooking, straight from Papa Tucci! LOVED the cannoli",
   "Closest thing you can find to Italy in Salt Lake City. Food is fresh and cooked with dedication, recipes have a slight modern touch but tries to be consistent with the traditional recipes.\n\nThe downside of this place is that one server is covering too many tables and slows down the experience.\n\nOverall our visit was delightful and we definitely will come back to give another chance, perhaps looking for a faster and more personalized service.",
   "Tasty food :) I like the emphasis for an Italian like experience. The service is always fantastic and the place is constantly packed for dinner.\nTry their specialty meat dishes; it will melt in your mouth. There are plenty of dining and dessert options. I recommend  trying out their Italian coffee. \nDrop by for a date or coming with your coworkers.",
   "Christmas day and we weren't really in the mood to cook. Most places were closed for Christmas but not Tuccis. The service was great. Our waitress was very helpful the hostess was very kind and brought our little girl a treat just because. The manager came to our table and asked how we were doing just making sure we were taking care of. Great experience all around!"
  ]
 },
 {
  "name": "Red Iguana 2",
  "address": "866 W S Temple, Salt Lake City, UT 84116, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f9d910c8-9333-11ea-9bf0-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8438835085975497207",
  "source": "GoogleMaps",
  "reviews": [
   "Very tasty, arrive early for smaller groups. Reservations are highly recommended for larger groups. Small parking lot next to building. Staff was quick and attentive. Everyone very much enjoyed their food and left very full. I kinda wish I'd left room for dessert but sadly enjoyed my meal too much. The moles are excellent get all of em and share!",
   "A little bit of a wait, but well worth it! Great food and great value. Holey mole sauce!! With 6 different mole sauces to choose from you will certainly find a flavor to blow your mind, highly recommend!  Cocktails made with fresh squeezed juices are a fantastic touch as well, so refreshing",
   "Delicious Mexican food! They are famous for their moles, but I'm not much of a fan of mole. All the other things I've had there have been very flavourful.  The portions are large so I have leftovers, which I like. Good service too! There isn't a lot of parking, but they do have another lot just down the road.",
   "Great atmosphere, very welcoming and good food. Definitely a popular place! Seems like there's always a wait so getting a reservation is probably a good idea if you have time constraints. I got the Mole Negro, it was good (it was my first time having mole so I wasn't sure what to expect)",
   "Just picked up curb side takeout from our favorite restaurant (we live in Lehi). So hoping that you are doing well during these hard times. People.... support small business, tip generously and support the businesses you love. Stay well, can’t wait to be able to sit in your restaurant and enjoy your food again when this social distancing is over."
  ]
 },
 {
  "name": "Pretty Bird Chicken",
  "address": "146 Regent St, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fa31431c-9333-11ea-8280-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "eat",
   "free",
   "eat",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11364653581922314614",
  "source": "GoogleMaps",
  "reviews": [
   "Fresh chicken near me. The presentation of the chicken itself was enticing as you know we eat with our eyes first. The color palette of the sandwich has a nice hint of purple, with traces of green from the pickles. Not a sloppy presentation at all everything was stacked on top of each other perfectly. The chicken itself was delicious felt like it was made right there and then. Going mild I didn’t get that extra kick from the spice but was hoping for more unique taste from the chicken, still the balance of the veggies on the sandwich was great. The customer service was great especially Brian who made it feel like I was a home eating some cozy chicken. I definitely would give it a try if your in the area.",
   "Excellent fried chicken and spices! Medium spice was like medium salsa hot. Tiny seating inside but decent outside. Free parking garage next door too. Great addition would be chicken strips. The chicken breast was huge and a bit hard to eat. Highly recommend!",
   "This place was cool. Great branding and atmosphere. It’s tiny! Service was good. Food didn’t live up to the hype and the spice was spicy! Definitely worth trying though. \n\nI didn’t care for the dipping sauce",
   "Pretty birds amazing! This was my first time eating here. The place is clean and the staffs friendly and attentive.  I had the HOT chicken sandwich and it was HOT but amazing! Cant wait to go back and bring the family.  Highly recommended!",
   "Simply the best chicken sandwich I've ever had. \nIt's huge, it's tasty, it's everything you've ever wanted. \nThe spices are wonderful. A slow heat, with a bit of sweetness. \nI'm not crazy about the fries, but they're decent. Love the simple menu and small intimate feel.\nI wish they'd do something to improve their outdoor seating. It's in the shade and downright cold in the winter. The outdoor furniture is also uncomfortable. I only point this out because there's like less than 10 spots to sit inside."
  ]
 },
 {
  "name": "Pallet",
  "address": "237 400 W, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fa7ea000-9333-11ea-95c5-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "unique",
   "food",
   "creative",
   "free",
   "art",
   "music",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4791679175029519873",
  "source": "GoogleMaps",
  "reviews": [
   "Don’t get me wrong, the food is great. I just wasn’t very pleased with my experience here. To start with, they don’t make it clear that if you get still water instead of ice water, you will be charged $6 per bottle. Second, it was my friends birthday and we brought a mini cake in. The server let us know there would be a cake cutting fee for $3 per person. We asked if we could cut it ourselves and she said she could probably get the fee waived. We decided to order two desserts from them as well. Our server never cut our cake and never even brought us a knife. We ate the cake with our forks.  When she brought the bill out, she said she could not get the cake cutting fee waived. I’m not a cheap person and complaining about prices here, I just think it’s a little ridiculous that I was charged an extra $9 on my bill for nothing. Not to mention we ordered two desserts from the restaurant so I don’t see why it was an extra $9 to bring in a cake from somewhere else. Another note, the server grabbed my friends phone right out of her hands. That isn’t very professional and the whole situation rubbed me the wrong way.",
   "We had a lovely Valentine’s Day dinner at Pallet!\n\nThe music, lighting, art and table set up makes for an intimate and warm atmosphere, even with the exposed brick and industrial decor. \n\nMost likely unique to valentines day, we enjoyed the prix fix menu and wine pairing.  The food was creative and tasty, with unique flavor profiles and layered textures. Neither of us have had any of the five dishes as they were presented before, so it was a unique and memorable experience. The oysters, pear and fennel salad, potatoes, scallops, waygu beef and chocolate mouse was a delight. \n\nService was great from start to finish. \n\nAdditionals : Parking was easy to find for free, across the street.. Bathrooms were clean. Reservation process was easy. \n\nConstructive feedback: if only offering a prix fix menu for a specific night, please advise at time of reservation. My husband had done a ton of research on the menu, only to find out about the prix fix when we were seated.",
   "Every part of it experience here was fantastic. The ambiance was fantastic and the staff were very welcoming. The menu was small but thoughtful and everything we ordered was seasoned and cooked to perfection. The Black Cod with Israeli couscous and harissa was a show stopper.",
   "Excellent food, flavor and cooked perfectly. I had a NY strip. My date had a bass. Excellent. Highly recommend. Family style seating is where we were, but they do have tables as well, just gotta ask.",
   "Amazing spot with a great menu and great service. Most of the restaurants in SLC are chains or extremely overrated but Pallet is one of the rare exceptions. Loved the ambience its versatility as a spot for a great meal before a game, entertaining clients or a special occasion."
  ]
 },
 {
  "name": "Fleming’s Prime Steakhouse & Wine Bar",
  "address": "20 400 W #2020, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fac67eae-9333-11ea-98bb-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=13135018306894542984",
  "source": "GoogleMaps",
  "reviews": [
   "I typically love going here but the food wasn't as good this time around. Our brussel sprouts and cauliflower were under cooked, the tuna had fat or skin or something making it really chewy. The steak was great, but paying extra for 1 tiny lump of crab meat wasn't worth it. Their whipped cream with berries is always my favorite, this time around we only had a dollop of cream and no strawberries. I would recommend the French onion soup, NY Steak, and anything with whipped cream!",
   "We came in for our Anniversary and it was so amazing. It was super romantic and quiet. We had awesome service and our waiter had amazing recommendations. The chefs cauliflower was Insane! My Kobe steak was sooo perfectly medium rare and so much flavor! We will for sure be back and I can’t wait!",
   "Fleming's is consistently amazing. Well worth it. Service is impeccable.",
   "The food was delicious, and the service was great! We ended up at a table in one of the side rooms, so even though it was pretty packed, it didn't feel that way. As mentioned in some of the other reviews, the steak was a bit fatty, but it was still delicious. Definitely recommend getting the crab on top. Lauren was great about checking in, but not being obnoxious about it. She made it very enjoyable. The lava cake was amazing as well! Would definitely recommend coming here for a nice meal. We came to celebrate my husband getting a new job and they had a card and truffles for him at the end of our meal. Great experience.",
   "I don't get it. I mean they nail the ambience and presentation, but the food is mostly just overcomplicated. Too many flavors competing, not to mention steak that tastes like dirt. \n\nThe main thing this place has going for it is that you can get a good steak without needing to wade through peanut shells and listen to country music. But that steak will cost you 3-4x more and it is *not* 3-4x better. Maybe 50% better?? Just don't do the dry aged steak. I've had good dry aged steak. It still tasted like steak, with some flavor. This just tasted like dirt. I ate 4 or 5 bites before I couldn't do any more, and that was a $60 steak. If I come back I will order the simplest steak they offer. And the molten chocolate lava cake. Absolutely the best I've ever had."
  ]
 },
 {
  "name": "Ruth's Chris Steak House",
  "address": "275 S. West Temple Street, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fb0f47d8-9333-11ea-be6a-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "delicious",
   "unique",
   "delicious",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4226528269675722934",
  "source": "GoogleMaps",
  "reviews": [
   "Went here for my wedding anniversary.\nOne of, if not the best steak dinners I've ever had. Had the T bone steak, along with the french onion soup. Fabulous!  Also had the caramelized banana cream pie for dessert. Delicious!\nMy wife had the stuffed chicken breast and loved it.\nService was great.\nExpensive for a regular guy like me, but worth it for the special occasion.\nHighly recommended.👍👍",
   "We enjoyed our meal here. The service was first class. I was recommended the venison which was sweet and perfectly cooked. A little on the rich side if that’s what you’re looking for. Most people here are coming for the steak. My wife got that and we enjoyed it as well. All servings were large and generous. We also enjoyed the Brussels sprouts. The scalloped potatoes were a little bit on the undercooked side and nothing different from what you could make it home. Overall, you know what you are coming for and they’re consistent every time. Make sure to call and make reservations ahead otherwise you could be waiting for a long time.",
   "Excellent. My wife and I split the cowboy steak for Valentine's dinner. I also got and recommend the Ruth's Chris salad. It was very delicious.\n\nThe steak was the most perfect medium I have ever gotten anywhere.",
   "Been here many times. Wait staff is always delightful and attentive. The steaks are top notch. The sides are pretty good, but for a meal this expensive, I would expect a little more. The lobster Mac and cheese was a little soupier than usual, and the fingerling potatoes were disappointing. The flavor was nice, but they were tough and low on forkability. The key lime pie for dessert was unique and delicious!",
   "Staff were very attentive and friendly. They did a good job explaining the different items on the menu when we had questions, and offered kids options for my niece who joined us. The food was amazing. Be sure to try the sweet potatoes for a delicious sweet side. The garlic mashed potatoes were also delicious."
  ]
 },
 {
  "name": "Garden Café",
  "address": "555 S Main St, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fb544008-9333-11ea-90c4-14b31f159f22.png",
  "tags": [
   "food",
   "tour",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=17410184542908235818",
  "source": "GoogleMaps",
  "reviews": [
   "The food was very good. Everything at this hotel is great.",
   "Stopped by for brunch. It’s was an enjoyable experience. First time visitors receive a short tour. They had crab legs and sushi, Eggs Florentine, omelettes, pancake, waffles, prime rib, desert stations and more. There are lots of options to choose from. I received a nice little rose which was an extra treat. What a lovely place.",
   "Delicious and great service! The band makes it way fun",
   "We were there for Branch, celebrating my friend's birthday.  Food is really good, atmosphere is amazing. But its a little bit expensive. Only for very special occasion. VERY VERY special occasion!",
   "Very nice brunch. The setting is perfect, well lit and perfect for meeting someone new.\n\nThe brunch was delicious with many options. The omlete was great, and all salad options were spot on.\n\nThe cocktails could improve significantly."
  ]
 },
 {
  "name": "La Estación Del Taco",
  "address": "125 S Main St, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fba805ac-9333-11ea-bbf6-14b31f159f22.png",
  "tags": [
   "delicious",
   "affordable",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=2085296213900265178",
  "source": "GoogleMaps",
  "reviews": [
   "OMG. The best tacos around. Totally authentic with an incredible set of toppings to choose from. Lengia asada and so much more.",
   "This is the place! This is where you want to get your fix.\n\nTacos $1.50\nBurrito $6\n\nDelicious! Lady is very nice.",
   "Best tacos in Salt Lake City! The salsa was so good and spicy! Affordable and the ladies are so nice.",
   "I don't usually write reviews, but this taco cart is amazing!  I walk just over two blocks once or twice per week.  The carnitas burrito is my go to, but I have tried a couple of others, and the tacos are great too.  They are very kind, and the service is great.  Highly recommend!",
   "Perfect for a quick lunch if you work downtown. Very good tacos and friendly staff. Prices are very reasonable too. The stand is under some trees so you'll be eating in a nice shaded area"
  ]
 },
 {
  "name": "Spencer's For Steaks & Chops",
  "address": "255 S W Temple, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fbf64ce8-9333-11ea-9ee2-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "drink",
   "delicious",
   "cheap",
   "delicious",
   "cheap",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5841814584098040004",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food and great service. We had Hayley B as our server and she was one of the best waitresses we ever had. Overall the staff was well versed in how to treat travelers.  Steak was sublime and the gnocchi was also very good.",
   "The food was well prepared and the ambience was amazing! The only reason I rate this 5 stars is because of RENE he came to fill up our water and check up on us more than the actual server! He had a huge smile and amazing attitude the entire time! He was very entertaining and had amazing stories to tell! I will be returning solely because of him.",
   "Horrible tonight!  I have been here many times and it has always been great.  Our steaks were cold and it took forever to get them.  The service was terrible.  We waited 30 min for drink refills.  Salads were not impressive. 45 minutes went by then when the steaks  came to our table they were cold. Also, the steaks came 10 min before our sides.  The sides were fine. Then we waited another 30 min with nobody coming to our table to check on us. Someone in our party had to go ask for the manager. The person at the front desk said the manager was out!   Out?  It’s valentines weekend. No manger on duty ??? 15 min later some guy came to our table and asked us what our problem is as if we didn’t have anything to complain about. We waited forever... Nobody asked us if we wanted desert.  The bill finally came and we waited 20 more minutes to get our credit cards back.  \n\nWe would have had better luck at Sizzler tonight. I would have ordered malibu chicken and a salad and been happy with an extra $80 in my pocket.  \n\n“They so poo poo” - Tyler Huntley",
   "Forgive the unattractive pictures, haha. But this place is awesome! Potato gratin was fantastic. And I got the New York Strip steak, medium, and it was amazing. Calamari was fantastic as well! And the tomato bisque was delicious! This place obviously isn't cheap, but if you're looking for a delicious steak at a higher-end restaurant, Spencer's is great. Service was excellent as well! The establishment was very clean and classy. Great experience overall!",
   "My group had a great experience at this restaurant. The food was delicious. I had the chops, along with a wide range of starters and side dishes. Everything was full of flavor and spiced perfectly. \n\nThe staff was attentive and friendly. They stayed on top of drinks and weren't overbearing.\n\nThe atmosphere is quintessential steak house. So are the prices...it's not a place to feed your family on the cheap. But worth it."
  ]
 },
 {
  "name": "Whiskey Street Cocktails & Dining",
  "address": "323 S Main St, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fc3e049c-9333-11ea-b278-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "drink",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16275464406675430976",
  "source": "GoogleMaps",
  "reviews": [
   "We did not have reservations, but the staff got us in on a cancellation/no show. We loved the Oyster bar as well as the drinks and fun conversation with the bar tender. I had the duck, my wife had small bird and the other couple had steak. The food was amazing. The vibe was upbeat and pleasant. WE WILL BE BACK!!",
   "I had no idea there were so many types of Whiskey! Or even the difference between a bourbon, a single malt and the countless other categories of a drink that pretty much tastes the same to me ... however, I did try a single malt which was within a reasonable price range and which was so delicious I had to have a couple more in the span of a couple of hours during which I experimented a few dishes from their food menu. Bar tenders were top experts and very helpful answering my basic questions so I give this place a top mark for delicious food, excellent drinks options but a word of warning ... some of these whiskey's are a couple of hundred dollars a shot and sadly outside my budget ... even though I was really tempted, be careful.",
   "Awesome selection of booze. Service is usually great. My most recent experience however was a one-off not great one. I received a drink I didn't like. Since I was with company I didn't want to complain but didn't drink it. Having been a waitress at many restaurants,  I know great service would ask questions about a drink or meal barely touched, especially at a bar known for their drink selection. Partly on me for not saying something, but still I believe a 5-star rating should reflect a place I can always depend on to keep me happy.",
   "Terrible service from our waiter and manager.  We showed up for Sunday brunch 2 hours before a show.  It took the server 30 minutes to take our order, when we ordered we let him know that we had to leave for a show in 90 minutes.  We then waited 60 minutes with no food, we continually checked with our server to see where our food was and he assured us it would be right out.  When we only had 30 minutes before we had to leave, with assurances that our food would be right out multiple times, we paid for our meal so we would be able to get out on time.  At this point the server reminded us that there was an entire bar full of people that he needed to take care of, not just us.  \n\nAfter another 20 minutes, we flagged down the hostess (who was very nice the whole time and helped us flag down our waiter to place our initial order) and asked her to check where our food was.  She came back and let us know there were still 2 people ahead of us.  At this point we asked for our money back so we could get out of there and make our show.  The manager worked with us to get us a refund and offered no apology for the wait.  \n\nI understand that they were busy and the waiter was very busy and under a lot of stress, I would only ask that you be transparent and let us know our food won't be out on time and we would have left and gone somewhere else.  Don't continually assure us for 90 minutes, only to let us know at the last minute!",
   "Had the pork belly sandwich with a nice porter. It was one of the best meals I've had in the area. Atmosphere was a little loud. But sociable and comfortable at the same time. Amazing whiskey and beer selection from what I tried. Definitely will comeback \nwhenever chance I get."
  ]
 },
 {
  "name": "Pago",
  "address": "878 900 E, Salt Lake City, UT 84102, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fc8ac518-9333-11ea-9861-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15280802261498458633",
  "source": "GoogleMaps",
  "reviews": [
   "Parking was a little difficult. The food was good. The server we had was the best part of our experience. He was very knowledgeable about the menu and the wine list. I would recommend checking the menu before going. On Sunday daytime they have only a brunch menu, most of the options I was not interested in. Not their fault, mine for not doing my homework before making reservations. They do take reservations and I am told it's a good idea to do so. They have an extensive wine list that changes frequently. The restaurant was clean",
   "This restaurant is really nice. Our waiter Chase was awesome, always making sure we have everything we need and also gave us some very good food recommendations. I felt some of the dishes were a little small (like the beet salad) but the taste was awesome!!",
   "Thoughtful, delicious food. Incredible burger, and my husband described the scrambled eggs as “the most perfect scrambled eggs ever.” Many restaurants seem to think that the only way to add flavor is to make food spicy. I was grateful that wasn’t the case here, although spicier options are available. Jordan was our server, and he had a genuine enthusiasm for not only Pago, but craft food in general.",
   "Today we had an amazing experience with their new project (we hope it is there to stay after COVID), meal pairing with wine recommendation from Scott Evans. The way it worked: you order a meal from Pago and buy a wine to pair with food and join the live session on Facebook. Food was amazing, wines complemented the food perfectly! If they happen to do this in the future my recommendation is to keep food warm in the oven.",
   "great restaurant! authentic is the word the comes to mind when thinking of pago. the food tastes great and the wine selection is decent but with excellent prices. the pork chop or sea bass would be my recommendation. the burger is good, but fries are a bit too salty"
  ]
 },
 {
  "name": "Bombay House",
  "address": "2731 E Parleys Way, Salt Lake City, UT 84109, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fcd8491e-9333-11ea-a84e-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11678287187403106178",
  "source": "GoogleMaps",
  "reviews": [
   "Love this place. It starts getting packed around 5:30pm and  there are no reservations, so expect to wait a little while. \n\nThe food is amazing but takes awhile to come out. We were there for my birthday and they took great care of us even though we were in a little rush for an event after dinner.\n\nTheir Custer care is fantastic. If you like Indian cuisine, at least give this place a shot.",
   "It takes an orchestra to perform a symphony with it's full depth and beauty, the wonderful people at Bombay House understand this concept well and execute a similar level of precision and unified goal every day. The goal? Provide exquisite Indian cuisine with a high level of customer service. I can't say enough about how well they achieve this goal. A prime example is that I ordered a beer and while the waiter was taking the rest of our order, another server came with my beer and a chilled glass. I was taken aback and truly impressed by how quickly they were able to operate as a team to serve us. Don't even get me started about the food itself-it was fantastic. The spices in every dish were perfectly balanced and the different heat levels were well crafted to ensure that the hotter spice levels are just as enjoyable as the mild dishes to the non-spicy food lover. \nIf you are a fan of Indian cuisine (or even if you aren't), you would be remiss to not give Bombay House a try.",
   "They're the definition of going above & beyond! I could not be more pleased with their service! The food speaks for itself. I'm never disappointed with the food. With an uncertain estimated time on when the food would be ready, long story short, they cut my wait time from an hour, to twenty minutes, and called me to let me know my food was ready with five minutes to spare, yup! 15 minutes! Love this place & their hospitality!",
   "I absolutely love Bombay House. Unfortunately, my usual order includes subbing coconut milk for cream in 2 dishes due to a lactose allergy. The online ordering system does not allow me to do this and calling in an order is no longer an option. Sad that I can’t get takeout from here anymore.",
   "Friendly staff and great food. We enjoyed the poppadoms with relishes to start. My husband had a chicken korma (prepared mild) and I had a vegetable curry (prepared medium). Both flavorful and with requested spice level. The mango drink was good too. Excellent staff. Would recommend visiting :)"
  ]
 },
 {
  "name": "Market Street Grill - Downtown",
  "address": "48 W Market St, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fd2a39d2-9333-11ea-a49a-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14821137591750152764",
  "source": "GoogleMaps",
  "reviews": [
   "We went there for our anniversary at around 4:30 pm. We got sat quickly, as we were one of two tables there at the time. We sat for approximately 10 minutes before we saw a server.  Server 1: brought us water and took our appetizer order. Server 2: brought the appetizer out to us. \nThe calamari was delicious. \nServer 2: came to check on us after we consumed about half the appetizer and asked how everything was and if we needed anything. \nI said, yes, for someone to take our order. \nServer 2: looked dumb founded, like Server 1, didn’t take it?  \nWe ordered our meals. Ahi Tuna & Crab Cakes, both with clam chowder and mashed potatoes. Soup came out quickly, and delicious. We waited about 15 minutes before Server 2 came over and advised us that “the kitchen is having a mashed potato crisis”.  It would be another 5 minutes for our meal to come out. Okay, whatever.  6 minutes later, Server 2 came out and said it will be another 30 minutes, unless we order a different starch. Needles to say, we ordered a different starch. We waited again for approximately, 15 min.  The food was delicious. But, I’m surprised the manager didn’t come out to apologize. We were charged for the full bill even. \n\nThis is a matter of maybe I’ll go back. But not anytime soon.",
   "First time there and it was very nice inside and they even brought cinnamon rolls to the table. Our waitress was very welcoming and warm with us and I enjoyed the experience. Can't wait to go back for more!",
   "The staff, servers and hosts, are wonderful. Been going there for brunch for almost 20 years, but am thinking that will have to end.\nWith the change of ownership, the prices have increased (not horribly) and the quality of the food has taken a real drop.\nSorry to see this all come to an end.",
   "Very friendly staff, excellent service, the best drinks in town, a wide variety of specials. Be sure to ask your server about daily specials and fresh fish flown in on a daily basis. It's currently crab season so be sure to try the crab specials, my favorite is the mac and cheese. Brunch is served until 4 on Sunday, which comes with delicious complimentary cinnamon rolls. Breakfast is always served promptly, within minutes, so whether you're in a rush for a quick bite or just wanting to spend your time with an endless cup of coffee, this is the place to be.",
   "Excellent service (thank you Heath!), Excellent food, and reasonable prices. Wife and I each had an entree with big bowls of clam chowder first, 3 drinks each and a shared dessert for $120 total. A great meal, we will definitely be back."
  ]
 },
 {
  "name": "Rodizio Grill - Salt Lake City - Dine-In Open",
  "address": "600 700 E 2nd Floor, Salt Lake City, UT 84102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fd74898c-9333-11ea-b27c-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11519514362683004702",
  "source": "GoogleMaps",
  "reviews": [
   "The meat just keeps coming. They have a good variety but my definite favorites are the grilled pineapple and ham.  Gotta love the Hawaiian combo.\n\nThe chicken heart was surprisingly tasty, I'm glad I had one.",
   "Very good restaurant if you like meat. Their meals include their salad bar. I usually get very little from the salad bar to save room for more meat. Their salad bar had a pot roast soup that was very delicious.\nThe meats were delicious, I really enjoyed the garlic beef. Then it is good to finish off with their grilled pineapple.",
   "Smiles all around here! We came for a very late Valentine's dinner. It was busy like usual and we had to wait a while even tho we made a reservation but overall it was a great experience! Our check came quickly, we always had drinks and food on our plates and everyone was very nice. We even accidentally dropped a fork on the floor and instantly an employee was there to offer a clean one... It was magical really 😂 such a good time! ❤️",
   "One of the best Brazilian restaurants in town. Sometimes it’s hard to get a table especially in December other than that it is amazing. I have been there many times and the food always delicious. Their best is the garlic steak and the parmigiana steak . They also have pineapple. It tastes good. I’ll definitely come back.",
   "Such a fun experience.  The meats are so yummy and of course the grilled pineapple. I love the Brazilian lemonades and all the choices at the salad bar will not leave you hungry. My 9 year old who is still a picky eater actually ended up loving her dinner. It is noisy and a lot going on but over all we had a great time. They also sing the funnest song and play a drum for birthday celebrations.  We're already planning who's birthday we would like to go back for."
  ]
 },
 {
  "name": "Osteria Amore",
  "address": "224 1300 E, Salt Lake City, UT 84102, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fdcd7f36-9333-11ea-a4b7-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3312366876832911142",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I were very impressed and had a great experience! The atmosphere was awesome, the service was exceptional and the food was delicious. Best Italian food in Utah for sure! Our waiter was very attentive and accommodating. The food was reasonably priced as well.",
   "Best Italian restaurant in town! Really good food for reasonable price. Will try pizza next time and let you know. Enjoy",
   "Amazing pizza. Cooked perfectly with a nice crust. So many places undercook their pizza. Great job. Can’t wait to come back!",
   "If you’ve ever longed to feel like you’re surrounded by your dearest friends, while enjoying innovative and classic Italian fare, you should come home to Osteria Amore. \nThe blend of Northern and Southern Italian flavors and traditional dishes will send you back to your grandma’s kitchen(s). You can feel the love packed in each bite... it’s amore!",
   "Great atmosphere. Awesome food. Excellent Service. Pistachio sauce on the pasta that I got was amazing. Shout out to Mom in the back making the ricotta spread for the butter!"
  ]
 },
 {
  "name": "Oquirrh Restaurant",
  "address": "368 E 100 S, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fe1e5e86-9333-11ea-a930-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "food",
   "foodie",
   "food",
   "music",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7956875494863142149",
  "source": "GoogleMaps",
  "reviews": [
   "This place was amazing.  We got the beef tar tar as an appetizer.  Our entire table loved it.  It had a super slight hint of something spicy.\n\nFor dinner we got the steak and fish of the day.  The steak was cooked perfectly.  The sauce it was paired with had me lucky the plate clean.  The fish on the other hand didn't look the best BUT it blew our mind.  The liquid it was served with paired incredibly well with the fish.\n\nO. Top of that, the owner came by our table and chatted for a little while.  It was an overall great experience.",
   "What an AMAZING place. Don't be thrown off by the location, this place is a posh, trendy, foodie, hot and up and coming place. The food is unique but well worth it. The staff is friendly and the management greets you and values your feedback. Angie (Angelina is a gem) the food is unique i tried the carrots, the milk potatoes, the lamb which is to die for, and the dessert. Drinks are unique and worth the buzz. Try this spot while in town if you are not a local its worth the short walk from the downtown area, if your a local stop by and say hi to them. Just wanted to say thank you so much for your hospitality.",
   "Magical night. The food, the atmosphere, and the music. Perfect. Ang the owner came and sat with us. We talked food and life. What a perfect evening. And wait... did i mention the menu? The highest quality. Try the pot pie. And the Lamb. And the sourdough. And...",
   "Delicious, innovative, and beautifully crafted plates. The setting is quiet and the service is excellent. My only complaint is the server who touches you every time she comes to the table. Maybe I am truly that irresistible but sadly I don’t draw the same attention elsewhere",
   "I brought our company here for an amazing experience! The food was to die for the the owner even worked  with me to make sure they could accommodate us beforehand. Very few upscale places in SLC will host 15+ but they did it with a smile! We loved meeting the owners and chef's too! Would totally come back."
  ]
 },
 {
  "name": "Pig & A Jelly Jar Salt Lake City",
  "address": "401 E 900 S A, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fe795014-9333-11ea-99ed-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1216655665147976548",
  "source": "GoogleMaps",
  "reviews": [
   "Ordered online for curbside pickup. Staff was very friendly, everyone was wearing gloves. No guests were allowed in the building (which is excellent). I could tell everyone was taking health and cleanliness VERY seriously. The food was hot and delicious. I would have attached a picture but my husband and I ate the food too quickly!\nI love supporting local businesses we love, especially in a time of need. They even included a sparkler with instructions to light it at 9 pm tonight to spread joy. LOVE that!",
   "So awesome! Quality service and a great menu selection. I enjoyed the Sausage Gravy over Biscuits, and it was a delightful savory treat. The biscuits were a crispy golden brown, and there was the perfect amount gravy to coat all of the biscuits without smothering them. It also comes served with an over easy egg on top, which was a tasty addition. I also appreciate that all of the ingredients are locally sourced. I didn't have the chance to try the alcohol options today, but maybe next time. A great selection, and served all day!\nI will recommend this place to anyone looking for a good brunch or cafe experience.",
   "Normally I love this restaurant and they have great food and service while dining in, but they are having serious issues with organizing to go orders at this time. Ordered through their app at 11:10 AM with an estimated time of the 11:58 for the order to be ready for pickup. By 12:55, after waiting outside the restaurant for an hour, all they could tell me is “it’s still going to be awhile.” They were happy to refund the order for me, but something needs to seriously change about their online ordering before I go back.",
   "Cozy up beat cafe.  Parking is ample. Service is excellent. Food was delicious!  I found the place to be very comfortable inside clean and modern.  Very inviting. Prices were reasonable. Check it out!",
   "I wish I could remember my servers name.  It has been a hot minute since I have been in there but we always had one of two servers and they were beyond awesome.  Made suggestions, laughed with us, talked nerdy stuff(gaming) with us.  Just a great atmosphere.  I mean the food is awesome to.  Well i only get the waffle and eggs because i'm addicted.  But they are amazing."
  ]
 },
 {
  "name": "Martine Cafe",
  "address": "22 E 100 S #200, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fece4e46-9333-11ea-b860-14b31f159f22.png",
  "tags": [
   "food",
   "knowledgeable",
   "food",
   "food",
   "delicious",
   "historic",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7028870069359246069",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great small-plate restaurant. It is a little expensive but the food is quite good. The staff was extremely friendly and make some great recommendations. For a fancy restaurant the service was very fast. Great spot for a special occasion.",
   "Absolutely Amazing. Attentive, friendly and knowledgeable servers. The food was cooked to perfection. I got the mussels and Clams and I cannot say enough about the sauce, it was the perfect balance. My husband had the Sea Bass, it was inspired cooked perfectly and the best hummus I have ever tried. If that was not enough, the fried gingerbread is a must, we had them put ice cream on the side, normally comes on top. Bread was crispy on the outside, tender on the inside with a beautiful mix of spices. Great Date Night experience.",
   "Wonderful atmosphere and super personal service. The food was crisp and yummy. Will clearly recommend this restaurant to anyone. Fair rates and large portions. Good job.",
   "I came here with my husband and we both had a really good time. It's at a great location across from City Creek, the building is historic and very cool, the service was very fast, and the food was delicious. I had salmon, and my husband had the burger. I can't wait to come back and try something new.",
   "I really wanted to like this place. My wife and a split the brisket burger and it waassss less than stellar. The meet was soft, like raw meet, but it wasn't pink at all. Mine was cold as ice in the middle.\n\nThe fries were great, and the fries brussel sprouts were great! However, overall disappointing."
  ]
 },
 {
  "name": "Table X",
  "address": "1457 E 3350 S, Salt Lake City, UT 84106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ff1409b8-9333-11ea-981b-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "tasting",
   "knowledgeable",
   "food",
   "delicious",
   "food",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8252801185862574879",
  "source": "GoogleMaps",
  "reviews": [
   "We have come to Table X for our last two anniversaries. We love to get the chefs tasting menu along with the wine pairings. Don’t worry that you won’t be full enough! I struggled to finish my last plate even though it was delicious. The menu is so unique and the staff is incredible. Highly recommend.",
   "The food was amazing. Staff was knowledgeable, attentive and fun. I’d highly recommend eating here. They have a garden out back where they get several of the fresh ingredients for the meals. They make their own bread, ice cream, cheese.. so good!",
   "I have wanted to go to table X for quite a while now and it definitely lived up to the hype. Every dish was carefully thought out and planned and tasted exquisite.  This was some of the best lamb I've ever had not to mention the perfect risotto and Berkshire pork.  I am confident that I could live on their fresh baked bread and gin and tonics alone.",
   "I took my husband here last night for his birthday. We chose the chefs 5 course meal for the both of us. My husband decided we wanted to be surprised with the food to get the whole experience. They first brought out raw oysters which were not my cup of tea. They also brought out a celery root risotto with brown butter. That was delicious. Next was the salmon which we both really liked. After that was steak. The steak was cooked very well and had lots of flavor. We were both disappointed in the bread pudding for dessert. It just fell short on flavor. For the price tag vs flavor we won’t be returning. And yes my husband and I have been to many 5 star restaurants in various states. The staff was incredible and truly try to make it an experience for you. Food could just use more flavor.",
   "I've never been to a fancy restaurant before table x but it was amazing. We did the chef's tasting menu and the food was amazing! All of the staff was super friendly and really on top of everything. It was definitely a lot more expensive than I'm used to but for a special occasion I cant think of a better place"
  ]
 },
 {
  "name": "The Roof",
  "address": "15 E S Temple 10th floor, Salt Lake City, UT 84150, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ff65acae-9333-11ea-b2b8-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "creative",
   "unique",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4981386193120683931",
  "source": "GoogleMaps",
  "reviews": [
   "Great food, great atmosphere, great service, and great people. \nMy wife and I came here for our anniversary and we received excellent service. The food was great. Make sure that you save some room for desserts because those may have been the highlight the cream Brulé was amazing.",
   "The Roof is a great place to eat, but a big part of the experience is the location and view.  It's just an incredible place to eat dinner.  The food was amazing.  I do agree with some reviews that the selection isn't huge, but there's plenty of options for people with all different tastes, and if you leave this place hungry it's absolutely undeniably your own fault.  If you have limited your own food choices due to lifestyle decisions, you can't blame someone else for not catering specifically to you at a buffet setting.  You are responsible to choose a restaurant that matches your eating lifestyle.  The dessert bar was so good I felt like I had to try everything, which is why I'm not eating much of anything today (the next day).  The ONLY two negatives from the experience was ice cold stuffed mushrooms (maybe they're supposed to be that way?) and I took a piece of steak that was absolutely raw.  However, the chef sent out a new platter of steaks and they were outstanding.",
   "This is not exactly the food I was expecting for this price range. Extremely limited seating although the view is a spectacular view of the city. Staff is professional and prompt but more creative options of healthy warm and fresh vegetables would be nice, as well as a more unique and quality dessert selection. A fuller salad bar with fully stocked fresh larger selections would also be nice. Although it was a lovely view. And the people were polite and friendly. It did feel like an upscale dining experience.",
   "Last night was very typical of our other visits to this amazing restaurant. Our server Julie, was as good as our previous server on other occasions Janet. They are both exceptional and if you visit the roof you might want to ask for Julie or Janet. As usual the food was sensational. One of the bright spots was the amazing piano player. Another welcome was how amazing Andrew Last night was very typical of our other visits to this amazing restaurant. Our server Julie, was as good as our previous server on other occasions Janet. They’re both exceptional and if you visit the roof you might want to ask for Julie or Janet. As usual the food was sensational. One of the bright spots was the amazing piano player. Another welcome was how amazing Andrew us  Andrew made sure that we got our favorite table, even though that is not something that they can guarantee. And your work very hard to make sure we had the table and the view we were looking for. He even came by our table on two other occasions, as he did the other tables, to make sure we were taking care of perfectly. The roof is just one of those restaurants that happens to be on our favorite list and every time we go we are reminded why it is on that list. If you looking for a fine dining experience this restaurant needs to be on your list.",
   "We had the dinner the last day when we visit the city. Very nice view of Tabernacle and the temple. it has live piano playing. it's a buffet style and the food quality is good. it's a good place for special celebration."
  ]
 },
 {
  "name": "Cucina",
  "address": "1026 2nd Ave, Salt Lake City, UT 84103, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ffa93f48-9333-11ea-acca-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=589411250170652538",
  "source": "GoogleMaps",
  "reviews": [
   "Valentine's dinner, fabulous! Love the service and personal stopby from the owner. Food beyond delicious.",
   "The food was so delicious! It also looks like a fun place to sit outside and have a glass of wine in warmer weather.",
   "Quaint restaurant. Not a ton of options for lunch but I will definitely be going back. Lots of great looking pastries and dinner menu. Very friendly staff, and great atmosphere",
   "Their homemade fare makes for a great meal.  Well above average with excellent service and a nice atmosphere.  A few dishes have lacked some consistency and flavor.",
   "What a wonderful experience! We came for dinner the patio, the food was amazing, we had the avocado bomb thing...the cashew candy in the middle, yum! We also had frozen sangria, just what a perfect patio night needed! We had a few other unique dishes, the homemade pasta and also the Romanesco broccoli, both are a must!"
  ]
 },
 {
  "name": "Arempas",
  "address": "350 S State St, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ffee37a6-9333-11ea-bbd3-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3759223343559025265",
  "source": "GoogleMaps",
  "reviews": [
   "Always DELICIOUS! I’m Venezuelan and this is definitely authentic and delicious Venezuelan food. It makes me so happy to have an option to get my nostalgic childhood favorites here in salt lake. Thank you!!!",
   "The plantain sandwiches are absolutely amazing. They are filling enough for us bigger guys and taste out of this world. They have 2 types of plantain crispy green or soft sweet. Pi prefer the green because I can pick up the sandwich while I need to use a fork and knife on the sweet.",
   "Arempas is my favorite! The food is amazing and true to Venezuelan cuisine. The owner is Venezuelan, so the recipes are perfect! The menus are great as they are very detailed and explain the cuisine for those who may not be familiar. Great location too. They usually have Venezuelan drinks as well. I recommend everything but my favorite dish is the Patacón!",
   "Do yourself a favor and check out this charming establishment. The food is always great (great price, too!), the staff are ALWAYS friendly, and it’s open crazy late on the weekends! I would recommend beating the bar-close rush, as people tend to flood in around then. 👍",
   "Food was so authentic and delicious. I actually couldn’t have asked for anything more. But further, the service and sense of community was unparalleled. These guys genuinely care about giving their clients the most authentic Venezuelan cuisine you could ever hope to experience in Salt Lake City. I cannot speak highly enough about this hardworking and authentic flavor of Venezuela that you could ever come close to in salt lake city.  Don’t think twice. Come eat their food."
  ]
 },
 {
  "name": "Em's",
  "address": "271 Center St W, Salt Lake City, UT 84103, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/003af854-9334-11ea-b947-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14027988479131523142",
  "source": "GoogleMaps",
  "reviews": [
   "So sad to see Emily retire! Good for her but Em’s will be missed. Loved every chance we had to come to Em’s. Never left Hungary or disappointed. Thank you Emily for running such a dynamite operation.",
   "Wonderful little place! I love the atmosphere and the delightfully dated 90s menu. I can only give 4 stars for our visit this evening because we got stuck at a table in a wierd converted coffee shop side room. I much prefer the room with windows. Food was great, as always.",
   "Em's is located in a quiet neighborhood up by the capital.  The setting is quiet and private for the most part.  I had the beef tenderloin and it was fantastic, my wife's first choice was baked risotto chicken which sold out so she settled for the New York strip, the flavor and tenderness was not as good as it could have been.  The staff was kind and courteous.",
   "Em's is a quaint little café that had a warm and inviting atmosphere. The building itself was older in style, but that made it all the better. The food was good, though the menu wasn't extensive. The service was great and helpful. The coffee was self serve, which was nice when we wanted a refill. The portion sizes were appropriate for a Sunday brunch, and left us satisfied. Great place to visit and eat!",
   "Excellent! Atmosphere, service, and food are superb."
  ]
 },
 {
  "name": "Lucky H Bar & Grille",
  "address": "500 S Main St, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/008ab7e2-9334-11ea-a2d9-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "family",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=14626850673603724809",
  "source": "GoogleMaps",
  "reviews": [
   "The atmosphere, the food, the waitresses/waiters are excellent. The bar was nice and clean. We will definitely come back again. The experience here was incredible. Thank you for treating our family well! If I had to list a downside to the experience was that desert was a bit underwhelming and the amount of food provided was wasteful.",
   "Overall, this is a good restaurant. Food was good quality and flavors were fine. Environment is very nice though. Compared to other places to get a nice steak, Lucky H is definitely not the best. For the price, the steak was plain and didn’t stand out at all. Overpriced in general. We had large party, which I know can be tough in ways but man, the service was so slow and getting our checks took an hour after we finished. We probably won’t go back, there’s other places that are just better in that price range. But you probably won’t regret going, if you do.",
   "I feel like this is a hidden gem! Romantic. Quiet. Amazing quality, well prepared. You're not going to get anything wild and crazy but what you can expect is high quality.\n\nThe breakfast buffet is to die for. They make the baked goods on site. Eat the muffins, rolls and pastries. This is not a time to diet.\n\nAnd we saw John Huntsman Jr eating there too so you might see some Utah royalty. \n\nThis has become a family tradition to do the breakfast buffet around Christmas.\n\nThere's usually not a long wait like the coffee shop. Best date night place too!",
   "I love the lunch buffet here. The salad bar is fantastic. They usually have prime rib and turkey as well as other great options for the main course. The dessert bar will have something for just about everyone. The problem here is definitely making room to try everything that looks appealing. That and focusing once you get back to work.",
   "Good atmosphere..Good service... Better than Chuck a Rama,  slightly better... Not phenomenal... high priced breakfast bar.. Fun occasionally though."
  ]
 },
 {
  "name": "Kyoto Japanese Restaurant",
  "address": "1080 E 1300 S, Salt Lake City, UT 84105, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/00d6061c-9334-11ea-b4d7-14b31f159f22.png",
  "tags": [
   "music",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=852129689395890373",
  "source": "GoogleMaps",
  "reviews": [
   "It was a very warm atmosphere in here when we walked in. The host, chefs and server were all on point. Authentic Japanese fare is really a treat and the price was right. I think the music needs some work, it was sombre like a sorrowful dirge so let's turn that off and play something more festive. Alright?!",
   "The environment is great, is Japanese tatami style, some waitress wear kimono. I ordered uni, Bad smell and also taste bad way. It’s bad experience for this. No waiter asked our feedback. And also missed one shrimp when they served my dishes. I told the waiter three times then he said okay, I will bring you the missing one. Anyway, here is the place I don’t want to come back.",
   "I feel torn about this place. My sushi was awesome.  The gyoza was good. The staff were nice. \n\nThe booths set down in the ground are awkward to get in and out of. \nThe place wasn’t super clean. \nThere was a piece a paper in our gyoza dipping sauce. \n\nI’d be open to trying this place again but I think it’s overrated currently. \n\nI got the firecracker roll and enjoyed it.",
   "Best Japanese restaurant in SLC hands down! We love their sushi and recommend the agadashi tofu for a starter. The service is fast and conscientious. We enjoy splitting a bottle of their plum wine as a table. We got their green tea mochi for dessert last time and it was delicious!! Definitely visit this authentic restaurant if you get the chance.",
   "I visit this lovely spot often! This is my favorite restaurant to pass a nice evening.  I visit this spot regularly. The food is very good, the staff is welcoming and the rates are decent. I enjoy going in this restaurant to have a rich supper."
  ]
 },
 {
  "name": "Sapa",
  "address": "722 State St, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0126851c-9334-11ea-85a7-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "delicious",
   "free",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5115059882270318176",
  "source": "GoogleMaps",
  "reviews": [
   "The food at this place was amazing! But..... We did have to wait a very long time even though we made reservations. (2.5 hours)  We also received a parking ticket of a $50 fine for parking in the parking lot.( Which is my own fault for not noticing the sign, but I thought $50 was quite steep!)  I was told by an employee that they own the bank across the street and you can park there after business hours. But you might want to double check on that with them, because Salt Lake City loves to give out parking tickets!",
   "I'm not big on sushi but they have a lot of other options that are delicious. Went with a big group & they were able to accommodate our party of 20. We made reservations as well. Everyone loved the sushi. Staff was great! Definitely recommend!",
   "This is my favorite sushi location in SLC. I enjoy the ambiance and the service and the sushi is delicious. They are always accommodating, on one occasion switching out any tuna in our rolls for my breastfeeding sister-in-law. I will say that about 5-6 months ago they changed the number of pieces per roll from 8 to 7, removing one of the end pieces. I don't understand why, but everything else about it is so good! \n\nNote: recently, the large parking lot south of them changed from public parking to privately-owned, so it is a bit harder to find free parking around the establishment.",
   "I find every excuse I can to come to Sapa, every special occasion! It is perfect in every way. No exaggeration. I have loved the bar addition next door the last couple years! Favorite sushi in SLC, best atmosphere and a great place to celebrate special occasions with your loved ones!",
   "Stayed at the Grand America in Salt Lake and found this sushi place near by! Other than being slightly over priced the food was pretty good! Nothing overly fantastic or amazing, but the flavors worked very well together. Nothing I had tasted or smelled fishy wish was great. It's a good place and I would come here again, it's just that there wasn't anything super unique or different or amaIng about it compared to every other Americanized sushi place. Service was good too. Waiter was constantly topping us off and was super nice. Overall a good experience."
  ]
 },
 {
  "name": "Porcupine Pub & Grille",
  "address": "258 1300 E, Salt Lake City, UT 84102, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0183c1d8-9334-11ea-8293-14b31f159f22.png",
  "tags": [
   "food",
   "knowledgeable",
   "drink",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=672674861963208527",
  "source": "GoogleMaps",
  "reviews": [
   "Probably the BEST service I have ever seen. My daughter's dance school came in mid competition on a deadline with a party of THIRTY and asked if it was possible to be seated and out quickly. The manager was confident and friendly and they had all 30 of us seated and out in and done in an hour. All order and checks correct! Food was fresh and portions were huge, servers were very friendly and accommodating. The manager even personally came by to bring extra salad dressing and check that everything was going okay! Definitely recommend.",
   "Porcupine Pub & Grill is an old fire station converted into a pub. The interior has a great vibe.  We found the staff to be exceptional.  We were greeted by Sonny and he was happy to make a space for us on the patio.  Our server was knowledgeable and attentive.  The meals were great.  My order came out wrong, but they were quick to correct it without any fuss at all.  If there is a downside, it is lack of parking, but that is the case with all of the businesses in that area. Definitely recommend and will return.",
   "This is the newer of the two Porcupines, a fresh decor and light surroundings on two floors, former location of Market Street Grill. Porcupine is one of local favorites and it has never disappointed. Food is good, the crowd is lively and the drink menu is above average. No reservations unles you have 16 or more, but you can call in advance to put your name on the list. It's close to theaters and gets packed from 530-730pm on play nights, be aware. Great patio for summer hangouts! Dinner for two - expect to spend $50-60 and leave with a smile on your face!",
   "Went here for date night a few days ago and had a wonderful time. I believe our waiters name was, Chandler(?), and he did Amazing. The food was ok, nothing to boast about would give it a 4 out 5 stars for the food, but that was the best service I have had at a restaurant in a long time. I hope he enjoyed the 40% tip because he more than earned it. They have earned my business back based on their service. Thank you guys!!",
   "I love the fact that it's very spacious. The food was good, as well. I just wish they had more parking spaces. Overall, I enjoyed it."
  ]
 },
 {
  "name": "SLC Eatery",
  "address": "1017 S Main St, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/01d193ee-9334-11ea-a5f8-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food",
   "food",
   "creative",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10722720533385285394",
  "source": "GoogleMaps",
  "reviews": [
   "EAT HERE!  Oh buddy,  let me tell you this place is incredible.  Limited cocktail menu but delicious and lively.  Good wine selections and GREAT FOOD!  Everything we tried was delicious. I can't wait to return.",
   "Cute place with a cool concept of cart service, which allows you to sample a variety of small dishes in addition to your entree. The service, food and drinks were great! There were a few dishes on the cart menu I was interested in trying, but didn’t get a chance to because they weren’t on the cart any of the times they came by. Would definitely recommend.",
   "SLC Eatery is a super cute and chic place. We went here for brunch and was surprised that they had a dim sum inspired menu. Service was fast and we had a great waiter. We'll have to come back later and try their dinner menu as I've heard it's more new age American food.",
   "Wow. No joke some of the best food I've had in SLC. Its original, inspired, and creative. The ambiance is mellow and welcoming. Service is fantastic. Food is very very good. It's not a great place for restricted diets as most of the meals contain and combine dairy and meat. Even if you drop by for the cart, drop by.",
   "Had a small bachelorette party of nine catered by SLC Eatery and everything was amazing. The food, service and setup was all  absolutely perfect. Will definitely do this again!"
  ]
 },
 {
  "name": "Mahider Ethiopian Restaurant & Market",
  "address": "1465 State St #7, Salt Lake City, UT 84115, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/021d6a2e-9334-11ea-94ff-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "unique",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4484967162198831355",
  "source": "GoogleMaps",
  "reviews": [
   "As a Mexican I had never eaten Ethiopian food. This became an awesome experience! Staff was friendly and food had a great taste. I got the Mahider sampler and it had so many different tastes.\n\n Cost was 14 dollars for one person. It could feed two normal people. Eating with your hands came easy for me since I am used to tortillas. \n\nIf you want more spice just ask when you order. All in all I will be going back with the wife.",
   "Amazing restaurant where you get the experience of having Ethiopian food and know about the culture. We were four and we had the meal for four people. It was more than enough for us. We had the chance to try everything and the food was delicious. I will go again for sure. They also have store where you can buy Ethiopian groceries.",
   "Mahider was more than just a restaurant, it was an experience! Our waiter was helpful and kind. The food was delicious and unique. If you haven't tried Ethiopian food, it is high time you did. Head over to Mahider for the best food and experience!",
   "The food here is fantastic. I wish I lived close, so I could eat here more often. Get the Taste of Mahider. Friendly staff, huge portions and quality food for a great price. That's a rare combination that's worth the drive.",
   "So special and traditional food. I love the flavor! They have several kinds of sour vegetables, soft bread, and smashed beans. Nice people there."
  ]
 },
 {
  "name": "Cannella's",
  "address": "204 E 500 S, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/02698e88-9334-11ea-af04-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "family",
   "food",
   "food",
   "delicious",
   "food",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=3140491413782983253",
  "source": "GoogleMaps",
  "reviews": [
   "Cannella's is a staple of Salt Lake City. My mom loved this place when she was in college and working in the city and now I love it too! Their salads are my favorite, and the specialty Cannella's salad is especially unique and delicious. Plus, their variety of drinks can't be beat. The atmosphere is modern yet cozy so it's perfect for dates, drinks, or dinner with the family. Overall, it's a great place to get some good Italian food and a taste of SLC.",
   "Great food. Amazing staff. Can't wait to go back and try something else. I had the zucchini noodles and meatball. The meatball was huge and had the perfect texture and seasonings. The deep red marinara sauce was incredible. Brooklyn was the best!",
   "Located on the corner 200 E and 500 S. This cozy Italian restaurant will tantalize your taste buds. The food was delicious and the staff very attentive. This place will become one of your favorite places for a wonderful dining experience.",
   "Ordered the lasagna around 9:00pm (they close at 10:00) and something tasted off. The cheese was rubbery and seemed like it had been in a warming oven for awhile. Same with the meat. The server also admitted their bleu cheese “house” dressing was Kraft... for the price, you’d expect house made. Salad also had canned beets, again not a serious sin but I was expecting fresh ingredients. Maybe everything had been fresh the experience would have been better.",
   "Cannella's is  a wonderful dinning experience. The dishes are wonderful and visually appealing. It has a bar, and there is alfresco dining in the of the restaurant. The service is quick and the staff is very knowledgeable. The deserts are wonderful.  It's a great time for your taste buds."
  ]
 },
 {
  "name": "Blue Lemon | Salt Lake City",
  "address": "55 W S Temple, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/02b650b6-9334-11ea-a645-14b31f159f22.png",
  "tags": [
   "food",
   "free",
   "food",
   "food",
   "delicious",
   "kids",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8522677598171060322",
  "source": "GoogleMaps",
  "reviews": [
   "If you are looking for casual dining that almost feels fancy, this is the place. Food here is fresh and light. The sweet potato fries and sweet with a touch of salt. Highly recommend.  It's definitely busy. I'm not sure I like the order line, it feels like a fast food place, but everything looks classy and they bring your order to you. Food tastes great:) If you come during the holidays you get a gorgeous view of the Christmas lights out the large windows!",
   "I heard a lot of good things about blue lemon. It was good food but nothing spectacular. I had the summer chicken Cesar and that was good. I also got a free appetizer by downloading the app. I would recommend doing that. It was a chili corn quest dip. It was good but I would have liked more green chili flavor. I would go back because it was different but it reminded me in many ways of Panera.",
   "EDIT: I've returned a few times and also tried the Korean Style Beef-Rice Bowl. It was way good.\n\n-Original Review- \nVery good. I got the Mediterranean salad with added salmon. Table service when the food is ready and bussing so you can get up and go when you're done. Very good, very convenient.",
   "We had a great dinner at Blue Lemon this evening. It was packed when we got there, but the line moved quickly and several tables opened up for our large family. \nOur food was ready within five minutes, which we were pleasantly surprised about, given the amount of patrons. \nEverything was delicious. The adults, teens and kids all found menu items that appealed to them and enjoyed all of it.",
   "I ordered a door dash from here. Everything was good except I found a long white string in my chicken BLT. I've tried to contact someone but no one picks up. Just wanted you to be aware of things like that."
  ]
 },
 {
  "name": "The Other Place",
  "address": "469 E 300 S, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0302fed4-9334-11ea-813a-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6392369834443183161",
  "source": "GoogleMaps",
  "reviews": [
   "The Other Place is a great place for a hometown feel. I can't say for sure, but I would bet that they have regulars they know on a first name basis. The family who runs it is Greek, so they have a lot of Greek food choices mixed in with the American items. This is a traditional Greek style chicken (I can't remember what it was called) with spaghetti in their house sauce. I was expecting a tomato sauce like I have typically had on spaghetti,  but at the Other Place they put cinnamon in it. It was a little surprising at first, but I actually really enjoyed it. They are known for having really good breakfast food,  so I will have to try that next time.",
   "Good food and great service!\n\nPros: \n-We had 12 people in our party and Manolis was our server and did an amazing job of serving us with a great sense of humor. \n- The lamb is SO good!\n- The rice pudding was excellent and the baklava was heavenly!\n- Accommodates large parties easily\n\nCons: \n- Can't think of anything!",
   "I went here with my wife, and we both had a very positive experience. Our server was very helpful in giving us recommendations. While he was doing so, a regular customer told us that we could close our eyes and point to anything on the menu and be happy with it. I don't doubt that to be true. We ended up splitting a dinner, and it was enough food for both of us to feel satisfied. We're planning on returning. Good food, and great service.",
   "Absolute gem. The portions were generous and delicious. The food came out fast and the service was quick and more than helpful. This was our first time going here and we will definitely be back. The pita was the best I've ever tasted. There is a parking lot in the back so you don't have to park on the street.",
   "One of my favorite places in SLC! We try to come here whenever we're in town! Delicious food and great service. I love the special house salad with the marinaded chicken! I usually take a to go order of the chicken home for later! We have never had to wait to be seated and that works great for lunch when we are traveling!"
  ]
 },
 {
  "name": "Garage on Beck",
  "address": "1199 Beck St, Salt Lake City, UT 84103, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/034d3b1a-9334-11ea-b4f1-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8068255968746923934",
  "source": "GoogleMaps",
  "reviews": [
   "This place is absolutely fantastic!  I  had lunch here with three work colleagues on JAN 23, and everything we ordered was phenomenal!  Amazing customer service.  You will not be disappointed!",
   "Best food in Utah!!!! Amazing!!! Can’t say enough good things :) The funeral potato’s and 5 way burger are the best! A must try place. Parking is a challenge but well worth it",
   "Hidden gem north of the downtown area.  Parking is a bit strange but the food and service is very good.  Live music is always nice.  Cool industrial vibes next to the oil refinery.  The wings are amazing!",
   "Always a great staff. Even after the \"incident\" with the local band and the merch table. Can't recommend this place enough.",
   "We came on a recommendation about their Sunday brunch...which it did not disappoint.  It opens at 1030am and was worth the wait.  Parking is very limited, so get there early.  There is plenty of seating around this grungy bar.  The look is authentic and the food is no joke.  Do yourself a favor and get the funeral potatoes.  You will not regret it.  The chicken and waffles is so much food you will take it home and the philly omelet was made with the whizz!  If you have to ask...you can't afford it.  The bloody Mary's are on point and I got a 5 gallon bucket of diet coke. Would live to go back if in town and try something new."
  ]
 },
 {
  "name": "My Thai Asian Cuisine",
  "address": "1425 S 300 W, Salt Lake City, UT 84115, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/038d69d2-9334-11ea-b519-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "delicious",
   "eat",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8170634964766538017",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome family friendly atmosphere!  The lady working (she is the daughter of the owners) was so helpful to me and went above and beyond when I told her I needed gluten free options.  Not only that, but this restaurant carries all gluten free soy sauce.  That is unheard of, but much appreciated.",
   "Best Thai cooking in Utah! Delicious! Dee the owner is passionate about her love .. Cooking and making people happy! Love this place. Stop by for lunch she has a little Buffet where you can just choose a few items and eat for under $7 a plate it's wonderful! Great fresh food and good portions!",
   "This is as close to authentic thai food as Utah gets! Ive been to a few Thai restaurants here, but this one stands out the most. Its a restaurant run by a Thai family, and an old Thai grandma is the one cooking. Prices are very reasonable, and I love the atmosphere of this place. Very friendly workers. I was not disappointed",
   "Fresh ingredients, friendly fast service and friendly owner. Basil stir fry and pad Thai were we're good. Yellow curry was not my favorite, and that is usually my go to dish. Personal I am with says it's their favorite place. You may like it more than me but not where I'd go again for yellow curry. Reasonable prices.",
   "Modest price, good tasty food & decent ambiance."
  ]
 },
 {
  "name": "The Rose Establishment",
  "address": "235 400 W, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/03e10846-9334-11ea-b2ff-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "creative",
   "delicious",
   "food",
   "delicious",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1457275926377065433",
  "source": "GoogleMaps",
  "reviews": [
   "This is not your eggs & bacon breakfast place. This is your  Rise & Shine breakfast place. The second you walk in there, you can smell the fresh coffee beans and feel the good vibe. I totally recommend this place. Take a friend or come here by yourself. You will never be disappointed. Food has lots of flavour and it's very fresh. They serve Mimosa's too!",
   "This is probably my favorite spot in Salt Lake for breakfast. The breakfast foods all have a creative spin on the classics: cinnamon rolls, cheese biscuits, scones, avocado toast, etc. the coffee is amazing...but let’s be honest, I usually indulge in the mimosas:) The patio is beautiful in the summer/spring. If you are new to Salt Lake, or haven’t tried this place yet, do it! Come for breakfast!",
   "This is a great place, but not for everyone. The coffee is high, high quality, but the blends are very sweet and floral and not for people who really like bitter coffee. It's also always slammed in the morning, especially on weekends and it's a small place so not a lot of places to sit. Because of this, if you want a pour over it will take 15 minutes or more. With these things being said the food quality is amazing, the bread is some of the best bread in Utah and the tasted are great. Their avocado toasts are delicious and their sweets are good.",
   "Fresh and delicious menu with great breakfast and snack options. I had the melon milk tea and the flavors were beautiful. Also stocked up for the road trip back to Denver with the blueberry cornbread and sweet roll, the cornmeal cookie, oatmeal cookie and pesto bun. Each of them were so yummy.",
   "This is just a really great spot! The staff is knowledgeable and cool. There can often be a line, but they handle it well. The food is very tasty and the coffee is fantastic! The decor is authentic and simple which make it a comfortable place for a quick bite or longer stay."
  ]
 },
 {
  "name": "Chile-Tepin",
  "address": "307 W 200 S, Salt Lake City, UT 84101, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/042d53c8-9334-11ea-a525-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "drink",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17067054382316329986",
  "source": "GoogleMaps",
  "reviews": [
   "I’ve seen it over and over again and the reviews but it is honestly true, this place is probably the best Mexican food I’ve had in Salt Lake. The price is also super reasonable. The meal cost $30 and was very filing! The atmosphere is also a clean modern place with friendly servers. Parking is the one thing that can sometimes be an issue here, we’ve had to park on the other side of the block and walk over but it isn’t too bad because there is a parking lot that you can walk across.",
   "Was told the kitchen was backed up 45 minutes or so. OK cool I appreciate the heads up. Sat there for almost an hour and was brought water, chips, and salsa. NO ONE EVER CAME TO TAKE OUR DRINK OR FOOD ORDER!! I EVEN ASKED SOMEONE TO TAKE OUR ORDER AND WAS TOLD SHE WOULD BE RIGHT THERE. ANOTHER 10 MINUTES AND STILL NOTHING! My party of 3 gave up and left! Probably will not be back!!",
   "One of my personal favorites! I can't count the times that I've dined there.  The food alone would bring me there; however the service is way-over-the -top!  Without a doubt one of the  top restaurants in Salt Lake City.  Very nice interior.  Just simply a great all around dining experience.  Go there and enjoy!!",
   "Didn't get a chance to try the food because the online menu stinks sadly. I don't speak a lot of Spanish and the titles are in Spanish so I don't know what it is. Plus there's no pictures to show it or any kind of details on what is included or what options are available to you. Not until you click on ordering then you get an idea on what might come with it. It was highly recommended with its high pricing but guess the only way to find out is to call and see how that goes. And even then the phone call I made was very poor quality because I couldn't hear over the static.",
   "Incredible. I am huge on the quality of service rendered to customers, and Chile Tepin delivered. The wait on the Saturday night that we went was about 45 minutes, but it was so worth it! The staff were all warm and friendly, the ambience of the restaurant was welcoming and the food was delicious. There was plenty of flavor and an authenticity in each dish. I especially loved the molcajete dish (good for 2 people) and the desserts. Churro cheesecake shown below is an intriguing, very rich flavor. I would have preferred a small bite of it rather than an entire slice, but really all the food was exceptional."
  ]
 },
 {
  "name": "BOLTCUTTER",
  "address": "57 E Gallivan Ave, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0471fe18-9334-11ea-9907-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "delicious",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=4296925287881488804",
  "source": "GoogleMaps",
  "reviews": [
   "This was our first time trying an all vegan restaurant and it was so good! The cauliflower wings alone are enough for us to come back again and again. But the burritos were amazing too! The server was very nice and it's clean. Really enjoyed this gem.",
   "I guess I’m fortunate to have come here for the first time recently, loved the burrito and the nachos. It’s sometimes hard finding food plant based options and healthy can be a little bit more expensive which is a downside. However I guess you need less because there’s actually more nutrition, so better all the way around. The staff was friendly and food came out pretty quickly. I would eat here again and again . Thank you 😊",
   "Came here during a short layover & enjoyed it. Food came out really quickly and the staff is nice. It is 100% vegan & very reasonable!",
   "I ordered the quesadillas.  Ask for the hot sauce - delicious.  Restaurant is all vegan and an ice cream store next door that is all vegan too.  Had rocky road ice cream after a long time!",
   "Great place to eat! Vegan friendly. The menu is simple, but everything I've had here has been delicious!"
  ]
 },
 {
  "name": "Sawadee (Utah) Thai Restaurant",
  "address": "754 E S Temple St, Salt Lake City, UT 84102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/04bc017a-9334-11ea-b715-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12099529811413789623",
  "source": "GoogleMaps",
  "reviews": [
   "Most satisfying lunch I’ve ever had! The lunch special let’s you pick two types of courses, served with rice. The service was incredibly attentive and friendly. I would highly recommend this place. Looking forward to going back soon.",
   "Nice atmosphere, great food, plenty of vegetarian options.  I had the lunch special which was a great price and very delicious. The decorations in the restaurant were nice.  There is parking outside with plenty of spaces which is great for the area.  Food was out quickly, there was no wait time and it was a pleasant experience overall.",
   "The coconut soup with mushrooms and shrimp is amazing! Like the best in the Salt Lake valley. It is full of flavor and fresh ingredients! The green curry was also nice and had a good zing to it. The atmosphere was delightful and the lunch time special is a wonderful price for all the food and flavor you get. Highly recommend, and I will be back for the Pad Thai along with all the many drool inducing options. The guava candy at the end leaves you well pleased.",
   "Sawadee is my favorite Thai restaurant in Salt Lake. I start craving their coconut soup as soon as I get anywhere near the area. Such great flavor. The curries are wonderful. I have not had a dish that disappoints.",
   "Delicious Thai food! We had the yellow curry, pad Thai and pineapple fried rice. Finished with the delicious mango sticky rice, not pictured. Quality food. Large portions. Quality service. The waitresses, all the workers were friendly. After eating our meal, we ended up buying a full rectangular tray of pad Thai and a full rectangular tray of the pineapple fried rice for a birthday party the next day. Everyone loved the food! We are loyal customers now. We’ll be back again."
  ]
 },
 {
  "name": "The Blue Plate Diner",
  "address": "2041 S 2100 E, Salt Lake City, UT 84108, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0507d7fa-9334-11ea-b82f-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "food",
   "art",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3645714862998463840",
  "source": "GoogleMaps",
  "reviews": [
   "This place was hopping! \nAs quickly as people left, people came in.. They have a routine that gets the jobs done quickly and efficiently.. I was impressed..\nI got green tea/peppermint and the build your own omelette. There was plentiful of food and decent prices for what you get..\nIf I could give them 10 stars I would!",
   "Fantastic restaurant overall!  Went for the first time while visiting friends.  Initial service was a little hit-or-miss (waiting for waitress) but once she arrived, service was great.  I ordered the waffle with home fries, which was amazing.  Instead of one waffle, you get two smaller ones that had a kind light icing around them.  Came with strawberries, whipped cream, and home fries.  The strawberries were amazingly fresh.  The home fries could've used more seasoning, but nothing that a bit of pepper didn't fix.  My wife ordered huevos rancheros, which she said were amazing.  All in all a relaxed place with a good menu and patio seating.",
   "This is a very easy 5/5 for me. The service was fast and friendly, and the food was plentiful and delicious.\n\nWe got the hummus as an appetizer, and it came with deliciously soft pita. The Corned Beef Hash was excellent on its own, but it also came with perfectly light and fluffy scrambled eggs and some seriously tasty toast.\n\nEasy recommend. We're already planning on bringing our extended family here next month when they visit.",
   "The service was quick and the staff friendly. \n\nThe food was hot and tasted fresh. I liked it and loved that they offer breakfast all day. The pancakes were so good. I love pancakes and highly recommend theirs. \n\nMake sure to pay attention to the art on the walls. Their are some fun ones displayed.",
   "Enjoyed the food and location. Major issue for our visit was that we ordered lasagna which ended up being spicy, my wife wasn't able to eat it but was still charged for half of it (she had eaten the bread, salad and steamed veggies so I can understand where they are coming from, but that is something I don't agree with personally). My food was tasty and the portions were great, just had an overall \"OK\" time."
  ]
 },
 {
  "name": "Taco Taco",
  "address": "208 500 S, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0545a434-9334-11ea-9419-14b31f159f22.png",
  "tags": [
   "delicious",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14407806809336227552",
  "source": "GoogleMaps",
  "reviews": [
   "Taco's are super delicious! So much flavor! Everything on the menu is delicious. Only downfall is they don't have a soda/juice machine for refills on beverages.",
   "Locally owned, friendly taco joint that serves up a lot of flavor.  I would recommend visiting if you find yourself in beautiful SLC.  Any place that has a salsa bar is already scoring high for me, compound that with great tacos and friendly atmosphere.  winner winner!",
   "Perfect portions, quick service and a salsa bar. \n\nWhen you walk in you order right at the register. All of the tacos are base models and you finish them yourself at the salsa bar located in the next room. I can see this taking the guess work out of making choices as far as menu items are concerned. If you don't like onions, don't put them on your taco. Or, if you like pickles and don't like onions but are curious to try pickled onions, just throw a couple on the side of your plate and sample a couple. Water is self serve and it was ice cold for my visit.\n\nI will say that the sides are bare bones too. The rice and beans could have used a little S&P. But that is a very minor gripe. \n\nOverall a good place that will fill you up but wont break the bank.",
   "Taco Taco was a very cute restaurant with a fun vibe. The tacos were quite good and there were a few different salsas that could be added. The tacos al pastor were not exactly what I expected but I still enjoyed them a lot!",
   "Awesome food!\nGavin is seriously a fantastic hire. He was extremely helpful to an elderly man who was there eating by himself. Super cool to see staff that goes the extra mile taking care of every customer."
  ]
 },
 {
  "name": "Alamexo",
  "address": "268 State St #110, Salt Lake City, UT 84111, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/058fa5d4-9334-11ea-8027-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3348548480770957956",
  "source": "GoogleMaps",
  "reviews": [
   "This place has some of the best Mexican food in Utah. It’s high quality food that tastes amazing. It’s a great experience that I highly recommend. I loved the guacamole, salsas, chip, tacos, enchiladas, pretty much everything. It is right in the heart of Salt Lake, so parking is limited. The ambience was cool and elegant. The service was spectacular. It’s very clean and beautiful. I would recommend visiting outside of rush hours. You cannot go wrong here. The only downside is it is a bit expensive.",
   "this hidden gem is located on state street in salt lake and let me tell you it is top notch.. a little gourmet ‘Tex-Mex’ fine dining experience over delivers and did not disappoint myself as well as all my mates.. Named Alamexo, this fine restaurant is play on words that pays homage to the historical event known as the Alamo.  Honestly the perfect name for such an eatery with strong theming to make you feel as though you are transported to the actual Alamo itself.. The servers are extraordinarily personable and quick.. the food amazing.. take an extra step beyond the complimentary chips and salsa and order the guacamole, the server prepares it right in front of you and it’s like nothing you’ve ever had before.. after the main course they surprised our table with an extra treat on the house and it made the night that much better.. phenomenal experience",
   "You'll spend a ton of money for ho hum Mexican food. I've never even heard of burritos and tacos being that expensive, MAYBE if you had a few Michelin stars you could get away with it. I mean around the corner is a taco truck with awesome al pastor burritos for $5.",
   "I really love this Mexican restaurant in downtown Salt Lake. I think I might be one of the best Mexican restaurants in the City.",
   "The decorations in the restaurant were really cool and set the mood well, but they seemed under-staffed and our server wasn’t very good. Their prices are way too high for the amount of food you get. You pay for the arrangement of food on the plate it seemed like. Will not go back, but the food was pretty good!"
  ]
 },
 {
  "name": "Hires Big H",
  "address": "425 700 E, Salt Lake City, UT 84102, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/05d8e3e8-9334-11ea-af58-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9475161144140397033",
  "source": "GoogleMaps",
  "reviews": [
   "Love this place. Really good food and it looks great inside. \n\nPrice is comparable to others and they are open for take-out during Covid19 situation going on. Drive up in your car and they’ll come out and take your order.",
   "The burgers are great but unfortunately besides that, everything else is sub par. The fries are similar to those of five guys and the onion rings just tasted like cornmeal. The restaurant itself is clean and nostalgic. We had to wait much longer than usual because they forgot our order. The waitress came back  twenty minutes later and reintroduced herself and asked if we were ready to order though we already have her our order 20 minutes prior. But even with all that we enjoyed our meal. Though it may be a bit till we come back around.",
   "Best burgers in the WORLD!\n\nNick \"Twelves\" and Leilani go over and above, which is unusual in this day and age. The service and food is always top notch. The car hop service is a charming throwback and actually very functional in this bizarre social distancing time. We love love love this place because of the people who work there ❤️",
   "We had a little issue with a slice of pineapple on our cheeseburger but besides that it was good. Grilled hit dog with cheese was great! Average fries but pretty good onion rings. For a burger joint you could do a lot worse.",
   "I love this place. I look for excuses to go to Salt Lake City just so I can come here. The food is so good, the service is great, and the portions are huge. Their onion rings are pretty good, but I recommend their fries. They have bomb fry sauce too."
  ]
 }
]