[
 {
  "name": "Meow Wolf",
  "address": "1352 Rufina Cir, Santa Fe, NM 87507, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/062a1168-9334-11ea-9909-14b31f159f22.png",
  "tags": [
   "kids",
   "unique",
   "art",
   "nature",
   "music",
   "art",
   "family",
   "art",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9895253263373375600",
  "source": "GoogleMaps",
  "reviews": [
   "Nearly impossible to describe. I feel bad giving only three stars given the incredible effort and overwhelming nature of this genuinely unique attraction.  But here's why I only give it 3 stars.\n\n Part of this is like an enormous escape room but with the details  so deep and so authentic that the immersion could be nearly perfect. Nearly perfect, except there are dozens and dozens and dozens of people all trying at different levels to solve the puzzle while dozens and dozens of screaming, squealing and hollering children run around you. Did I mention some of the clues are audio clues?  And the actual mystery you are trying to solve is intriguing but also vague and open ended.  \n\nRelated but somehow separated (the transitions between are AMAZING!) the rest of the attraction is like a demented fun house. The art installations are without peer but one quickly gets over saturated from simply Too. Much. To. See.\n\nBut see it you should if you can. I'm glad I saw it and I'm still processing it all. My suggestion to the management is have some adults only nights with no children allowed. Sorry if this offends any families, but even my favorite Science Center, which is clearly geared towards kids, has a grown ups only night once a month.",
   "Meow Wolf is an amazing interactive museum of mystery. So much story and lore behind all the interesting and captivating exhibits. My favorite thing to do is go to shows for some of the best artist for intricate heavy bass and alternative indie music. There is always so many amazing people who come out to these events! I feel a strong connection to this place and the community  and I will always cherish that. If you're looking for something to do in Santa Fe, definitely go to Meow Wolf for an extraordinary experience.",
   "A bit pricey. But this place is absolutely amazing. I'd say try at least once, but due to the prices I probably wouldn't go back. Even the gift shop pricing was excessive. I really love art and love to support art but it's very hard when things are priced so heavily. Meow Wolf itself was a good experience and one like no other. It's like if Alice in Wonderland was a real place on earth. It really captured the magic and essence of creativity and exploration. I do no regret going here at all. This place is not suitable for those with disabilities. You must be in pretty good shape to get around and go through washing machines and secret portals. The staff here is friendly and the characters are delightful.",
   "Not sure why it’s advertised as a haunted house. However, this place is so far out of this world. It’s mind blowing going into all the different rooms and thinking of the complexity of effort that went into setting everything up. You can be self guided through a really deep puzzle of a family that went missing and there are different areas where you can solve puzzles to get more clues. If you don’t want to partake in the storyline you can most definitely enjoy the abstract artwork. I want to go back on a weekday when it’s hopefully less busy to try to solve more puzzles.",
   "Meow Wolf contains some of the most beautiful art pieces I've ever seen. It's a super complex story and although I couldn't quite solve it, I really appreciate it. Pieces were created with immense creativity and were just made so beautifully! I can't get enough of this place, everything is so gorgeous and the gift shop is so fun too! If you're an artist, someone who appreciates art, or just someone looking to do something fun, I 10000% recommend you come here to see everything for yourself. It's worth the price and there's some cute lil food trucks outside if you're hungry after coming out!"
  ]
 },
 {
  "name": "Santa Fe Plaza Inc",
  "address": "63 Lincoln Ave, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/06723e4c-9334-11ea-8048-14b31f159f22.png",
  "tags": [
   "art",
   "history",
   "walk",
   "family",
   "eat",
   "historic",
   "food",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=410234213081149643",
  "source": "GoogleMaps",
  "reviews": [
   "Despite the ultra high-priced tourist invasion of this centuries-old plaza, it is still a wonderful experience. Very walkable with museums,  restaurants and plaza  activities. The landmark La Fonda Hotel still has most  of its original architecture,  art, and other features. Hallways are lined with descriptions, photographs, and artifacts about Santa Fe's centuries of history, and it's past and continuing arts culture.",
   "Wonderful place to buy souvenirs and eat. Family friendly and you can walk to various places. Prices are moderate. You see Santa Fe architecture everywhere. I had a short time their but definitely worth spending more.",
   "Like nowhere else; so visually appealing, so historical, shopping and food right around the plaza is GREAT, and dog and people friendly. Because the plaza area is so historic there are areas that can be challenging for those who may have any ambulatory challenges as some areas are uneven or narrow. The plaza and Santa Fe are truly magical and one of the best places to visit in the US.",
   "I was just ok. Lots of shops that aren't of interest to me as it would be to others. I would prefer to support more of the local artists / people of  New Mexico. There were dinner around the Plaza, but they are having to compete with the local shops where some bring stuff in from China. Would be nice if the shops were not able to carry me produced good and they all had to be hand made. Just my opinion..... I like to contribute to the people.",
   "Check Out ALL the Cool History of Santa Fe NEW MEXICO!! So many Fun things to do here to make a list. Great Food Too, Come And Check Out Our Wonderful State."
  ]
 },
 {
  "name": "Georgia O'Keeffe Museum",
  "address": "217 Johnson St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/06bc18b0-9334-11ea-bedc-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "art",
   "art",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=9315933292621040249",
  "source": "GoogleMaps",
  "reviews": [
   "A great museum, especially if you like Georgia O’Keeffe’s work. \nWe’ve always known her for her flower and bone paintings, but saw there was so much more we hadn’t seen before.\nIt’s not a big museum, so expect to spend no more than an hour there.\nGift shop is small, but in addition to many prints of her work, there are some locally made products sold there too",
   "A small museum, 9 galleries, that allows for contemplation at each Georgia  O'Keeffe painting. You can watch a video, too. A docent is always available, and both docents and guards are very knowledgeable and eager to answer your questions. \n\nThe gift shop is small, but full of reasonably priced items. A pleasant atmosphere that needs to be on your itinerary when visiting Santa Fe. It is the only museum dedicated to a female artist, the greatest of the 20th century.",
   "Great little museum lots of sitting benches and photography is acceptable with very few pieces of art not acceptable to photo. plaques have full detail of when the art piece was made and where they were made, some even have the inspiration behind the art. signs next to art work if your not allowed to photo. plus they have a room with her time line of every piece of art work she did and a education video of her life story and art inspirations.",
   "Some wonderful art work, unfortunately I came when 1/2 of the artwork was off the walls for photographing.  Much of her work seemed very dark in mood.  I found the brighter colorful more to my liking.  Well maintained and a must see when in Santa Fe.",
   "Great experience for these newcomers to Georgia OKeefe. The docent tour was hugely educational and delivered in a way that kept your attention. Lockers to store bag are great idea. Museum shop also really good."
  ]
 },
 {
  "name": "The Cathedral Basilica of St. Francis of Assisi",
  "address": "131 Cathedral Pl, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0705b91c-9334-11ea-8a69-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "music",
   "history",
   "tour",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3117908723797510247",
  "source": "GoogleMaps",
  "reviews": [
   "I got so much love for this town, nothing like it in the world... amazing things like this. It’s worth going. If anyone is going and wants some ideas where you can go? Let me know I’ll give you some ideas to have an amazing experience..",
   "Very beautiful and the design for the time it was made is very extraordinary. Walking in you can picture how it would have been. Still looks as good as when it was made. Very small but so much more impressive and an important marker in the times of the mixed western culture. Outside noise is completely gone upon entering the unbelievably detailed interior. Very peaceful.",
   "The cathedral is beautiful any time of the year but holiday decorations made it even more so. The Desert Chorale concert was wonderful, a lot of Celtic music and some traditional carols. What a treat! The only negative is getting to restrooms if you need them because you have to go outside and walk around the side.",
   "Beautiful church! A gentleman welcomed us upon entering the church. He shared some history of the the area. Nice people.",
   "The greeter was very informative and provided a walking tour brochure, which was very helpful. There is much to see and admire, so plan a long visit to read about each historical item. The architecture and stained glass is breathtaking. Catholic or not, this is a must-see for anyone visiting Santa Fe."
  ]
 },
 {
  "name": "Loretto Chapel",
  "address": "207 Old Santa Fe Trail, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/074b3d9a-9334-11ea-a4a4-14b31f159f22.png",
  "tags": [
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=10588692310470129380",
  "source": "GoogleMaps",
  "reviews": [
   "Worth a visit. I wish they had docents or gave tours as I expect just wandering  through you miss a lot of history. The floating stairs are interesting. Good gift shop. Small entrance fee.",
   "Stunning chapel. Seeing the staircase was amazing. For some reason, they never added the table for the new mass(English sacrilegious ritual) and the altar is completely untouched. Beautiful.",
   "The miraculous stair case has been talked about in my home for the last 40 yrs and I finally got to see it and I was not disappointed. One of my concerns was that the “ private owner” would ruin the historical beauty but they have actually preserved it better than could be hoped for. The only thing that was lacking was the service. The lady up at the ticket counter was pre-occupied on the phone while man in the gift shop flirted around like a 5 year old. All said I will be back some day.",
   "In a time when everyone is complaining about something. This chapel reminds all of us to \"get off the cross because we need the wood.\" This chapel is a testament to human perseverance and ingenuity. It exemplifies how the spirit guides us to perform the right work at the right time for the betterment of mankind.",
   "Must see! Entrance fee is about $5 per person as it is no longer owned by the Catholic church. Audio guided tour was available as we walked the small chapel to view the miraculous staircase. Gift shop on exit has plenty of items to choose from!"
  ]
 },
 {
  "name": "Museum of International Folk Art",
  "address": "On Museum Hill, 706 Camino Lejo, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0797891a-9334-11ea-8738-14b31f159f22.png",
  "tags": [
   "kids",
   "unique",
   "art",
   "walk",
   "food",
   "music",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=9487731362818051058",
  "source": "GoogleMaps",
  "reviews": [
   "Love, love, love. THE best children’s play area. Thanks to the kid’s facilities, my husband and I were able to tag-team going around and looking at exhibits. The staff were kind and helpful and this was an all-around wonderful place to spend a few hours. Don’t miss the downstairs! (We almost did)",
   "A wonderful museum in Santa Fe with a really unique and beautiful collection of folk art, many of them statues, models and toys from a huge variety of different times and places!  The children's craft area is also a really special place where kids can have fun making their own artwork.  With all of the other great museums, garden paths and lovely views the museum hill should be a destination for visitors and locals alike.",
   "It's a lovely place to have a walk about for folks of all ages. Much more interesting than a rest area or gas/ fast food restaurant to have a break from driving. Service dogs are welcome. A showcase for the arts of the area. Friendly and well-informed staff to answer one's questions.",
   "Loved this place.  From the miniatures, to the Japanese demon exhibit, it was great fun.  Terrific music section as well.  Interesting, quirky place.  Well worth the visit.",
   "Great place for dating. Basically just one exhibit room full with fun stuff and culture knowledge. They have a well made book and machine tour guide. You could spend a lot of time to read through all the info, or just skim through. Tour time could vary from 1 to 2.5hrs."
  ]
 },
 {
  "name": "Fenn-Nedra Matteucci Galleries",
  "address": "1075 Paseo De Peralta, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/07de0826-9334-11ea-b64c-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=12786474355184103959",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing gallery, fine art and jewelry. \nHistorically fascinating. Peaceful courtyard with charming sculptures.",
   "Outstanding collection including many fabulous bronzeworks by Glenna Goodacre. The sculpture garden was fantastic--I will never forget it.",
   "Great place to visit, especially if you like art. Very relaxing...",
   "Always a beautiful selection. The grounds and building are lovely, too. The staff was friendly and knowledgeable.",
   "Very friendly. Allowed my dog. Beautiful gardens. Interesting museum."
  ]
 },
 {
  "name": "Dale Ball Trails",
  "address": "Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/08363a92-9334-11ea-b568-14b31f159f22.png",
  "tags": [
   "kids",
   "historic",
   "hike",
   "hike",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=5589489984680474527",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful, scenic and unpretentious trails. Loads of diverse scenery, rocks, and views. There are some good easy hikes for families with young kids. We took our 2 year old about a mile in on foot and he loved it!",
   "Excellent fun and easy trail, historic significance and all the goods you would want in a nice hiking area. Can get muddy in the winter as the trail is not paved at all. Still worth it just to get your mind on something other than the crazy world we live in.",
   "Beautiful trails! Took the pup out for a hike. Saw a few other people with their doggos out and about too. Would highly recommend to anyone looking for something to do on a pretty day.",
   "What a boon to the people of Santa Fe to have this trail system right in their own backyard!  Very well marked trails suitable for hiking, mountain bikes or horses.  Pet friendly.  Bring water, sunscreen and snacks if you want to do a longer hike.  Parking is ample. Everyone we encountered on the trail was courteous and friendly.  Highly recommend.",
   "Great walk, we took my 4 year old and he loved it. I really enjoyed my day off."
  ]
 },
 {
  "name": "Museum of Indian Arts & Culture",
  "address": "710 Camino Lejo, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/08923d62-9334-11ea-ac34-14b31f159f22.png",
  "tags": [
   "music",
   "learn",
   "unique",
   "art",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=110194037112599434",
  "source": "GoogleMaps",
  "reviews": [
   "Interesting exhibits...if you can see them. Lots of items behind glass but very poor lighting on many of them. We went on a cool day but found the temperature in the galleries to be much too warm. Very nice, but pricey, museum store with excellent offering of Native American music. The cage next door is worth going to on its own.",
   "Truly authentic. Unique and memorable. Learn more about the indigenous heritage that is quintessential Santa Fe. Honor and respect live here. Thank you for offering so many folks a way to understand the important culture of the past, present, and future of the native peoples, and their art that thrives here.",
   "Don't underestimate the time that you need to see everything in this Museum. Wear comfortable shoes and be prepared to do a lot of squatting to see the exhibits in the lower parts of the displays. There is a whole section of pottery that is a must-see. Great place for archaeology inclined!",
   "So much to see, so little time!  It's an extraordinary museum, giving one the feel and insight into the native culture.  Well worth the stop on Museum hill.",
   "Beautiful sculptures outside and it was nice seeing all the artifacts in the museum. We took our three kids and the had a great time in the children's area."
  ]
 },
 {
  "name": "Santa Fe Farmers Market",
  "address": "1607 Paseo De Peralta, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/08dcb418-9334-11ea-abb6-14b31f159f22.png",
  "tags": [
   "wander",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9811399512046209922",
  "source": "GoogleMaps",
  "reviews": [
   "Whether you share a love of fresh produce, like to people watch, want to wander among a plethora of colors and fragrances (see photos), or just absorb some local Santa Fe culture on a pretty day, the Santa Fe Farmer's Market is not to be missed. Located in the Railyard, there's no shortage of other things to do in the immediate area. One of our favorite times to visit is early fall when they're roasting green chilies. Ask for a sample!",
   "Love the fears Market! Great local goods like honey and even Sunny Jenni has tie dyed clothes and socks! Such a great place to visit",
   "Fresh produce and vendors-local items to buy as souvenirs. Not as many options in October as in the spring and summer, but still worth the visit. If you have your own water bottle, the coffee shop inside will fill it with water.",
   "The farmers market is exactly what you would expect with some notable differences.  First, one area is devoted to local artisans.  They are very skilled and the products range from textiles to jewelry to wall decor and other metal work.\n\nAdditionally, locally grown, fresh vegetables, meats and breads are available for purchase.  Highly recommend the locally sourced chile's as well.\n\nWe loved this market!",
   "Best time to go is spring/summer/fall. Best veggies and meats and chilies/chili powder plus lots of other things. The environment is so fun, we love going ourselves but also like to bring family when they come to visit. Can be expensive depending on where you go/what you buy but it's worth it."
  ]
 },
 {
  "name": "Cross of the Martyrs",
  "address": "617 Paseo De Peralta, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/092c3400-9334-11ea-a5fc-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "history",
   "walk",
   "history",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=18313280607586912497",
  "source": "GoogleMaps",
  "reviews": [
   "Came to see the sunset on a rainy night in Santa Fe. It stopped raining in time to get out & explore the grounds a bit. Plenty of parking and a great view, though I can imagine that on clearer nights, this place would fill up quickly. I can’t hike at the moment due to an injury, so I liked that this was really flat and really easy to walk. Great place to see the 360° view & sunset!",
   "It is a wonderful hill with the name Cross of the Martyrs. This is a new cross of the Martyrs, because from that very top of the hill I can see another old Brown Cross, and I did check that to make sure that is also name The Cross of the Martyrs before the white one here in this hill. For memorial 22 friars of Franciscan Order had been kill at the time civil and the church had authority's conflict. And also wrote down the history of the place too, Santa Fe, the first or oldest capital of US, more than 300 years. I climbed there not only one time, every day when I was there I spent just 8 minutes from Basilica of St. Francis of Assisi to there, because I could see the sunrise very clearly from the hill and look down to the center of Sante Fe, where the Basilica and Loretto chapel take places.",
   "It's an easy walk to the top.  The pathway is gradual so it doesn't seem as steep as it looks from the bottom.  The plaques along the way make for an interesting history lesson of Santa Fe along the way. The cross and the view of the city aren't that impressive especially with the cell phone tower right in the view.  Still a nice walk close to town.",
   "Nice park with a great overlook. There are interesting historical markers and the ruins of an old 1850's fort. The walk up is mellow and wheelchair accessible all the way up. One can park at the top or at a nearby park at the bottom. The elevation is just high enough to get a good view, but low enough to see the town clearly and up close.",
   "Best seat in town for sunrises and sunsets. Under a gargantuan cross you can overlook the plaza proper with tons of other folks trying to catch a good shot"
  ]
 },
 {
  "name": "New Mexico Museum of Art",
  "address": "107 W Palace Ave, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/098cdfd8-9334-11ea-a1b1-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "history",
   "music",
   "tour",
   "art",
   "history"
  ],
  "link": "https://maps.google.com/?cid=10169780421891377365",
  "source": "GoogleMaps",
  "reviews": [
   "The beautiful 100-year-old building is worth the price of admission. Do not skip the auditorium or the beautiful frescoes in the courtyard. The high quality exhibitions are enhanced by the museum's dedication to New Mexican artists and to fostering new work. In the endless array of Santa Fe venues in which to view artwork, the NM Museum of Art is sure to stand out.",
   "We visited 8/3/19 in late afternoon and it was very quiet.  Beautiful art and sculptures.  Lovely courtyard and gardens.  Very interesting display on the history of Lake Mead which we found very informative and thought provoking.  As we left patrons were arriving for a chamber music event.  Highly recommend this museum.",
   "Being right off the plaza, makes this \"must see\" museum an easy to get to museum!  We were there just as an amazing Agnes Pelton exhibit was winding down (on it's way to the Whitney NY peeps).  The murals in the atria are so beautiful.  Take your time and enjoy.  Lots of good stuff to see here.",
   "This is a jewel of a building (Pueblo revival perfection) with collections that are world class. We just saw an exhibit of Renaissance masters on loan from the British Museum. What other town the size of Santa Fe could attract such an exhibition?",
   "Cool building with lots of great history about the creation of the famous art community in Santa Fe. The guided tour with Lee was great."
  ]
 },
 {
  "name": "Santa Fe Railyard Park",
  "address": "740 Cerrillos Rd, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/09e3b298-9334-11ea-b232-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "art",
   "food",
   "art"
  ],
  "link": "https://maps.google.com/?cid=5073869066131883094",
  "source": "GoogleMaps",
  "reviews": [
   "Cool dynamic park with plenty of open space and different things to do. Haven't been in a couple years but it's a nice place to relax or study or walk your pet or walk around. Plenty of places to sit and contemplate. Great for family and friends. Felt very safe. It was hard for me to find where I was supposed to park at first but I was new to the area at the time.",
   "We came to visit santa Fe for Father's day. We walked around town and the overall area is very beautiful and clean. There are also many art installations and well maintained greenery. The railyard park is full of flowers and people and different museums near by. The train comes by often and it's cool to see, along with different restaurants. We walked around the farmers market that offered local artisan crafts and healthy food. would definitely come back!",
   "Interesting Green space that is alternating between highly designed sections, community garden, open space, playground, and a bike trail. \nCould be bigger ;-)",
   "Neat park! I've come here a few times! Love this polar bear so much! He's so cute! A must see!",
   "Gorgeous place, not too far from the farmer's market, and art market! Definitely worth coming to!"
  ]
 },
 {
  "name": "Santa Fe Children's Museum",
  "address": "1050 Old Pecos Trail, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0a56e714-9334-11ea-a681-14b31f159f22.png",
  "tags": [
   "kids",
   "eat",
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16893744602450873686",
  "source": "GoogleMaps",
  "reviews": [
   "The staff here are the best part about this museum. While I was mostly underwhelmed with the organization and atmosphere, the people who work here are so wonderful to the children. This is not the first place I would recommend people take their kids in Santa Fe, but prices are mostly reasonable and despite my own aversion as an adult, the kiddos seemed to enjoy themselves quite a bit. I'd say it's hit or miss depending on personal preference.",
   "This is a really great place to check out. We were just visiting the area and wanted to take our little man somewhere fun.  He loved it. Got to see a snake eat a dead mouse. He thought that was awesome. Couple birthday parties going on as well,  so clearly that option is available.  Really nice place.",
   "My kids always have a blast here! Water play, bubbles, DIY face painting, toddler area, puppet show and dress up area, etc.... Outdoor garden area, meet the resident corn snake and turtle on the weekends. Snake feeding on Sunday too!",
   "So neat! Such a nice place to take the kids. There is plenty to do. There is a small door for the kids to have their own separate entrance. (by the main door). Inside they have an area for toddlers to play, dress up with a stage, water play area, bubbles, face painting and so much more. Outside they have a small grassy area, \"sand box\" area,  Adobe play house and more! The cost wasnt terrible it was $30 for 2 adults 3 children. They also have memberships as well. We definitely will be going back!",
   "Great place to get the kids tired whilst having a great time... Also camps held during school breaks..."
  ]
 },
 {
  "name": "Randall Davey Audubon Center & Sanctuary",
  "address": "1800 Upper Canyon Rd, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0aa49226-9334-11ea-8e26-14b31f159f22.png",
  "tags": [
   "walk",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=9156694971520906262",
  "source": "GoogleMaps",
  "reviews": [
   "The trail was closed due to fire danger, but I was able to view the garden path and the house.  It was well worth visiting for those aspects alone.  The grounds are well-kept, and the volunteers were very helpful and friendly.  I will definitely make a repeat visit once the fire issue is resolved.",
   "Really beautiful grounds and nice hiking trails that aren't too difficult. Really friendly volunteers staff the center and will do their best to answer your questions.",
   "Beautiful, easy to find, great resource, friendly people!",
   "Perfect spot to observe and photograph birds.  Beautiful garden and a nice hiking trail.  Very friendly and helpful staff.",
   "Great quick little hike. You have to find a spot in the woods and sit still, let the birds come to you. If you walk the whole time you’ll scare most of them off and not see much. For more privacy, real forest, and increased critters, take the side trail."
  ]
 },
 {
  "name": "Wheelwright Museum of the American Indian",
  "address": "704 Camino Lejo, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0af0dd98-9334-11ea-8e7f-14b31f159f22.png",
  "tags": [
   "history",
   "creative",
   "art",
   "history",
   "creative",
   "art",
   "free",
   "art"
  ],
  "link": "https://maps.google.com/?cid=15355057855282985937",
  "source": "GoogleMaps",
  "reviews": [
   "Wow! What a spectacular place! The permanent jewelry collection is just amazing. Take time to read the posters and get a sense of the history, because it makes the exhibit even better. I also really enjoyed the temporary exhibit on Laughter and Resilience. This place was just wonderful.",
   "There was a fun exhibit of art on temporary display that we thoroughly enjoyed.  The creative art and jewelry on permanent display was exceptional and very informative.   The history of native crafts in metal shell was particularly interesting to me.",
   "What a wonderful museum! Small, intimate, feels very personal. Everyone on staff was super friendly, helpful and welcoming.  I really enjoyed the exhibits featuring indigenous New Mexican artists, and watching the videos of the artists discussing their perspectives and creative process. The museum gift shop is a replica of a trading post. I just wish they had a larger selection of museum books.",
   "Great exhibit chronicling evolution of native jewelry. Funny exhibit Humor in Native American art. Worth a visit",
   "A reasonably good museum, but with a focus on contemporary exhibits (overwhelmingly 20th Century) rather than historical exhibits. This was not made clear until we actually paid and entered the museum. I was disappointed since there are 100 art galleries we could have gone to for free to see contemporary Indian art."
  ]
 },
 {
  "name": "Santa Fe Botanical Garden",
  "address": "715 Camino Lejo, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0b34c488-9334-11ea-a2cd-14b31f159f22.png",
  "tags": [
   "free",
   "family",
   "art"
  ],
  "link": "https://maps.google.com/?cid=9242424807881498233",
  "source": "GoogleMaps",
  "reviews": [
   "This was absolutely the coolest place! I was lucky enough to be in the area on their community day, so I got to visit for free. I liked the mixture of relaxing spots to chill, and parts that were (enjoyably) educational. If I’m ever in Santa Fe again, I would love to come back to visit!",
   "A treasure to visit! Beautiful southwest gardens highlighted with local artist sculptures. Glow event was the highlight of our week! Family friendly, community oriented! I'll be back with friends and family!",
   "While smaller than its sister city to the southwest (Abq), the Santa Fe botanical garden holiday light display was amazing. Lower cost, less busy, and inspiring art sculptures within the light displays. A must see!",
   "Pretty, representative desert Flora. A small but good quality place.",
   "Beautiful, inspired, calming. Loved the fascinating way the space was designed!"
  ]
 },
 {
  "name": "Santa Fe Railyard",
  "address": "332 Read St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0b82e4b6-9334-11ea-b7cc-14b31f159f22.png",
  "tags": [
   "brewery",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7651878539082568121",
  "source": "GoogleMaps",
  "reviews": [
   "I had a wonderful time here at the Santa Fe Railyard where I took the train from Santa Fe to Albuquerque and back the next day!!! Great lovely and majestic landscape, the train was very warm and cozy and it has two levels inside. Tables inside to have a quick snack and also very convenient sockets to charge your phones etc. very highly recommended if you are in Santa or Abq! 5 out of 5 stars most definitely!!!",
   "Excellent dining locations including the Second Street Brewery and Tomasita's. Fantastic Farmers Market on Saturdays. There is also an Artist Market on the weekends. Take the NM Rail Runner Express if you're heading up to Santa Fe from Albuquerque. It lets you off right in the heart of the Railyard.",
   "Very cool place. We came in late May for the farmers market and artists market on a Saturday. 10/10 great experience. Tons of local folks selling and shopping. I made off with some freakin great Chile powder and some great fruit.",
   "We walked through the area, stopped at REI, and that was about all there was to do on a gorgeous Saturday afternoon. Went into one shop but were turned away because they were closed (despite the open door and sign out front).\nThere was also a movie theater and restaurants. \nWith all the great reviews, we must have missed something. Maybe there’s more activity in the warmer months?",
   "The spot to jump off the rail runner and enjoy food, beer, arts and culture. Farmers market is a must see!"
  ]
 },
 {
  "name": "New Mexico State Capitol",
  "address": "490 Old Santa Fe Trail, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0bd3eb22-9334-11ea-8ece-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "art",
   "unique",
   "art",
   "walk",
   "walk",
   "tour",
   "art",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=781480427681156017",
  "source": "GoogleMaps",
  "reviews": [
   "We were a party visiting from Puerto Rico and Maryland, and one of the places we wanted to see was the State Capitol.  We are so happy that we took our time to go.  There was a quilt exhibition with the theme blue, and it was simply gorgeous! The building is full of art. The staff was very knowledgeable, helpful and friendly.  Highly recommended.",
   "Not the loveliest building on the outside, unique and round though. It has a nice big rotunda-type center and a very cozy feeling in the 3rd floor hallways and seating areas, which are plentiful. Possibly the best contemporary art works of any (of the 30+) capitol buildings we have visited. I like that it appears tobe functional, almost elegant, and was paid for by a foundation, rather than public funds.",
   "We weren't able to go inside because it was the weekend but the grounds were nice and clean.  Lots of plants, trees, and cool sculptures.  Area felt safe and was easy walk to rest of downtown Santa Fe sites.  Building is cool...not the classic dome Capitol but round, adobe looking building.  Easy visitor parking on east side near visitor center and Mission de Miguel.",
   "Another great find from going on the museum 10am walk (strongly recommend). Would never have thought of coming into building or how interesting it was but tour took us here. So good inside that we stayed behind and looked around the different floors, the rooms and the massive art collection.",
   "As a native New Mexican I'm happy I was finally able to visit the state capital building. The round layout reminds me of a kiva but it is unique for sure. When I visited in November of 2018 the trees along the main entrance had vibrant, beautiful fall colors. This would definitely be a nice place for photographs."
  ]
 },
 {
  "name": "Harrell House Bug Museum",
  "address": "542 N Guadalupe St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0c1d5078-9334-11ea-98b9-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "kids",
   "eat",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=10043828363407920294",
  "source": "GoogleMaps",
  "reviews": [
   "This place is AMAZING! The owner started out with his collection and has been running 8 years strong. You cannot beat the price for any family gatherings in Santa Fe and they have plenty of free parking. This was a great mix of education and fun. Plus the shopping mall is dog friendly if your dog friend is well behaved.",
   "Very cool selection of live insects, reptiles & a few other kinds of animals (including a lungfish & axolotls!!!). Impressive displays of preserved insects & fossils. Loved the names of the different animals, a lot of them were cheesy, but adorable. Gift store had great selection of toys, small fosils, edible bugs, etc.  Inexensive entry fee for the museum. You have the opportunity to touch the safe insects. Entrance to bug museum is inside the Traders market (which also has cool stuff to look around&see).",
   "Way off the beaten path and seriously cool if you want to entertain your kids for a while without going to another tourist location. Don't be afraid! Hold the bugs! Buy some to eat, too.",
   "Best bug museum in the Albuquerque/Santa fe region. It's at a weird location next to Ross but still a respectable exhibit. I was impressed by their pinned insect collection. Their dedication and technique is unbelievable. Even to the tiniest mites. It was also quite enjoyable to see their two axolotls in person, one of them named aptly toothless.",
   "Totally awesome! We are out-of-towners and were somewhat surprised to find that it is located in a shopping mall and didn't really know what to expect going into it. It's unconventional for sure, but the staff are very welcoming and the museum itself is very well done. All bugs and animals appeared to be quite well cared for, and the staff was clearly very knowledgeable about each of their individual needs. We really enjoyed watching feeding time and the fact that the feeding schedule is posted online made it possible for us to be there and get to see it. Staff also let us know upon arrival to \"let them know when we're ready to hold some bugs.\" We did, and we got to hold some very interesting critters! We are childless adults who just happen to enjoy bugs and museums, but this would be a great outing for families with children of all ages. Very much enjoyed our visit."
  ]
 },
 {
  "name": "Palace of the Governors",
  "address": "105 W Palace Ave, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0c6703c0-9334-11ea-a3b9-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "tour",
   "history",
   "family",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=4487154007435568703",
  "source": "GoogleMaps",
  "reviews": [
   "NOTE!! CURRENTLY CLOSED DUE TO RENOVATIONS!  We visited the first weekend in Aug 2019. We were able to see the back side and courtyard and the printing press room by buying admission at the New Mexico History Museum located behind the Palace.  We enjoyed looking at the building outside and especially enjoyed seeing the Native American artisans selling their beautiful jewelry along the walk on the plaza.",
   "Half of the museum is closed right now for renovations. But they still charge full price. There were only really 2 small exhibits. It's worth it if you buy the 30$ culture pass for all the local museums. Nice roof top view",
   "This building is closed for the past 18 months. Once a day tour may happen if enough people sign up for it. There are no artifacts in the building and tours operate through New Mexico History Museum.",
   "My family and I recently made a 4-day visit to Santa Fe, and the Palace of the Governors was one of our planned stops. I wanted to ensure we wouldn't miss it so I emailed the Collections and Education Manager since s/he is listed on the website as being the contact for tours. This person replied in a reasonable amount of time with a list of the hours (apparently cut and pasted from another source). What the person did not mention is that the Palace has been CLOSED FOR A YEAR for renovations! I would think the Palace of the Governors would have so much to offer, but it is very poorly managed (from its 1990s-style web page to its lack of social media presence to its employees who are purveyors of misinformation). I hope the future finds someone more than hapless at the helm to help the institution live up to its potential in 2019 and beyond.",
   "Learn more each\nVisit. Very well done."
  ]
 },
 {
  "name": "Santa Fe Railyard Arts District",
  "address": "544 S Guadalupe St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0cb41298-9334-11ea-a76e-14b31f159f22.png",
  "tags": [
   "family",
   "art",
   "art",
   "brewery"
  ],
  "link": "https://maps.google.com/?cid=319301716441510598",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful! Great Farmers Market and local art. Great treats for the whole family and a wine bar where we tasted 5 wines for $20. Well worth the trip.",
   "Seemed pretty cool but everything was closing up when I got there. Coffee shop there on the corner is good.",
   "Really cool spot. More modern and hip than what you would find in Old Santa Fe. Definitely worth a visit",
   "A nice shopping center. \nPlenty of shops, restaurants, and art galleries.\nThere is a nice brewery in the district.",
   "Cool place. But where we’re all the people on a first Friday evening in the summer?"
  ]
 },
 {
  "name": "Oldest House Museum",
  "address": "215 E De Vargas St #2703, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0cfe1426-9334-11ea-8dc7-14b31f159f22.png",
  "tags": [
   "history",
   "historic",
   "history",
   "free"
  ],
  "link": "https://maps.google.com/?cid=17258210202670510005",
  "source": "GoogleMaps",
  "reviews": [
   "Proclaimed the Oldest House in the US (though I think there are some First People whom would make a good argument against that, and perhaps even some folks from parts of Florida) - but hey, who am I to judge. A couple of rooms remain as a museum, with some artifacts. Nice gift store. Oh, and parking (a plus in Santa Fe)...",
   "Great history and learning! Love finding these gems in different places! Restored very well!",
   "I'm really happy that I stopped by just to say that I've visited the oldest house in the United States. The museum is very small but interesting nonetheless and the employees were very kind and informative. The Oldest House Museum is certainly worth a stop if you find yourself in the area.",
   "Wonderful history in old Sante Fe.  Simply amazing that it still exists.  Very close to multiple other historic and religious sites, not to mention adjacent to the out door dining area of a great pizza place!",
   "It free to vist the person is helpful has a map of Santa fe places"
  ]
 },
 {
  "name": "Cathedral Park",
  "address": "131 Cathedral Pl, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0d404d64-9334-11ea-9591-14b31f159f22.png",
  "tags": [
   "walk",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12365982342435949233",
  "source": "GoogleMaps",
  "reviews": [
   "Peaceful spot. Statue tells the story of 200 years of Spanish colonization in Northern NM.",
   "This is a peaceful place to visit in a very busy area. It is very near the plaza and a good little park. I wish they would turn the fountain back on though. It would make it a lot nicer when it is in the 80's with the green grass.",
   "This cathedral seems to be old, but dont quote me. I came by when the church was close. The fences are open and you can walk around and see plaques full of history and information about Santa Fe. There is a statute dedicated to the first settlers of Santa Fe. Its amazing, ease do read about the history of the City and its inhabitants 300+ years ago.",
   "This fountain is in the Cathedral Park at St. Francis Cathedral in Sante Fe N.M. The church is also beautiful inside.",
   "Sweet park just off the plaza, great place for a intimate wedding. Congratulations Mr. And Mrs. Brown!"
  ]
 },
 {
  "name": "New Mexico History Museum/Palace of the Governors",
  "address": "113 Lincoln Ave, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0d9412dc-9334-11ea-8227-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "unique",
   "history",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8767615153334400359",
  "source": "GoogleMaps",
  "reviews": [
   "A must on your first visit to Santa Fe.  We did not know very much New Mexico State history, and left informed and enlightened.  Our only regret was the Palace of the Governors was closed due to renovations and we were unable to tour that. (Aug 2019)   Follow the timeline for the best experience.  Wonderful displays.  Beautiful gift shop.  Highly recommend!",
   "A good museum with a ton of cool artifacts. The Palace of the Governors was closed for renovations during our visit which was disappointing. Some exhibits could’ve been fleshed out a little more.",
   "Interesting and unique exhibit on nuclear in New Mexico.  Great summary exhibits with artifacts of early NM history.",
   "It is the merging of the old and the new! The New Mexico History Museum and the Palace of the Governors in downtown Santa Fe are now connected. The Palace of the Governors is one of the oldest occupied government buildings in the U.S. and has witnessed four centuries of history. A 96,000 sq.ft. New Mexico History Museum has been added next to it that displays ancient artifacts, modern-day films, different scopes of exhibits.\n\nVisit these two sites and learn about New Mexico’s native people — from the Spanish colonizers to the Mexican settlers.",
   "We visited this museum the weekend after the Forth of July, 2019. In my opinion this museum lives up to many other attractions in Santa Fe, overrated and overpriced.\nWe were charged the regular out of state admission rate, even though the Palace of the Governors was being renovated (meaning we could not view this exhibit). Yes, we were warned prior to being charged for admission. Yes, we were still charged the twelve dollar admission even though the Palace exhibit was closed. WHY?\nThe rest of the museum was nothing special, especially the \"Atomic Age\" exhibit (where photography is prohibited, though I'm not sure why since it's such a poor excuse for a museum exhibit). That being said, the \"permanent\" exhibits DO NOT justify this admission rate.\nI do not recommend this museum to anyone. We will not be back, Palace or not."
  ]
 },
 {
  "name": "Fort Marcy Park",
  "address": "490 Bishops Lodge Rd, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0dd6c176-9334-11ea-b384-14b31f159f22.png",
  "tags": [
   "parks",
   "walking",
   "field",
   "walk",
   "walking",
   "family",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=14867284429983074833",
  "source": "GoogleMaps",
  "reviews": [
   "This is such a great place for a baseball game. Come out and enjoy one. Plus this is where they do zozobra every August!",
   "One of my favorite parks to go chill at. The park is quite big and they have a fitness center and swimming pool there as well as a baseball diamond. They also have an awesome walking trail and beautiful scenery.",
   "I played in the majors baseball little league at this field back in 1980... The \"Seargents\" baseball club... I hit 9 homers in this field... great times.",
   "Giant park with green grass. Perfect park to do a variety of activities such as baseball, frisbee, walking, jogging, running, yoga, tai chi, walk your dog(please pick up your dog's waste!)",
   "At the zozobra and theres alot of ppl! Parking is very hard to find at these events. Theres music and food and lots of protection. Family oriented and the atmosphere is festive. Also thers ppl spinning fire balls and it looks amazing. Theres fireworks at the burning and at the end and it looks amazing also it was a fun night with the family."
  ]
 },
 {
  "name": "Museum of Spanish Colonial Art",
  "address": "750 Camino Lejo, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0e1c0806-9334-11ea-ae7b-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "history",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=17533766177180924187",
  "source": "GoogleMaps",
  "reviews": [
   "This is a bit of a landmark in Santa Fe and definitively a must if you want to become familiar with what’s hot in terms of folk, Spanish and local art in the area. I’ve been here a few times and always enjoy the highly political art in display. It is a nice addition to the art scene here and it provides for a great non-threatening and casual gallery atmosphere.",
   "Love. This. Place.  If you love history, art and the culture of the Southwest check this place out.  It’s a very well done museum in a lovely Adobe home.  There is contemporary art along artifacts from the colony Spanish era.  Amazingly rich trove worth the short trip up from the plaza.",
   "Very unique and interesting place. Not sure it's worth $10 per person, but interesting nonetheless.",
   "Stumbled across this privately owned museum just roaming around.  It's with four other museums at a place called 5 Museum Hill, for those vacationing who would like to get some Culture.\nIt's $10.00 to get inside, and you are allowed to take pictures, unlike some of the other museums. The items are numerous.",
   "A good representation of the area's Spanish culture, both old and new. The modern pieces were particularly poignant."
  ]
 },
 {
  "name": "Mark White Fine Art",
  "address": "409 Canyon Rd, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0e70b7de-9334-11ea-b20a-14b31f159f22.png",
  "tags": [
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=2247989630482821379",
  "source": "GoogleMaps",
  "reviews": [
   "Those Wind Sculptures are very beautiful and colorful. I would like to go there again.",
   "It is hard to miss these wind sculptures along Canyon Drive in Santa Fe. Just love the whimsy and color of this work as well as technical skills.",
   "Super nices fine art (sculptures)...#..1!!!!!",
   "Quality kenetic wind scuptures",
   "I have looked high and low seeking the right metal garden art. Something high quality, sturdy, not cheesy, the right color. When I came across Mark White's handmade (individually made) pieces, I fell in love. These are high quality, true pieces of art. Stunning."
  ]
 },
 {
  "name": "Canyon Road Contemporary Art",
  "address": "622 Canyon Rd, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0ec5b5ec-9334-11ea-b886-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "walk",
   "art",
   "walk",
   "art",
   "walking",
   "wander",
   "art"
  ],
  "link": "https://maps.google.com/?cid=10049248536563960716",
  "source": "GoogleMaps",
  "reviews": [
   "The Art was surprisingly good. Very pleasant and quaint street with exceptional walkability.",
   "Simply Amazing. Tremendous collection thought-provoking and emotion provoking art",
   "Basically none of the amazing art you'll find all along Canyon Rd is in my price range, but it's a nice walk if you enjoy art.  Giving this particular gallery 5 stars because not only did they have great pieces to see, the front desk guy actually made effort to interact with us.  He took the time to ask what we liked and tell us interesting bits about the artists.  Only young man in any gallery that did that; can't remember his name, but this was Monday afternoon, 6/10/19.  Give that boy a raise!",
   "I love walking this road.  Parking is a pain, but once you park, you should walk up and down the road, and check out all the galleries that you can. The art options are varied and truly awesome. You won't get tired of seeing all the great art - and you will surprised by what you find when you visit each of the many beautiful galleries. Make sure you have good walking shoes and an inquisitive attitude.  Go have fun.",
   "Great street to wander around and pop into an art gallery or two. Nice little coffee shop to also enjoy on this street."
  ]
 },
 {
  "name": "Historic Santa Fe Foundation",
  "address": "545 Canyon Rd #2, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0f1ef9e2-9334-11ea-be74-14b31f159f22.png",
  "tags": [
   "historic",
   "art",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=8110885618510922949",
  "source": "GoogleMaps",
  "reviews": [
   "Great exhibit of photographs and photographers. Friendly exuberant staff",
   "Friendly welcome and good information to tourists. The outdoor gardens are a cool respite on a hot summer day.",
   "Walking along Canyon Road to take in the art galleries, it was an unexpected delight to come across this historic home and garden where Mr. Bandolier stayed.",
   "Timeless experiences live here",
   "Pleasant garden along Canyon Road"
  ]
 },
 {
  "name": "SITE Santa Fe",
  "address": "1606 Paseo De Peralta, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0f6a81d4-9334-11ea-971a-14b31f159f22.png",
  "tags": [
   "art",
   "tour",
   "free",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=8296855080371529270",
  "source": "GoogleMaps",
  "reviews": [
   "one o my faves in Railyard vicinity fer contemporary art. coolest building inna de state! werld class yo.",
   "I enjoyed using the audio tour. The staff was helpful and friendly. It was nice to sit and enjoy listening to and watching the exhibits.    I was left wanting more. The show that I saw was small.",
   "Great venue for a celebration!- Catering by Casa Nova",
   "The space is beautiful and the staff is friendly. I really enjoyed the Bel Canto exhibit. It's fun to see video art in a big space with excellent sound! I highly recommend SITE Santa Fe and look forward to returning.\n\nGo early in the day for free admission.",
   "Really fascinating art design here. Every art piece that's here has it's own charm and the place really gets you involved with the culture it portrays throughout the paintings and sculptures. A sight to see 10/10"
  ]
 },
 {
  "name": "Jackalope Mercado at Santa Fe",
  "address": "2820 Cerrillos Rd, Santa Fe, NM 87507, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0fb8f03e-9334-11ea-9866-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11177917880353350765",
  "source": "GoogleMaps",
  "reviews": [
   "Tons of vendors bringing the southwest products from locally here in NM, Mexico, Peru, everywhere. You’ll find pottery, glassware, clothes, greeting cards, rugs, furniture, purses, alpaca blankets, living plants, metal yard art, blown glass, candles, decor, planters, pens, toys, and everything else. It’s all here. Several buildings plus large outdoor area so you can shop quickly or take your time and get more than you can imagine for your home or gifts.",
   "If this place had food I would probably move in here.  I LOVED THIS PLACE, as well as the other places that are also in this location.  It was just short of mind blowing, it was pretty amazing.\n\nThere were so many choices and not just pots but garden art, fresh blown glass items, garden art and a gallery(XANADU)that had everything from furniture to rugs.  Ask Mark to share with you how some of the pieces were made or what they were made out of.  I WOULD recommend this place.",
   "I wish I could take everything home!",
   "This place is amazing! So much to see and do there. I visited with my cousin looking for plants for large pots. Brenda went the extra mile to help us find a similar size pot, reccomend plants and combinations, then mock the plants up in a pot to see what we would have once we got home. Then we were able to keep all the plants together and put them right into the pots! I'm looking forward to the glass blowing classes they offer here!!!",
   "No service AT ALL. Stood in the lobby wasting time for 30 minutes. Girl spent 15 minutes talking about far away places to the customer in front of me then spent 10 minutes on the phone."
  ]
 },
 {
  "name": "Santuario de Guadalupe",
  "address": "100 S Guadalupe St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1001930c-9334-11ea-b267-14b31f159f22.png",
  "tags": [
   "historic",
   "history",
   "history",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=3652249988993553471",
  "source": "GoogleMaps",
  "reviews": [
   "Little known historic church and a must visit. Camilia the volunteer at gift shop gave am excellent overview and history  of the shrine. The altar hangs a beautiful oil canvas painting from 1700's.",
   "Got a privilege to visit and take pictures from the outside of the church where Blessed Statue of Our Lady Of Guadalupe in Santa Fe NM is standing.  The oldest in the USA.",
   "Beautiful church, unfriendly staff. I was sitting to take an interior picture. A staff showed up. Stood there until I took the picture. Then slammed the entrance door behind me and locked it. Visitors welcome???",
   "There are a lot of churches that are supposed to be attractions in Santa Fe but I thought this was one of the best to visit. It's peaceful and clearly well-loved, easily accessible and has some interesting history behind it.",
   "We got there a few minutes after 5pm so all offices were closed, however we were able to walk around and admire beautiful statue.  Hope to come back again soon during normal hours so we could see inside of church"
  ]
 },
 {
  "name": "El Museo Cultural De Santa Fe",
  "address": "555 Camino de la Familia, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/10444198-9334-11ea-988d-14b31f159f22.png",
  "tags": [
   "walk",
   "art"
  ],
  "link": "https://maps.google.com/?cid=983844777204022898",
  "source": "GoogleMaps",
  "reviews": [
   "The flea market on weekends is awesome. Great deals on Jewelry books and lots of other things.",
   "Wondeful place to walk around. Weekends offer more than just the usual shops but vendors as well. Great place to find gifts and spend a saturday.",
   "Great exhibitions and plays. The weekend winter market between Mid Sept - End of May is one of the best venues in Santa Fe. Treasures galore! Visit us at the market!",
   "Got some really great vintage items here!!! The best market like this that I've been to.  Such neat Western and Southwest items, clothes, hats, knives, art, jewelery, furniture, antiques and more",
   "WINTER Home to the NEW SANTA FE FLEA MARKET ON RUFINA .. Easy access in the Rail Yard district across from the Santa Fe Farmers market..."
  ]
 },
 {
  "name": "Ragle Park",
  "address": "2530 W Zia Rd, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/108d31ee-9334-11ea-9032-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "parks",
   "walk",
   "kids",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9036740269936193743",
  "source": "GoogleMaps",
  "reviews": [
   "This is a wonderful Park to visit and we always like to be able to walk down the road it's so close. There's always a lot of activities going on here and there's always a lot of kids having fun. There's also a lot of teenagers that like to go up in smoke on the top of the place that though or sit up there and dry hump each other but hey that's what teenagers do right I was a teenager once. Great Park.  Wonderful grass the prettiest view of the mountains that you could ever see from some of the present places in Santa Fe. You get the chance to come visit the park. PS parks department you should put some swings in at this place.",
   "This park has a great compliment of some really fun things. Tennis courts larger and smaller kida play places baseball fields and a great walking area with some fun sculptures to visit. I highly recommend it for a walk with the dogs or the kids. Also a great space to just sit and have a picnic as some of the lawns peta are not allowed on.",
   "My daughter loved it. Great park for kids. Huge slide.",
   "Great playground. Kids....and wife...enjoyed the slides.",
   "Very cool little park. This part of town is great."
  ]
 },
 {
  "name": "Frenchy's Field/Santa Fe River Trail",
  "address": "Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/10e0a940-9334-11ea-b619-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=18206936457006559374",
  "source": "GoogleMaps",
  "reviews": [
   "The river has had a lot of water this last summer and it is so soothing to go and soak my feet in cold mountain water. My friend brings her dog and sometimes people go off-leash with their dogs, but we have never had a problem. People are considerate here. The labyrinths are beautiful. There is a lot of land here to be enjoyed.",
   "Very cold day out. Not much sign of any druggies, but found a gasoline saturated PINK brand women's hoodie on one of the benches.",
   "Such a fantastic park with so much to offer! Nice playground, work out equipment, and trails. Highly recommended.",
   "A snake on the river trail scared the heck out of me and moved super fast! 🐍",
   "Very beautiful,  easy 6 miles loop to the square in town and back.  Scenery is gorgeous."
  ]
 },
 {
  "name": "IAIA Museum of Contemporary Native Arts (MoCNA)",
  "address": "108 Cathedral Pl, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/111fae0c-9334-11ea-938b-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "wander",
   "art"
  ],
  "link": "https://maps.google.com/?cid=7069102519285260689",
  "source": "GoogleMaps",
  "reviews": [
   "This is a very small museum that is not designed to appeal to everyone. I admit that the exhibits are provocative and they challenge the imagination. However, the exhibits are too few (with only three small galleries) that I went out of the building sorely disappointed. The second floor displays are nonexistent. When I was there, most galleries were off limits to visitors!\n\nIf you are not into contemporary art by native American artists, then most likely, you won’t enjoy this museum.",
   "It was ok, actually to me rather boring. Staff was very friendly. Outside areas were nice but so sparse. Wasn't totally sure we should be out there. Not that much to see, luckily wasn't much to get in with Groupon. Spent 24 mins in here.",
   "Lovely space and celebration of art.",
   "Very small, but great exhibits.",
   "A treasure of contemporary art as well as the continuing cultural legacy of the Native people of this land. It's my first day in SF and feeling overwhelmed by the touristy shops and galleries, I noticed the stunning mural posts and iconic courtyard sculpture and decided to wander in. The second floor gallery had a number of pieces that blew me away. Don't get bedazzled by all the consumption and miss this gem. "
  ]
 },
 {
  "name": "Hyde Memorial State Park",
  "address": "740 Hyde Park Rd, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/11625c8c-9334-11ea-833c-14b31f159f22.png",
  "tags": [
   "parks",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2980628586067048945",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice place to go spend a day to play snow, sledding. Just $5 fee that need for per car and enjoy as much as you want. Had lots of fun!",
   "Stopped by 10,000 waves. Saw the Aspen trees change colors. Met a wonderful group of people at the Lookout, with a gorgeous view of a distant Santa Fe glittering among the yellow, gold and red colors of Autumn. A quick, pleasing drive with many turnouts  for stopping and photographing.",
   "One of my favorite parks.  No water available and only pit privies, hence my lower rating.  My camping experience contrasts sharply from a year ago when the park and national firest were shut down -- a direct result of the many folks who completely disregarded the seriously dangerous fire ban mandate.  Cold and wet conditions have kept the throngs away and the intermittent creeks were flowing nicely.  The falls were flowing and  also a pleasure to visit.  Kudos to Ranger Garcia who runs a tight ship on his watch.",
   "Kids loved playing in the snow, trailer camping with electrical hook up open year round, and $14 a night, and Santa Fe just 25 minutes or so down the mountain.",
   "We thought the proximity to Santa Fe would make this park feel a bit urban but you really are out in the woods in a good way, feeling like you are much farther out. The views are amazing and the campsites are a nice distance apart from each other.  The picnic table shelters are a really great amenity and there are some nice trails."
  ]
 },
 {
  "name": "Ashbaugh Park",
  "address": "1703 Cerrillos Rd, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/11a5f578-9334-11ea-9777-14b31f159f22.png",
  "tags": [
   "free",
   "walk",
   "field",
   "family"
  ],
  "link": "https://maps.google.com/?cid=8679844331199808353",
  "source": "GoogleMaps",
  "reviews": [
   "good park.  free parking and disc golfing.  tees and baskets are not marked so you kind of find your own way.  decent trees, decent disrance for some holes, a tournament with a well marked course would be fun and interesting.  would definetly recommend to friends visiting in the area.",
   "I believe that the park itself is Wonderful and the people that observe the well being of others seems to be well observed with good intentions.\nThe Fire Department that neighbors the park seems to be more interested in what you are doing than what physical training they are supposed to be concerned with at times. It can be disruptive to your well being",
   "A nicely hidden gem in the heart of Santa Fe. Directly off Cerrillos blvd, behind the fire station, near 2nd Street. Mostly quiet for a park if you are there on a weekday, not in the summer. Though there is now an adequate playground for parents and their children. Also an extensive disc golf course (we used to call them frisbee's). A few picnic tables and some barbecue set ups. The bathrooms are closed. Great open field, though filled with holes from gophers and prairie dogs. Many people come here to walk their dogs, just be careful of those egotistical humans who have to let their dogs off the leash! In the Summer, when the grass is higher and the leaves are full on the trees, it is a good place to lay in the shade upon the Earth.",
   "Beautiful city park, right next to the Fire Dept who are always welcoming to the citizens of Santa fe along with tourists to visit the station",
   "This is a rilly family friendly park a good place for a picnic or want a quiet place to go read under a tree"
  ]
 },
 {
  "name": "De Vargas Park",
  "address": "Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/11f2dd3a-9334-11ea-8a89-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=6778254550690748921",
  "source": "GoogleMaps",
  "reviews": [
   "It was fun. Not the most comfortable place for children to play with all the men lingering around, I'm assuming waiting for a job. Also, quite a few homeless people hanging around.",
   "De Vargas Park has some beautiful views of the mountains behind Santa Fe and is worth visiting just to take photos. I rate a 4/5 because although the park has nice vistas the port-a-johns were nasty. Otherwise make a stop if you're in the vicinity.",
   "Great Downtown Skatepark minus the tweakers hanging out at the day labor site.",
   "Nice flowers and park",
   "Cute park following the creek."
  ]
 },
 {
  "name": "Monica Lucero Park",
  "address": "850 Camino Consuelo, Santa Fe, NM 87507, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/123fc4da-9334-11ea-ab16-14b31f159f22.png",
  "tags": [
   "kids",
   "field"
  ],
  "link": "https://maps.google.com/?cid=5896497012448034540",
  "source": "GoogleMaps",
  "reviews": [
   "Nice little park. Better maintained than some in the city.",
   "I love this Park! Lots of grass space for the kids to run, the appliances for children are great and there are good places with shade all day!",
   "Nice, small, quiet, park with swings, money bars and slides for children. Also, there is a large grassy well manicured field behind playground. The children's play area is in a small pit filled with wood chips.",
   "I was there when they were making construction upgrades. I was right down the street from my daughter school. She enjoyed her bday here.",
   "Our babies had a blast playing here! No damaged equipment. Well maintained. Thank you!"
  ]
 },
 {
  "name": "Torreon Park",
  "address": "Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1298e18a-9334-11ea-a66a-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2408618003619775547",
  "source": "GoogleMaps",
  "reviews": [
   "So much better than it used to be! No port-a-potty though, garbage is not cleaned up often enough. Still love it.",
   "Santa Fe nostalgic park. This park goes deep in the barrio",
   "Very nice, couple of walkers, peaceful and green. Lots for the kids several tables and a more the adequate basketball court with shade!!\n Found it to be like a hidden Oasis!!",
   "Great drinks & awesome service",
   "Very nice park! Barrio LA Canada! Lots of special memories I shared here with my familia!"
  ]
 },
 {
  "name": "Ski Santa Fe",
  "address": "1477 NM, NM-475, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/12ea0f18-9334-11ea-8086-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "independent",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4427599964361793682",
  "source": "GoogleMaps",
  "reviews": [
   "Great location, close to town. That being said, if it is a snow day do not drive up without 4 wheel drive or snow chains. You can buy good chains for most cars at Pep Boys in town. Easy to put on and take off. \n\nNow Ski Santa Fe. Good location. Friendly folks. Not a fashion show. The instructors are patient and knowledgeable. Lift tickets are fair.",
   "An outstanding resort. While the decision to close early is reasonable, a price freeze for next season’s prices is insufficient. 109 days of good skiing, plus the 30 days early closing, means that season pass holders lost 21% of our ski days. This should be rectified by a 15% decrease for next season’s passes. This would show good faith and that your responsibility to your customers are satisfied. The amount lost this year to 1, 2 and 3 day passes, will be saved in the reduction of operating costs.",
   "Ski Santa Fe is really good. We did “never ever” package. Very good for beginners. $125 you get lessons by trainer, ski gears, ski ticket. I would highly recommend one to do so. For the best first experience.",
   "We visited Ski Santa Fe around the New Year's holiday. Workers told us the place was very busy, but there was enough room that it didn't feel crowded. We stayed in Santa Fe and drove up a mountain each day of our trip. All wheel drive tires or snow tires are recommended, however we found the road fairly easy to navigate as it was freshly plowed each day before we arrived and also plowed again before we left at the end of the day. The kids learned to ski at this mountain! We signed them up for a couple days of ski school lessons oh, and by the end of it they were completely independent. Mom and Dad spent that time just exploring the mountain. Food was high quality and the lifts we're quick and operational the whole time. We will return in the future!",
   "Always a great beginner to intermediate skiing. What ski area in the US serves delirium at the ski area bar??? That is huge! Great staff and whenever there is good snow it is well worth it!"
  ]
 },
 {
  "name": "Santa Fe Southern Railway",
  "address": "430 W Manhattan Ave A, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/134575b6-9334-11ea-8b10-14b31f159f22.png",
  "tags": [
   "free",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=2708355916806151299",
  "source": "GoogleMaps",
  "reviews": [
   "Santa Fe Railway, this little excursion was more than disappointing. The website was not informative as to the route or what would be seen along it's path or at the turnabout. The round-trip was a four and one half hours to Lamy and back. We began our journey in Santa fe; we had not been informed that the restaurant in Lamy would be closed until we had our tickets and were on our way. The railway had informed us that they were going to get sandwiches. These were bought at World Foods and brought to Lamy and sold to the passengers at a nominal cost of $7 along with a can soda for $2, which by the way were sub par. The L amy stop lasted for what seemed much longer than one hour as there was only a closed restaurant in that one horse and four house town; that was all I noticed from the depot. The cost for two and this includes the parking and one sandwich and two drinks was overpriced at circa $100. My recommendation would be take the commuter to Albuquerque. You would get more out of it unless your idea of fun is to sit and buy drinks from the bar.",
   "This was a nice little day trip, took it on a Sunday with my lady from apx 11-2:30. We enjoyed Walking the different carts and had a nice brunch with fantastic views.  Then a cozy little stop in Lamy for 20mins or so to take some scenic pics or visit the Lamy museum for $2, it was a cool old school bar and showroom from the wild west days.   You can bring credit card or cash for the bar and they offer free bottles of water. ",
   "Por favor podrían informar de los horarios y si se debe hacer reservacion.   Gracias",
   "",
   ""
  ]
 },
 {
  "name": "Bicentennial / Alto Park",
  "address": "1121 Alto St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/138f0208-9334-11ea-b251-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=11159695059176321658",
  "source": "GoogleMaps",
  "reviews": [
   "I've just used the park with my toddlers. It is enclosed and had sun shades and benches. Good variety of playground equipment, easy parking lot access, drinking fountain and a green area to run outside of the playground.",
   "Favourite park in Santa Fe. Beautiful creek to wade in. Pity about the trash.",
   "Love the Senior Center workout machine's🏋️‍♂️And the service for breakfast & lunch services🍎🥬🥦",
   "Fantastic park to walk and jog. The road is great. You walk along by the side of Santa Fe River.",
   "I wish there was more doggie pool days. Our pups loved it!"
  ]
 },
 {
  "name": "Santa Fe Mountain Adventures",
  "address": "711 Don Diego Ct, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/13d35e52-9334-11ea-b568-14b31f159f22.png",
  "tags": [
   "walk",
   "knowledgeable",
   "family",
   "tour",
   "tour",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12597063344726985906",
  "source": "GoogleMaps",
  "reviews": [
   "Expensive, for a family of four but really good off-road tour. We took the Diablo Canyon tour and snow was still on the ground. Breathtaking scenery and chances to get out and walk around. Our driver, Jennifer, was  knowledgeable and pleasant. She definitely knew what she doing!  Overall, great time and memories!",
   "What a great adventure!!! Learned so much from the guide and had a great time offroading and seeing the real Santa Fe!!",
   "Great Outings .. Great Guides .. Incredible Adventures",
   "Took the Diablo Canyon tour with Fritz today.\nWhat an adventure the 4 of us had. Great fun...Great scenery and Great guide.",
   "Took a tour of Pecos National Monument. Our guide, Mark, was knowledgable, discussing the history and ecosystem of this New Mexican gem. Worthwhile."
  ]
 },
 {
  "name": "Herb Martinez Park",
  "address": "914 Camino Carlos Rey, Santa Fe, NM 87507, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/141a2b70-9334-11ea-a798-14b31f159f22.png",
  "tags": [
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=16021990524533755793",
  "source": "GoogleMaps",
  "reviews": [
   "Decent park, some trash but overall pretty alright!",
   "Great place to chill good courts",
   "That's a nice place for kids to play and enjoyable for adults to sit back and relax",
   "Fantastic park and with lots of space to sit down and chill and to play around with my dog and family. Also the basketball courts are great.",
   "It is so good to feel that there's a natural way to heal! This is the place to find it!"
  ]
 },
 {
  "name": "Santa Fe National Forest",
  "address": "Los Alamos, NM 87544, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/14736f46-9334-11ea-96ea-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=16201294690312269484",
  "source": "GoogleMaps",
  "reviews": [
   "Incredible walks, take friends If you’re looking to get away and get a little closer to nature this walk will do you a lot of good! From the second we stepped out of the car until we make that trip on the way back every corner unfolded new wonders of the earth! The mountains incredible the air crisp and clean the views to die for! I enjoyed it so much! You could feel the presence of the earth in every nook and cranny of the poorest! I am so glad someone recommended this walk to me! If you’re looking for a getaway walk those quiet and will bring you closer to nature this is the one for you!",
   "Really cool place to go. Visited in August and camped, was a good spot. Saw a deer, went hiking, saw some aspens. Aspens everywhere though and it is pretty amazing there.",
   "What an amazing place! My wife and I had so much fun hiking through this valley. It was very an awesome place. To try and imagine how they lived here and raised families was very awe inspiring. To see all the evidence in the rock face and environment was very humbling. As we live in this day and age with all life’s distractions and the societal grind and to think of the differences was very sobering. The views from the climb up into a large open mouth cave are very spectacular. We highly recommend visiting this park and going on a hike. I forgot my hat so I got a lot of sun so make sure you’re more prepared than I was....lol😇",
   "What an amazing hike we had here at the Santa Fe National Forest! Beautiful hills and views! Nice trails, little challenging at first. Saw few wild animals like deer and chipmunks and squirrels. Lots of tall Douglas fur pine trees with lots of sap on them. Found fossils by the riverbed!",
   "There are great hikes in this forest. You can easily access them from Santa Fe or north of Pecos. If you snowshoe or cross country ski, then you can enjoy these trails in winter too. I'm mostly a summertime or fall hiker."
  ]
 },
 {
  "name": "KESHi the zuni connection",
  "address": "227 Don Gaspar Ave, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/14bf26fa-9334-11ea-9784-14b31f159f22.png",
  "tags": [
   "history",
   "tour",
   "art",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=16605576009060991443",
  "source": "GoogleMaps",
  "reviews": [
   "Very cool place full of culture and history. The staff are well educated on this culture and history and their passion in spreading it and educating customers is apparent. It felt good to make a purchase that I knew was directly benefiting the artists who made it. Highly recommend!",
   "Beautiful handmade stone carvings by native artists.",
   "If in downtown Santa Fe, this is the place to be. All is welcome. Every piece of artwork is all handmade by the artist and authentic. Keshi is also a one of a kind store with traditional Zuni Pueblo art and fetish carvings of animals, pottery and jewelry.  You'll always be greeted with friendly  faces and beautiful smiles. So if in Santa Fe, stop by and take a tour. And see for yourself as to what I'm talking about.",
   "The BEST! I have loved this place for years. If you want the genuine article from native craftsmen, KESHi is the place!",
   "Oh my what an awesome store. I’ve been a collector of Native American jewelry for over 48 years. I’m ashamed to say that this past weekend was my first visit to this showcase store. Super inventory! Super knowledgeable staff! And they do layaway!!!! My new first stop in Santa Fe for treasures from now on. A+++\nJ. West from Texas"
  ]
 },
 {
  "name": "Andrea Fisher Fine Pottery",
  "address": "100 W San Francisco St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/150557d8-9334-11ea-b9f2-14b31f159f22.png",
  "tags": [
   "unique"
  ],
  "link": "https://maps.google.com/?cid=996367098102616289",
  "source": "GoogleMaps",
  "reviews": [
   "Wide selection of beautiful and collectible Native American and Mexican pottery.  The staff informed me that all pieces and dimensions are on the website so that I can find the right one for each nook and cranny of my home.  They have a back room with some of the finest pottery I have ever seen.",
   "What a wonderful store with such beautiful pieces. Many are out of my price range, however the lovely shop assistant was able to help guide me towards pieces that were in my budget without making me feel judged.  I ended up purchasing a piece that I love!  Would recommend to anyone for their exception service.",
   "We decided to shop here after a recommendation from a local research organization.  While the prices were high, I have to say you get what you pay for. This gallery was honest and a pleasure to deal with. They had documentation of all their pottery’s authenticity and there were a lot of really unique pieces.\n\nBe careful who you buy from in these towns because some of them are selling stuff that is not really hand made, not unique, or way overpriced for what it is.",
   "Andrea Fishers is an Awesome place to shop for Southwest pottery, all the pottery & different types of figurines are from NM Pueblo's.  It's authentic & handmade.",
   "We purchased two pieces of pottery here while on vacation and received amazing service. It was difficult to make a decision because there was so much to choose from! Top notch quality at reasonable prices. They shipped both pieces to our home and they arrived expertly packed and in perfect condition. We will definitely be back when we return to Santa Fe!"
  ]
 },
 {
  "name": "Gerald Peters Gallery",
  "address": "1005 Paseo De Peralta, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1546a70c-9334-11ea-ab9b-14b31f159f22.png",
  "tags": [
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=13396339773838977173",
  "source": "GoogleMaps",
  "reviews": [
   "I would like to live in this gallery but barring that,,  going to the openings brings joy to life",
   "on my short list o galleries inna RailYard that git a visit from me jus' about everytime I'm in FantaSe, always compelling curatorial exhibits",
   "I was very intrigued, by the creativity incased in a human mind.  To express it visually.",
   "Peters projects has innovative and new contemporary Art exhibits! Not to be missed;",
   "If you find yourself in Santa Fe, this is a must see art gallery!!👍"
  ]
 },
 {
  "name": "International Folk Art Market",
  "address": "620 Cerrillos Rd, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/15916ba6-9334-11ea-841a-14b31f159f22.png",
  "tags": [
   "unique",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=10165190047269256037",
  "source": "GoogleMaps",
  "reviews": [
   "The annual INTL Folk Art Market in Santa Fe is not to be missed! IFAM is an incredible organization, and supports artisans from around the world through mentorship, education, and sales opportunities. Their year-round events present us with the opportunity to buy unique handmade products from world class artisans, while learning about their incredibly diverse cultures.",
   "Well thought out program to share riches from around the world while showcasing artisans fine crafts.  I've been multiple times and have enjoyed the experience and have many great pieces at home that tell a story.    It is more than a market, it is a great bonding of community!",
   "Wonderful market filled with handmade crafts from all over the world!",
   "It is colorful and houses folk art from around the world. Spacious and well planned. Programs for the community contribute to the graciousness of this Museum.",
   "World famous... a most amazing Market popular with locals and out-of-staters alike."
  ]
 },
 {
  "name": "Poeh Cultural Center",
  "address": "78 Cities of Gold Rd, Santa Fe, NM 87506, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/15dbbb58-9334-11ea-b461-14b31f159f22.png",
  "tags": [
   "art",
   "walk",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15986399505107445194",
  "source": "GoogleMaps",
  "reviews": [
   "The Poeh Cultural Center was much more elaborate in its presentation than I had expected.  The displays were both informative, and well presented.  The art collection was a nice addition to the historical and cultural aspects of the center.  Taken all-in-all, the Poeh Center is one of the better small or mid-sized museums I have seen in NM.  I plan to visit once the returned pieces from Washington are fully presented.",
   "So awesome beautiful Adobe buildings my favorite and amazing sculptures.",
   "Intimate. Fun exhibit that both children and adults love. Great jewelry & pottery for purchase. Small museum so good for people with mobility issues.",
   "You will be amazed by the inside walk thru an adobe built for displaying the history of the Poeh. Be sure to get the instructional paper b4 you walk thru...for it'll enrich your experience. The shopkeeper, Edward, was very generous with his history and future happenings at this site. Be sure to visit the artist's studio...she is truly gifted.",
   "Wow, we had a lot of fun there, friendly staff, neat exhibits, nice gift shop."
  ]
 },
 {
  "name": "Santa Fe National Cemetery",
  "address": "501 N Guadalupe St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/162806da-9334-11ea-b6e3-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6842174174975341913",
  "source": "GoogleMaps",
  "reviews": [
   "What an incredible sight to see! This cemetery is very impressive. It reminded me of Arlington and it was so beautiful to walk around and read about the people who gave their life to serve our country. This is a beautiful place for any American to feel proud and honored to be surrounded by such an amazing sight. I highly recommend stopping by this location!",
   "Such a beautiful site to see all of the soldiers remembered. You can now search online for the sites of your loved ones so you can search on your smart phone. Came in handy to not have to search there. Though they do have a kiosk that you can use to look up at the entrance. People are always helpful.",
   "They still stand at attention. Others have laid down their arms. The Santa Fe National Cemetery is an honor. There is a lot to be said about the men and women who gave their lives in the service of the United States to protect you and to protect me. The Santa Fe National Cemetery is a respectful, well-kept reminder of the many Americans who invested their lives in their country.",
   "Honoring our fallen Heroes",
   "Very nice cemetary. They take great care in honoring our loved ones."
  ]
 },
 {
  "name": "Pecos National Historical Park",
  "address": "1 NM-63, Pecos, NM 87552, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1681bfc0-9334-11ea-8194-14b31f159f22.png",
  "tags": [
   "walk",
   "learn",
   "hike",
   "walk",
   "walking",
   "family",
   "history",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=17800158308841182282",
  "source": "GoogleMaps",
  "reviews": [
   "Easy one hiking loop less than 2 miles. Make sure that you get a map of the grounds that gives info in all the parts of the park, if you don’t you’ll come to a section with a number but you don’t know anything about it. \n\nIf you have a NPs passport you can get around 6 stamps at this park. \n\nTry the Civil War Battlefield home for another 2.25 mile hike, walk through the battlefield which is deep in beautiful vegetation and very peaceful. There are information boards along the hike where you learn about the battles.",
   "If you are looking for something to do in Pecos this is a great place to check out! There is a museum with a historical film and a path that takes you throughout the old pueblo (Great for walking dogs too). You can climb into restored Native American kiva's and walk through the old restored Spanish church. A really nice trip that will take you an hour to two hours to get through from start to finish.",
   "This is the second time I've been here. I recommend this place, it's very easy to find, close to the interstate and there's a lot of history there. I took my family there yesterday 17 March 2020, it was open except for the gift shop, so no souvenirs, but it's ok, it's still worth it.",
   "Nice short easy trail to the ruins, with several seating stops for those that just want to pass the time. The smell of juniper is quite nice. Otherwise, not a lot to keep you occupied for more than a couple of hours even if you read all the exhibits which are nice.",
   "Somewhat of a short and easy hike near the visitor center but it has nice scenery.  We enjoyed looking at the ruins from the old church as well as the other archeological ruins.    The views in the snow give this more excitement in my opinion.  Not many people when we visited in January."
  ]
 },
 {
  "name": "Aspen Vista Picnic Ground",
  "address": "Hyde Park Rd, Santa Fe, NM 87506, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/16dd74cc-9334-11ea-b04d-14b31f159f22.png",
  "tags": [
   "hike",
   "family",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=16456004943713126523",
  "source": "GoogleMaps",
  "reviews": [
   "If you want a dramatic aspen show this is the best place to get it. We enjoyed the hike up to the ski area very much.",
   "I love coming up here year-round. The sights are indescribable. During the winter, everything is blanketed in snow, everything is quiet, and there is plenty of room to explore. During the spring, the birds are chirping and the picnic area is perfect to sit down with a few friends or family to share a meal. Not only that, but the drive isn't that far from Santa Fe.",
   "Beautiful and easy hike on an old logging road through groves of Aspen trees. It’s is lovely anytime of year but Sept-Oct is breathtaking. I’ve been in March as well with snow on the ground and the experience and views are just as good to me. It’s popular so you will pass several people and dogs. Great for families!",
   "At the top of the trail where the road Forks there is a path to the right that leads to a mysterious series of teepees. I wonder what they're there for what they symbolize who built them?",
   "Came up to see the Aspens in Fall colors. It was the first weekend in October and the colors were Great. I think everyone else had the same idea as it was very crowded.  Parking was kind of a free-for-all with some places being marked and others just being open space. That being said the other driver seem quite courteous in the area, not like some places I've been."
  ]
 },
 {
  "name": "Georgia O'Keeffe Museum Annex",
  "address": "123 Grant Ave, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/174c3c9c-9334-11ea-b17f-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=9615726331659273445",
  "source": "GoogleMaps",
  "reviews": [
   "Me and my daughter had a great time and she can't wait to come back next year",
   "Great place! The people here are all amazing!",
   "Great place to support the museum endeavors!",
   "Beautiful display of works and very informative",
   "Always awsom."
  ]
 },
 {
  "name": "Bandelier National Monument",
  "address": "15 Entrance Rd, Los Alamos, NM 87544, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/179a0e5e-9334-11ea-be60-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "walk",
   "history",
   "walking",
   "adventurous",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2217692914669619645",
  "source": "GoogleMaps",
  "reviews": [
   "If you are afraid of heights or can't traverse wooden ladders, I would hesitate to recommend Bandelier. It's kinda far out of the way and the appeal is completely centered on the cliff houses. \n\nThat said, there are three small spaces carved into the cliff, which you can access on the main loop trail by climbing up a short wooden ladder. Another mile round-trip off the loop is the alcove trail, which is 140 feet of wooden ladders leading up into a big open space with some ruins. It's cool but definitely nerve-wracking to climb back down.",
   "This place is awesome!!! And there are Native Americans who are there and show you native dances, they are so friendly. What a beautiful way to learn about the culture and history of the land! Definitely worth going to if your in New Mexico",
   "Beautiful trails! We hiked the Falls trail and the Main trail. Its $25 to enter but your pass is good for a whole week. I wish we had booked a closer hotel to the Monument. We had a 2hr drive from Albuquerque",
   "Going in mid December seems to be the best time.  Practically had the place to ourselves.  Did the entire loop walk with no problem.  It's just amazing that people lived here and it's as well preserved as it is.  If you like history and walking this is a must see.  Very happy you can climb the ladders and view the dwellings from the inside.",
   "At $25 for a vehicle, one might think the entrance fee for here is a bit steep. While that was my initial impression, I ultimately came away feeling it was worthwhile. \n\nDriving further into the park, you'll see a turn-off for some camping, as well as a viewpoint a little further on that offers a beautiful view of the canyon that you'll later drive down into and explore. \n\nJust pass the visitor centre is where you'll find different trails and walks you can take through the area. At the Visitors' Centre, you'll find some exhibits that talk about the history of the area and provide some context to some of the different sites you'll come across as you explore further. \n\nIf you don't want to spend too long here, the Main Loop is where you'll want to head. This will take you up to the side of the cliffs and give you the opportunity to actually climb up into the dwellings that the Native peoples of this area had made into the rock. They're very interesting to see, and you'll simultaneously be made privy to some more gorgeous views of the surrounding scenery as you make your way higher. \n\nIf you're feeling a bit more adventurous, I'd recommend you continue on past the Main loop to the Alcove House, a cave dwelling that you can reach by climbing up a series of ladders that take you up about 140 feet. The ladders are very sturdy and safe, but proceed at your own caution, particularly if you're not fond of heights. Remember - you have to make your way back down, too! \n\nOn busy days, the different ladder areas can get a bit congested with visitors, so be prepared to wait a bit. \n\nReally glad I stopped by here, and I'd recommend others to do the same"
  ]
 },
 {
  "name": "Santuario de Chimayo",
  "address": "15 Santuario Dr, Chimayo, NM 87522, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/17eac6a4-9334-11ea-91c1-14b31f159f22.png",
  "tags": [
   "unique",
   "historic",
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=5423102514952409892",
  "source": "GoogleMaps",
  "reviews": [
   "I have to say to everyone going to NM-333, I greatly urge you to stop here. It’s a place I needed to find. I lost my forty year old daughter two and a half years ago. My spirit was seeking to find her, my beautiful daughter who was gone to soon and under suspicion, as she had a very nice future that she was looking forward to. \nI give Chimayo credit for being the spiritual oasis I needed to find. The walkway is lined with so many crucifixes that were all along the fence. Large ones people carried a long way. Necklaces and notes. I even saw a pregnancy test on the fence. Probably for the loss of somebody else child. I felt reverent, peaceful, hopeful, and glad to have found such a special place to pray. \nI found what looked like an outdoor fireplace up the slop and it was lit to match the sunset. It was a perfect place to light a candle and pray. \nI then scattered some of her ashes at this magical healing place. \nThe chapel here has a pit in which the healing sand that comes up on its own and although people can take some healing sand home to use whenever you’re ready to do so and Even though we all take a container of sand it continues  replenishing itself. As if there is a never ending supply coming up from the earth’s wealth and deity. It’s spirituality rich and in my heart is only explained as a gift from God. I’m lighter in my grief now. I will never not miss my daughter and her love for me is as endless as the sand. Every building is in there for a reason. I’m going to return in the summer time and revisit this amazing place. It’s alive, it’s magical, it’s a spiritual miracle, and it is a very special place to see. I believe that if you go, you’ll never forget this experience.\nI know I never will. \n\nThis place is between Albuquerque and Santa Fe. America’s Highway route 66. And if you’re as lucky as I was that day, you’ll be able yo hear the song on the road. I think it’s on route 40 where you’ll find the musical highway. Roll down your windows and drive close or on the white line to hear it. Your speed should not exceed 45 mph in order to hear it. We went over it several times before I heard it. My friend drove several more times hoping to hear what I heard. She was Not as lucky that day, and We had a wonderful outing. \nI even checked Off one of the places on my bucket list. The Hall off Governor in Santa Fe.",
   "This place has changed A LOT since last visiting in 2008, what with all the new additions and parking lot they made to the church. However, what really counts is that they still have the church in which many people still visit to this day. I'm grateful it still has that environment that gives it's positive pull for people to come by and visit.",
   "An historic and unique sacred place. It has a rich and unusual history. Do you have plenty of time to visit the children's sanctuary as well as the main sanctuary and also spend some time exploring the grounds.",
   "I was a bit disappointed by the commercialism of the site. For people who are Catholic, I think it could be a significant place to visit. Was wonderful to see the restored old chapel and the beauty of the surroundings. The geography of the area both north and south is very beautiful.",
   "We love to come to Chimayo and the Santuario. It is such a peaceful place and ideal spot to unwind from the world. Both priests we met this weekend were wonderful and were just what we needed. Thank you both for blessing us and the coming addition to our family. We will be back!"
  ]
 },
 {
  "name": "Chamisa Trailhead",
  "address": "Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1837874a-9334-11ea-8912-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=18229326901776536568",
  "source": "GoogleMaps",
  "reviews": [
   "Loved the trail! Ended up going to the Windsor trail as well which is closer to the creek! Found cool fossils there !",
   "Very few people on this beautiful wooded hike. Nice views. I’m from the Midwest and used this hike to get my body used to the elevation in preparation for a week of hiking. To me, the climb was a good challenge and did the trick. I spent about three hours on the trail. Though I was looped a few times by the locals. It’s close proximity to Ten Thousand Waves Spa made for a great hike with a soak reward after.",
   "One of my favorites.  Several trail options in one place.  Don't be distressed by the early elevation gain.  It gets much more gradual after that.",
   "Great hike. Check maps and bring water",
   "Great hike with good views."
  ]
 },
 {
  "name": "Geronimo",
  "address": "724 Canyon Rd, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/188fb9ae-9334-11ea-a0ca-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=3343501238274771741",
  "source": "GoogleMaps",
  "reviews": [
   "Fun cocktails to start. Main dishes were well executed and flavorful. My venison was perfect. My daughters lamb was tender and lovely. Really nice service and atmosphere. Wine list could have had more old world options.",
   "We went during restaurant week. It was packed. High end, great quality food. The service was impeccable.",
   "Lovely atmosphere for dinner. The waitstaff was awesome! A special thank you to them for sitting us at a beautiful spot to celebrate. We enjoyed the crab cakes for an appetizer, I had the scallops, and my husband had the elk. This is definitely a beautiful place to have dinner in Santa Fe.",
   "Great evening to celebrate a special birthday. The restaurant and staff was very accommodating and helped to make our dinner an unforgettable experience.  The Elk Tenderloin and Fiery Sweet Chile Prawns (similar to shrimp) are shown. I also recommend the Wasabi Caesar Salad - Croutons were incredible!",
   "We've been here for special occasions, anniversaries,  mother's day , etc. It remains our favorite for a superb menu, attentive service and unique ambiance. Dining in the front patio at night was a great experience.  Outdoor heaters made it very comfortable.  Our entrees includes elk tenderloins and prawns which we shared since the were so delicious.  The patrons sitting next to us where also celebrating an anniversary so we had great time sharing stories and why we love Geronimo.  Will be back again soon!"
  ]
 },
 {
  "name": "The Pantry",
  "address": "1820 Cerrillos Rd, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/18d156be-9334-11ea-afc7-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15143247624038872762",
  "source": "GoogleMaps",
  "reviews": [
   "We ordered take out and it was so fast we had to have them wait to make it. Pick up was fast and efficient. Everyone enjoyed their meal from the chicken wrap, chicken fried steak with red chili, and the frito pie. Grab some cinnamon rolls while you are there and reheat then the next morning. I’m sure they are better fresh but they were still delicious the next day and we are glad we got them.",
   "BEST BREAKFAST TACOS I'VE HAD!!! After spending two summers in NM, I have had my fair share of breakfast tacos. I believe NM has the best breakfast tacos of any state, and I am from Texas so that's saying something. I stopped here on my way back to Texas one morning and tried their chorizo breakfast taco. By far the best I've had! My friend got his with bacon and it was also amazing.",
   "What a gem! I tried the chicken fried steak, NM style with red and green sauce. It was awesome! The fresh veggies were perfectly cooked, the mashed potatoes were perfect also. Our waiter Tyler, was attentive, knowledgeable about how the food is prepared and made and what ingredients were in each dish. \nI'll absolutely be back!",
   "I wish I could give this place more then 5 stars. Walked into busy restaurant, packed full of people and staff running about, good sign in my books. Everyone was friendly from manager that greeted us as we came in to the waiters and bus staff. Ordered Pantry Club w/ house-made chips... omfg amazing. So good and beats any club combo I've had back in California.",
   "Even the customers were in a good mood at this cozy restaurant in Santa Fe. Our very nice waiter, Brandon, was quick to see to our needs. The Mexican food was tasty and was ample for the hungriest in our party. Our only unfulfilled wish (that is still most places) is the lack of vegan and/or vegetarian options, other than salads and a few sides.. though a surprise in Santa Fe. The salad, by the way, was generous and fresh. We will definitely be back."
  ]
 },
 {
  "name": "Paper Dosa",
  "address": "551 W Cordova Rd, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/19193558-9334-11ea-8686-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "unique",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16204348858377444644",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best Indian food places I have had the pleasure of enjoying.  Since we were stuck indoors for the evening, i did a food run and am happy I chose to call Paper Dosa for a take-out order.  When I walked inside, there was a line down the hallway at the entrance of eager patrons awaiting their tables while inside was a beautifully decorated dining room with dozens of happy guests filling the tables.  The staff was incredibly friendly and helpful to myself as well as each person that approached.  We ordered several dishes and each one was packed with flavor and chunks of amazingly delicious fresh ingredients.",
   "The best service I've ever had in my life! I always run out of water at restaurants and have to wait quotes while to get a refill. NOT HERE! I never got below half empty. The server support staff was so attentive at all times!\n\nBut the wonderful experience didn't stop with service. They had a terrific atmosphere, easily readable and unique menu, and we're cleanly.\n\nLast but not least, the food was stupendous! And it came out platted so beautifully. I will come back here every time I am in town!",
   "Very nice restaurant, really delicious food for a reasonable price, considering its popularity and quality. A nice date spot. But, it was very crowded...the only thing I would change is less tables for that space. I would definitely recommend!",
   "We’re vegetarian and we always look for a good vegetarian food places. This is a fusion Indian restaurant, loved the food, ambience is quite amazing. We sat in the patio. Service is good. Would highly recommend this place to go if you’re visiting Santa Fe. If you like indian food then do visit this place you’ll find great food here.",
   "There's a reason why there's a line out the door at this excellent South Indian restaurant. Come early and enjoy a remarkable selection of Dosas and Curry dishes in a modern space. Good service and HUGE portions make this a real value winner. Several dishes also incorporate New Mexico chilies for heat, which is a clever touch."
  ]
 },
 {
  "name": "Cafe Pasqual's",
  "address": "121 Don Gaspar Ave, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/195bbcc0-9334-11ea-adb9-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "unique",
   "delicious",
   "art",
   "tasting",
   "eat",
   "delicious",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7025910105218768594",
  "source": "GoogleMaps",
  "reviews": [
   "After La Plazuela At La Fonda was to busy to accommodate us, we went to what we thought our plan b was for the evening. As it turned out, we couldn't have been more fortunate. Cafe Pasqual's offered a warm (also quite literally) atmosphere with a great service. Our all vegetarian food tasted absolutely delicious and didn't leave anything to ask for. Although on the pricier end of the spectrum, I cannot recommend this place enough. However, if you definitely want to get a table, it's a good idea to call ahead and reserve.",
   "Great place for breakfast. Just a short wait to be seated, although it was very busy.  There are enough vegetarian and vegan options to choose from. There are some unique offerings such as corn pancakes and waffles which were pretty good.  Definitely highly recommended and would happily go back.",
   "Wow wow wow‼️‼️‼️ The art and decor fantastic. But the breakfast was the best ever over the top delicious. I could eat at this place every day. The best tasting New Mexican cuisine ever ever!!!  Open a location  here in Florida.",
   "Delicious food and amazing service. We had a party of six during a very busy night and the waiter was great. Part of the party was late, but even when they showed up late, the staff still got us a great spot and it was a great experience all around.",
   "Really yummy food. Their trout salad is incredible. I wish some of their dishes had more vegetables with them.... chicken enchiladas, for example—I don’t need to eat that much chicken without some vegetable accompaniment. They are also quite busy; it can be hard to get a table there so go early. Cute venue."
  ]
 },
 {
  "name": "Amaya at Hotel Santa Fe, The Hacienda & Spa",
  "address": "1501 Paseo De Peralta, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/19a3833a-9334-11ea-9a59-14b31f159f22.png",
  "tags": [
   "food",
   "free",
   "delicious",
   "art",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10078482494762049042",
  "source": "GoogleMaps",
  "reviews": [
   "The restaurant walls were open so it was like eating outdoors. Nice water feature covered traffic noise. Menu has some interesting dishes not found elsewhere. Tasty, eye catching food. Lovely staff.",
   "Beautiful hotel with a great lounge and fireplace. Our room was comfortable and warm despite freezing temperatures outside. Handicap parking is easily accessible as is the elevator for disabled guests. There is a free shuttle which takes you to and from the downtown area. \nWe used the hot tub while there which was comfortable even with snow all around. There is also a good gym with ample equipment.",
   "We are Santa Fe locals.  Every year before Christmas we visit our favorite Santa Fe restaurants to get in the spirit.  This year - 2019 - we went to four restaurants for lunch.  Amaya was the clear winner.  Others were pretty and the food was fine, but today's experience at Amaya was memorable and here's why.  We got a parking place right outside (and didn't have to pay parking plus valet).  The decor was stunning and we were greeted with a beautiful roaring fire.  The waiter, Mario, almost whispered to me, \"We have butternut squash soup!\"  I took his advice and ordered a cup with half the club sand.  Campanion had ribs and fries.  The way things were plated was a work of art. Meal was delicious. The $50 (including tip) lunch was a great investment.  We will remember how we shared this lovely lunch for years.  And we will be putting Amaya on our regular rotation.  Thanks, everyone, seen and behind the scenes, for making such quality your priority! Merry Christmas to all!",
   "What a delightful restaurant hidden in a hotel! Literally some of the best food in a lovely atmosphere with exceptional service in Santa Fe. I had a Watermelon Tomato Gazpacho, a Spinach Strawberry Salad with Fried Artichoke Hearts and Grilled Shrimp as well as an Almond Pear Tart with Vanilla Ice Cream. Everything was presented beautifully and tasted wonderful! I can't wait to go back and try other items on the menu. Thank you for creating such an incredible establishment.",
   "I have never stayed at the hotel but love the restaurant!  Excellent New Mexican breakfast options and fine food all day long.  The highlight, though, is the venue which is elegant and relaxing with an excellent staff."
  ]
 },
 {
  "name": "Dolina Bakery & Cafe",
  "address": "402 N Guadalupe St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/19f2b510-9334-11ea-b449-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4001483312687419068",
  "source": "GoogleMaps",
  "reviews": [
   "Oh what a discovery in New Mexico! We came for a breakfast. Their menu wouldn't do shame to a fancy French bistro, and prices are reasonable for the quality you get. Keep in mind they're only open for breakfast and lunch. We had avocado toast,  waffle and pesto omelet. Everything tasted very good. From the bakery we ordered apple - walnut strudel,  cheese filled cookie, Mexican almond cookie and almond croissant (which was supposed to be chocolate one, but still tasted good regardless the mixup). Juice tasted really fresh,  coffee was very good for this part of the US. Service was excellent!  Highly recommended.",
   "**TLDR; Would recommend**\n\nThis tiny little spot is oh so charming.\nI made the grave mistake of getting pancakes though. That's not to say they were bad, indeed, quite the opposite. The pancakes were delicious, but as soon as the quiche was delivered to the couple 2 tables down, I realized my mistake. \nAt a place like this, with an eclectic, yet on-theme menu, one ought not get pancakes. \nAdventure!\nGet the breakfast soup! Or the quiche! Something not quite so common as the humble pancake.\nMy blunder aside, the food was uncommonly good, the service attentive, ambiance cute and dainty,  and the bakery prime.",
   "I love love love this place. The food is exceptional,  as is the service.  They sell fabulous cookies and pies. When waiting in line as one does, they will give you a cuppa coffee. A real treasure. Enjoy.",
   "New to Santa Fe or just visiting, I strongly recommend trying this local cuisine. Skip the chains! Great food from both Europe and the America's. Breakfast here is an absolute most try. Everything from freshly squeezed juices to an ample assortment of fine coffees. Kudos, respect and gratitude to the owners here. Nicely done. 👍",
   "Food was great! Lemon cream tart was amazing! We did have to wait 40 min cause they were so busy when the hostess told us the wait was only 15 but service was wonderfully sweet."
  ]
 },
 {
  "name": "Jambo Cafe",
  "address": "2010 Cerrillos Rd #2010, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1a3a939e-9334-11ea-af4c-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8995221660913323315",
  "source": "GoogleMaps",
  "reviews": [
   "Pan-African.  Good food, friendly staff, reasonably priced. I had the Moroccan stew - delicious, spicy, sweet.  And the pecan rum pie for dessert.  Enjoy!",
   "Not New Mexican cuisine. And that's why visitors and locals jam to Jambo Cafe. Tasty with sweet scents and fatty sauces that make your mouth water, the menu is simple and varied. Excellent staff with boisterous birthday greeting beats belted out so all can hear. About $100 for three people.",
   "Good food but the service quality and style really stands out. Excellent service.\n\nJerk chicken was decent and wasn't spicy. Accompanying rice and beans was delicious. \n\nVegetarian sandwich was good.\n\n4 stars because the place is too commercial,  like  charging an extra dollar  for small dollop of sauce and hot water.",
   "The best way to sum this restaurant up is: WOW! Amazing food and service! My dad and brother always come here when they head out West!",
   "A must go. First time having African food, such a great meal. The hummus plate was delicious. The goat stew and chicken curry were awesome too. Great atmosphere, very nice staff."
  ]
 },
 {
  "name": "El Callejón",
  "address": "208 Galisteo St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1a809d68-9334-11ea-a464-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "food",
   "food",
   "kids",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10419464381546857691",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful little restaurant with excellent food! They are known for their tacos but the also have sandwiches and burgers. They also have multiple vegetarian options. I would definitely recommend giving it a try.",
   "Excellent service.  Unique and tasty take on cheese enchiladas.  The only part of our experience that was less than optimal was that they charged $4.95 for chips.  I have never been charged for chips in 50+ years of comparable quality cuisine.",
   "Service was great, not busy when we were there. Flavors were good, tasty salsa. Disappointed in the size of tacos. Why make me choose between rice and beans? Just give me both, they cost you pennies. Not full after eating. Tortillas were soggy, would be better crisped up on the grill. Overpriced for food received.",
   "Fantastic spot and my wife and I really loved it. The staff were super helpful, the food was incredible, and the prices were actually pretty reasonable at the end of the day. You wouldn't catch this spot normally without a little exploring but it was well worth the search.",
   "The food was really good, nice atmosphere, the menu had lots of good choices for a family of 5 with kids ranging from ages 8-15. The staff was very friendly and helpful. They lost a star because it took a very long time to get our food and there was no explanation or apology while we waited. The manager did stop at our table (again, very friendly) and asked how we found them, and I told her Google!🙂 They were close by and one of the only places open on Sunday. She asked for a review and I was honest about the frustration with the wait.  She was particularly interested and thanked me sincerely for my honest thoughts, and convinced me that she was going to use that info to improve. I would totally take our family back!"
  ]
 },
 {
  "name": "La Plazuela At La Fonda",
  "address": "100 E San Francisco St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1ac806f0-9334-11ea-9804-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "free",
   "drink",
   "wander",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13548913337199010831",
  "source": "GoogleMaps",
  "reviews": [
   "The wait was long but worth it. Angel provided us with excellent service. I had the duck and my daughter had the sirloin and they were both perfect. The sauce, the spinach, the fingerling potatoes, there was absolutely nothing about this meal to complain about. The smallest details, down to the bread and butter, were all thoughtful and wonderful. If I could live at La Plazuela, I'd be happy forever.",
   "Great Mexican style food.  Portions are big but even still,  slightly over priced. Friendly staff and quick service.",
   "Third visit and they all have been three star experiences.  I want to like this place, the idea is there but the execution is not.  Positives; Clean, well decorated, friendly service, well manicured staff.  Negatives; slow greet time to the table, no selling or suggestions, but the number one issue this is the food is always, and I mean always, lukewarm.  Every time one dish has been under or overcooked.  This has been the same case with every visit; February 2019, November 2019 and January 2020, all dinner service.  This place can be great with someone driving the bus.",
   "Beautiful setting in the center of Santa Fe, offers shopping, dining and accommodation in a fabulous building. The restaurant has a good choice of dishes, with vegetarian and gluten free options, homemade ice tea, good wines and great meats. The staff is friendly and courteous. Honest prices for a place that is both casual and elegant at the same time. Wonderful experience in a historical building. Definitely recommended.",
   "We visit lots of restaurants and La Plazuela has always been a favorite for the Christmas decor.  Just ate there again on Tuesday.  The restaurant seems nice enough with beautiful real poinsettias around the fountain, but then you start to notice how the restaurant is crowded, loud, and expensive for small portions. So go there and wander around the hotel, have a drink in the bar, enjoy the band if there is one, check out the bar menu, or check out the pastry shop, before you decide you absolutely have to eat in the restaurant.   Ambiance - 4 stars, service - 4 stars, food - 3.5 stars, parking - 2 stars.  IMHO"
  ]
 },
 {
  "name": "The Compound Restaurant",
  "address": "653 Canyon Rd A, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1b1e657a-9334-11ea-b2a6-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "food",
   "walk",
   "food",
   "walking",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6048929226297519878",
  "source": "GoogleMaps",
  "reviews": [
   "We went during restaurant week. It was packed. I was impressed by their service. Right on time, refills, knowledgeable.. really enjoyed the overall experience. Food was delicious. The recommended wine paired with the main dish was really good too.",
   "Always a five star experience. I cannot recommend the Compound Burger enough! And they are quite good with food allergies. It's a peaceful, quiet setting and an easy walk from most parts of Santa Fe. The patio is so beautiful, and the stacked salad is a must try. Their mixologists are highly skilled - I've added a picture of the strawberry smash - a delight - strawberry, cucumber and mint. Perfect for a summer day after walking Canyon Road.",
   "I visit my sister in Santa Fe at least four times a year. After she picks me up at the airport we head right to The Compound for dinner. There are usually two or three of her friends that find this a time to make the pilgrimage up Canyon Road to join in. I only order The Compound’s green chili cheeseburger, ordered cooked medium rare (typically arriving somewhere between a decent medium to a Pittsburgh Blue) with onion rings meets my discerning expectations. Accompanying the burger with a nice bottle of red or a couple gin martinis results in the perfect welcome to Santa Fe dinner. (Remember, I’m not driving!) I always get a chance to taste the other dinners. Based on that, the other menu items taste very good to me. The two bartenders are great. When eating in the dining area, the wait staff has been attentive, patient and efficient with our garrulous group. The Compound is well worth the price of admission. To me, it has never rated less than 4 Stars on any of my visits over the past 5 years.",
   "Reserved the special prixfixe Christmas Eve dinner. While this is fine dining the time in between courses was very long, especially long for a late late night reservation. The food was good - we had a steak and twin lobster tails over pasta - but not exceptionally so for what we were expecting. Atmosphere was energetic and cozy however, with the low ceilings it felt slightly crowded and almost claustrophobic. We had several better meals in Santa Fe during our stay and for the money found many better experiences as well. I would say overall The Compound was okay, maybe we had a busy night which wasn't representative of the normal experience but I don't feel the need to return or highly recommend.",
   "Absolutely wonderful food with high quality ingredients. Fresh and delicious. I hope I can return to Sante Fe so I can eat here."
  ]
 },
 {
  "name": "El Mesón Restaurant and Tapas Bar",
  "address": "213 Washington Ave, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1b60ebf4-9334-11ea-af34-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "music"
  ],
  "link": "https://maps.google.com/?cid=16215960353479381790",
  "source": "GoogleMaps",
  "reviews": [
   "I had dinner here with a few friends on a weekday night. It was very quiet and the dining room is lovely. The food was outstanding and our waiter was excellent. The prices are a little high considering they’re small plates, but the quality is definitely there. The only thing I would change is that every staff member we encountered addressed us as “guys.”\n\n “How are you guys doing ?” “Would you guys like anything else?” “What do you think guys, would you like dessert?“\n\nThe atmosphere, the food, and the quality presented us with high expectations. Being addressed as “guys“ when you’re in your 80s feels disrespectful. I am sure that this is habitual, as there are lots of people that use this type of term to address others. However, given that this is a fine dining establishment, my suggestion would be to address this and try to drop the use of this type of casual slang.",
   "Insanely good food! Hot food hot, cheese chilled, sangria on ice! Amazing experience for us while visiting Santa Fe. Julián was our waiter and really made the night extra special for us. EAR HERE! You won't regret it.",
   "The atmosphere is nice, with a dedicated bar room separate from the dining area. The food was excellent as well as the wine selection. Highly recommended if your in the area.",
   "Best Spanish tapas!!! The waiter was very helpful and provided a suggestion. The meals came out quickly and were delicious. Its really enjoyable that they host live music while your dinning. Definitely worth it to make a reservation online for a nice date night.",
   "Great vibe for the local casual spot with really good tapas, especially considering its price and services. So much fun with the Jazz band too!"
  ]
 },
 {
  "name": "Restaurant Martin",
  "address": "526 Galisteo St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1ba6cf00-9334-11ea-b668-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "creative",
   "delicious",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=15737601505033020809",
  "source": "GoogleMaps",
  "reviews": [
   "Incredible restaurant!  We went here for my wife's birthday.  The hostess and waiter both made a point to wish her happy birthday.  I had the chef's special and my wife had the steak menu item.  Phenomenal meal.  I also highly recommend the polenta.  Literally, one of the best meals I've every eaten.",
   "In a city filled with fabulous fine dining choices, Restaurant Martin stands out. The food was so memorable; the parking left a lot to be desired and execution of service was extremely lagging. That said, if Geronimo or Compound doesn’t have seats, this is a great option.",
   "Delicious food. Great savory flavors. And the dessert was just amazing!",
   "Had a great experience tonight.  My wife and I both had their grouper special which was great.  The chef is clearly very creative and brought some interesting flavors to it and the presentation was also nice.  Service was great-our waiter recommended a wine which worked out perfectly.  We will return when we are in Santa Fe again",
   "Excellent meal. Probably our best in Santa Fe. Everything was both delicious & beautifully plated. Our waiter, Jordan, was very knowledgeable and professional. I loved the butternut squash bisque, the salmon, & our friend raved about the blue crab appetizer. Everything was spot on.  Can't wait to go back again."
  ]
 },
 {
  "name": "L'OLIVIER",
  "address": "229 Galisteo St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1be892dc-9334-11ea-acda-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "free",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=4661661083490564155",
  "source": "GoogleMaps",
  "reviews": [
   "I flew in from Florida to visit Charles King, owner of King Galleries, & he made reservations here for himself, a couple of employees & myself.\nIt was my 1st time eating at a French restaurant, & I must say the experience was wonderful! I had the Elk Tenderloin; it was tender, juicy & delicious.  Our waiter was very knowledgeable choosing/suggesting wines to accompany each course.\nI give this experience 10 stars..best experience ever!\nThanks for a perfect end to 2019 & perfect beginning to 2020!\nHAPPY NEW YEAR!\nBrooke Grimes",
   "Great French food with a Southwest flair, in a former gasoline service station.  Service and food were perfect. Menu seems to change frequently. Daily fish and soup. Farm to market menu. Gluten free and vegetarian dishes available. Reservations at open table. Nice wine list desserts were excellent.",
   "They earned every star. Great ambience. Wonderful service. Absolutely amazing food. The kind that makes you glow all over and daydream about.  Worth every single penny.",
   "Delicious!  Tempura squash blossoms outstanding.",
   "Excellent in every way, from service to menu and preparation.  I highly recommend.  Note: their escargot is the best I have had in many years, really liked the way it was prepared."
  ]
 },
 {
  "name": "Tia Sophia's",
  "address": "210 W San Francisco St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1c2af334-9334-11ea-99f7-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "family",
   "eat",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15199240806418574903",
  "source": "GoogleMaps",
  "reviews": [
   "A Santa Fe tradition and always worth the visit. Amazing breakfast burritos with your choice of meat and red, green or Christmas Chile. Great omelets and the French toast was delicious. Best coffee in the area. Only possible downside is they are extremely popular and it might take a bit to get a table on a weekend morning but it’s definitely worth the wait.",
   "This place was delicious! Food was on point! Prices were great. Service was good. I will definitely be back! Wish they were open later though.",
   "Went to go have lunch with my fiance and had a bad experience. First they didn't have a very big selection on lunch only a few things. So  I just order toast and my Fiance order a sweet roll. His came out and it was a cream cheese Danish not a sweet roll they need to distinguish the difference between the two .my Fiance doesn't like cream cheese. Second I ordered toast only choice was white or wheat. It was dry and was like Walmart bread the butter they brought me was cold .How in the heck can you spread cold butter on your toast seriously my toast fall apart. This isn't  a good place to eat .Highway robber we paid 13.00 dollars for toast an a  cream cheese Danish. I could've went to McDonald's and eat better there for less. Don't get me started on the waitress, she was rude if they don't want to be around people and have people skills and good communication then they should work with people. When you provide customers services to people the company should make sure the waitress have good people skills. Was very disappointed. Will tell all my family and friends not to ever go there to eat.",
   "This place was good, suggested by the visitors center and out hotel when we requested local places. Chili stew with eggs was good and the Friday special with enchilada was tasty as well, nice heat to the green chili.",
   "The food was good, the environment was calm and the people were friendly. We met some interesting people here and then Davin went skateboarding with them. What a fun time we have in Santa Fe and to top it off, food like this. I can see why this place has so many reviews and why their rating is still so high. Amazing place to eat that blends with the Santa Fe culture."
  ]
 },
 {
  "name": "Trattoria A Mano",
  "address": "227 Galisteo St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1c72d1d8-9334-11ea-880d-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1465201747351909762",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food and service! Jay was very helpful! The octopus was excellent and the homemade pasta was wonderful! I also really enjoyed the chocolate dessert! It was outstanding! This is now on my list of favorite restaurants to go to in Santa Fe!",
   "What a lovely place! We had the carpaccio which was excellent! It has fried capers which are delicious and quite salty so don’t salt before you try. Then came the Gorgonzola pear salad that was light and excellently dressed. Our waiter recommended a Riesling, more expensive than what we budgeted but worth it and perfectly paired with all we ordered! Next came the Saffron lobster pasta. I would have preferred a cream sauce rather than tomato but it was still delicious. For dessert, we chose the calamari and were pleased. Service, food and atmosphere were stellar!\nMy only wish is that they would put a heater in the bathroom because of the very cold toilet seat!",
   "The food was good but way below our expectations. Out of 4 dishes ordered 3 were very simple in a way that you can easily cook it at home without much of an effort or any special ingredients. For the price we payed we expected more of a restaurant experience rather than a home made dinner. Again, delicious but simple and expensive. The service was great though.",
   "I've been dreaming of the orecchiette with the pork fennel sausage for the past week. It was amazing. Our server Ari was equally amazing. I appreciate the passion that shines through with this restaurant. Great job everyone that made our experience wonderful.",
   "Popular place for dinner.  We made reservations a day ahead and still had a late sitting but it was worth it for the food. We had chicken marsala and shrimp scampi.  Food and service was excellent."
  ]
 },
 {
  "name": "Mucho Gusto",
  "address": "839 Paseo De Peralta, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1cba142e-9334-11ea-8d6d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=17589376523431606095",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely the best!! We were so pleased with the prices and the quality! The Chimi's were so light and crispy and packed full of flavor along with the green chili chicken enchiladas! Full of green chili taste without killing your taste buds with crazy heat. Absolutely wonderful food!!",
   "Great food, service and hospitality. The Enchiladas Suizas were pure deliciousness! The black beans taste like authentic Mexican food.",
   "A very quaint no frills great restaurant.  Not very busy, so you can carry on a conversation with ease.  Very prompt and friendly staff.  Food was great and just the right portions.  The green salsa had a taste of line and was refreshing.  The pork is very tender and tasty.  A great restaurant for a quiet lunch.",
   "We drive by here twice a day for the last year but never stopped in before today. The old house feels like old Santa Fe. The tomatillo salsa in the chips & salsa appetizer was awesome and well worth $3.95, although I always like free chips at Mexican restaurants. The flautas were good. My wife and I shared the plate, and she ate a bigger portion than usual. That’s a great endorsement! We had wished it was a bigger plate to share. The almond glam was absolutely great, but definitely single portion size.",
   "This place is a hidden gem. I had the pork tenderloin burrito that was a lunch special. Everything on the plate was fresh and cooked perfectly. The rice was almost delicate, like it was prepared by a really good home cook. They have been in business since 2003. That says a lot in this city."
  ]
 },
 {
  "name": "Dr. Field Goods Kitchen",
  "address": "2860 Cerrillos Rd, Santa Fe, NM 87507, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1d006c4c-9334-11ea-ac6b-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "delicious",
   "food",
   "food",
   "music",
   "field"
  ],
  "link": "https://maps.google.com/?cid=1671803156803273105",
  "source": "GoogleMaps",
  "reviews": [
   "10/10. Love this place. They were pretty busy at dinner but we were seated instantly at the bar. The bartender took great care of us and our drinks and food came out quickly. The drink selection was great and plentiful as was the menu. We were told everything was good so we made sure to get a variety of dishes. We got the fish and chips, the Xmas enchiladas and the house made fettuccine. We were not disappointed. This was some of the best food I’ve had in Santa Fe and it’s now a staple in my book. I will be back!",
   "What a fantastic surprise!!  Delicious food!  Very nice staff!  Decent beer selection.  Guy was there with Triple-D, and for good reason!  What a great place hiding in a strip mall!  Go there!",
   "The only good thing about this place was the music! Flavorless or too much spice.The service was bad. Got a variety of different things. Shrimp tacos, missing avocado sauce and shrimp was SO spicy. (and I like heat)The pork sandwich had zero flavor and the potatoes on the side were burnt to a crisp. Do NOT recommend this place other than to come have a beer. Do not order food. Over priced for LESS than mediocre food.",
   "Stopped by Dr. Field Goods Kitchen last Friday when the urge to give this place a second go suddenly hit me as I drove past it while on Cerillos.\nI had only been once before, which was not too long after the restaurant initially opened. I can't remember what exactly I had during that first visit, but I wasn't terribly impressed and hence why I hadn't been back since. \nAlways willing to give things a second try, I stopped by before work on Friday (2/28) around 2 pm to see what the good doctor had to offer this time around. \nThe restaurant wasn't busy during that time and I sat at the bar near the window outlooking Cerillos. After going over the menu I decided to go with the fish and chips; after about, a ten-minute wait my meal was dropped off and I was left to indulge\nThe battered and deep-fried fish sticks were five-star:  it had the perfect texture and a noticeable freshness of flavor to it. The slaw that came served along with everything was the winning contributor, however. As it came with just the right amount of dill packed tang. Which is a quality most other restaurants lack as they tend to overdo this, thus resulting in bitter and subpar coleslaw. \nService was fantastic as my server was both friendly and highly attentive. Though it had been a while since my last visit to Dr. Field Goods, I'm glad I decided to make the sudden decision to stop by here. I definitely won't wait as long before I decide to drop by again.",
   "This place was amazing! We ordered the papas for a starter which were so good. We strongly recommend going for xmas as the were both excellent. The cherry vanilla soda might be my new favorite thing. Service was great and it was lightning fast but perfectly timed. A fantastic experience all around"
  ]
 },
 {
  "name": "Tomasita's",
  "address": "500 S Guadalupe St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1d4dcd26-9334-11ea-801f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=14586014722387557001",
  "source": "GoogleMaps",
  "reviews": [
   "This place was packed on a Friday night but we were fortunate to be seated immediately.  Our server was very friendly and overall the service was quick and efficient.  Vegetarian items are marked on the menu and there are sufficient menu items to choose from.  \nI had the vegetarian enchilada plate and it did not disappoint.  I would highly recommend this place and would happily return.",
   "When going to this fine establishment you feel the authenticity from the decor to the staff who greet you and seat you.  Now on to the wonderful food and drinks.There  margaritas are out of this world! If you get a chance to go. Make sure to put it on your to do list if in Santa Fe. For sure the one in Albuquerque is also of its own stature ENJOY!",
   "Popular New Mexican restaurant with a good size menu and decent food.   Not sure why this place is always packed, but they do a good enough job and are not overpriced like some other options in the Santa Fe area.  Good size menu with all the classics including the state question \"Red Or Green\" where the correct answer is always \"Christmas\".  The included sopapillas are a must, of course, especially when familiarizing out of town guests with New Mexico cuisine.",
   "Reservations highly recommended. Very busy from open to close! But you won't regret the crowd and noise. Food is delicious!! Service and staff are outstanding!!",
   "I wish you could award zero stars for Tomasita’s in the Santa Fe Railyard. Entering guests names in a electronic system that alerts you went a table is ready in the order you arrive is an easy job right? Our family was never alerted or seated. Don’t waste your time or money here."
  ]
 },
 {
  "name": "Sazón",
  "address": "221 Shelby St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1d91c908-9334-11ea-b412-14b31f159f22.png",
  "tags": [
   "delicious",
   "creative",
   "knowledgeable",
   "food",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=446884948102014286",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of the best restaurants I have ever been to! This restaurant is more than just dinner, it is a whole experience. Everyone and I mean everyone (from the hostess to the chef/owner) was extremely nice and welcoming. They explain to you the menu and share with you the flavors of each plate! Everything that we had was truly Mexican and a true delicacy!  If you are ever in Santa Fe this is a must! I will probably be back tomorrow!",
   "Delicious meal! We came here for restaurant week and I had the black bean soup, the duck, and the chocolate dessert. Honestly I think the soup was my absolute favorite but everything was quite good. We also had a selection of moles to taste as an appetizer. Honestly the only thing I didn't like as much was the chocolate dessert. The chocolate itself was amazingly tasty, but overall I feel it could have been more interesting as it was basically a sponge in the shape of a volcano with a lot of chocolate. A variety of textures could have really made it amazing with some crunchy bits, and maybe some fruit or something spicy to give it more flavor variety.",
   "This is an EXCEPTIONAL restaurant!  The bartender was creative and very well informed!  Our server, Carla, was absolutely perfect. She was very knowledgeable, very helpful, very kind, and extremely wise. She actually seemed to care about us!  The food was exquisite!!  The chef came to greet us and to make sure the meal was satisfactory. He was a extremely kind and quite private. There were not many plant-based options, but I managed to find enough to satisfy my appetite. I will definitely return to this exquisite restaurant!",
   "Been to many truly great restaurants all over the world. This was one of the top 3. Food was incredible, chef was available and personable, restaurant was intimate, fun, and friendly. Had 3 of the best “bites” we have ever had. If you happen to be in Santa Fe do not miss this. A truly great experience.",
   "In town for a conference and decided to take a stab at walking in since there were no reservations available and got lucky. We were seated promptly and presented with a wonderful description of the menu. A selection of fresh mole selections was brought to our table. The server described each in exquisite detail. The chef personally came out to thank us for coming out and to make sure we were enjoying our meal. Everything about this experience was remarkable and I walked away knowing that I was fortunate to have been able to dine here."
  ]
 },
 {
  "name": "Santafamous Street Eats",
  "address": "502 Old Santa Fe Trail, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1dd7e74c-9334-11ea-be87-14b31f159f22.png",
  "tags": [
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4500499366496527369",
  "source": "GoogleMaps",
  "reviews": [
   "Decided to try something new this morning. 5 bucks for a large breakfast burrito done fast and the owner was very friendly. I'll definitely be back to try lunch",
   "We had the Breakfast Burritos and got two of the Santa Famous Burritos to go. Plenty of shaded tables and space to eat. Definitely will be back the next time we're in Santa Fe!",
   "There is yet a meal, breakfast or lunch that we haven't thought was great from Santafamous Street Eats. The food is the best and you can’t beat the value.",
   "Breakfast burrito as good as it gets",
   "Great place for breakfast. We we're visiting Santa fe for 2 to 3 days and I had chicken burrito. I must say, it was the best burrito I ever had. I feel like, I had  authentic Mexican breakfasts. \n\nIf you are visiting Santa Fe , must try here."
  ]
 },
 {
  "name": "Atrisco Cafe & Bar",
  "address": "DeVargas Center, 193 Paseo De Peralta, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1e2801ec-9334-11ea-a15e-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "delicious",
   "kids",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=14344363893148756855",
  "source": "GoogleMaps",
  "reviews": [
   "Atrisco has the best New Mexican cuisine in the city and I have tried them all. I believe they have the best prices to go along with that. The best red chili by far. The temperature has come down a bit over the years but you don't care because its so damn good! Roast leg of lamb burrito with red. You won't forget it.",
   "Great Food, Great Drinks, Great Service, Great Price. \nFinally got the opportunity to stop into Atrisco on our 4th trip to Santa Fe. We're sorry we took so long to visit. The wait for 6 people to be seated on a Tuesday evening was a mere 10 minutes! Our server was prompt and attentive. Once all of us first timers figured out what we wanted from the menu, our order was prepared promptly. \n\nThe New Mexican cuisine was excellent. The green sauce was flavorful and bold. The red sauce had a wonderfully warm smoky flavor that one would expect from a well prepared red sauce. Neither sauce was too hot.\n\nIf you like well balanced margaritas I highly recommend the Silver Coin. Neither my wife nor I often get margaritas at restaurants because they are often too sweet and bury the flavors of alcohols. The Silver Coin was as good as homemade for us.\n\nHow much did it cost for food and drink for 5 adults and a child? Only $120.00 with tip.",
   "We love this restaurant.  During our visit to Santa Fe, this was our favorite New Mexico style restaurant out of other similar style restaurants.",
   "Excellent, family-friendly local place with a warm vibe and absolutely delicious food! Loved it so much. Even the kids menu items were thoughtful and tasty.",
   "Delicious experience. The prices are perfect for the proportions and the Chile is spicy and authentic. I felt right at home at Atrisco!"
  ]
 },
 {
  "name": "Izanami Restaurant",
  "address": "21 Ten Thousand Waves Way #2, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1e767370-9334-11ea-8d96-14b31f159f22.png",
  "tags": [
   "sampling",
   "eat",
   "food",
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=5126788344014377454",
  "source": "GoogleMaps",
  "reviews": [
   "We went for a soak, then stopped for a late lunch at this absolute architectural masterpiece of a restaurant. The meal was fantastic. We sat at the counter, and tried a sampling of tasty sake, along with some yummy appetizers and a bowel of donburi. We felt as if momentarily back in Japan. Perfection",
   "It's the only restaurant between ski Santa Fe and downtown Santa Fe. If you don't want to take something to eat at the ski place, this is the only place to go. People going to ten thousand wave spa also have this restaurant as the sole choice. That being said, it can get very crowded. Make sure making an appointment. Otherwise you might have to wait for quite a while.\n\nThis is a restaurant offering Japanese food. The place itself is clean, full Japanese style. Service is good and receptionist is nice and friendly. However, the food is not as good. If you are familiar with Japanese food, then chances are that you will be quite disappointed. That's why I only give it a 3 star. If you want to find a place to get some feeling about Japanese food and dining tradition, this place might suffice, or better than most similar restaurants downtown.",
   "The staff is exceptionally friendly and they like to say certain words in both japanese and English. I heard them accommodating a nearby tables' unusual requests as if it were no problem whatsoever. They even ask about your food allergies before submitting your order. That aside, the food itself is quite delicious. It tasted clean, fresh and flavorful.",
   "Decided to check out this restaurant after some time in the grand bath. So glad we did!The food was spectacular from the beet salad to the bread pudding, we enjoyed it all! Our server Sasha helped us pick out sake to go with our meal, she was a delight. Will definitely be back, be sure to give yourself some time to relax and enjoy it all😍",
   "We visited this restaurant during our visit to the Ten Thousand Waves spa. \n\nAs a vegetarian,  japanese restaurants are a mixed bag for me, but this restaurants has good vegetarian options, albeit with a yummy mexican twist. \n\nTheir coconut tapioca dessert was very very delicious :)"
  ]
 },
 {
  "name": "Dinner For Two Santa Fe",
  "address": "106 N Guadalupe St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1ebe6fd0-9334-11ea-bfa5-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "creative",
   "delicious",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17592024752616666426",
  "source": "GoogleMaps",
  "reviews": [
   "Such an AMAZING experience. The main dining area was completely full on a Sunday night, but they have a really adorable bar area with the lounge. We decided to sit in the lounge and relax during, which was really the best way to go. On Sundays they have a three-course prix-fixe meal for $25. The options are great. I had the Seafood Sampler, french onion soup, and sorbet. Everything was so flavorful. Service was decent at the bar. I would definitely come back again and again. What a gem in Santa Fe. The ambience was everything.",
   "We visited Dinner for Two on a whim while touring the Santa Fe Plaza area. We were a tad underdressed - this is a classy place! The drinks and appetizers were wonderful, and their French Onion Soup was excellent. However, our waiter Jason seemed cold towards us, which is why we’re giving four stars. The rest of the staff was very friendly, including the table-side chef who put on extraordinary dining room performances. We really wish we could’ve given five stars, but we did feel judged and ignored, and it affected our experience.",
   "Went for the Sunday night special--soup, entree and dessert for $30 (upcharge for steaks)-- everything was delicious and the service was friendly...Two complaints-- the room was chilly near the door (it WAS a very cold night in SF) and the drink menu is damn hard to read  (actually looked it up on my phone instead)-- but a very nice meal. Next time we will go during Happy Hour (4-6:30 and 8:30-10) and sit in the bar where you can watch the kitchen work and get some outstanding tenderloin tips and prime rib sliders for $8 each.",
   "Cozy little restaurant that's locally owned and has a variety of creative cocktails at their full bar and a delicious menu. Go for happy hour, you will be glad you did. Reduce prices on some drinks and many appetizers. Cozy seating oh, it would also B good for a romantic dinner.",
   "Romantic atmosphere, upscale but not pretentious. Great food, interesting cocktail menu, friendly staff. They seem to be known for their steak—it was pretty darn good! For something unique, try the “Paradise Lost” cocktail while it's still on the menu. It's made with a banana liquor, and it is very tasty."
  ]
 },
 {
  "name": "Paloma Restaurant",
  "address": "401 S Guadalupe St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1f012ab0-9334-11ea-a85f-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17984999455420744286",
  "source": "GoogleMaps",
  "reviews": [
   "I think I found my new favorite Santa Fe restaurant. Great fresh take on Mexican dishes. I had the cauliflower mole, which was incredible. Salsa (4 kinds!) and house made chips were a perfect way to start the meal. They have a very nice outdoor patio and bar area as well. Dog friendly in the patio area too 😁",
   "Fantastic cocktails. Beautiful ambiance. Amazing service. Fresh, seasonal, delicious food. \n\nIf you don’t eat at Paloma while visiting Santa Fe, you are messing up!",
   "Best dining experience we had in New Mexico! Mezcal margarita was amazing as was the chicken mole. We all agreed they also have the best tortilla chips.",
   "Food came out cold. Brisket taco totally fell apart from being too soggy. Bass taco tasted old. Tortilla soup’s only flavor was spicy. Nice atmosphere and drinks.",
   "Amazing little gem. Just order everything off the menu and bring a large group! Trust me 😎"
  ]
 },
 {
  "name": "Santa Fe Dining",
  "address": "4056 Cerrillos Rd, Santa Fe, NM 87507, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1f4aeef4-9334-11ea-96df-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=14711078373817590837",
  "source": "GoogleMaps",
  "reviews": [
   "Good cold beer",
   ""
  ]
 },
 {
  "name": "The Pink Adobe",
  "address": "406 Old Santa Fe Trail, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1f8d0112-9334-11ea-8a35-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16176376742323149625",
  "source": "GoogleMaps",
  "reviews": [
   "I have never paid so much for \"rice and beans\" in my life, nor have I been treated so poorly while paying so much.    I'm from Santa Fe, and used to meet out of town or work friends here on occasion.   Not anymore.   The staff and manager assume that you are from out-of-town and never coming back, and told me so.   I told them that they were half right.    I had to explain it to her.",
   ".Great food still after 30 years. Try Clam Lucifer if you like spicy food. The Steak Dunigan is fabulous. Tender, prepared as requested. Great sauce.",
   "The Pink Adobe restaurant and the Dragon Room(the bar) are top notch and have been for three generations of our family and for Santa Fe at Large! The atmosphere and its timing have changed a bit, since sadly, the original owner passed away and, since it's changed hands, but a greater portion of the original menu and all-around service are still intact. I have recommended it to friends from all over the world, and it still retains an excellent worldwide reputation.",
   "Pink Adobe is a solid choice for a good value meal. The setting is very locally driven. Both the patio and the interior dining room are great examples of our local culture. The food is prepared well and also represents our area very well. Service is good and caring.",
   "I think if they hadn't over-cooked are steaks it would have been a lot better I order my steaks medium rare and it was probably medium or maybe a little more than that. My friend ordered hers medium and it came out well done."
  ]
 },
 {
  "name": "Maria's New Mexican Kitchen",
  "address": "555 Cordova Rd, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1fd9e8b8-9334-11ea-8871-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11801072153920289452",
  "source": "GoogleMaps",
  "reviews": [
   "After visiting this place 4 times, I finally decided to write a review.  Each and every time I come here, I always have a great dining experience.  The food is amazing and the drinks are plentiful.  They literally have hundreds of margarita options.  \n\nOn this most recent trip, it was the first time I went for lunch (the other times were dinner) and the portions are just right. They have lunch specials each day of the week, so there's a reason to come back each day of the week.\n\nLastly, I noticed the place has expanded when I came in today.  I found out from a worker there that they bought out the shop next to them and expanded back in September 2019.  The restaurant can handle a lot of guests now and if waiting was an issue before, it's probably gotten a lot better.",
   "The food was what you’d expect of a quality New Mexican restaurant. The portions were pretty large, so don’t be too liberal with your order unless you want go back to your car with your belly on the brink of explosion. Servers were nice and the atmosphere felt warm and intimate. It’s a great place for a quiet date or a small group of friends. I would come back.",
   "We had a wonderful dinner here.  Everything was fresh and the service was excellent. I would highly recommend this restaurant.\nParking was the only issue, lot was full so we ended up parking on a near by street.",
   "Awesome food and great service here. I've never seen such a huge menu for margaritas anywhere. The entrees both came with sopapillas that were delicious. I would definitely come back here the next time im in the area.",
   "We went to Maria’s for margaritas and while we were less impressed with the drinks, we were blown away by the green chile chicken stew! It was phenomenal. So good that we bought a bowl to go."
  ]
 },
 {
  "name": "Eloisa",
  "address": "228 E Palace Ave, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/201ae978-9334-11ea-81e2-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=16022922695165162563",
  "source": "GoogleMaps",
  "reviews": [
   "Took my team there for our holiday lunch. Nice vibe and enjoyed it not being South West style. The menu was reasonable, though not great for those on plant based diets, and the prices were fair for a higher end restaurant. Everyone certainly felt they were being treated. A couple of small things that a restaurant of that caliber should do better - I ordered seasonal veggies, which would have been great, if the season was summer. Our local Farmers Market has some great root veggies at this time of year, so the chef might want to take a trip. And several of the entrees are served in big dishes and the server was carrying one in each hand with his thumb in the bowl. Some Silver Service training wouldn’t go amiss. The desserts are delicious! All in all, we were very happy with the experience and I would certainly recommend it.",
   "The service was great. The Food was Amazing. \nIts hard a good place that has the 2 here in santa fe. \nDefinitely be back. I loved it",
   "Excellent food great cocktail excellent entrees, delicious dessert.  After dinner sherry was excellent. Rounded off by Jude our waiter caught my math error on the bill brought it to my attention. Told him honesty pays told him to keep the extra. Wished him a Merry Christmas and Happy New year. Will ask for him next time.",
   "Interesting and delicious tapas at this hotel restaurant. Husband and I shared four small plates and each one was delicious and surprising. Valencia  and burrata salad, pastrami tacos, corn flan and shrimp hash browns. Great service from Sergio. The mole ice cream for dessert was different. I should have tried something else. Overall a good choice for dinner.",
   "Great restaurant in Santa Fe Delicious Tastes modern New Mexico. Mario is a great host and server"
  ]
 },
 {
  "name": "Luminaria Restaurant & Patio",
  "address": "211 Old Santa Fe Trail, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/205f93d0-9334-11ea-abac-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10774564212921060729",
  "source": "GoogleMaps",
  "reviews": [
   "We visited Luminaria on Valentine's Day and had a wonderful experience. We made a reservation ahead of time and came a little early so we were able to enjoy a drink at the bar. Our bartender, Matthew, was amazing. He made me a perfect dirty martini and when we asked for a suggestion on wine he chose the perfect cab. Our table was ready ahead of time but we were in no way rushed to sit. Once we did, we continued to have a perfect experience. Our server was attentive but also gave us our privacy to be love birds enjoying a Valentine's dinner. They had a special per person menu that was so good, I'm getting hungry and my mouth is watering now just thinking about it. My cut of beef was juicy, flavorful, and had very little fat. My boyfriend's pork tenderloin had a spice that gave it a little kick but then also had a bacon marmalade that accented the spice with a somewhat fruity, somewhat smokey flavor. The veggies tasted fresh and were perfectly cooked - I hate when asparagus is too crispy or too soggy and theirs had a perfect firmness. I have enjoyed some great meals in my day, but I put this dinner in the top 5 purely based on food quality. Add in the ambiance and great service and you can't beat it for a perfect evening. I can't wait to visit Santa Fe again and when I do I will definitely be making another reservation at Luminaria. I have zero complaints and even think the price point for the quality level is a tremendous deal.",
   "Three of us had lunch and the food was quite good. The Grandma Dora’s Enchilada Casserole had excellent flavor and texture. I asked for both red and green chili. The green was fairly hot, while adding nicely to the meal, and the red was complementary as well \n\nWith calm atmosphere and comfortable furnishings, it’s nice to visit.\n\nThe only drawback was our waiter, who, as my brother said, didn’t seem like he wanted to be there.",
   "Had Christmas Day brunch here and they squeezed us in without a reservation quite quickly. The staff was wonderful and so friendly. The food was wonderful and FAST! We had the eggs Benedict and pancakes plus mimosas. All around great meal. The interior design is so beautiful and cozy, made for an overall perfect Christmas Day brunch. Would recommend!",
   "Luminaria has outdone themselves! \n\nGreat wine list! \n\nService and all of my 3 courses were high  Quality, well paced, and I had an excellent server. \n\n This place knows what they are doing.",
   "Staff were accommodating, decent for appetizers and good wine selection."
  ]
 },
 {
  "name": "Bumble Bee's Baja Grill",
  "address": "301 Jefferson St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/209fd162-9334-11ea-8ad2-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food",
   "affordable",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=11251780804397559374",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely worth the money! Good food for a good price, I ordered two tacos, the price was about $7. \n\nI was expecting a small lunch I could easily finish but boy was I wrong! I finished my first taco and could barely finish half of the other!\n\nVisit if you can! Great food, great prices, and great service!",
   "We were a little skeptical at first as it kind of has a fast food appearance,but after we got our appetizer, we knew we were in for a treat.  The food was excellent.  I got the seafood bowl and the broth was excellent.  In fact, I might pick up another bowl to go, so I can hook my dad up back in colorado.  Would definitely eat there again!!",
   "Having lunch at bumble bee Baja Grill.  The atmosphere is colorful and fun with piñatas of bumble bees hanging from the ceiling.  The best was of course the food.  Fresh Chips, freshly made tortilla shells and the price was very affordable.  They are not in the touristy area which made it that much more authentic.  The insiders at Santa Fe know about this wonderful dining experience.  Enjoy!",
   "Fast and quick food. They have a drive-thru and a dine in section. I dined in. The food is a bit pricey, but overall very yummy. They have several good vegan options, in addition to some alternative meats. The salsa and guacamole is house made and exquisite. The atmosphere is funky and it is impossible to leave in a bad mood, due to its upbeat feel. Even though it is tex-mex, the food didn't feel too heavy, which I think was a plus. I did not leave hungry. And, they have Dr. Brown's sodas.",
   "Nice team: taking time to interact and serve customers. I tried the green chili chicken bowl. See before and after pics of the bowl to see how delicious it is."
  ]
 },
 {
  "name": "The Anasazi Restaurant & Bar",
  "address": "113 Washington Ave, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/20f14e26-9334-11ea-9119-14b31f159f22.png",
  "tags": [
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3445770749438563613",
  "source": "GoogleMaps",
  "reviews": [
   "Very classy place, upscale! Look to spend at least 300.00 for a bottle of wine.. up into the 700.00 range for certain bottles! Well stocked on tequila! The nacho dish was very delicious!",
   "We had a nice meal. Not an exceptional one, but solid. The heirloom tomato salad was great. Our mains were mostly good, but not exceptional. My daughter loved her lamb dish.",
   "Came here for Christmas Dinner. Table was by the kitchen. Host was rude. Good selection of wines. Fixed menu was good. Lobster tail was a joke in size. Lamb was excellent. Over all a disappointing meal. I expected more from Rosewood.",
   "Trendy southwestern themed restaurant that is part of the Inn hotel. Very nice, the entire building is in the pueblo style and the interior is all that wood and stone layers that makes the whole thing feel like it's a spa. And that is not a bad thing at all!  On a recent visit, I had the pork chop and it was perfection.",
   "Good overall service with a few missteps. Good food. Great atmosphere."
  ]
 },
 {
  "name": "Apothecary Restaurant at Santa Fe Oxygen and Healing Bar",
  "address": "133 W San Francisco St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2140ccd4-9334-11ea-bf1e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=3489061594769823423",
  "source": "GoogleMaps",
  "reviews": [
   "As soon as we all walked in, we felt relaxed and at home. The restaurant itself has a very “homey” feel and we loved it. The servers were very attentive, I never ran out of water which usually happens, and they were also very nice. The cocktails that we ordered were all delicious and refreshing, an added complement to the experience. The food is all very healthy and makes you feel good about eating it! Will be back for more good food, drinks and good vibes",
   "Phenomenal flavored food. Great vegetarian and vegan options. Very friendly staff and relaxing atmosphere.",
   "WOW... We were lucky enough to discover this place and it was fantastic!  Mocktails that were luscious and vegan dishes were amazing. That pizza was incredible and service was so kind and nice.  The server, Dillion I think, made our first experience truly a highlight of our adventure.",
   "I really wanted to like this place! Had high hopes from the positive reviews, and was looking forward to nutritious food that was delicious. The atmosphere and staff were warm and wonderful. The food... a hit and miss. Happened to come during restaurant week, seemed to be good value for an appetizer, entree, and dessert. The appetizer, asparagus bisque, was absolutely spot on: flavourful, rich, but not too heavy, full of umami. The pho entree was a big miss: lacking in flavour and bland in every way, had no resemblance to pho flavours or concept, aside from being a noodle soup. The cocoa \"cheesecake\" was heavy and tried to be interesting, although also lacked in a bit of flavour. Vegan food can be delicious, unfortunately, not all dishes here were. Especially disappointing given the prices on the regular menu; ingredients also felt healthy but not well used due to the missing flavours. Would give this place a second try - especially drinks and other food on the menu. Perhaps not all items are equal here.",
   "This place was wonderful. A friendly staff member lured us in with the promise of delicious pad Thai, and they delivered! It's different, but delicious. The rest of the staff was friendly, positive, and informative - they gave us a lot of information about products and services."
  ]
 },
 {
  "name": "Weck's Breakfast Lunch",
  "address": "2000 Cerrillos Rd, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2184dab6-9334-11ea-9c7d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "unique",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15517755901734864579",
  "source": "GoogleMaps",
  "reviews": [
   "Food and service was very good. So stuffed after leaving the place. You can never go wrong with Weck's... Well, I hope at least everyone enjoys Weck's in Santa Fe or anywhere.",
   "This is your typical All-American breakfast joint. It was a clean restaurant, the prices were reasonable, and the food came out quickly. I recommend the Corned-beef Hash, South of Denver Omelette with half Read Chiles & half Green Chile’s, and their freshly baked cookies (Chocolate Chip & White Macadamia Nut). Sadly, I do have to point out the server was horrible, she didn’t seem to like her job. Even though the restaurant was only 1/4 of their capacity, we could not get the time of day with her to place our order.",
   "Wecks is pretty consistent with their food. Always good and good service. I tried the meatloaf this time and it was pretty good. They do top their mashed potatoes and meatloaf with brown gravy so if you're more of a ketchup glaze type then this meal might not be for you. Had to pick up a cinnamon roll too...",
   "Weck's was amazing!!! I've never had anything like it. Vacationing from Texas and ate at several places. This place beats all of them hands down. The food was unique and the staff was great. My finance and I can't wait to go back to Santa Fe next year when we get married and eat their delicious food. Definitely have to try it if you're in Santa Fe. If I could give it 100 stars I would.",
   "Was a bit skeptical of a chain type place in a strip center.  Don't be.  Really good service, big portions.  Not a huge fan of green chile in general, theirs was maybe the best I've ever had.  All of us really enjoyed our meals.  Good prices."
  ]
 },
 {
  "name": "Milad Betterday Kitchen",
  "address": "905 W Alameda St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/21c7d790-9334-11ea-8c60-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "eat",
   "foodie",
   "creative",
   "food",
   "music",
   "delicious",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4757714272272090748",
  "source": "GoogleMaps",
  "reviews": [
   "Another amazing foodie experience in Santa Fe.  Easily one of the best Mediterranean food restaurants that we've ever been to.   The trout was a surprisingly delicious stand-out and is a must-try when you go.  The kabob platter was a great pick for dinner as it comes with several kabobs as well as a choice of several side dishes.  The chicken kabobs & beef tenderloin kabobs were amazingly juicy and delicious.  The sweet stuffed dates were a hit with everyone and really seemed more like a dessert on the side of the meal.  The spicy chickpea salad was one of my favorite things on the table, but was too spicy for some.  There is a lot of choices of places to eat in Santa Fe and this one is worth keeping as an option.",
   "This place is wonderful, the food is amazing, the service is incredible! They’re very creative, the food not only tastes great it’s very appealing as well. We will definitely go back and have recommended it to all our friends!",
   "The atmosphere here was cozy with soft Persian music playing, we started with a chicken and rice appetizer, followed by our entrees of lamb and tenderloin kabobs (with Burberry basmati rice) and the trout special. My only negative comment is that a couple of the dishes were a little on the bland side. \n\nWe finished with an off-menu dessert they were trying out that consisted of mozzarella cheese baked with thin slices of filo dough on top and covered in some kind of honey and rose water reduction. This was amazing, and my favorite part of the meal.\n\nAs a side note, our waiter was welcoming, attentive (without being too present), and was ready to offer recommendations when asked.",
   "Decent, but missed the mark... Not too many options in my opinion.  Small plates and bigger plates, but where are the sandwiches???  Good flavors but strange portions.  Veg plate only contained  2 falafel, but had a whole cucumber and carrot (cut).  Seating is a bit awkward.  Friendly and fast service though!",
   "You havent eaten here... YOU ARE MISSING OUT!!!! \nOh my gosh the food is so delicious!!! Apps were very filling and tasty. Main course was great! I had Lamb and hubby had the fish. The fish was so full of flavor and balanced. The dessert was perfectly sweet. The COFFEE!!!! Oh my gosh! 🤤 My first time having persian coffee and idk how I'm going to drink anything else now!! The coffee was probably my favorite along with the appetizers. \nI do suggest you try the beer pictured. Its darker beer and I usually like dark beer but its imported from Jordan and its delicious. It is a Porter. \nWe ate inside, it's a tighter fit, pretty close quarters but that's expected for down town. There werent too many ppl there on a Wednesday night so it was nice. They also had a man playing on the guitar in the back room. \n*I'm sorry I thought I took a picture of our main courses but I didn't. So just apps and dessert in pics."
  ]
 },
 {
  "name": "Rio Chama Steakhouse",
  "address": "414 Old Santa Fe Trail, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/221f6d98-9334-11ea-91f7-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "art",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10039092879034322892",
  "source": "GoogleMaps",
  "reviews": [
   "Was not to thrill about this place.  I ordered the Prime Rib Sandwich which came with a side of Onion rings.  I felt the prime rib had too much fat on it and not enough meet.  The Onion rings were good.  My Girlfriend ordered the Prime Rib plate which came with a side of green beans and mashed potatoes.  She enjoyed it.  For dessert we had a coffee cheesecake which was amazingly delicious.  We also ordered two draft beers.",
   "Had their chili absolutely top drawer,one of the best I ever had. Nice and spicy just the right amount. Ate there two nights had a burger cooked perfectly had it with all the fixing plus fresh jalapeno peppers perfect.  Service the first was top drawer our waitress Rhonda ( I think ) was excellent. The waiter we had on our second visit, young, got tired flagging him down spotty service.",
   "We enjoyed a comfortable dinner in this prime Santa Fe location with friends and were treated to excellent service by our waiter Dan and the manager Tiffany. The green chile mac & cheese is outstanding and worth the visit, alone! My aged steak was grisly, hard to cut and had a strange taste - but this was well handled by the staff, who immediately cooked me a replacement prime rib, gave us a free desert, and were highly attentive throughout the meal. My husband had the salmon, which was flavorful, but the polenta was mushy. The atmosphere of Rio Chama is very 'Santa Fe', with comfortable booths, space between tables, and beautiful art throughout the restaurant.",
   "We were recommended to try this place for dinner. We were told to order the fondue and we were pleasantly surprised. Wow! I'm not really a fondue person, but it was amazing! We wanted to try more food, but the fondue was filling. We decided to come back the next day and order food from their lunch menu. It was equally as tasty as their dinner menu. For being a high class restaurant, the prices were not bad at all.\n\nTreat yourself and go here for any meal.",
   "I would give 5 stars, except they allowed a dog to sit at the table next to us in the bar area. NOT a service dog. Just a random puppy sitting up on a chair. Pretty unimpressive for such a nice (and $$$) restaurant. I would expect more!"
  ]
 },
 {
  "name": "Vinaigrette",
  "address": "709 Don Cubero Alley, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2263a2a2-9334-11ea-89d3-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9849954517495629443",
  "source": "GoogleMaps",
  "reviews": [
   "Wow this place is amazing, we ordered the peach salad, incredible good with the burrada cheese wow, we also ordered the Cuban tortA, so yummy all the flavors with the avocado chipotle sauce red chilly ham, amazing bite! Will definitely recommend this place, and for sure will be back 😊",
   "Great food, but it took 20 minutes after being seated to be acknowledged. Another 10 min to get water.  Not only was our service slow but our waiter was rude.  Will not go back.",
   "Such delicious food! Huge fan of the hoisin duck dish",
   "Always fresh and the food is always amazing. M&Ms... 🍄 stew and Mac and 🧀. Mmmmm",
   "The food is great I really enjoyed their mushroom stew soup, but for vegans I would recommend going to Edible Alchemy down the street. The menu at Vinaigrette isn't very vegan friendly. Every salad has cheese, egg, or bacon and although you can substitute cheese for a vegetable, you still end up paying a premium for the animal protein. If you try to substitute for avocado which is of similar value, they try to charge you $2. So for a $12 salad you can get a super vegan tailored one down the street with vegan cheeses and bacon tempeh."
  ]
 },
 {
  "name": "Palacio Café",
  "address": "209 E Palace Ave, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/22acb9cc-9334-11ea-baad-14b31f159f22.png",
  "tags": [
   "walk",
   "delicious",
   "creative",
   "eat",
   "affordable",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2909383240659836629",
  "source": "GoogleMaps",
  "reviews": [
   "BEST OF SANTA FE! The most incredible breakfast burritos we have EVER had. We met Damon, the owner this morning and he only uses the best ingredients. The are always well cooked but no over done. I recommend ordering Christmas on the smothered burrito to try the flavorful red and green chili. We enjoyed the patio with our dog as well so you don't only need to dine in but you can enjoy the beautiful weather across from the cathedral. It's worth the walk from any hotel.",
   "We LOVE this place. Super friendly and attentive staff. We went in around 8:30ish on a Saturday morning. We both got the Palacio breakfast and shared pancakes. Eggs were cooked perfectly. Hash browns were delicious and not greasy. Will absolutely be going back next time we're in town.",
   "Fresh choices with inspired twists. You can't go wrong with their creative menu and exceptionally friendly service. Perfect place for a quick and affordable bite to eat.",
   "Food was excellent: chicken enchiladas w/red chile, posole, beans all tasted homemade. Table outside was comfortable. Service was very slow albeit friendly.",
   "Remember her and her humble beginnings \nWonderful family. Husband cooks. Wife cooks and does everything else. She is the heart and soul. Food is amazing. You can taste the difference.  It’s truly made with love and passion. Love for food and New Mexico and family. Our favorite place in New Mexico. And I wish this beautiful family success for many many years to come. They deserve it and Santa Fe deserves them"
  ]
 },
 {
  "name": "Cafe Sonder",
  "address": "326 S Guadalupe St, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/22f35fd8-9334-11ea-a18d-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "unique",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18052227584779143691",
  "source": "GoogleMaps",
  "reviews": [
   "We had a great experience here last night. Food, service, and price were all perfect. Not sure why it wasn't that crowded while other restaurants in town were packed? I loved the easy access to ample free parking it the back of the restaurant. We will be visiting Cafe Sonder again soon!",
   "Great atmosphere. Came for a late lunch while passing through the area. Friendly, attentive staff. Had the Grilled Artichoke Cobb Salad. The salad had its own unique flare for a Cobb salad.",
   "Excellent, interesting dishes among well-prepared familiar dishes, all at fair prices. Warm beets over ricotta with pumpkin seeds, topped with arugula was a great appetizer for $6. Moussaka was creamy, hearty and delicious at just $11.",
   "Had lunch here and sat outside on the patio. The atmosphere was great and relaxing, and the food was delicious. I ordered the pastitsio ($12), which is served with a large Greek salad. I would recommend it...",
   "We’ve been here a couple times. So an extra star for that. Today, breakfast was served cold. Chilled. Makes you wonder what’s happening in kitchen with cooking vs just reheating? Overheard other diners with same complaint. Just odd to have so many meals served cold. Heat lamps? May try again, but not sure with so many better, consistent dining alternatives in Santa Fe. Especially for nice, hot breakfasts!"
  ]
 },
 {
  "name": "Joseph's Culinary Pub",
  "address": "428 Agua Fria St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2347e8ca-9334-11ea-8514-14b31f159f22.png",
  "tags": [
   "delicious",
   "cheap",
   "unique",
   "foodie",
   "delicious",
   "food",
   "food",
   "walking",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11445843883361854417",
  "source": "GoogleMaps",
  "reviews": [
   "Such a gorgeous and unique restaurant, wonderful attention to detail in the cosy design inside...like a step back in time. Fantastic staff, there when you need them and leaving us alone to have a romantic dinner for the rest of our dinner. One of the most delicious and unique vegetarian meals we have ever had - my boyfriend is not a foodie but he was savoring every mouthful. Not cheap but worth every dollar! Very romantic too :-)",
   "Delicious food n presentation was amazing! Good selection of teas, coffee, beer and wine. No alcohol though.",
   "This place is amazing. Found it by accident while walking around and I am glad I did. It is hidden among the side streets. Great food. Decent prices. Friendly staff. This is a classy location with quality food. A great place for date night. It has become a regular stop when I pass through the area.",
   "This was a truly beautiful meal! The place itself, the staff, and the food all made for a stunning experience. Go for the hand painted tables and expertly crafted meals, stay for the duck fat fries and duck fat caramel ice cream. Woah.",
   "Customer service was phenomenal! The food was ok. Had the carrot curry crab soup which was a bit lemony to my taste but it took another customer to complain for the chef to acknowledge. It was taken off my check ... I wasn't sure what to expect since this was the first time I was having this soup but was assured it is supposed to taste lemony... Anyway. The rabbit lasagna was very good. Could have used a bit of salt but there was none at the table. The salted caramel butterscotch pudding was awesome. Gabriel was my server and he earned the extra star for this review, otherwise it would have been three. I would go back"
  ]
 },
 {
  "name": "Sweetwater Harvest Kitchen",
  "address": "1512 Pacheco St B, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/23978f8c-9334-11ea-aa88-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "food",
   "eat",
   "foodie",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4319803738613335670",
  "source": "GoogleMaps",
  "reviews": [
   "Friend invited me for lunch. The vegetarian options, the vegan options and gluten free options ended up being secondary to the freshness of the food. Absolutely delicious. Absolutely. The decorations are beautifully and tastefully done. Open self seating.  Long table with plants in the center is where we sat. Friendly staff. Can't wait to go back",
   "Fantastic! Plant based foodie here traveling through Santa Fe for the night. Looked up reviews and this seemed like the place to eat if you are a plant based dieter or gluten sensitive. The tofu tacos were Aaaaa-maaaaazzzzing! I also got the matcha bowl and vegan sausage. Definitely was the meal I needed to start the day. Very cute place too and nice staff. Very clean and well kept.",
   "Love the vegan options!  Thanks for variety.  Flavorful food.  Fresh.  Hot.  Even offered some almond milk for my coffee.  Great service too!",
   "Amazing.  Just amazing.  I had the breakfast burrito with green and red salsa.  Daughter had the Heuvos Rancheros.  Then we had chocolate, pumpkin and berry pies for dessert.  Incredible but the chocolate pie was one of the best that I've ever had.  Enjoy!",
   "So good. Would highly recommend. However, don’t try to use Yelp discount, they did not accept."
  ]
 },
 {
  "name": "Café Castro",
  "address": "2811 Cerrillos Rd, Santa Fe, NM 87507, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/23e78498-9334-11ea-8fea-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12266958900080881940",
  "source": "GoogleMaps",
  "reviews": [
   "If you are looking for excellent New Mexican cuisine outside of the Plaza,  give Cafe Castro a try.  Just as good if not better than The Shed. I ordered the Chili Rellenos.  Not as crispy as Orlando's in Taos (best ever!) but the green chili sauce had some nice zip and the red sauce was rich.  Generous portions and the staff was super friendly.  Busy place 'cause this is where the locals go.",
   "While visiting Santa Fe this month, I ate lunch at Castro’s and then went back for pie and ice cream for dessert later that day.  The restaurant was located right across from the motel where I stayed, which was away from the congested Santa Fe downtown main square.  Cafe’ Castro was not only very convenient to get to, but also was a real pleasure to eat at.  The employees were all friendly and efficient.  There were obviously regular customers who knew the cashier and wait staff, as well as knowing other customers. It was easy to find delicious vegetarian options on the menu. When I visit Santa Fe again I will definitely return to Cafe’ Castro.",
   "This is hands down the best New Mexico home style cooking. I stop here each time I am traveling through Santa Fe. The atmosphere is relaxing. A local musician plays his guitar and sings. The Chile Rellenos is my go to favorite. Warning the parking lot is usually packed. This is a popular place.😀",
   "I think that this is some of the best New Mexican food in Santa Fe. My wife and I eat their a couple of times a month. I once brought a party of 15 for lunch the service was great and everybody mentioned how good every thing was. I am looking forward to my next trip already.",
   "The food here is awesome! I got two chalupas with. Eans and ricd and they filled me up. Everyones meal had a good portion size so you drfinitely will. Not be hungry after. Service was good as everyone was attentative and very friendly. The price was"
  ]
 },
 {
  "name": "Los Potrillos",
  "address": "1947 Cerrillos Rd, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/242fb152-9334-11ea-801e-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4848604714540135631",
  "source": "GoogleMaps",
  "reviews": [
   "First time there.  Have passed it many times and they are always busy.  Saw sign on front window that credit card machine was down, so I had to hit an ATM to get some cash first.  Kind of an inconvenience.  We got seated fairly quick.  Cute interior, felt like we were in Mexico. Wife ordered margarita we she said was very good. I had a model especial. Chips and dips were brought to the table.  Menu was huge with lots of items and pictures.  It was hard to choose.  My wife had the gorditas with meat, cheese rice.  I had the grilled steak with cheese enchiladas.  All of the food was very good, I just wish it was a little hotter (spicier). Will definitely return.",
   "I just love this place! It is really truly Mexican food. The service is great and the menu is full of authentic choices. Breakfast is a must you here as well. House Margaritas are so so but there are other drink options that may be better.",
   "Incredible food. Great service. I was told this is a real \"locals spot\". I would recommend eating here everyday of you can! Their margaritas are phenomenal, very large and not overly sweet like some places. I have never had better fajitas, which sounds insane because, how can you make fajitas even better?! I'm not sure, but they do! 🌮",
   "Excellent service and food! The vegetarian enchiladas were fabulous! Food was fresh, hot, and quickly served.  Our waiter checked on us repeatedly.  I can't say enough about the friendly, professional service!",
   "Excellent establishment! Service courteous and attentive. Friendly atmosphere. Delicious food! Judging by the crowd, quite popular."
  ]
 },
 {
  "name": "Casa Chimayo Restaurant",
  "address": "409 W Water St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/247bfcb6-9334-11ea-abfe-14b31f159f22.png",
  "tags": [
   "creative",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13081798010264466022",
  "source": "GoogleMaps",
  "reviews": [
   "Close but no cigar. There’s a lot to like about Casa Chimayo. The atmosphere is great with a warm mixture of traditional Mexican culture and visuals. The staff are attentive, friendly and the service was prompt. The menu is inviting and creative with mouth watering descriptions of the food. The only reservation I have is with the food. It’s good, but not great. Appealing, but not exciting. I found myself thinking that this must be what low-sodium Mexican food is like. Even if such a thing exists, who would want to eat it? That said, this may be the preference here abouts so I’ll let it go at that.",
   "Been through twice and it was pretty alright! I wish they had real margaritas :/ queso was also pretty light. The mole plantain enchiladas were a real good time and the salsa is on point. The vibes were good and the service was great. Just a couple things that need another touch.",
   "Good food.  Service was a bit slow at 6:15 pm and the place was quiet, within 30 minutes or so most table were filled and the service was much more responsive.  Enchiladas were great and definitely try jalapeno and grilled pineapple margarita! Only downside were the beans.  Beans require a bit of preparation to make, and these were tough and had exploded shells.  That tells me they through them in a pressure cooker and took little care in making them. Overall good food though.",
   "Food is tasty and service is good. Price is on the high end.",
   "I’ve enjoyed Casa Chimayo a few times on visits to Santa Fe. They were once featured on Diners, Drive-Ins and Dives. You can’t go wrong with the blue corn enchiladas with Christmas chile. Be sure to try their amazing guacamole and an agave wine margarita. Be advised, their margaritas are STRONG."
  ]
 },
 {
  "name": "Ostería d'Assisi",
  "address": "58 S Federal Pl, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/24cae042-9334-11ea-878c-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5222516939745678600",
  "source": "GoogleMaps",
  "reviews": [
   "Went for Restaurant Week, and had been looking forward to it all day. The food was delicious and timely, but the service, from start to finish, was poor and I felt ignored once I was sat at my table for minutes!! (By service was poor, I mean, I wasn't greeted at the door for minutes and a server who came to the door where I was ignored me because he was busy, but was polite enough to answer my question.) I ordered water and my entire meal and had to wait minutes for my water to arrive, with 4 or 5 employees passing me while I waited. Then after dessert, I asked a server for my check 11 minutes before I had to be at my bus stop, thinking she would tell my server for me. More minutes passed and I paced around and searched for someone to help me pay. I called the bus company to see if they would hold for me. My server finally arrived, and apologized but by the time I paid, it was 8:55 pm. The time I had to be at the bus stop. This was a stressful and delicious night. And missing the bus would have made me have to wait an hour downtown at night for the next bus. Not what I wanted to do. (I had a 7:30 pm reservation, arrived a few minutes early, knew exactly what I wanted before I was asked for my order, but didn't get out of the restaurant until 8:55 pm.)",
   "Fantastic place for Italian food. Beautiful outside dining, extensive wine list, delicious menu items and outstanding service. The veal was tender. The warm bread and oil was a wonderful start. The pastas are authentic. Ask for Pietro. He is a true character and an experienced professional.",
   "We went for lunch during restaurant week and the service was as attentive and excellent as usual. The quality of food is fantastic and very authentic. I truly enjoyed my dish and love to find southern Italian dishes on their menu.",
   "There are many great restaurants in Santa Fe... Ostería d'Assisi is NOT one of them. Two of us went to Ostería d'Assisi for dinner and were absolutely unimpressed. The gnocchi was pedestrian at best and it was accompanied by meatballs that were made of salt! The other entre, lasagna, came to the table burnt. After waiting for some time, a replacement lasagna was delivered without apology or explanation. At no time did the manager, if there was one present, come over to inquire. This restaurant is far to expensive and overpriced to waste your money. In another city with more competition, Ostería d'Assisi wouldn’t last a year.",
   "It was a special occasion for us, so my wife and I chose OSTERIA D'ASSISI for a Saturday dinner treat.  The food, the service, and the ambience were perfect. We shared a calamari appetizer, my wife had the halibut, I had the osso buco, and we finished with a tiramisu. Everything was perfectly cooked, very flavorful, and delicious. Service was attentive and excellent. Very romantic atmosphere.  Highly recommended."
  ]
 },
 {
  "name": "Piccolino",
  "address": "2890 Agua Fria St, Santa Fe, NM 87507, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/250a5a68-9334-11ea-91fd-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "eat",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=18240168600744432827",
  "source": "GoogleMaps",
  "reviews": [
   "This is not a big place but well worth it should you have a reasonable wait. The food was plentiful, very flavorful, and the portions were large enough to fill you up. I had a zucchini appetizer, a simple pasta dish, a small side order of sausage, and their gratis bread with sauce. The total bill was $22 so the price was good. My only reason for a less than perfect review was the service. Don’t get me wrong, it was ample but, after receiving my first dish, I was never asked how it was, etc. I was essentially left alone until it was time to clear plates and pay. Again, this isn’t a horrible scenario but it could leave some with a sense they were not treated well (and I’d dispute that). I will absolutely be back.",
   "Food is consistently amazing! Friendly and efficient staff. They serve bread and marinara sauce while you wait. Big portions so I usually take half home and enjoy again the next day! I've tried a few things (all delicious) but once I ordered the Pesto Tortellini with Broccoli, I rarely order anything else. So good!",
   "I have no idea how I've gone my whole life living here and never eaten at this place. The food was amazing, the wait staff was kind, and the service was impeccable. It's a small place but it feels cozy and warm. It's reasonably priced and the portions are large. The menu is huge so be prepared to look through the options. I had a hard time choosing and finally decided by watching what was coming out of the kitchen. Go eat here!!",
   "The food was excellent!   The lasagna had was tasty,  and the Greek salad was so good,  I  wanted more! Next time I  won't be sharing.  😉  we also had the Green Chili Chicken alfredo lasagna and it was amazing!",
   "Delicious!! Visiting Santa Fe for Speing Break and wanted to try something different.  We got here at 5pm, there were seats available.  Now, after eating a tremendous,  delicious meal 1.5 hrs later...there are no seats available.   The place is packed and I can tell why. Good, delicious,  large portions, and the wine was generous! Would definitely come back when in town!"
  ]
 },
 {
  "name": "Bouche Bistro",
  "address": "451 W Alameda St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/25534a86-9334-11ea-8ac1-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "food",
   "delicious",
   "delicious",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=17411564878410034505",
  "source": "GoogleMaps",
  "reviews": [
   "Bouche is back on track. Thomas the manager is doing a fantastic job. The new chef has really improved the menu and the presentation. Bouche 2014 was not that impressive overall. Bouche 2020 is all about  finesse ! Thank you guys.",
   "Calm, friendly, smaller menu with complex choices. Food excellent, small portions, pricey. Knowledgeable service.",
   "Nice wine selection. Amazing French onion soup.  Short ribs were perfectly cooked. Incredible French fries. Every single French fry had the exact right level of crispness. While it was our most expensive meal in Santa Fe, it was some of the best French food we’ve ever had in the US!",
   "Our group of four travelers wanted to try a place new to us. The reviews on this site compelled us to try Bouche Bistro. We have a delicious, charming, gracious evening there. We sampled many items on the menu including the quail, risotto, oysters, Caesar salad (yum) and enjoyed a lovely bottle of French wine, followed by TWO! Desserts, cappuccino and expresso. The service staff was attentive in spite of a busy evening. Bouche Bistro is a perfect place for a lingering meal over conversation while enjoying a lovingly prepared meal, the kind of place for which one searches",
   "First time trying French and it was delicious! Very unique dishes and great atmosphere!"
  ]
 },
 {
  "name": "El Sabor Spanish Tapas Y Masss - Food Truck",
  "address": "518 Old Santa Fe Trail, Santa Fe, NM 87505, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/25986a10-9334-11ea-bd52-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "historic",
   "food",
   "food",
   "eat",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11378047925172662051",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious food and friendly staff. Was accidentally overcharged and the lady running the stand came out to reimburse us. Very appreciative of that.",
   "OUTSTANDING FOOD & SERVICE, AND MY VOTE FOR BEST FOOD TRUCK IN SANTA FE!  Executive Chef Ever Paz (Formerly Executive Chef of Santa Fe's historic El Farol restaurant) now offers exceptional food (and generous portions) to his customers at his bright red El Sabor Spanish Tapas Food Truck at 518 Old Santa Fe Trail, Santa Fe, at the intersection of Paseo de Peralta (right across from Kane's neighborhood grocery store and Capital Coffee).  Ever and his wife are both from Central America and bring authentic Latin American Spanish Cuisine with the quality and flair one expects in a fine restaurant.  Since my first visit here, over a year ago, El Sabor has become my favorite food truck--and favorite restaurant as well.  Other patrons must agree because El Sabor became one of the top-rated Santa Fe food trucks within months of opening.  Ever and his wife Anna are gracious hosts.  My favorites are their ribeye skewers, shrimp tacos, pastrami Reuben (pictured) and their chicken tortilla soup--loaded with chicken, tortilla, veggies, and fresh avocado (pictured).  El Sabor Spanish Tapas is also available for catering and for special events. Review by Daniel Williams,  NM Actor,  Writer, Filmmaker, Teacher, & Photographer ",
   "Mmmmmmmm. Tasted great. Price fair. Wait matched quality put into food.  I savored every bite. Thank you.",
   "This is my \"Taco Tuesday\" spot to eat, and it doesn't have to be Tuesday.  Love me some Mr, Polish Hot Dog, too.  Always friendly and always busy, so go early for lunch.",
   "The most delicious food we had in Arizona! This food truck is close to the main shopping area but far enough that you can relax while you eat. Fish tacos were absolutely amazing! "
  ]
 },
 {
  "name": "Joe's Dining",
  "address": "2801 Rodeo Rd, Santa Fe, NM 87507, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/25ea0cba-9334-11ea-a0f0-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13338196817836186161",
  "source": "GoogleMaps",
  "reviews": [
   "Roland and Sheila have become friends over the years, as have many of the wait staff who’ve come and gone (and whom we’ve seen elsewhere in town). We have the menu near memorized. We discovered Joe’s by driving down Zia a few times and noticing a wonderful smoker odor. We had to find its origin: Joe’s. That’s back when the large clock over the bar was symbolic, not running. Many years and meals later and it’s still one of our favorites. Try the onion rings. (And the only perfect “Black and Tan” in town.) Save room for dessert.",
   "Good food. The kind of food you could eat every night and be happy you had it. It’s not fancy or complicated for complications sake. Eat here. You won’t be disappointed.",
   "The restaurant is very small. The food was alright, but very overpriced. I got the brisket plate. I'm from Texas so, I guess I was expecting good brisket? What I got was more like roast. It really had no flavor, no spice, no bark no smoke ring. It was very, just....bland. and!!! AND!!! It was $18.00.. in Texas that's a $12.00 plate at best... not really impressed with what we got. For four people to eat including 4 teas the bill was $96.00!!",
   "I ate there twice so far and the service is great. The manager, she was great as well. She made sure that are orders were served to our liking. The foods there are delicious 👌",
   "The food was wonderful excellent presentation. I really enjoyed the Ohori coffee as well. Its a fun, old school 60s ish diner. Comfortable seating and great artwork"
  ]
 },
 {
  "name": "Los Amigos Restaurant",
  "address": "3904 Rodeo Rd, Santa Fe, NM 87507, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/263127dc-9334-11ea-81b0-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "music",
   "eat",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15873236170179354871",
  "source": "GoogleMaps",
  "reviews": [
   "Thank you for having good food. We have become a bit apprehensive about restaurants these days. This was not one of them. My friend had a guacamole burger and she said it was quite tasty. The onion rings were also very good, crispy on the outside and sweet on the inside. Now that is how an onion ring should taste. The salsa that started the meal had just the right amount of heat to it, not overly done. I ordered the Rellenos. Delicious. They had a sweet and savory taste to them. The beans were whole which I prefer and needed no extra seasoning. I had the chili on the side, just to be safe. Again, the heat was not overly done so you could actually taste food with the green and red. Service here was immediate and friendly. The atmosphere of the restaurant was cozy with no loud music, just the ambient noise. We will return here and try some of the other dishes.",
   "Customers beware!! The food is great here. However, I used a credit card that I only use every so often for work. I used this card to treat a client. That evening someone tried to use the card number to make an illegal purchase online. When I spoke to the owner to make him aware of the situation, He brushed me off like the mistake was mine. It just seemed odd that being as I never use this card. That someone tried to make a purchase with the card number that evening. Thank God they didn’t have the 3 digits or zip code. As I said. I enjoyed the meal. But can’t eat at a place that has shady employees. It’s great that he protects his staff but I was expecting the owner to reassure me in that he’d look into it so it doesn’t happen to anyone else.",
   "This was a awesome little restaurant. Fast service. The food was delicious and the HUGE sopapillas were like nothing Ive ever seen .",
   "A really nice restaurant with friendly employees.  The sevice is quick, no waiting on your meal and when the food arrives it's hot. They also have a nice menu to pick from and the cost very reasonable. And the restaurant is very nice, you will enjoy your evening there.",
   "I always visit this location when I am visiting Santa Fe from Denver. I always look forward to their Navajo taco and sopapillas. Excellent service and food. The prices are so reasonable."
  ]
 },
 {
  "name": "Sabor Peruano Restaurant",
  "address": "163 Paseo De Peralta, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/267d2542-9334-11ea-bf1c-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "delicious",
   "delicious",
   "eat",
   "food",
   "food",
   "food",
   "delicious",
   "tasting",
   "walking",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=6784992735689924122",
  "source": "GoogleMaps",
  "reviews": [
   "Such fun to experience the food and drink of a different culture.  Cute and colorfully decorated little place with a super friendly, efficient, passionate owner who bustles around the place with enthusiasm and positivity.  Best of all, they offer a terrific vegan, seitan version of their signature dish!  Kudos for helping everyone experience Peruvian food :-)",
   "Delicious vegan options, great service, nice shop!\nWe ate here as our first stop in Santa Fe and it was the best part of the city! We're vegan and were so happy to find they have a whole vegan menu. Everything we ate was spectacular and the ladies working were so sweet. I bought a few Peruvian items from their shop, as well. We'll definitely be back next time we visit Santa Fe.",
   "The food was delicious, the restaurant/shop was so cute and the staff was really nice, a wonderful little gem in Santa Fe.  I gave it four stars because the service was slow and it took them a little while to take our order, the prices are okay, paying $15 after taxes and tip for an appetizer. Overall, a good, clean, different place to eat at the De Vargas mall with a vegetarian menu!",
   "Wonderful experience - day brightening service, marvelous authentic Peruvian food will take you back to South America. Adriana is a delight. \nThe chicken-cilantro soup should not be missed.",
   "One of the things that I first noticed as I was walking by the Outdoorsman which is a business inside the De Vargas mall is a restaurant by the name of Sabor Peruano Restaurant. What first caught my eye was all of the Peruvian textiles and other colorful Peruvian items for sale.  With all of those items on the walls I thought what a great way to decorate the restaurant and also make income at the same time.  So I started to read about some of the menu items that were posted on the wall outside of the restaurant.  A lady came out and started talking to me about how good the food was  so I decided to try it. \nI ordered the pan fried trout. The dish was served by Adriana, one of the owners of the restaurant.  The dish was served hot and was just the perfect temperature for consumption. The texture of the fish was perfect and not overcooked. Trout is normally a boney fish so I carefully ate the top portion of the meat from the top of the ribs. I was then able to remove the entire backbone from the fish and all of the tiny ribs came out with the backbone. \nThis was a testament to how well the fish was cooked. (see all of my pictures). The flavor of the coating on this fish was the BEST that I have ever tasted. It was akin to that wonderful coating that is on Colonel Sanders chicken. It was unbelievably good.\nThe fish came with a gorgeous Mediterranean style salad that was so delicious and it had an exotic Asian tasting dressing that was out of this world. The dish also came with an ample portion of rice. \nI ordered a drink with my meal that was non alcoholic called Chicha Morado. It was very good with a not-too-sweet taste and unlike any beverage I've ever had. The entire meal was what I would consider gourmet quality. This is a sidewalk type cafe inside the De Vargas mall so I was very surprised.\nI was so excited about the quality of the food that I ordered dessert which I do not normally do. I ordered the Alfajores Peruvian shortbread cookie . It had a Carmel filling that was marvelous tasting and again the presentation was gourmet quality. Please check out my pictures. I hope that you enjoy this Peruvian Restaurant as much as I did!!!!"
  ]
 },
 {
  "name": "TerraCotta Wine Bistro",
  "address": "304 Johnson St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/26c4b5dc-9334-11ea-a052-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7081538094489775838",
  "source": "GoogleMaps",
  "reviews": [
   "Went around 4 pm. We parked and walked about 2 blocks up as parking is a bit scarce.  Restaurant was empty small and intimate but quickly filled up with other patrons. We ordered the mussles, Salmon and Rockefeller oysters all great choices. Met one of the owner's who also happened to be a New York Native. Great vibe and beautiful flower garden at the front of the restaurant.",
   "My wife and I are in town for three weeks. We have been to Terra Cotta three times and plan on going back several more times. The food is outstanding, the portions are generous,  and the service is perfect, especially  Whitney! Everyone we have dealt with has been excellent. This is a very good value for your money. They also have a great wine list with a lot to choose from. All glasses of wine are on sale for only $6 a glass until 6pm. \nYou really have to try this place! You will be very happy you did!",
   "We tried Terra Cotta during restaurant week and will be back.  The restaurant is small in size,  but cozy. There is a small bar area at the front of the building.  Extensive wine selection with prices for everyone. Food was flavorful with the perfect portion sizes. Staff was friendly and helpful.",
   "Fantastic! Wonderful food and service. Extensive wine list. The $6 glasses of wine in happy hour before 6pm are a great bargain.",
   "Awesome restaurant. The food is really good and unique, service is perfect and such a cute place. The restaurant is located in an old house and just so perfect for a relaxing dinner.Highly recommend!😄"
  ]
 },
 {
  "name": "Il Piatto Italian Farmhouse Kitchen",
  "address": "95 W Marcy St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/270604ba-9334-11ea-b1fa-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "eat",
   "delicious",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2404980754598643325",
  "source": "GoogleMaps",
  "reviews": [
   "The wine list is the best part about this restaurant. Recently had dinner here my partner's steak was delicious my Bolognese was  OK. The atmosphere, wine, and service we're very good. Almost 5 stars but not quite.",
   "This place is so delicious. I could eat there everyday its so good.  Service was excellent.  We ate outside due to a little dog. I loved every minute",
   "I stumbled into this restaurant by accident ... I was shocked at how delicious fresh and balanced everything is.  The staff is intelligent articulate and attentive... I will definitely visit again.",
   "Some of the best food we have had in a while ! It was delicious. The restaurant had a lovely atmosphere and the service was great!",
   "Fabulous!  One of my favorite restaurants in Santa Fe.  Cozy atmosphere with wonderful food."
  ]
 },
 {
  "name": "Cowgirl",
  "address": "319 S Guadalupe St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/274557ba-9334-11ea-bb65-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=2438432453223127250",
  "source": "GoogleMaps",
  "reviews": [
   "We love Cowgirl! Ever since we went, our toddler has been asking to go back. There’s a really awesome outdoor patio with a play area for kids. Such a welcome addition for families with kids!! I’m vegetarian, but the people I was with said the BBQ food was amazing! And I really enjoyed the veggie burger! Can’t wait to go back!",
   "1st time there.  Happy Hour prices were comparable with other places in Santa Fe. Service was good.  Food was good.  Had nachos, was good, added pulled pork,  was a little strange, for my pallet. Beers were good, as far as NM breweries. Ordered the regular Cowgirl Hamburger,  it was exceptional.  Best burger I've had in a while.  All around the experience was above average.  I would go back again.",
   "This place is a very fun experience. Tons to see, tons to taste. A very engaging atmosphere altogether with delicious food. We didn't have the most attentive service and it felt like it took a long time for all aspects of our visit.",
   "Huge menu with a wide variety of food. The margarita menu was a plus and might I say delicious. The live music was a nice addition as well as the oh so tasty dessert menu. I highly recommend eating/drinking here if you are in Santa Fe",
   "We like it a lot. Had not been there on about 10 years and wanted to get back. I thought it was the best burger in Santa Fe then and still do. The meat is top quality as is what they do with it. The menu is fancy and varied. The best they have is the simple stuff like chili, stew, and burgers. Fries I will have there and nowhere else so yup, been 10 years for that too.\n\nThe building is old and kinda creaky and can't be kept anisepticly clean. Look past that and chow down.\n\nI'm gonna nick em today for slow service but  don't take that too serious. My girl says it was speedy last time she was there."
  ]
 },
 {
  "name": "La Casa Sena",
  "address": "125 E Palace Ave, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2794effa-9334-11ea-87bc-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "free",
   "food",
   "food",
   "cheap",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=4355093837554356661",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice, comfy restaurant for higher end meals. I've been here 2 times now - the second time was for Restaurant Week. The service is great, the staff is very knowledgeable and helpful and the food is delicious. I had the kale wasabi salad, the pork osso buco and the tiramisu - all phenomenal and, surprisingly, larger portions. Things are clearly marked gluten free and have many options.",
   "Upscale menu, lovely and quiet. The food is so well-prepared and special! Please try the Roasted Poblano soup!!!",
   "Excellent in all respects--food, wine, service, and atmosphere. Not cheap but value is delivered. Solid five stars.",
   "Enjoyed the live music and great food in the cantina. A must visit for anyone who lives here or visits.",
   "Great selection, good prices!"
  ]
 },
 {
  "name": "El Farol Restaurant",
  "address": "808 Canyon Rd, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/27d72966-9334-11ea-b982-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "music",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=1873134799515533567",
  "source": "GoogleMaps",
  "reviews": [
   "We’re vegetarian and we always look for a good vegetarian food places. This was a decent place. We booked the flaminco dance as well. Dance was good, but the place was very tight, and the sound was very loud for that small place. Food was decent. Service was nice. Would recommend this place to go.",
   "We had so much fun at the dinner and Flamenco show. El Farol is the oldest bar in Santa Fe and is filled with character. From the staff (shout out to Molly), to the ambiance, to the soulful performances, it is truly a treasure. \n\nFun fact: El Farol started as stables, but the owners realized everyone was parking their horses to go drink, so they started slinging alcohol to amplify their income.",
   "Just what we needed. A light and flavorful selection of tapas dishes. We had the anchovies, shrimp, omelette, and Chicharrónes. Such a beautiful blend of flavors. \n\nNo live music tonight but we were fine with that. Only a few other diners there. Quiet ambience. \n\nI loved it here. \n\nParking across the street in the gravel lot.",
   "Excellent tapas, nice cocktails and amazing Flamenco dance show! Very nice bar to hangout. Walk around Canton road and go to the bar for snacks and cocktails! Highly recommended 😊",
   "Visited for lunch on a Saturday afternoon and had a great experience. The flautas and cubano were both great. The only possible downside is that Canyon Road is a very popular destination for locals and tourists which can make finding parking a bit difficult. There is a gravel public parking lot directly across the street but it fills up fast during the summer, especially on a weekend."
  ]
 },
 {
  "name": "Sassella Restaurant",
  "address": "225 Johnson St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2832de3a-9334-11ea-957a-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15978011912725263124",
  "source": "GoogleMaps",
  "reviews": [
   "The service here is excellent and the bread was delicious. Also, the food presentation and the table side service were both executed well.\n\nBut that's where it stopped being impressive for me. The squid ink pasta w/ shrimp while seasoned well was underwhelming in terms of flavor. The wild boar was delicious, and the presentation was spot on.\n\nThe desserts felt like they were all different variations on gelato and there wasn't an option that stood out.\n\nMaybe this was on us not picking the right menu items, but the feeling for all of us at the table was that the experience did not meet the price point.",
   "Interesting and less expensive menu for lunch. Delicious soups, flatbreads, salads and their 'signature' meatball sandwich. Friendly and helpful staff",
   "Amazing. Incredible attention to detail, nothing was missed. The wait staff was perfect, the sea bass was cooked to Perfection, the risotto was amazing, the wine recommendations were excellent. It was an excellent experience all the way down to the napkins Being A Cut Above from normal linen napkins. There was not one thing that was lacking, everything was excellent. And the price was not unreasonable. The duck dumpling with grapefruit appetizer was indescribable.",
   "Disappointing in many ways..  See the number of stars I gave it.  Attitudes in all the wrong places.  They should focus on good food and not showing up at the table every few minutes to primp or fuss and accomplishing nothing more than annoyance.  VERY disappointing..",
   "The chucuterie was the best! And the burratta a must!"
  ]
 },
 {
  "name": "Fire & Hops",
  "address": "222 N Guadalupe St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/28856b30-9334-11ea-ba71-14b31f159f22.png",
  "tags": [
   "creative",
   "drink",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13647157070541950565",
  "source": "GoogleMaps",
  "reviews": [
   "A friend of mine recommended Fire&Hops -- I'm glad that I got to try it over this past weekend; to simply put: we had a great first experience!\nIt's not hard to find Fire&Hops, however, it's pretty hard to find available parking near it. (Thank you for the tips that one can find on their website!) Their staff was great, they did their best to accommodate our requests and answer all of our questions. Their food and drink menu was interesting, a great selection of well-thought and creative items -- everything we tried was delicious. I'll be back!",
   "Decent beer list. Food was above average but nothing mind blowing. Service was mediocre at best. Glasses were dirty (please check before you serve a $7 beer in a glass with a random persons lipstick all over the rim). Kind of a cool little spot but I don't think I'll be back unless they up their game somewhat.",
   "This place has wonderful ambience! The bartender Noah was very fun to talk to, and made our time there more enjoyable. If you visit this place anytime soon, you’ve gotta try the Seasick Crocodile by Prairie Artisan Ales. It’s a Christmas sour beer that smells strongly of cinnamon, and tastes a lot like cider.",
   "It seems every time I visit Santa Fe, I go to Fire and Hops. Food is interesting and delicious. Great beer list. Josh had built something special here. One warning: no parking but street parking within a couple blocks is usually available.",
   "Really looking forward to Fire & Hops, such a tasty vision. And we found a kind, attentive staff.  Ordered the House Burger...chewy bun okay but it stops there...meat is filler...kinda tasteless despite the pile of grilled onions. No lettuce. No mayo. Okay, they did it their way. A disappointment. Salty fries did not make up for it. Gosh, not even a spicy bratwurst? Stick to the beer. We thought with a name like Fire and Hops there might be a bite but there was barely a spark."
  ]
 },
 {
  "name": "Santa Fe Bar & Grill",
  "address": "187 Paseo De Peralta, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/28c70838-9334-11ea-b9d6-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "food",
   "drink",
   "food",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12314583906420202223",
  "source": "GoogleMaps",
  "reviews": [
   "This is my first time here. The menu has a very wide selection of items from Mexican food to salads, etc. They had a very nice selection of margaritas on the drink menu. I had the Grand Gold margarita and it was very good. It had a decent amount of alcohol. For dinner, I had the chicken enchiladas. The black beans were delicious and the enchiladas had a nice flavor as well. I got the red and green, aka Xmas, sauce on them. I am planning to return at some point. \nI would probably rate it a 4.5 star if I could. The enchiladas were delicious but I have had better elsewhere but felt my overall experience was better than a 4 star so I gave it a 5. Not to mention, the prices are very reasonable.",
   "Best burger in town for its price. Friendly staff comfortable environment easy location. I am a chef. The burger I experienced was at the temp I ordered perfectly not over seasoned and quality beef ! The bun was buttery not dry or soggy, bacon was perfect the lettuce pickle tomatoes and onions crisp colorful and inviting the fries were golden perfection of crispyness. Salted perfectly . now the green Chile was what was the cherry on top of perfection. It had so much flavor and at the same time spicy and all that together plus the customer service and price ? Come on you can't beat that! I'll be back soon that's forsure!",
   "First trip to Santa Fe and it was Valentines Day so we knew places would be packed. The Hostess sat us and was nice. The issue was really the server. My wife asked the waiter about which margarita he would suggest. His response was, “That one right there” we both were confused and my wife asked which one? His response was “That one right there” so she just ordered whatever she picked. I thought there was a drink called “That one right there” Long story short waiter messed up the atmosphere plus the food wasn’t that great. Won’t be back.",
   "Great vegan food option. Amazing drink specials. Service always friendly and welcoming.",
   "Great food and great service!  I often come here when I’m in town and never disappointed. The locals come here too."
  ]
 },
 {
  "name": "Maize Restaurant",
  "address": "225 Johnson St, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/29150168-9334-11ea-bd12-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5822083012196792144",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent food and service, amazing experience! Tried the Duck Wings, pork, octopus, Elk and so so much more. Everything was exceptional. The waiter also had fantastic recommendations on everything from entrees to wine and beer, knew the food as well as the chef. Can't say enough great things!",
   "Some of the best food and service I experienced in Santa Fe.",
   "Good food and quality dishes. Loved the presentation.",
   "Great place to eat, we had the shrimp tacos, prime steak and the halibut and it was all delicious. The patio is great to sit out and eat but the inside has very nice decor also. Friendly staff, highly recommended!",
   "It was a beautiful place.. the back patio was very beautiful!! The food could be better.. the prices were outrageous for the food.. the staff was rude and not attentive. I probably would not order food again. "
  ]
 },
 {
  "name": "Santacafe",
  "address": "231 Washington Ave, Santa Fe, NM 87501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/296935d2-9334-11ea-8b84-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12521951723838542047",
  "source": "GoogleMaps",
  "reviews": [
   "Always a great place to grab a bite. The bar is great; take a walk over the well if you’re not superstitious!",
   "Stunning environment. Food was excellent. Drinks were Amazing. Staff was pleasant. Make reservations for the patio by the fountain. Have the Mr. Valentine cocktail and you can't go wrong with anything on the menu. Absolutely marvelous place.",
   "One of the greatest dining experiences of my life. Sean took excellent care of us. Our glasses were never empty, he knew the wine menu like no one behind the bar had in my 30 years of life and the Chef joined us for a perfect pairing for our desert.\n\nHats off. Thanksgiving will never be the same after a night with Dale’s cuisine and Sean’s journey through the vineyards.",
   "The food was good, but cold and the restaurant itself was cold as well. The staff was great, especially the woman with the long dark hair.\nI will definitely return, but will definitely  ask that the food be warm.",
   "Ah-mazing food! Chef Dale Kester brings it! Beautiful atmosphere - service was great!"
  ]
 }
]