[
 {
  "name": "Lincoln Home",
  "address": "413 S 8th St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/29ae555a-9334-11ea-8cf5-14b31f159f22.png",
  "tags": [
   "walk",
   "tour",
   "free",
   "tour",
   "tour",
   "historic",
   "history",
   "family",
   "history",
   "knowledgeable",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=9890130689964127317",
  "source": "GoogleMaps",
  "reviews": [
   "The street of Lincoln's house was closed which made it very pleasant and easier for taking pictures. Also, if the tour was full and couldn't get to go inside his house, you could still visit the neighbors' houses which were full of facts and preserved subjects. All for free. The parking was only a minute walk from the house, super convenient. Worth the time.",
   "What a fabulous experience.   The whole block is managed by the National Park Service.   You have to go to the visitor's center to get tickets to go on the tour of the home, but it is well worth any wait.   Our park ranger was great and the tour was just wonderful.   We did a full review on our blog site and YouTube channel.",
   "So, I love history. Especially American history. If you are like me or even just lukewarm on things like this, than I highly recommend visiting the Lincoln home. \n\nThe tour guide was thorough and also quite witty. The house is in great condition and unlike Washington’s Mt. Vernon estate, photography and filming are both allowed inside the Lincoln home. I believe there was a very small cost associated with visiting the home. Maybe $2 and you get your tickets at this little Lincoln Home historic park site building not far from the home. This is also where you park and the $2 might only have been for the parking, my memory is unfortunately not clear on that any longer. \n\nIt was quite a thrill picturing the Lincoln’s in their home for things like Christmas, birthdays etc. There is much of the inside and outside of the home that is original.",
   "Love this place been there many times,with my Children when they were young and now with my oldest brother now that we're both retired. History in your face!.. You get to ponder the life of or greatest President and see were by he lived and loved his family! before the weight of the Presidency and the war to save are United states was placed upon him. The place were he was a regular guy... I recomend it for every American and a great place for foreign visitors to see what America is all about!",
   "Fabulous place to take a tour. The rangers are nice and quite knowledgeable. If you go in the winter they put out furniture and objects that they don’t have out in the summer. There’s a movie, a quite expansive visitors center, and a gift shop as well. Parking is $2 per hour or you can use street parking."
  ]
 },
 {
  "name": "Washington Park",
  "address": "1501 S Grand Ave W, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2a0c2d12-9334-11ea-94b4-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "hike",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9774915587780534073",
  "source": "GoogleMaps",
  "reviews": [
   "We live close by this park and we love it. It's beautiful to drive through during the holidays. The playgrounds are great for kids. A beautiful, clean park to enjoy. Can't wait for spring. What a gem.",
   "Very cool place. The rose garden and greenhouse are not to be missed. Make sure you are paying attention to the signs when you drive in, it can be a little confusing getting around the one-ways if you are not paying attention.",
   "One of my favorite places in Springfield. It's a great place for a walk the dog, jog, bike. Go for a short hike. Feed some ducks. And apparently fish. It has a decent size playground. Tennis courts and if your lucky you'll get to see a deer family.",
   "Great place to do all kinds of family oriented activities and personal exercise. Wonderful large areas for picnics or even a peaceful place to relax and read or have personal time. Has great options of things to do and see throughout the park. Beautiful places for photography and weddings. The Carrollon is beautiful as well as the gardens around it. The large ponds are great for letting children feed ducks and catch n release fish. An all around great park within Springfield",
   "BEAUTIFUL PARK!!! ITERTAIN YOUR SELF, JOGGING,WALKING,SITE SEEING? NICE HISTORICAL PARK."
  ]
 },
 {
  "name": "Old State Capitol",
  "address": "526 E Adams St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2a5b1088-9334-11ea-ad87-14b31f159f22.png",
  "tags": [
   "history",
   "walk",
   "kids",
   "free",
   "art",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9738902149858672105",
  "source": "GoogleMaps",
  "reviews": [
   "I’d recommend visiting because this building is a snapshot in time. It was used for only a short period before the “new” state house was built. Also, it was built before electric or gas light, which is interesting to see from an architectural point of view (the windows are incredible). \nThere’s a lot of interesting memorabilia and the staff is friendly. \nIt would probably benefit from better signage but the staff is happy to answer questions and give the rundown on the building.",
   "Amazing historical landmark! The place could use a little love on the maintenance end. I get that the building is older but they still have plenty of guests coming to visit and could stand to at least fix the stalls in the restroom. None of the stall doors locked properly and even had hand written notes to NOT lock them.\n\nIt is still a place that always leaves me in awe to think of the amazing history that was created there.",
   "This was our first year visiting during the Christmas  season.We did a free carriage ride that provided warm blankets. We visited the Old State Capitol where  we were greeted by Santa and  Mrs Claus who handed out candy canes. Crafts and old fashioned toys for the kids to enjoy...hot cocoa and yummy treats as you walk down the streets. Smiling faces and Christmas cheer to keep you thru the rest of this year.",
   "We stay the last august on our honeymoon. It was a very good hotel our stay was fantastic and they take care of every detail. It's a very good option here because not all the hotels are very good. I hope to go here for our other visits.",
   "Very nice place. The art and the design of the building is superb. It has a lot of history while still being able to be modern. The old state capitol is also a good place to visit if you wanna see another piece of Illinois History. Easy parking and very nice staff."
  ]
 },
 {
  "name": "Illinois State Museum",
  "address": "502 S Spring St, Springfield, IL 62706, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2aa78314-9334-11ea-8578-14b31f159f22.png",
  "tags": [
   "history",
   "music",
   "history",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=8273753337783112727",
  "source": "GoogleMaps",
  "reviews": [
   "The museum was amazing. My wife and I learned a lot from going there. We went about a hour before close and the museum was basically empty which was really nice because we were able to take lots of nice photos and spend as much time as we wanted at each part of it. I really wish we were able to see the full rock and rolled exhibit that is coming but we were only able to see part of it. Would recommend for anybody who enjoys museums to go here!",
   "It is very easy to find a Lincoln related historical site in Springfield. You can basically find one on every corner. This museum is about all the history outside of Abe Lincoln. Which is a fantastic thing. This hidden gem of a museum is a must so for locals an visitors alike. The entrance fees are very reasonable and the value for the money is fantastic.",
   "Museum after hours was a lot of fun! Had a good beer and learned about some new games from the folk at Titan Games. Good music as well!",
   "Good place to visit for anybody who is interested in science or history. At the time of my visit the place was almost empty. Have been living in Illinois for a long time yet I learned a lot about history of this state. Some historical facts were actually very surprising for me.",
   "Nice way to spend some time. My 2 kids liked the main floor. The upstairs is more for adults and the basement is now for small kids."
  ]
 },
 {
  "name": "Washington Park Botanical Garden",
  "address": "1740 W Fayette Ave, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2ae8f924-9334-11ea-84b2-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=14577704000296768815",
  "source": "GoogleMaps",
  "reviews": [
   "The Washington Park Botanical Garden is a great way to relax and unwind. You will be able to see exotic plants indoors, walk through a rose garden, and be able to enjoy the Thomas Reese Memorial Carillon.",
   "The park is amazing and the garden is beautiful. It was not as big as I thought it would be though it was relaxing and peaceful to walk around. I would go back again.",
   "The staff at the botanical gardens are always ready and eager to accommodate our group. They set out tables the way we request and the exact number of chairs, while allowing us access to more if we need them. The kitchen is perfect for our needs, and the updates are gorgeous. I wish I had taken before and after pictures. Thank you, Springfield Park District and the Botanical Gardens staff for all you do for the Iris Society!",
   "Great place to walk. Make sure to see the Greenhouse!",
   "Building open 12-4. Grounds I would say are sunrise to sunset.  Grounds are immaculate.  Stunning. A public park which has no litter, graffiti, the paths are absolutely perfect.  or even a leaf out of place. Very Impressive.   (A drinking fountain or faucet would be nice.  Though the cold weather in winter likely makes such a desire unlikely.)"
  ]
 },
 {
  "name": "Southwind Park",
  "address": "4965 S 2nd St, Springfield, IL 62703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2b34cf76-9334-11ea-9473-14b31f159f22.png",
  "tags": [
   "parks",
   "kids",
   "walk",
   "kids",
   "kids",
   "family",
   "organized",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=2593804724081444759",
  "source": "GoogleMaps",
  "reviews": [
   "I always forget about this place due to its location. You just can't see it from the major thoroughfares. That aside this is one of the nicest parks in the region. Ample parking. Clean and well maintained grounds. Room to spread out and run around. The pavillion is an added bonus for larger more formal functions.",
   "Beautiful park! Great for pictures or for kids to play.",
   "Love the place.. perfect for weddings or large group events! A few months ago we were able to have the suicide walk here and they let my group lead the way.. they supported us because the loss of our friend was still fresh so they wanted to do as much as they could for us. Its also a great place for kids to run around and play",
   "Southwind Park is relatively new and very well kept. There are multiple playgrounds, a stocked pond, a splash pad and plenty of places to sit. Several pavilions offer space to gather and there are bathrooms that are clean and accessible. The paths in the past are smooth concrete, making it great for strollers, bikes, and wheelchairs. I feel like this is probably the best park in Springfield if you are in a wheelchair.\nThe downside to it is that this park is pretty out of the way, being on the southern edge of Springfield.",
   "Great, big ,organized park. Many places for kids to play(grass and playgrounds) many pathways for walking. Very family friendly and safe place."
  ]
 },
 {
  "name": "Dana Thomas House",
  "address": "301 E Lawrence Ave, Springfield, IL 62703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2b80576e-9334-11ea-bf7d-14b31f159f22.png",
  "tags": [
   "learn",
   "tour",
   "free",
   "history",
   "tour",
   "free",
   "tour",
   "learn",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=14745026396295068245",
  "source": "GoogleMaps",
  "reviews": [
   "If you're visiting Springfield this is definitely a free fun tour to do. Although i recommend a donation for they rely on the generosity. Frank Lloyd Wright's architecture and eye for design is something you need to see for yourself. You also learn a lot about the house's history and how it is involved with Springfield. Ms. Dana has an amazing history of her own as well.",
   "Fabulous example of Frank Lloyd Wright's architecture, beautifully restored.  Be sure to visit during the Christmas season when it's beautifully decorated for the holidays!",
   "Beautiful architecture, great tour guide, a fun indoor activity for Springfield, IL. I like that the entry fee is a donation of your own choosing. FYI free parking is available specifically for the Dana Thomas house in a lot off of Cook St.",
   "This place was super cool. I'm not a big architecture buff and I don't know much about Frank Lloyd Wright, but I loved this house. I would never want to live there b/c it's just not my style, but I so appreciated how integrated the house was together, how purposeful everything that was included was, and all of the architectural details and sight lines. And to think he built that style of house in 1902, people must have thought he was utterly insane. It looks so different from other stuff that was being built at that time.\n\nThe tour is well worth the time and the donation they suggest and I would highly recommend it to anyone in Springfield for a visit.",
   "This home has been ingrained in my memory ever since I took my first tour 10 years ago. It is a magnificent home and a true treasure. It goes without saying that FLW was a remarkable architect and it is evidenced by this house. This is treat for any person who loves architecture in any form. In addition to the house, the woman behind it was very interesting and I loved the information you learn about her on the tour. This is a MUST when coming to Springfield."
  ]
 },
 {
  "name": "Lincoln Memorial Garden and Nature Center",
  "address": "2301 E Lake Shore Dr, Springfield, IL 62712, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2bc8f95e-9334-11ea-89f5-14b31f159f22.png",
  "tags": [
   "nature",
   "walking",
   "walk",
   "knowledgeable",
   "nature",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2744605965185979466",
  "source": "GoogleMaps",
  "reviews": [
   "A great place for nature walking and enjoying Lake Springfield. There's enough trails that it never feels crowded. Possible to see deer.",
   "Took a long walk around the property. Estimate 10,000 snow geese on the lake. Awesome sight! Visitor center was fun to visit. Staff was knowledgeable and nice to visit with. A good thing to do on a sunny winter day!",
   "For what it has and what it is, it does it well. Navigable trails of mostly wood-chips. Along the lakefront. Picnics allowed. Restrooms in nature center during open hours and in prairie area. NO DOGS (try Carpenter Park).",
   "Nice garden area with multiple trails.  The Visitor Center was pleasant and staff was helpful with maps and interesting information about the history of the area and suggestions for future visits.",
   "It was very nice! The weather was perfect for it! Our girl scout troop was very happy."
  ]
 },
 {
  "name": "Lincoln Home National Historic Site Visitor Center",
  "address": "426 S 7th St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2c219686-9334-11ea-b327-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "historic",
   "history",
   "family",
   "history",
   "walking",
   "free",
   "parks",
   "learn",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=4357630626473842460",
  "source": "GoogleMaps",
  "reviews": [
   "If love history and learning about what it might have been like in Abraham Lincoln's time, this is definitely a most see in Springfield.  It's very well preserved and they make it fun to walk about  on the wooden sidewalks  in the  area. It was  a beautiful perfect day when I went.  It's very charming.",
   "Fantastic place to visit.  When someone thinks of visiting Lincoln's home you will be surprised to find more than just the house that he lived in.   Because this historic site has 2 blocks of preserved homes (with some people dressed in period clothing) you have a feeling of going back in history.  The only thing I would like to see is to have each historic home being furnished with period furnishings.  A number of the homes were filled with signs and photos  explaining some of the history.  Lincoln's home was filled with Lincoln's belongings and furniture - very nice!!",
   "Great place to go by yourself or a family outing. Love walking through the old houses. Good way to destress thinking about older, simpler days. Rich in history.",
   "The only home that Abraham Lincoln ever owned is truly a national treasure. We are so lucky in Springfield to have this.  We can thank Robert Lincoln for it being free most other national parks to my shock when I visited them.  We can thank Robert Lincoln for it being free most other national parks to my shock when I visited them charge you to visitIn 1887 when he gave it to the State of Illinois he stipulated that no fee would ever be charged.  Is a joy to visit and the visitors center and the surrounding neighborhood always have something interesting and new to tell us.  Here there are various special programs including trick or treating and other speakers and activities.",
   "The well-preserved home and neighborhood of the best president this country ever had. The man devoted to saving this great nation once lived here as a lawyer, and his house is open for tour. Great, isn't it? Anyway, hit the visitor center to learn about all things Lincoln, and you may even get to hear a speech by a great Lincoln impersonator. I thought I was hearing the speech from the man himself. A great experience!"
  ]
 },
 {
  "name": "Elijah Iles House Foundation",
  "address": "628 S 7th St, Springfield, IL 62703, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2c6c9b86-9334-11ea-a6bb-14b31f159f22.png",
  "tags": [
   "unique"
  ],
  "link": "https://maps.google.com/?cid=8808738653881511741",
  "source": "GoogleMaps",
  "reviews": [
   "Our host was so delightful as she took us through the entire house, pointing out all the important details and the assorted household items. We learned about the founder of Springfield, Senator Iles, while touring his 182 year old house. It has been preserved so well.",
   "Beautiful!  A great place to visit. A nice addition to the preservation of Lincoln's life and time in Springfield, IL.\n\n**Note: Lincoln's birthplace is actually in Kentucky.",
   "There is also a museum of Illinois Watch Company in the basement of the house.",
   "A unique glimpse at living in early Springfield and an amazing clock and watch museum downstairs.",
   "An amazing glimpse of the lives of Springfield's earliest residents."
  ]
 },
 {
  "name": "Knight's Action Park",
  "address": "1700 Knights, Recreation Dr, Springfield, IL 62711, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2cbbf630-9334-11ea-addc-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "family",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13791550513527514465",
  "source": "GoogleMaps",
  "reviews": [
   "We had a great time! Would've been better if fully staffed & everything open! (I LOVE paddle boats. (It was closed.) I hate seeing kids pulling double duty on a \"fun\" summer job!)",
   "My 6 year old loves Knights! Especially the wave pool and kids slides. It's just big enough that it has never been super crowded and there are life guards everywhere. They offer some really good deals on admission tickets thru their website which is helpful when you're paying admission for several people. Would like to see lockers placed throughout the park instead of just the entrance. Overall, we love spending our summers at Knights!",
   "One of my most favorite places in the world! The whole family can hang out here, regardless of age, and feel safe and have fun and meet all kinds of new friends. I look forward to Knight's every year!",
   "I used to buy season passes every year until 2011. Then I can back to visit for the summer. We got the passes again. We have been 4 times so far. It has been great for my 2 year old. The park has an area for everyage to play.  They have 7 slides for bigger kids. Wave pool splash kingdom, paddle boats, seal bay, and lazy river. They have 5 dinning areas. They also have a bar with video gaming. They have golfing and batting area as well. Food and drinks are expensive but good. Bathrooms in the water park are gross!!! Slush mud water all the time. The front lobby bathrooms  ear arcade are nice and clean. The kids have fun everytime we go!! Season passes are worth every penny.",
   "We get season passes every year. If you go four times it usually pays off the pass.\n\nStaff is very friendly and helpful.\n\nThe only thing that stinks is it's crowded on super hot days."
  ]
 },
 {
  "name": "Illinois State Military Museum",
  "address": "1301 N MacArthur Blvd, Springfield, IL 62702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2cfe2f62-9334-11ea-bb1c-14b31f159f22.png",
  "tags": [
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=6420910422513901679",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome museum that is a best kept secret.  And today with all the reenactors putting on trench skirmishes, and the professor giving a great informative lecture, and the couple from a Wheaton museum that shared their wares and info....it was a great day!",
   "Really great display of fabulous military articles. Truly impressive.",
   "We are so glad we stopped in. Truly a very nice museum with informative artifacts and collections from the various wars. The location is off the beaten path but it's absolutely worth it. Our 3 kids were engaged and asked interesting questions about each exhibit. The museum is continuing to expand and add new items. Excited to support this museum and our veterans who take the time to engage with students in educational workshops and tours.",
   "Great museum and awesome hosts for the 29th anniversary of the end of Operation Desert Storm.",
   "Great museum. We learned so much while visiting. Had a good question and answer session with an actual helicopter pilot that was so nice. The museum is done well and informative. I would recommend checking this place out. Donation requested, other wise it's a free museum."
  ]
 },
 {
  "name": "Abraham Lincoln Presidential Museum and Library",
  "address": "112 N 6th St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2d3ac352-9334-11ea-8651-14b31f159f22.png",
  "tags": [
   "library",
   "learn",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16192564841112465264",
  "source": "GoogleMaps",
  "reviews": [
   "To be clear- the law office and the presidential library are at different locations. The law office is at the old state house plaza. \n\nThe law office building has been meticulously restored, and the re-created law office and post office are now located on the ground floor. \nI’d say this is a must see for lawyers; I would recommend it to everyone since it is not large and quick to see. \nThere is also a Springfield/ Lincoln visitor center at the law office location.",
   "Very well done museum.  From Lincoln's early years to the very end, the displays we're well out together and interesting.   Easy to spend 3-4 hours.   Although, at the time of my visit, the sculpture in front of the museum was rather odd, I did learn about the back story, so it made more sense.  I would say kids under 10 might not be so interested.    Also, if short on time, start with the White House years.",
   "Both moving and deeply felt, the A Lincoln Pres Museum does not merely portray his presidency. It shows us, in depth, the path Lincoln took from his youth to old age and the making of America's bold, steadfast civil wartime president and how he kept the union together. Be prepared to be challenged, be enlightened and be galvanized by the undying memory of our 16th president.",
   "Loved how the Museum was set up. Very informative and interesting.",
   "The Presidential Museum is beautiful!!!! A perfect tribute to our beloved President Lincoln!!!!! But l do have a couple of suggestions for improvement if l may! Let's get real here let's keep the political correctness out of this museum built in honor of the Greatest President of the United States of America and the greatest human being that held this office!!!! Why isn't there any displays of Civial war firearms and sword's in the room were all the verious Civial war uniforms are displayed? After all the Civial war wasn't fought by throwing rocks at each other!!!!! The other thing is the room where the President is laying in state! The casket, the funeral tent the lights everything is right on with the picture except There should be  a wax figure of President Lincoln's body in the casket and two Civial war soldier's standing by the casket!!!! Every major city from Washington DC to Springfield the funeral train stopped where  he layed in state the casket was open!!!! This is just reality and constructive feedback!!!!!"
  ]
 },
 {
  "name": "Thomas Rees Memorial Carillon",
  "address": "1740 W Fayette Ave, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2d838e78-9334-11ea-ac75-14b31f159f22.png",
  "tags": [
   "learn",
   "tour",
   "walk",
   "kids",
   "pets",
   "music",
   "kids",
   "free",
   "wander",
   "walking",
   "knowledgeable",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=12658339442872241439",
  "source": "GoogleMaps",
  "reviews": [
   "Tour of the Carillon is well worth your time. You learn a lot. Thanks for the tour, Ethan!",
   "A beautiful memorial in the Washington park area near the botanical gardens.  The music with the bells is amazing and plays quite often.  A good place to bring the kids and pets for a walk, and sunset is especially clamoring if you're looking for a good date around town.  The fountain is dormant now but should be running soon (currently it is may)",
   "We took the kids to hear the free carillon concert at 1pm. It's a very nice park with plenty of benches and gardens to wander through while listening to the bells. There is also a video screen at the base of the bell tower so you can see the carillon player during the concert. Tours of the tower are available for a small charge when the bells aren't being played. This was a fun little break from all the historical attractions in town.",
   "Concerts are awesome in the summer time and such a great sound to hear while walking in the park.",
   "We were lucky enough to be in Washington Park when the Carillon was open for tours.  The tour guide was very gracious and patient with our children, in addition to being very knowledgeable.  The tour is succinct, delivering interesting information in an appropriate length of time.  We would highly recommend it for anyone seeking to know a bit more."
  ]
 },
 {
  "name": "Air Combat Museum",
  "address": "835 S Airport Dr, Springfield, IL 62707, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2dcf169a-9334-11ea-953d-14b31f159f22.png",
  "tags": [
   "free",
   "tour",
   "history",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=4248294950107928870",
  "source": "GoogleMaps",
  "reviews": [
   "All the aircraft in this museum as airworthy and restored in immaculate and pristine condition. So worth the time to go see it!!",
   "This is a place right near the Lincoln tomb so if you are visiting the tomb swing by this place. This is someone's connection that they are sharing with the public and wow it is a fantastic collection. It is free to enter but you can make a donation if you wish to. They had some cute cats running around and they just laid on the floor in front of me wanting to be pet. Some of the planes are open that you can sit in and take pictures. I will come here again that's for sure.  This is on my list of places to see in Springfield if you are there... check it out. Any questions just ask!",
   "While in the area to tour the Lincoln Monument, we saw the Air Combat Museum on the map and stopped by.  What an interesting working museum! The young man, sorry I can't recall his name, was extremely knowledgable of the history and/or a story of each plane, and there are quite a few.  A a mixture of aircraft-Mustang;  one of the last, if not the last air worthy Corsair; a MIG, an acrobatic plane and several others.  Thanks for keeping the history alive!",
   "It's a real treat to see this especially right here in Springfield. Good job 👍",
   "Jeff Kromer is the best.\nSo knowledgeable, so generous of his  time.\nThank you sir."
  ]
 },
 {
  "name": "Springfield and Central Illinois African American History Museum",
  "address": "1440 Monument Ave, Springfield, IL 62702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2e1d9a46-9334-11ea-b17a-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "historic",
   "history",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1768790557336526442",
  "source": "GoogleMaps",
  "reviews": [
   "The place was a little small but full of great historic information. The guide was very nice and knowledgeable she made sure we received all the information and answered any questions we had. We will definitely have to come back.",
   "It's a great beginning. But, it needs more stuff, and more contributions.",
   "The staff here are not your ordinary museum staff but great historians in thier own right. I'm proud of my home town for having grown enough in culture & diversity to even have this museum in the first place. African-american history is history. There should be no separation or distinction necessary and it's just as important for non African Americans to know true all inclusive history as it is for us.",
   "Great exhibits, especially the ones dedicated to African Americans in early Illinois. Had a great experience, and I definitely left with a desire to learn more.",
   "I attended the grand opening in the summer of 2018. ILLINOIS has a particularly profound African American history that changed the course of the country and thus the world. From President Abraham Lincoln, to President Barack Obama and the nasty 1908 race riot, the catalyst for the NAACP, providing legal protection against racism. This museum offers this history, in addition to special events, such as the annual gala honoring local contributions to the community."
  ]
 },
 {
  "name": "Union Square Park",
  "address": "500 E Madison St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2e65050a-9334-11ea-8572-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=10762076248029850303",
  "source": "GoogleMaps",
  "reviews": [
   "This is a cute little park in the middle of town, with statues, benches, a bench with a sitting Lincoln statue, pretty landscape and furnishings, plus the picturesque Union Station as a backdrop. Can't go wrong for a place to hang out for a rest or chat.",
   "Very beautiful! A must see! If been to any older city like in the east coast this a must visit!",
   "Shady, cool & restful.",
   "This remodel was very well done. Beautiful landscaping. Great stop before or after visiting the museum.",
   "This is a small urban park designed mainly to just chill in which from personal experience does just that."
  ]
 },
 {
  "name": "Springfield Art Association/Edwards Place Historic Home",
  "address": "700 N 4th St, Springfield, IL 62702, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2eadcad4-9334-11ea-9fb0-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "historic",
   "history",
   "art"
  ],
  "link": "https://maps.google.com/?cid=6075124226008536800",
  "source": "GoogleMaps",
  "reviews": [
   "So amazing how much they care about the arts in Springfield!",
   "Had a great time! Thanks Poppy 😁",
   "We just had our wedding ceremony at Edwards Place and they were fantastic to work with. Very flexible with requests and prompt in responses to emails and calls. The venue presents a stunning setting with the rich colors and antiques. Our guests were wowed by it. I highly recommend working with them!",
   "Really, really awesome! So much going on and tons of ways to get involved! Love it!",
   "This place is a fun combination of local artists, and local history. One side was the Springfield Art Association, and they had a gallery setup with pictures and sculptures from local artists. Walk through the next door and you are in the historic Edwards family home. They actually have the courting couch that Mary and Abe sat on together.  There are certain pieces that have been completely restored, others from the time period, some the actually belong to members of the Edwards family, and then you have the fun game of the wallpaper. Pieces of the original that are still there, right next to the accurately recreated brand new wallpaper. It's fun and shows just how much time they have taken to restore this home."
  ]
 },
 {
  "name": "Cathedral of the Immaculate Conception",
  "address": "524 E Lawrence Ave, Springfield, IL 62703, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2f02d234-9334-11ea-a750-14b31f159f22.png",
  "tags": [
   "art",
   "history"
  ],
  "link": "https://maps.google.com/?cid=5112918377951072673",
  "source": "GoogleMaps",
  "reviews": [
   "An absolutely beautiful Cathedral of the Roman Catholic Church, the Diocese of Springfield in Illinois. It is the home of our Bishop Thomas John Paprocki. I would invite anyone interested to attend one of the Masses held there either on weekdays or weekends. \nEasy access. Friendly parishioners. Close to downtown. \nI'm not well versed in church design, so I can't describe it properly. Well worth the effort to see.",
   "I'm not a Catholic or anything, but I came here to see my boyfriend perform a trombone piece. The building was absolutely amazing to observe with beautiful at architecture and acoustics.",
   "This is Mother Church of our diocese.   The windows are filled with beautiful stain glass windows.  One that includes Abraham Lincoln.  A great place for Mass, and prayer.  The Masses and ceremonies with the Bishop are always a very impresive.",
   "Beautiful, restful small cathedral.",
   "A beautiful, restful place of prayer. Confessions and Mass are offered daily. Sometimes I enjoy just coming to sit and pray in the middle of a hectic day. For the art inclined, the mosaics are okay but the windows are worth a stop. Many depict events in the history of the diocese and have themes and images somewhat unexpected for a church.  The organ was just refurbished and offers great, full sound to accompany either Mass or one of the concerts offered in the space."
  ]
 },
 {
  "name": "Vachel Lindsay Home",
  "address": "603 S 5th St, Springfield, IL 62703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2f547536-9334-11ea-a06e-14b31f159f22.png",
  "tags": [
   "historic"
  ],
  "link": "https://maps.google.com/?cid=15461849549889504293",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely historic home, they also host social events and camps",
   "Pure Frank Lloyd Wright, way ahead of his time",
   "Who doesn't love poetry?",
   "The staff know their stuff. If you are a literature buff or just dabble with poetry, I would highly recommend checking out the \"poets in the parlor\" events!",
   "Hidden treasure in Springfield"
  ]
 },
 {
  "name": "Proud Raven Totem Pole",
  "address": "101-199 W Edwards St, Springfield, IL 62756, USA",
  "avg_visitor_review": "",
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2fa7ce54-9334-11ea-b222-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=4707301671547116491",
  "source": "GoogleMaps",
  "reviews": []
 },
 {
  "name": "Margery Adams Wildlife Sanctuary",
  "address": "2315 E Clear Lake Ave, Springfield, IL 62703, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2ffd2f8c-9334-11ea-aecf-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "walk",
   "walk",
   "pets",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=947422588411924035",
  "source": "GoogleMaps",
  "reviews": [
   "Great nature preserve. Fun to walk or just sit and see what shows up at the feeders.",
   "It was peaceful",
   "Was there for a wedding. The site has adequate parking for a small party. The conference room we used had a bank of floor to almost ceiling windows so we could enjoy the many birds feeding at all the various feeders just outside. Acoustics for speaking were very good. Facilities (bathrooms, kitchen, etc.) were very good.",
   "Lived here all my life and never knew these trails existed.  Less than a mile from downtown it is a great place for a relaxing walk.",
   "Great place to take a walk with your pets.  Lots of nature"
  ]
 },
 {
  "name": "Lincoln Park",
  "address": "1601 N 5th St, Springfield, IL 62702, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/30424efa-9334-11ea-9ffd-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "walk",
   "knowledgeable",
   "art",
   "history",
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=111197076172856260",
  "source": "GoogleMaps",
  "reviews": [
   "A really great place to walk.  There is a playground area, with picnic areas.  There is a beautiful pond with fish, turtles, and frogs.  There is also an exercise area at the top of the park.  A lot of all weather exercise equipment on a nice cushy flooring.  Once the weather warms my family and I plan to use the equipment.",
   "Good place to visit for anyone who is interested in history. There was a very knowledgeable guide inside the Lincoln Memorial. Clean restrooms are on the left side of the parking by the Memorial. The whole cemetery seems to be old and worth walk around; lots of old grave markers. Some of them are so beautiful like the museum quality art and seem out of place, like those few ancient Greece style columns on the other side of the drive leading to the parking lot. The cemetery is, in my opinion, well kept.",
   "This was a beautiful stop. Clean bathrooms. Well kept lands. Playground is great for toddlers and bigger kids.  The pond area is peaceful and well kept.",
   "Lincoln Park is peaceful and spacious. Great open spaces, ponds, playgrounds, ice rinks and all the rest. Best disc golf course in the city (in my opinion).",
   "It's just really nice to go sit by the water they have ducks and little waking areas, they have a park and gazebos to have cook outs.... Allot of people go use it to exercise bike, walk , run. Then you have the Nelson center there too with the pool open during the summer and the ice rink is all year round"
  ]
 },
 {
  "name": "Grand Army of the Republic Memorial Museum",
  "address": "629 S 7th St, Springfield, IL 62703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/309a0c48-9334-11ea-803a-14b31f159f22.png",
  "tags": [
   "learn"
  ],
  "link": "https://maps.google.com/?cid=12925579695281106412",
  "source": "GoogleMaps",
  "reviews": [
   "Not as widely known as the other Land of Lincoln stops, this wonderful museum pays beautiful and honorable tribute to those who have served our country both on the front lines and at home when the wars were over in support of those who served. Please stop in. Give a donation.",
   "Definitely not what I expected. This is a museum run by people who have a passion for the Grand Army of the Republic. See all sorts of civil war memorabilia. Ask questions. Learn something new. I highly recommend visiting this gem.",
   "Really nice museum, just down from the Lincoln home",
   "enjoyable 30 minutes",
   "A really small museum, run strictly by volunteers and donations, which honors Civil War vets.  Check hours and days open."
  ]
 },
 {
  "name": "Stuart Park",
  "address": "1800 Winch Ln, Springfield, IL 62702, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/30e82c70-9334-11ea-a6a4-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=10766163024558182751",
  "source": "GoogleMaps",
  "reviews": [
   "Great area to socialize your pet.",
   "Great place to bring your pups....",
   "A very nice place to visit.  For man and four legged friends alike.",
   "We had a blast at the dog park for Halloween fundraiser for APL a couple of weeks ago.",
   "Great place to let your dogs run and have a good time"
  ]
 },
 {
  "name": "Iles Park",
  "address": "2000 S 6th St, Springfield, IL 62703, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3138e488-9334-11ea-82f6-14b31f159f22.png",
  "tags": [
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13171275608118997761",
  "source": "GoogleMaps",
  "reviews": [
   "Nice park. I walk through here from time to time.  If I live closer I would visit more.",
   "Great pickleball courts.",
   "Very good park to go to  been around it for 25years 👌",
   "Pickleball Heaven!",
   "Iles Park is a place for everyone...tennis courts, pathway for walkers or bikers and a play area for children and big kids alike. There are swing sets and plenty of area to soak up sun and do your own thing. The park is located on a main street the play area is about a 100 ft away. I love it because its near me and not only do I play catch with my son/daughter...I can watch my 5 year swing her heart out on the monkey bars (their actually short enough)\n\n So yes Google I visited quite a few times and I always have a great experience today was worth writing a review...thanks for letting me know, you know, where I am......all the time!"
  ]
 },
 {
  "name": "Lincoln Depot",
  "address": "930 E Monroe St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3192ec0c-9334-11ea-b086-14b31f159f22.png",
  "tags": [
   "walk",
   "historic",
   "free",
   "history",
   "tour",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=17098742210017804268",
  "source": "GoogleMaps",
  "reviews": [
   "Small and free piece of history that shares space with a law office (upstairs). Self guided. Takes no more than 15 minutes. Grab a pamphlet of Lincoln's speech he made at this place before leaving for Washington DC. It's a moving speech. Depot is a 5 minute walk from the Lincoln home National historic site.",
   "This is the place Lincoln departed from as he headed to take his appointment as President. It's a humble museum worth visiting. It smells really nice. You will get to see what a train station looked like back in the day and a cool safe which survived two fires.",
   "Party of Lincoln Memorial Museum ticket fee and exact replica of what did in his day.",
   "It's small but easy to get to and tour inside at your own pace",
   "Awesome job by the Noll Law Firm preserving this historic place and making it freely accessible to the public."
  ]
 },
 {
  "name": "Southern View Community Park",
  "address": "3483-3499 S 4th St, Southern View, IL 62703, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/31de25ae-9334-11ea-ba2f-14b31f159f22.png",
  "tags": [
   "family",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=17634009508321752766",
  "source": "GoogleMaps",
  "reviews": [
   "Great park! Everything you need for baseball, soccer, volleyball. Covered picnic tables with grilling and bathrooms! Best family oriented park in Springfield.",
   "Pretty park. Well maintained. Often lots of wind, so probably good for kite flying.",
   "So much to do here. Attended a Family Reunion and the park has something for everyone. Nice restrooms, pavilions with electricity, ball diamond, open space, pond, walking path! Very clean.",
   "Great park for the kiddos. While there I can get my poke stops for my game.  Plenty of things for the kiddos to play on.",
   "Fun."
  ]
 },
 {
  "name": "Lincoln's New Salem",
  "address": "15588 History Ln, Petersburg, IL 62675, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3227641a-9334-11ea-98c5-14b31f159f22.png",
  "tags": [
   "walk",
   "tour",
   "family",
   "walk",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14776872851657679935",
  "source": "GoogleMaps",
  "reviews": [
   "A perfect evening for the annual Candlelight Walk! All of the volunteers were so welcoming and helpful throughout the evening. Excellent narratives from the individuals dressed in period costumes located inside each cabin open for the night. The paths and cabins were illuminated with candles and each cabin had a cozy fire burning in the fireplace. I thoroughly enjoyed the entire evening. Highly encourage people to visit Lincoln's New Salem. A great place to take your family for an educational tour.",
   "Absolutely LOVE this place! Even if you are not an admirer of Mr. Lincoln (but let's face it---what sane person is not???) this is a fabulous peek into our past.",
   "I've been visiting/volunteering at the site since I was a freshman in college. There's something magical about it. You've just stepped back in time. It's indescribably peaceful. Even on the busy festival weekends and special events like the annual candlelight walk.",
   "One of my all time favorite places. This is true Americana. The aura and the spirit of pioneer times is present in the air, and it is a most peaceful place to be. 'Twas a joy to perform at the beautiful indoor amphitheater.\n\nI've always received a warm reception from the the people of this area. There is a down to earth mentality and a charm not commonly found in other places. If you're looking for quality photography subject matter, a stroll through New Salem State Park will provide you with plenty of opportunity. The original town was faithfully reconstructed from the recollections and assistance of original residents. There are even a few areas that are yet original (such as the Cooper Shop).",
   "Awesome time in Lincoln’s New Salem. I enjoyed looking at all the buildings and seeing how it would of been living in the 1860’s. Very friendly staff with a lot of rich history!"
  ]
 },
 {
  "name": "Pearson Museum",
  "address": "801 N Rutledge St, Springfield, IL 62702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=4352846566373120719",
  "source": "GoogleMaps",
  "reviews": [
   "Loved it! Very interesting exhibits!",
   "Awesome^",
   ""
  ]
 },
 {
  "name": "Ergadoozy",
  "address": "1320 S State St, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/326e1180-9334-11ea-b18b-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "free",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13404459325807959938",
  "source": "GoogleMaps",
  "reviews": [
   "Wild and crazy indoor play place. Clean enough. Really helpful owners who enjoy what they do. Several themed play areas catering to different age groups. Had a couple buses full of field trips when we went, which was a bit overwhelming for all involved. Overall, it was a good experience. Definitely worth your time if you have young kids and support small business.",
   "We had a great time at Ergadoozy! This was our first time visiting and my daughter, who just turned one, loved it! We paid $10 for her and the adults were free. Your pass also lasts all day, so you can leave and come back! I was a little worried that there might not be stuff designed for that early of an age but they have 3 areas specifically for toddlers. She especially loved the \"under 3\" rollercoaster! Will definitely be back!",
   "Lots of toys. Lots off collections. Lots of toys to buy. Lots of learning. Party rooms. Fun fun. Love this place. For $30 you can get a summer pass for June July and Aug. Great way to stay cool and have fun!!",
   "Awesome place for the kids to go and play until they are exhausted.  We've spent fun days here and had birthday parties... works great for kids 3-12!  Staff was great and the party room rental is worth the price (especially when you factor in the food).",
   "This place was so fun. My 3 year old loved it. They have a lot of great stuff in their gift shop too."
  ]
 },
 {
  "name": "Abraham Lincoln Presidential Library and Museum",
  "address": "212 N 6th St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/32acc81e-9334-11ea-b3a8-14b31f159f22.png",
  "tags": [
   "library",
   "family",
   "history",
   "library",
   "history",
   "walking",
   "walk",
   "family",
   "library",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=3409552109121133791",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely outstanding presidential library. I have been to about eight of them, and always enjoy seeing new ones. This was a real treat, and they were very honest with their depiction of his work and life. The movie they show was fascinating and very informative. The displays were professionally done, and the staff was very friendly. LOVE this place! Makes you feel proud to be an American!",
   "This is such a fantastic place to visit- for families, history buffs, or anyone looking for a good time. The exhibits are interactive and eye catching. Replicas of rooms and scenes are so similar to the places they represent! The wax figures are so well crafted. They capture an amazing likeness!!  The ghosts of the past show is AMAZING! Everything is included in one price. Student, veterans and senior discounts are available. Bathrooms are clean and accessible for handicapped and baby care. There is a restaurant inside, but I did not go there. Staff are very friendly also. A total win for our family!",
   "This library and museum is amazing.  There are many exhibits including one holographic presentation that makes you believe President Lincoln is actually there.  I really enjoyed walking through history here.  Parking might be a little difficult but the area is worth exploring.",
   "Really a terrific experience! Presents a pretty fair story of Lincoln and his family. Exhibits are impressive and experiential. Ample parking is available in a ramp about a block away. And don't forget that your museum ticket also gets you into the railway station right across the street!\n\nThe Lincoln home and old state capitol are an easy walk away.\n\nInsider tip: DO NOT SKIP the \"Ghosts of the Library\" show at the Lincoln Museum. It's interesting and quite powerful!",
   "Very good museum.  Comprehensive of Lincoln, but overall felt short, granted we didn't watch the two \"movies\". It's clean, costs about $15 for a ticket, 5 for a kid 5.  Lots of stuff about slavery and war, so if you've got kids be ready!"
  ]
 },
 {
  "name": "Indian Hills Park",
  "address": "2536 Miami Trail #2500, Springfield, IL 62702, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/32f5c858-9334-11ea-a1fd-14b31f159f22.png",
  "tags": [
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=14851524334391293695",
  "source": "GoogleMaps",
  "reviews": [
   "awesome  area very clean  and pretty",
   "Robert's Cub Scout Pack 53 marched here and picked up any trash on the way there and back to St. Aloysius school. They had a great time.",
   "They have a tennis court.",
   "I used to walk my dog in the park never have any problems.",
   "Baseball diamond, Tennis courts with small parking area.  Baseball diamond good condition.  Tennis courts useful with moderate cracks, reflective of IL politics & defunding of anything healthy. Practice wall! Pickup games possible!  Lots, and lots of walking space for you and your dog."
  ]
 },
 {
  "name": "Walnut Street Winery",
  "address": "309 S Walnut St, Rochester, IL 62563, USA",
  "avg_visitor_review": 3.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3359456e-9334-11ea-ac10-14b31f159f22.png",
  "tags": [
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=16449757222178247322",
  "source": "GoogleMaps",
  "reviews": [
   "Great staff, stage, and ambiance. The  red Sangria was pretty good, bit the rest of the wone was not the greatest. They do have a full bar, though.",
   "Great wines and Loren the owner was great. It was just the 2 of us and another couple also having a tasting so we got Loren's undivided attention. He took us back and showed us the room they make the small batch wines in. They have several fruity wines and we liked everything we sampled so we bought a case.",
   "Great place to go and relax. Great wine!",
   "We had the Razzle Dazzle chocolate raspberry port it was fantastic then we had a cheese which had garlic and I don't remember what other my sister picked it out and it went great with the wine loved it",
   "In the span of 5 minutes and within 7 minutes of meeting the owner, he gleefully and unsolicititously shared two rumors with me about two different people in my life. One was egregiously slanderous and the other was willfully spiteful. It seems he is vying for a new franchise of Real Housewives."
  ]
 },
 {
  "name": "Clayville Town Historic Site",
  "address": "125 Co Hwy 9C, Pleasant Plains, IL 62677, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/33aeb8c6-9334-11ea-bbeb-14b31f159f22.png",
  "tags": [
   "field",
   "history",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=6061934880251409395",
  "source": "GoogleMaps",
  "reviews": [
   "We rented the barn and cabin for our wedding and it went perfect",
   "Accompanied first grade class on field trip.   Educational experience at appropriate grade level and lots of hands on activities including attending one room school house, making a yarn doll, collecting eggs and dressing up.  Class had a blast.",
   "We visit Clayville often for their events and be have had private events there for various organizations we are involved in. It's a wonderful venue.",
   "Very cute place full of fb history. Not open very often, but when it is, it is great!!",
   "It had great history and things for the kids to do."
  ]
 },
 {
  "name": "Camp Butler National Cemetery",
  "address": "5063 Camp Butler Rd, Springfield, IL 62707, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/33f73376-9334-11ea-a9e9-14b31f159f22.png",
  "tags": [
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=13406771159964080505",
  "source": "GoogleMaps",
  "reviews": [
   "Always an honor to visit.  I have two sets of great-grandparents buried here.",
   "Pristine Grounds , well maintained .",
   "Because that's where my mom and dad were laid to rest",
   "Well kept great staff honorable treatment of our military.  There is a section of civil war era graves is interesting for those who love history.\n\nIt is open 7:30 to sunset and is easily accessible throughout the year.  One of the finest institutions in the US that cares from our Veterans at the end of their lives.",
   "My Mother and Her Parents Are Buried here. I have a Sweet Little Nephew Buried here as Well. And they are Always Remembered.  There are other Friends and Family here as well. So many to say. I come to visit each time I am in Illinois as are Home is in Florida. It's a Peaceful Place and Always looks So Nice every time. The Name Should Stay The Same as Always. It's Well Known from Way Back. It's a Name Well Given. Miss you all and Love you Deeply. Susie and Jimmy."
  ]
 },
 {
  "name": "Lincoln Monument Association",
  "address": "1500 Monument Ave, Springfield, IL 62702, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/344071ac-9334-11ea-9765-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "history",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=4193357896429399447",
  "source": "GoogleMaps",
  "reviews": [
   "Another item on our bucket list.   This monument is taken care of extremely well.   The association does a wonderful job.   Take your time when you are here and look around, take it all in.   Make sure you down below behind the monument and see the receiving vault as well.   We have a full review on our blog site and YouTube channel for this location.",
   "Nice free place to visit. Does not have to take very long if you don’t want to. Awesome place to pay respects to Abe Lincoln. Lots of Pokemon stops all around here, too, if you or your kids are into that.",
   "Very stunning monument and tomb for the greatest President the United States has ever had.  Everytime I enter the tomb, I am always humbled by its history, architecture, and greatness.  \n\nI've been coming here since I was a kid as I have several relatives buried in another part of Oak Ridge.  I would like to see the upper level of the tomb opened again.  It's has been closed off to visitors for several years.",
   "Lincoln Memorial Association takes care of Lincoln Memorial and I think they do good job. One of the members was inside at the time of my visit; very knowledgeable old man. It was a pleasure to have a little conversation. The Memorial seems to be in a good shape and open for visitors; I would not expect more...",
   "Maybe I'm strange but this is probably the most beautiful cemetery I've ever visted. The inside of the tomb is just gorgeous. It would also be great for a scary movie though, LOL"
  ]
 },
 {
  "name": "Scovill Zoo",
  "address": "71 S Country Club Rd, Decatur, IL 62521, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3488c57e-9334-11ea-a5f3-14b31f159f22.png",
  "tags": [
   "affordable",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7363035402084343180",
  "source": "GoogleMaps",
  "reviews": [
   "Only gave a 4 star because they weren't open. But, looks amazing and entertaining.  Appeared to have a good variety of species too. :) Prices were very affordable!!!",
   "Great little Zoo w lots of animals n rides for adults n kids. I love the train ride. Great place to spend the day",
   "What a lovely zoo! We went in October 2019 and enjoyed every moment. Lovely customer service",
   "My whole family loves this local zoo.We have a family membership and go at least once at week when it's open! My preschooler loves learning about the animals and getting to know them.",
   "Love zoos. This one didn't disappoint. Enjoyed the train ride. Recommend."
  ]
 },
 {
  "name": "Illinois State Police Heritage Museum",
  "address": "4000 N Peoria Rd, Springfield, IL 62702, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=3315070344003230207",
  "source": "GoogleMaps",
  "reviews": [
   "I real like the lllinois state police it real cool jon Ferguson",
   "Thursday and Saturday 11 am to 1 pm.",
   ""
  ]
 },
 {
  "name": "Children's Museum of Illinois",
  "address": "55 S Country Club Rd, Decatur, IL 62521, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/34d31510-9334-11ea-acae-14b31f159f22.png",
  "tags": [
   "kids",
   "music",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=9897620795681381727",
  "source": "GoogleMaps",
  "reviews": [
   "My son loves this place. We can spend hours here several times a week. The membership is definitely worth it!",
   "It can be a lot of fun for older kids (5ish and up) but the toddler section is so tiny with so little to do. For a place with so much learning available, I expected more than puzzles and books in the toddler area. If they would add more for under 2-3 years old, we would love to take our daughter.",
   "My 5 year old could have easily spent all day here. She kept bouncing from exhibit to exhibit but could have done it all day and not cared. It wasn't too crowded when we went",
   "My child had a blast.  It was fun and entertaining. I wish there was some music playing, that would have been awsome",
   "Beautiful day for a walk. Saw flowers budding in Sculpture park."
  ]
 },
 {
  "name": "Looking for Lincoln Heritage Coalition",
  "address": "1 N Old State Capitol Plaza, Springfield, IL 62701, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=12299100694608609166",
  "source": "GoogleMaps",
  "reviews": [
   ""
  ]
 },
 {
  "name": "Illinois Fire Museum",
  "address": "Central Ave & Main St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3515756e-9334-11ea-a099-14b31f159f22.png",
  "tags": [
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=16518434919625044103",
  "source": "GoogleMaps",
  "reviews": [
   "Decent display of our fire service history.  The State of Illinois is allowing the building to go into disrepair...very sad.  Volunteers at the museum were very nice.  Kids liked the interactive displays.",
   "",
   "",
   "",
   ""
  ]
 },
 {
  "name": "Edward A. Trudeau, M.D",
  "address": "340 W Miller St, Springfield, IL 62702, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=5693729974084202695",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best doctors I have ever had the pleasure to interact with..and just a very down to earth gentleman. .5 stars plus..",
   "Dr. Trudeau is very kind, gentle, caring, funny, and compassionate.  If you need an EMG, he is the doctor to see, the test was quick and painless. Highly recommend!",
   "Dr. Trudeau is the Best at what he does, he knows his equipment an exactly where he needs to go to get you the very best results on your testing. He and his staff is curtious  and very professional, an it’s all done with a sense of humor to get you through the test. It’s over before you know it, I can truly say this was one doctor appointment that I really enjoyed. \nHe sent the results to my doctor very quickly an had everything my surgeon needed for my surgery. \nMonths down the road my case turned into one that was something totally unexpected. I had a allergic reaction to one of the anesthesia’s used in surgery so it had to be stopped to get blood pressure back up. This was turning into a nightmare trying to figure out where an who to see to get the testing needed to finish my surgery. \nBamm, I told my wife I’m calling Dr. Trudeau he’ll know what an where to call. So called the office an Bobbie answered, I told her who I was an she remembered. She let me know that  the doctor was at the hospital with patients an she would have him call me back. That evening Dr.  Trudeau called after Bobble told him what had happened to me. \nDr was quick to give me guidance to get me on my on my feet again. He also advised me on how serious it is to get this resolved. \nI can’t begin to to tell you how relieved I was getting his call that night. He’s probably one of the most caring doctors you will ever meet ! \nI told him when I got fixed I’m coming back to take him to lunch, it’ll be my pleasure just to visit with him again. \nSincerely,\nJohn Shallenberger",
   "Dr. Trudeau is a wonderful doctor.  He is thorough, precise, and he takes his time to provide his patients eith the upmost care.  Most of all he puts his patients at ease by thoroughly explaining tests right down to the tiniest detail.  I can honestly say that I actually enjoyed my appointment which is a rare, if not non-existent.",
   "Dr Trudeau is one of the best dr I have met, he is so down to earth , understands the patients problem. I will never forget him, you are awsome dr Trudeau !"
  ]
 },
 {
  "name": "Sky Zone Trampoline Park",
  "address": "3454 Liberty Dr, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/355d7b30-9334-11ea-842d-14b31f159f22.png",
  "tags": [
   "active",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6582306590333687879",
  "source": "GoogleMaps",
  "reviews": [
   "The place is fun, and we’ve been to (and had) multiple birthday parties here. We have young kids, so my biggest complaint (this my rating) is the lack of adherence to rules for toddler time. Most parents are minimally active (as appropriate) but some dominate the play time reserved for toddlers. It’s as if it’s their time. Staff don’t enforce the rules and I’ve seen kids get landed on and tripped up by parents jumping into pits and on trampolines. It’s toddler time people. Let the kids play...safely.",
   "Took one of my son's for his birthday the other brother said that he had the best time😁",
   "Attended a Christmas party with the grandkids. They had a great time. Nice facility for kids.",
   "Great for young people. Great place to have a birthday party.",
   "My son had his birthday party there and it was great. The pizza was surprisingly good."
  ]
 },
 {
  "name": "Kidzeum of Health and Science",
  "address": "412 E Adams St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/35a58290-9334-11ea-a138-14b31f159f22.png",
  "tags": [
   "learn",
   "family",
   "active",
   "kids",
   "kids",
   "eat",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10954356725884689606",
  "source": "GoogleMaps",
  "reviews": [
   "We have taken out girls (3yrs old and 5yrs old) here 3 or 4 times now. We went ahead and bought the year family pass this time.\n\nI am very happy that we have something like this in Springfield IL now. The science center or magic house in St Louis used to be the closest. There are many awesome interactive attractions and what a great way to learn through play!",
   "An absolute blast for all of us (1, 23, 25, & 51). While I was limited due to a broken ankle/cast and my daughter wasn't able to comprehend the learning that it's set up for, we had non stop giggles and screams of enjoyment from her (and us). We can't wait to go back when she's older and more active in engagement with the set ups!",
   "Well designed and engaging children's museum! Fun for a wide age range. The kids learned new things and had a great time pretending and playing. Definitely worth the visit!",
   "What a great place to take the kids. We went for a birthday party.  Great staff and exhibits.  Nice rooms for the party to meet and open gifts and eat cake. Highly recommend this for all ages of kids.",
   "Excellent place to visit with your kids. The 3 levels are designed with different types of play areas for different age groups. The first level is for very small children with water activity and fruits, vegetables, meats, etc. The next 2 levels are for next age group with advanced games and science activity like understanding the energy and things like that."
  ]
 },
 {
  "name": "Cozy Dog Drive In",
  "address": "2935 S 6th St, Springfield, IL 62703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/35ed8680-9334-11ea-8b86-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "kids",
   "food",
   "food",
   "historic",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2873928433123513805",
  "source": "GoogleMaps",
  "reviews": [
   "Cozy Dog is a must stop in Springfield. The older folks will love all the memorabilia inside. The prices are very cheap and the food is good every single time. Plan on sharing fries if there are two of you because there are plenty to go around!",
   "Fantastic,  reminiscent of The Burger King back home. I have been coming to Springfield for 30+ years and this evening was my first time here.  I cannot believe it took me this long to stop in. Great burger n the batter on the cozy dog was light and airy and had surprisingly little grease. Well worth the stop.",
   "If you're looking for corn dogs you can't get better than this place. The staff was nice and even let the kids poke their heads into the kitchen to see how the dogs are made. Food was fast and fresh. Obviously corn dogs were great, but extra points for the amazing french fries. Yum!!",
   "This place was sub-par. Was looking for a quick hot dog joint when we stumbled upon this place. \"The birthplace of the corn dog\". Little did we know saying corn dog at this place was a horrible sin because in fact, no, they do not serve corn dogs, they serve Cozy Dogs. I'm sorry. I've never in my life heard of a Cozy Dog before that day, so I'm sorry that I just wanted to be sure of what I was ordering. They guy gave such attitude and wouldn't answer the dang question. \"It's a cozy dog. It's a cozy dog.\" Turns out, a cozy dog is a soggy and sad excuse for a corn dog. Everything food wise about this place was a big old Meh. It only gets two stars cause the memorabilia was kinda neat.",
   "Good food at a historic stop on Route 66. The cozy dogs were tasty. The breading was good and the dogs are great. Really loved having a chance to check this place out during our road trip. Lots of interesting history of Route 66 and a little gift shop too!"
  ]
 },
 {
  "name": "Henson Robinson Zoo",
  "address": "1100 E Lake Shore Dr, Springfield, IL 62712, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/36395ce8-9334-11ea-b1f4-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15587151280900238893",
  "source": "GoogleMaps",
  "reviews": [
   "I have enjoyed going to this zoo since I was a kid. Very friendly and helpful staff. Love all the events that they have every year and have since I was a child. Now I take my three girls of my own there and watch their eye's light up with excitement of seeing all the different species of animals that they have there. Have always recommended for people to definitely visit there if they have never been.",
   "This is a great zoo! It's never too over packed! Our family enjoys not being in the bigger crowds. Although I wish the zoo got more attention, I know when we go there its never to chaotic to let my kids run ahead of me a little bit and not worry about them getting lost. \n\nThey also have a play ground inside the zoo!",
   "This was an amazing experience for my two year old granddaughter. After four hours, she still didn't want to leave. The exhibits were amazing, clean, plenty of water and food for the animals. The staff was so nice and told us the donkey is Jasper and one of the horses is named Liberty. My granddaughter made fast friends at the playground, which was fantastic. Thank you Henson Robinson Zoo for making the a very memorable event for my granddaughter!",
   "We had a great trip to Henson Robinson Zoo! It was a relaxed enjoyable time, without the overwhelming crowds and longer drive. We are very fortunate to have such a clean, well run zoo so close to home. Please support these places. You won't regret it.",
   "The zoo has been around for years and it's perfect for smaller children learning about animals"
  ]
 },
 {
  "name": "Long Nine Junction",
  "address": "5 W Old State Capitol Plaza, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/36824cee-9334-11ea-96fa-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=10387104384240500369",
  "source": "GoogleMaps",
  "reviews": [
   "My partner and I just spent 36 hours in Springfield, and Long Nine Junction had the best food we tried in town. \nBUT the French Dip was probably the best I’ve ever had. The bun was soft and a little sweet, and the jus was lightly spiced and a little thickened- almost like a gravy, but not. \nI chose the side salad; it was dressed lightly and perfectly with a slightly sweet dressing that was probably balsamic vinegar with a little honey. \nFriendly, attentive staff and located very conveniently to the old state building and Lincoln’s law office.",
   "This is a a small place and as a result, you may have to wait a bit for your food. However it's not worth the wait. My wife had the Cuba with Mac and cheese and I had a Memphis pulled pork sandwich with vegetable beef soup. All were incredibly good. Love goes into making this food for sure. Definitely worth a visit.",
   "Nice spot across from the Old State Capital. Unique sandwich & side choices, everything I had was pretty tasty and high quality. Not a bad price either.",
   "Every item on the menu is incredible. House made bread and slow roasted meats. There's always a line for a reason - it's that good and more than worth the wait!",
   "Hands down the best sandwich I've ever had, let alone a Cubano. The mac&cheese side was not far behind. \nAlso very filling, especially for the price. \nDefinitely coming back here on my next business trip."
  ]
 },
 {
  "name": "St. Katharine Drexel Parish",
  "address": "722 S 12th St, Springfield, IL 62703, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/36cc006e-9334-11ea-af63-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=2816822985651067788",
  "source": "GoogleMaps",
  "reviews": [
   "I've only been to Sacred Heart, but not St Patrick. The Latin Mass at Sacred Heart is reverent, and full of prayerful contemplation. When you enter Sacred Heart Church, you will be inspired by its sacred beauty.",
   "If you want a traditional mass with a high level of reverence and respect that most churches have forgotten then this is the place for you. Also has a great Latin mass.",
   "Love the way they do things here. And the very humble priests are amazing.",
   "We have the best priests and parish and masses in town.",
   ""
  ]
 },
 {
  "name": "Dickson Mounds State Museum",
  "address": "10956 N Dickson Mounds Rd, Lewistown, IL 61542, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/37260864-9334-11ea-b16c-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2019261783963132697",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome displays and very detailed reading materials all over.",
   "Great place to explore the history of the native Americans that lived on the Illinois River and the people of that time period. Beautiful place at the park on top the hill at the museum.  Over looking the river valley, beautiful place to have a wedding. They have a pevion u can rent with power.  Make a donation to the museum is the charge. My daughter had her wedding there.  It was amazing.",
   "Artifact fair today!! GREAT displays!! Friendly folks willing and eager to share their knowledge.",
   "Museum and grounds are a little dated having it's last remodel in 1994. It's still a very nice facility with nice picnic area and playground. It's such a nice place to take an afternoon trip. The grounds are absolutely beautiful in the fall!!",
   "great history shown about the native Indians in the prairie state. glad they finally closed buried the remains and not made to the public. real people living in tents like the past days. very educational with nice exhibits. a must stop for travellers."
  ]
 },
 {
  "name": "Orthopedic Center of Illinois: Ronald R. Romanelli, MD",
  "address": "1301 S Koke Mill Rd, Springfield, IL 62711, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/376d9918-9334-11ea-92b5-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=16761281524838109650",
  "source": "GoogleMaps",
  "reviews": [
   "Dr. Romanelli is a wonderful doctor. I had knee replacement surgery on November 5th and I was up and walking right away. \nI attended rehab classes at The rehabilitation center at the Orthopedic Center. \nKayla and Rachel were my primary therapists and they were wonderful.  I have finished my therapy sessions and my knee is doing wonderful. I highly recommend them.",
   "Dr Romenelli replaced my knee and was attentive to my ongoing care. His dedication to his profession was demonstrated throughout my initial and last visit with him! He gave me my swagger back! Thank you Dr. Romenelli!😊",
   "This was my first knee replacement. I am very pleased with my surgery. All aspects of the surgery were clearly explained and discussed. Questions were encouraged. I called several times with questions I hadn’t thought about during office visits. Each of my questions were answered that day by patient, professional people. The joint class at St John’s helped make me more aware of what would happen to me, and all the things I needed to know to be prepared. I was still a bit anxious, it was major surgery after all, but I was able to sleep well before the procedure. Events happened as expected, no surprises. I received excellent care at St John’s. Dr Romanelli talked with me before and after the surgery to tell me again what he planned to do in surgery, and after to describe what happened and tell me about the pain management, therapy and discharge expectations. I called a couple of times after surgery, and received answers and assistance as needed. I was very pleased with Dr Romanelli and all of the people associated with OGI. \nI am having my right knee replaced by OGI in February 2020.",
   "First appt with Dr. Romanelli but very impressed with him!  He not only jumped on starting my treatment that day but already is thinking down the road several steps ahead in case things don't work.",
   "The treatment I received from dr Romanelli and his staff could not have been better. The procedure to fully replace my right shoulder went beyond my expectations.  I would recommend dr Romanelli to anyone for anything that he does. I can’t express how satisfied I am. Leonard white"
  ]
 },
 {
  "name": "Children's Discovery Museum",
  "address": "101 E Beaufort St, Normal, IL 61761, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/37b88778-9334-11ea-b816-14b31f159f22.png",
  "tags": [
   "cheap",
   "kids",
   "art",
   "music",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6957356203632840442",
  "source": "GoogleMaps",
  "reviews": [
   "I've been here quite a few times and my kids love it here.  I have a science degree and I love how they have a whole floor dedicated to renewable energy, agricultural science, and compressed air.  My son loves that floor while my daughter loves the music and art floor.  It's cheap to go to and I highly recommend bringing your kids here.",
   "In comparison to other discovery museums, they really went bare minimum on there exhibits, I have a feeling the grant money went to other (pet) Uptown projects, instead of child development, and exploration. Would you feel comfortable letting your child climb in the discovery net? refer to the picture, notice the missing cable clamps, instead they tied the cables in knots and wrapped they in duct tape. TOP NOTCH MAINTENANCE",
   "The BEST kids activity in town! We have been members for several years and still enjoy every visit. Three floors of fun for all ages, plus many classes and special activities throughout the year. Always very clean, friendly staff, and a fun gift shop.",
   "Lots to do! Spent about 4 hours playing and exploring and could have easily stayed longer if we didn't have a time constraint. Clean facility and staff is really friendly too. Great children's museum!",
   "Place is my kids favorite place to celebrate birthdays!!! They love the stage, lights dress up and  puppets!! Also love the water play area and avantis pizza area!! A must see for younger kids!"
  ]
 },
 {
  "name": "Miller Park Zoo",
  "address": "1020 S Morris Ave, Bloomington, IL 61701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/380410c8-9334-11ea-a378-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "family",
   "free"
  ],
  "link": "https://maps.google.com/?cid=10316731521211693683",
  "source": "GoogleMaps",
  "reviews": [
   "Great way to spend a sunny day. Exhibits are accessible and seemingly tidy. My children are always excited to visit.",
   "Very good family entertainment. Personnel are friendly and professional. Good selection of animals for a small zoo. Kids love it.",
   "I want it said, my 4 stars instead of 5 comes solely because its a small zoo. It is a great experience for what it is. They have a wonderful old carousel in the middle for small children that need a break (get tickets before you enter). They hosted baby snow leopards at one time and have some really nice upclose views of their rain forest exhibit and a few giant tortoises. At one time the family pass would get you in free or discounted to other nearby zoos too. I do not know if that is still the case but it was a very nice perk.",
   "I love this zoo. Every time you go is a good time! It's a small zoo but it's ALWAYS fun and eventful. You can look on their website and find fun days. My daughter always loves getting her face painted.",
   "Great zoo. The animals here are particularly cute and pretty fuzzy for the most part. There was an owl that looked at me funny every time we walked by him. Pretty suspicious, actually. Consider getting panda."
  ]
 },
 {
  "name": "Peoria Riverfront Museum",
  "address": "222 SW Washington St, Peoria, IL 61602, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/38517042-9334-11ea-9587-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "history",
   "free",
   "kids",
   "music"
  ],
  "link": "https://maps.google.com/?cid=1805125871738505704",
  "source": "GoogleMaps",
  "reviews": [
   "I felt that this museum lacked a lot.  A lot of the exhibits were closed which was frustrating. I kept thinking there was more to see, but there wasn’t.  We left after an hour and a half.  For $64 for a family or 4, I would have rather went to Chicago. \n\nThe positive?  The building is very cool and the outside sculptures are really good.  And the staff is really nice.",
   "It was decent. A lot of things need repairs and upgraded. Science stuff kind of neat. Kids enjoyed the museum some pretty cool history for Peoria Illinois. Worth a visit if you need something for the kids to do. Especially cool for people near or from the area and travelers alike. It takes about 2 hours minimum for a good visit.",
   "We went on the free day and it didn't last too long for us. We got to explore a bit and from what we saw it was awesome. We can't wait to go back when it's a bit calmer so we can see more",
   "A very nice educational trip for the kids and grownups. Staff has always been polite and very helpful. Pay attention to what exhibits and movies are playing, you may miss something you would enjoy. I recommend becoming a member if you are able. There are some nice perks to grab from time to time by doing so.",
   "Only recently went, wish I had checked it out sooner. We went to both the moon and Leonardo DaVinci exhibits, both were very cool. Easily spent an hour at each one reading all the signs and little things. Parking is easy, and exhibits so far have been worth the price of admission. Music shows in the dome are a good time as well, loud with neat displays. My eye will be on what comes through next."
  ]
 },
 {
  "name": "Caterpillar Visitors Center",
  "address": "110 SW Washington St, Peoria, IL 61602, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/389c47e4-9334-11ea-bf64-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "art",
   "learn",
   "kids",
   "family",
   "history",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1491318796988562772",
  "source": "GoogleMaps",
  "reviews": [
   "Was a very fun and informative place. Tractors ect that kids could climb on and play on. They have simulators that was pretty cool for the adults and kids alike. Good place to visit with kids or as an adult. Retired Cat employees on the floor to answer questions. I would recommend checking it out.",
   "It's a neat place; however, when the sole recognizable purpose of the venue is the glorification of Caterpillar you would expect the entrance fee to be a little less steep.\n\nCat employees get a discount, and the employee gets in free. A fair expectation for the amount of money Caterpillar pumped into the Foundation.\n\nWhat you wouldn't expect is offering little or no discount to a school group visiting for educational purposes (and the number of parents who work at Caterpillar). Considering this is owned by a not for profit foundation, it makes no sense why they wouldn't reach out a little more vigorously.\n\nOverall, when the Visitors Center was new, I could state it had some \"state of the art\" technology displays. As the place ages, and technology progresses, I would expect more frequent updates to the technology exhibits or a lower entry price.",
   "Such a fun place for the family and kids. Very clean. So much to do and learn. This is  a must for anyone passing through Peoria",
   "While there more for fun than education, I was introduced to the history of the CAT company. The initial movie is more of a sales pitch than a history lesson however, the fact that an entire theater fits in the bed of the largest vehicle made by them is fantastic.\n\nAs you move about the museum, you find touchstones of the past and the company vision for their future. \n\nI would definitely recommend visiting this place.",
   "Very reasonable admission price, you go in and watch a short video, then go downstairs to an equipment floor.  You can climb up to the cab/control area of the machines.  There are simulators for kids for all ages.  There should be plenty of fun for kids.  Then there are exhibits about manufacturing and the history of the company.  It took about 1.5 hours to see it all."
  ]
 },
 {
  "name": "Cahokia Mounds State Historic Site",
  "address": "Collinsville, IL, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/38e40986-9334-11ea-84ee-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "history",
   "walking",
   "knowledgeable",
   "history",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3487916491235511030",
  "source": "GoogleMaps",
  "reviews": [
   "We love visiting Cahokia mounds! The kids really enjoy the exhibits and the grounds are perfect for a relaxing walk outside. Climbing Monks Mound is especially fun for the little ones who enjoyed climbing up and down all of those stairs. We'll be back.",
   "So, I love history! If you don’t, you may not see this as a worthwhile place to visit. I get into it, though.\n\nThis is an ancient mound site of the Cahokia People. There are signs around and paths for you to follow that explain what everything is. \n\nWhile walking around this entire area I could picture in my mind’s eye what it may have looked like anciently...the homes, indigenous people walking around. \n\nFrom the top of the main mound you can easily see St. Louis although it looks a good distance away. I counted the steps to the top of the mound when I visited, but danged if I can’t remember how many there are now. Total shot in the dark, but I want to say around 188-ish...\n\nGreat views from the top of the big mound.",
   "This is probably one of the absolute coolest museums I've ever been to. Very well done, incredibly knowledgeable staff, amazing history and artifacts. Will definitely be back",
   "On our way home from St Louis we stopped at the park. A part of North American history everyone should be aware of. Visitor center is modern with nice short film. Walking trails aroun the mounds are easy. Lots of steps on the largest mound. Park easy access from the Interstate.",
   "We had a quick and fun stop here. \nWe went to the large mound with the staircase. Not recommended for those who can't handle a great deal of stairs. For those who can, the view is great. \nParking was crowded as it was a saturday afternoon, so be patient in the lot. \nThere was an interpretive center across the street that had information for a suggest donation."
  ]
 },
 {
  "name": "Edwardsville Children's Museum",
  "address": "722 Holyoake Rd, Edwardsville, IL 62025, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/39310492-9334-11ea-a8f6-14b31f159f22.png",
  "tags": [
   "kids",
   "learn",
   "family",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=744053052154373068",
  "source": "GoogleMaps",
  "reviews": [
   "This was our first time here and this trip was for ryah’s 5th birthday from her granny a day of fun. We really loved this place it is perfect for kids who love pretend play and my daughter loves this type of thing and we will most definitely be back here. She did not want to leave here lol",
   "My family always has a great time here. Birthday parties, play dates, or just a day to get out of the house. It's fun to learn and use your imagination here.",
   "Love this place! Super convenient and fun place to go for the little one to burn off some energy... especially on a rainy or cold day. I could see how older kids might get bored, but it's perfect for 1 year to maybe 6 or 7. Maybe not as amazing as the magic house, but it's close, relatively inexpensive, and way less crowded.",
   "Small but mighty! Well kept and captivating activity centers for my 4 year old grandson. Thanks to the wonderful sponsors for the support of this community gem!",
   "Kids (3 and 6) had a great time. Lots of stimulation and fun. Maybe not a perfect fit for 8+ but awesome for younger ones."
  ]
 },
 {
  "name": "Drury Inn & Suites Springfield, IL",
  "address": "3180 S Dirksen Pkwy, Springfield, IL 62703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/397364fe-9334-11ea-bd23-14b31f159f22.png",
  "tags": [
   "hospitable"
  ],
  "link": "https://maps.google.com/?cid=7868683126998078688",
  "source": "GoogleMaps",
  "reviews": [
   "1st time staying at a Drury Inn. Very impressive. Was greeted with a super friendly staff. Sam the shift manager was super nice and remembered my name the next day. Our room was in perfect condition. Bed was great. Bathroom was like brand new. I will definitely seek out this brand next time we travel.",
   "Love staying at Drury Inn & Suites very clean rooms well decorated but more importantly the personnel was over the top professional & friendly.  Even the pool towels were replenished prior being completely depleted late in the evening. Can't say enough good things about the hospitality, happy hour everything!!! No competition for receiving the most Bang for your buck.",
   "Great rooms. Great price. Loved the afternoon reception. Staff members really friendly.",
   "We stayed here for just a couple of nights, but my 5 year old ended up getting a stomach bug on the first night. We had to call down late at night to get a change of sheets. The staff quickly came up and replaced the sheets and were extremely friendly and understanding. The next morning I went down to the front desk for something and again, they were extremely friendly. They asked about my daughter and made sure she was okay. They offered to get her whatever she needed even if the breakfast was no longer out. They offered to come clean the room or whatever we needed. When housekeeping came to change the sheets and replace the towels, I was still in the room with my daughter because she was still sick and I didn't want to contaminate the rest of the hotel. The lady offered to run across the street to get my daughter peidalyte and I have never been so taken aback by someone's offer. I politely declined, but this hotel staff has gone above and beyond my expectations. The entire stay so far has been wonderful, the hotel is clean, the pool and hot tub are nice, breakfast was good, but mainly this staff is outstanding. I will absolutely be coming back here!",
   "All drurys are the same. Which isn't bad.  The staff will always bend over backwards to help you with any problem you may have. I do hope however that the corporation is paying these people a wage that can provide them a comfortable life. Hospitality starts at home and I hope the Drury corporation is hospitable enough to take care of their most valuable asset... their staff. For through them gems blossom."
  ]
 },
 {
  "name": "Peoria Zoo",
  "address": "2320 N Prospect Rd, Peoria, IL 61603, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/39afd1b6-9334-11ea-8821-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "kids",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=11299829383365518174",
  "source": "GoogleMaps",
  "reviews": [
   "The Peoria Zoo is a great place to take the kids on a day off of school. There are so many animals to see and the animals are really well taken care of. This is a place of enjoyment and you can see it all around you. I would definitely come here again and even bring my family to see",
   "We had a good time. Zoo was well maintained and had a great assortment of animals. Was a pretty cool day so all the animals where out and about. Layout wasnt too bad, flowed all in one direction so you could see everything. Had nice play areas for the kids also when they got antsy and needed to run some. All the employees where nice and courteous. I would recommend checking it out.",
   "Just right for grandparents to take grandchildren. Not so large that you can't see everything in a few hours. You can bring your own drinks and lunch. Plenty of places to quick picnic. For young families I would suggest bringing your own food and drinks as the prices are a little steep in the restaurant.  The souvenir shop has a large selection from which you can find more reasonably priced items to remember your visit.",
   "This place has a park.childrens museum.botanical garden.and a lagoon. Wow!! Its very vintage everything neefd updating. But it has charm and craftsmanship.",
   "Nice small zoo, free parking. Close to the children's play house."
  ]
 },
 {
  "name": "Natures Select of Springfield",
  "address": "540 W Monroe St, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/39f677e4-9334-11ea-be1b-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "family",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=8675045827434467844",
  "source": "GoogleMaps",
  "reviews": [
   "Great selection of healthy fish. Such a cute little store. Staff is very friendly,  helpful, and knowledgeable. Prices are very competitive! Cheaper that online! Well worth the 2 hour drive!",
   "Very helpful staff, if you need anything they don't have in-store to offer, you can ask and they'll contact their suppliers and find all nearby available options, as well as taking budget and distance into consideration.  Friendly and open to conversation, a nice spot to visit after school/work.  Say hello to their cats and ferrets, who they'll let you handle/pet!",
   "Always helpful... They sell Ferrets and they are great... Playful not mean... Love the homey family feel... They seem to really care...",
   "Awesome staff, answered lots of questions and even helped me me find products to specific measurements for a new tank.",
   "Every time I visit the selction is pretty stellar. The staff is friendly and knowledgeable about the fish they have and what it takes to properly provide a good home for them. Also, the prices are very fair and nothing really that would make anyone do a double take. One of my personal favorite places to visit and get supplies."
  ]
 },
 {
  "name": "Maldaner's Restaurant",
  "address": "222 S 6th St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3a3a85fa-9334-11ea-b038-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7945474418576427725",
  "source": "GoogleMaps",
  "reviews": [
   "I ordered lunch and it was the best I ever had. I'd give them 10 stars if I could. The food was prepared perfect hot when I received it. I will he ordering again. Thank you for a fantastic luvh.",
   "This restaurant was ok. When you initially enter it has a very high class feel. Then I was led to my table and discovered my seat was covered in duct tape. \n\nThe Beef Wellington was very lack luster. The pastry was very soggy and the steak had little to no flavor. Come here for the simple lunch menu but avoid it if you want a Michelin Star dinner. \n\nIf I was to creat a name for the style of this restaurant I was call it \"trailer park millionaire\".",
   "Wonderful place and food. Superior atmosphere. A beautiful Italian Moscato with ribeye and wellington for dinner served by a very nice young man and super waiter named Bryant. Ask for him when you go. Happy Halloween everyone!",
   "We may have arrived on an \"off\" night, however the service was less than desirable. To it's saving grace, the cocktails were an 8 out of 10 on a very rigorous scale. The portions were small, but delectable. That said, they were not in a rush to take our order or bring the food out. Take note in case you're glancing at the menu ahead of time: there *are* items ONLY offered at lunch, but not dinner. Desserts were well worth it.",
   "I had a delicious Monte Cristo served with jalapeno jelly and homemade potato chips. The service was excellent! I also recommend the Queen of Sheba cake."
  ]
 },
 {
  "name": "Gabatoni's Restaurant",
  "address": "300 E Laurel St, Springfield, IL 62703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3a808fc8-9334-11ea-89c6-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10953949472303240929",
  "source": "GoogleMaps",
  "reviews": [
   "Best Italian food in town! Their pizza is the best! My favorite thing though is the cheese tortellini with Alfredo sauce. I really like the atmosphere of the place as well, it just seems very cozy. The staff is very friendly and do their jobs well.",
   "Very cool vibe! Loved all the different areas of the restaurant that each had their own charm. Construction and traffic in the area makes you have to really want to go there. The valet was a nightmare (particularly picking up). Chicken sandwich was good. Highly Recommended",
   "One of my favorite places to visit in Springfield. It is so well maintained and the waiters are so friendly. The food is great for the price and tastes amazing. I have been there a couples of times and love the garlic bread, pizza, etc.",
   "It was our first time at Gabatoni's...it seemed surprisingly busy for a Thursday night. Despite not having reservations, they were able to accommodate us. The staff was very friendly and if you like a thin crust pie, which I do, you'll love the pizza.",
   "I love Gabatoni's. The food is pretty good, and the atmosphere is unchanged from when I was a kid. It's truly one of the best examples around of an old Springfield family restaurant. It's a great place for a casual night out."
  ]
 },
 {
  "name": "Cafe Moxo",
  "address": "411 E Adams St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3acb0988-9334-11ea-a674-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10954084329668155454",
  "source": "GoogleMaps",
  "reviews": [
   "Very good lunch today at Cafe Moxo.  I had soup and half a sandwich.  The interior decorations were nice and the staff very friendly.   There was a wide selection on the menu of unique items.  I would definitely go there again.  The restaurant is very convenient to downtown Springfield and easy to get to.",
   "This is a small business to be sure and support during the Stay-at-Home order. Our favorite thing to order is a late breakfast; the sandwiches are always hot, fruit cups and bakery items are fresh. Everything carries nicely from the restaurant to our house.",
   "Very clean and nice place.  The food was good Minus the macaroni and cheese.  Just bland, no flavor and no cheese. Great location. \nThe ordering staff was rude. I tried to ask a question and she was super rude. It was my first time there and I just had one small question. It wasnt even super busy at the time. So a little patience would have gone a long ways. On a positive note...their snickerdoodles....YUMMY!!!",
   "Edit: For full disclosure purposes, I'm keeping the original up. I did not take their offer to make things right. Last time I ordered barbecue, but got buffalo. I may not have said it clearly at the time.\n\n This time I did an online order. Not only was my order correct this time, my food was ready way before the \"order ready by\" time. Ordering and pickup was simple. The staff were very friendly. I highly recommend Cafe Moxo\n\nOriginal Review: Great place with fair prices. They lost one star for messing up my order, but even though I normally dislike what they gave me, I still enjoyed it. I'll definitely be going back soon.",
   "Always a treat to go to Café Moxo, whether for a big lunch or just for a cup of coffee.  Great food, welcoming environment, very clean, and very friendly staff and management.  Shout out to Brandon... always on top of things and always has a big, sincere smile."
  ]
 },
 {
  "name": "Indigo Restaurant",
  "address": "3013 Lindbergh Blvd, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3b1c7098-9334-11ea-8963-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=2247744428863093345",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I went to Indigo last night to celebrate Valentines day.  The service and food was excellent.  Everything was brought out one at a time so we werent bombarded with a ton of food all at once.  We even got a complimentary hummus plate which maybe they offer to guests anyways but it was a nice surprise.  Our server helped us make our night special by taking good care of us and knowing when to just let us enjoy each others company.  We spent a lot but we planned on doing so instead of getting each other gifts so we went all out.  Did not disappoint.  Great job Indigo!",
   "The staff was very helpful. We love to bring our business clients here.   Repeat customer... Will be back again and again",
   "EZ was a great waiter and host.  I thoroughly enjoyed the environment and the food was superb! The only problem is that they're not open for lunch.  Definitely a great dinner spot.",
   "Great server, Lindsay. The duck enchiladas were amazing, the stone appetizer was phenomenal, the tuna main course was perfect! Lobster bisque was wonderful.  Absolutely no negative remarks are necessary!!!!",
   "Indigo was excellent. The atmosphere is cozy and I enjoyed the dim lighting. Our waitress was very attentive and gave lots of information about the menu. Lots of wine and appetizer options, which was impressive. The cheese plate we ordered was good and our salads came with a hummus plate with olives that was delicious. My boyfriend was extremely impressed with the flavor of his filet. I ordered the king crab legs and they were good, just not as flavorful as the snow crab I would normally order elsewhere. The restaurant was a bit pricy but, overall, I enjoyed my experience and will return with friends next time."
  ]
 },
 {
  "name": "American Harvest Eatery",
  "address": "3241 W Iles Ave, Springfield, IL 62711, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3b66994a-9334-11ea-b2f6-14b31f159f22.png",
  "tags": [
   "creative",
   "eat",
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "drink",
   "art"
  ],
  "link": "https://maps.google.com/?cid=17630119276517019226",
  "source": "GoogleMaps",
  "reviews": [
   "This is a first-rate restaurant in an unexpected location. The creative food prepared here is on par with any restaurant in a world-capitol city, not a State one... Tried to eat everything, but the extensive menu makes that impossible. Everything was crafted with care and the service from Kimberly was attentive but unobtrusive. \n\nThis restaurant receives my highest recommendation if you are in Springfield!",
   "This is my favorite restaurant around Springfield. The food is absolutely amazing. Sometimes the descriptions of the food sound like really odd combos, but they always work so well. It is on the pricey side, but it's absolutely worth it. They even have interesting and delicious cocktails. My favorite has been The Dude Abides, which was their take on a white russian.",
   "Great menu creativity, but I cannot bring myself to support an establishment that treats employees the way they do here. Lots of discrimination. I saw zero servers who were not Caucasian, but many minorities working in the back doing dishes and other prep. It’s 2020. Can we please get over this. Not okay and will not support them again.",
   "Menu offers a lot of variety, everything I've eaten here has been pretty good. Expect long wait times for a table, and consider sitting a the bar. Probably one of the best restaurants in Springfield in terms of menu offerings, food quality, and service.",
   "Every detail is extraordinary! The ruby trout was delicious and well prepared, and the accompaniments were both diverse and harmonious. The pear pressure cocktail was a special for that night, and it was fantastic, but the 6 degrees of kevin bacon was a work if art! The candied bacon in the drink was soooo good!!! \nA fantastic find for the drive between Chicago and St. Louis!"
  ]
 },
 {
  "name": "Engrained Brewery & Restaurant",
  "address": "1120 W, Lincolnshire Blvd, Springfield, IL 62711, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3bb184fe-9334-11ea-b57c-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "delicious",
   "knowledgeable",
   "delicious",
   "learn",
   "knowledgeable",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3952841355362562508",
  "source": "GoogleMaps",
  "reviews": [
   "Definitely one of the best dining out experiences I've had in recent memory. Food was fantastic & local with a wide variety of choices. Beers were the same. Cheese curds were even better than Mar's Cheese Castle. Kids were happy. Ian our server was friendly & helpful. Can't ask for much more!",
   "Kayla our server was terrific. We each ordered a paddle of beers.  She was very knowledgeable.  Started with cheese curds that were pillow soft and so flavorful.  The spicy dipping sauce worked with the cheese beautifully.  We shared a harvest salad.  It was delicious. Pecans, blue cheese crumbles, fresh greens a maple vinaigrette that I wasn't sure about but it was really good.   Hubby had the fish and chips I had the ruben, both with these great natural French fries.  Fish was perfect sandwich was awesome.  Next time we're in Springfield we'll definitely go back.",
   "Absolutely love coming here when I'm visiting Springfield! Last time we came through they had a  tasty Blood Orange IPA on draft that was delicious and paired nicely with the featured Poutine Burger. Ian made our visit a memorable one and he had some great recommendations as we loved the loaded potato cakes! He was also very knowledgeable on all the food sources and beer making process and it was really cool to learn about! Can't wait to come back for a horseshoe soon.",
   "Always on the lookout for a good reuben. They make their own corned beef and dressing, have fairly fresh crout, and marbled rye. Was delicious! Good, but not great, beer.",
   "Kayla was absolutely the best!   Very attentive and yet not intrusive!    She knew the menu very well and answered all of our questions!   The Mikes Hot Ham was phenomenal.    Great food and great service made for a very enjoyable meal!"
  ]
 },
 {
  "name": "Loukinens' On Fourth",
  "address": "517 S 4th St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3bfbfc02-9334-11ea-a3f2-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11484508373709547329",
  "source": "GoogleMaps",
  "reviews": [
   "My fiance took us here for our Valentine's Day dinner and we had a fantastic time. The food was delicious and I would highly recommend the jumbo  sea scallops. The best aspect of this restaurant, hands down, is the service. From the time we entered Loukinens' we felt welcomed. Our waiter was exceptional and gave great recommendations. Will definitely return in the future!",
   "Great food and service! The atmosphere is also quite pleasant. This is a fine dining establishment and the prices reflect that, but in my opinion it is worth it. I will definitely be back.",
   "The place looks nice and the food is delicious. I went there with my family and everyone enjoyed the food. We had an amazing time. The service was great, they made is feel special and fancy. I will definitely recommend it for another family or a couple.",
   "Uhhhh... Amazing. I could start with how the simplest offering; the bread (House made) paired with whipped butter playfully infused with strawberry and tarragon is simply amazing! \n\nThe Manchurian Cauliflower: Amazing\nFrench Onion Soup: Perfect\nSalmon: Flawless\n\nThe service was excellent, as was the ambiance. I'll be back whenever I'm in town!",
   "Our office just had our Christmas lunch at Loukinens' on Fourth and everyone was wowed!  The comments I received back were: outstanding food; above and beyond service; best restaurant we have ever gone to for our Christmas lunch; on and on!  One of our staff had their 2 year old with her and they brought out toys for him to play with and helped entertain him.  Definitely on our list of go-back-to restaurants."
  ]
 },
 {
  "name": "Augie's Front Burner",
  "address": "109 S 5th St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3c449e0a-9334-11ea-98da-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17949552980987485451",
  "source": "GoogleMaps",
  "reviews": [
   "During a weekend visit to Springfield, someone we met on the street recommended Augie's. We four had a SUPERB meal while snow blew furiously outside. One in our party has several diet restrictions--no problem: a wonderful, piping hot dinner appeared, made to order. Our lovely server was gracious and attentive.",
   "This place is always delicious and an extraordinary value! Don't miss it! Just had the shrimp and grits! Tasty!",
   "The Thursday three course option was excellent. The food was original and stupendous.",
   "Lovely place for any meal. All of the food was very fresh, flavorful, and beautifully plated. Highly recommend the lobster bisque. The waiter was friendly and attentive. Our food was out in well under 10 minutes, which is a miracle considering the high quality of the dishes. This place will definitely be a stop the next time I'm in Springfield!",
   "Usually go for the Elk Burger, which is a seasonal item not currently available. No worries, there menu is loaded with lots more options. Can't go wrong at Augie's"
  ]
 },
 {
  "name": "Cooper's Hawk Winery & Restaurant",
  "address": "2501 Wabash Ave, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3c8cf1e2-9334-11ea-94dc-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "eat",
   "delicious",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16860810084554640856",
  "source": "GoogleMaps",
  "reviews": [
   "What an amazing restaurant,  I can say I was fully satisfied and our waitress was amazing! The appetizer portions were worth it.  Happy Hour is from 3-6pm with great prices.  The Lux wine flight was fabulous. We visited at 5:30pm and it wasn't to busy.",
   "The food was amazing. The service was amazing from the moment we walked in the door. The cheesy bread beyond addicting and the cocktails are out of this world. This place seriously is one of the tastiest places I have ever been to. Their salad bar was so yummy and had a great kale Cesar salad. We had such an awesome experience celebrating a birthday, we will definitely be back.",
   "We had reservations and were immediately seated. Our server, Brandi was very helpful, friendly and attentive. The food was absolutely delicious. The wine selections we had were very good.",
   "Love the Gnocci with Roasted Butternut Squash! Server was very nice and friendly I just wish they came around more often and it didn't take 20 minutes to get the check. So if you're not in a hurry and looking for a nice place to eat and be social this should be great.",
   "short rib grilled cheese... good moist meat. Completely melted cheese blend and toasted to perfection.  Very solid sandwich, comes with tomato soup for that nostalgic dipping plus a side of fries.  Give it an 8 out of 10. \nSoy ginger salmon with wasabi mashed potatoes... the mashed potatoes were delicious although no hint of wasabi flavor.  The Asian slaw boasts cilantro, which I didn’t taste or see, but still super yummy and full of shaved veggies, salmon was on point, moist and cooked perfectly 7 out of 10 on this dish\nGrapefruit martinis did not disappoint, plus we got a free sample of some their very own home made wines.  Over all very impressed with the atmosphere, service and food.  Ask for Anthony, he was one of the best servers we’ve ever had-start to finish!"
  ]
 },
 {
  "name": "VELE",
  "address": "524 E Monroe St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3cdb39cc-9334-11ea-9c9c-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food",
   "delicious",
   "free",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=5080889984642030303",
  "source": "GoogleMaps",
  "reviews": [
   "We sat at the bar and the servers were incredible and attentive. I was craving for spaghetti but had mistakenly gotten a very spicy seafood spaghetti sans seafood. It wasn’t edible so I got pasta with marinara. It was ok. It doesn’t come with anything else so I had a bowl of pasta. Hubby had the seafood spaghetti. Bill was $100. Not worth it but the atmosphere was nice.",
   "Octopus appetizer was to die for. The fresh squid ink pasta w seafood was okay. The pasta itself w sauce was good but I was expecting chunks of seafood not just a few over cooked scallops. It was the end of the night so maybe they were out of seafood but in which case they should've told me. The service was Sooo slow and they only had four tables going... After they told me the kitchen was about to close and I better hurry I waited 15 min to take my order. anther waiter finally came to help me. I wish he stuck as my waiter because I kept waiting for the girl assigned to come back she was super friendly but really not aware. Throughout the night instead of coming to me she would just chit chat off to the side. I'm def coming back for the octopus...that's what's bringing me back. and I'll try something else. My drink sea and smoke..okay...presentation was cool but I guess you don't go to Italian restaurants for the cocktails. I was going to give it a three but I know it has potential and the octopus was awesome and pasta (minus seafood) very good plus cute space and ill give it another shot.",
   "Bravo! Everything about the whole dining experience was excellent - the very friendly and warm welcome, sophisticated service and the main event - the food! Oh the food! Absolutely divine. We were limited on time so we just had shared appetizers but what we had was enough to know that we WILL be returning to experience more Vele! Thank you for a wonderful dining experience.",
   "We had a wonderful extended dining experience. From the hostess, to the service, cocktails Wine and Food, we really enjoyed ourselves.",
   "Wow! The vegan tofu dish I had was amazing. It was served over a bed of rice and greens, gluten free as well. Everything we ate and drank was delicious. I can't wait to eat here again"
  ]
 },
 {
  "name": "Nick & Nino's Penthouse Steakhouse",
  "address": "700 E Adams St fl 30, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3d22065c-9334-11ea-9f8f-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "unique",
   "food",
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7369673151901554055",
  "source": "GoogleMaps",
  "reviews": [
   "Service was excellent. Our waitress was amazing. Super nice, boxed up everything for us when we were done and took our picture for date night. The food was excellent. The bread basket is on point and offers a diverse group of different breads to try out. The lobster bisque was really tasty. Altho I am a fan of a little spice in my food, which is what made the bisque have a unique good flavor. The steak was cooked perfectly, it did have a bit much fat on it for my liking but that definitely didn't take away from the excellent flavor and the perfect medium rare cooking of it. We also ordered the hash brown brick. Definitely worth trying. Seasoned really well. Does need ketchup, not because of flavor but because it is dry, in my opinion. Dessert was phenomenal. We chose the Apple cheesecake and 9 layer chocolate cake. They have so many options available. There drink menu is worth sticking around for. They make delicious beverages. I ordered a spicy margarita drink and a filthy Manhattan. All of the flavors of each drink blended just perfectly. We didn't have a single bad thing there. Absolutely look forward to going back. The atmosphere is welcoming and the view over the city is pretty cool, since it is located on the 30th floor. The bar on the other side \"Pinnacle lounge\" I believe is what it's called, is bad. Don't go there. They do not know how to mix a drink properly. The amaretto sour I ordered tasted like weak Dollar general off brand koolaide mixed with pool water. Luckily tho that bar doesn't have anything to do with Nick and Nino's. Def go check out Nick and Nino's for great food, great service, and a romantic atmosphere.",
   "Rick was the kindest, most attentive server I have ever had! He knew every detail about everything on the menu. Complements to the chef because everything was cooked perfectly. It was a joy to be served by Rick and enjoy a perfect evening with delicious food.",
   "Best steak and service in Town",
   "The service and food are excellent, and the atmosphere is unmatched in Springfield.  I would recommend N&N’s for a romantic date night; HOWEVER, be weary of the markup on wines. We were charged $44 for a $10 bottle of moscato (La Perlina).  I understand there’s an up charge for wines in restaurants, but 4.5x the retail price seems a little greedy to me...",
   "Very cozy romantic place to have dinner while looking out over the city. I had the firecracker and grilled shrimp aside my pork steak and my date had the rack of lamb. Everything was delicious and she was pleased too. The waiter was very nice as well."
  ]
 },
 {
  "name": "Little Saigon Restaurant",
  "address": "1531 Wabash Ave, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3d6cf222-9334-11ea-9332-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "delicious",
   "food",
   "tasting",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=5852947841541326522",
  "source": "GoogleMaps",
  "reviews": [
   "Wait staff is always very friendly and upbeat! Occasionally you may have to ask them to repeat what they said if you aren't accustomed to their spoken language, but they are always willing to clarify. The food is consistently delicious and arrives to the table very quickly. Great for date night!",
   "Restaurant gives good vibes. I strongly recommend either filtered hot coffee or avocado smoothie. Vegetable Soup was amazing. Curry fried rice and eggplant dish was delicious.",
   "I was visiting Springfield and this little gem was close to my hotel and decided to try it after seeing the reviews. The restaurant is easy to find and there's ample parking available onsite. The place was extremely clean and I even witnessed one of the waitresses inspecting every table to make sure it was 100% clean. The attentiveness of the staff was also very respectful and friendly. As for the food I ordered their pad Thai and it was amazingly delicious. The noodles had a distinct taste of garlic and other Asian flavors that wanted you to have more of it. Definitely recommend this place for a nice quiet dinner.",
   "Take out orders are always ready when I arrive. One of my favorite places. Great tasting food. Especially like the satay chicken appetizer. I often order it as a meal.",
   "Authentic pho here with fresh vegetables, basil, jalapeno, etc. Their taro freeze was amazing as well. Hot and sour soup was spicy and full of fresh vegetables. The tripe in the Saigon pho was cooked to perfection and was delicious. Our server Emma was very attentive, happy, and a pleasure to have wait on us. It's worth going out of your way for this place!"
  ]
 },
 {
  "name": "Mariah's Restaurant",
  "address": "3317 Robbins Rd, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3db19c34-9334-11ea-bf91-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11914080109075325315",
  "source": "GoogleMaps",
  "reviews": [
   "The food was amazing as always. Had a small mix up With the order ,but they went above and beyond to make it right when it could have very easily been my fault.  Can’t say enough about the food and service.  We will be back very soon.",
   "Beautiful and amazing restaurant, nicely decorated. Food is very delicious, very generous served portions at a reasonable price. John, our Server, was very attentive and polite. He made us feel at home. Highly recommend this beautiful Log Cabin Restaurant (Italian Steakhouse).",
   "We pre-ordered and paid for Easter dinner. It was to be ready to pick up at noon. I got there at 11:55 am and waited in line until 1:30 pm for food. The food seemed cold and and I asked if it had been setting around long. I was told that I was lucky that I got food at all since it is a pandemic. I also heard the person handing out the food tell another customer that it was not his problem that their order was wrong and take what they could get.  When I got home checked the food, the 4 gravy containers were punctured in the top like some one put their finger through it. There was gravy everywhere. The prime rib was very tough and over done  I think that for $140, it would have been a better experience. \nNo one should patronize them any more.",
   "My wife and I went here to celebrate valentine's day early. The food was fantastic! The bone in ribeye was cooked to a perfect medium, and the calamari we had as an appetizer was by far the best I've had outside of a coastal city. My wife was singing the praises of her filet for two days. Our server Carie provided us with expert service that was both attentive and friendly. This was truly the best dining experience either my wife or I has ever had. Thank you for making our date perfect.",
   "I like to call this place one of Springfield's bed kept secrets. AmaZing food, great service, and the steaks cannot be beat. The ambiance is fantastic and their are two fireplaces to keep you cozy. They have U SDA prime steaks. One of my favorite places to eat."
  ]
 },
 {
  "name": "Lake Pointe Grill",
  "address": "1386 Toronto Rd, Springfield, IL 62712, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3dfc39e2-9334-11ea-bf13-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "family",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=14106744498101824596",
  "source": "GoogleMaps",
  "reviews": [
   "Corned Beef, cabbage and potatoes from Lake Pointe Grill are so good. Food was delivered so quick and was still piping hot! Thank you Lake Pointe for saving our 8th wedding anniversary!",
   "The food was delicious! The chips and dip were so good.  The salsa was the best I ever had.  My husband had the stuffed meatloaf with real mashed  potatoes and green beans. He really liked it.  I had the Michigan Ave. Pizza.  So good!  Eric the bartender was our server.  He made the experience  so fun and made the best martini.  I would recommend this place!",
   "Loved the food, the variety on the menu (including vegetarian options), and most of all, the amazing service! So friendly, helpful, and quick! All of our food was delicious. We will definitely come back if we're in the area again.",
   "The new menu is great.  We appreciate the great hospitality of your staff and the family friendly atmosphere.  Be sure to give this great restaurant a try.  You WILL NOT be disappointed.",
   "It was delicious. service was good. atmosphere is great."
  ]
 },
 {
  "name": "Saputo's",
  "address": "801 E Monroe St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3e3f0ec6-9334-11ea-876e-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=1992020859928274368",
  "source": "GoogleMaps",
  "reviews": [
   "Good Italian. Good service, nice atmosphere. My only complaint is that everything pasta wise has pork- the ravioli, the meatballs, meat sauce, etc. Nothing is only beef. Only way to avoid it is to get the cheese versions and/or order marinara.",
   "Awesome home style italian. Chicken parmigiana was the best. Red sauce is to die for. Service is great. Nothing bad to say.",
   "Saputo's has recently become a new favorite of mine. Their salad dressing is superb. Their stuffed manicotti with meatballs is my absolute favorite. The service is always great and the food is hot and tasty. Alfredo is delicious also and definitely homemade. I have not had a restaurant that I have ever craved like I crave Saputo's. Love that place. Hope I can eat there again soon!",
   "The service was excellent. The food was good but did not justify the high price. The marinara sauce was tasty but is rather spicy, which was unexpected and not enjoyable. The linguine with white clam sauce was watery. Not a sauce more like a broth. They packaged our leftovers in leakable containers. When we got home and lifted the bag out of the car the bottom was soaking wet, broke through and the food ended up in my car and on the driveway. Again it was not a bad meal but certainly did not justify the prices.",
   "Dinner was delicious and beautifully served. The table and decorations were love as was the ladies room.  Thank you so much for getting us in an hour before our expected time.\nAlso about a month ago we came and picked up take out for our daughter and grandchildren who were returning to Chicago on the train.  That meal was perfect and deliciously hot when they got to eat it around Lincoln."
  ]
 },
 {
  "name": "Westwoods Lodge Pub & Grill",
  "address": "2406 W Jefferson St, Springfield, IL 62702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3e87898c-9334-11ea-b839-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15840126254564976391",
  "source": "GoogleMaps",
  "reviews": [
   "Westwood's is a great place. It has a good selection of craft beer, unique foods, and a good atmosphere.",
   "Enjoyed the Friday night fish.  Even though not real walleye, the fish was very tasty along with the sides.  Mrs had catfish and she really enjoyed her meal.  Posted picture of the real thing tho from real life experiences.",
   "Great food and drinks with an outdoors theme. You can go with standard bar food, or try some of their nice dinners and custom gourmet burger recipes.",
   "Great food love the decor great food creations.",
   "good food service started out good drink order quick \nthen down hill from there two came on after us then seven came in then drinks served to both groups server left came back took and delivered order for seven before  us she had to be reminded by other group of two we had been seated before them  neither of us had our orders taken yet"
  ]
 },
 {
  "name": "Texas Roadhouse",
  "address": "2540 W Iles Ave, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3edfe2e2-9334-11ea-bf3a-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=237706526098816060",
  "source": "GoogleMaps",
  "reviews": [
   "We usually have a fairly large group when heading to Texas Roadhouse. It doesn't seem to cause any issues for them which is nice. They have many tables setup for large groups and are fast at turning them around. That being said, busy nights like Friday and Saturday you will still likely have a moderate wait. I believe they still offer call ahead to save a spot in the que which is nice. Kick back and enjoy y'all!",
   "Texas roadhouse in general is a family favorite! However this one is a personal favorite! All of their staff is always kind and on top of it! Always feel welcome and well taken care of! Including pictures of their menu because I always love being able to look at that.",
   "The ribs I had were excellent. Very tasty and and done s they should be. My wife's rib eye was a bit tough and not as done s she had ordered. The waiter was good but it took a long time to get an extra condiment.",
   "This place has now been added to our favorite places for dinner! Server, Nicole, was very attentive without being a nuisance. Food was prepared to perfection. Festive atmosphere yet we could talk without screaming. Well worth the wait!",
   "We had a party of 8 guys. They got us in fairly quickly, once seated we got drinks fast. Amanda our server admitted she was only in her first week. The group of guys gave her a hard time and she played right along! She was great! All around I would definitely recommend this place! \nSteaks were all cooked as ordered, food came out in order."
  ]
 },
 {
  "name": "The Feed Store",
  "address": "516 E Adams St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3f1b3e6e-9334-11ea-9144-14b31f159f22.png",
  "tags": [
   "walking",
   "food",
   "eat",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=2920943408296949798",
  "source": "GoogleMaps",
  "reviews": [
   "Who knew that a twenty foot wide store front across from the Old State Capital and within  walking distance from all important state offices, would have the depth to support a lunch time menu. But the line along the west wall and few, few empty wooden chairs tell the story. There still is a wait for  so plan accordingly and when delivered  to the table, you know why this is the cross road of tourist, visitor and government staff.",
   "Stopped in for lunch on a recent Friday at 11:30am before the noon lunch crowd. The place had customers but was good timing on my part. I ordered at the counter; potato soup, half a sandwich-chicken salad on whole wheat bread. The soup was excellent good potato flavor, chicken salad was good but void of any real flavor. NOTE: you order at the counter and they bring your food to your table.",
   "Great food sandwiches soups drinks. I worked there years ago, nice people to work for and with. But it's only part time. Had to leave for more hours. Just a great place to eat.",
   "An hour and half for a sandwich and chips? And then the sandwich is practically meatless (pastrami was hardly there). POOR! A heads up would have been nice that the wait was going to be awhile. ☹️",
   "Fast service, no frills, amazing sandwiches and soup. Their chicken salad is amazing, and comes highly recommended. Affordable and comfortable."
  ]
 },
 {
  "name": "Flavor of India",
  "address": "3124 Montvale Dr, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3f66c6ae-9334-11ea-aebf-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "affordable",
   "delicious",
   "food",
   "eat",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=7769772646794672917",
  "source": "GoogleMaps",
  "reviews": [
   "We have been going there for nearly 8 years. The food is consistently delicious, very affordable and outstanding service. Words are not adequate to express how much I recommend this place. Go and check it out!",
   "Not a lot of flavor from spices in their dishes on the lunch buffet, and the sauces were quite watery and not thick enough.  Not bad, per se, but not exactly good.  Seriously disappointed.",
   "Food was fresh and delicious. We were served quickly with attentive service. Food is spiced from 0-6 on a scale. I am usually a medium spice person and a 3 was just about where I liked it, but am glad I didn’t go higher. Glad they kept my water refilled The Who time. Chicken tandoori was delicious.",
   "Great Indian treats! Everything at lunch was exceptionally fresh and tasty, nicely spiced and hot! Will eat here again for sure, affordable and wonderful service.",
   "Not as flavorful. First time and was a bit slow to take order. However I have been told this is better than gateway to India so choose wisely. Will visit again and update accordingly."
  ]
 },
 {
  "name": "James' Home Kitchen",
  "address": "2901 Chatham Rd, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3fb534c8-9334-11ea-84cd-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "family",
   "food",
   "family",
   "food",
   "food",
   "music",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9474890685443167222",
  "source": "GoogleMaps",
  "reviews": [
   "Incredible authentic fresh cooked food. Don’t be in a hurry but slow down. Have a drink and enjoy. Wonderful people too. You will not see a food truck making deliveries here. Everything fresh.",
   "Food is very fresh and everything, yes we've had it all, is spectacular. The staff is incredibly friendly and helpful. You couldn't ask for better owners. It's very evident how much love they have for their business and their customers. The setting is very comfortable and casual, and the restaurant is immaculately clean (even the restrooms). This restaurant quickly became a family favorite.",
   "Wonderful family own place! The owners are so nice and enjoy talking about the food they serve. Everything tasted treat from start to finish! We had pot stickers, wings, bulgogi beef, honey chicken and brisket...soooo good!!!",
   "Very good food...but it was slightly strange eating Asian food in a log cabin while listening to josh groban music",
   "I’ve been dining at James Home Kitchen for over two years and it has been excellent every time. It’s genuinely my favorite restaurant and I recommend it to everyone when discussing restaurants. James himself frequently checks on the tables to ensure everyone is satisfied. I’ve seen him sing happy birthday to customers and he’s personally brought me a free sample dish of popular Taiwanese food."
  ]
 },
 {
  "name": "Alexander's Steakhouse",
  "address": "620 Bruns Ln, Springfield, IL 62702, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/40018050-9334-11ea-8cc8-14b31f159f22.png",
  "tags": [
   "unique"
  ],
  "link": "https://maps.google.com/?cid=2139210732619451801",
  "source": "GoogleMaps",
  "reviews": [
   "Staff has always been friendly. We usually do not get a reservation, however I would strongly suggest it. It was a very busy night when we went. As always the salad bar is by far one of the best things about the place. It is a simple bar but you can load your plate up with about anything you want on a salad. The dressings are all great also. The steaks are always perfect. We always cook them ourselves but their cooks do a fantastic job also. I will usually chat with them while cooking my steak. Will be back for another dinner.",
   "Always friendly staff. Bar is secluded and off from restaurant. Great salad bar for meal. Cooks are great. Fun to cook your own! Great price and quantity as well as quality! Great specials. Never had a bad meal. Great selection!",
   "Casual steakhouse, with tasty steaks! Meals come with a salad bar, baked potato, and Texas toast. It offers the unique opportunity to season and cook your own steak (meat), or let their chef do it for you. I loved the salad bar because I could doctor my potato with all the fixings. And their famous skillet cookie was amazing (as you can tell by the empty skillet)! Absolutely wonderful meal!",
   "Best steaks by far. Nice atmosphere and hot waitresses. The men are kinda hot too!! Be sure and ask for Brooke, she's my favorite, although the entire staff is great!",
   "Too pricey for the less than basic meal.  My husband felt we were at a resurrected Ponderosa.  Atmosphere was not up to speed, the tables and chairs were thrown in of no matching decor.  The most attractive site was the unused grill in the center of the restaurant.  The least attractive was the packaged loaves of basic bread that take out restaurants use.  My husband took me there to celebrate my birthday, I wish we were at our frequent visited seafood joint (Chesapeake).  Scratch the outdated salad bar, Update the settings and never offer swordfish are a few starters for an improvement project.  Match your prices with your products and services, customers deserve better."
  ]
 },
 {
  "name": "Tacology 101",
  "address": "219 S 5th St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4047631c-9334-11ea-967a-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=1838694008425202376",
  "source": "GoogleMaps",
  "reviews": [
   "The food was amazing. The flavors will make your tastebuds dance. I can't wait to go back. I tried the fish taco and it was lite and fresh. The sides were well cook too.",
   "This place is a pleasant surprise. The food is delicious, large portions and I found the price to be very reasonable. Definitely recommend this place.\n The food is more authentic than you will find at most places. Keep this in mind if you prefer American Mexican food or haven't had authentic Mexican food.",
   "This place is absolutely amazing! I'm from San Diego and these tacos and appetizers could compete with anyone who comes from the border! Their fries were as crispy and thick cut as could be, and their Nashville tacos were so spicy and delicious. I would give it a 7/10 on the spiciness scale and it's definitely something that hits you on the back end. I absolutely respect their owner who was out working with the rest of his workers. This is a wonderful taco place. Well worth the price!!!",
   "Whom I believe is the owner or manger. Talked down to me as a customer. Was rude when I wanted to check and make sure my whole TOGO order was in the bag. Was rude when I asked his opinion And never told me there was a charge to have the order placed Togo. Word of mouth is more then any review. The food was good but not original Mexican food. Will not be back abs will be sure to review every website that it affects your business",
   "Great tacos! Must eat in Springfield IL👍"
  ]
 },
 {
  "name": "Joseph's Fine Cuisine",
  "address": "3153 Hedley Rd, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/408ea6ba-9334-11ea-a401-14b31f159f22.png",
  "tags": [
   "unique",
   "eat",
   "food",
   "food",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=13887394370900652664",
  "source": "GoogleMaps",
  "reviews": [
   "Unique twist on food. Not strange but interesting and tasty!  If you want to eat somewhere that doesn’t taste the same as your typical chain restaurants, try this place! Ate here for the first time today. People ACTUALLY dressed up. Wished there were more veggies on the plates but what was there was yummy!  And the desserts?! Oh my!  So good!",
   "Food is amazing! Looking forward to their 5 course meals they offer! Their chef and staff make this a place somewhere we want to keep coming back to.",
   "The lobster bisque was some of the best I've ever had! Every single dish was perfect and the kitchen was so quick. The staff are wonderful and the service was top notch.",
   "First visit was fine. Second lunch visit was Friday 12/6. The bartender & apparently only server were the same. She seated us with menus, no water, nothing. We could have been content for a bit if she had at least offered to get us some wine BUT 20 MINUTES LATER SHE NEVER RETURNED. NEITHER WILL WE! There are way too many dining choices now in Springfield to take a chance on this place. Too bad...it had possibilities, but don't waste your time and money. BB",
   "Impressed with this newly opened restaurant. Good wine list, great appetizers, tapas, menu and even dessert! Staff was knowledgeable and friendly! Great bartender. Love the open kitchen! Unexpected surprise."
  ]
 },
 {
  "name": "Mimosa",
  "address": "4201 Wabash Ave, Springfield, IL 62711, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/40d4fd74-9334-11ea-b7a2-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5451326066865705579",
  "source": "GoogleMaps",
  "reviews": [
   "My wife and I stopped in for lunch because we were at a nearby business. The food and service were both excellent. We would definitely recommend this place to anyone who enjoys this cuisine.",
   "Food is amazing. I loved the avocado smoothie and curry fried rice. General TSO chicken is pretty good too. Ambience is very soothing. Although I would suggest to call in advance as the place always looks busy.",
   "A decent Thai restaurant with a standard menu. Portion sizes are big, ambience is good but the service is slow. Would still go again and try out more menu options!",
   "Decent place with peaceful ambience with good food",
   "The entrees are great.  The sushi lunch special is a fantastic deal.  The service has always been great as well."
  ]
 },
 {
  "name": "D'Arcy's Pint",
  "address": "661 W Stanford Ave, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/411f9b4c-9334-11ea-9b83-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15217408959370926883",
  "source": "GoogleMaps",
  "reviews": [
   "Very friendly service and very attentive service, I love it when I never see the bottom of my glass. I ordered something called a horseshoe and was very disappointed. I'm not sure of the idea and why it was created. Maybe, just trying to be different. I would rather have had and open-faced  beef sandwich with fries on the side.\nOther than that was my mistake in ordering it because we are new to the area and like to try new dishes, this was one I could do without.\nNow the restaurant itself was very nice for an Irish pub theme. Enjoyed myself immensely in it's atmosphere and among long time local patrons as well as the employees. I love to see just everyday local people that aren't these picture perfect servers. We're from out west and it seems that unless your tall and leggy and have a perfectly shaped backside, your not going to get hired as a server. Good decision on hiring just normal everyday folks with good attitudes and warm smiles. I will be back, just not for the horseshoe, by the way, my wife, loves the horseshoe.",
   "I got the corned beef pony. The corned beef was thinner than I expected but it was fresh! I think if I get the pony again I would get the hamburger. There was too much cheese on the corned beef for my liking. I think the hamburger would be the perfect thickness for the amount of cheese they serve.",
   "It's one of the most popular restaurants in town for good reason. The horseshoes are the best I have had (and I have tried a ton of them) and they are just consistently good. I have had the same order here for 17 years because of that. There is usually a wait to be seated when I come but the kitchen gets food out fast so they turn around tables pretty rapidly so you don't have to wait super long. If you like buffalo chicken definitely get the horseshoe of it with the spicy cheese sauce because it is the best thing on the menu.",
   "Fast food time with 5 start quality dinner, and very friendly staff, please remember even if you pick up your order to tip the workers in these rough times they still get the same pay as if you went inside to eat. The kid who brought out my food almost cried i gave him a $5 tip as i was the only person who left a tip this week",
   "I discovered this place on a road trip a few years ago and now it is my stop for lunch if I go by. I live in Michigan and would drive here monthly if I could. Their horse shoes and ponies are delightful. They are melt in your mouth comfort food. I recommend this place to anyone especially if your looking for the shoes. Line can be long, either wait or sit at the bar."
  ]
 },
 {
  "name": "Charlie Parker's Diner",
  "address": "700 W North St, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4170c8be-9334-11ea-aa04-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "historic",
   "food",
   "delicious",
   "delicious",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=3219201563593604853",
  "source": "GoogleMaps",
  "reviews": [
   "Tons of food. Buffalo shoe was amazing. So was the country fried steak breakfast shoe. Omelet was not my favorite. Great friendly service!",
   "During an otherwise of town excursion with my family we stopped in at Charlie Parker's. It was near closing time, we had an hour and a half to dine. It was packed. The aroma as we entered was intoxicating. It smelled so delicious. We didn't have to wait long to be served at all. We had a restless toddler with us and the wait staff were fantastic at accommodating us. Patricia, our wait person, was amazing. We will be stopping in again when next we're in town.",
   "It's a historic place to get a historically great breakfast. Giant pancakes? Great coffee? Friendly service? They got it. If you're unfamiliar with the edible shoe, we'll they have a nice selection of those also. It's a Midwestern thing. You won't leave hungry that's for sure. They also have a food challenge available but good luck with all that.",
   "We just moved to Illinois,  decided to take a road trip to Springfield and visited charlie parkers diner. It was delicious! And the portions are so hearty. We all enjoyed it and will be going back again for sure!",
   "Charlie Parker's Diner was amazingly FAST! And delicious! My breakfast was very good and came within just a few minutes of ordering. Eggs were perfectly cooked over-easy. My coffee cup was never empty. Families with little kids, grizzled guys in hats, a group of 6 ladies and everyone in between were all served by the fantastic waitresses with smiles all around. It really doesn't get better than this!"
  ]
 },
 {
  "name": "Kiku Japanese Steak and Seafood House",
  "address": "3050 Lindbergh Blvd, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/41c10bf0-9334-11ea-9db9-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=8357009920027459754",
  "source": "GoogleMaps",
  "reviews": [
   "We went for supper at 5pm. It was nice to be seated right away and not have to wait to be served hibachi until others arrived.  Our waiter and hibachi cook were amazing.  The food was great. The cook was very entertaining and since we were by ourselves it was a little romantic.",
   "The restaurant has pleasant atmosphere.  You can sit in dinning area or hibachi.  We sat in the dinning area.  The staff was immediately at our table to take drink orders.  We all choose the multi course meals which include soup, salad, and entree.  The food was well prepared.  I would suggest that they would be less aggressive around clearing plates.  I had to tell the wait person several times that I didn't want my plate taken as we were sharing food among the 3 of us.",
   "Everything I got to try surpassed my expectations. I love sushi but Kiku set the bar pretty high. Very fresh tasting sushi. Volcano roll and shrimp tempura roll are definitely my favorites. Definitely coming back, would love to try the hibachi grill.",
   "Had a wonderful time celebrating my birthday here.  The other people sharing the table were also celebrating a birthday. \n  Not only was it fun and entertaining but every part of the dinner was wonderfully cooked to perfection!  And they brought us a birthday treat!  I loved it!",
   "Meal was good (miso soup was just okay). Menu is more American-Japanese than completely authentic. Service was excellent"
  ]
 },
 {
  "name": "Curate",
  "address": "2930 Plaza Dr, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/420763d2-9334-11ea-8479-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1474980538252187131",
  "source": "GoogleMaps",
  "reviews": [
   "Mike and I had dinner here for the first time at the end of February. Wonderful dining experience!! Autumn was a delight!! If I could give 6 stars, I would! Great date night with my mate! We will be back!",
   "We really loved this place. 1st time there since their opening. Love the way they have changed the look of the place. The food and service was just outstanding. The pasta in a parmesan cheese bowl is a must try. Will be back soon.",
   "This is a small business to be sure and support during (and after!) the Stay-at-Home order. We love Curate, but I especially want to review how great their carry out dinner was last night. The menu has items from Curate and VELE, and if you haven’t tried it yet, I highly recommend. \n\nWe typically do not like carry out from anywhere, so at first were a little suspect about how the food would be “to-go,” but the way they package the food actually carried extremely well from restaurant to house and it was all still hot. They put all of their sauces and garnishes in little containers on the side so nothing gets soggy or out of place (even the dishes that come on top of their awesome mashed potatoes!), and the fish and chips is something we probably would never order at the restaurant, but we got it to go last night and it was insanely good—still crispy and hot by the time we got home!",
   "Absolutely AMAZING dinning experience!  The food was exceptional and the service was impeccable - warm and friendly!  Their menu was like nothing I've seen!  Small portions which enables patrons to sample several entrees in a single outing - a great concept!",
   "Eclectic food, excellent service and a warm and inviting ambiance. Make sure to try the Truffle Cacio e Pepe and the Roasted Brie--absolutely delicious!!"
  ]
 },
 {
  "name": "Xochimilco Mexican Restaurant",
  "address": "3210 Northfield Dr, Springfield, IL 62702, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/425313b0-9334-11ea-a504-14b31f159f22.png",
  "tags": [
   "drink",
   "tasting",
   "food",
   "walk",
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1475879410013788807",
  "source": "GoogleMaps",
  "reviews": [
   "Just beat a large group tonight. Great waiter tool our drink order and brought some warm chips and salsa. Food order placed. Dinner served quickly and was hot and fresh tasting. Great job.",
   "No question about the fact that Xoci is the BEST mexican restaurant in town! When you walk in either location you feel like family and everyone will always remember you. Amazing food and amazing service- Will always highly recommend",
   "Warm tortilla chips and salsa upon being seated. Freshly cooked Mexican food. Gracious, attentive staff. Ample portions. Relaxed atmosphere. Tables, booths and bar seating.",
   "Just got to go for pick up. Amazing job guys! Thank you!",
   "It was really good. The servers were very friendly and pretty humorous.  The food came out very fast. The portions were large and very flavorful."
  ]
 },
 {
  "name": "Old Luxemburg Inn",
  "address": "1900 S 15th St, Springfield, IL 62703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/429b8e28-9334-11ea-b336-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14553710669572812897",
  "source": "GoogleMaps",
  "reviews": [
   "Food was exceptional for a family or friends gathering although the seafood platter seemed to be more breading than seafood. Wait staff were kind and always had that cheer that you don't always recieve. All in all, I would say it is a hidden gem of Springfield.",
   "This is one of those restaurants that has been in Springfield for ages. There is a reason it has lasted so long and is one of the city's favorite places to eat steak and lobster. The food and atmosphere are good, and I always enjoy my time at the Old Lux.",
   "Food was delicious and very good size portions. Steak was juicy and tender. Good atmosphere and staff was friendly",
   "Waitress was overwhelmed with too many tables.  Fried Chicken was a lot of breading and so crispy hard to bite in to.  Steaks looked good.  Tried my husband steak it was tasty.",
   "This is a great place to get a steak dinner! Very friendly staff and the place has a cozy atmosphere. I was just a bit disappointed that they don’t have beer on tap."
  ]
 },
 {
  "name": "Boccardi's Italian Imports",
  "address": "3132 Cockrell Ln, Springfield, IL 62711, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/42e20dee-9334-11ea-afc4-14b31f159f22.png",
  "tags": [
   "food",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3026642627053162738",
  "source": "GoogleMaps",
  "reviews": [
   "Great food and service! Outdoor dinning, easy parking. My girlfriend from New York said it's the best Italian food in Springfield. I think they're all great, but she said it was authentic Italian.",
   "Just ate there for the first time tonight, why oh why did I wait this long? Their meat sauce is one of the best I've had in town. Very friendly staff and of course Maria the owner is so nice.",
   "Every time I have been here they exceed all expectations! Their food is amazing and the service is even better. They have a very well rounded staff that are extremely polite, attentive, and knowledgeable. Must go place for great authentic Italian cuisine!",
   "Absolutely some of the best home cooked italian that I've had in years! Very friendly staff and atmosphere. The lemon marscipone I could kill someone over!!! So 5 stars all day. 6 if I could.",
   "Authentic Italian Cuisine and superb customer service!!! Excellent staff!!!"
  ]
 },
 {
  "name": "Arlington's",
  "address": "210 Broadway, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/43294f4c-9334-11ea-8ba9-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=5349800328390329385",
  "source": "GoogleMaps",
  "reviews": [
   "Great service! Brandon was wonderful. Weird, awesome decor. Fantastic, inventive food. I wonder how long it takes employees to get used to the mannequin in the hallway 😆",
   "Excellent food, fast, professional service and in a relaxed atmosphere.  Our group descended on them like a horde of Vikings and I thought they would be overwhelmed.  But they handled the situation with style.  Friendly, people and for such a small staff, truly outstanding service.\nTop  Mark's all the way around.",
   "One of the the best places to have dinner downtown. The atmosphere of Arlington's is charming and whimsical. Guests arrive dressed in jeans and a ball cap all the way to suits and cocktail dresses. Local artists display their work on the walls. There is no other place like it that I have found in downtown Springfield.",
   "Delicious local delicacy, the pony and horse shoe. Just do yourself a favor and get one.",
   "Food and drinks were good.  Burger was cooked amazingly and rib eye sandwich wad soooooo tender. Really enjoyed the appetizers. They had life music which was nice and not too loud."
  ]
 },
 {
  "name": "Mario's Italian Restaurant",
  "address": "3073 E Clear Lake Ave, Springfield, IL 62702, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/437350ec-9334-11ea-a514-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17409062317114103184",
  "source": "GoogleMaps",
  "reviews": [
   "Went in for the lunch buffet that runs from 11-2.  For a whole $11 + tip it includes a great buffet (salads, antipasto, pasta, pizzas), drink, and tax.  The food is terrific, staff are very friendly people, and the joint is popular.  A great Springfield find!  Will certainly return!",
   "My husband and I recently visited to this place and we both love this place. This is going to be our little gem. He got cheese ravioli with tomato Alfredo sauce with a side of Caesar salad. Ravioli was amazing even though we couldn't say the same for the salad. It wasn't terrible. But It was average Caesar salad. I got Italian sausage sandwich with a side of fries. First of all fries were spectacular! So crispy and fluffy. I love their sausage as well. Well spiced! Over all, I will most definitely return to this place to try other foods.",
   "Always friendly. Food is always great. Excellent service and price. Always clean. Great bar. Comfortable seating. Awesome selection that they have NOT pigeoned just into pizza! A lot of their pasta dishes are amazing!",
   "Great pizza and a Springfield staple. The lunch buffet is good as well. Friendly staff. The bathrooms are a bit small.",
   "Seafood lasanga covered in a Portabella mushroom sauce. The sauce has a very rich flavor. Served with a Caesar salad. Great dinner"
  ]
 },
 {
  "name": "Osaka | Japanese Restaurant",
  "address": "1665 Wabash Ave, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/43b75efa-9334-11ea-82d6-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4361130698818568077",
  "source": "GoogleMaps",
  "reviews": [
   "I have been to Osaka many times over the last year.  This experience was not as good as the previous visits.  We went with some co-workers for lunch.  I ordered the lunch special with two sushi rolls. One of the rolls was semi warm instead of the typical cold temperature.  The service was mediocre and someone in the kitchen shrieked loudly like there was something wrong. Overall it was alright but it seems like the restaurant is starting to get dated and there are patched marks on the walls. This used to be one of my favorite restaurants in town.  The food is generally really good but for the price I think the restaurant could use some updating and maybe a fresh coat of paint.  I realize the aesthetics are not everything but I feel like it is all part of going to a nicer restaurant.",
   "Glen B. @ the Sushi bar is the ONLY reason we gave 5 stars! His ability to carry a conversation,awesome personality & his amazing IMAGINATION with making the most tastiest rolls!!  I'm glad we stopped in, Thanks Glen!!!!",
   "We had a birthday here, and the service is the best I've had from a restaurant. Not only were all of the waiters and cooks friendly, their professionalism with how they did everything from helping me order vegan at the hibachi grill to how they came out with the cupcakes we brought with a sparkling candle all impressed me. I'd definitely recommend Osaka to anyone interested in some of the best Japanese food and service in the area.",
   "The food is outstanding!! From start to finish the presentation and flavor are to die for. Great drinks and atmosphere as well as family friendly. We had the best waitress in the entire place! Daphne is absolutely amazing and I will always make sure to request one of her tables, I suggest you do the same!!",
   "Very fun place great place for group of friends you sit at the same table and watch their chef cook right in front of them. Plenty of food food the steak I had was very good with lots to take home"
  ]
 },
 {
  "name": "Springfield Char House",
  "address": "2500 Sunrise Dr, Springfield, IL 62723, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/43fa829a-9334-11ea-8748-14b31f159f22.png",
  "tags": [
   "food",
   "tasting",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15406187547168995642",
  "source": "GoogleMaps",
  "reviews": [
   "There were four of us for dinner. and our server and the food were both excellent. I had the rib-eye, and it was cooked perfectly medium rare. My wife had several vegetable dishes. the others in our party had chicken tender and chopped  steak. The portions were large, and they both took some home. We've been here several times, and it's always been good.",
   "We were up in Springfield for a getaway weekend and Springfield Char House was recommended highly.  Being near the hotel we were staying at, we decided to give this restaurant a try.\n\nIt was an early Saturday evening and the restaurant was not very busy; however, we were pointedly seated and left with menus.  The menu, rather the selection of menu items, was probably the best part of our experience.  After a few minutes, our server emerged to ask for our beverage selection and to see if we were ready to select our entrees.  Instead, we requested an appetizer with our drinks.\n\nA short time later, our server brought our drinks and took our order.  I chose the Fettuccini Alfredo with Chicken Breast, and my wife chose the Tuscan Chicken.  A few minutes later, she returned with our salads.  A few minutes into our salads, our server returned with our entrees as well as our appetizer.\n\nIn the short span of fifteen minutes (after the initial wait for a server), we had our entrees in front of us...we barely had the opportunity to finish our salads.  Our entrees were quite hot, but the appetizer (potato skins) were not; besides, we had our entrees...we no longer needed or wanted the appetizer.  Our entrees were good, but somewhat bland. \n\nIn passing, our server asked one time \"is everything tasting alright\" to which our answer went unheard as she scurried away.  She did not return to refill our drinks; she only returned to ask if we wanted boxes and to present our check.  In all fairness, the guy cleaning tables was more diligent and attentive.\n\nI would hope our experience was the result of an unfortunate \"off\" night for the server/restaurant.  Still, I'm not going to give Springfield Char House another try.  I think 2 stars out of 5 is being generous.",
   "Waited 1 1/2 to find our food order was lost. Steak had no flavor but shrimp was good. Beer was cold.",
   "Simple American fare place with great service. Menu has a lot to choose from. The fried chicken was very good as well as the ribs. Ambience seems a little dated but overall not a bad place. Will go there again.",
   "Good food, could taste every ingredient. Had the Philly, Fries and salad with a sweet tea. Faster food than some fast food places I've been. Place was clean and staff were friendly. Prices were reasonable."
  ]
 },
 {
  "name": "Magic Kitchen",
  "address": "4112 N Peoria Rd, Springfield, IL 62702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/443dcd74-9334-11ea-be0b-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18275202323385335709",
  "source": "GoogleMaps",
  "reviews": [
   "I think one of the best Thai restaurants anywhere. Dishes aren't as \"oily\" as many Thai places. Only accept cash, so be prepared, and it's a byob restaurant as they do not have a liquor license. They know how to make dishes hot when requested. I always stop when in town! Smaller menu selection, but awesome Thai traditional favorites!",
   "Staff are friendly. However the food I order (garlic salmon) is very greasy although i like the taste, and come with no vegetables at all, but after request the chef give me extra veggie. Cash and check only, no debit or credit. The price is not expensive. I would give more stars if the food is better. The place has more potential...",
   "Pretty cool place to eat ar. Small and cozy. Awesome food there. Get there early to get a seat",
   "Excellent Thai Basil with shrimp! Chocolate cream pie was also the perfect dessert to follow a lovely meal. The waitress was the sweetest. We will be back, often!",
   "Mengkham, Fish Cake, Tua Nawk-Si Kai, Lemon Grass Soup, Chili Paste Pork."
  ]
 },
 {
  "name": "Star 66 Cafe",
  "address": "3752 Camp Butler Rd, Springfield, IL 62707, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/448277be-9334-11ea-8ed7-14b31f159f22.png",
  "tags": [
   "tasting",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1697965309699679809",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely wonderful. Don’t be alarmed by the location. It is clean!!! Service is wonderful and the menu has a ton of options. I ordered the steak medium. It was probably closer to medium well but not a big deal at all. Loved it.",
   "I've been all over the United States, & No where have I ever had grilled cod, until this morning. \nOr, such fresh tasting sauce in chicken parmesan for dinner last night.\n\nNo doubt if I was a local, I'd be here on a regular!!\nGood service too... for those passing through,  you owe it to yourself to park, & get ready to enjoy some very, very good food 👍",
   "This is a hidden gem that I was fortunate enough to trip over while traveling for work.\n\nIs attached to a small truck stop and convenience store.  The bathrooms for the convenience store are what is available as a restaurant customer so that's slightly awkward, but no big deal.\n\nIt appears to be locally owned and operated by many of the family members.  The menu has a great selection of typical American fare.  The price points are very reasonable.\n\nI ordered a steak dinner, and the steak was cooked a little further than I ordered but was still a pleasant bite.  The soup and sides were good and the portions were fair.  after I had ordered my steak I looked up and saw a specials board that listed pork chops done a half a dozen different ways.  Had I seen that first I would have ordered them instead.\n\nI'm going to have to go back there and try the breakfast sometime!",
   "This place is extremely popular and I can see why.  The portions are extremely generous and you arent going to leave hungry.  Very nice staff and they make you feel right at home.  The food is good, wouldn't say its exceptional, but definitely good.  I tried their Popeye Omelette and enjoyed it.",
   "Great place,  old school style restaurant with the best staff around.  Locals love it for a reason.  The food is great no matter what you order and the service is great as well.  Large portions to fill you up and price isnt bad."
  ]
 },
 {
  "name": "Xochimilco Mexican Food",
  "address": "2941 W Iles Ave, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/44de2dbe-9334-11ea-8e2e-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "family",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=1773595714818928027",
  "source": "GoogleMaps",
  "reviews": [
   "We have been eating there for years.  With few exceptions (usually when a new cook starts) the food has always been outstanding.  And in those exceptions the management has always done right by us. We will be there for years to come for sure!",
   "Wonderful service, consistently great food.\nExcellent margaritas. One of my favorite places to eat.",
   "My family has been going here for a couple years now. Our favorite mexican restaurant in Springfield for sure! Great fajitas, tacos, burritos, margaritas, ect and a friendly staff.",
   "Reasonable Mexican Restaurant in Springfield. Definitely not the best I've had but not bad. Lunch Menu is very good value. Would go back if passing.",
   "Springfield home run for authentic Mexican. The server spoke little English but once we got past that from the margarita to the main course, everything was delicious. Will visit again."
  ]
 },
 {
  "name": "Abe's Hideout",
  "address": "2301 S Dirksen Pkwy, Springfield, IL 62703, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/45343c0a-9334-11ea-8abf-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "drink",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5206631801743702735",
  "source": "GoogleMaps",
  "reviews": [
   "Abe's was great! I had the grilled tenderloin - that's right, not breaded and fried - grilled, and it was delicious! More like eating a steak than a sandwich. I highly recommend it. Also the fried green beans were super tasty. The tomato soup was a little watery, but not enough to knock a star off the rating. All four of us enjoyed our visit, not just because of the food, but the friendly staff as well. Good job Abe's Hideout!",
   "Very nice place that we picked out of the results and reviews. We were on the road back to St Louis from Chicago. The wife had a shrimp basket that she likes very well the fries were great I had a walleye sandwich would I had never had before but it was absolutely delicious. Our server was attentive and friendly we had no issues. We would definitely go back to this place again if we are ever in the area may even make a trip to do so",
   "Warm atmosphere and really good service. Menu has expanded but the I think it would be best to do fewer items better.",
   "I took my team from work out for our holiday lunch. The service was fantastic, there was a wide variety of food options and the price was extremely reasonable. There was plenty of room for us to spread out. We were only a party of ten, so I didn't call ahead but they easily accommodated us.  Amazingly the single waitress for our table kept up and then some with all our food and drink orders and refilled everything so quickly it felt like there were 5 waitresses for our party. Everyone loved the food and I'm so glad we went!",
   "Had a family gathering. It a nice place to have it. We felt comfortable and had good service. The food was delicious. The employees are friendly and helpful to. I would recommend it to anyone."
  ]
 },
 {
  "name": "LongHorn Steakhouse - Curbside To Go Available",
  "address": "2451 Wabash Ave, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4580fd1a-9334-11ea-8b71-14b31f159f22.png",
  "tags": [
   "food",
   "walking",
   "economical",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5229831822782147992",
  "source": "GoogleMaps",
  "reviews": [
   "The place wasn't super busy except the large group in the back corner that was together. We both got silverware with food stuck to them. Waitress was okay but seemed preoccupied with her cleaning or whatever it was up front. The food took a long time, likely due to the group. My steak was supposed to be medium well, was med rare at best, cool in the center still. Our waitress had vanished again so we asked a guy if he could get her. He turned his head and kept walking. Literally sat looking at a rare steak forever before some random lady asked us if we needed help with it and took ot back to the kitchen to bring it up to temp. Came back in the same condition it left except they had switched out the plate and potato. Brought home a $30 steak for my dog. Won't be back.",
   "Used curbside ordering and ordered Medium, also confirmed 2 times “medium pink center “ when got it it was fully cooked like a piece of wood. Taste was great though, but chewy and low quality. I will give it a chance under normal condition.",
   "Did the call ahead so had a booth waiting for us!  Used a gift card so our splurge was very economical.  We both had steaks, caeser salad, lobster chowder, and a chocolate martini!  Cooked just the way we asked.  I even had leftovers.  Did not get our napkin and silverware until after the bread was being eaten or would have given 5 stars.",
   "How do you have? We had to wait almost 2 hours and got here at 6 pm. We are still here waiting on our food. Do not recommend for a large party. Smaller groups got in and were do eating before we got seated.",
   "Was busy and had to wait a few minutes before we got a table . Service was great . Food was good ."
  ]
 },
 {
  "name": "La Piazza Cucina Italiana",
  "address": "220 S 6th St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/45cb9a8c-9334-11ea-b7cb-14b31f159f22.png",
  "tags": [
   "walk",
   "drink",
   "food",
   "delicious",
   "affordable",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=18377983784874980715",
  "source": "GoogleMaps",
  "reviews": [
   "1st time here, nice place in downtown Springfield. Staff very friendly. They had a casual side with a few booths and a walk up counter for carry outs. Then the next room is a nice dinning area. 1st impression is good. Seated and given menus, drink orders placed. Menu is nice with the main options being pasta dishes or what appears to be nice hand tossed pizzas. Orders placed, food received. My thoughts as they brought out the salad was they put a lot into a small bowl. The main course looked and tasted really good. As a side note the portion sizes are probably what you should be receiving, a regular size (not large) serving. Food & service was great but not nearly as good as the cannoli cake. Definitely give this place a try.",
   "Definitely worth a visit if you are willing to brave downtown traffic for lunch. The lunch menu was affordable and the portion size was good for the price. The spaghetti and meatballs and cream of potato soup I ordered even came with some delicious fresh baked bread! The thing that topped it all off though was the black cherry gelato I got for a dessert, it was super satisfying and perfect. The staff was super friendly and attentive as well. We intend to come back and try the dinner menu in the future.",
   "I can believe I didn't get any photos but I had a great pizza margarita there.  Very fresh, sauce with mozzarella and basil.  The crust was perfect a little crunchy and chewy.  I was visiting a friend in Springfield and had just stopped in for a quick bite.  I hope to go back and try some pasta and desserts. Promise to get photos next time, LOL.",
   "First time for dinner and was very happy with our selections. I had the lasagna and my husband had the cannelloni; both were excellent! The sauce very much reminded me of my aunt's - delicious. Will definitely return with our family.",
   "I think I should've looked at the pictures rather than read the reviews before going. I was really excited about fig and prosciutto pizza but what I got was a layer of cheese thicker than the crust. And not even cheesy. Really took away from any flavor. The polpette appetizer was good I just wish it was brought out hotter. It was lukewarm. Bread it came with was really really good. The meatballs are the reason this was a 3 and not a 2. Drinks are very reasonably priced. Service was great and friendly."
  ]
 },
 {
  "name": "Mekong Cafe",
  "address": "1308 S 2nd St, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4617bee8-9334-11ea-be0a-14b31f159f22.png",
  "tags": [
   "walk",
   "eat",
   "food",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=8965607218305732729",
  "source": "GoogleMaps",
  "reviews": [
   "I walked here from my hotel on a recommendation from a local.  It was worth the walk!\n\nIt was hard to find due to lack of exterior signage, i believe this was due to recent renovation.  Very simple interior.\n\nThey did not have their liquor license yet, sonic made due with tea.  Menu was fairly extensive, and I enjoyed everything I ate.  I would definitely recommend.",
   "Love everything I've had here but the wings and mekong fried rice oh my cant stop eating eat",
   "Mekong Cafe is a great place for lunch! Food will be served fast, hot, and it's going to taste great. I've attached pictures of a Red Curry and Crab Rangoon. Both entrees are one of the best in Springfield.",
   "I think I have found my favorite Springfield restaurant. \n\nMekong Cafe has a friendly staff, casual atmosphere, and a menu with more variety than you'd expect. \n\nThe food is delicious and whatever you get tastes like what you needed for that moment. \n\nMekong Cafe is definitely a restaurant you should check out when in Springfield",
   "Delicious! Everything is made to order! This is a great place for vegans as well!!"
  ]
 },
 {
  "name": "Sunrise Cafe",
  "address": "1201 S 2nd St, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/466ff140-9334-11ea-9cee-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "family",
   "food",
   "food",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2894078968904486586",
  "source": "GoogleMaps",
  "reviews": [
   "I always love my visits to Sunrise Cafe ♡",
   "Great food!  Friendly service!  Food was hot and delicious.  Very comfortable atmosphere.  Good home style meals.  The burgers and fries are really good too.  Good variety to choose from on the menu.",
   "It was a nice family diner. Good food. Nice staff. We had breakfast. Was good.",
   "Decent food, great burgers n most servers are very enjoyable n to work there is mostly great but one person who has been there for a while is allowed to be mean,rude, disrespectful and most of the time is very unpleasant and the management allows for it to go on....... anyone who has been there knows who I am talking about......am I correct?",
   "Good tasting food at a good price; it seems that this is the to go to place in town as it was busy. Food took awhile to arrive and we felt we had to rush for others to be able to seat but overall the meal was savory."
  ]
 },
 {
  "name": "Brickhouse Grill & Pub",
  "address": "3136 W Iles Ave, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/46b40062-9334-11ea-a72b-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "active",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17919854243759814027",
  "source": "GoogleMaps",
  "reviews": [
   "Better than most pub food. Horseshoes are very good (according to my wife and son). This trip I chose the chopped chef salad and it was great. Pepsi products are only $2 - a rare find these days.  This was our third trip and have never been disappointed.",
   "Try their egg rolls. Crazy good spin on a classic dish. Above average craft beer selection. Convenient location.",
   "Excellent service very good food and reasonable prices.  I had the bacon cheeseburger and homemade chips.  Both were excellent, cooked to perfection and delivered to the table fast and hot.",
   "Brickhouse is a very popular place to dine in or just have a few drinks. The atmosphere is very active and upbeat. The food is great... every time I have eaten there I have been happy with my order. 😊\nI can't forget to mention the wait staff, which has been nothing but excellent, even when the place is hopping. I would definitely go back and suggest that you check them out too.",
   "Food very tasty, great cocktails, fast service."
  ]
 },
 {
  "name": "Nu-Voh at the Saint Nicholas",
  "address": "400 E Jefferson St, Springfield, IL 62701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/46fc7a10-9334-11ea-99aa-14b31f159f22.png",
  "tags": [
   "drink",
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=11747412069755040449",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing lunch menu. Different! Been there multiple times and every meal has been excellent. Love the ambiance",
   "Worst meal ever on New Year's Eve. We had a reservation for a group of 10 @7pm, flags should have been raised when it appeared as if there was only one bartender.  We were seated at our table which had no place settings and was served water immediately, shortly after, our waiter took drink orders. It took quite some time to be served our drinks since the room was starting to fill up with other diners.  We had a limited menu to order from which is understandable on an anticipated busy night.  Once we were served, we had no butter or sour cream on the table for anyone's baked potatoes, no salt and pepper and one meal of pork chops was served completely raw inside. The pork was sent back, and other meals had steamed veggies that were more raw than steamed. \nIt appeared for whatever reason the place was understaffed.  Our waiter did try to take care of us but appeared as if he was being rushed. The manager comped the one meal that was sent back. We were disappointed in this visit as it was the 1st time most of us have been here. We are understanding enough to give them another chance for another visit on an evening with no special events.",
   "Expensive. Steaks were good but over priced compared to elsewhere in town. Cesar salad was funky and not at all classic taste. Atmosphere was ok but too bright.",
   "Biggest lobster tail I've ever had && so delicious!",
   "Was a great atmosphere! Sat at the Blu bar during happy hour, was not very busy but service was great. \nOrdered soup and an appetizer and both were delicious. Fast service! \nWill definitely be back!"
  ]
 },
 {
  "name": "Hawaiian BBQ",
  "address": "2355 W Monroe St, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/473f4818-9334-11ea-bf71-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "delicious",
   "food",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=6326059673669854671",
  "source": "GoogleMaps",
  "reviews": [
   "They have some really good food. Staff is friendly and food comes fast. What else do you want more",
   "We love eating here. The food is the best in Asian food Springfield. It is our favorite place to have Pad Thai and the Korian dish Bulgogie. Our family can't wait till you re-open!",
   "Dining alone as the wife is babysitting. The name is somewhat misleading it is more oriented to Asian Thai food. Food here is prepared fresh upon ordering. Place is on the smaller size very clean with pleasing decor. Staff is friendly and outgoing. I have enjoyed this place on numerous occasions and have never not had a good experience with the dishes I've tried. Delicious.",
   "First time here but my sister and her husband loved there food first . Walking in it's nice the walls make you feel like your in Hawaii and the smell of the good is yummy . Having tried Pad tai in many locations this definitely had good pad tai well seasoned hot and spicey . You can pick what spice level you want too and it actually comes out how you request . The pho is great and well portioned and flavorful as well . The appetizers are so food as well we got crab rangoon which  where nice and cheesy with crab meat and the dumbling  where to die for!! The pad tai rolls where crunchy and came with sauce to dip them in and oh so yummy. I have to say I will be returning here next time I'm in the area!!",
   "Was really good. Had order carried out. Had it done in 10 mins"
  ]
 },
 {
  "name": "Anchors Away",
  "address": "518 E Capitol Ave, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4786ffd8-9334-11ea-819c-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "walk",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7183339344111206140",
  "source": "GoogleMaps",
  "reviews": [
   "This was our first time here.  Right from the start she told us how you order.  If you never been there, ask for help!  It makes a difference.  She was extremely helpful.\n\nYou pick your seafood (shrimp, snow or king crab, mussels, etc), pick a side, pick your boil and then pick your spice.  Spice I highly recommend Anchors Away as it was just enough hotness you need that doesnt over power the food.\n\nWhile we had our drinks, she gave us a sample of grits.  I am not a grit-guy but tried it anyway, but boy theirs was great!\n\nAs you see below, everything is served in a bag.  Expect it to be messy!!!  Normally I see it in a bucket or in a net, but I like this idea as it still marinates in the bag.\n\nThe food was awesome.  I had the shrimp and snow crabs.  Now it is my favorite seafood place.  No parking in front of place but there is other street parking and a huge parking garage on the east side.\n\nFat Tuesday is coming up so that will be fun to enjoy.",
   "We arrived at 6:20 pm. We Ordered an appetizer and 4 meals. We waited almost an hour for the appetizer and sat for an additional hour without being served our meals. During these two hours our waiter failed to say two words to us or explain what was taking so long. We watched people who arrived after us eat and leave. So we got up and left to get dinner elsewhere. Then our waiter decided he better come actually speak to us, just to scream down the street he was calling the cops if we didn’t pay for our 6 alligator bites we ordered as an appetizer. We walked back inside to give him 12 dollars but we will never ever be going back. The discount we deserved for waiting 2 hours without hardly being looked at by the staff should have been worth well over 12 dollars. Awful service. Possibly worst service I’ve ever gotten at an eating establishment.",
   "We went as a group of 6. Everyone tried a different item. From frog legs to crab... shrimp to oysters... everyone loved the food. Prices were reasonable.  Service was good. Too bad the Municipal League next door are such bad neighbors. Parking is challenging but worth a one block walk.",
   "Great food choices and delicious meals.  Kind servers and attentive. Gumbo pictured was slightly spicy, which was exactly what I wanted. My wife ordered the shrimp and grits and it was amazing. A must visit for those in the area.",
   "First time...nice and pleasant atmosphere. Food was good. I will definitely be back to try other dishes on the menu."
  ]
 },
 {
  "name": "Finley's Tap House",
  "address": "3236 Ginger Creek Dr, Springfield, IL 62711, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/47d016c0-9334-11ea-b90e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12925282725394928706",
  "source": "GoogleMaps",
  "reviews": [
   "Had a delicious meal at Finley's this evening.  (I recommend the meatloaf.)  Our server, Jessica, took good care of us.   I highly recommended Finley's for its good food, warm inviting atmosphere, and excellent service.  The 5-star rating is well deserved!",
   "We've eaten here at least a half dozen times, this time for a late lunch. We both started with side salads which were fresh. My wife had a margherita  flatbread pizza that was large enough to take half of it home. I had the prime rib with mashed potatoes and southwest corn.  It was good but a little too well done for my taste. I didn't send it back, not wanting to waste it. Dessert was a delicious chocolate that we shared. We had an excellent server.",
   "Enjoyed a flight and other drinks. They had a nice mix of options, wish they had a few more varieties given the name. As a vegan, not much to enjoy on the food menu. Staff was very nice and attentive.",
   "Meal was great.  Service was great....until one of our party went to the men's room while waiting for the check.  While he was there, a busboy emerged from a stall, CARRYING a tray full of dishes, and left the restroom without washing his hands.   Pointed the busboy out and complained to the waitress who promised to speak to a manager.  At least one other customer witnessed this.\n\nWe won't be back.",
   "Way beyond bar food. Great service too, but one of my pet peeves kept this from being 5 stars. If you're going to suggest things like dipping sauces, extra dessert for people having birthdays, etc., mention the upcharge. I don't like surprises on my bill.\nI am still going back though. Food is too good not to."
  ]
 },
 {
  "name": "Mariahs Steakhouse and Pasta",
  "address": "3317 Robbins Rd, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [
   "food",
   "eat",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=8977839417889261200",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful food! Great waitstaff.  Fast service. Only negative? Sounds from Video poker in front lobby was a bit distracting.",
   "Touted as the Best Brunch in Springfield! A little pricey, good food, especially the prime rib and light & fluffy bread pudding. Couldn't eat enough.",
   "Great local eatery.  Has specials for carryout when we need it. Support local",
   "Absolutely perfect.  The owner and staff made us feel welcomed and special.  The food was exceptional.  Well prepared.. well presented.. and tasted great.  If you want good food and a good experience... Mariahs hits the target.",
   "I have eaten here twice the first time we went we had absolutely great service and a delicious dinner. I truly enjoyed having dinner here so much that when I saw they were having a thanksgiving buffet and I hate buffets I wanted to spend our Thanksgiving Day meal here. So glad we did. It exceeded my expectations."
  ]
 },
 {
  "name": "Happy Sushi",
  "address": "846 S Grand Ave E, Springfield, IL 62703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/48178050-9334-11ea-a39f-14b31f159f22.png",
  "tags": [
   "food",
   "creative",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15151961481086879629",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely fantastic food! The egg rolls are second to none, and the sushi is amazing! Place is small, but the food is well worth going there for! If you like Sushi, you will not want to go anywhere else for it again!",
   "Being from an urban area, the atmosphere brought us back to some of the places we regularly visited in our younger years. The itamae is definitely a sushi master. He is creative but maintains a balance in his pieces. The French Kiss roll is delightfully refreshing with a slight lemon pucker inside. The Sunny roll has a hint of sweetness from the mango while still being a savory roll. The tempura rolls are crunchy. The rice is tender. And the hostess, Jessica, provides a calming spirit to a busy restaurant. It was our anniversary and the chef sent us a complementary appetizer, which was a thoughtful surprise. We will definitely return and I might stop in just for the House Salad, with a creamy ginger house dressing.",
   "Best sushi place in Springfield! Honestly we were surprised! We are sushi lovers and find sushi places in any city. I found Happy Sushi in yelp as 4.5 stars, they deserve it. Good for their business! Pick yummy and anger management rolls! They rock!",
   "If you read my reviews, you know I’m into sushi. This is by far my favorite place to get sushi in Springfield. It definitely has that hole in the wall vibe, but the sushi is divine. Also try the heart attack jalapeño appetizer. That was surprisingly really good.",
   "They added some new dishes since their last break . Amazing food. The staff is friendly, attentive,and outgoing. Definitely worth it."
  ]
 },
 {
  "name": "Taqueria Moroleon",
  "address": "1101 S 9th St, Springfield, IL 62703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/485b191c-9334-11ea-8345-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5727179659429847793",
  "source": "GoogleMaps",
  "reviews": [
   "OUTSTANDING FOOD!!! Absolutely delicious from the first bite to the last.  Very nice and personable servers.  A place to relax and eat after visiting Lincoln's home and neighboring sites in Springfield, IL.",
   "Excellent food and atmosphere.  Perfect little place to get some authentic Mexican cuisine.  Don't miss this little gem, it may be a small location but the food and service are big. Best chips around (in my opinion) crispy and flaky. So if you're looking for a nice local spot for Mexican this is your ticket. Hope this helps!",
   "Excellent margaritas, 4 different kinds of salsas brought immediately to the table. Home made guacamole! I had just two tacos n was filled up! Excellent cute little place",
   "Great chips and salsa (four kinds, but you had me at chipotle!) Chicken fajita nachos are huge and absolutely delicious. Big menu--I suppose I will have to go back more than once!",
   "Great spot for lunch....\nAs a first timer...  my wife and I thoroughly enjoyed the service and food! If you want an authentic experience with Mexican food... this is the place!!!"
  ]
 },
 {
  "name": "Bella Milano Springfield",
  "address": "4525 Wabash Ave, Springfield, IL 62711, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/48a7d9b4-9334-11ea-baed-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "food",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16567445802031362936",
  "source": "GoogleMaps",
  "reviews": [
   "I took my best friend today for the curbside pickup for lunch. It was her first visit to Bella Milano. I ordered my all time favorite the Chicken Gouda and she had the kids hamburger with bacon and cheese. As she was eating she couldn’t help but say “Oh my goodness I need to report a robbery, they just stole my heart.” 5 stars for the great food and service. Thanks for all that you guys do there at Bella Milano :)",
   "Let me start with the service was excellent.  That’s about all that was good here. We came down from Chicago to check out Springfield and were looking for some good Italian food.  This was a swing and a miss. Our appetizer calamari was greasy chewy and flavorless, the presentation was terrible as well. Our salads were over dressed and soggy, though if the texture wasn’t horrible, the taste profile was actually decent.  They give you some store bought bread and oil with cheese. The oil tasted like vegetable oil, it had no flavor it was awful.  My entree was chicken Marsala, it was nothing even close to Marsala, bland and flavorless it was a half chicken breast cutlet cut in half.. $22 for a half a chicken breast is crazy.     All that said the pasta carbonara was actually good. Maybe they’re good at pasta, but everything else was less than mediocre.",
   "We made reservations here for a celebratory dinner. It was busy, but we were seated promptly. My wife had a vegetarian pasta, and I ordered sea bass and scallops. My wife had soup; I had a small Milano salad. Both were excellent, as were our entrees. It's easy to overcook fish,  but it was perfect. Our server was exceptionally good although she had a seemingly large number of tables. It's always a pleasure to dine here, and this was no exception.",
   "I have been here several times. The food is good and the service is also good. The toasted ravioli is really yummy. \n\nThere is a lunch menu that has less expensive prices of you go at lunch time. \n\nIt's a pretty big space that has lots of room for dinners and the parking lot had room for all the cars.\n\nWent on Monday and they had $5 drinks and appetizers. So I got to have  toasted ravioli for less money.",
   "We did not have reservations and the wait was 30-40 minutes, not bad for a Friday night. We ordered mixed drinks and they were very good. When we ordered we were asked if we refer soup or salad so we made our choices. We did not know this wasn’t included in the meal price until we got the ticket and it was an added charge. The food was very good. We were first timers so the general manager came and talked to us and gave us a voucher good for a free pasta dish in the future. Everyone was very friendly and helpful. Food was very good and the restaurant was very clean even though they were very busy."
  ]
 },
 {
  "name": "Parkway Cafe",
  "address": "2715 N Dirksen Pkwy, Springfield, IL 62702, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/48ec8424-9334-11ea-87dc-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4248165953180262410",
  "source": "GoogleMaps",
  "reviews": [
   "My mom and I stood there for 7-9 minutes with no acknowledgement by staff. There was a mother and son ahead of us and they had been there for a while before we got there. So we waited and when not acknowledged after a while went elsewhere. There were a lot of people, but there were open tables,  there so I am thinking the food must be good. It may have been a fluke as there was no one at the register/host area... we will try it again and if better will update this review.",
   "Chicken  salad on lettuce with tomatoes and in house ranch dressing. I'm from out of town but the chicken salad had too much celery. It wasn't bad but not a favorite. My husband ordered a horseshoe,  this is a local favorite,  it's one reason we ate here. This one is delicious! We went here to eat with locals. Family members have been eating here for years.",
   "Wonderful northend cafe good food good service. I have not tired everything on the menu because there is a lot to choose from, breakfast anytime is awesome , so i  had breakfast for dinner, an ultimate  Omelet with with America potatoes with peppers and o onions \nIt was delish",
   "A wonderful experience everytime my wife and I are in there. The staff are the best. Thanks to all.",
   "Nice caring staff. Breakfast is always great here."
  ]
 },
 {
  "name": "AZ-T-CA Mexican Grill",
  "address": "2753 Chatham Rd, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/492f80d0-9334-11ea-bca9-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=743635310729426824",
  "source": "GoogleMaps",
  "reviews": [
   "Had carry out delivered to our car by the owner. He is so kind and courteous. The food is mind blowingly good! Also I'm so proud of our local restaurants fir helping out the community!",
   "Really liked the flavor here, split a street taco platter. Very uniquely different. Overall food was right on par for being perfect in taste.",
   "I have never had such a bad Mexican food before. I think everything came out of a can or a box. My daughter ordered a margarita and she said it tasted like Kool-Aid. I won't be returning.",
   "First time at this restaurant. Have to say it has to be the best Mexican food is town. If you go try the power bowl it was amazing!!! Good service and friendly staff will be my go to from now on.",
   "Best Latin food in town. Out of the ordinary fare. Quality cuisine!"
  ]
 },
 {
  "name": "Cook's Spice Rack & Chili",
  "address": "910 N Grand Ave W, Springfield, IL 62702, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/49742f46-9334-11ea-ba8b-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "eat",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11375477050739093361",
  "source": "GoogleMaps",
  "reviews": [
   "We ate breakfast here. Cozy, yummy, fun decor. Lots of veggies on the menu, which was not expected, and they can accommodate those on gluten-free diets. Very reasonable prices. Our waiter had a great sense of humor. I found the food to be .... bland. The service and atmosphere were good, though.",
   "We first had their food at the Visions by JDR Holistic Fair at the Illinois State Fair Grounds. I feel in love with their chili, the Terlingua Red Chili is delicious.  We try to stop in when we are in the area. Goldie and the rest of the staff treat guest like family.  We had the Sweet Potato tots, I had Black Pot chili dog with shredded cheese and chips It was more than I could eat in one meal) and my husband had Hamburger Horseshoe with yellow and white cheese (he said it was soooo gooood!)",
   "I love that you can get lunch for breakfast.   Great fried chicken.  The Salisbury steak is really good too.",
   "It's nice and very friendly family restaurant. We were there at Sunday night, that's their  family dinner night. Food was tasty, the owner was very nice and honestly. We may go back try their normal menu, we was told by another customer their chill is very good in town.",
   "Had a great experience here. Food was excellent especially the chili and those fall-off-the-bone smoked ribs. Service was wonderful. We're looking forward to another visit soon."
  ]
 },
 {
  "name": "Taste of Thai Restaurant",
  "address": "3053 S Dirksen Pkwy, Springfield, IL 62703, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/49b7ceb6-9334-11ea-b993-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family",
   "cheap",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8230345238035288192",
  "source": "GoogleMaps",
  "reviews": [
   "Best Thai food around! I get the beef Pad See Yew and have never been disappointed.",
   "great place for dinner if staying at a hotel near S.Dirksen. Padthai w/shrimp is a winner",
   "Excellent food. I've been eating here since I was a kid. Love love love their food.",
   "I’ve been coming here since I was little, and it’s only gotten better. My family and I are good friends with the staff, they joke around with us, they give excellent service, and they make it an amazing experience every time we go.",
   "Had chicken basil Thai ...tasted fowl... Price is cheap so as the food quality..."
  ]
 },
 {
  "name": "Gateway To India",
  "address": "3115 Chatham Rd #5306, Springfield, IL 62704, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4a1e0af0-9334-11ea-b7c6-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8540148111161698053",
  "source": "GoogleMaps",
  "reviews": [
   "I had a horrible experience at this restaurant. The service was terrible and racist. My date and I are both Black and it was very apparent that the poor service we received was racially motivated. The rest of the patrons in the restaurant were White and received better service than us. I made a reservation hours in advance, but it took them at least 10 minutes to get a table prepared for us, despite the fact that multiple tables were open and we arrived 10 minutes before the time of our reservation. The table they prepared was located in the back corner of the restaurant between the exit door and one of the windows. It was very cold and the most secluded spot in the restaurant. There were other tables for two available, but the waiter chose to seat us there. After taking us to our seat, the waiter served us water and did not offer any other drinks. Also, we were not given any snacks while waiting for our food. Patrons who came after us were given these snacks while waiting for their food. The waiter took 10 minutes to give us menus despite having ample time to do so. This would have been somewhat understandable had there been many people in the restaurant at the time, but that was not the case. After giving us menus, the waiter took another 15 minutes to check on us about our order. It took 50 minutes for our food to arrive at the table. We both ordered simple main course dishes that did not require any kind of special preparations. At least three other tables with patrons that arrived after us received their food before we did. Our visit to this restaurant lasted around two hours, and we were checked on only once, not including the mandatory visits the waiter made to our table to give us our menus, food, and the check. The rest of the patrons were checked on regularly. I always tip at restaurants, but I did not give a tip on this occasion due to my awful experience. I will never return to this restaurant, nor will I ever recommend others to visit it, especially people of color.",
   "Nice restaurant buffet, very kind owners. Super clean restaurant. Staff very attentive. The food is very tasty and designed for Vegans, options for Vegetarians and carnivores. All the food is very well marked and the owner is ready to answer any questions. They have a Vegan Festival in April and other Vegan events throughout the year.",
   "Catered our daughter's wedding and the food was delicious. Many of the people were from out of town and even out of country. All enjoyed the selection. Grateful for their friendly, laid-back demeanor. Their restaurant is the go-to place for Indian cuisine in Springfield.",
   "This is by far the best place to go out to dinner in Springfield. The atmosphere is amazing, the staff is excellent, and the food... THE FOOD IS BEYOND AMAZING. Check out the lunch buffet as well, it's worth every penny and then some. If I could rate more than 5 stars i would. Bravo Gateway.",
   "Great food. Confused servers. They forgot to bring white rice with a couple dishes. Also ordered a bottle of Cabernet. Smooth"
  ]
 },
 {
  "name": "Fox Run Restaurant and Lounge",
  "address": "1130 Legacy Pointe Dr, Springfield, IL 62711, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4a6a05cc-9334-11ea-9dcc-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "family",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15364912268236732738",
  "source": "GoogleMaps",
  "reviews": [
   "Went for the 217 hamburger special.  It was a delicious burger.  Would have given 5 stars but we waited quite a while to get our order taken.  But after that all was good!  And when I called in the afternoon had an exceptional gal on the phone.  She was super nice!",
   "Great food good service great atmosphere. I recommend getting onion rings for an appetizer.",
   "Excellent service. Great food.",
   "Waitress was nice, but almost never came back to the table to check on us. Disappeared after paying even though my family stayed to chat. Horseshoe fries were cold and the tater tots were warm, making it obvious that they weren't made at the same time. Fries were old and inedible. The cheese sauce was frothy, and the tenderloin was chewy and over seasoned.",
   "Nice place. Happy hour for apps. Beer garden. Clean. We had a party of 12 with all sorts of needs (seperate checks, coupled checks, I'll get his drink, food only, drink only, food and drink) and everything was spot on. Our waitress Casey was great."
  ]
 }
]