[
 {
  "name": "Como Park Zoo & Conservatory",
  "address": "1225 Estabrook Dr, St Paul, MN 55103, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4ab0d32c-9334-11ea-a94f-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "family",
   "free",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5020327751164321626",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful zoo and conservatory. They have a great and varied collection of animals. Nice indoor areas, as well. The Conservatory took my breath away. Nice to see so much green after all the snow outside.",
   "Nice day out, beautiful  conservatory and plants. Also for just a small donation you can visit the zoo  - well worth  a visit and very interesting and knowledgeable staff. Would definitely recommend if in the area.",
   "Great place to take the Family without breaking the bank. We have a one year old that loves looking at the animals. For a donation only zoo it's more than I expected. Clean and well laid out.",
   "Como is a Twin Cities treasure. An awesome (FREE!) activity any time of year, with lots of animal exhibits outdoors in the summer, and the conservatory offering a tropical escape into lush greenery and warmth even on the coldest snowy days in winter. The unexpected sloth hanging out in the tropical bird conservatory is one of my favorite spots to visit. The bonsai tree has an open section in winter, expanded in summer with a Japanese garden outside as well. Como is great for whole families, a date, catching up with friends , or getting your grandparents out for the day. Also a great spot for photo sessions; saw one today for a quinceañera!",
   "It is a smaller zoo, but a great way to spend an hour or so.  It was cold when I last went here, so I did not have much interaction with staff.  There were a couple spaces under construction as well.  It is definitely a family-friendly place.  I highly recommend taking your kids here if you do not want to chaos or expense of the state zoo."
  ]
 },
 {
  "name": "Cathedral of Saint Paul",
  "address": "239 Selby Ave, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4afa9ad0-9334-11ea-b963-14b31f159f22.png",
  "tags": [
   "structure",
   "free",
   "walk",
   "nature",
   "art"
  ],
  "link": "https://maps.google.com/?cid=9197509937754643077",
  "source": "GoogleMaps",
  "reviews": [
   "My GREAT GREAT GRANDPARENTS WERE MARRIED HERE IN 1920....\nNot to mention you can go in anytime just to experience the beauty and complete awesomeness of a place of worship. I truly feel like one of God's children when I am here🕊💖",
   "Truly beautiful, yet not excessive. The sound system is excellent (difficult to accomplish in such a massive space). The parish community and priest are absolutely centered on Christ and His gospel.\n\nNot particularly strong on handicap accessibility.",
   "A majestic, ornate and classically domed cathedral, strikingly visible on the Saint Paul skyline, impressively massive by day and highlighted with breathtaking lights by night. The altar, with its elaborate sculpted bronze canopy, is reminiscent of the altar in Saint Peter's Basilica in the Vatican  On the highest hilltop overlooking Minnesota's Capitol city, it was 51 years from start of construction to consecration. In spite of its huge dome and vast size, acoustics are excellent for worship services and the Gallery organ marvelously fills the monumental space.",
   "Went for à walk with a friend on Selby and decided to head towards the direction of the Cathedral. We were having some deep discussions on the nature of religion and the importance (or lack of) in modern day child rearing. We also discussed our childhood days and the impact Catholicism had on our lives and who we are today. As we passed the Rectory, we came to a stop but our discussion kept going until slowly we both were just taking in this magnificent structure. We stood in silence looking at the arches, the Heroic size marble statues of the four evangelists, the exterior walls (Rockville granite from Saint Cloud, MN) and, of course, the copper-clad dome (renovated in 2002!) and finally broke silence by having the most eloquent expression known to humanity \"....wow....\" This friend then commented the power of people coming together to build structures to something greater than the individual and creating a Landmark that will be here long after they are gone. This was humbling and empowering. I am proud to live only a few miles away from this magnificent Cathedral and also humbled at the free awe you can glean by just taking a moment to marvel at this beauty. I could use all my breath recommending to take this in but YOU should just go yourself. If you must capture the moment with your little magic rectangle, then do so, but I suggest closing your eyes, breathe deep and then open your eyes focusing on a specific part. Repeat this as many times as needed. You'll feel better, believe me. I sure believe",
   "The cathedral is a beautiful and great place to go to mass. It is a spectacular work of art and I would recommend it to anyone. Christian or not. It is a beautiful tourist attraction as well."
  ]
 },
 {
  "name": "Minnesota State Capitol",
  "address": "75 Rev Dr Martin Luther King Jr Boulevard., St Paul, MN 55155, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4b4c3d74-9334-11ea-b24d-14b31f159f22.png",
  "tags": [
   "walk",
   "tour",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14353601847312204435",
  "source": "GoogleMaps",
  "reviews": [
   "Such a beautiful Capitol! This reminds me a lot of the Texas State Capitol, similar artwork and architecture. There really isn’t much to see inside of a Capitol but to be able to walk through and take in the beauty of a building is worth it. The marble stairs are absolutely gorgeous. If you are around the Minneapolis/St. Paul area, I highly recommend you check out the Capitol.",
   "Paid parking $2/hr. Beautiful from outside and interior. The thing that I didn’t like that I cant go inside the senate/chambers/court rooms. They were locked and only can see behind the bars.",
   "Beautiful and historical place to visit. Will definitely comeback for a guided tour next time I'm in MN.",
   "The Minnesota State Capitol is the seat of government for the U.S. state of Minnesota, in its capital city of Saint Paul. It houses the Minnesota Senate, Minnesota House of Representatives, the office of the Attorney General and the office of the Governor. The building also includes a chamber for the Minnesota Supreme Court, although court activities usually take place in the neighboring Minnesota Judicial Center.",
   "Took the guided tour here. Very well presented and the building itself with it's giant pillars is a great example of amazing contrition. Tour includes visiting the Minnesota Assembly and Senate (which was in session that day so we could not enter that chamber as it was full at the time). Also houses the Minnesota Supreme Court which was very impressive to see,. Court was not in session on the day of our visit. Also includes the main reception room. Tour is about 45 minutes and includes a lot of Minnesota History very well presented. Many steps to climb to enter the Capitol and grounds surrounding it are very nice."
  ]
 },
 {
  "name": "Minnesota History Center",
  "address": "345 W Kellogg Blvd, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4b926e62-9334-11ea-a59b-14b31f159f22.png",
  "tags": [
   "family",
   "library",
   "unique",
   "family",
   "kids",
   "learn",
   "free",
   "history",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12889467208932015653",
  "source": "GoogleMaps",
  "reviews": [
   "See my awesome review of the Gale Family Library if you want a much too detailed explanation of visiting the library! I didn't go to the museum but the building was nice. The cafe smelled good. Everyone was helpful and nice.",
   "This is a decent museum with a current exhibit on Prince.  I would have appreciated a bit more focus on Minnesota as a world-class technology center in industries such as supercomputers, medical devices, etc.  The CDC 6600, designed by Seymour Cray at Control Data Corp., was introduced in 1964.  It was not only the fastest computer in the world at the time, but it included native floating-point operations, which made it a hard core science machine.  The first wearable external pacemaker was developed in Minnesota (becoming Medtronic) as was the world’s first furnace thermostat (becoming Honeywell).",
   "Wonderful museum! Enjoyable for all ages. Unique exhibits. The Greatest Generation and the Tornado room are our family favorites. Plenty to see and do for kids and adults, better for elementary age kids than toddlers.",
   "Regardless of your age, there's bound to be something of interest for you to learn and explore at the Minnesota History Center. You could easily spend an entire visit looking at the various exhibits. The exhibits are really interactive and involving so they leave an impression of what it was like for people that experienced these events. \n\nThere's a high amount of care and attention to detail to essentially all aspects of the visit: the website clearly details what you need to know, the parking is straightforward, and there's even a free coat check (with lockers available for a quarter).",
   "A must go to place on a cold or rainy day. The range of exhibits are diverse and really hands on and interactive. There wasn’t that many people there the day I went. Overall, we had a fun time exploring the history of Minnesota and trying some of the interactive simulations. This place is great for families or people wanting to learn something new"
  ]
 },
 {
  "name": "Science Museum of Minnesota",
  "address": "120 W Kellogg Blvd, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4be793ae-9334-11ea-9496-14b31f159f22.png",
  "tags": [
   "family",
   "learn",
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=17743329466483604764",
  "source": "GoogleMaps",
  "reviews": [
   "We had an amazing day as a family. We all had so much fun and were kept busy for 4 1/2 hours and we still could have seen more. The membership is a sweet deal and my husband and I don't know why we waited this long to get one. We will go back soon. By the way, the cafe was good and reasonably priced. I got the vegan salad (only vegan item on the menu) and was pleasantly surprised. It was fresh and loaded with nuts and all kinds of good stuff. The dressing was awesome. Fun, fun, fun day.",
   "Went there back in 2008 and I was just astounded by everything they had. My first museum trip and I was pleased. Went to see the titanic exhibit and I was very very excited I am a huge titanic fan. I loved that my friends and I got to learn how the ship worked and we even got \"boarding passes\" for it just as if we were going on the real thing. It was really really really fun. Hoping I can bring my kid and husband there one day.",
   "This is a great place for a date or to bring kids. Plenty to do and see. Only reason for 4 stars is the cost of the day. It was $20 for parking (although I guess there was a dog show so if you told the attendant you were just going to the museum it was $10) and tickets for me and my 4 year old was $34. On top of that we bought concessions so it was quite a pricey day. \n\nOverall it was a good experience and the staff was helpful.",
   "Had an amazing time at the science museum with my kids. The museum is large and after almost 3 hours had to leave and still didn't do everything! \nParking was fine but expensive. My only complaint is this museum has pretty steep admission prices as compared to similar attractions throughout the twin cities. But its so much fun you forget how much you paid once you get in!",
   "We got there at 10am,  parking garage was nearly full. Fortunately we found a spot, unfortunately we drive a Tahoe and the parking spot was built for a Prius. The wrist bands are made from cardboard, rough on the wrist (especially the kids). I was also asked by a worker to not hold my toddler because they have “a two feet on the ground policy.” Exhibit were fun though! \n\nOverall, Don’t think we will be visiting again. There are many places to go with our kids where policy and facilities bring a positive experience."
  ]
 },
 {
  "name": "James J. Hill House",
  "address": "240 Summit Ave, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4c2e87c6-9334-11ea-9d93-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "historic",
   "kids",
   "family",
   "walk",
   "performance",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=17778702110211243130",
  "source": "GoogleMaps",
  "reviews": [
   "Went on the 75 minute tour. Purchased tickets for $10 each in advance since some had sold out days before we were to visit. Only parking available is on the street, so we arrived early to get a spot. Beautiful mansion that you get to tour 4 of the 5 floors. Almost all furnishings are original and the mansion is very well maintained. Tour guide was very informative and answered questions. They are very particular about not touching things and leaning against walls and furnishings which is to be expected. You also get to see some behind the scenes areas which is rare in these older homes. We enjoyed the tour and may go back around Christmas when it is decorated.",
   "I know it seems crazy to bring two young kids to an historic mansion but they loved it! They’ve asked to return each year and have an uncanny ability to ask just when I was thinking about it. \n\nThe tour guides have an incredibly deep knowledge and I love the color commentary that they provide about the family and the era. \n\nI’m sure that my favorite space is the kitchen. The idea that Mrs. Hill worked to can jam is one that I can relate to.",
   "A favorite destination for historical tours and also performances--they feature plays, musicals, and concerts through the MNHS in partnership with community performance companies and artists. All of the events and tours I've attended here have been a delight! \n\nLeave plenty of time to park and walk when you visit. And don't touch anything in the house (the docents will remind you quite directly if you forget). 😉",
   "Truly an awe inspiring mansion. It's hard to believe that the man who had this mansion built started out with nothing and built one of the largest fortunes in the United States. He was a true visionary! And his taste was beyond compare.",
   "We saw the play \"Daddy Long Legs\". It was staged in the main entrance at the foot of the grand staircase. The audience (about 40) sat in a circle. Was well done in this beautiful setting. We will  go back for the house tour soon."
  ]
 },
 {
  "name": "Historic Fort Snelling",
  "address": "200 Tower Ave, St Paul, MN 55111, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4c6ef3e6-9334-11ea-b7bb-14b31f159f22.png",
  "tags": [
   "walk",
   "free",
   "hike",
   "history",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8730901671555473110",
  "source": "GoogleMaps",
  "reviews": [
   "Fun place to take a walk in the woods with a camera. The deer are pretty human tolerant and allow you to get close enough to get some good photos.",
   "Wow\nVeterans are free. Worth the visit plus beautiful views of the river and creepy vibe",
   "We went to the state park and hiked, we didn't go into the fort. Lovely paths and history all around. Great place to go to hike close by. ❤️",
   "Love this fort and the history behind it.  The people there were very nice and helpful. It is different from many of the forts I have visited. I'd go back and explore more. Veterans are free. Worth the visit plus beautiful views of the river!",
   "Nice way to spend an afternoon. We brought our 4 month old in a stroller and that worked just fine. There’s only a few places that the stroller couldn’t go but the staff offered to keep an eye on it for us. Thanks! I recommend watching the intro video in the visitor center before you head out to the site. Can’t wait for the remodel."
  ]
 },
 {
  "name": "Landmark Center",
  "address": "75 W 5th St, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4cadd1ba-9334-11ea-821a-14b31f159f22.png",
  "tags": [
   "wander",
   "wander",
   "unique",
   "tour",
   "affordable",
   "history",
   "music"
  ],
  "link": "https://maps.google.com/?cid=9381654991376986790",
  "source": "GoogleMaps",
  "reviews": [
   "I was able to wander around the empty Landmark Center for about 45 minutes on a Thursday afternoon.   It is a beautiful building with tons of detail inside.  There were friendly staff at the visitor table to point me in the right direction for my short visit. I would suggest to start at the basement and work your way around each floor and then move up.  There is something to see in every floor.",
   "We were able to kind of wander the building during the Winter Carnival, very interesting! I have been in the building on many occasions but had never really looked around before. Many rooms are labeled with historical tidbits and the basement has a great historical display with lots of information about the building and some of its infamous visitors. Great space for a gathering or reception.",
   "This place has the BEST gift shop if you're looking for unique (and affordable) gifts!  So I absolutely love the different events that the Landmark Center does, from plays to the Ghost Tour to the Christmas Market.  But I also love their little gift shop!  It's not open as many hours as the building, but I've gotten so many unique gifts there!  Definitely worth checking out!",
   "Quite a bit of history since this was the biggest building in St. Paul at one time in its life. We enjoyed a wedding and reception here last night. Elegance at first a four piece string ensemble for the wedding ceremony and later candlelit tabletops for each table at the reception. Then a social hour on the second floor and then a contemporary band playing 70s and 80s dance music on the dance floor. Very nice",
   "Absolutely stunning wedding venue. The location for nearby churches and hotels can’t be beat, and the staff make the experience of wedding planning less stressful. We worked with Hilari who went above and beyond to meet our special requests, designed an amazing layout to meet the needs of our reception, and was an absolute joy to work with. Love that we could bring in the licensed caterer of our choice to create exactly the menu we wanted. I also have to say the value for the price in the Twin Cities is unbeatable. We comfortably seated 270 guests with room for cocktails and the dance floor."
  ]
 },
 {
  "name": "Rice Park",
  "address": "109 W 4th St, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4cf959f6-9334-11ea-aaa9-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "free",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=3000469269666412087",
  "source": "GoogleMaps",
  "reviews": [
   "Nice park... My kids always love this place to come. We plan to spend time another day time...",
   "A wonderful free event to get out of the house in the winter and do something fun! This event has been around for 100 years and is fun for the whole family.",
   "Fun to see. Parking sucks.. we almost didn't go because of that. Luckily I found a spot when someone pulled out.",
   "It is very small for a park. To me, it is really a small open air plaza like area in the downtown. It is nestled around some old ( and new) historic landmarks.",
   "Small park. No play equipment.  However, it is a nice place to sit and enjoy the sights.  They have several events held there all year."
  ]
 },
 {
  "name": "Wabasha Street Caves",
  "address": "215 Wabasha St S, St Paul, MN 55107, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4d45c65e-9334-11ea-8fba-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "tour",
   "music",
   "unique",
   "tour",
   "family",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8528276766257254865",
  "source": "GoogleMaps",
  "reviews": [
   "I was hoping for a bit more “exploring” type tour with narrow passageways and the “And now on the right you will see a vein of gold” or lead or whatever. Our group was too large. The guide was good and really knew his history, but for that many people he should have had a microphone. I did like the large size photos set out at various points that we could inspect, cuz we were way too far away to see them when the guide was showing the group.",
   "Fun 45 minute tour.  Something different from the typical tourist venue.  Thursday night music and dancing",
   "We had a great time at the wabasha caves \nIt is a very unique place to visit and have fun we will definitely be coming back again soon and this time we will stay till close.\nWhen one come here for the first time it is a special feeling  at least for me it was maybe a little on the creepy  side. Cool experience \nThank you. \nJ. L",
   "Had a great time on their gangster tour bus driving around Saint Paul.  Very Educational and entertaining hadn't done that since I was in school.  Definitely something fun for the whole family But you should be old enough to appreciate it my son was 10 and he loved it",
   "Super interesting history and the tour guides love to answer questions. Great spot for something a little different!"
  ]
 },
 {
  "name": "Mears Park",
  "address": "221 5th St E, St Paul, MN 55101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4da34ff6-9334-11ea-a761-14b31f159f22.png",
  "tags": [
   "family",
   "delicious",
   "free",
   "art",
   "music",
   "food",
   "walk",
   "walking",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16109009644293191303",
  "source": "GoogleMaps",
  "reviews": [
   "Great free music in the summer. They book the best local bands and really fill the park! Fun environment for young and old. They had a local brewing company's beer truck on site priced reasonably. The restaurants across the street are delicious, though on a night with a good band you might wait awhile for a table. We sat on a patio at a great place across the street for the opening band then moseyed into the park for some really good local brews and amazing music. We had family come in from out of town a few months back and knew we had to bring them here! Everyone had a perfect night. The park itself is very nice, too, and has art events on top of the music.",
   "Bands on Wednesday during three summer. Food trucks to tickle your tummy. Lots and lots of choices. Beer truck with lots of Craft ales to try. Music,sunshine,dancing,food and a very clean scenic park. Easy to get to by bus or train.",
   "A very quaint and nice place. My dog and I walk through often and enjoy walking along the water. If you live on the St Thomas campus, I recommend taking a walk through here because it is just beautiful and a quieter part of campus. There are even benches if you want to study in a quiet place.",
   "Very pretty. A realistic running stream and mini waterfall. Lots of beautiful anual and perennial flowers blooming (July 24). Each garden area has a sign with the name of the person who cares for that section. Lots of space to roam, lots of park benches. Great eateries across the street with beautiful outdoor eating spaces with more plants and trees, with a hip vibe. Lots of fun on a summer afternoon or evening!",
   "Went here with my Brother and his family to see a couple bands. Got some food from one of the food trucks and a couple beers from the Beer Tent. Was a very enjoyable Thursday evening. Highly recommended."
  ]
 },
 {
  "name": "Twin City Model Railroad Museum",
  "address": "668 Transfer Rd Ste. 8, St Paul, MN 55114, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4e074234-9334-11ea-b4e2-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6689478992631125143",
  "source": "GoogleMaps",
  "reviews": [
   "Why is it that the world we live in every day is made so much more delightful in miniature? \nIs it the birds-eye view?\nDo we like to play God?\nIs it impressive to see the time and attention people pay to lovingly recreate a place, a time period, or a scene? \nAll of the above, yes.\nGreat place for kids 2+ who can keep their hands to themselves (for the most part) but gobs of hands-on toys and buttons throughout the exhibits.\nFantastic!",
   "We went to see the \"Night Trains.\" Grandma, mom, dad and a 2-year-old. It was fun for all ages. There are so many details to look at and buttons for pushing. We spent about an hour here but easily could have been longer. There are train tables for the little ones to build their own tracks.",
   "Amazing displays, very interactive for all ages and completely kid and toddler friendly! Their Lego display is outstanding, they have 6 train tables for little ones and 3 Thomas trains for kids to become the engineer and run themselves. We will be back!",
   "If you're kid is into trains, this a great place to visit! They have model trains, with buttons to push to make them go. There are also a dozen play tables in the back - think Thomas and Brio - so the younger ones have fun too. It seems to be a gathering spot for local clubs - Legos train group and staff tending to the displays. Family bathroom in the museum, and regular bathrooms in the main building.",
   "OH YES!!!!!!!!\n\nI am a BIG TIME train fanatic! This place is totally worth the tuppence they charge for admission. Great place if you have a soft spot for trains and model trains!\n\nThey have displays of many different gauges and locations. My favorite was the huge layout in the center of the room. This is the first time I spent 4 hours in such a small \"museum\" type location. The detail and interactivity was great. The staff was also great! As much as I shy away from locations with kids, this is a good place to bring children to introduce them to model trains. I couldn't wipe the smile off my face while I was there.\n\nOne last cool thing was that they have model train cars, engines and accessories for sale. I had to stop myself from buying anything as my current lay out is in storage and I cannot add to it until its back up!\n\nI recommend this place. Its in a sleepy, little non descript mall, but well worth the visit for train enthusiast young and old."
  ]
 },
 {
  "name": "Hidden Falls Regional Park",
  "address": "1313 Hidden Falls Dr, St Paul, MN 55116, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4e52a4ba-9334-11ea-b5f1-14b31f159f22.png",
  "tags": [
   "free",
   "nature",
   "walking",
   "free",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=11340554241393480526",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to go hiking, fishing, bird watching or have a picnic. Great picnic grounds. Fantastic views of the Mississippi River.  Has a  free great boat launch with ample parking for you truck and boat trailer. Nice hiking trail thru heavily forested river bottom lands.",
   "Place was awsome with tons of possibilites. You could do anything from walking to fishing and more. The place has a nice lite man made water fall in a nice quite secluded place which is nice when one wants to enjoy more of nature.",
   "Great beautiful park. Free of charges. Lots of parking spaces. Walking & hiking paths right down on the Mississippi River. Picnic booths & elegant hidden views.",
   "Beautiful spot. Good fishing to be honest but it's probably not a good idea to keep anything from the river unless it's a really good catch. I have been tempted by the idea of catfish nuggets, however.",
   "Neither hidden, nor falling.\nWe found them.\nStill good."
  ]
 },
 {
  "name": "Alexander Ramsey House",
  "address": "265 Exchange St S, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4ec8e640-9334-11ea-a62d-14b31f159f22.png",
  "tags": [
   "history",
   "tour",
   "historic",
   "family",
   "art",
   "tour",
   "family"
  ],
  "link": "https://maps.google.com/?cid=12341258549749347114",
  "source": "GoogleMaps",
  "reviews": [
   "It's a beautiful place to know part of the history of Minnesota....No pictures or videos...",
   "The historic tour lasts a little under an hour and allows you to explore all over the whole house, all three levels. What is especially good is that there are different tour hosts in each room of the house so you get many perspectives from folks in period dress who are play-acting that they really live there. When you're in the kitchen, they serve a lovely tray of cookies baked in the wood-burning stove. Our 4 year old granddaughter was interested throughout, but really got excited at the very end when they took us to the playroom and we saw toys from the time. Insights into the lives of the occupants were shared that made it historically memorable. The guide read from letters that were written at Christmastime from the wife to her husband.",
   "A few years ago, I enjoyed a beautiful visit to the Alexander Ramsey House. I picked up the Ramsey family Christmas cookie recipe book. Today I made the Gingerbread Cookies and the flavor was excellent! Don't forget to add the ginger spice as it was omitted in the ingredients. I used 1 tsp of ginger and I baked them on parchment paper. Baking will take longer, depending on the cookie size and shape so watch closely and enjoy. In the pictures you will see my Nantucket Lightship basket that I just finished making.",
   "I went to a Victorian Seance here for Halloween and I think that was the most fun event I’ve ever been to!! Gorgeous manor with stunning furnishings and art- at midnight. 10/10 would recommend.",
   "Victorian Christmas tour was full for weekend.  The start at the visitors center is decked with many seasonal items along with historical books.  No pics allowed in the house itself!  Guides in period dress relate the customs of the time and stories of the Ramsey family.   Nicely appointed with Christmas tree in the parlor, and cookies from the wood burning stove offered to visitors.  Well worth  $12 admission for one hour tour."
  ]
 },
 {
  "name": "Minnesota Children's Museum",
  "address": "10 7th St W, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4f45ddba-9334-11ea-9f79-14b31f159f22.png",
  "tags": [
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10898485114780361203",
  "source": "GoogleMaps",
  "reviews": [
   "Super fun! We went with our 2 year old and 6 month old and there was plenty for both to see and do. Highly recommend bringing a change of dry clothes if you are going to spend any time at the water area in the Sprouts room (3 and under) - they have air dryers but they can only get so much drying done.",
   "This is such a fun and amazing place.  I have presented magic shows here many times and his picture is from the big fun Halloween event they did a few years back.",
   "What can I say but we severely miss the old museum.  We barely ever go now and will probably not renew membership.  The old museum is no comparison to the new one.  So much more to do in the old one.  This one is just ho-hum.  Flashy, but no substance.  Even the craft/create room is a let down.  How about bringing back all the bins of fun stuff to let the kids create???  Sigh...why do all the good things have to go away for the \"new and improved\"  but never better versions.  I guess at least the folks who apparently were never at the old museum seem to love the new one...lucky they have nothing to compare it to.",
   "My husband and I went to the \"Adult Night\" at the museum, and it was one of the most fun experiences I've had in the Twin Cities, and I grew up here!  You get to play with the different experiences, and try new things, and play all the games.  The lines for the beer were a bit long, but honestly, we were playing so much that we didn't feel like we needed to go back for beer.  We just had some when we got home, and enjoyed our time at the museum instead!",
   "Very nice place. We were just there today. Plenty of fun for kids of all ages. The air tubes and ping pong balls were the best. Nice restaurant-toy shop on site. Clean  restrooms, and convenient parking."
  ]
 },
 {
  "name": "Mississippi National River and Recreation Area",
  "address": "120 W Kellogg Blvd, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/4f95d290-9334-11ea-935c-14b31f159f22.png",
  "tags": [
   "walking",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12653529956180785669",
  "source": "GoogleMaps",
  "reviews": [
   "This bridge is longer and busier than it look and theres not a lot of restroom nearby so make sure youre ready especially when you have to park so far away because parking space is always scarce. But all said and done, its a very nice place to chill and go for a stroll.",
   "I really enjoy going here.  This area is one of the most beautiful places in Minneapolis.  It always makes me feel so happy to live here.  We have such a beautiful city!",
   "How can you go wrong with the Mighty Mississippi! The \"area\" is easy to access and get to. The trail system, either walking, riding bikes, or driving through the park in a car. It's all beautiful. Do some Nordic skiing in the winter too. Sit by the river and enjoy and beautiful and powerful energy.",
   "I love this area of Minneapolis so much history and new age all in one. Also very peaceful with the river",
   "One of my favorite places in Minnesota to go! Expecially on July 4th!"
  ]
 },
 {
  "name": "Como Regional Park",
  "address": "1199 Midway Pkwy, St Paul, MN 55118, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/500a3f78-9334-11ea-b3c0-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "walking",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=3369741566342793590",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful park, lots of open space to relax in the shade. Excellent bike trails and walking paths. Very nice zoo ( free admission ) a small lake with a fishing pier and a dock. Canoe and kayak rentals as well as tandem bikes and buggies. Very nice surrounding neighborhood. Great place to take the kids or even a first date. One of the gems of the twin cities....",
   "Love this park, but especially the Como Conservatory. Gorgeous experiences in many environs. The sights, smells, and sounds are another world. I like it best when the crowds are minimal, and I can experience the solitude I love. Bring drawing materials, sketching is just awesome! The carousel is my favorite...I am seventy and the ride is still such a delight!",
   "My kids love this place. We plan our trips to the zoo after 1PM because there's a good chance that the animals are awake from their naps. Except the cats, those cats do whatever they want. (Dad joke) my favorite exhibit is that of the snow leopard. Such a fascinating animal.",
   "I love the size of Como Park Zoo, it's not tiring to visit with small children but has a good variety of animals. The zoo is clean and easy to get around. The botanical center is lovely especially on cold winter days! And the bonsai collection is fascinating",
   "Donation admission means you can visit free, but the recommended $3 adults/$2 children is low enough that I don't see how anyone could not find that value on a visit. Despite some repairs being needed, a wintertime visit (non-ideal), and some new construction set to resume in spring, it was a worthwhile stop with a toddler. Small enough to cover quickly, and thorough enough to see a variety without needing a stroller."
  ]
 },
 {
  "name": "Minnesota Transportation Museum",
  "address": "193 Pennsylvania Ave E, St Paul, MN 55130, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/50853c66-9334-11ea-b135-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food",
   "music",
   "family",
   "kids",
   "kids",
   "family",
   "knowledgeable",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=4566846377428184193",
  "source": "GoogleMaps",
  "reviews": [
   "Several trains to go inside. A large car that is a dedicated sitting area with toys for kids. Cool model train displays. Loved the Christmas event with Christmas music. Half mile train ride nothing much but my kids loved it. Really a nice place to go with little kids as a family. My 2.5 year old loves trains. Workers are super enthusiastic and love what they do. Nice lower stim place to go. Not much for food but there are tables if you wanted to pack lunch. \n\nMaybe the price is slightly steep but without other funding sources I’m sure it is what needs to be charged. I value the museum and will pay for the experience here and there.",
   "Good place to take a family. It is interesting and has fun activities for children. My grandson's loved the ride in the caboose.",
   "Great price, lots to do and see for kids and adults of all ages.  My kids love playing with the train sets as well as exploring the trains INSIDE the building.  They also love riding the train (outside) as well.  I really enjoy watching the model train set as there is so much detail and items hidden throughout the track.",
   "My family worked for the SOO LINE RAILROAD so this museum reminds me of my grandfather. Its really a neat place. You get to see all the old train cars and how they ran them. They also have a toy train set up for kids to see.",
   "This museum holds an excellent selection of railroad memorabilia.  It's staffed by knowledgeable volunteers.  Be sure to request a tour of the restoration shop."
  ]
 },
 {
  "name": "Indian Mounds Regional Park",
  "address": "10 Mounds Blvd, St Paul, MN 55106, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/50e8441e-9334-11ea-9aac-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "family",
   "walk",
   "history",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=8966373505882106339",
  "source": "GoogleMaps",
  "reviews": [
   "Its always been a nice place if you need some alone time. Its quiet and doesn't have a lot of traffic. Its really beautiful in the summer its one of the best places in the city. I've been coming here since i was a kid and its one place that hasn't change very much. plus it has one of the best views of the city",
   "This park has a lot to offer. Open fields, park benches, Pavilions, a playground, public restroom, even a wonderful scenic view of the city. The burial grounds can also be a great sight if your into it. One complaint I do have however is that there's an ugly tennis court with cracks everywhere, and grass growing all over the court. Compared to the rest of the park it just looks hideous. The city either needs to tear it down or renovate it. Aside from that you got yourself a nice park. This place seems ideal for family picnics, or short strolls.",
   "Excellent spot to host events as well as just hangout with friends a d family. Great play ground for kids. Very clean and we'll take care of.",
   "Such a beautiful place to walk and enjoy the nature and history inside of a major city. Hopefully they don't take away the trail like the proposed signs around!!",
   "First off this park is enormous with alot of different sections but overall it's very interesting."
  ]
 },
 {
  "name": "Como Town",
  "address": "1301 Midway Pkwy, St Paul, MN 55103, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5142c046-9334-11ea-8f7f-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15778320194969044240",
  "source": "GoogleMaps",
  "reviews": [
   "This place had friendly people and were inexpensive. Lots of animals and shows to see.",
   "My three year old loves this place! An amusement park with many rides that little kids can enjoy. You can buy an all-day or all-season pass and let your little thrill seeker go on their favorites over and over. There is also a fun playground with splash pad inside so bring extra clothes or at least a towel. Some rides allow an adult to ride with their kid for free (Bees, bumper cars, tea cups ) My only complaint is the dark, dank restroom on site but at least it's there.",
   "The bathrooms in the main entrance were completely flooded and smelled like urine. We waited in line for a long time for the tiger coaster and they were not astute enough to shut it down while assessing whether it needed repairs so we had multiple times of people waiting in line while they were fixing it. We also had an issue with rude staff giving us a hassle about our tickets. Yes, we bought them a year ago, but they explicitly said “no expiration,” so I’m not sure why they made a big deal out of that. We purchased tickets - what’s the difference as long as we payed to get in? After we got that sorted out, the rest of the park was pretty fun. It would be really great if they had places where younger kids in the 2-4 year age range could play while their older siblings go on rides. This would make it MUCH easier on parents. Also, more clean bathrooms. Did I mention clean bathrooms? Don’t let this post discourage you completely from going to Como Town - we did have a lot of fun there and it’s a nice addition to the zoo. I just want to make you aware of a few shortcomings that were a bit disappointing, especially since we drove almost three hours to get there.",
   "Accommodative activities for all while you enjoy time out with family",
   "Great for kids 8 and under, I would say. (Any older and the kids might get bored because there are very few \"thrilling\" rides). Toddlers/preschoolers will enjoy the many options available to them, including a splash pad and playground! I wish there were more rides, though. You can do everything in a short period of time."
  ]
 },
 {
  "name": "Minnesota Museum of American Art",
  "address": "350 Robert St N, St Paul, MN 55101, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/51ae53ca-9334-11ea-9f94-14b31f159f22.png",
  "tags": [
   "free",
   "parks",
   "creative",
   "historic",
   "art",
   "art",
   "history",
   "historic",
   "free"
  ],
  "link": "https://maps.google.com/?cid=6135929382197433081",
  "source": "GoogleMaps",
  "reviews": [
   "This is 5 out of 5 Stars! It currently features an exhibit called, \"A Choice Of Weapons Honor And Dignity.\" It features the amazing photography of Gordon Parks, who brilliantly documented America during the Jim Crow era and Jamel Shabazz who covered from the 1980's through today.  \n\nIt's in the old Pioneer Press building in St. Paul which is the same building where Gordon Parks once worked.  You can feel the love that both of these fine artists put into their work. This is a must see and admission is free!",
   "The \"M\" has a beautiful new extended exhibit space in the historic Pioneer-Endicott building.  It is a perfect place to display all types of art. They also have a large creative space where artists are invited to create art with the public. I have been there several times and have always enjoyed the exhibits including the current exhibit.",
   "While the show participants weren't necessarily Minnesotan at the show I saw, the theme was timely, sensitively produced, varied, well curated. I would have liked a local interest \"story\", if that was included, I missed it. Also, we Googled the museum and each phone came up with different results. The build out is immaculate, but there were stairs to nowhere, I wished the bridge upstairs was utilized in the show. I want to show art here. There was a room for children and young adults, too, where we sat and made zines. Nice. Minnesota Nice!",
   "A little underwhelming in size, but the artwork they have is diverse and beautiful. It's fun that they have included some of the beautiful history of the building. Looking forward to going back when their next expansion is complete.",
   "Free admissions and located in a historic building. Eclectic curation in a newly renovated space."
  ]
 },
 {
  "name": "Landmark Plaza",
  "address": "379 St Peter St, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/520db1f6-9334-11ea-b0ca-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "active"
  ],
  "link": "https://maps.google.com/?cid=12239676498142995370",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful place, we visited just a few hours ago and had fun taking pictures with our favorite gang. The park is in need of cleaning and some work, I guess after the hard winter we just had in Minnesota is normal. Please keep it clean and  in good shape. Highly recommended it, walk around downtown and discover the beautiful architecture.",
   "Fun area to walk around and people watch!  Cute statues of the Peanuts gang throughout the park😊",
   "For the love if 'Peanuts' Characters",
   "A nice place to come and really remember the best Peanuts tv episodes and the newspaper cartoons. The drinking fountain is still active through atleast September maybe October. Right now they have rainbow things hanging in the memorial.",
   "A small, beautifully whimsical homage to the illustrator of many childhoods.  The bronze statues stand, or sit, poised in their most famous situations, each placed with their closest friends."
  ]
 },
 {
  "name": "Bell Museum",
  "address": "2088 Larpenteur Ave W, St Paul, MN 55113, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/526cea5a-9334-11ea-adc9-14b31f159f22.png",
  "tags": [
   "walking",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7194363000997113147",
  "source": "GoogleMaps",
  "reviews": [
   "The College students working here are extremely helpful and attentive. This museum is full of quick to read informative and interesting facts about the universe and Minnesota wildlife. The displays are top notch! Disappointed the Planetarium was closed today and we wanted to see a show.",
   "Spent the last 15 minutes of open hours walking around some of the galleries and I was impressed. So many visual displays with concise descriptions. Lots of wildlife and flora on display. Entry fee is a fair price. I’m definitely coming back to spend a lot of time taking it all in, as well as planning to see the planetarium presentations. Even the outdoor space by the pond is beautiful.",
   "Very kid friendly exhibits my 3 year old daughter wasn't frightened by any of them. Highly recommend you bring your children there's lots of hands on things for all the kiddos to take part in.",
   "Gorgeous museum! I was surprised at how much I enjoyed the museum and at how much I learned. There are so many interactive exhibits for younger kids too. My 3-year-old loved the beaver puppet theater, the stork mating dance tutorial was hilarious and the huge Touch and Feel Lab on the first floor has a lot of things to do, we ran out of time! I recommend anyone visiting Minnesota to put this on their top 5 things to see! Yes, top 5!!",
   "This is a very informative museum.  It is great for all ages.  Has a touch section where you can check out cool rocks and bones and live animals.  I do wish that part was better labeled.  They had all these rocks and skulls but we didn’t know what they were!! The current giant moon exhibit is also very cool and interesting to see.  The exhibits were immaculately clean I’m not sure how they do it, but probably the cleanest natural history museum I’ve ever been to.  I also enjoy that there seems to be room for growth of new exhibits as time goes one."
  ]
 },
 {
  "name": "Phalen Regional Park",
  "address": "1600 Phalen Dr, St Paul, MN 55106, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/52ca251c-9334-11ea-84e5-14b31f159f22.png",
  "tags": [
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=12358580475140570599",
  "source": "GoogleMaps",
  "reviews": [
   "There is a new thing that was built with a China theme. And it is so amazing! All the people who worked on it were very skilled. If you haven't been to Lake Phalen for awhile its worth the trip. Its on the west side of the Lake",
   "Great place to goes for a good long walk. Nature's scenery. Love it alot",
   "Very nice sized park. One star less cause they could put more engaging spaces for children.",
   "This place has come a long way. No motorized boat on the lake means peace and quite; the perfect 5k walk/run. The run around the lake offers uphills, downhills, and flat asphalt. It gets  crowded during the summer days. Early mornings, later evenings and weekdays before 3pm are the only time anyone can ride bike without interruptions of dodging walkers/runners. Surprisingly deep at 91 feet.",
   "The place it beautiful! That and the beach is loads of fun! I love both running around the lake and swimming in it! They got a platform you can dive off of as well! Fun for you and the whole family!"
  ]
 },
 {
  "name": "Harriet Island Park",
  "address": "200 Dr Justus Ohage Blvd, St Paul, MN 55107, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5322cc6e-9334-11ea-a5d7-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "family",
   "free",
   "walk",
   "walking",
   "walk",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=11513530421593836428",
  "source": "GoogleMaps",
  "reviews": [
   "The Harriet Island Park is breathtaking. It was a lot nicer than I expected. It is especially beautiful in the fall! \n     There is free parking on the streets and some in parking lots. \n     This area can be sketchy at times so be careful especially by yourself.\n      You can rent bikes which there is a bunch of  and sometimes you can find a scooter to rent.\n       There is a wonderful part for kids to play in with all ages. There is even a zip line!",
   "So beautiful with the city of St. Paul as a back drop. Handicap accessible with wide lanes to enjoy the views. Riverboats, free scooters, large grassy areas to picnic. I meet a new friend that was biking from Egan and back on this lovely day. Many nice people were out and about. Well maintained and groomed. A wedding was going on in a lovely small bldg. During my visit. So if you want a romantic place to spend with your SO or spend quality time with the family I suggest this place. Oh yes free bicycles too. I will be back.",
   "Besides the homeless people and rude bike lady, it's a pretty place to walk around. Lots of wild flowers on the path. Tried to go down by the river, but the path lead to a small camp that looked like someone's home so we turned around. There was also a guy hiding in the bushes, which was slightly scary. But hey, the flowers are pretty.",
   "It was flooded the day I visited but still a beautiful place. Plenty of parking and some nice walking trails.",
   "Nice park with walking and bike trails. Also has picnic tables. Good for an evening walk or a family picnic. Amazing views of downtown St Paul."
  ]
 },
 {
  "name": "Lilydale Regional Park",
  "address": "950 Lilydale Rd, St Paul, MN 55118, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/537de4ca-9334-11ea-a6dc-14b31f159f22.png",
  "tags": [
   "kids",
   "nature",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=14676380148300745620",
  "source": "GoogleMaps",
  "reviews": [
   "A very nice park! My school visits the park often and we treat it like our own backyard. Fairly clean and you can do lots of things within the park with how much space there is. The park looks really cool when it's flooded in the spring!",
   "Lilydale Regional park is nice! I went there during a fest on my visit to the US from India called the “veg fest”. One of my friends had a stall during the fest where I ‘was helping l. The team of volunteers were super helpful. The place overall is nice and decent. Lively when people are around and silent and serene when there are just a few. Feels very nice and connected to the nature.. Good place to spend an evening with kids or friends.",
   "So quiet and natural. Lots of wildlife including the homeless ;), but very very nice to be minutes from our house.",
   "Beautiful open space! Truly defines what a park should be! Enjoy nice open space with lots of grass. Great place to take the kids (young & young-at-heart). Also a nice spot to get away from downtown without having to go to far!\nAnd also nice for big outdoor events! Like the Red Bull Flugtag! (See pics)",
   "Nice place to stop after work and relax. Beautiful park."
  ]
 },
 {
  "name": "Large Green Chair",
  "address": "480 Smith Ave S, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/53eef680-9334-11ea-8acf-14b31f159f22.png",
  "tags": [
   "free",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1712469726759005651",
  "source": "GoogleMaps",
  "reviews": [
   "This is a nice free attraction to take pictures at on a wonder Minnesota night! I would not recommend going to this attraction and climbing on it when it is wet. The chair is slick even when it's dry. \n\nIt may be hard to climb for some because there isn't stairs or ladder to the top of it. You however don't need to be extremely good at climbing an average climber can make it up just fine.\n\nThere is parking on the street in the area around the park. There isn't a parking lot.",
   "The Large Green Chair is a very fun place to take photos and spend some time in the beautiful outdoors!",
   "Big green chair is a quick fun stop for tourist. There is limited parking near by.",
   "Was an Excellent Day to go walk about!",
   "My kids love climbing on this thing!"
  ]
 },
 {
  "name": "Crosby Farm Park",
  "address": "2595 Crosby Farm Rd, St Paul, MN 55116, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5453fa3a-9334-11ea-82a5-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=10585850804104146806",
  "source": "GoogleMaps",
  "reviews": [
   "Pristine park, wish it had maps of trails for new visitors, but our exploration lead us closer to the Mississippi river bank. The easier trail to go with the elderly to enjoy the vista. Spotted lot of stinging nettles on the floor level and lofty gigantic trees all living harmoniously!",
   "Very cool place for a nature walk\nI like to stop here before or after work sometimes",
   "Great place to walk along the river. I take my son and we meet my friend and his daughters and usually do a 3 mile round trip walk. Beautiful place. Paved and non paved trails too. Dog friendly and bike friendly.",
   "I really liked the trails. There are several downed trees that seem to have been there for some time now. It would be nice if those were removed.",
   "Great get away within the city. Rare encounters with people"
  ]
 },
 {
  "name": "Crosby Farm Regional Park",
  "address": "2595 Crosby Farm Rd, St Paul, MN 55116, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/54b442f4-9334-11ea-8154-14b31f159f22.png",
  "tags": [
   "parks",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=1992035359799453142",
  "source": "GoogleMaps",
  "reviews": [
   "Great easy hiking and biking, easy access and a large area to spend a few minutes or hours of time. The City of St. Paul has done a remarkable job with wildlife presentations that one forgets that you are in the city. It has paths that lead to the University of Minnesota to the north and regional county regional parks just south of the city.",
   "Great place for a peaceful walk!",
   "Been going to this place my entire life and I am always. so happy to be here. It's a hidden gem that has sandy beaches by the river, to a peaceful dock, to a path along a cliff to a quiet walk in the forest. Best place to spend afternoons.",
   "One of my most favorite places to go hiking.",
   "Went to Crosby Farm Regional Park a week ago and had a wonderful time.  Though most of the trails were closed due to flooding, we made the best out of the situation.  The wetland boardwalk was flooded with about a foot of water, but still walk-able with caution.  The sun was shining and the water was clear so we took off our shoes and waded through the watery trail.  It was like a mini tropical location but in MN :)"
  ]
 },
 {
  "name": "Cafesjian's Carousel",
  "address": "1245 Midway Pkwy, St Paul, MN 55103, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/551eebcc-9334-11ea-a1da-14b31f159f22.png",
  "tags": [
   "historic",
   "kids",
   "family",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=512210354001599827",
  "source": "GoogleMaps",
  "reviews": [
   "So much fun with children. A chance to experience a classic carousel that has so much more to offer than any other in the metro",
   "A very nice, little (and inexpensive) stop to add a Come memory.",
   "A beautiful and fun carousel with very friendly staff and interesting historic information",
   "This price is right and the carousel is beautiful.  Our kids love it every time we come and at $2/person it's affordable for the whole family.",
   "Over 100 years old, caught fire in 1939, it has been restored and continues to run to this day.  I rode it as a child at the Minnesota State Fair. I brought my children to ride and now my grandchildren. They love the ride as much as I do. I know that we will continue to visit the carousel for years to come. You never outgrow the fun of the carousel."
  ]
 },
 {
  "name": "Fort Snelling State Park",
  "address": "101 Snelling Lake Rd, St Paul, MN 55111, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/558ffd8c-9334-11ea-96cb-14b31f159f22.png",
  "tags": [
   "historic",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=2762546645534209240",
  "source": "GoogleMaps",
  "reviews": [
   "I've lived in MN my whole life but never knew this state park was hiding in the twin cities! I've been to historic fort snelling before and wrongfully assumed that was the same thing as the state park! \nThe park is lovely and has many amenities; several pavilions, bathroom buildings, a playground, the beach access to the Minnesota River! It's just a great way to spend an afternoon.",
   "Beautiful, well maintained park. The views are fantastic, hiking off trail is fun - and it's tough to get lost when you know you're always between the river and the bluffs! I love going here with my friend and her dogs.",
   "Broad expanse of wilderness located close to Minneapolis and Saint Paul. The river valley is a beautiful and varied landscape with lots of running water, small lakes, and ample wildlife. I went here last for a candle lit new year's walk that was gorgeous. Keep putting on great events like this and I will keep coming back.",
   "Excellent spot for super moon rising views. Historical, interesting. The lower part is a lovely river bottom park with a network of trails, plenty of parking, picnic areas and a spring fed lake for swimming.",
   "HUGE state park right off the freeway. It gets better the further in you go. Pike island is a highlight. Many deer and turkey all over the park. You can walk to the fort from the park."
  ]
 },
 {
  "name": "Battle Creek Regional Park",
  "address": "2300 Upper Afton Rd, Maplewood, MN 55119, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/55db5e6e-9334-11ea-8b60-14b31f159f22.png",
  "tags": [
   "parks",
   "walk",
   "walk",
   "nature",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=210845758711235064",
  "source": "GoogleMaps",
  "reviews": [
   "Huge stretch of trails through woods, different paths to go down every time you visit keeps it new and exciting. There are a few open spots along the trails which are great for the dogs to play together. My dog absolutely loves coming here (and sitting on the benches)",
   "Looks like it could be a nice hiking spot. But all the trails are apparently reserved for cross county skiing right now. Having that posted somewhere online before getting to the park would be great. Google also couldn't figure out how to navigate us to the parking lot of the park without explicitly saying we wanted the community center.",
   "Battle Creek Regional Park is a sprawling park with bike and hiking trails, forests, winding creeks, and a variety of activities for all to enjoy.\n\nThis is one of my favorite parks in the area, as there are just so many things to do.\n\nDefinitely worth a visit!",
   "The park is awesome. The trails are awesome.in the winter time it would be nice when they plowed to go over it again when the snow melts a little bit so there's no ruts.I only say this because I use a walker when I do my walk. Spring summer and fall is great.Battle Creek Park is great and you guys are doing a fantastic job.",
   "This is the most amazing dog park! It's so big you can take a nature walk though it. I love bringing my dogs here. We all get to exercise and have fun exploring. Make sure you bring water for you pups though, they don't have water fountains, and you and your pups will need water after all that walking. 😁"
  ]
 },
 {
  "name": "Bruce Vento Nature Sanctuary",
  "address": "4th St E, St Paul, MN 55106, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/564fcb8a-9334-11ea-94d4-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "walking",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=17675345172053154844",
  "source": "GoogleMaps",
  "reviews": [
   "A small park being renovated little by little from toxic dumping and industrial space to prairie. A sacred site to indigenous people, and some great collaborations are happening here. There’s a small parking lot so it’s easy to visit. Good interpretive signs to learn about the history of the space. Wave at the prairie when you visit.",
   "Great place to escape the city that's literally right across the river from downtown St. Paul. Some nice walking trails, wildflowers and bird watching when you can't take a longer trip out of town.",
   "A nice place to go! If you want to get out of the city (Downtown Saint Paul/LowerTown area) you can! \n15-20 min bike ride and your in the wilderness/forest. If you time it right you might even see a couple deer!",
   "Decent park for a walk in downtown. Trails are ok. Beautiful clear waters make for easy viewing of local wildlife. Homeless folks are about as well. Doesn't feel safe, but it is convenient to access. Nice dog walking.",
   "Follow this trail all the way up to Maplewood it is a nice grade fully dedicated path that never gets too crowded."
  ]
 },
 {
  "name": "Frederick R. Weisman Art Museum",
  "address": "333 E River Pkwy, Minneapolis, MN 55455, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/56a89a14-9334-11ea-a778-14b31f159f22.png",
  "tags": [
   "art",
   "unique",
   "walk",
   "art"
  ],
  "link": "https://maps.google.com/?cid=14767817614084970554",
  "source": "GoogleMaps",
  "reviews": [
   "Really great experience. Relatively smaller than many traditional art museums but the collections are really impressive and highlights local as well as national artists. The building itself has a modernist architecture. Worth a visit while in Minneapolis.",
   "This has always been a fun place to go. Very intimate. Great gift shop for unique gifts.",
   "Impressive building design and beautiful art collections. Whenever visiting Minnesota University, you could walk to this place via connecting bridge easily.",
   "Fantastic museum, in the heart of the Minnesota campus. We really enjoyed our time there.",
   "Great place to take in some culture.  Open to the public, lots to look at.  Staff is great.  Be sure to support your local artists."
  ]
 },
 {
  "name": "St Louis Church",
  "address": "506 Cedar St, St Paul, MN 55101, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/56f97962-9334-11ea-91db-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=12728421502292383109",
  "source": "GoogleMaps",
  "reviews": [
   "This may be called the little church but there's nothing little about it's beauty.  A reverent place that shares its grandeur through stained glass, beautiful designed heavenly sounding organ, and an overall sense of God's presence.  A wonderful place to worship.",
   "This church is so beautiful inside and is a very peaceful place to come and reflect. The architecture is amazing!",
   "Another great concert. Widor raises the rafters",
   "A small, quaint, ornate Catholic church in downtown St. Paul.  One of the speediest masses I've ever attended at 40 minutes.  I dont know if it was just that particular day or not.  A very beautiful church.",
   "Beautiful church with windows tracing French Catholic saints and history in North America"
  ]
 },
 {
  "name": "Church of the Assumption",
  "address": "51 7th St W, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/575f4058-9334-11ea-9d78-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=3976213893215225466",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely Catholic Church ... Confessions every day.  Mass every day.  Downtown Church. Nice parking lot. Tuesdays Our Lady of Perpetual Help Devotion and Fridays, Devotion to the Sacred Heart of Jesus.",
   "I was here for a wedding. The inside is really beautiful and was a lovely setting.",
   "My mom’s visitation, funeral mass, and luncheon were here and the church is absolutely beautiful and the people who worked with me were extremely sensitive and helpful. I was completely lost as far as planning a funeral and they helped me with everything and made it much easier for me. \n\nI always assumed parking would be difficult considering the location on 7th Street, but there is a huge parking lot in back, so it’s very easy to visit the church.",
   "My husband and I love our church,  we are the 5th generation to worship in this beautiful church",
   "Pretty church. Nice service."
  ]
 },
 {
  "name": "Padelford Riverboats",
  "address": "205 Dr Justus Ohage Blvd, St Paul, MN 55107, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/57c8fef4-9334-11ea-ba3a-14b31f159f22.png",
  "tags": [
   "learn",
   "tour",
   "kids",
   "history",
   "history",
   "learn",
   "family",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=505141641814797849",
  "source": "GoogleMaps",
  "reviews": [
   "This was one of the best experiences I’ve had in the area. With good weather, and great people, this trip can be very memorable in every way. Great opportunity to have some drinks and be a part of some great conversations. The tour guides tell some great stories, and explain some of the things the boat will pass. Kids would love this so much since you’ll see some animals on the shores or eagles for them to see. They can learn a little bit about the history, and you can relax as they can’t go too far since you’re on a boat. I highly recommend doing this at least once! Make sure the weather is good. Although for us it was a little hot, the breeze outside felt great, and when it got too hot we came inside and the AC felt great. The outside area though was a bit crowded. Such a great time overall! 8 out of 10 for sure.",
   "Fabulous time on the riverboat cruise.  Our boat was great with a covered open upper deck.  Lower deck was enclosed and air conditioned.  Had a couple of tasty margaritas and a great history lesson narrated by Don Shelby.  Great time.",
   "Me & my family went on this boat on Aug. 6th. It was so nice  & relaxing. Learn great information.",
   "Loved the cruise today! It was perfect weather and a lot of fun. The narration is really interesting. Fun to learn about different sites in the Mississippi River. Great for any Minnesotan or traveler!",
   "Not sure why this came up under my husband's name?  I'm the one who bought season tickets and have gone on the boat many, many times.  Anyway, I LOVE IT!!  It's relaxing, the staff is awesome, and it's a great way to spend a few hours.  My friend bought season tickets for 2018 and we went several times...loving it....so myself and another friend bought season passes for this year, 2019.  The season pass includes 3 extra passes so we've been able to invite others along and we've had great fun!!  We've met a variety of interesting and nice people on the boat.  Along with your purchase of a season pass, you get two passes for one specialty cruise..such a great deal.!!!  I hope to do the season passes for 2020 as well..!!!  THANK YOU Padelford Riverboats!!  I am one happy customer!"
  ]
 },
 {
  "name": "Stone Arch Bridge",
  "address": "100 Portland Ave, Minneapolis, MN 55401, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/581d12cc-9334-11ea-be2d-14b31f159f22.png",
  "tags": [
   "walk",
   "pets",
   "walking",
   "eat",
   "walking",
   "historic",
   "history",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=16373684327107019915",
  "source": "GoogleMaps",
  "reviews": [
   "If there's one place in Minneapolis, I absolutely love it's the Stone Arch Bridge. Always a delight, always amazing. The views from here are marvelous and you will always find people, walking, running, with their pets, biking, skateboarding, roller skating etc. here. If you're having a bad day or month or year, just go and walk the Stone Arch bridge, let the winds and sounds of running water loft up your spirits and let you find joy and peace. Do visit here surely, if you're coming to Minneapolis, would be my 2 cents for life. Enjoy and post more pics. :)",
   "An iconic spot to visit that gives a nice view of downtown skyline, the mill ruins and the mighty Mississippi. The North side of the river has some great places to eat and a theater to catch a movie. Great place for an evening stroll.",
   "Love walking on the Stone Arch Bridge! Offers a panoramic view of St Anthony Falls. The bridge links to Father Hennepin Bluff Park and Mill Ruins Park. There is a center you are able to visit. The center is called the Upper St. Anthony Falls Lock & Dam Visitor Center. The center is located at the west end of the bridge. In the Fall there is a car show and craft show combined. Please go to their website. Many events happen during the Summer and Fall.",
   "Historic, historic, historic!  Take a lovely stroll along this gently curving wonder and feel the past come alive!  The mute beauty of this engineering marvel is as relevant today as it was when it was created!   This special area pulls together decades of Minneapolis history!",
   "One of best place in minneapolis. People come here for outing with famiy n friends, walking, jogging. It gives view of old buildings like Gold Medal Mill, Pillsbury mill, Mill museum and the buildings on modern era in downtown. Enjoyed the walk on Sat Feb 22, 2020 when it was a sunny day with temp 43*F"
  ]
 },
 {
  "name": "Thompson County Park",
  "address": "360 Butler Ave E, West St Paul, MN 55118, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5878eeb4-9334-11ea-ab87-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=10977983290093109837",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely trails in the winter. I can't wait to come back in summer!",
   "Wide forest paths. Rolling hills with lush grass. The visitors center is conveniently placed with many amenities. Tons of benches for resting and enjoying the lake view. Plenty of bathrooms and parking spots as well!",
   "I have hopes since the decision was made to clean out the lake. When I was a kid I'd go fishing here for fun. Then for a while all you could get was bullheads, and now it's not a good fishing spot at all, so all the dock is good for is sight seeing, maybe spotting a few ducks. Otherwise no. I'm hoping someone decides to help restore the ecosystem of the park",
   "Small but very cozy park. Great for relaxing walking,  and not relaxing running :). Often I see people fishing there. \nAlso you can rent building for wedding.",
   "Lovely trail around Thompson Lake with native trees and plants. Fall colors just starting. Nice meeting facility at Dakota Lodge. Construction closed off south end of lake, no signage. Crew said it was a restoration, but when we questioned the heavy equipment and tree removal,  worker said a sewer leak had caused contamination."
  ]
 },
 {
  "name": "Northwest Airlines History Center",
  "address": "Crowne Plaza Aire MSP Hotel, 3 Appletree Square, Bloomington, MN 55425, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/58d8759c-9334-11ea-880c-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "history"
  ],
  "link": "https://maps.google.com/?cid=334838075208862559",
  "source": "GoogleMaps",
  "reviews": [
   "I’ve been staying for 5 days at the Crown Plaza Suites MSP Airport and it was not until the last day that I came across the NW Airlines museum on the 3rd floor. What a great experience which I had more time! Wish the hotel lobby had more signage. Please visit the attendants are very pleasant and very knowledgeable.",
   "Must see for any former Northwest employees, their families, or those who are interested in aviation and/or Northwest Airlines.  A modest collection but extremely interesting. Smaller children would likely not find anything interesting. Plan on spending up to one hour looking at the various collections.",
   "What a fantastic collection of artifacts from NWA.   Most of them items that would have otherwise been trashed or forgotten about.   The volunteers the day I went were former employees and recounted many stories.  I could have stayed another hour talking to them.  Definitely recommend a visit if you're looking to kill some time before a flight.    Just note the signage isn't that good for finding it.   Best way in is to park in the hotel parking lot top level then enter through the glass doors then up the stairs one level which can be found beyond the pool",
   "This place is a bit hidden but is a neat visit.  Exhibits on the history of Northwest and the airlines that merged into it.  Staffed by retired NWA employees.  The collection is impressive, much of it donated by the airline itself or by Delta when they bought it.  Some exhibits rotate periodically. Was very impressed.  Very close to MSP so doable during a long layover as well.",
   "Very informative and fun .Hotel needs to increase awarness of location of the museum."
  ]
 },
 {
  "name": "F. Scott Fitzgerald Birthplace",
  "address": "481 Laurel Ave, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5944f322-9334-11ea-a895-14b31f159f22.png",
  "tags": [
   "eat"
  ],
  "link": "https://maps.google.com/?cid=4520287994966033132",
  "source": "GoogleMaps",
  "reviews": [
   "Came after hearing about the \"poultrygeist\" chicken.  Sauce did not mess around but neither did my girlfriend and I, we tag teamed the sandwich and it was amazing.  Great flavor and not too hot while you eat but be sure to have some beer or dessert at your table because it will burn for a while (and the next day no doubt). Will definitely be back.",
   "Little historical stop.",
   "Enjoy historical sites.",
   "Great pilgrimage for an F. Scott fan!",
   "Where it all began.... Right in a city block."
  ]
 },
 {
  "name": "Gibbs Farm",
  "address": "2097 Larpenteur Ave W, St Paul, MN 55113, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/59ae169e-9334-11ea-b973-14b31f159f22.png",
  "tags": [
   "history",
   "historic",
   "knowledgeable",
   "family",
   "tour",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8741666720386548191",
  "source": "GoogleMaps",
  "reviews": [
   "We enjoy this place very much. It is a good place to spend a couple hours learning a bit about the history of native people and pioneers in this area. We also enjoy the summer day-camps here.",
   "An interesting historic oasis in the middle of the city. This 1850s farmstead is well- preserved, and tells the story of early settlers of this area, as well as their native American neighbors. Absolutely worth the visit.",
   "To tour guides are fantastic and very knowledgeable in the history of the farm and family that lived there. A lot of different things going on, such as metal foraging, ice cream social and a couple different tours. Really enjoyed our morning and learned a lot as well.",
   "Love the story of it history and  ice cream to",
   "I would give this place 0 stars if it let me.I found a post saying that they had a holloween party on the 29th from 10 to 4. I showed up with my two toddlers and was told that I was mistaken. After I showed the woman the post she said, very rudely, I had to leave. I wouldn't have rated this place if I was shown a little respect and they took a little responsibility and apologized for there mistake. I will never recomend or go there again. Staff was rude."
  ]
 },
 {
  "name": "Mill City Museum",
  "address": "704 S 2nd St, Minneapolis, MN 55401, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5a00a3d2-9334-11ea-ae97-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "history",
   "history",
   "walking",
   "field",
   "knowledgeable",
   "field"
  ],
  "link": "https://maps.google.com/?cid=11052270807054118706",
  "source": "GoogleMaps",
  "reviews": [
   "Visited with wife and 17 yr old daughter. We all thought it was great. It was STEM day so perhaps there was a bit more going on than normal, but for $30 total, it was well worth the 2.5 hours. Minneapolis movie is well done. Flour tower is extremely well done and observation deck is great (exterior closed in winter). We all felt it was well worth our time. Highly recommended.",
   "A great historical and interactive museum for all ages. My 5 and 3 year old love going. The elevator tour is really cool. And the view from the top is great. Good for short visits 1 1/2 hours - to longer 3 - 4 hour visits. Free entry with history museum membership.",
   "Really cool museum! The views are crazy cool from the observation deck and there is some great history about the cities and how things came to be! If you like museums and have a spare hour I recommend checking it out, and then walking next door to the Guthrie for a fantastic show.",
   "I was very pleasantly surprised by this place! I had heard good things from my daughter who attended a field trip here, but found it to be even more interesting than she described it. The staff were all very knowledgeable and engaging. I would definitely recommend it to anyone who hasn't been.",
   "This place is so cool, I used to come here as a kid all the time for school field trips. I’ve since come here in recent years and it’s all still so fascinating to see how a different era of Minneapolis worked. To see a what this thriving industry was once like. If you’re looking for a cool day trip, this is worth it."
  ]
 },
 {
  "name": "Mill Ruins Park",
  "address": "102 Portland Ave S, Minneapolis, MN 55401, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5a5ecae2-9334-11ea-bfb6-14b31f159f22.png",
  "tags": [
   "unique",
   "parks",
   "history",
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=3203557236263153407",
  "source": "GoogleMaps",
  "reviews": [
   "Interesting and unique. It's not large at all (very much a small downtown park.) Basically, it is much like the other riverside parks along the pedestrian trail that follows the river, except for the mill. Still, because of the mill, it's very scenic - a neat spot to stop by if you're in the area.",
   "A nice place along the river banks. Many things to do in the area and bridge crossings to connect you to the north side of the river for even more options of activities and dining. Plus some great views of the city and the old ruins that make a large part of the cities history.",
   "Love Mill Ruins Park! Combines the history of Minneapolis with present day. Mill Ruins Park is part of the Central Mississippi Riverfront Regional Park. Living in Minneapolis is the best. So much to see and do.",
   "History is great, but the train and tracks inside the building are cool. Has a nice cafe that's kind of hidden, and nice little gift shop with Minnesota/Minneapolis local types of interesting finds. Also near the farmers market!",
   "There is a protected bike lane covering the entire loop. Seeing the history of the flour milling industry and how it shaped the city of Minneapolis and the Mississippi River is pretty cool. The signage for pillsbury and gold medal flour is maintained and lights up at night. If this is your first trip to the twin cities I'd recommend the loop in warmer weather or bundle up. The paths are well maintained and there are informational plaques the entire way."
  ]
 },
 {
  "name": "Mattocks Park",
  "address": "441 S Macalester St, St Paul, MN 55105, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5ad6ba62-9334-11ea-a07f-14b31f159f22.png",
  "tags": [
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5322588199029351705",
  "source": "GoogleMaps",
  "reviews": [
   "Seems busy today but a local guy  said it was quiet, guess this is a very popular park",
   "This neighborhood park is a lot of fun. The equipment isn't anything special, but has the basics to help kids busy. I do wish there was a restroom. (During tennis season, there is a port-a-potty available. ) There are communal play toys available, such as sand toys and push toys.",
   "Cute park that is great for smaller toddlers. Lots of small children for my son to play with. In a good area with lots of toy trucks in the sand pit. Only thing I didn't like were people allowing their dogs to be off leashes but they didn't bother us.",
   "I love this park, it’s nice and protected from the sun and there’s a bunch of sand toys there for communal use. Huge thank you to whoever contributed them!!",
   "This park has it all, several grilling areas and picnic spots for families. Also plenty of open grass, so bring a blanket or two to sit down on.  There's also a rather large kid friendly park with the rubber floor so falls don't hurt, plenty of good activities for kids on the park and lots of seating spots to supervise at. Theres also a 3ft wading pool, beware that there is no life guard on duty, but this is a great place to bring the little ones on a hot summer day. There are also fields and courts for sports here. Anything you could want at a park can be found here"
  ]
 },
 {
  "name": "U.S. Bank Stadium",
  "address": "401 Chicago Ave, Minneapolis, MN 55415, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5b7c49c6-9334-11ea-9281-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "food",
   "food",
   "family",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16516279991924342739",
  "source": "GoogleMaps",
  "reviews": [
   "The family went to Monster Jam and watched monster trucks tear up the stadium and entertain the audience with their trick driving.  It was very fun for the whole family.  The facilities such as food services, alcohol, refreshments, and restrooms were clean and refreshing.  The lines were long and I opted out of some services over others, but that comes with the crowds.  The stadium offered sound dampening apparel, which I found very important for the experience.  The security check to enter the facility was quick and stress free.  I felt very safe during my experience.",
   "Took my 2 yr old son here for the packers game on Dec 23rd. It was awesome and he only lasted til halftime which was fine. The private suites we were up in seemed to start off with a bang on the food layout then gradually got worse through the rest of the game. Not everyone is drinking and cant taste good food. I expect better if Im paying for prime tickets, not something I would get if I walked to a food stand out of reg seats.",
   "My first time to U.S. Bank Stadium was for Monster Jam. We were 2 rows from the ceiling! The sound was good, the view was good even though it was far away. The facilities are very clean. Getting around was easy. Even though we were at the top, there were escalators to help make the trip bearable. There were plenty of vendors there, but even more that weren't open. I imagine they're for sporting events. The size of this place is amazing!",
   "Super noisy. Can't expect anything other than noise. But the Twins have a great open air stadium. Very family oriented, in my opinion. Easily accessible by Metro Transit.",
   "Amazing stadium and if you’re lucky enough to get a suite the offering of food and drink is great. The concourses are wide and there is t a bad view In the house. Plenty of bathrooms. Only thing that could be better would be more parking options nearer to the stadium."
  ]
 },
 {
  "name": "SEA LIFE Centre Minnesota",
  "address": "Mall of America, 120 East Broadway East Side, Level, One, Bloomington, MN 55425, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5bcc46f6-9334-11ea-99e9-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "kids",
   "family",
   "walk",
   "tour",
   "walk",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=10490541390020148913",
  "source": "GoogleMaps",
  "reviews": [
   "This is an enjoyable experience with a good variety of species to see. The underwater tunnel is a great walk through and you could spend a lot of time there. I'd suggest finding out when they're least likely to be busy, as it's better with uncrowded walkways and without a lot of kids making noise. Would be nice to have a full touch tank experience with some fish or rays and adding an octopus exhibit would be an improvement.",
   "A decent Aquarium, I have enjoyed the place. There are many different varieties of fish and other sea species considering the size of the place you will find a wide range of sea life.If you compare it to Shedd or GA aquarium it sure seems pretty small but considering the space its in I thought it was good. We spent around 3hrs and it was fun. On a winter day this would be a perfect spot to spend a few hours with family. Kids will sure enjoy the place. There are a couple of spots where you can touch the fish which is cool and kids would enjoy it. The price isn't that bad either.",
   "I'm just here in Minneapolis for work and I went to the Mall of America out of curiosity. It's a really well done aquarium. You walk down a hallway with amphibians and reptiles with scheduled guides. This leads to a 300 ft long tunnel with surgeons, shark, guitar sawtooth rays. This is the highlight although the jellyfish exhibit is a close second. The end has the shallow pools with sting rays and crustaceans you can feed. Definitely worth it for the tunnel",
   "Interesting place, especially if you add the behind the scenes tour.  Though it's a small aquarium,  they do a great job of maximizing the various environments. In addition to the aquarium,  there are rain forest, jellyfish, coral, and stingray exhibits. \n\nThe best deal is a membership if you're local and plan to go more than once a year. I was visiting from out of town and decided to go just to for  something different to do.",
   "This place needs more organized lines and/or better trained staff. We purchased the wristband package with Sea Life included. When we went down to the sea life level, there was a long line to buy tickets and another line to get in. A woman was directing everyone to the ticket line.\n\nWe informed her that we already had the wristband package and she said we still had to wait in the first line. Fast forward 30-45 min later and an employee told people ahead of us that if they already had tickets they can proceed to the other long line to get in. I double checked with her about our wristbands and she said we also could have skipped this first line. If I hadn't checked with her it could have easily been another 30 minutes. The staff is friendly, and I understand this is a busy place, but it was a frustrating experience.\n\nAs for the experience itself, it also seems like one big line. You walk single file through most of the exhibit which is lack luster for the most part. The aquarium tunnels toward the end are pretty cool, but that's about it. This place kills a pretty good portion of your day, so unless you really enjoy fish, I would say skip it."
  ]
 },
 {
  "name": "Swede Hollow Park",
  "address": "665 Greenbrier St, St Paul, MN 55106, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5c233e92-9334-11ea-a9fe-14b31f159f22.png",
  "tags": [
   "nature",
   "history",
   "brewery",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=3901503305833548878",
  "source": "GoogleMaps",
  "reviews": [
   "A ton of stairs of you enter from the parking lot with picnic tables. Walking/biking paths. Woodsy paths too. More suitable for adults. There are bike paths that lead all over St Paul. Nifty thoroughfare in that regard.  Not busy.",
   "Other than there no police presence here,EVER..And,terrible lighting on paths..which attract homeless & drugs..I LOVE this bit of nature right in the middle of the city!! And the \" Friends of Swede Hollow Park \" community group does all it can to keep it clean..and safer..(photo is of monument marker stolen, just weeks after it was privately replaced..police do nothing to stop these things😭)",
   "I love the path, the swedehenge, the history. I love the stairs for a little workout. I love it through spring, summer and fall. I love the little path where the mansion was long ago. I also love the old brewery and what Flat Earth has done with their section of it. I love it all over. The homeless people that live there seem nice, too... I just wish they would be smarter with their fires so the fire dept doesn't have to waste time and money putting out trees.",
   "Fun place to explore. Especially to ride scooters at. Long trails black top n dirt trails",
   "Went for a walk during a warm winter day, the park is nice for a quick walk. I did see that there was broken glass everywhere and trash riddled the park, but I'm hopeful some of it is picked up by the city."
  ]
 },
 {
  "name": "Guthrie Theater",
  "address": "818 S 2nd St, Minneapolis, MN 55415, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5c7fdbdc-9334-11ea-b1f8-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=14415037625030132595",
  "source": "GoogleMaps",
  "reviews": [
   "Went here to see William Shakespeare's play. The staff there was so kind and was very helpful. The play overall, was very entertaining even for my nieces, which known nothing about the details of the play. They loved it. The view from the theater to St. Anthony bridge was lovely. It was a very beautiful place. Definitely going here again.",
   "So lucky to have a theater of this caliber in town. Never been disappointed. Beautiful venue and not a bad seat in the house for the Wurtele stage. Young people, check out the 30 below program- going to be sad to turn 30 this year!!",
   "Have attended multiple shows here, it’s different than rest of the downtown theaters for sure. Nice arrangement, every seat has a good view and good sound. The selected plays are always worth a watch. Easy parking in front of building and special pricing for rush club members.\n\nThey also have a awesome lookout balcony which has almost 360• view of stone arch area. A must watch during summer and fall.",
   "We went and saw A Christmas Story last night. It was so amazing. The theater was beautiful. Not a bad seat in the house. We also ate and got drinks before in their cafe. Great food and service. I would highly recommend!",
   "The Guthrie is a first class act! It's a whole lot of excellence throughout, from the amazing show to beautiful facility. I especially appreciate that the venue keeps their endless bridge and top floor lookout room open to the public. It's a great part of the neighborhood!"
  ]
 },
 {
  "name": "Minneapolis Institute of Art",
  "address": "2400 3rd Ave S, Minneapolis, MN 55404, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5ccb6464-9334-11ea-a4a1-14b31f159f22.png",
  "tags": [
   "walk",
   "art",
   "walking",
   "family",
   "field",
   "free",
   "organized",
   "art",
   "food",
   "theatre",
   "kids",
   "family",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=14207980514366553254",
  "source": "GoogleMaps",
  "reviews": [
   "Upon walking into the sleek, modern museum you can see a beautiful little garden through the glass. The building is expansive and very well designed. Every exhibit is placed specifically and maps are given when you walk in. With both coat check, maps, and helpful workers you can find any exhibit you want. You can also just browse and spend hours experiencing world class art. My favorite floor is the top one, where a painting hangs that is absolutely massive. It is modern and features two young men. Not sure if it is still there, as the museum keeps exhibits fresh and exciting. Spend some time at the cafe and sip on some coffee. There are more activities and rooms than just the museum itself. It is a wonderful way to spend the morning, afternoon, or evening.",
   "This place deserves some hype. I've been there countless times on school field trips, or weekend outings with friends and family. I love the atmosphere as it doesn't feel stuffy or plain. It is full of life and really immerses you in different cultures. There are some exhibits I remember seeing over and over again, but each time I return I encounter something new. It is always clean and well organized, and I've never seen it be uncomfortably busy, even on the weekends. The rotating exclusive exhibits are always beautiful and informative, but even if you stick to just the free areas there is plenty to see. Free admission is truly a blessing, so donate if you can! This is a fantastic art museum.",
   "We attended a dinner here on a Saturday night. It was a really fun atmosphere. Food was good. We did a scavenger hunt in the galleries looking for close up sections found in different pictures or exhibits. It was a good mixer and helped us look at the artwork again in new ways. Some things could only be seen up close while it took a far away perspective in order to \"see\" others.",
   "It's an amazing Museum! I love that they display contemporary and historical art. They also have a Family Day once a month that provides a lot of great activities for kids! And, you can never go wrong seeing a show there at the Children's Theatre Company!",
   "This is one of those cultural gems of Minneapolis you may not have heard of, but that you MUST go experience. I can’t believe this place does not charge admission! The art is world-class (I saw Picasso’s and Monet’s!) and there will always be something intriguing for you to see. The space is gorgeous and the docents are incredibly helpful. Go check this place out now!"
  ]
 },
 {
  "name": "American Swedish Institute",
  "address": "2600 Park Ave, Minneapolis, MN 55407, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5d17dc1a-9334-11ea-95cd-14b31f159f22.png",
  "tags": [
   "art",
   "walk",
   "history",
   "unique",
   "food",
   "tour",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5335361704089780480",
  "source": "GoogleMaps",
  "reviews": [
   "As a fine art photographer - the Swedish House Institute is an absolute favorite venue for me to shoot weddings at!  It is truly a space where I know I will be able to create jaw dropping photos....intricate details, a plethora of natural light, gardens that are just stunning, and a diversity of locations throughout the property make it perfect for weddings! On top of the beauty of the venue itself...the team at the Swedish House is also absolutely delightful to work with!",
   "Had a great time here! The mansion is beautiful and was worth the visit alone. Lots of areas to walk - went on Sunday at 4pm, pretty much had the place to ourselves to roam around. Friendly staff, especially the nice man who showed us around and told us a bit about the history of the place. Had a great time!",
   "This was a fantastic experience that I recommend for all! The craftsmanship of this home is breathtaking and it was a fantastic experience all around. I also recommend going around lunch and getting their meatballs (they were amazing). Its a good 2-3 hour endeavor so make sure to space a little time.",
   "I have loved this place for so many years. The house is beautiful especially at Christmas. The food is incredible. You can find really unique gifts at the gift store. And they also do a really good job with weddings. Recently attended a friends wedding here and the venue was beyond beautiful and staff were super friendly and helpful.",
   "This place is always  a fun visit. It's an indoor tour of a magnificent  home. The architecture  is old world hand carved work. They offer food, exhibits, and a gift shop. Be sure to check the website to see what events they have coming up!"
  ]
 },
 {
  "name": "Minneapolis Sculpture Garden",
  "address": "725 Vineland Pl, Minneapolis, MN 55403, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5d7dc7c2-9334-11ea-a65d-14b31f159f22.png",
  "tags": [
   "walk",
   "historic",
   "free",
   "walk",
   "art",
   "art",
   "walk",
   "free",
   "art"
  ],
  "link": "https://maps.google.com/?cid=6037934690900938095",
  "source": "GoogleMaps",
  "reviews": [
   "I've been living in Uptown for most of my life and can't tell you how many times I've visited this place. I absolutely love it. They have a wonderful mix of the old, historic sculpture alongside new installations. The gardens are nice to walk in. It's a great quiet place to read, study, or just go for a walk. The events they hold are fun and usually free. The greenhouse conservatory is nice too and I never got sick of that giant fish statue at the end ;)",
   "Really interesting sculptures and a great place to take pictures. Some of the sculptures had information, but not all of them. This park could be improved with some additional lighting once the sun goes down. Still a fun visit!",
   "This is the first time I've been to the sculpture garden and I have to say it's a beautiful place to go for a walk and enjoy local art. There are many pieces to see and interpret for yourself. Great place to walk your dog or just spend a lesiurely afternoon!",
   "Incredible display of art and architecture. Not only does it have large iconic installations but also smaller ones that are beautiful. Great in summer or winter, as you can pop into three sisters to warm up if you need to.",
   "Very nice and free sculpture garden in the midst of the city. \n\nA relaxing and fun area to escape the hussle and bustle around you, smack dab in the downtown area, but turns quickly into a nice escape from the \"city life\", where one can enjoy peace and tranquility. \n\nLots of nice art pieces to see, and full of friendly tourist and locals. \n\nI walked clear across the city to visit and was well worth the walk, specifically the crown jewel, the famous Cherry on a Spoon. \n\nMust stop if visiting Minneapolis."
  ]
 },
 {
  "name": "Walker Art Center",
  "address": "725 Vineland Pl, Minneapolis, MN 55403, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5dd05654-9334-11ea-8861-14b31f159f22.png",
  "tags": [
   "active",
   "unique",
   "family",
   "art",
   "walk",
   "art",
   "art",
   "historic",
   "art"
  ],
  "link": "https://maps.google.com/?cid=13983112962245836178",
  "source": "GoogleMaps",
  "reviews": [
   "The Walker always has great exhibits and shows. The outdoor sculpture garden is great for bringing visitors to, or even active children who want to run around outside. Recently saw a great foreign film in their theater that was amazing! (Parasite)",
   "My family and I have loved coming here. The exhibits are always interesting and the rotation of installments on the top floor have been intriguing and unique. The mini golf course is worth a play, but it is insanely challenging at times because it is more art than golf. The sculpture garden is a great oasis in the center of the city.",
   "Great place. Fun to walk around. NUMBER ONE recommendation for newcomers is to KEEP AN OPEN MIND - Read the descriptions and try to think from the artist's perspective. Don't treat art at face value!\n\nGift shop is pricey but you can get some cool ideas there for art enthusiasts.",
   "I love art, particularly paintings and photography. The Walker Art Center isn't my favorite type of art, being contemporary, but if that's what you like this is a fantastic place. The sculpture garden is quite nice, too.",
   "My most permitted title for this place is \"The Deviant Art Interpretive Center\".\n\nAlthough they do have some Real art and historic items of a value that are worth consideration and taking the time to study, this place has taken the most unfortunate turn toward making socio-political statements about where urban postmodernism has gone.\n\nWhen given the chance, I prefer to sit in the car and read a good book or simply take a nap."
  ]
 },
 {
  "name": "Kellogg Mall Park",
  "address": "62 W Kellogg Blvd, St Paul, MN 55101, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5e1bb81c-9334-11ea-85d8-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=6229143733007632450",
  "source": "GoogleMaps",
  "reviews": [
   "I was there for the Saint Paul Winter Carnival to view the ice sculptures. It was a wonderful place to be frozen. The sculptures were beautiful. The view from the park was nice. The stage hosted good musicians. The concessions were yummy and warm",
   "We came for the ice sculptures and festivities as part of the Winter Carnival. I understand it is usually at Rice Park, but due to construction,  it was here this year.  Nice view of the river and plenty of parking nearby.",
   "Comfortable place you can sit to enjoy views and Mississippi River.",
   "It was late when I got here after the MN Wild game, but I felt safe. There were 2 officers chatting in the park.  We came to see the ice sculptures.",
   "It was beautiful foggy afternoon. Very nice few of St. Paul downtown."
  ]
 },
 {
  "name": "Lake Nokomis Park",
  "address": "4955 W Lake Nokomis Pkwy, Minneapolis, MN 55417, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5e82b786-9334-11ea-b3bc-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12022484068953877940",
  "source": "GoogleMaps",
  "reviews": [
   "This gem would be even better if climate change doesn't make the water sick. Stop putting chemicals on your lawns! Be responsible.",
   "It's usually flooded but it doesn't stop me from running around it. I guess what most people like about it, is that it gives off a sense of serenity and tranquility. I like the willow trees that surround it. Occasionally the serenity and peace is ruined by the sound of large airplanes going overhead back to the airport. When it's not flooded, it's much easier to navigate.",
   "nicely laid out, lots of parking and clearly marked signage everywhere. There's a separate bike path than foot path, and lots of recreational activities including biking and kayaking, with both available for rental. lots of families everywhere, people were putting up hammocks between the many trees and falling asleep in them. There is food available to purchase, big place to sit and eat and enjoy the view of the lake.",
   "Nice dog walking around lake, best during wekday less cycles on another pathway",
   "We love to walk around it or bike around it. Besutiful all year round. Great to see sunsets over the water, or people watch."
  ]
 },
 {
  "name": "The Escape Game Minneapolis",
  "address": "300 E Broadway, Bloomington, MN 55425, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5eebf466-9334-11ea-9c73-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=4817685680827279821",
  "source": "GoogleMaps",
  "reviews": [
   "We were visiting the mall of America and decided to try this attraction and we had an incredible experience! I took my 8 and 10 year old boys and they had a blast. The skill level was fun and interesting for all of us and I was impressed by how innovative the room was. It wasn’t easy but it wasn’t too hard to make it frustrating or difficult! They helped us out with clues when we needed it and even let us stay for a little extra time to finish “escape” the room since we couldn’t do it in the hour time frame. I really appreciated the friendliness of the staff and their ability to give us a great experience!",
   "Nice Escape Room experience located in the Mall of America.\nThe prices here are more expensive than some other operators in the area, but I suppose that's to be expected in the MOA.\nThe staff were all friendly and helpful before, during, and after our mission.\nWe went through their Prison Escape mission and got out with over 2 minutes remaining!\nDefinitely a fun way to spend an hour for an experience you'll be talking about long after!",
   "Would defiantly recommend The Escape Game for a fun thing to do with your family or friends. I had a lot of fun solving \"The Heist\" game. I love a good challenge and this room provided exactly that . Our game guide was Sarah and she did an amazing job. She was very knowledgeable and was able to answer all of my questions.  If you're looking for something fun to do in the Mall of America, be sure to check this place out.",
   "We have enjoyed each game played here. The staff members are awesome and supportive. We have played 4 games with just two of us and escaped from 3. I highly recommend Gold Rush if it's your first game ever as it was for us. Definitely make sure you take advantage of their discounts at the end because you will want to come back! I can't wait to try the one we didn't escape from (The Heist) again and make an attempt at Prison Break!",
   "So much fun. The staff is very helpful, and it's quite necessary that they are. It's a busy sign in area prime time on the weekend. \nWe had a group of 8 and we did the heist room. It was very well thought out and so much fun to navigate together. We escaped with 7 minutes left and used about 4 clues. \nWould recommend doing with friends and family for any occasion. Check for Groupons."
  ]
 },
 {
  "name": "Basilica of Saint Mary",
  "address": "88 17th St N, Minneapolis, MN 55403, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5f47d01c-9334-11ea-9442-14b31f159f22.png",
  "tags": [
   "active",
   "walk",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13851519805452360576",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful Basilica.  Would recommend getting a guide which can be picked up at the front of the Church for a 2 dollar donation.  Highlights for me were the stained glass, the organ, and the altar area.  Also, there are different types of nativity scenes set up throughout the Church.   There is parking in the back, and plan to spend 30 minutes to see everything.",
   "They are so friendly and generous with how they provide support for low income and homeless individuals. It was great to see the empathy they exhibited towards the guests in need while at the Shoe Ministry. This was a great day for the people I brought to get shoe vouchers, they walked out of there with much more than they could've imagined.",
   "The Basilica of Saint Mary is a beautiful old church. It is well maintained a still an active site of worship. The church has an ornate ceiling and amazing stained glass windows. It is quiet and peaceful upon entering.  If you walk all the way to the back of the Church, you can see the large pipe organ, which extends most of the height of the wall with angel statues around it. It is well worth seeing. The amount of care and detail in everything is wonderful to see.",
   "The home of a vibrant congregation, with a mission of outreach to the community, the Basilica of St. Mary is a place to visit, if not arrange a docent-led tour. With an important history locally and nationally, the church building tells its witness to Mary in its gorgeous stained-glass windows in the two-story nave. The church is filled with iconography on every door panel and wall niche. Furthermore, the church has international worship manifestations, from Our Lady of Guadalupe to a Madonna and Child from Vietnam. This is a church you will want to visit more than once.",
   "There is a lot of beauty inside this place. It draws a big crowd,so maybe we shouldn't have been so surprised to see a number of police securing the entrances. Good close parking across from it."
  ]
 },
 {
  "name": "FlyOver America",
  "address": "Mall of America, 5120 Center Ct, Bloomington, MN 55425, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/5f9e2de2-9334-11ea-adc6-14b31f159f22.png",
  "tags": [
   "music",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1235431981467247060",
  "source": "GoogleMaps",
  "reviews": [
   "So fun! Very similar to the Soarin' ride at Disney World, but no 'scents' in the air. We had a fun time here with our son. I think it was about 10 minutes (give or take) long and the line was short to get in. It's a separate thing from the Nickelodeon Universe, but right next to it. \n\nTip: Sign up for their e-newsletter for occasional deals!",
   "Buy ticket stand in a line.  Move to another room and stand in a different line. They lead you into another room and you stand in a line.  Then someone brings you up a level and you sit down and strap into your seat.  It goes dark and you can tell the seat is moving.  Lights come on and your seat is over the walkway that you walked towards your seat.  Flying across America with wind and mist in your face.  It was awesome!  I glanced over and watched the other spectators seats swaying back and forth.  Well worth the 3 different lines I stood in.  AWESOME.  \n\nOh, no pics are allowed inside as I bet you would lose your camera.  lol",
   "If you are in Minneapolis and visiting the Mall of America, you got to be at this place! We have been here twice and this place will never cease to amaze us even if we are going to visit this 10 more times.\n\nThe check in process is quite simple at the front desk and make sure to look for online discount coupons. The staff direct people well inside the premises and are very helpful.\n\nComing to the experience, it is SURREAL! Nothing like I have ever experienced before. It’s a fairly 10 minute simulated flying experience over some of the famous landmarks and landscapes of the USA and ends at outside of the earth. The fantastic background music just ups the entire feel of the whole experience!\n\nThe best part is the mist u feel on your face as you fly over water bodies and the sweet fragrance as you fly over some prairies. The fighter jets that fly in tandem provide an unbelievable view.",
   "Was a cool experience. Only giving it 4 stars as the attraction itself is very short. I recommend getting both the Fly Over Hawaii and America package, as they were both interesting. The attraction itself is very interactive with wind, movement, mist, and smells.",
   "I've taken the kids to Disney world and Disneyland several times, and this rates right up there with my all time favorite attractions! My 21 year old daughter, and my 4 & 7 year old grandchildren absolutely loved it as well - so much that they chose this over the theme park on our second day visit to Mall of America. If you haven't had the opportunity to go on this attraction yet, I hope you'll plan a visit - it was fantastic!"
  ]
 },
 {
  "name": "Western Sculpture Park",
  "address": "387 Marion St, St Paul, MN 55103, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6035b32c-9334-11ea-b4e1-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=10298421925985981925",
  "source": "GoogleMaps",
  "reviews": [
   "Enjoyed the different pieces, although I would have liked to know more about each piece and their artist",
   "It was cool...but seemed to be a uncomfortable amount of sculptures.",
   "I live coming here...a little Haven in the city.  For all you Pokemon hunters this is a great stop.",
   "Lovely sculptures but needed to be cleaned up a bit. I was comfortable but other visitors stated not to go too far into the park due to a fight in the yard.",
   "There aren't a lot of sculptures. Plus, the a sculptures are not all that. Also, it takes like 2 hours to get there by bus. It's not worth it considering that there are about 5 or 6 sculptures. I actually think I can see all the sculptures in the photo. I'll take a pic next time I'm in that area."
  ]
 },
 {
  "name": "The Museum of Russian Art",
  "address": "5500 Stevens Ave, Minneapolis, MN 55419, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/60bd0c06-9334-11ea-a6ad-14b31f159f22.png",
  "tags": [
   "free",
   "library",
   "art",
   "historic",
   "art"
  ],
  "link": "https://maps.google.com/?cid=11664536413037275390",
  "source": "GoogleMaps",
  "reviews": [
   "Loved it! I really wanted to see the Holiday display but I couldn't make it work. The Chernobyl photos are intense. The Soviet posters are amazing. It was fun to use Google Translate and the camera to translate the Russian. A smaller place with 3 floors right off 35 and Diamond Lake road. Staff was friendly. Free on-street parking. I'd definitely go back!",
   "We have visited here several times and enjoyed every visit. This time we participated in a docent led visit. It was excellent. We particularly enjoyed the exhibits of the Russian Posters, the Chernobyl nuclear disaster photos, and the art on loan from the Hill Monastic Library at St. john's University.",
   "This place is a hidden gem of a museum. I've driven past it hundreds of times and never thought about it until one evening when I thought of dropping by.\n\nThe propaganda posters are amazing. You can easily see the mindset of Russia sitting the Cold War era.\nDown stairs is the old Russia of the tzar's. They have some amazing pieces that were presents to them, or from them. Wonderful craftsmanship. \n\nI was told that the displays change several times a year, which will bring me back in a few months to see what's there.\nGo check it out and support your local museums!",
   "Fantastic place for those with ties to, or interested in, Russian culture. Art galleries are always well curated, displaying both historic and modern Russian art pieces. Additionally the museum often hosts speakers, cultural events, performances, and celebrations. Well worth a visit, or several.",
   "One of my favorite museums ever. They have a constantly changing set of exhibits so there's always something new to see. It's big enough to make it worth your time but not so big you have to plan an entire day around visiting."
  ]
 },
 {
  "name": "The St. Paul Grill",
  "address": "350 N Market St, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/614ec518-9334-11ea-891d-14b31f159f22.png",
  "tags": [
   "drink",
   "history",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=14430034510534604604",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely the best place we ate in in the twin cities! Iconic and steeped in history! Classy with liveried waiters- old school- awesome! Fit for a special occasion! Really superb! Charles was our waiter and he was as lovely as the restaurant! Definitely one to go back to again! You get a choice of regular table and booths! Pricey but worth it!! 50-60 bucks per person with a drink, main and a side!",
   "Wow! What a great place for a drink. I didn't get the two bartenders names last night. But they were both phenomenal. We'll be back for dinner and more drinks.",
   "We came here on our mini moon when we stayed at the St paul hotel. This is well worth coming here for dinner. They have the best french onion soup I've found to date. They have a vast selection of wine and spirits to choose from. Steak reigns supreme here and you can get it with so many toppings and made just to your liking. They also have a lot of other great cuts of meats to choose from. It does get busy so make sure to get your reservation in and in advanced just to be safe.",
   "The St Paul Grill is a good place, but not the best, and it really should be. We have eaten here on several occasions as we stayed at the St Paul Hotel. They do have a great variety of dishes, the wild rice soup is always a good choice. Honestly I have just never been overly impressed with any steaks I have had, I am however very picky and even more so when paying top dollar. Worth a try but not sure it’s worth the prices.",
   "We went for brunch and it was so so good. Not your average breakfast. The caramel pecan roll was amazing. And so we're the creamy hashbrowns. We were a little nervous about bringing my 18 month old to such a fancy restaurant with but she was welcomed and staff were patient with her. We will be back for brunch again!"
  ]
 },
 {
  "name": "Red Cow",
  "address": "393 Selby Ave, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/61bc7b46-9334-11ea-b023-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18177481241709735475",
  "source": "GoogleMaps",
  "reviews": [
   "What a lovely place.  Very busy and parking is a real mess. However, it is really worth it.  The food was amazing. Bison burger with figs and fresh tomato soup. Drinks were perfectly made as requested. The staff are very friendly.  Be prepared to wait for seating, even at the bar.",
   "The food was excellent. I had the root beer pulled pork, which was excellent. Others in my group ordered the 60/40 burger and the Manhattan burger, and we're also very pleased. Many of the burgers came on pretzel buns, which were not as dense/heavy as some pretzel buns. Service was quick and excellent, would highly recommend. Also, the chips and french onion dip (a Food Network Top 50 Dip) was incredible! Definitely try it!",
   "We were here for a happy hour/dinner with office friends. Being a vegetarian I took veg burger and sweet potato fries. Friends also tried different burgers and we all had good time here.",
   "Excellent food, friendly and attentive staff.\nThey have some of the best burgers in the cities, bit this last time I went I had the Reuben. \n\nTheir Reuben was pure heaven. Perfectly portioned. They corned beef was incredible and the sauerkraut was fresh and full of flavor. \n\nI will continue to patron this establishment for as long as they keep up the quality.",
   "This was the best brunch I’ve possibly ever had. Bloody Mary with the perfect kick to it and homemade pickles on top. Salmon Benedict with a dill hollandaise and perfectly oozing eggs was to die for. Beautiful scenery from out table outside and fast service."
  ]
 },
 {
  "name": "Tongue in Cheek",
  "address": "989 Payne Ave, St Paul, MN 55130, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6218f352-9334-11ea-bddb-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "delicious",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3160933423180178169",
  "source": "GoogleMaps",
  "reviews": [
   "Stop by this establishment for the first time on February 16, 2020 was one of the best breakfast I’ve ever had. The staff was extremely friendly. The breakfast food was amazing. It did take a while for the food to come out but it was well worth the wait. If you get a chance please stop by.",
   "It's been awhile since we've been back and we're really glad we gave it another chance. Food options, food prep, drinks and service have always been great but the last time we visited the place was CRAZY loud. My wife has wanted to go back a number of times but I've always been apprehensive due to our last experience (mind you it's now been years at this point since our last visit). This time it was much quieter. Not sure if it's that it was a Sunday evening and not super busy or they've got sound absorbing panels now or what but we really enjoyed ourselves and we able to carry a conversation without feeling like we were yelling at one another. We'll definitely be back sooner based on this experience.",
   "I love Tongue in Cheek and I thoroughly enjoy coming here for brunch here on Sundays. Their menu is eclectic and unusual which is exactly what I strive for in anything I go out to eat. I usually order the pork belly ramen or variations of eggs Benedict which never disappoint. My boyfriend is obsessed with the chicken and waffles and craves them constantly. You can get coffee, a cocktail, a couple appetizers and a brunch dish for around $25-29 I believe, and it’s all so deliciously worthwhile. The atmosphere is hip and awesome. Everyone is always having a great time and the mood is good. \nI highly recommend this little gem!",
   "Visited for brunch when I was in town last November with a friend. SOOOO GOOD!! Service was great, my food (and drink!) was delicious. I had the braised pork eggs Benedict (I literally try eggs Benedict everywhere I go) and the house Bloody Mary. The atmosphere was great, parking was fairly easy and I had a great brunch with my friend! I will definitely be back",
   "Nice little gem, the location is a turn off because its located in a really sketchy part of town.  The ambiance was relaxing.  Nice place for a date night.  Food was small in portion, but very classy and up scaled.  Friendly staff, and overall amazing place.  Pork belly was amazing!!!!!"
  ]
 },
 {
  "name": "Meritage",
  "address": "410 St Peter St, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/627fa4ba-9334-11ea-a460-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "drink",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18029545913706163545",
  "source": "GoogleMaps",
  "reviews": [
   "We came to this place for lunch. we heard about this spot from many people.  Well, it was very nice. we were warmly welcomed by the staff members  and we had an excellent feeling. The food was just great. We had a great time and we will visit this place again. we highly recommend this place.",
   "Perfect place to go on a cold winter day!\n\nORDERED ITEMS: OUT OF 5\nCHICKEN SOUP W/ MATZO BALLS: 5\nMy first time trying this legendary item. My favorite part was the doll complimenting the chicken broth. I didn't think it would do much but it was just perfect. The Matzo balls are soft and every bite is a spoon of comfort for the soul. I could have had 5 bowls!\n\nBAKED SALMON LUNCH SPECIAL:4\nI love capers and the broth/sauce beneath the salmon was hearty and delicious. \n\nSPICED HONEY CIDER:5\nI nursed this drink for a very long time. I chose a hot drink and it tasted just as good even cold. The perfect non alcoholic drink on a cold MN day!\n\nBravo Meritage!",
   "This place is no doubt one of the tastiest restaurants in the region. Every time I visit this place I am greatly happy. They manage their very high  level service and the topmost level of food  they give. You definitely will enjoy this this place. Very  recommended.",
   "Pretty good French bistro, with solid food offerings all around.  Decent happy hour. At times More expensive than its peers but given its location, not unexpected.",
   "Best place to celebrate our 25th Wedding Anniversary!  Staff was AMAZING,  attentive  and took care of EVERY detail!  Food was mouth watering, had superb presentation and exceeded expectations!  Make your reservations NOW!"
  ]
 },
 {
  "name": "Pazzaluna Urban Italian Restaurant",
  "address": "360 St Peter St, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6306af76-9334-11ea-a337-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "delicious",
   "drink",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17020476850826668998",
  "source": "GoogleMaps",
  "reviews": [
   "Overall very good experience.  Giving 4 stars because there wasn't anything that WOW'd the wife and I - it was very good, but not amazing.  Also because my wife drank less than half of her strawberry (grenadine) lemonade and couldn't finish it because she didn't like the taste.  And because they add a 3% fee to cover \"increased wages for great employees\" that's not required and you can ask your server to remove. It just felt weird to be automatically charged this random extra fee instead of raising menu prices for example.  We asked to have it removed and used it as a portion of the tip to the waiter instead.\n\nI had the crab stuffed salmon (one of the evening's specials) and my wife had the stuffed ravioli.  We both finished our plates and were very happy.  Again, they were both very good, don't get me wrong, but nothing awesome/unique to brag about.\nThe only item that excited me was the bread - very soft on the inside and I loved the cheese crusting.  I wish they would have served it with the traditional olive oil and Parmesan cheese though - we didn't like the crushed olive \"dip\", but neither of us like olives much.\n\nGreat atmosphere - we liked the decor and especially the high ceilings.  Service was excellent.  Quick and friendly.\n\nIt was a $100 bill for the two of us and at the price, I think we will try somewhere else next time.  I feel like I could get a similar very good solid meal at Olive Garden for $60-80.",
   "Checked reviews, had to stop by!\nGREAT CHOICE!  Bread is amazing, very nice wine selection, Pizza is excellent!:))\nFantastic atmosphere and ambiance!   Very pleasant staff.\nNicole H took great care of me w/ spot on recommendations and great service, and conversation.  \nThis is a gem....try it...trust me!",
   "Great experience on Valentine's day. Every course was delicious and the drink pairings were on point. The portions were perfect I would love to come back on another day with a similar menu setup.",
   "This place is pretty good but a little expensive. They were however, very accommodating. To start, the bread is absolutely delicious. For a salad, I recommend the Caesar salad. The Chicken Parmesan was okay but the Spaghetti Carbonara was amazing. I do not drink alcohol but their list is extensive. Dress nice!",
   "Pazzaluna is upscale Italian with the price tag to show it.  The food is good and the service is great.  The beet salad I had was delicious.  But after just having returned from Italy the meal was over double the cost for a similar meal in Tuscany.  Something seems wrong about that."
  ]
 },
 {
  "name": "Highland Grill",
  "address": "771 Cleveland Ave S, St Paul, MN 55116, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/63654a70-9334-11ea-8374-14b31f159f22.png",
  "tags": [
   "delicious",
   "walk",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4200509911652863286",
  "source": "GoogleMaps",
  "reviews": [
   "Steak and perogies: TO DIE FOR. this menu item was so good it makes me want to come back for more or order seconds. This is my first time coming here but what an amazing experience! Very nice inside and menu prices are very fair. Madison was my server and she's very delightful, definitely a good experience with her! I will be back 👌",
   "First time here was fall 2019. Randomly chose it to meet up with an old friend.\n\nFood: Everything was delicious and looked appetizing!\n\nCustomer service: Attentive and friendly server.\n\nParking: Had to find parking on the street but it was a nice brief walk to the restaurant.\n\nSeating: It was perfect weather to eat outside. \n\nOverall: Would choose this as a meetup place to eat and catch up. Also, if you went to school in this area, there’s a high chance of running into some lovely people from college!",
   "We have been to the great Highland Grill many times. Stopped in for lunch today and enjoyed the grilled watermelon salad and the steak and perogies.. what a treat! My husband and I highly recommend both dishes! We left satisfied and wanting even more! Thank you again, Highland Grill! We will be back again soon!",
   "After dropping my husband off at the airport at 8 a.m. I googled \"best breakfast near me\". In the list of possibilities was the Highland Grill. As I walked in I felt the intimate setting and headed straight to the breakfast counter for my seat. I was immediately greeted by server Rachael. My preferred, decaf coffee, with real cream served in the old fashioned little pitcher was great!. I ordered the All American Breakfast. Perfectly cooked eggs and crispy hashbrowns. The toast was thick, crusty and had a gooood amount of butter on it! I love me some butter! The bacon was generous and smokey flavored. It was my first time there,  but not my last!! Next time I'll stop for a cocktail and try an evening entree as all the pictures from reviews look fantastic!",
   "The Hot Hash & Holly is tremendous! I was pleased that you could grab a coffee next door if wanted. The staff is attentive and the food is amazing. Need I say more?"
  ]
 },
 {
  "name": "Pajarito",
  "address": "605 7th St W, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/63fecbb8-9334-11ea-b069-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=11051504229226332556",
  "source": "GoogleMaps",
  "reviews": [
   "Hit and miss. A few flashes of brilliance here and there - that sweet potato dish!  They certainly have skills and create some real crowd pleasing dishes. And it’s mostly perfectly fine. But it’s nothing more than slightly above average updated Mexican food. Dinner was definitely better than lunch.  \n\nIt’s a fun space, great vibe and great staff. Food is good, sometimes great, sometimes less than good.",
   "ringing in at $9 these fish tacos were perfect in every way. perfectly battered and lightly crisp and still hot from the fryer and balanced but the crunch of apple and cabbage. tortillas could be a little better but overall cannot complain. wish i had more room to try the salsa options.",
   "Amazing salsa and guacamole! Fantastic cocktails!\n\nThis place gets BUSY on Saturday nights, but the servers do a grade A job still being attentive to their patrons.\n\nMy guy got a barbacoa taco that he enjoyed. I insisted we get the yucca fries (as I always do when I see them on the menu), and they weren't awful but a bit too starchy for my taste.\n\nWe would definitely go back to try more.",
   "I really enjoyed Pajarito. The location is quaint, the flavors are amazing! I loved the Brussels sprouts. The prices are slightly high in my opinion, and the service could have been better.",
   "Very nice modern and not pretentious Mexican style fine-dining.  Great selection of tacos, fresh made chips and top notch salsas. Ask for recommendations and you wont go wrong."
  ]
 },
 {
  "name": "Kincaid's Fish, Chop & Steakhouse",
  "address": "380 St Peter St Suite 125, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6479c94c-9334-11ea-befd-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1233794598673798412",
  "source": "GoogleMaps",
  "reviews": [
   "Our first time to this lovely establishment but not our last.  We made reservations and the hostess was just fantastic.  We sat in the bar area waiting for our table and ordered drinks. The drinks were amazing but the staff that work there are beyond outstanding.  We were seated at a lovely table and the food was a delicious treat from beginning to end.  The baked brie was perfect to start things off.  The prime rib dinner was perfection. The steak dinner was beyond delicious.  Dessert with coffee ended one of the best meals we’ve ever had in the Twin Cities.   But it was the excellent customer service that really made the dinner incredible.",
   "Exceptional service. All of our food was beyond amazing (perfectly cooked & exquisitely prepared/presented). \n\nDrinks were A+. Our server and hostess were fantastic. \n\nGo here! Perfect romantic spot for a luxury dinner.",
   "This place was amazing. The staff was excellent and the food was amazing. Their cask aged old fashioned was one of the best I have ever had. It was our first time here, but will definitely go back.",
   "Delicious happy hour menu selections. The sampler was perfect for 2. Nice red wine as a complement at a reasonable price.",
   "Kincaid’s has changed ownership and has changed a few things. While I miss a few of the old menu items, many of the classics remain. Service was great, atmosphere is still one of the best. Food photos will speak for themselves!"
  ]
 },
 {
  "name": "Downtowner Woodfire Grill",
  "address": "253 7th St W, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/64d57d36-9334-11ea-a554-14b31f159f22.png",
  "tags": [
   "walk",
   "eat",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10945733958386907895",
  "source": "GoogleMaps",
  "reviews": [
   "We went here for an early supper before the hockey game .  The restaurant is eye catching as soon as you walk in .  Looks really high end .\nWe ordered the wood fired mushroom dip and the fried shrimp and calamari for appetizers.   Not a heavy breading on the shrimp and calamari.   Just enough to coat it and it was fantastic.  Mushroom dip was ok .  Nothing special. \nI ordered the swordfish kabob .  Swordfish was good and  cooked well .  The plate come with a pile of white rice .  Bland and no flavor to it .",
   "Excellent food and service.  Stopped by the Downtowner before a Wild game and it was nice to see I wasn't the only fan who had that idea.  If you are a fan of pizza, the pizza here is great.  The wood fire style they make adds an extra level to the pizza.  I had the chicken, mushroom and smoked mozzarella and it was one of the better pizzas I have had.  I will definitely come back, especially if I am going to a Wild game and want to get something to eat before the game!",
   "Guac appetizer excellent. Walleye sandwich outstanding. (Cooked over wood) Only issue: Stella from tap was not cold. Otherwise a great place to eat.",
   "This place is probably one of the best places for the price point you can find in Saint Paul,  They have great steaks but I would highly recommend the sword fish as well, also if its in season they do amazing things with halibut. This is a really good date spot as well a good spot to get a nice meal before a wild game or concert, I haven't tried they're lunch yet but since there prices are really reasonable I would give it a go. The one thing I will say is that they're appetizers are true appetizers, they are meant to be a very light start to the meal  as opposed to most bar appetizers which are often can be a meal in themselves for one person, just be aware that  of that when getting apps.",
   "This used to be one of my favorite restaurants. The food, service and value was among the best other restaurants around. There is also complimentary parking in one of two lots. Unfortunately, we had a poor experience there last night. So bad that I'm unsure I will go there again. Perhaps it was a fluke experience given the large parties related to the Final Four, but the entire staff just seemed a bit off and the dining experience for the special event we were celebrating was sullied. \n\nThe server was not attentive. It took a long time to even get our orders taken. We had to ask/beg three times before any bread came out. No new silverware was provided or offered after salad/bread, or even after one piece of silverware fell (accidentally) on the ground. The server saw it and still didn't offer new silverware, but seemed perturbed by the situation. \n\nDishes lingered and were not cleared promptly. Refills on drinks were incredibly slow. A non-dairy/allergy friendly food request was not honored, despite the fact the server indicated it could have been. There was no offer for dessert or after meal drinks, and I believe I know why. When we got up from the table, staff zoomed over to prep the table for another group. It appeared that the restaurant had overlapping reservations. \n\nIn two meals, the main dish meat was undercooked to the point a good portion of the dishes were not eaten. No one ever asked us how things were after the good arrived (the server and manager historically do), and it was clear the server was content to extract the obligatory 20% gratuity based on our group size. I have no problem tipping well, but when you get incredibly poor service, particularly for a special event you are celebrating, that's an inappropriate tip amount.\n\nOverall, I really was disappointed with our latest dining experience and how it diminished the special event that we were celebrating. I am hopeful that this was a one time off experience. I am torn on whether to give the restaurant another chance."
  ]
 },
 {
  "name": "La Grolla",
  "address": "452 Selby Ave, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6546a81a-9334-11ea-88b3-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "free",
   "food",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2834873377815355193",
  "source": "GoogleMaps",
  "reviews": [
   "A great spot for Italian in St.Paul. Classy intimate vibes, offering tasteful Italian dishes cooked with care. I would highly recommend this restaurant to anyone who loves great Italian food at a good price in a nice quiet setting.",
   "Great service and very reasonably priced. The food was good (no major complaints), but it wasn't anything special. The dishes we had all lacked a little flavor and were more on the bland side. There are several other Italian restaurants in the MSP area that I would recommend above.",
   "Food was amazing, all the creme sauces are great. I've been here twice and both have been great experiences. One of the dishes came cold and they immediately replaced it with a fresh one free of charge. Great service all around.",
   "My husband and I visited La Grolla a few weeks ago on a whim. The location was great and the ambiance was quaint and romantic. We both had pasta dishes and they were delicious. The bruschetta that we started with was probably my my favorite part of the meal. Be sure to check this restaurant out!",
   "Amazing food for an amazing price!! You get your money’s worth for the food- it’s the perfect size. Everything is delicious, and probably some of the best pasta I’ve ever had."
  ]
 },
 {
  "name": "Colossal Cafe",
  "address": "2315 Como Ave, St Paul, MN 55108, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6597fcb4-9334-11ea-8077-14b31f159f22.png",
  "tags": [
   "creative",
   "food",
   "delicious",
   "food",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15862338900976925534",
  "source": "GoogleMaps",
  "reviews": [
   "Colossal Cafe is our popular pick-up spot for scones & croissant muffins. Daily sweet & savory scones keep us coming back for more. Breakfast is so good with huge serving sizes. Sourdough toast off the flattop is mouth watering. If you have room for dessert get a \"flip\"! Beyond yummy!!",
   "Decided to check this out because it made the top Eaters twin cities list. Cute place. Loved meeting the owner and seeing how much love and care he puts into the place. \n\nI enjoyed the atmosphere and seating, cozy home feel to it which I appreciate. \n\nI had the mushroom, spinach, provolone omelette and the hubby had the apple, walnut, brie full stack flappers. \n\nThe omelette had a creamy sauce which was a pleasant treat. Their homemade pineapple habanero sauce definitely has a kick to it and complemented the eggs well. For some reason, and despite all this, it still tasted a bit bland for my taste buds. \n\nThe flappers are extremely filling. The pancakes are made with yeast, which I'd never tried before. I wouldn't have thought to mix apple with walnuts and brie on a pancake and it is a burst of flavor in your mouth. I enjoyed trying something new and like when places get creative with food. \n\nOverall a neat spot to try out.",
   "Love colossal!!! It’s a neighborhood gem that serves delicious food at reasonable prices. The owners and employees are wonderful and I’ve never had a bad experience in the 7 years we’ve lived in SAP, eating at the Como location.",
   "Very nice brunch place. Loved their homemade biscuits. They are huge, soft and they melt in the mouth. Their biscuits and gravy is to die for - strongly recommend them. Omelettes are light, fluffy with great options. Pastries are awesome too. \n\nMany vegetarian options available. Do try their wild mushroom gravy!! It's terrific! \n\nOverall nice and cozy Cafe in Como with good ambience and great food! 😍",
   "This is a small, busy place with a unique waitlist. Customers order their food as a table, wait until an actual table opens up, then sit down, which is when the kitchen starts cooking your food, since you don't really have a server assigned to you. Tipping is confusing in this set up and since the place is so small, the tables are very snug together--anytime someone wants to move, they need to ask someone at a table next to them to move too. The food, however, is great! I've been twice and both times, thoroughly enjoyed brunch. Their known for their homemade colossal-sized biscuits and flappers (yeasted pancakes). I recommend the roasted vegetable omelette."
  ]
 },
 {
  "name": "Tavern on Grand",
  "address": "656 Grand Ave, St Paul, MN 55105, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/65f26780-9334-11ea-8205-14b31f159f22.png",
  "tags": [
   "historic",
   "food",
   "eat",
   "drink",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1538022447551990136",
  "source": "GoogleMaps",
  "reviews": [
   "This place has a nice bar, and serves great food... well known for walleye sandwiches, grilled, breaded or blackened. Plenty of other choices, too.  Great atmosphere, parking out back. Historic! Go! Enjoy!",
   "Good nachos and a wide variety of walleye themed dishes. Service was good and there was a fairly traditional American beer variety. More options for potatoes than I've ever seen at a restaurant. All in all, a worthwhile place to eat if you're in the area.",
   "The bartender Drew is really friendly! I also noticed he kept his cool when it got busy because he still managed to get peoples drinks quickly. Super impressive. I hope to go back when he’s working again!",
   "Quaint interior, excellent staff, and great tastes. I visited for a private event and the food and drink were excellent, I highly recommend their walleye! The bar also has a good selection of beers including some local beers. Staff were very kind and attentive. I will definitely be back again soon",
   "I come to this special place often  as I enjoy the good mood that is exist in this place. The staff is very loving and professional. The service is exceptionally quick. Needless to say, the food you eat is perfect. I ate there many times and I was always satisfied. The price is decent. I recommend this place to to all."
  ]
 },
 {
  "name": "Brasa Premium Rotisserie",
  "address": "777 Grand Ave, St Paul, MN 55105, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6644d234-9334-11ea-85bf-14b31f159f22.png",
  "tags": [
   "tasting",
   "food",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=1161087545259177912",
  "source": "GoogleMaps",
  "reviews": [
   "Been coming here for a few years now and honestly this is one of few restaurants I can say NEVER disappoint. The food is super flavorful, the pricing is more than fair, and the staff is super friendly. Plus, I never in my life thought \"Hot Pepper Vinegar\" would ever be something that I crave, but this place has done that to me. Plain and simple if you want amazing tasting food that hits the spot and doesn't break the bank this place is for you.",
   "A true MSP gem - Brasa does it right with original, delicious, perfectly executed, yet unpretentious, comfort food. The only problem we ever face is trying to narrow down what to order.  That said, here are a few recommendations: crispy yucca, plantains (we're partial to the green variety), smoked beef and brunch bowls. Enjoy!",
   "Yum yum!! Came here for lunch Delicious pulled chicken it was tender, flavorful the fish! Was so soft! \nThe corn bread needed more butter and honey haha\nBut the fried plantains was 💪🏼",
   "Solid pricing for great flavor. I've always liked Brasa but until recently it wasn't a place I'd normally go into. It's super casual and I wouldn't stop in on a night out. Their happy hour specials are top notch, some of the best deals in the city.",
   "Favorite restaurant in the TC. Light & vibrant little joint. Generous portions, good prices & great service! (Thanks Henry)"
  ]
 },
 {
  "name": "Mancinis Char House",
  "address": "531 7th St W, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/669367c0-9334-11ea-8975-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2701735148295033639",
  "source": "GoogleMaps",
  "reviews": [
   "Mancinis is the classic old school supper club with steaks and service that are impeccable.  They have a dining area that's meant for large gathering or intimate couple conversation.  It's my favorite restaurant of all that I've been too.  Awesome food, wonderful ambiance, and lovely staff.  Their success is well deserved - and when Nick, the founder of this one-of-a-kind place, passed away (😢  his presence is still felt there - yet his presence is deeply missed)  - his sons have done an amazing job of keeping Mancinis legendary reputation alive.  Nick must be unspeakably proud.  💞\n\nThank you, Mancinis crew, for ensuring that this incredible restaurants character remains unchanged.  There isn't another place like yours and there never will be!  💞💞",
   "Traveling the area with some family. Popped in for a drink and shrimp. This place is awesome! Love the decor and old fashioned steak house and lounge feeling. The staff are friendly and attentive. The other patrons were having fun and sharing stories of Mancini’s from days last.  I throughly enjoyed my visit. The shrimp cocktail was amazing. The grasshopper drink was made perfect. Haven’t one of those since the mid 90s at a small steakhouse in my hometown. Great memories. If you’re in the area, go visit this place. You won’t be disappointed.",
   "Large building, throwback feel in a dim setting. Staff was great. I ordered a sirloin steak and was given bowl of veggies, break and salad. All great and sure to make you stuffed before main meal. Steak itself was cooked to order but felt quality of meat to be average.",
   "Awesome place. Excellent food and Pat Mancini is a great host. We are old friends from school and he always treats us right. If you haven't been there you need to go! Best steak and lobster in town!",
   "I went for a wedding reception. Great food and drinks. The steak was amazing! They have very attentive staff and fast service at the bar. There was a live band playing and a dance floor. It was a really fun atmosphere."
  ]
 },
 {
  "name": "The Nook",
  "address": "492 Hamline Ave S, St Paul, MN 55116, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6703dd18-9334-11ea-b57c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "walk",
   "drink",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4123008262879569819",
  "source": "GoogleMaps",
  "reviews": [
   "I've been to the Nook before, however, I never had gone to their basement level. It was very fun down there. And I enjoyed to see their bowling alley where people were having a lot of fun. I was at the bar and they had a great happy hour. Draft beers for two and $3! You can't beat that. Next time I want to go a little earlier when I can have a burger and fries too.",
   "The food was really good. The nook curds are super good and the original nookie burger was awesome too! Only negative is it's a small building and our buzzer went off so they took us downstairs to a table but someone else sat down at it. They made us go back upstairs and wait an additional 10 minutes before getting seated after already waiting 20 minutes.",
   "Lately I have begun to worry that the soul is nothing more than what the imagination does with inner experience. The place from which your life flows is incalculably deep. In none of my visits to the Nook have donuts been available. Nor, I suppose, have they been unavailable, as the good people of this establishment do not present themselves as purveyors of donuts. The donuts are absent, and I feel their absence deeply. But when I grow weary, the wings carry me to higher ground.",
   "One of the very best burgers and very best fries in the whole Twin Cities.  Also a great environment... don't forget the old bowling alleys downstairs. A great place to relax and have a good time with good food.  Great wings too. This is an old, old favorite of ours. It's been great for many years.",
   "**The service I received during my last visit was maybe worth 1 star but I enjoy this place typically.**\n\nMy friends from out of town visited during the holidays so I wanted to bring her somewhere unique. When we got to the nook it was a steady pace. Not extremely busy but not dead either. We asked to sit in the basement. We were sat and greeted 5 minutes later. I was ready to order a drink at that time but the others were still browsing. The server took my order and left for about 10 minutes before bring back my beer.\nRather than asking if the others wanted something to drink he quickly walked away and went to a table nearby that had just sat. He took all of their drink orders, went to the bar to put them in, waited for the drinks and then returned to the table to take their food orders.... we had been sitting for 20 minutes at this point with no drinks or food orders for my friends.  He continued to walk past our table so I flagged him down to pay for my beer so we could leave. He took the card and came back and said \"it's on me\" and turned away. It was a bummer and a little embarrassing."
  ]
 },
 {
  "name": "Skyva Deli",
  "address": "55 5th St E #204, St Paul, MN 55101, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/676161de-9334-11ea-9ca3-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=10193993718629538460",
  "source": "GoogleMaps",
  "reviews": [
   "The food is fresh and SO tasty. My new favorite lunch stop. The service is excellent, too. Nice variety on the menu, and great prices. I can't say enough good things about this place!",
   "When my go-to Deli closed in this food court (the Nectary) I needed to find a new place for my Sandwich, Wrap, Salad and Soup cravings. Skyva has filled that void nicely! They have a wide range of options and everything I have tried has been good. They also have mutliple daily specials. Today I tried the Cuban Special which came on a pita wrap loaded with delicious pork, ham and provolone. I will be getting that again. My goto is usually the Spicy Chicken Sandwich. The staff is always friendly and they move quickly.",
   "Fresh, delicious and quick! 5 stars doesn't do justice. Amazing customer service, tasty but more importantly fresh and healthy lunch at an affordable price.",
   "At the first moment  you step in that place  they give you a good feeling. Very friendly waiters, it is a good restaurant to go out with buddies or with your date. enjoyable  cooking, experienced  chef, competitive  pay and generous  service. Warmly recommended.",
   "So I read the reviews. Had to find out for meself. Soup sounded fab this cold, blustery Thursday morning. Got the Chicken Poblano bowl + Spicy Chicken sandwich to go.\n\nExcellent choices, both. Soup was flavourful, rich, mm MM good! Sandwich tapped all my taste buds, and then some...💯👌🏾👍🏾\n\nBrandon et familia (pictured) prepped this yummy grub from scratch, even though it wasn’t quite opening time for them. Truly, truly nice people...🙏🏽\n\nNext up, Mac & Cheese Friday @ Skyva!"
  ]
 },
 {
  "name": "Parlour St. Paul",
  "address": "267 7th St W, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/67b7e694-9334-11ea-be30-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10647572802941186593",
  "source": "GoogleMaps",
  "reviews": [
   "Top three things:\n1.  The burger, of course, one of the best in the Twin Cities\n2.  The fried cauliflower - plenty of flavor\n3.  Popcorn - really great to share with the table\n\nThings I wish I knew ahead of time:\n1.  At the time we went, the burger bun did not have a gluten free option\n2.  Scrambled eggs here are an amazing option\n3.  No parking lot, so metered street parking is your best bet",
   "; We entered on a quiet Sunday night close to 9PM. With three rooms connected for seating, Parlour had plenty of seating available. The ambiance, cozy and elegant. \n\nWe ordered the simple burgers, smash burger style, which were great. I was a bit disappointed that I wasn't able to add a fried egg to my burger, but no biggie - sunny side up will do just fine. The two large potato French fry order is definitely shareable, possibly even between three people. I highly recommend the garlic aioli for the fries, if you're into that sorta of thing.\n\nTheir in-house old fashioned cocktail bites and STRONG!\n\nStaff was great the moment we walked in. Hostess was patient with us. Our waitress was friendly and attentive. The rest of the staff acknowledged and thanked us as we walked out the restaurant.\n\nOverall, it's been a great experience. We'll be returning and check out the other location.",
   "Much larger than the Minneapolis one but still the same great food. Honestly one of the best burgers I've ever had (Parlour Burger). Brought my dad and by end of dinner he was talking when we were going to go again. Highly recommend and will be back.",
   "Another City Tin coaster in the books. Dined at Parlour Bar St. Paul. Enjoyed the uniqueness of popcorn fried in bacon fat and coated in pineapple dust. I thought the meat blend in the burger was top notch but the $14.50 price point for just the burger did seem a bit high. Fresh cut fries were a table favorite. Cider was tart and I am a fan of that so two thumbs up from me there.",
   "My friends and I tried this place because we heard that they have the best burgers in town. I was also cautiously optimistic because whenever I go to any restaurant know for their signature food item they always seem to cut corners on everything else.\n\nI got their Parlour Burger and added a friend egg and bacon. It was amazing considering that it was just meat and cheese! The sign of a good burger is that it doesn't rely on 10 extra fixings to be delicious.  My extras definitely leveled up my burger, but I would've been just as happy without them. \n\nThe bread and butter pickles were flavorful, crunchy, and generous! And the hand cut fries were awesome too - crispy outside, soft inside, and perfectly seasoned.\n\nThe staff was super friendly and our food arrived surprisingly quickly, but it was also 10:30 a.m. on a Saturday. I couldn't find any fault with anything. My whole experience was just that good!"
  ]
 },
 {
  "name": "Mama's Pizza",
  "address": "961 Rice St, St Paul, MN 55117, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/680ee210-9334-11ea-aeb6-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17929693307158106404",
  "source": "GoogleMaps",
  "reviews": [
   "We have been going to Mamas for years, its always a trip as we live 90min away. Last night was our first time visiting since this pandemic started, and decided to try the take out only. We were not disappointed! Still the same amazing food and amazing service they are known for! Keep up the great work, such a fantastic restaurant!",
   "This place was absolutely amazing. They had great staff that was very communicative and was there whenever we needed a refill. We had delicious meals that filled us up and gave us left overs. At the end we even got some delicious complimentary ice cream cones. They were so cute!",
   "We’ve lived nearby for about 5 years and finally decided to dine here. We were not disappointed! The food was delicious and the prices are super reasonable for the amount of food you get. We enjoyed it so much we went back the next week. We sat at the bar and the two bartenders were friendly and it was obvious they enjoy their job. Will definitely be returning.",
   "Mama's has been s Saint Paul staple for as long as I can remember. Fantastic food on the entire menu and the portions are GIGANTIC! Super friendly staff and very intimate atmosphere. If you're interested the neighborhood you absolutely must stop in. You won't be disappointed.",
   "I've been going to Mama's since the 70s best little mom and pop Italian restaurant great antipasto salad with house dressing any pasta or dago order with extra cheese the meal is covered in mozzarella cheese pizzas are thin crust they offer wine and beer, and a complimentary vanilla cone for dessert.  Mama's has never been a let down.  Please enjoy."
  ]
 },
 {
  "name": "W. A. Frost and Company",
  "address": "374 Selby Ave, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6863beee-9334-11ea-967d-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "unique",
   "historic",
   "food",
   "food",
   "historic",
   "adventurous",
   "food",
   "drink",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=11533782068437831570",
  "source": "GoogleMaps",
  "reviews": [
   "W. A. frost is a must to check out. The food is awesome and what a cool place. Areas in the basement to tuck a small party into, have some drinks and appetizers near a fire. Private bathrooms, a patio, private rooms are beautiful. Staff are professional and friendly. They have a bar that has plenty of spirits to choose from.",
   "Unique, delicious restaurant with a historic twist and inventive food. My wife and I came here on our 13 anniversary because we ate here for one of our first nice dates years ago. The plates have only gotten better. The patio is amazing. The service also great. We are vegetarian and loved our options. Try the bruschetta for a sure win, the celery and fennel for something interesting, and the wild mushroom pasta for a killer main course. We loved our meals and will definitely be back for another celebration.",
   "One more City Tin coaster done. WA Frost & Company in the Cathedral Hill neighborhood for brunch today. Admittedly, I did not love the Dutch Baby Pancake. Figs and lemon were good, but pancake was dry and needed more honey. This is not a slight against the establishment as a whole because the ambience was top notch and many other food items looked great.",
   "This a converted early 1900's pharmacy. This place has great food and ambiance with a historic flair. The food is great with a varied menu for all tastes. There is a restaurant and a bar and lounge. The bar has great drinks for the traditionalist and for the adventurous as well as for the nondrinkers. Great place to sit and relax.  Great place to take someone new to the area.",
   "The speakeasy is a unique place to sit and have a drink and enjoy company after dinner."
  ]
 },
 {
  "name": "Shish",
  "address": "1668 Grand Ave, St Paul, MN 55105, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/68bb51e8-9334-11ea-98ac-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11764292477834086711",
  "source": "GoogleMaps",
  "reviews": [
   "Nice authentic Mediterranean themed restaurant. The host-server was courteous and welcoming. Food was great with few nice touches. They have good menu options and quality/quantity of portion was also good. \n\nThey have nice vegetarian options and Turkish coffee is a must try. Ambiance is nice and cozy which adds up to your mood.",
   "Outstanding COVID-19 safety measures! I ordered and paid online. Convenient parking was readily available. The door was blocked open, so that I didn't even have to touch it to go in. The staff greeted me from a distance as I picked up my order from a table just inside the door. I touched nothing but my order. GREAT PLANNING for keeping people safe and healthy! I super-appreciate businesses that are doing this well!",
   "i have decided to stop coming here since my last visit. im not sure if it has new ownership since the renovation in 2019, but the food is no where near as awesome as it used to be. prices have gone up and the food quality has gone way way down. makes absolutely no sense. i wont spend money here anymore. it was good while it lasted.",
   "We like a lot eating out. Last night we went to this magnificent restaurant which we didn’t know before. We passed a beautiful time there with great food and  an experienced team and a distinguished chief cook. We  added this venue in our phone list  and we shall certainly visit again soon. We highly recommend.",
   "Came here for dinner with my sister on a weeknight. Super fresh food with great flavors. I had the chicken pita and my sister had the chicken wrap. We shared the cauliflower to start and it was absolutely delicious.\nThe pita was a bit messy but worth the mess.\nNice clean atmosphere that was a great place to catch up.\nPrices are very reasonable. I'm looking forward to going back and hopefully trying some of the desserts that looked awesome!"
  ]
 },
 {
  "name": "Shamrocks",
  "address": "995 7th St W, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/691fbcf8-9334-11ea-ae0d-14b31f159f22.png",
  "tags": [
   "food",
   "cheap",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=7543273308577152930",
  "source": "GoogleMaps",
  "reviews": [
   "I adore this place! They provide fantastic dishes, their menu is rich, The cook in that place is very trained, I enjoy a lot eating all their food. The dishes are always of high class, the attitude towards the visitors  is agreeable. I often go to  this restaurant and I not even once was unsatisfied. I recommend it to all my friends.",
   "Awesome spot. Liz was a great server! Mouthwatering Lucy burgers (albeit a tad smaller than your typical burger), cheap rail drinks, vibrant atmosphere, cool decor and big tvs. Psst...they have milkshakes too!",
   "I’ve been coming here for years. Sadly, our pickup order tonight was extremely under par. We usually love it, but we were extremely underwhelmed. Our burgers were overcooked, and flavorless. So disappointed.",
   "Shamrock's (and the Nook, which is owned by the same people) has THE best cheeseburger in the Twin Cities. And I've tried a lot of the cheeseburgers these towns have to offer. The fries are also fantastic, with a little darker color and skins on. Do yourself a favor and check this place out.",
   "Still one of my favorite places ever. Got the Paul Molitor, again. Switched it up and got the sweet potato fries with the chipotle ranch. Such a phenomenal meal. Great beer and drink options as well. Love coming back."
  ]
 },
 {
  "name": "Capitol View Cafe & Catering",
  "address": "637 Smith Ave S, St Paul, MN 55107, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/697a8f1e-9334-11ea-9fe2-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11476143988371799782",
  "source": "GoogleMaps",
  "reviews": [
   "This place is absolutely amazing. The food is amazing \n(I'd suggest the loaded Belgian waffle. It's a Belgian waffle with bananas, strawberries, blueberries, and whipped cream)\nIf you get a coffee they stop by to refill it when it gets low.\nThe people who work there are also fantastic.",
   "The staff works hard, and the food typically comes quick.  We get the TexMex which is layered hash browns, scrambled eggs, onions, choice of meat, tortilla, enchilada sauce and a dollop of sour cream.  It's fantastic.  The coffee is super, and super strong!  Prices are market appropriate.  They add a surcharge for credit cards, which is posted.",
   "Always delicious and generously portioned food. During this lockdown I am prioritizing supporting this fine West Side institution and I hope you do the same. Great business and great food.",
   "First ever experience with Capitol View Cafe was unlike any other first time at a new place to eat.\n\nThe wait staff was truly amazing, warm and welcoming. All of the staff were polite and prompt.\n\nNow the best part, the food. Hands down, the best food ever. Hot, flavorful and definitely homestyle. Large portions and flat out amazing.\n\nDefinitely will be returning!!",
   "Great place for breakfast.   Nice service and convenient location.  Lots of good memories here!"
  ]
 },
 {
  "name": "Saint Dinette",
  "address": "261 5th St E, St Paul, MN 55101, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/69d5327e-9334-11ea-bc40-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=2954661241447196766",
  "source": "GoogleMaps",
  "reviews": [
   "This place is the gift that keeps on giving. The menu changes always bring great new dishes to try while the staples remain. You won’t eat a bigger cheeseburger anywhere else. Their drinks are perfectly crafted. The staff is always gracious and the owners are great people. Highly recommend this spot for dinner or brunch. Don’t leave without ordering flapjacks for dessert",
   "Very nice and cozy place with large windows. Great service and friendly staff. Fair prices relative to the style. The brunch is excellent; eggs Benedict and avocado toast were awesome. Great coffee. Brûlée grapefruit was a nice sweet taste to finish with. Will definitely go back there!",
   "What a cute little place! I had never heard of it before until my daughter asked me to go to dinner with her at the restaurant. Very nicely greeted. Small but delicious menu. We each got an entree and a side to share. A small and unfamiliar wine selection so I took a chance on a red blend and it was wonderful! Lost one star because waiter was not as attentive as I would have liked. But overall nice place that I would return to.",
   "Great burgers in a unique location. The simplicity of their burgers is the key to their success. Their fries are also amongst the best we have ever tried. Will definitely visit them for brunch again. Before going to the farmers market or a Saints game.",
   "One of my favorite St. Paul restaurants. With this pandemic,  they have converted some of their great sandwiches and sides into a great take out value for couples and families."
  ]
 },
 {
  "name": "Mucci's Italian",
  "address": "786 Randolph Ave, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6a23d5d4-9334-11ea-9340-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17800595362693007432",
  "source": "GoogleMaps",
  "reviews": [
   "This restaurant is tucked away in a neighborhood but serves up delicious Italian beyond Spaghetti and Meatballs. We had a Baked Rigatoni with Chicken Meatballs but the cream sauce is what sets this off as the ground up salami makes it stand out. You may want to lick the casserole dish! The procuitto and artichoke pizza is delicious as it looks in the picture. The freshly made crushed tomato sauce, a nice crunch crust that holds up the toppings, and a fresh mozzarella that brings it all together! Go to Mucci's and enjoy as those ladies in the kitchen are on fire!",
   "Absolutely amazing! A total surprise! Drove past its unassuming exterior and was blown away with the amazing quality. Great atmosphere, amazing food, very appropriately priced! I will definitely be back!",
   "I couldn't pronounce anything on the menu, but the food sure was delicious. The fried chicken pizza was delectable. The restaurant is small and clean. The staff was incredibly kind and always ready to help. I enjoyed my time there.",
   "AMAZING FOOD!! My partner and I have been a few times and the food is always incredible! The rotating menu keeps things fresh and the staff are on point with their recommendations. Smaller, cozy atmosphere and attention to detail, would suggest to anyone looking for a new date-night experience or a nicer dinner with family.",
   "What more can I say other than... AMAZING. The Bryant/Lake corner curse has finally been lifted and we can all enjoy some of the best pizza, cocktails and SERVICE Minneapolis has to offer. The Calzone Pizza was life changing and their espresso martini will keep me coming back for more. 5 stars!"
  ]
 },
 {
  "name": "Revival",
  "address": "525 Selby Ave, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6a7b44fe-9334-11ea-a6c7-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16734841051003063663",
  "source": "GoogleMaps",
  "reviews": [
   "This was a transcendent experience. I cannot describe what it was like to bring this chicken home to a place where my wife and I (who are solid cooks) eat and sleep. I have never experienced something to this level. I was transported to a world of spicy and sweet chicken I have never been. I've eaten in the restaurant more than 5 times but bringing the chicken to a place that hasn't been consecrated is a monumental moment in my life.\n\nThis place makes it happen.\n\nThank you, Revival. I am forever in your debt.",
   "Great southern style place and maybe the best fried chicken in the twin cities. Got the whole bird with \"poultrygeist\" ghost pepper sauce and another tamer seasoned whole bird. The chicken was still juicy and flavourful under the spicy, crunchy, well sauced skin. And yes, we ate it all. The heat wasn't too bad. \n\nThe sides are delicious as well and really feels like southern food. The hush puppies are a very generous serving for a side. Really enjoyed the mashed potatoes here as well. Might as well get all the sides honestly. The burger cannot be cooked to order. It's similar to Culver's butter burger, where it's a very thin, greasy, yet tasty burger.\n\nWould recommend if you enjoy southern food or friend chicken. A bit pricey, but fair. The cost feels worth the visit.",
   "It's tough to find good Southern cooking this far into the Icy North. Revival stands as an exception to this statement.\nTheir small menu is packed full of flavorful, delicious delights. Their fried chicken is exemplary, and their other menu items are equally satisfying.\nThe wait staff is courteous and swift, and the atmosphere is pleasant, if not especially exciting.\nGiven the quality of the food, the prices are appropriate, though having to order sides a la carte was a bit odd feeling, though understandable given the portion sizes at work.",
   "We've been here and the location in Minneapolis several times. Food is always great. Tennessee Hot chicken is addictive. Southern fried also good. Either way, best fried chicken  in the Twin Cities. Barbecue excellent. Sides vary by location, but also good.",
   "If you want the BEST…. I mean BEST BBQ sauce in the entire world, you MUST come here. They have this orange brown sauce that he said was habanero, but it is NOT at all as spicy as it sounds. When the sauce hits your tongue its like a tingly little sweet spicy feeling, not just taste, this sauce has a feeling. And it’s crazy GOOD! Our ribs were some of the best ribs I’ve ever had! If you’re not used to smoked ribs, the meat is a little tough compared to ribs that just fall off the bone. But with the sauce these ribs were to die for. I had so many endorphins running through my body after eating this. The fried chicken though, that had to be the best I’ve ever had in my life. The skin was crispy and melt in your mouth at the same time. I also love how they are very environmental friendly. No plastic straws, no paper napkins, even no paper towels in the bathroom! We will definitely be coming back!! I give it a 7 out of 10 for sure. \n\nSAUCE 10/10\nRIBS 6/10\nCHICKEN 9/10\nMAC & CHEESE 8/10\nVALUE 7/10\nATMOSPHERE 6/10 *just a little loud\nLOCATION 6/10 *limited parking"
  ]
 },
 {
  "name": "Grand Catch",
  "address": "1672 Grand Ave, St Paul, MN 55105, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6ad39e3a-9334-11ea-82b4-14b31f159f22.png",
  "tags": [
   "unique",
   "delicious",
   "family",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=4995338999148439817",
  "source": "GoogleMaps",
  "reviews": [
   "Unique Cajun seafood joint with great cocktails and cozy atmosphere. Their brunch is also one of the best in town. A neighborhood favorite!",
   "Delicious and authentic seafood! The decor and vibe feel effervescent and inviting. Definitely a more pricey place, but you get what you pay for in terms of good-quality seafood. The hostess and waitress were both very friendly and accommodating. Would recommend for a nice night out!",
   "Family took me to Grand Catch for my birthday. Had a great 1st experience. Everyone we met were friendly and follow through with information pertinent to our experience. \n\nOrdered the El Grand Catch, the Little catch, 3 lbs of head shrimp and two lbs of crawfish. My wife was allergic to shell seafood so she had fries and a fish sandwich.  Food came out in no time! Everything tasted grand! Sauce were on point. \n\nThere were 7 of us so we made a reservation. We got there 10 minutes late but they had our table ready for us and we didn’t have to wait. Perfect place for twosomes or small groups. Make sure to reserve if you have large group. Parking was a challenge but we parked at the middle school after hours.\n\nWould definitely go back & you need to go if you haven’t been there!",
   "So good!! We shared the jumbo shrimp boil and crab Benedict. I was so excited I forgot to take pictures! Can't wait to come back. If you like spice, I recommend the awesome blend at medium or high spice level. 😋😋😋",
   "We love coming here. If you like seafood and Louisiana style spice,  come check it out. The shrimp is my favorite but the crab is great too. Now that I know how delicious their cheesy grits are,  I'll be back more often!"
  ]
 },
 {
  "name": "Cossetta",
  "address": "211 7th St W, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6b38eff4-9334-11ea-8c1e-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "delicious",
   "cheap",
   "affordable",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3030088215587166360",
  "source": "GoogleMaps",
  "reviews": [
   "I love their market.  It is the place to go for authentic Italian ingredients.  I love their frozen pastas.  You can just quickly make a sauce, heat the pasta up and have a delicious and easy meal.",
   "There is a cafeteria style eating area, a more upscale seated eating area and an Italian grocery store.   We ate in the cafeteria style section.   The food was delicious and very reasonably priced.  They sell some of their noodle dishes and sauces in the grocery store.  There were a lot of customers so this must be a very popular restaurant.   I liked the store inside the building but it would have been nice if prices were posted.   I probably would have purchased a few items.  I highly recommend this place!",
   "One of my favorite restaurants in Minnesota. The entire restaurant/shop is full of character with lots of features including an espresso bar/bakery, a separate shop for traditional Italian Groceries, and the main restaurant. At less than $20 for a large pizza it is an affordable price, but don't think the quality is cheap. Cosettas has the best most delectable and delicious pizza in the entire state of Minnesota.",
   "I tried this on the advice of a co-worker and it's so much better than I expected. They have so many of the staples of a great Italian market and so much more. Everything is fresh and done with love. They also have a wonderful restaurant and bakery. I wasn't expecting all of that but I loved it.",
   "Been going to the market 3 stores ago. The third store I went to was on the corner down by the river. Was no bigger than the size of a bedroom. I was 4 or 5 years old . I danced for them in the festival of nation's at 8 years old. Been my family restaurant since I was a child. Love that place. Great hard working Staff. Enjoy people."
  ]
 },
 {
  "name": "Handsome Hog",
  "address": "203 6th St E, St Paul, MN 55101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6ba51fa4-9334-11ea-bdfd-14b31f159f22.png",
  "tags": [
   "drink",
   "delicious",
   "food",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9085284867277103898",
  "source": "GoogleMaps",
  "reviews": [
   "Spencer was the best!! Imagine a drink? He made it. They have 25+ bitters to play with. He'll find your pref faster than you.",
   "I have visited the Handsome Hog on several occasions, and each time I have been more and more impressed with the restaurant.\n\nRight from the start, I have always been greeted and seated quickly by very polite and kind staff member; the attitude feels as if I am being welcomed by a friend in the South to their home. This service always continues to the last goodbye, and I appreciate that more than can be expressed here.\n\nThe food is top notch, from the menu (which is direct and reflects a restaurant that knows what it's strengths are and does them well, while at the same time always presenting a conundrum in that it all looks SO GOOD.) I always find what I need though... 😊\n\nOnce the food has arrived, the experience goes South... In the best way possible. Each bite is filled with flavor and texture and on my goodness I am hungry now thinking about it. I am not paid for this or getting anything in return, I swear, it is just THAT good.\n\nIf you are in or will be in Lowertown and would like to enjoy a delicious meal in a cozy, homey setting, this is the place. Go. Now. 😁",
   "Great food, nice atmosphere. I had the Brisket Hash and it was absolutely amazing: very flavorful and tasty. I also had the Bourbon Bloody (Sunday Brunch) which came with a rib on the rim (!) and a Surly beer on the side, and it was awesome! Totally recommended, will definitely be back!",
   "I frequent this place as I enjoy the special atmosphere and the top notch services. The staff is extra efficient and attentive. Fair prices too. Super!",
   "Handsome Hog is an awesome place to eat. I was impressed with the space, service and of course the food. I had the brisket sandwich, mac & cheese and chicken fried pork loin. Both were delicious. I'd definitely recommend stopping in if you're in the area."
  ]
 },
 {
  "name": "Ghebre's Restaurant",
  "address": "512 Snelling Ave, St Paul, MN 55104, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6c110110-9334-11ea-836f-14b31f159f22.png",
  "tags": [
   "food",
   "affordable",
   "delicious",
   "food",
   "affordable",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5357103282576988658",
  "source": "GoogleMaps",
  "reviews": [
   "I dine in this lovely spot quite often! This is my favorite place to dine.  I visit this spot at least once a month. The food is fantastic, the crew is welcoming and the rates are affordable. I like meeting in this place over a tasty dinner.",
   "Delicious! Stopped in for the buffet before a soccer game... such amazing food! Seriously recommend it.",
   "Tasty, affordable locally owned dining.",
   "This is one of my favorite restaurants around. Wonderful, friendly staff who make you feel welcome. The food is amazing",
   "Tried this place on a whim and was blown away with just how delicious the food was. The beef was cooked to perfection, not a single kernel of rice was overcooked, even the cabbage was scrumptious. The portions are large to boot. Friendly service and a warm, humble environment topped off the wonderful experience."
  ]
 },
 {
  "name": "Holman's Table",
  "address": "644 Bayfield St, St Paul, MN 55107, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6c743024-9334-11ea-b01d-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "food",
   "drink",
   "food",
   "active",
   "cheap",
   "unique",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=15863895734154984329",
  "source": "GoogleMaps",
  "reviews": [
   "One of the few spots I can give a 5 star review to. We had a nice helicopter ride before dinner. We had a nice view when we sat down for dinner. The food was fantastic. It's very hard to describe. The best way I can put it was that each bite was the same, consistent bites with perfect seasoning, perfect portions. One of the best places I've been to in a long time. The crusted elk was amazing. I will go back without a doubt not just for the amazing view but for the amazing food and service.",
   "I agree that this place is a hidden gem. Seeing the building for the first time was a pleasant surprise. It sure didn't look like an airport building. Bailey was an excellent waitress. We could ask ask for more. The food was pleasantly presented and especially tasty. Most breakfast foods seem very bland to me but this one had unique and interesting flavors. I look forward to going again. We all cleaned our plates.",
   "My husband and I chose Holman's Table to host a champagne toast for our wedding party before our wedding reception at Harriet Island Pavilion. It was the perfect location, and had the most relaxing environment and beautiful ambiance. Kathy and staff worked all the details out seamlessly, kindly served us quickly, and even allowed us to take sparkler pictures out on the front steps. We are so grateful that Holman's Table made our big day so special!",
   "Short; Great service and food. Hands down a hidden gem.\nLong; Building itself is really neat. Old terminal. Holman's Table looks right out to the runways and airfield. Ramps next to the building allow for easy parking of aircraft. Also a nice patio for sunny days. \nStaff was friendly and polite. From start to finish the service was on par.\nFood was prepared and presented very well. Good mixed drink selection, my wife really enjoyed her mojito. The meals were well put together, presented nicely, and cooked to perfection.\nShort ribs just fall apart. And the Amish chicken was perfectly cooked and buttery. Deserts again, well presented and flavorful.\nWill be stopping by again soon.",
   "Holman's table is a unique restaurant, located in a wing of the still active control tower of the old St. Paul airport. A very nice location, with knowledgeable and friendly staff and a small but nice menu that feels both homey and classy. From the lunch menu I had eggs with corned beef hash. Totally home made, including the corned beef, with a very good mix in the chunky hash. I chose a side of French onion soup that was very thick and rich, with melted cheese on top. I understand that they're famous for their Reuben too, with their home made corned beef. Very good desserts too - but not cheap. You can watch planes taking off and landing, or splurge and get a helicopter ride along with a great meal. Have fun!"
  ]
 },
 {
  "name": "Octo fishbar",
  "address": "289 5th St E, St Paul, MN 55101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6cc647ca-9334-11ea-a591-14b31f159f22.png",
  "tags": [
   "delicious",
   "hospitable",
   "food",
   "delicious",
   "food",
   "delicious",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15521379900041739783",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I had an excellent time here. The staff are tremendously hospitable and well trained. The food was fresh and delicious! We love the variety of seafood and how it was prepared. I personally loved the seaweed garnishes, I think they have a big impact to the freshness of the dish and they are delicious! We are really satisfied with our food and the pricing. The weekly special was reasonably priced and offer a great wide range of raw, cooked, and different culture cuisines.",
   "I love this place! I've been a few times now and every time I dine here I get exceptional service and lip-smacking delicious food. Today I sat at the bar for happy hour and did some studying. The bartender was very welcoming and friendly. Food came out quickly. Everything was prepared perfectly, especially the calamari! That green sauce is to die for!!!!! This is quickly becoming one of my go to spots in St. Paul.",
   "Great place. You know its fresh when the menu is small and still varied. Great location. Lunch hour parking is a pain but it's only two.blocks from the light rail.",
   "I went to dinner here on a week night. I had a small plate of chilled scallops which was delicious and a large plate of salmon. The food was so good and the flavors were unique. The atmosphere was really nice too. I ate at the bar and the service was excellent. Would love to go back.",
   "Overall, a good experience. Portions are a bit small for the price but the seafood was good. We ordered the Diamond seafood tower to share, which was all good but seemed pricey ($68) for the little amount of items there were. The lobster roll was pretty good and was more rightfully priced. Service was excellent."
  ]
 },
 {
  "name": "The Commodore Bar & Restaurant",
  "address": "79 Western Ave N, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6d2705c8-9334-11ea-a586-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=15473069481340864554",
  "source": "GoogleMaps",
  "reviews": [
   "I’ve made a terrible mistake. For the life of me I am not sure why this place was not on my radar sooner, but my wife suggested it for our anniversary dinner. After reviewing the menu and pics we gladly made the reservation. \n\nI am glad we did as everything from the food to the room to the great service exceeded our expectations. Well done!\n\nPlease do start with a fine cocktail and the well curated cheese plate. Then it is off to the meat. Both of our steaks was perfectly done and delicious. Make haste to the Commodore!",
   "A really swanky place, replete with silver-framed mirrored hallways and walls, to a Deco bar that will make you catch your breath. Dine here, lounge here, cocktail here, be seen here...it's a luxurious getaway with that speakeasy feel that gangster-era St. Paul is famous for. Happy hours are best...but an hour is best if you're feeling like sporting for something decadent. Casual, dress-up, or just hanging with your friends, you'll find the Commodore more than a little welcoming.",
   "The staff, atmosphere and food here are outstanding. Possibly the best New York strip steak we've ever had (and we've had a lot!) And the smoked butter and Parker rolls were heavenly.\nAlso it was very clean and well kept, with a special space set up for the social conditions needed right now. I felt like we were in good hands. A++",
   "I'll break down my experience/observations here: \n\n - Atmosphere: Beautiful Art-Deco inspired place - very ritzy interior with jazz music played throughout. \n- Dress Code: I recommend at least smart-casual. \n- Cocktails: The cocktails are top notch. I had two drinks: an Old-Fashioned, and their signature cocktail, \"The Commodore\". Both were excellent. \n- Food: Their menu is rather limited and a tad overpriced, through the food itself was prepared and presented well. \n\nI would have given 5 stars, but I waited for 30 mins to get seated for my 7:15 reservation, which was made days in advance. No other knocks otherwise.",
   "Wow! Like stepping into an elegant dream. I don't normally like lobster, but I could down those lobster deviled eggs all day! Be sure to order a Fitzgerald and plan on spending some time here just taking it all in."
  ]
 },
 {
  "name": "Afro Deli & Grill: St. Paul",
  "address": "5 W 7th Pl, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6d780ee4-9334-11ea-93ab-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12788709371492658067",
  "source": "GoogleMaps",
  "reviews": [
   "First and foremost great customer service. The food is fresh and hot and come out relatively fast. We had the lamb gyro and chapati wrap and can not recommend them enough. The fries were seasoned and hot of the fryer. Decent amount of seating and they deliver through third party apps as well. Great for a quick lunch or a bite to eat while in downtown St. Paul.",
   "This has been a go to for a number of years. And for good reason. In the same they have also grown to have another location if I'm not mistaken. Gave this 4 stars instead of 5 because recently the food tastes like it's being less focused on. Hands down though, fries are the best in town. How do you make fries so delicious!?!? Owner is a great person and staff is nice",
   "Parking might be tricky.\nTheir food has wonderful flavors. Chicken Fantastic. Samosas- beware their accompanying \"sauce\" or chutney is very spicy but it serves as a palette cleanser. Their food is authentic and delicious.\n\nDon't forget to try their Spiced tea!!",
   "This spot is the one I always prefer. I go to many restaurants but to this place I  constantly return again and again. The team is very welcoming and the food they offer is so flavorful. I never miss an opportunity to have a decent meal in this place. Highly recommended.",
   "Love this place! Really good food. The Somali spice tea is very good too. Staffs are nice as well."
  ]
 },
 {
  "name": "Gray Duck Tavern",
  "address": "345 Wabasha St N, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6dd2c80c-9334-11ea-b056-14b31f159f22.png",
  "tags": [
   "drink",
   "wander",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10102045449293319318",
  "source": "GoogleMaps",
  "reviews": [
   "I was intrigued by the menu so we decided to check this place out before heading to a show at the Amsterdam Bar. We sat at the bar. I ordered a Minnesota Mule which was not on the menu but the bartender whipped up his own house recipe! We also tried the Old Fashioned and the Ranch Hand (woo-wee, spicy, spicy!) . We ordered the Impossible Burger, Rosemary fries and cheese curds. All of which were pretty good. 4 stars for the cheese curds served with honey AND a house ranch sauce! At first glance this place may seem a little pretentious but trust me, it settles. And one tip: stick to a 2 drink minimum. Those spirits are potent! I'm sure we'll wander back in again at some point!",
   "We dined here only because it was close to our hotel and it looked interesting when searching online. We were so impressed we made dinner reservations for the very next evening as well.\n\nThe Tamarind Chili wings might be the best wings I have ever had. Asian inspired flavours with citrus and a really good kick to finish it off. Absolutely done to perfection.\n\nThe Singapore Broil was prepared exceptionally well. Tender and full of flavour we paired ours with cheesy garlic mashed potatoes and the green beans. The small plate was more than enough for two, with sides.\n\nThe gin and tonic is made with in house tonic. My wife loves Gin and tonic and promises it it absolutely worth it (I am not a fan of Gin). The tonic is made with a hint of lime and it has been perfected.\n\nThe Old Fashioned is done really well. A twist on this cocktail being made with whiskey but the flavour is excellent and the duck ice puts the presentation over the top. I enjoyed two of them during dinner.\n\nGreat food and great location right in the heart of downtown St. Paul.",
   "Stopped by here with my boo for a cocktail after wandering the Winter Carnival.\n\nThe kitchen had just closed at ~10, which was fine since we weren't looking for food. The place was JUMPING with people. We sat at the bar, and the bartenders provided pretty quick service (greet, make drinks, get tab) in spite of the crowd. Not the friendliest service, but that can't be held against anyone because - and I can't overstate this - the tavern was super busy.\n\nWe each got a signature cocktail, and we both enjoyed our drinks. Atmosphere was young people, like 21-24. My guy and I aren't that much older, but weren't huge fans of the college-kids-being-\"classy\" vibe from the other patrons.\n\nBut drinks were good and staff was efficient.",
   "They had great cocktails! I'm vegan, so for dinner I got the Impossible Burger with no cheese and no bun. My burger came wrapped  in a lettuce bun which was fantastic and thoughtful. I did the green beans as a side order. My husband got the prime rib, and said everything was perfect. We will for sure be back again, and love to see a place that can accommodate different dietary restrictions!",
   "I visit this lovely place  a lot! This is my favorite spot to grab a bite.  I go there routinely. The cooking is great, the team is helpful and the prices are decent. I enjoy going in this restaurant for a good meal."
  ]
 },
 {
  "name": "Dark Horse Bar & Eatery",
  "address": "250 E 7th St, St Paul, MN 55101, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6e4bf022-9334-11ea-b322-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11954991165298696168",
  "source": "GoogleMaps",
  "reviews": [
   "Amazed by the late night happy hour, 11p-2am! Food was so tasty! Service was great! \nCute and elegant atmosphere!",
   "Very good pizza and plenty of tap beers that go well with it. The staff is courteous an always polite. The menu has some very good selections and the kitchen is open until closing. 🍷\"Dig in and meet a new friend\" at the Dark 🐎Horse! 🍻",
   "Monday Night at the Dark Horse includes a two topping pizza and a bottle of wine for $25. You can't beat that. The pizza was amazingly delicious. This was our second time coming here and we will be going back alot more. Great atmosphere and the service is the best I've had so far.",
   "Delicious happy hour menu. Christina was quick and attentive. The fries are spectacular!!",
   "We ended up here when plans at another restaurant fell through.   And it was wonderful.  Our food was great, as was the beer selection.   The service was top notch too."
  ]
 },
 {
  "name": "Bar Brigade",
  "address": "470 Cleveland Ave S, St Paul, MN 55105, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6ec9369e-9334-11ea-b11e-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "foodie",
   "affordable",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16707798749043113241",
  "source": "GoogleMaps",
  "reviews": [
   "Great people take care of you here at Bar Brigade. Everything is made in house. Coffee anyway you like. I prefer the creme with coffee haha ;) it feels pleasant and warm even in Winter.",
   "Last week was the first time in this good restaurant. But It is definitely not the last. We enjoyed the evening very much with the generous service, with the finest  cuisine and fine drinks and with the decent charge. We will definitely return there in a short time.",
   "I had the wild boar bourguignon\n\nHIGHLY RECOMMENDED!\n\nFork tender!\n\nThe wait staff was super friendly and very knowledgeable about what they would recommend.\n\nFor sure will be going back!\n\nA small restaurant, big on taste!",
   "One of our favorite places in St. Paul. Of you co sider yourself a \"foodie\", you must stop here. Fine dining at an affordable price nestled in a neighborhood. There is a very unassuming sign in front, which does not hint at the fabulous experience you will have inside. There is street parking, but, it has never been an issue for us.",
   "Great little French restaurant! The atmosphere was intimate and cozy. Our service was great. We started with a goat cheese small plate, had lobster crepes and smoked trout for entrees, and the vanilla pot de creme for dessert. The app and entrees were DELICIOUS. The pot de creme was fine but I wouldn't order it again (Bar Brigade, please replace this dessert item with something else that stands up to the rest of the incredible food we had last night). I'm still giving 5 stars because overall, our experience was fantastic.Definitely coming again!"
  ]
 },
 {
  "name": "Babani's Kurdish Restaurant",
  "address": "32 E Fillmore Ave, St Paul, MN 55107, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6f278368-9334-11ea-b1f2-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8583935093506326196",
  "source": "GoogleMaps",
  "reviews": [
   "I go with my wife to this great restaurant quite often! This is my favorite restaurant to to have a good dinner.  I go to this spot at least once a month. The food is very tasty, the team is helpful and the price is decent. I enjoy eating in this place over a tasty dinner.",
   "Very friendly.  Quick service.  Amazing food!",
   "I'm always up for something different and have sampled food from all parts of the world. My roommate and I had an early dinner here and weren't too enthused. I tried a lemon flavored soup that was a bit too much for me. Our main courses were good but didn't have a kick, they were \"safe\". I asked for hot sauce or something to give it a lift but they didn't have anything. The place is cute abd clean and our server was good.",
   "Fabulous food. Fast service. Competent staff. Reasonable prices. Great location. Definitely a place to go.",
   "Awesome place, great food"
  ]
 },
 {
  "name": "Stewart's",
  "address": "128 Cleveland Ave N, St Paul, MN 55104, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6f85822e-9334-11ea-8e70-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "family",
   "drink",
   "unique",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15152793893631636885",
  "source": "GoogleMaps",
  "reviews": [
   "It’s difficult to place what kind of food Stewart’s is because there’s quite a variety. Some Asian, traditional American, and some Jamaican. Small little place under an apartment building, but super cute. The waitstaff was quick and polite. All the food was fresh and delicious. Personal favorite was the cauliflower gratin.",
   "A cozy little place with great food and great service. I would highly recommend getting the buffalo brussel sprouts. I also got the southwest chicken breast. This is an ideal spot for a date night.",
   "This place is so wonderful.  I'm hesitant to share because I think it may be a secret love for regulars. We enjoyed a pork shank that evoked warm family nostalgia, buffalo style Brussels, tender Korean fried chicken and savory mussels.",
   "In love with this restaurant. I've driven by it so many times but never realized how nice it was inside and that they had such good and unique food! We started with one of the favorites of the restaurant, the Buffalo Brussels Sprouts. These are a must. If you don't like veggies or greens, these will change your life. We also shared the walleye dinner and a special of the night, a type of tostada with crab, radishes, and avo spread. We also had their margarita drink which had a kick to it and was strong!  One of my new favorite places in St Paul.",
   "Nice ambiance and based on other reviews I read up on here, I had high hopes that the food would be on point -- disappointingly, the items we ordered we ordered were just \"meh\". \n\nKorean Fries: Wasn't horrible but nothing to be excited about either. The dips were just ok as well. Overall, the fries would've tasted better if they didn't saturate it with sodium & spices. 2/5 Stars.\n\nSzechuan Noodles: This was utter misery! A bad attempt to fuse kimchi with some undercooked noodles, shiitake mushrooms & leathery tofu that simply didn't mesh!!! The tangy-acidity of either the kimchi or the sauce that they used was overpowering, leaving no room for any other flavors. 0/5 Stars.\n\nPork Cheeks: Pork was really tender with jalapeno grits which add a unique twist of flavor & texture. The pork cuts though tender, were a tad too salty for my taste. Ease up on the salt and this may have earned 4 stars.  3/5 Stars\n\nWinter Spiced Bread Pudding: The best item out of the lot. Pudding bread topped with butterscotch sauce, spices and crunchy, candied almond clusters. 4/5 Stars \n\nWould I go again? Likely not. Or if I ever did, I would very much make sure not to order any of the above items again except for the Spiced Bread Pudding."
  ]
 },
 {
  "name": "Yarusso Bros Italian Restaurant",
  "address": "635 Payne Ave, St Paul, MN 55130, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/6fde29f4-9334-11ea-b2d7-14b31f159f22.png",
  "tags": [
   "historic",
   "food",
   "walk",
   "brewery",
   "kids",
   "free",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=15639487639420773322",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I decided to go out for my birthday and he wanted to take me somewhere slightly outside of the city. This little patch of heaven, located in a small neighborhood, was well worth the drive. The pictures do not accurately depict how massive these plates are. The food is fantastic, the service is incredible and the amount for cost is jaw dropping. The price on the menu that you see is well worth it. I highly recommend this place and will be bringing everyone I know to this historic restaurant.",
   "Yarusso brothers is a gem! Freddy Yarusso, the last remaining brother has carried on the tradition and friendliness of this restaurant. It is located on the east side of St. Paul, just down the street from the old Hamms brewery and it is a place not to miss. The red sauce is amazing and the portions are very good so you will not be disappointed. When you walk in you feel like you are travelling back in time, like you are in a movie or something. And maybe it's because he has The Godfather playing constantly. If you are in the area and are hungry for some good Italian, check this place out!",
   "We enjoy to go out. Last night we  visited this superb restaurant which friends recommended to us. We passed a delightful experience there with superb meal and a well-trained crew and a talented  cuisine. We  added this fine restaurant in our phone list  and we shall definitely come back very soon. We warmly recommend.",
   "Great Italian restaurant.  Kids eat free on Sundays.\n\nTry the \"Sloppy Dago with Cheese\".  The fried ravioli are amazing for an appetizer.",
   "two days ago was our first time we visited this good restaurant. But It is absolutely not the last time. We enjoyed the evening a lot with the good service, with the high quality  cuisine and fine drinks and with the friendly pay. We will absolutely come back in a short time."
  ]
 },
 {
  "name": "PUBLIC kitchen + bar",
  "address": "229 6th St E, St Paul, MN 55101, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7048f9d0-9334-11ea-9ea9-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "kids",
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "drink",
   "comforting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3795175233329922512",
  "source": "GoogleMaps",
  "reviews": [
   "very quiet evening,a well dress friendly male host greet us as soon as we open the door. Very pretty roomy restaurant would be good for party. The spicy salsa under the grilled are delicious with seafoods. Steaks are medium well as what they respected. Dessert just alright through.",
   "The food was good.  A few items great.  Cacio E Pepe was terrific, the asparagus was wonderful.  The blueberry sauces on desserts were extremely flavorful.  Unfortunately the kitchen was amazingly slow, despite the dining room being quite not full.  One meal, lobster mac and cheese was straight up cold.  And two meals came out 5+ minutes later than the others, after already experiencing a long wait.  It would have been okay if it was just adults, but we had kids and the extra 20+ minutes just didn't work.  Appetizer menu sounded great, but the prices scared us off.  The drink menu was good, decent array of great craft beer.  There were odd things no longer available though, both on the food and beverage menus.  I'm open to try again, but if the kitchen is that slow again...",
   "Great vibes and super welcoming service. The food was crisp and yummy. Will easily recommend this place to others. Fair rates and generous portions. Keep it up.",
   "Clean. Nice decor. Great service. Delicious food. Awesome atmosphere. Wonderful time.  Oh and bottomless mimosas at brunch on weekends. How could you not love this place. Can’t wait to go back 🤗",
   "First and foremost they seated us 30 minutes early because my girlfriend and I showed up much earlier than the rest of our group which was great. Then they let us order our bottomless mimosas early so we got to drink while we waited for the rest of our group! The atmosphere was very calming and it gave off a comforting vibe. The food was really good to! Our mimosas came in wine glasses so they were big!! Never once finished my mimosa before they refilled it which was wonderful!\nThe only complaint I had was they seem to put a big char on all their steaks. The steak was cooked perfectly (medium rare) in the middle but the outside of all our steaks were charred a bit too much for our preference. Besides that everything was delicious!"
  ]
 },
 {
  "name": "Agelgil Ethiopian Restaurant (St. Paul, MN)",
  "address": "2585 7th St W, St Paul, MN 55116, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/70a264ba-9334-11ea-b751-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2227405411691366131",
  "source": "GoogleMaps",
  "reviews": [
   "I come to this special place every couple of days  as I love the good mood that is exist in this restaurant. The staff is exceptionally loyal and experienced. The service is deeply efficient. Not to mention, the food you eat is highly distinguished. I ate there many times and I was always delighted. The expense is modest. I recommend this restaurant to all my friends.",
   "I ordered takeout for myself - beef and veggie.  This included a bunch of different dishes that were all fantastic.  My meal stretched into 3 - so much food! Lovely lady took my order and credit card over the phone and they brought it to my car outside when I called to say I had arrived.",
   "Great food. The atmosphere is cater more towards adult only. I had two young children with me. The service was nice.",
   "You guys gotta be struggling. How is your rice dry and food barely seasoned?!? All you hear while sitting in the restaurant is the taxi men getting drunk and shooting pool.  At best you get a 2 out of 5 simply because the only person working the front of the house (waitress/ bartender/ hostess) was a  very pleasant lady.",
   "I went here a while ago, and I really needed to think about how i feel about the place. My overall consensus is that it is awesome. The lovely waitress who didn't understand what we were doing there was so kind. Someone I was with wanted a side order of cottage cheese\" eww idk why\" . But to make sure that it would be like the waitress brought a small sample of it to try so we didn't waste our money which I really appreciated.  We got this dish the was like a Bready, meaty, and peppery mixture. Inside the mixture had cut up pieces of the same bread meant to consume the dish with. Very good, huge portions. Total bill was like 13 bucks and this plate could feed 3-5 people. We got #26/27."
  ]
 },
 {
  "name": "Herbie's On The Park",
  "address": "317 Washington St, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7105e1ae-9334-11ea-8869-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17455321439420314098",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice restaurant to visit after going to the River Center. This place had a nice environment and some hockey stuff on display. The service was a little slow but the food was great. I definitely recommend this place. The pretzel appetizer was fantastic and so was my cobb salad.",
   "I’ve seen some reviews stating that service is slow or nonexistent. I did not see this. We were in last  Saturday before a MN Wild game. We were greeted immediately and at. We were also brought water and our beverage orders were taken. The place was increasingly busy and soon the bar area was packed. We never felt neglected and our server was attentive.\n\nThe food was very good. We had the brussel sprouts, scallop pasta, risotto and flat bread pizza. All were very tasty. Our cocktails were also very tasty, but not very strong. We’d definitely come back. We had great service, great food and decent drinks. The atmosphere is really nice with the fireplace.",
   "Food is good, more-so gourmet with a limited 1-page pricey menu, but you pay for location.  Atmosphere is casual.  Service during our visit wasn’t up to par. Not going back.",
   "Went here during lunchtime on a Sunday and had to order from the brunch menu. Food was okay, just very limited choices. Server was excellent and very nice ambience!",
   "To be honest I haven't tried their food. This is my after Wild game stop. They make great old fashions if you're interested. I always request the girl in the gold rim glasses as she is very attention oriented server."
  ]
 },
 {
  "name": "Caffe Biaggio",
  "address": "2356 University Ave W, St Paul, MN 55114, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/715bf25a-9334-11ea-a098-14b31f159f22.png",
  "tags": [
   "delicious",
   "foodie",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2605268710305139060",
  "source": "GoogleMaps",
  "reviews": [
   "WOW!!!  I'm not a big Valentine's date night kind of guy, but Caffe Biaggio may have changed that for good.  Their special Valentine's Day seating last night was TOTALLY AWESOME!  \n\nWe try to dine at Caffe Biaggio a couple times a year and should be going a lot more often.  They are the very BEST Italian restaurant in the Twin Cities.  Last nights seating included 3 great entrees . . . Steak and Lobster,  Salmon and one of their signature regular menu items Gnocchi in red sauce.  3 of the 4 of us each had a different entree and they were all perfectly done. The appetizer, salad and dessert were also perfect and delicious.\n\nService at Caffe Biaggio is always top notch and last night was no different.  \n\nCaffe Biaggio continues to be a gem.  I would recommend it to everyone.  For groups, for special occasions and especially for date night.  If you haven't been, and you consider yourself a foodie, you've missed out on one of the best experiences in the Twin Cities!  Go!",
   "First time. Linguine with shrimp in a light lemon cream sauce. Delicious! Good ratio of shrimp to broccoli to pasta. One recommendation, less onion and more lemon.",
   "We met with friends at this place for a meeting. we heard about this spot from a lot of people.  Well, it was a winning. the staff members were so friendly and we had an excellent feeling. The food was just great. We loved this spot a lot and we will visit this place again. Highly recommended.",
   "I give this establishment a three stars. This is a beautiful establishment. The ambience and feel is delightful. The service was great. The waiter who served me was very friendly and professional. The only thing that stops me from giving this establishment a four or five is the food. I ordered spaghetti and meatballs. The meatballs were slightly dry and the sauce was watery. The meatballs had a great kick to it but it was ruined by the dryness of the meatballs. Also, the watery sauce lowered the quality of the dish. My dish was a letdown after the great service and atmosphere.",
   "What great ambiance at this place. Tim was our server and he was very helpful with suggesting dishes. I had lobster risotto and it was great."
  ]
 },
 {
  "name": "Osteria I Nonni",
  "address": "981 Sibley Memorial Hwy, St Paul, MN 55118, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/71a6dd24-9334-11ea-8e4e-14b31f159f22.png",
  "tags": [
   "learn",
   "cheap",
   "eat",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10974252040161407538",
  "source": "GoogleMaps",
  "reviews": [
   "It’s a mediocre restaurant with average quality food.They do not bake their bread,instead a cheap supermarket version is served.\nDishes are nothing to remember.\nIf table is booked in advance they can find a good one.We did so and our seats were very nice.\nWe do not recommend to dine there for any special occasion like birthday or New Year’s Eve one - there is no ambience,no music.The interior is ordinary,dull and boring.\nWe would recommend the owner to travel abroad and learn how to make a restaurant truly Italian.",
   "Top notch Italian Restaurant in MSP.  They have plenty of vegetarian options which made me feel at home. Their deserts are drool worthy and you are bound to have withdrawal symptoms long after your dinner.",
   "I get to eat here a lot since I work in the area. I must say their customer service is always good and they keep the spot neat constantly. Prices are convenient and they serve big portions.",
   "A fine dining Italian restaurant, not family style like Bucas, is a great experience. We spent alittle over two hours here enjoying the food and friendly staff. The courses are separated by classic Italian courses, however, are not meant to be a four course dinner. Each dish is a sufficient meal. The portions are typical fine dining portions. The cooking here was great, very few cooking errors or mistakes. In a party of six, everyone enjoyed their food and atmosphere. The lighting can be considered alittle dark at night. Definitely worth a revisit and would recommend the gnocchi.",
   "Fantastic food, very warm atmosphere and excellent service. This is s great date night spot. A hidden gem?!?"
  ]
 },
 {
  "name": "Hyacinth",
  "address": "790 Grand Ave, St Paul, MN 55105, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/71fb8e2e-9334-11ea-8b8d-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5909114292342679181",
  "source": "GoogleMaps",
  "reviews": [
   "This is a very cute bistro style restaurant. We made reservations last minute and were able to do an early dinner. Service was attentive without hovering—we each had a pasta and shared the snap pea and burrata salad. The salad was amazing, really light yet well seasoned. The pastas were both good—very much a homemade feel. They were good but not great, but I’d like to return and try out some of their entrees. Considering the tip is factored into the prices, the prices are pretty fair here. Finally, I should mention the decor is wonderful, really simple but cute. Would definitely visit again!",
   "Cozy casual atmosphere with great food!! Meatball was amazing 🤤 Recommend making a reservation from their website. Good place for a date - nice but not fancy. Prices are reasonable considering they include gratuity.",
   "Superb service, lovely atmosphere, and one of the best meals I've had in the Twin Cities. Every dish we had was amazing - the celery salad (one of the most unique and refreshing salads, even for my husband who doesn't eat salad often) the bucatini (totally worth the hype from the Star Tribune), the risotto (unique in many ways, flavors off the chart), and a chocolate mouse desert. Everything was perfect. I want to go back asap to try everything else! Also appreciate that they include gratuity in the cost of the dinner.",
   "I've been meaning to try Hyacinth for some time now and I'm glad I did. It's a small restaurant, small menu and small plates. We liked everything we tried but nothing stood out as the best dish of the night. I'll be excited to come back when they change their menu in the future.",
   "This is a truly great restaurant. Everything we had was great. The pasta is seasoned and cooked perfectly and the service was excellent. This is a Bachelor Farmer level of food and service imo. It's pricey but worth it for a special occasion."
  ]
 },
 {
  "name": "Magnolias Restaurant",
  "address": "1081 Payne Ave, St Paul, MN 55130, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7256577e-9334-11ea-a426-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=491065601448122491",
  "source": "GoogleMaps",
  "reviews": [
   "The steak was nice and simple - just salt and pepper and cooked to perfection. This steak was just cooked so well! So if you're looking for just a nice piece of steak without the chef trying to be complicated with all that extra flavor and spice, this is it! Prices are great and diner has an 80's feel/atmosphere to it.",
   "Good home cooking! Small place, but great prices and great food!",
   "I love this place. My favorite neighborhood diner. It's not new or fancy, but it is cozy.  Good food, great prices and friendly staff. Not a ton of seating, so you may have a wait on peak days and hours. My girlfriend and I mainly come for breakfast. Good coffee too. Check it out.",
   "I didn't hate it,  lol. The service and food was fine. Didn't stand out. In their defense the French Toast is awesome!! The rest of the meal was average. Our server was polite and prompt",
   "Everything was alright. It seems like a basic diner. Most of the food is bland and some of it tasted extremely processed. The fish was freshly caught and fried. The seating is outdated and was uncomfortable for the handicapped or overweight in our group.\n\nIn response to owner, I mean that is pretty much what I said. A 3 star literally means \"It's okay.\" No one is blaming you for picking a small space for your restaurant, it's just important for some people to know that they may be uncomfortable or in pain before they decide to come there. It's mainly the gravy and soup pictured that tasted processed. Made from scratch can mean a lot of things, but even if it was made from mostly fresh ingredients, those two things didn't taste very good to us. If you hear this from multiple patrons maybe you can know what to tweak. Good fish though!"
  ]
 },
 {
  "name": "Boca Chica | Restaurante Mexicano & Cantina",
  "address": "11 Cesar Chavez St, St Paul, MN 55107, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/72b36bba-9334-11ea-9080-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "delicious",
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6381044654261651800",
  "source": "GoogleMaps",
  "reviews": [
   "Very good authentic and tex mex food - got the opportunity to try the buffet and it did not disappoint. Lots of seating and bar is a good place for lunch. Jose did a great job helping to order and immediately suggested a margarita and a buffet - bother were outstanding. Family owned and you can tell by their level of professionalism and information. Really happy I went and cannot wait to go back!",
   "This place has amazing food and a great selection of it. The complimentary chips and salsa before dinner are some of the best I've had (top 3)! Warning one of the salsas has a little zing to it but the other is spicy not to spicy though (although I love spicy food)! I had the Enchiladas Verde and what can I say, close your eyes picture the best enchiladas Verde and that's what I got.",
   "I celebrated my nomination last night in this delicious restaurant. I am glad to say that it was a marvelous evening and the venue was clearly the reason for this outstanding celebration. The team  cooperated in a very nice way, the cuisine was extremely good and my friends were so  thrilled. We shall definitely return for more celebrations. Thank you very much.",
   "I have only been there for lunch time buffet going on 3 years now. You don't know what your getting everyday on about 1/3 of it.They change it up. Good selection. It's more on the authentic side, and not too spicy unless u make it that way.  Nice place inside, its a quick get in, eat and get back to work thing for me. Good service and nice people. Check it out.",
   "I've been enjoying Boca Chica for more than 30 years. The food is always delicious; the location is inviting and comfortable. Today was no different. I opted for fajitas this afternoon but, if you can go for lunch during the week, I'd recommend the lunch buffet. Their chicken enchiladas are also top notch."
  ]
 },
 {
  "name": "M ST. Cafe",
  "address": "350 N Market St, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/730c2c38-9334-11ea-8496-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9903485061463826228",
  "source": "GoogleMaps",
  "reviews": [
   "Always a fantastic buffet on the holidays...cold buffet, soup, breakfast items, chef carved meats station, made-to-order omelette station and large seasonal dessert table...the servers are always pleasant, even though working a holiday, live piano stylings in the background...never a rush to have you leave, so they can reset your table...if you leave hungry, it's your own fault...they can accommodate couples to groups of over twenty, but reservations are a must...I've been doing the special occasion buffets here for several years, my #1 go-to in St. Paul & the East Metro...",
   "Went for Sunday brunch buffet with the friends I invited. We all enjoyed the food. Everything was great. The parking cost was the only downer",
   "Buffets here are always amazing. Different selections, and everything is always spot on. Lots of care is given to every dish. And this does not end up being wedding style food, or food that just sits in pans that gets old. Great buffet experience; we've just never ordered from the menu.",
   "Service is fast and friendly. Tried the northwoods omelet (asparagus, mushrooms, gruyere) and it was great. The hashbrowns it came with were also wonderful. Would recommend.",
   "Great buffet options for going out on Thanksgiving or Christmas."
  ]
 },
 {
  "name": "Carmelo's Ristorante",
  "address": "238 Snelling Ave S, St Paul, MN 55105, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/73614d00-9334-11ea-b3b5-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9522859448111707835",
  "source": "GoogleMaps",
  "reviews": [
   "In my opinion, if an Italian restaurant can't make an awesome plate of spaghetti and meatballs, it's not worth trying anything else on the menu. Well, this is just about the best spaghetti you're going to find anywhere. Homemade noodles, meatballs which hold together well but are still a little bouncy, and sauce so good I'm tempted to request it as a cup of soup. Great job, Carmelo's!",
   "All the soups and bread are homemade and delicious!  My favorite entrees are the Chicken Milanese, spaghetti and meatballs, and ravioli Carmelo. It packs up and travels well, so is great for takeout or delivery. \n\nOnly suggestion, offer desserts for delivery if possible!",
   "Great food great environment. I thought service was a little slow since there was only 1 server so if you're in a rush it's not ideal. But otherwise they're friendly and food taste fresh and authentic. Love it and will come back later",
   "We Love Carmelo’s. Hardest working wait staff, with amazing customer service skills. Quiet, lovely place with Fantastic Food. We are sure lucky Carmelo’s is on the neighborhood. Thank You!!",
   "A white table cloth & candlelit coursed Italian ristorante with gentle, mellow flavored.  I liked the atmosphere and wine list but the food we had tonight needed more flavor...and salt.  I did looking forward to bread with a flavored oil dip but they had pre-packaged butter bars instead, although the bread was super fluffy, soft and delicious with the butter.  The calamari was a little too soft and not crispy enough and didn't taste salted at all... but perhaps the lemon aioli is supposed to make up for it?  A slight disappointment, however, overall, the foods would be good for those who are severely watching their salt intake.  Service was good, friendly and attentive.  \n*Shrimp Garlic Aglio Olio, Shrimp Macalester & Calamari appetizer. \n*Drinks: a mixed white comprised of chardonnay, sauvignon blanc, voigner and moscato: less dry with a hint of sweetness but with a nice, lingering taste.  I normally don't like any sweet white but this one was tasty.  And hubby's italian beer: light."
  ]
 },
 {
  "name": "Black Sheep Coal Fired Pizza",
  "address": "512 Robert St N, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/73b4281a-9334-11ea-abe2-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "walking",
   "family",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=14430903716077825990",
  "source": "GoogleMaps",
  "reviews": [
   "Great service every time, whether it’s from the servers or the bartenders. Great food every time, too. I’d highly recommend this place to anyone who wants a fun, tasty, and healthier option to traditional pizza. They also now have a full bar. The only flaw is the Sicilian pizza. It’s just an expensive cheese pizza.",
   "We all loved our experience here!  Atmosphere, food, and service were AMAZING!  We each got our own build your own pizza and everyone loved theirs.   Would highly recommend trying this place, plus it’s within walking distance of the Saints ball field...so dinner before the game!!",
   "Wonderful experience every time there. Did the drive up last night, met  Sara the Manager! Her attitude and appreciation for we the customers supporting them during this time was made very evident!! The family will be back as often as possible...hopefully sooner than later.",
   "I feel so bad because I just found out about this place a few months ago, and I had been renting a practice space underneath for the past three years. So far, this is the best pizza I've had in Minnesota (and I eat pizza very regularly). The inside has a cool hipster vibe. Give it a shot you wont be disappointed.",
   "What an absolutely wonderful pizza. I went early on a Saturday evening, so it was pretty busy. In spite of that, we never felt rushed and we never felt ignored. I had the #1, a nice, simple cheese pizza and I thoroughly enjoyed it. The crust had a wonderful crisp to it and the cheese was salty and fresh. My only complaint, and it is a small one, is that the tomato sauce was fairly transparent in flavor. It felt like it massive needed a little more time to simmer, or a little more seasoning, but that is splitting hairs.\n\nGreat job Black Sheep! I will be back, and I will be recommending you to my friends."
  ]
 },
 {
  "name": "Fasika Restaurant",
  "address": "510 Snelling Ave N, St Paul, MN 55104, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/740ccfa6-9334-11ea-a72b-14b31f159f22.png",
  "tags": [
   "food",
   "affordable",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10199463971679775351",
  "source": "GoogleMaps",
  "reviews": [
   "A simple place that caters to a variety of clientele. We tried the vegetarian sampler and it was good.  Saw people there from different ethnic backgrounds enjoying their meals. Also ordered coffee and was not disappointed. Lunch and coffee for 2 for a total of $25.00 including tip.",
   "Being an Indian, I am a big fan of spicy food and Ethiopian food is my new favorite!! I had the veggie sampler and my friend had the chicken. The taste was soooo good and the price is very affordable!!",
   "THE FOOD IS AMAZING!!! Servers need better customer service",
   "Warm greeting from several staff as soon as we entered.  Very nice written welcome from Fasika on Page 1 of the menu. Many entrees to select on the menu and our server helped guide us navigate the options. The combination entrees are very large and can easily serve two people. We had the beef combo and the flavor was excellent! We had to work to finish it all and we did not quite succeed.  The servers are friendly, happy and attentive. The dining room has plenty of space. There was a family with an infant and 3 toddlers across the room and they had plenty of space around a large table. We will definitely be back and we will bring friends with us!  We live in Minnetonka and yes, Fasika’s is worth the drive!",
   "Busy place, slow paced service, but as there is only one server covering everything, that can be forgiven. Food was hot and fresh but my dish limited to just cabbage and grape leaf. I ate at 6pm and many dishes--including coffee--were off the menu. There is another traditional ethnic restaurant one block north with a better space and pricing. I would venture there first before returning to Fasika."
  ]
 },
 {
  "name": "Brunson's Pub",
  "address": "956 Payne Ave, St Paul, MN 55130, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/74927adc-9334-11ea-8e5a-14b31f159f22.png",
  "tags": [
   "walk",
   "free",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5655987910706736959",
  "source": "GoogleMaps",
  "reviews": [
   "I’ve loved Brunson’s Pub for a long time, it’s hard not to. You instantly feel comfortable when you walk into their space and their service is excellent. We’ve always had friendly servers who have great recommendations. Their food is phenomenal... I can’t say enough about the Pulled Bacon BLT (even with needing a gluten free bun). What motivated me to leave a review now is their exceptional service during the Stay at Home orders. It was easy to place our order over the phone and they were outside within seconds of pulling into the parking lot. The food was well packaged, and was still hot by the time we got home. I miss going out to restaurants but this was such a great experience tonight that I appreciate Brunson’s on a whole new level. Thank you for making our night!",
   "Fantastic service! Great cheese curds, the honey and balsamic aioli dips sound like a weird combo, but they work somehow- and it's delicious. I got the #No Payne no gain burger and my husband got the Reuben burger, both were great.",
   "Great food and good service.  We tried a few of their burgers and all were good.  I wasn't too sure when I saw that their \"wings\" were thighs, but it was great.  Cooked perfectly! And they were nice and crunchy with the dry rub.  They had a great beer list and happy hour specials too.  Will definitely return.",
   "Amazing food and even better people. We love stopping by here for apps, dinner, or even a few drinks. The staff is always tentative and very nice. Making this a usual neighborhood spot for us!",
   "Soooo, we knew we were full, but we just kept eating, and eating. Now we are one wafer thin mint away... We always split the curds. Tonight we were craving their fish and chips.  Stellar. Their serving size is plenty, so we decided to split the fish and a berry salad.  Should not have gotten the full size salad. Is pretty busy,  so relax knowing you will probably wait a bit.  SUPER nice staff."
  ]
 },
 {
  "name": "The Lexington",
  "address": "1096 Grand Ave, St Paul, MN 55105, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/74ead480-9334-11ea-98e0-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7545362969696352491",
  "source": "GoogleMaps",
  "reviews": [
   "This is an old school bar and restaurant. Think leather easy chairs, soft lighting, tons of rooms and a jazz combo on the weekend. There are two different bars and a specific bar menu, though the full menu is available at the bar also. Tiny parking lot, valet is available. We've been twice and had an amazingly delicious dinner as well as a great night with friends in the bar. Attracts an older crowd, dress is everything from dressy to track suits. Given the prices, I'd dress up a bit. Drinks are strong and the bar food is good for a group. Only complaint is that we got a very loud table next to the bar even after making a reservation. Lots of room for big dinner groups.",
   "Food was great but the service was amazing. Chef went out of his way and made us steak sandwiches from left overs. Out of town guest and would highly recommend.",
   "I just love this place! The ambience is great, and I have had great service every time I've been there. All the employees really seem to enjoy working there. I've only come in for drinks and usually enjoy being belly up and people watching.  Such a diverse crowd. Very classy place, and one of my new favorite spots in St Paul. I'll definitely be back soon!",
   "Another delightful dinner on a very busy Valentine’s Day evening. Food was outstanding. Service was impeccable. The owner is always around to make sure things are right. Definitely worth treating yourself once in awhile. A tip, for a quiet evening ask to reserve a table in the dining room and not the bar. The bar is a fun atmosphere but quite loud.",
   "Expensive but excellent. We really liked the sriracha deviled egg and their burger is excellent. We like to sit at the bar and watch the food go by while we eat and imbibe the cocktails."
  ]
 },
 {
  "name": "The Bulldog Lowertown",
  "address": "237 6th St E, St Paul, MN 55101, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7543c9de-9334-11ea-9c95-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=13528608539129420365",
  "source": "GoogleMaps",
  "reviews": [
   "We visited here twice on weekend of 8/9/19.  Once on a Friday and on a Sunday.   I can say on a Sunday, best place to go downtown.  We went through several different places, and this one was the place to be.   We enjoyed to food, atmosphere and wait staff.",
   "I stopped at the restaurant on my way to a Saint's baseball game ... Such a nice place and atmosphere. The service was excellent and we were a big party. The menu has great selections; try the spicy hamburgers; that is if you enjoy spicy food. The restaurant has outdoor seating.",
   "We went here for my best friends birthday. A group of 11 happy celebratory girls. 10 minutes in we were all shushed from the bartender for being too loud. Needless to say it ruined the happy mood and we got our tab and left immediately to Barrio next door. We were happy to take our money elsewhere and not get scolded for having a great time. Didn’t realize The Bulldog was a retirement home.",
   "The cheese curds were excellent. Our waitress was great. They have a great selection of craft beers.  Just wasn't impressed with the actual entrees.",
   "I love their philly cheese steaks, the best in the twin cities. Very cozy atmosphere and always a good time to bring a date or have some fun with the girls at the bar. When it’s nice out it’s a very cute place to take a romantic walk after in the little park across the street."
  ]
 },
 {
  "name": "Bennett's Chop & Railhouse",
  "address": "1305 7th St W, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/759df824-9334-11ea-b9c7-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "eat",
   "free",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17612738416423146797",
  "source": "GoogleMaps",
  "reviews": [
   "Waitress was really nice. The avocado crab bread was delicious. My tomahawk steak med/rare was dry with no flavor. Didn't really seem like it was a 20oz. Maybe a 16oz. Usually when i eat steak i don't really use A1 but i had to because lack of flavor and dryness. The loaded potato only had cream and like 4 specks of bacon. My lady got the trio medallion she said hers tasted dry right away. The salad was so small and plain. Maybe try the ribs or pasta if i ever go again. Definitely not a place i would get a steak again.  Ordered a Purple Rain. It was really sweet but barely alcohol didn't even catch a buzz and i only drink like once a month. I gave the three stars because the waitress was really nice.",
   "Very tasty food but most definitely not the place to go on a budget. The free shuttle to the Wild game was wonderful! We will definitely be back!",
   "Got there to our 9:15 p.m. reservation for Saint Valentine's Day night with my long dress coat and no coat check. People were hanging their coats on the backs of their chairs. Mine would have been sitting half on the floor. Libby the hostess helped me resolve this by allowing me to hang it at the hostess stand! 🙂 Great cuts of steak! 🥩I had the Tomahawk! It had some fat on it too that I enjoyed with the delicious perfectly cooked meat! My two dogs got a little taste as well!🐺🐶  I picked it as I saw it was one of their specialties.🍸 I was glad their menu labeled things that way. The vegetable was green beans. They were cooked to perfection but there were so few. Molly our waitress immediately noticed this and rectified it! Everything went smoothly until the bartender started playing very unromantic hip hop, I think.🎵 Fortunately, it was towards the end of our meal and Molly, our waitress smoothed things out.😇 Another very helpful and patient waitress took many pictures of my Valentine and me💘 with my confusing camera, to commemorate the evening. Great staff and great chops! Thank you! My date was very pleased with the whole evening!",
   "Great experience.  The staff were fantastic, friendly and fast. The food was excellent. I had an issue with my dish. Not only did they make it right, they comp'd us a desert to boot. Just fantastic all around. Highly recommended. Definitely going back.",
   "Craved a good Steak and they delivered.  The ribeye was juicy and flavorful without the salty/sodium injected taste.  The New York Strip was thick and tasty. The service was perfect, friendly and laid back."
  ]
 },
 {
  "name": "Salut Bar Americain",
  "address": "917 Grand Ave, St Paul, MN 55105, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/75f1bd9e-9334-11ea-870f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1474098499423829854",
  "source": "GoogleMaps",
  "reviews": [
   "I come here often with my friends for brunch. I love the egg white omelet. It's fluffy, delicious and very filling. The chefs do it right every time! I love the ambience here. Clean, fresh and a great way to start the weekend.",
   "Salut has great service and a big menu that can satisfy anyone. It’s a fancy feeling restaurant with a local flair and the food is consistent and always has been good. The steak sandwich is one of the staples in my opinion but you can’t really go wrong regardless of what you order.",
   "Haven't been  there for years, we just happened to be in the neighborhood,  glad we were, such great ambience,  waiter was very thoughtful, love being able to see into the kitchen. Feel at home. Looking forward to going back. Brunch looks like a good idea! Great cooks, very tasty. Thank you.",
   "First time at this fabulous find for lunch.  Driving down Grand looking for a place to stop we saw the word Salute so decided to take a chance and boy are we glad we did.  Cozy and inviting decor and very friendly staff.  A diverse but not overly large menu had something for everyone in our group. Seafood and chicken crepes and the burger which was one of the best ever plus a lovely bottle of wine made our day.  We will definitely be back and tell others of our find.",
   "Food was outstanding. The quality of the food is five stars and the presentation is also super. Service was very good - even though our server had a large party to take care of in addition to ours, she was on top of everything. The ambiance flexes easily, casual to formal.  And save room for dessert because it's a must!"
  ]
 },
 {
  "name": "Sakura Restaurant & Bar",
  "address": "350 St Peter St #195, St Paul, MN 55102, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7652f734-9334-11ea-b2ef-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "family",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10198274526864118050",
  "source": "GoogleMaps",
  "reviews": [
   "My husband took me here for my birthday last year. It was phenomenal. This is where I go when I want delicious sushi. I can't wait to be able to go in and sit down to eat when Covid-19 is done. For now I satisfy that craving with takeout.",
   "I come to this special place many times because I love the special air that is exist in this place. The team is exceptionally cordial and qualified. The service is extremely rapid. Needless to say, the food they prepare is highly distinguished. I ate there many times and I was always happy. The price is modest. I highly recommend this restaurant to my friends and family.",
   "Great ambiance. Professional service. Price is good. Food is tasty. Came here since it’s close to the courthouse. I would recommend this to family and friends that are into sushi for sure.",
   "We LOVE the sushi at Sakura! The staff is very friendly, and the prices are reasonable. It's a great part of downtown Saint Paul, and I definitely think it is the best sushi in the area.",
   "I like this restaurant a lot. there is a romantic mood. The food is splendid. the service is dynamic and the waiters are trained. The price is satisfactory. I highly recommend."
  ]
 },
 {
  "name": "Little Oven",
  "address": "1786 Minnehaha Ave E, St Paul, MN 55119, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/76b49f7e-9334-11ea-9038-14b31f159f22.png",
  "tags": [
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15265132714328675271",
  "source": "GoogleMaps",
  "reviews": [
   "This place is amazing. Best Chicken Parm and Lasagna you'll find around. Good prices, portions and quality. Would 100% recommend trying this out no matter how far of a drive it is. (bring cash, they don't take cards) I just ordered two Lasagnas for carry out, they were fantastic. If your tired of sitting at home during this time, go support a local place like this or call someone who will go pick it up for you!",
   "Great place to eat with that family/friendly atmosphere. Food portions are huge and well worth the price. Had the Gondola Boat with fries and a half basket of onion rings. Everything tasted great and fresh. Only downfall is they are cash only. Definitely will be back.",
   "This spot is super chill, and in cut but definitely worth while! They have great portion sizes, and the menu prices are also very reasonable.\n\nThe staff seemed nice, and the atmosphere of the place was relaxed, and welcoming...went in for a quick lunch with my coworkers....\n\nI had the Sunnies and Chips which was pretty good even though the fish was a little “fishy” there fries were also on point, and you get a hefty portion of them which is a bonus....only thing that could have made this meal better would have been a nice coleslaw on the side!  \n\nAlso the pizza is pretty lit (tasty) Get it well done!\n\nI’ll def check out this spot again to try some more Italian choices from the menu!",
   "A top class restaurant! The standards and quality far surpass the price tag, in all honestly it’s worth way more than what we were charged. All the waitstaff were great!",
   "First time there. Service was great. Not a white table cloth wine list kind of place but good red sauce and meatballs on spaghetti.  Definitely order the bread sticks made from their pizza dough. Awesome!"
  ]
 },
 {
  "name": "COOK ST PAUL",
  "address": "1124 Payne Ave, St Paul, MN 55130, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7715098a-9334-11ea-9923-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12165477383573986501",
  "source": "GoogleMaps",
  "reviews": [
   "This is the best new place I've been to in years. Don't let the location scare you off. In fact, I think it works for them. I had the Bi Bim Bop, one of their specialties. It was fantastic. Just the right spiciness.  Not scorching. Something for everyone. The servers were very welcoming also.",
   "Great breakfast! Their hidden secret in this dish is the fried (to perfection) rice ball under the egg. This was topped off with great service and a coffee level that wasn't allowed to reach the bottom of the mug by our server. Thanks!",
   "We met with friends at this restaurant for dinner. we heard about this restaurant from quite a few people.  Well, we were not disappointed. we were warmly welcomed by the crew  and we had an excellent feeling. The food was just great. We loved this restaurant a lot and we will visit this place again. Highly recommended.",
   "Delicious food. I like the food fusion flavors too! Korean with American dishes in one! Highly recommend",
   "Small, quaint place. Food was different but very good. A little too pricey for me especially for breakfast. I spent $66 before the tip for 3 people's breakfast. Service was super friendly and amazing. If it weren't for the cost, I would go there again."
  ]
 },
 {
  "name": "Big River Pizza",
  "address": "280 5th St E, St Paul, MN 55101, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7774eb38-9334-11ea-9c47-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "unique",
   "family"
  ],
  "link": "https://maps.google.com/?cid=4983157651840784723",
  "source": "GoogleMaps",
  "reviews": [
   "Lots of great reasons to come here - easy to order, pleasant location, lots of natural light, and plenty of pizza options, including single slices. \nCrust is thin and crunchy, just how I like it. I prefer New York thin, where there is an equal amount of mozzarella cheese and tomato sauce. Big River is more like St. Louis-Style pizza, where there is a higher proportion of cheese compared to tomato sauce.",
   "The food is awesome. The only thing they need is straws with paper wrapped around them. When you reach in to get the straws you touch too many at one time. Don't like germs.",
   "This spot is the one I like best. I go to plenty of restaurants but to this one I go the most. The crew is very professional and the food they place on your table is so flavorful. I would always prefer to have a good dinner in this place. I highly recommend this place.",
   "Favorite. Pizza. Ever. Of all time. Hands down. Like, if you ever want to experience something magical in your life, come here. The ingredients from the veggie pizza are from the farmers market. How much better can you get?! The unique selection (I recommend the garden pizza) sets it a part from any other pizza place you will go to. Best pizza place in MN. Fight me.",
   "The meals and service were beyond my expectations. We surely loved the atmosphere of this spot. Extraordinary spot to take the family out for lunch."
  ]
 }
]