[
 {
  "name": "Tallahassee Museum",
  "address": "3945 Museum Rd, Tallahassee, FL 32310, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/77c862ac-9334-11ea-970c-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "nature",
   "kids",
   "family",
   "active",
   "family"
  ],
  "link": "https://maps.google.com/?cid=170495709765873901",
  "source": "GoogleMaps",
  "reviews": [
   "have been here a couple of times when visiting Tallahassee and I really enjoyed it both times.  It is not what you think of as a traditional MUSEUM.  It is very much an outdoor kind of place.  You Can learn a lot about Florida history and nature and see pretty plants and animals.",
   "This is a great place for everyone- kids, teens, dates, seniors, families. Beautifully located among vibrant scenery, each exhibit gives a taste of what is around us in the Gulf South. Their birthday parties are wonderful and they think of everything from start to finish; I could not be more appreciative and impressed with ours. When we have out of town visitors, this is one of the first places we take them. Becoming a member was a great idea for our family.",
   "Best decision was to get an annual pass. My toddler loves this place and I can bring family and friends for an easy day outside. There's lots of canopy to shade the entire trail and park. \nHighly recommend the zip lining. Best time to go is when they open as it's cool outside and the animals are active. Otherwise the animals hide in the shade or burrows.",
   "Love this place. Perfect for families. My daughter loves to come and see the animals and play on the playground. I myself want to try the tree to tree adventure.",
   "Had a GREAT time here! The staff was awesome and we had a ton of fun zip lining. We will definitely be back!"
  ]
 },
 {
  "name": "Cascades Park",
  "address": "1001 S Gadsden St, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/78199068-9334-11ea-8902-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "walk",
   "kids",
   "walk",
   "free",
   "parks",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=4285107122820436136",
  "source": "GoogleMaps",
  "reviews": [
   "Would have gotten 5 stars but as a person from out town it was hard finding the place. But once I did and found parking.  Seats were comfortable everyone was so nice. The bathrooms were pretty clean too",
   "I went there one night around 10:00 or 11:00pm to walk the park with my husband , it was very nice other people working out and walking their dogs. Some people actually stopped and took pictures of my husband and I which I thought that was amazing. Very nice will go back again.",
   "This is such a nice Park. It's very pleasant to walk here, go on a stroll, or ride those scooters. There's a few places to hammock and more to set up for a picnic. \nThey have an amphitheater, splash pad (with restrooms right next to it), and a small kickball zone near Monroe Street.\nThere's also a restaurant that's not too bad and a great coffee shop below.\nThis is a nice place to bring your dog or throw a frisbee.\nIt's a big open park where lots of activities can happen and yet not feel overcrowded. \n\nNow.. There is a small spot for kids to play (sandpit, one slide) but that's about it. The real attraction for kids is the splash pad.\n\nUnfortunately the city decided to build pretty much on top of this beautiful park and has disrupted the open view on one major side of the park. Time will tell how that changes everything.",
   "I personally like this park a lot. It's clean and very beautiful. The walk-ways are long and wide and it's the perfect place to unwind with friends. It is missing some shading but I like that. It feels very open and after being trapped in classrooms and libraries and in front of bedroom desks, it's pretty nice to go there and be free. It does need a light on the north eastern side of the park. Where the big turn in the road is there's a huge bush that leads to the pond, it needs a lamp there and maybe an emergency booth. As a girl, it doesn't feel safe to walk that corner at night. I kinda just scuttle past it. Granted it's been sometime since I've last gone; perhaps that's been alleviated. Last criticism, for some reason the city of Tallahassee doesn't seem to like making exercise parks with actual exercising equipment. Perhaps that's something for them to consider. What's the point of those long walking & running paths if there aren't other exercises that can be done along it?",
   "A delightful place to take a walk in the afternoon, or go for a run specially in the fall weather when it is cool and breezy. There’s a beautiful memorial to the forgotten war (The Korean War) which has great symbolism and beauty. There’s a great restaurant on the grounds with coffeehouse on the first floor in case you get hungry after taking in the wonderful sights."
  ]
 },
 {
  "name": "Florida Historic Capitol Museum",
  "address": "400 S Monroe St, Tallahassee, FL 32399, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7878ee66-9334-11ea-9a2c-14b31f159f22.png",
  "tags": [
   "historic",
   "kids",
   "hike",
   "kids",
   "historic",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14601949651190867024",
  "source": "GoogleMaps",
  "reviews": [
   "This is a beautiful well kept historic site. I highly recommend it to anyone in the area, even if it is just in passing. We only had a couple of hours in town and we spent over an hour here. We could spend lots more time there and seen a lot more.",
   "We came here for a visit, and brought the kids. It was a lot of fun. The only reason I didn't give it 5 stars because we didn't have enough time to see everything.",
   "Quite a hike to the top but a wonderful museum. Scavenger hunt for kids kept them engaged.",
   "The Florida historic Capitol was an amazing experience I think God for it and I enjoyed myself God bless Gladys🙏🏿❤",
   "Nice self guided tour of this historical building. Learned a lot about Florida history."
  ]
 },
 {
  "name": "Mission San Luis",
  "address": "2100 W Tennessee St, Tallahassee, FL 32304, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/78e433b6-9334-11ea-9ae3-14b31f159f22.png",
  "tags": [
   "kids",
   "learn",
   "history",
   "art",
   "history"
  ],
  "link": "https://maps.google.com/?cid=16494619166275255172",
  "source": "GoogleMaps",
  "reviews": [
   "Definitely a recommended stop while visiting Florida's capital city. The museum contains a small collection of objects from the colonial era as well as an introduction to the life of the inhabitants of this land. Although most of the buildings were constructed based on hystorical records, the live representations and explanations by the staff are really helpful to better understand the context where the mission developed. The entrance is $5 per adult and it's open from Tuesday to Sunday. Recommended!",
   "We found this to be a great place to spend the day with the kids. Open areas to run, we hiked through the woods, checked out really cool buildings, and learned many new things. Great time.",
   "This wonderful museum, (More like a time-travel!) , Is perfect for everybody! They have workshops you can do , and the staff is so kind! Perfect for tourists, schools, and people who just want to get away from the noisy part of town (Which we locals here all understand the struggle about).",
   "A beautiful place to learn about the Apalachee Indians tribe in the early 1700. Excellent restoration of the local tribe as well as the Spanish influence from the 1650 to 1700. Minimal admission (seniors are 3.00 each) it will take over 4 hours to really see all the exhibits. Really tells the history of a lost tribe.",
   "Worthwhile for history buffs.  Beautiful grounds, and guides in all buildings, explaining what you were seeing.  Has a real blacksmith showing the lost art.  Also used as destination wedding venues and other."
  ]
 },
 {
  "name": "Railroad Square Art District",
  "address": "618 McDonnell Dr, Tallahassee, FL 32310, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7947899e-9334-11ea-bd72-14b31f159f22.png",
  "tags": [
   "art",
   "food",
   "walk",
   "art",
   "parks",
   "creative",
   "walking",
   "art",
   "structure"
  ],
  "link": "https://maps.google.com/?cid=6243918025611911443",
  "source": "GoogleMaps",
  "reviews": [
   "It's so great to see an art district in Tallahassee.  While there aren't as many artists as I would like, there are shops and a restaurant to make wandering the area more interesting.  Go on first Friday when there are food trucks and everyone stays open late!",
   "It never seems like all of the shops around are open? Currently under construction (in the opening where it happened to be my favorite, bummer) but the rest of the park is still amazing and fun and a great place to go on walks with friends, whether you're looking for something to do or not. There's several shops, art, a few small parks, places to park the scooters, and even a bike fixing station. Great walk, cool things.",
   "Eclectic, creative, friendly and always evolving. Enjoyed walking through the square and meeting the artists. 612 Gallery is definitely a must see!",
   "I enjoy the scenary of this area with the colors and the structure of the shops.  If you like crystal shops, herbal tea shops, art galleries, photography, and other activities then check out the Railroad Square Art District.",
   "Small location filled with so many fun pinball and arcade machines. It's worth splurging on an all day pass. Leave and get a meal. Come back to game until they close."
  ]
 },
 {
  "name": "Dorothy B. Oven Park",
  "address": "3205 Thomasville Rd, Tallahassee, FL 32308, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/799e83a2-9334-11ea-82f1-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=8636314233377796747",
  "source": "GoogleMaps",
  "reviews": [
   "Went here over the holidays with my parents that came from Arizona.  Was nice evening out to look at the beautiful lights.  We will definitely be back next year.",
   "Staff at the house and on the grounds are all so helpful. This place is always kept on beautiful shape. I plan to visit again. Christmas I would love to bring my son to see the lights set up.",
   "Went to an arts and crafts Fall Festival 2 weeks ago with my daughter... and the event was really done nice. Of course... it's the Christmas lights that everyone goes to see, and it's always first class. Very nice place to visit. With Thomasville Road Baptist Church next door, parking is never an issue. Highly recommend.",
   "Absolutely a must-see Christmas lights location! You can drive through or park and walk. Our family visits every year (usually more than once) and drive through then park and stroll for maximum experience.  If you need the holiday spirit, this is guaranteed. Also a nice little park year-round.",
   "The city of Tallahassee did a great job this year. The display is the best I've seen in years. Its a family tradition to walk through and enjoy the sights and sounds. Great place for family photos too."
  ]
 },
 {
  "name": "Goodwood Museum & Gardens",
  "address": "1600 Miccosukee Rd, Tallahassee, FL 32308, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7a050dfa-9334-11ea-8bf9-14b31f159f22.png",
  "tags": [
   "walk",
   "tour",
   "unique",
   "historic",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16219389210447480590",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful place to visit! Enjoyed the Rose Sale and half price membership",
   "Very nicely preserved old house. Staff is very attentive and during the tour the explanations were superb.  You can walk the whole house. Uncommon in this type.of museums",
   "One of the most charming venues in Tallahassee, Goodwood Museum and Gardens hosts beautiful landscape and unique architecture throughout the property. The staff are so sweet and helpful which is always appreciated when working at a wedding venue. We love when we get the opportunity to work at Goodwood as we always know we will have stunning photos of our couples on this gorgeous property.",
   "A very Tallahassee historic venue.  The new air conditioned barn dinning area worked very well.  Food was great.  The grounds are well kept.  It's like being in the country, but only minutes from the Capitol. Handles parties up to two hundred persons.",
   "Riders in the Sky put on an amazing 90+ min performance...so entertaining and talented. What a pleasure to catch them!"
  ]
 },
 {
  "name": "Museum of Florida History",
  "address": "500 S Bronough St, Tallahassee, FL 32399, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7a5d4024-9334-11ea-8037-14b31f159f22.png",
  "tags": [
   "history",
   "kids",
   "free",
   "history",
   "walk",
   "free",
   "history",
   "free",
   "history",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=10972378652032350044",
  "source": "GoogleMaps",
  "reviews": [
   "There's so much to see about all aspects of Florida! The changing exhibits are great for seeing NEW things each time I come to visit, but even the permanent exhibits have me seeing new things when I look at them again. It's a great place to enjoy Florida's history!",
   "This museum was a lot of fun!  They had lots to do here for both kids and adults. We learned a lot about the history of Florida. It’s a good stop off when you need to stretch your legs during a long road trip. The admission is free and they ask that you make a small donation. They had many different rooms and areas spanning over centuries.",
   "What a great day. The museum is downtown right by the state capital. It covers history of the state from the early Spanish influence to past WW2. Also covers ALL aspects of the state. We spent over 3 hours here just enjoying the full info of the state. 2 city blocks away from the state capital so park and walk. \nFREE admission and parking.",
   "We didn't research this visit much but saw it was recommended. Both our boys (10 and 12) enjoyed the museum with different parts being hits. Even grandma's attic was a hit with some fun moments. Way more to see than my photos, a ton of history from the early native America days, through Spanish occupation, statehood and World War II. The surf display was a nice bonus. You can easily use up 2+ hours here so I'm guessing it would range from 1-3 hours depending on your speed. Definitely worth a visit. The parking is $5, but free if you get a token from the front desk. Total cost, $0!",
   "The museum was very informative and hits the major details of Florida's history up to World War II. As a former tour guide and history buff, I found the most enjoyable part chatting with their docent there, Paul, who was well versed in the history of Florida and very friendly. I came on a slow day so was able to hog a lion's share of Paul's time, but by far his expertise and excitement about history was what made this trip so enjoyable."
  ]
 },
 {
  "name": "Tom Brown Park",
  "address": "443-557 Easterwood Dr, Tallahassee, FL 32311, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7acf8a40-9334-11ea-9c22-14b31f159f22.png",
  "tags": [
   "family",
   "pets"
  ],
  "link": "https://maps.google.com/?cid=1434691884869310251",
  "source": "GoogleMaps",
  "reviews": [
   "Despite having never lived anywhere near Tallahassee, we first started coming to Tom Brown annually almost 20 years ago for mountain bike races.  Then I eventually left the sport and years passed.  Several years ago I made the first return to Tom Brown for model RC racing and it brought back many memories.  This past week I made another return to Tom Brown while in Tallahassee and it brought back even more memories.  The most amazing thing of the last 17 years is just how little the park has changed, while still making many improvements.  I'd love to return with a bike and ride the Greenway addition which previously did not exist years ago.",
   "One of my favorite places to hike...I have been visiting since I was a child! So many great memories! The bathrooms were clean and park was well lit even into the evening!",
   "BABY my service animal enjoys coming out here. ADA of 1990 🐾🐾🐾🐾🐾🐾🐾 a great place to have a family a great place to bring all generation together in a community.",
   "We love tom brown park.  The dog park is awesome.  However, I do wish people would clean up after their pets. No one likes stepping in poo.",
   "It's an absolutely amazing park, spacious and great for just about anything. We used it for a Pokemon Go outing!"
  ]
 },
 {
  "name": "J. R. Alford Greenway",
  "address": "2500 Pedrick Rd, Tallahassee, FL 32317, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7b2b1812-9334-11ea-bb5e-14b31f159f22.png",
  "tags": [
   "walking",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1758253330275223232",
  "source": "GoogleMaps",
  "reviews": [
   "This trail is awesome. I walked the gravel trail while my 4-year old twin boys rode their balance bikes. I held my 1-year old daughter most of the time--some of the time she walked. Everyone had an awesome time! The views of the trees and fields are great. The trail was designed with big, rolling bumps that make it even more fun to go down the hills.",
   "Nice place.  Lots of open spaces.  Plenty of woods.  Lakes for canoeing or kayaking.  Lots of trails.  Water fountains and water bowls are provided for dogs.  Dogs on leashes are fine.  Horses are allowed.",
   "Love coming here! The greenway and its connecting to LaFayette Park is such a beauty, especially on warm days. In the spring, you'll see so much plant foliage too.",
   "Get outside and enjoy this area with its many walking and biking trails.",
   "This place was gorgeous and we took our family photos here! The perfect little getaway!!"
  ]
 },
 {
  "name": "Lichgate on High Road",
  "address": "1401 High Rd, Tallahassee, FL 32304, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7c1ca4ca-9334-11ea-b71a-14b31f159f22.png",
  "tags": [
   "free"
  ],
  "link": "https://maps.google.com/?cid=13738192404800070607",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful park. Very peaceful. Lots of space. Very clean. It is a treasure in the middle of Tallahassee. People need to volunteer to help. Lots of historical significance. People need to respect what is there",
   "By far, and without a doubt my favorite place in the world. Sounds like a hyperbole, however this point holds a lot of memories and deeper meanings to me, including the ashes on a dearly missed friend. I am fortunate enough to be able to donate some of my unfortunately 😭 abundant free time and. Albeit sparce lately I still feel blessed to be able to give back to such a beautiful place and to attempt at least, to keep it as radiant as it deserves to be. I hope to see anyone interested in visiting Tallahassee' hidden gem and if you are only a reader at this point and not a venturer to the 'gate; PLEASE GO, YOU'RE MISSING OUT RN 😁",
   "This place is absolutely beautiful and serene.... The tree is so mesmerizing, there is a cottage at the back I am assuming someone lives there ...A bench on the side under shade where you can enjoy s nice picnic but be mindful to clean up after please!",
   "Gorgeous. It really is like this hidden secret peaceful place. I absolutely loved it. I can't believe I had never been before!",
   "Such a quite enchanted place under the trees. It's right by a busy road but its unnoticeable when in Lichgate. A beautiful garden and a few places to sit at. I would recommend bring a blanket to lay on by yourself or with others to enjoy the peace in the air. A good place to study too!"
  ]
 },
 {
  "name": "Tallahassee Automobile Museum",
  "address": "6800 Mahan Dr, Tallahassee, FL 32308, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7c78f5a6-9334-11ea-879c-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=15964918452851845630",
  "source": "GoogleMaps",
  "reviews": [
   "This place is absolutely amazing!  There is everything here from all kinds of cars, especially my favorites, the muscle cars! There are knives, there are motorcycles, boats, pianos, there are dolls, toys, and a fabulous Batman collection! A great way to spend a whole day, there is that much to see!  And if you are in an RV, you can spend a night or 2 on the lawn while you see this whole museum. It has been wonderful, I highly recommend it!",
   "This place was EPIC! We drove 3 and 1/2 hours from Tampa to get there. And it was worth every minute! They don't only have an extensive collection of cars but everything else you can think of (sewing machines, toy soldiers,  sports memorabilia, crash registers, old -1900s old- calculators, farm implements, MOTORCYCLES! knives, Barbies, ceramic dolls...the list goes on) highly recommend...",
   "The inventory is extensive and eclectic. The cars are a delight. The mannequins need to be updated or removed. They take away from the amazing cars. I could do without the political assault when you walk through the front doors. If I  had been alone I would have turned around and walked out. Mr. DeVoe Moore has every right to put whatever he wants in his museum, but I have every right to save my money!",
   "What a stunning display of all the new and classics!  I was impressed with the variety of vehicles right down to a wooden car before going outside to see the vintage ice cream truck. There are collections of dolls, cash registers, golf memorabilia, boat motors, and much more. Gorgeous, pristine paint on every car and something to see for everyone!  (side note: they do not give admission discounts for veterans on veterans day; just one flat rate for all) Thank you Tallahassee Auto Museum for sharing this wonderful array of collections.",
   "My husband and I enjoyed more than just the wonderful collection of cars. There we Steinway pianos, antique guns, farm equipment, and so much more. I personally loved the boats and boat motors."
  ]
 },
 {
  "name": "Florida State University Museum of Fine Arts",
  "address": "530 W Call St, Tallahassee, FL 32306, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7ccc6e52-9334-11ea-b490-14b31f159f22.png",
  "tags": [
   "walk",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=14975873285202554563",
  "source": "GoogleMaps",
  "reviews": [
   "Not only does the museum have a great atmosphere and layout, their collection of artwork is amazing. They have the opportunity to host multiple collections a year and I suggest going even if you're not interested in art because it's a surreal feeling to walk through the museum.",
   "Ok I was visiting a friend in Tallahassee on 02/03/2019. Google maps showed MOFA was closed on Sundays. I mailed the phone number pressed 1 as instructed and it stated Saturday & Sunday hours 1:00 P.M. to 4:00 P.M. We drove to the location and it's closed. \nReally?? A University where I assume University educated individuals work and they can't update the phone system or Google Maps. Sad.",
   "Not a place I’d typically visit, but MoFA seems culturally relevant, accessible, and very nicely curated. It’s a place of considered intention not otherwise frequently found here in Tallahassee.",
   "I love art, everything about it. And you can tell that the curators here have the passion for art as well. The exhibits are beautiful and there is always plently to look at. I love when they put up the student exhibitions, seeing their insane talent and passion for traditional art is inspiring and raw. I will return again, happily.",
   "Great museum. Some exhibits are more to my liking than others. Always well done. Pleasant atmosphere."
  ]
 },
 {
  "name": "Miccosukee Canopy Road Greenway",
  "address": "5600 Miccosukee Rd, Tallahassee, FL 32308, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7d295b9c-9334-11ea-b9da-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "hike",
   "walk",
   "free",
   "walk",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=5919705711406539528",
  "source": "GoogleMaps",
  "reviews": [
   "4 separate parking areas with bathrooms along the way. Lots of trail offshoots along the way. There are no slippery areas, even after the rain like some of the other local hiking trails. There's open fields and heavily wooded areas depending what you're looking for, wide main path is easy to follow or take the tighter paths to feel more secluded. There are picnic tables and cozy benches thoughtfully placed along the way and water fountains for humans and dogs. Lots of loops for you to decide how long or short you want your hike to be. It's a lovely place to run alone, walk your dog/kid, bike with a friend or even ride your horse. I've done them all out there and loved them all!",
   "This hike with TSC was a challenge for me.2mi each way ,and some inclines.Woodsy trail.I had enjoyed the previous Miccosukee Hike  on another trail",
   "Great place to walk for free in Tallahassee.  There is parking and toilets at both ends and also in the middle.  Nice wide paths that allows for walkers, joggers and even bikes and horses.  Make sure you keep your ears and eyes open for cyclists as they do sometimes go fast.",
   "There is a six mile Trail Fram one parking lot to the other. Not counting all the small branches which has no signage. \n\nThe place seems less crowded than Tom brown park. Every so often there will be a bench. Water fountains are only located at the parking lots.\n\n Be sure to wear a hat because the beginning of the trial is a wide-open plane, and later on you will be in miles and miles of woods.\n\nNot too many interesting finds here such as animals or interesting plants but overall this is a great trail for hiking and cycling.",
   "Good place for a hike. Either a long one or short. Walk through the woods and clearing. Found black berries. Water tower, even a cementary.  benches to take a break.cool spot to just walk."
  ]
 },
 {
  "name": "Tallahassee-St. Marks Historic Railroad State Trail",
  "address": "Tallahassee, FL 32305, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7d942b78-9334-11ea-a1ba-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=13062677914259863423",
  "source": "GoogleMaps",
  "reviews": [
   "It’s a nice park with a great track/ sidewalk. Has bathrooms that are generally pretty clean. Right next to a couple stores. \nOne of the downfalls to me was the amount of traffic that goes by constantly. But it’s a nice spot to rest up or stretch out",
   "A wonderful trail for biking or skateboarding. The pavement is smooth and there aren't any  large hills since this trail used to be a railroad. Make sure to bring your own water.",
   "Looks really cool... where do you park?!? Help lol",
   "Very great walks, bikes, or a jog. It's pretty long and you don't even feel the distance of this thing.",
   "Fantastic trail suitable for road bikes. Smooth path and well maintained, but could do with some more water fountains along the way. From the car park to the end is 25km, so 50km for the return , which is pretty good. A few stores at the end to refuel and done lovely views."
  ]
 },
 {
  "name": "Elinor Klapp-Phipps Park",
  "address": "4000 N Meridian Rd, Tallahassee, FL 32312, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7e186e24-9334-11ea-b21c-14b31f159f22.png",
  "tags": [
   "family",
   "walk",
   "free",
   "walking",
   "cheap",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11011948453864364963",
  "source": "GoogleMaps",
  "reviews": [
   "Red Hills Horse Trials is simply the best equestrian event for horse lovers to watch or to participate in as a volunteer. The community comes together to put on a fluid, well run event that is world class. Look for it every March. Hats off to the Phipps family for the foresight of donating the land for this wonderful park and especially for this event. Thank you.",
   "I had a great time on the mountain biking trails. They were not extremely difficult but they definitely weren't easy. There were many ponds and streams and one of the ponds had turtles in it. Overall great scenery and would recommend you go on a cool and cloudy day be cause your going to sweat. A lot.",
   "Very nice park when the mosquitoes are dead in the winter. Bring bug spray if you go any other time.\n\nThe recreation fields always seem well maintained, but I usually go on the trails. There are quite a few downed trees from the past years hurricanes, but you can walk under or around them.\n\nThe trail itself is very pretty, with a lot of streams and one very neat waterfall. Not very populated, but the bike trail has people riding usually. \n\nThere are often people walking dogs without leashes here. Please leash your dogs, you can't control them when they are allowed to roam free, and it's dangerous for everyone. City leash laws apply here.",
   "Municipal soccer complex with many fields and not enough parking or family seating. Some fields have bleachers but most do not. The grass is in good shape and there are a couple of AstroTurf fields as well. There is a concession stand which has a good variety of food for cheap (breakfast, lunch, and snacks), but often long lines and questionable hygiene. The bathrooms are plentiful and clean and located in the center of the very large complex. \nBring a chair or a picnic blanket to sit on (and maybe a picnic) and prepare to cheer your kid's team on to victory! \nThere's no real shade, so in the summer consider a tailgate tent.\nNote: arrive early for best parking, prepare to wait in traffic to leave the complex, and this location is not handicapped accessible.",
   "The park offers a variety of trails including wooded, semi-wooded and wide trails and fields. I often see people hiking,  riding horses, and bikes in the park.\nHighly recommend!"
  ]
 },
 {
  "name": "Knott House Museum",
  "address": "301 E Park Ave, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7e7d4acc-9334-11ea-b1be-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "active",
   "tour",
   "free",
   "family",
   "knowledgeable",
   "tour",
   "learn",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=11645671593254996705",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely spot, though it is small the poetry is cute. The guides are knowledgeable and good with groups.",
   "Just a beautiful example of PRE statehood architecture of a home build by a free black carpenter as a wedding gift for a white owner. Florida was awarded statehood after this house was built and the Knott family kept the original furnishings and wall paper (in the main hall only) when they gave the entire house to the government. \nPicture a home as a time capsule from 1928 to 1941! The outdoor kitchen and bath from the original 1843 home has been moved inside then left alone. Mrs. Knott did a great job decorating the house and even wrote poetry for many pieces of furniture. She was very active in prohibition and sufferage.Mr. Knott was in the government accounting. FREE admission but bring a good donation. It is worth the 2 plus hour guided tour.",
   "Excellent tour. Holley was knowledgeable  and patiently answered all our questions. The house was well preserved as was the contents.",
   "Wonderful place to learn about American history.",
   "Had a wonderful tour here recently..our guide was very well versed,and made our visit so enjoyable."
  ]
 },
 {
  "name": "Florida State Capitol",
  "address": "400 S Monroe St, Tallahassee, FL 32399, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7eea42dc-9334-11ea-9a85-14b31f159f22.png",
  "tags": [
   "free",
   "history",
   "learn",
   "free",
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3172059017055825388",
  "source": "GoogleMaps",
  "reviews": [
   "Best part of this was the museum. Lots of history to read about and nice and clean facility. Spent around an hour here since we just stopped by on a Sunday when they have restricted hours.\nThere are no clear signs to park but right across on the US 27 is a small parking lot to park for free.",
   "This place is a great place to go to encourage legislatures to be better people. To let them know they don't have to be corporatist to win elections.",
   "I liked both old and new capitol building. You can learn a lot of history in the old capitol and in the new one if you go up to the 22nd floor you can see the whole view of the city. Everything is free so why not",
   "I now understand why this resort has a good review! It is so wow and it was a very nice experience of all!  Spacious for a family of four. The complimentary pickup and drop off was on time ( thank goodness -), it’s much appreciated esp for first-timers in here.",
   "Good experience here. Guide, can’t remember his name was fantastic though. Have a good run down and left a great impression."
  ]
 },
 {
  "name": "The Mansion Escape Room",
  "address": "6497 Apalachee Pkwy, Tallahassee, FL 32311, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7f487e0a-9334-11ea-bff6-14b31f159f22.png",
  "tags": [
   "family",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=8282436130000643643",
  "source": "GoogleMaps",
  "reviews": [
   "A lot of fun for our first escape room experience. The Chef Olivieri room was challenging and well decorated. Just wish we'd known that one particular set of props was not working/had nothing to do with the clues.  Nevertheless, my son loved it, and is already making plans to do an escape room every couple of months.",
   "We did The Hidden Temple for a children's birthday earlier in the day and it was so much fun we came back that evening just the two of us.\n\nMy fiancee and I did the Chef Olivieri's Rescue as a duo and we had the absolute best time!\n\nNate was a consummate professional. He really knocked it out of the park with our experience today.\n\nI seriously cannot wait to come back.",
   "So much fun. I had a great time with my family and it really makes you think. We will come back.",
   "We had a great time! The owner was very nice and worked with us in choosing a room. All of the staff was very friendly. The room we did was very well done and we had so much fun even though we did not escape! I would go back in a heartbeat!",
   "I can't say enough great things about the mansion! The staff was extremely friendly, veryyy helpful especially because we were first timers, and overall made the experience that much more enjoyable. The actual room we were in was so much fun, the clues were clever, some of the features you use to solve from the clues are really unique and pretty high tech. Definitely am planning to come back and do the other rooms!! Overall excellent experience and would recommend to anyone!!!"
  ]
 },
 {
  "name": "Lake Jackson Mounds State Park",
  "address": "3600 Indian Mound Rd, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7fd1d5b0-9334-11ea-a1ad-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "history",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=4883113723988967985",
  "source": "GoogleMaps",
  "reviews": [
   "Greta place with lots of history to explore. The trails are easy for and the old mill ruins are quite interesting. A bit soggy when it has been raining so wear good shoes, especially if you are going back to the mound at the far end of the park.",
   "Every first Sunday of the month, in the afternoon, there is a lovely group of people who get together and have a drum circle. They let me and my friend join in on the jam session. So much fun 😁🕺🏻would be a nice place for meditation or picnic",
   "Today we hiked the entire Lake Jackson Mounds Archaeological State Park with around 3.5 miles of trails. Informative displays and several picnic tables are offered including bathrooms. Photographed is the tallest mound which stands 36 feet high with a base that measures 278 feet by 312 feet. It was built by Native Americans belonging to the Fort Walton Culture.",
   "A very interesting hidden spot in Tallahassee. There isn't much here to keep your attention though. It would be nice to have more information on the Native Americans who lived here. Maybe better displays, a mock hut to show what their daily lives were like, etc. So much history here that isn't really represented",
   "Off the Beaten Path but well worth the drive is this serene park that offers Earthen/Ceremonial/Burial Mounds from the Fort Walton Culture,  Florida largest known that dates to AD 1100-1500.  Colonel Robt. Butler's Plantation 1820c, mill dam & irrigation system can also be viewed from the nature trail.  Clean Restroom, ample parking, small fee, picnic tables, Pavilion, Interpretation Panels & Signs.  Visited in monsoon seasons so the grass, weeds etc. where overgrown, and there were some down branches from the hardwood trees.  Being pressed 4 time, only a few pictures and a short history lesson."
  ]
 },
 {
  "name": "Alfred B. Maclay Gardens State Park",
  "address": "3540 Thomasville Rd, Tallahassee, FL 32309, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/80332fb4-9334-11ea-90a1-14b31f159f22.png",
  "tags": [
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6448267300609113895",
  "source": "GoogleMaps",
  "reviews": [
   "I highly recommend this place if you're looking to visit Tallahassee. The scenery is beautiful and is in bloom mainly from January to April, although some of the plants bloom year round. There is a lot more to see than I was expecting. Outside of the garden area is the rest of the park that includes an area to launch boats onto the lake, they even have rentals if you don't bring your own, and quite a few trails to go and explore.",
   "Breathtaking Garden, great and caring staff. This state park should be on your list of places to visit. Ranger Blair goes above and beyond for the job. Also be sure to check out the small classes that they hold! We just attended a painting class (only once a year!) and came home with beautiful work, we had a great time and we are so excited for our next class!",
   "A beautiful floral park with walking paths and a maintained \"hunting lodge\" purchased in the 1930's. All original furnishings show the post revival from Southern plantation to Northern owned retreat. Mr. Maclay used his financial strength from the New York ice business to buy and expand this hunting grounds to a beautiful flower park. Now run by the state of Florida with a very low entrance fee to see the well maintained legacy he started.",
   "It is a beautiful State Park. There is swimming in season  boating, lovely trails in the gardens with lots of pretty flowers and trees. There was a concert going on by the garden so parking was full, but we were able to park up by the lake and they had a tram that we could take down to the Garden so we didn't have to walk all that way. Very well maintained and friendly staff.",
   "Well maintained and beautiful, even on a chilly day!   Great picture opportunities everywhere and lots of room to explore with nice paths.  Helpful guide in the house with answers to all our questions,  and lots of hidden little bits of fascination all around"
  ]
 },
 {
  "name": "Sky Zone Trampoline Park",
  "address": "1925 N Monroe St Suite 109, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/80865926-9334-11ea-bc1c-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "drink",
   "kids",
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=8407706722331763248",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I put a deposit down for our kids birthday party. The day of the party we showed up to notes on the door saying they were closed due to an maintenance issue. I just wished they would have called us and told us, instead we got our 1 and 2 year old excited thinking they were having a jumping party. No one has responded to my emails for a refund which we deserve. My family just want our money back please!",
   "Fun place! Kids and adults had a blast. Food and drink options also available.",
   "This place is better for younger children 15 and under.",
   "Had a blast jumping here!  Foam pit basket ball and large trampoline space.  Staff was professional and welcoming.  Would come back here",
   "My son had his 5th birthday here yesterday. Best experience! The staff was friendly and professional. Our personal hostess, Andrea, was amazing!! The kids had so much fun with all the different activities provided. I did not have to stress about a thing! Highly recommend!! We also plan on doing a parent night out soon! 😊👍  👍"
  ]
 },
 {
  "name": "Capital Cascades Trail Park",
  "address": "Famu Way, Tallahassee, FL 32310, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/80ec9518-9334-11ea-9502-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "free",
   "unique",
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6118460751702469757",
  "source": "GoogleMaps",
  "reviews": [
   "Love this area. The only thing I would say is it needs some shade where the kids play. It was literally so hot my child played for maybe five minutes and was ready to go.",
   "This place is great! I know it's for little kids but I swear, college students go to it more than they do. It is so much fun to scooter around in that area. Or actually monkey around in the park. I'm a bit sad to see them building pretty close to there. There's likely going to be more traffic to get to there and all the parking spaces will be taken by guests visiting it because in that area, the contractors and city officials do not like to add free parking for the tenants and their guests. If this is another Stadium Centre then parking at the park will be a lot closer than parking near the tracks.",
   "Very neat... A little advanced for small kids, unique play equipment",
   "Me and the children just love this trail. Its a trail we can walk anytime. We prefer the night time better. The colorful lights are nice to see and make great backgrounds for pictures.",
   "This is a beautiful, well maintained park-but it needs some kind of shade. The grass is plastic, so in the blazing sun, it feels like death. We had to leave our shoes on or risk third degree burns. Other than that it's lovely."
  ]
 },
 {
  "name": "Florida's Governor's Mansion",
  "address": "700 N Adams St, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/81999eb4-9334-11ea-befd-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=5851152287277703000",
  "source": "GoogleMaps",
  "reviews": [
   "Great tour of the mansion, I would recommend it to anyone who's interested in the history behind it.",
   "Lovely setting and such great staff.",
   "Only on the outside. Took a few pics. Very peaceful",
   "It is so nice to actually, attend, watch, have access to our government in action. Learning the history and having a first hand sense of what really goes on, as opposed to getting information on issues from the various filters of opinion pressed upon us by the different media outlets, is very refreshing!!\n\nWe spent time with so many impressive, dedicated, passionate individuals.... Our households belief in our form of government has been strengthened. It's not simple, smooth or easy.",
   "Had good time with friends after meeting with governor."
  ]
 },
 {
  "name": "Fun Station",
  "address": "2821 Sharer Rd, Tallahassee, FL 32312, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/82005002-9334-11ea-b6ba-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6159662886203552777",
  "source": "GoogleMaps",
  "reviews": [
   "This place was okay.  My son did have fun here but it is a little run down.  Particularly outside.  The putt putt course was very dirty which made it hard to play on.  Of course, my son is young so he didn’t care and still had fun but I thought if I’m paying to play and drove an hour to get there, it should definitely be more playable.  We have played putt putt at a lot of different places and this was the dirtiest course we have ever played on.  Inside was okay, they obviously pay a lot better attention to the inside than out.  All and all, we still had fun so I would recommend but giving a heads up on what to expect.",
   "Been here multiple times over the 22 years I've lived here and I think it has both devolved and improved in some ways.  Took my kids to get them out of the house during break and it was a decent deal for what we got to do. The guys working there were very nice and accommodating.  Still think they need more actual arcade games and less skill cranes/redemption games.",
   "Lots of big games like large over sized arcade games. They have refreshes their selection of games too. The go carts are ok but don't expect too much out of the mini golf. It seems as though fun station is pulling out of the slump it was in several years ago.",
   "It was fun.. We had age ranges from adults Down to 2 yrs of age and everyone enjoyed themselves. Only got 3 states due to cosmetics. The place really needs a scrubbing and some paint",
   "Fun Station is a good afternoon distraction, it could be filled out a bit. The attractions are decent. I particularly enjoyed the large laser tag arena with multiple levels and the go-karts were great. I think that the arcade could be filled out a bit. Over the last decade, arcade owners found that ticket games can be lucrative because they encouraged replay value, but the games themselves are hollow and lack depth. Fun Station falls into this trap. Maybe a balance of pinball and old-school arcade classics would encourage us dads to bring our younger ones in more often."
  ]
 },
 {
  "name": "Lake Ella Park",
  "address": "S Lake Ella Dr, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/82852864-9334-11ea-96f9-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "walk",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=11585606005362378212",
  "source": "GoogleMaps",
  "reviews": [
   "Every mom needs a break, so for us dad's, this is a great (free) place to spend an hour or two where you can enjoy yourself, and the kids will have a ball... As long as you have bread... There are a few bench swings, and you can relax and read stories, look out at the water, or even hand feed the ducks and Canadian geese.",
   "One of Tallahassee's gems. Well cared for by the City and always beautiful. Easy .6 mile walk around the lake on a sidewalk. Lady and I love it there!!",
   "Very well kept. We were pleased to see the homeless didn't bother anybody. Serene & peaceful.",
   "Such a great place to relax. Nice scenery, lots of ducks and little shops near by to get a treat.",
   "Very nice walk, beautiful landscape, lots of ducks and turtles to see. A few cute, quaint shops around the lake.  Picnic areas.  I didn't see a playground which would have been nice for the kids to play."
  ]
 },
 {
  "name": "FSU Reservation",
  "address": "3226 Flastacowo Rd, Tallahassee, FL 32310, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/83135ef6-9334-11ea-a790-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=7262983679080034337",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for family and friends to hangout. You can also reserve your group meetings. It is beautiful out here. It is gated and well maintained. Lots of fun activities. A lot of green and even sand/beach volleyball. Lots of spots to have a picnic by the lake. Plenty of parking.",
   "Paid entree for those that aren't students but you can't complain about the $3 for a nice lake experience. Rent a kayak or go stand up paddling and enjoy the Florida weather. It's filled with students but since no alcohol is allowed they are respectful and not rowdy. I came alone and had a relaxing few hours before heading on my way.",
   "Never super busy, $3 for adults to get in and $1 for kids 6 and up. Can rent kayaks or canoes for $5. Just an awesome place.",
   "Great place to have fun\nRock climbing, kayaking, canoeing\nBeautiful scenery\nAmazing place to hangout for a picnic",
   "Beautiful park with good outdoor actives like kayaking, rock climbing, volleyball, etc. And best of all, it's free for FSU students!"
  ]
 },
 {
  "name": "Lafayette Heritage Trail Park",
  "address": "4900 Heritage Park Blvd, Tallahassee, FL 32311, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/83772a26-9334-11ea-b12a-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13340339293788519070",
  "source": "GoogleMaps",
  "reviews": [
   "Really nice local park with good facilities. Easy access to fishing break walls and decent trails (hiking/biking and canoeing). The park is usually empty untill 11:00 most weekends and gets somewhat crowded after that. The trail around the center lake has many locations to rest/picnic if the main areas were reserved or are busy.",
   "Just an absolutely gorgeous place to decompress. A beautiful covered bridge is the perfect place to view the lake and the train tracks. This connects with the trail that comes in from Tom Brown.",
   "So picturesque. Lots of dog walkers and joggers.  Can't wait to go back with a picnic along the water.",
   "This a wonderful trail for walking or biking. There are wide paths so you can easily walk beside someone and chat, the ground is firm enough to jog and the terrain is interesting enough for a good bike ride. What a great escape from the daily!",
   "Beautiful scenery..Well kept trails. The cutest kids are where they can do arts and crafts. \nJust make sure to pick your feet up. Pretty big roots."
  ]
 },
 {
  "name": "The Grove Museum",
  "address": "902 N Monroe St, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/83f003e4-9334-11ea-bbed-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "family",
   "history",
   "nature",
   "walk",
   "history",
   "walk",
   "tour",
   "nature",
   "knowledgeable",
   "tour",
   "history",
   "knowledgeable",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15539151265110935901",
  "source": "GoogleMaps",
  "reviews": [
   "Love the Grove!! It's a beautiful hidden gem on Monroe street. The staff members who work there are so knowledgeable of the house and the land. The tours are also quite detailed and pays tribute to all aspects of the people who've lived and worked in the home. I love how they always showcase the history of the house and land with various activities for the whole family throughout the year such as their monthly Backyard Discovery program and Nature Walks. I will definitely be coming back again and again.",
   "Great little gem in the middle of Tallahassee, just north of downtown. The house is beautifully restored and full of local Florida history. Definitely a must see for museums. The gardens at the Grove are equally well kept and make for a peaceful walk.",
   "Today was ideal for the Nature Walk at the Grove! I had previously taken the house tour,but the behind the scenes tour of the property was very interesting.Our tour guide Jon ,was fabulously knowlegable.Recommended!",
   "Lovely and somewhat hidden gem in the middle of Tallahassee. The history of the house is impressive, loved the information panels, the \"on-the-hour\" tour was also nice. Very knowledgeable and friendly tour guide.",
   "Absolutely stunning, another jewel 💎 of Florida history. The garden features tons of Magnolia Trees and lots of beautiful flowers. A must see if visiting Tallahassee. \n\nThe staff is super friendly and knowledgeable. I love that they've included a kids reading time as well. \n\nEnjoy my photos!!!"
  ]
 },
 {
  "name": "Tallahassee-St Marks Historic Railroad State Trail - North Trailhead",
  "address": "5057 Woodville Hwy, Tallahassee, FL 32305, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/845778be-9334-11ea-9622-14b31f159f22.png",
  "tags": [
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=2424906011998915635",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent parking location to start either a trail ride on the Munson Trails or head down the paved trail to St. Marks (nice and flat). Convenience store and fuel are just North of the trailhead. Publix is within 2 miles (west on Capital Circle by Crawfordville Road).",
   "Fun twisting trail... Good workout for a pleasure (non-technical) rider.",
   "I love St. Marks Trail!",
   "Nice trail for running or biking. Not crowded. \nIf you're biking, be aware of some people walk it with their earphones on and will not hear you if you're approaching them from behind and yelling :\" bike from the left\", they'd still be walking in the middle of the trail...",
   "GREAT bike path. Paved, separate from road. Plenty of benches and bathroom stops. Mostly shaded."
  ]
 },
 {
  "name": "Natural Bridge Battlefield Historic State Park",
  "address": "7502 Natural Bridge Rd, Tallahassee, FL 32305, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/84c04dae-9334-11ea-afd2-14b31f159f22.png",
  "tags": [
   "organized",
   "food",
   "hike",
   "history",
   "walking",
   "family",
   "historic",
   "field",
   "tour",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=18161665401459535131",
  "source": "GoogleMaps",
  "reviews": [
   "Come during reenactments. Fun activities, good food, interesting people,  well organized itineraries, and awesome battle scenes.",
   "Have only been here once before during a reenactment.  We decided to take a hike here in the winter and check out the area.  The monument is about the only piece of history you can see. It's all interesting but there is very little to do otherwise. Wish there was more signage to be able to take a hike around or follow a path. Everything is either fenced off or you're walking right on the road.",
   "Nice little family friendly park. Would be nice is there was a few more activities to do, but all and all is a wonderful little park to escape to for some rest and relaxation. \nLove the historic remakes of the civil war and the trails that can be walked on.",
   "A great addition to St Marks Lighthouse tour.  Very interesting Civil War battle field that memorialized the North and South.  Dont see that very often",
   "This was the 155 anniversary.  Smaller than Oluste but very well done by the Florida State Parks.  Lots of reenactors and settlement"
  ]
 },
 {
  "name": "Riley House Museum",
  "address": "419 E Jefferson St, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/851b8d5e-9334-11ea-9689-14b31f159f22.png",
  "tags": [
   "learn",
   "family",
   "history",
   "knowledgeable",
   "tour",
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=5792933052589332273",
  "source": "GoogleMaps",
  "reviews": [
   "What a wonderful spot! We learned so much! The staff is so great and enthusiastic!!! We loved it! We will definitely recommend this museum to everyone that is visiting Tallahassee and wants to learn real history! Things that were never taught to us in school! I was glad to share this with my family! Keep up the good work!",
   "Loved this small tour. Our guide was very knowledgeable and  informative about the black history of Tallahassee.",
   "The Mr. Riley figure was life like. The history behind the land and Mr. Riley was very interesting. We were escorted by a young lady from the FAMU New Student Orientation team and she did an outstanding job in presenting the facts of the home and Mr. Riley.",
   "Great Tallahassee historical landmark and legacy!",
   "Loved it! Enjoy learning about history, especially local history."
  ]
 },
 {
  "name": "Winthrop Park",
  "address": "1601 Mitchell Ave, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/857b1418-9334-11ea-8671-14b31f159f22.png",
  "tags": [
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=17134943459076064387",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful park with many activities for adults and children.  The park is very clean and is  conveniently located near midtown. There are soccer fields and picnic tables along with things  for kids to play on. It is well lit and patrolled frequently by law enforcement. Actually,it is not a bad place to meet someone met online. It is spacious and well maintained",
   "It's fun, but once you do stuff nothing's there to do. There's even a baseball court if you like that kind of thing. And tennis and basketball. The playground has swings and all kinds of different things.",
   "Nice place to bring the little ones, great little playground in the shade of old oak trees. Six tennis courts, baseball fields, handball and basketball courts. Also a large vacant area that is excellent for a pickup football game.",
   "Nice park. Fun for all ages. Basketball, baseball and tennis. Playground for the little ones and the older kids.",
   "I play Ultimate Frisbee every Saturday at Winthrop. Great group of people! Come join us, but be prepared to run! I am older than you, so stop your complaining. 🤪"
  ]
 },
 {
  "name": "Spring House - Frank Lloyd Wright",
  "address": "3117 Okeeheepkee Rd, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/85f37948-9334-11ea-8bf7-14b31f159f22.png",
  "tags": [
   "family",
   "walk",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=9466789940830877357",
  "source": "GoogleMaps",
  "reviews": [
   "So much fun meeting Byrd and having her share her life and stories growing up in the Usonian house built for her family. It is definitely worth touring this very uniquely designed Frank Lloyd Wright pod home, which is only one of two built. The home is in the process of restoration but elegant nonetheless. Byrd told us it will be restored to  its originally designed plans.  Visitors may photograph the exterior only.",
   "Alcohol and cocaine had been a great part of my life for 24 years. It was amazing at the start as It would make me feel invincible  and make me fit right in but my SOLUTION became my PROBLEM as the years went on. Because of this place, feelings of Calmness/Happiness and Joyfulness come up as I am writing this.  Feels AMAZING NOT to be as physically,emotionally and spiritually broken anymore and it's a work in progress. Keeps getting better everyday.",
   "Delighted to visit here.We had an informative talk outside by Pat ,and inside by Byrd,the  gorgeous daughter who grew up in this special place.Such a lovely view.Enjoyed the trail walk.",
   "So cool to see FLW house in a neighborhood setting.  Hard to see from the road.  Wished we could have been there on tour day.",
   "I have been volunteering at Spring House for about 2 years now and it has been one of greatest experiences in life.  Of course being able to hear wonderful stories about life and growing up in Spring House from Byrd makes it that much more amazing!  It is definitely worth working into you itinerary."
  ]
 },
 {
  "name": "Lafayette Park",
  "address": "501 Ingleside Ave, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8657e0b4-9334-11ea-9fba-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "parks",
   "walk",
   "nature",
   "field",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=18139155437992199394",
  "source": "GoogleMaps",
  "reviews": [
   "Now I really love this park! Great children's playground, trails, tennis court, & baseball field. The playground is far enough from the road (& downhill) that I'm more at ease compared to other parks. It can get crowded depending the time of day because there is a daycare/school next door. My kids love having other kids to play with so it just depends what you want that day. Again it's not always crowded, so just be mindful of the school days & times.",
   "Such a nice local park.  My daughter and granddaughter enjoy the trails and fitness items along the walk.  There is also pretty nature and birds in the trees.",
   "The tennis courts are nice. There are 2.the playground is for all ages. There are 2 of those also. They have a cemented area for basketball which is nice. They have a softball field but the clay is hard. It's actually pretty nice though. The outfield has very plush grass. Good for Frisbee, corn hole, whatever you like to do in the grass.",
   "It's okay.  The squirrels were cute!  Small but at least it's a place to get into nature. Beautiful huge magnolia!",
   "Beautiful covered park with a nice walking/exercise trail. The arts center is located in the park and offers a bunch of arts classes."
  ]
 },
 {
  "name": "San Luis Mission Park",
  "address": "1313 San Luis Rd, Tallahassee, FL 32304, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/86e490ac-9334-11ea-a849-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "nature",
   "field"
  ],
  "link": "https://maps.google.com/?cid=1628426596048144570",
  "source": "GoogleMaps",
  "reviews": [
   "Love this park. The lake floods and recedes very drastically, which is pretty to see. But, that usually exposes tons of trash. I wish people would not leave trash/animal droppings but the park itself is great and convenient to downtown. Plenty of trails with maps, a nice pedestrian bridge over the lake, great parking, etc.",
   "Went here with a couple friends and enjoyed a walk and talk. I explored the bridge as I had never been here before. 😯☺️🌉 Later we went to the cat cafe and I really recommend that place. 😸😽",
   "My friend had her son's birthday party here. It was 96° outside and it was the perfect park for this heat. The big trees provided great shade and the pavilion area was very well kept. I walked around to take in the sights and I loved it out here. Very nice park to relax in, hike, or have a party. I plan to go back and bike/hike the nature trails.",
   "Great little park, looking forward to exploring it some more! Went there for the dog park and we all had a great time.",
   "We always have fun. Great field trips. Awesome ppl working and volunteering (?) there."
  ]
 },
 {
  "name": "Fred George Greenway Park",
  "address": "4830 Fred George Rd, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8777d088-9334-11ea-8fe1-14b31f159f22.png",
  "tags": [
   "field",
   "unique",
   "kids",
   "walking",
   "kids",
   "walking",
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=5386466555932268581",
  "source": "GoogleMaps",
  "reviews": [
   "My favorite park thus far in regards to trails. Before the kids playground area (which is unique and fun all on its own) there is a small parking area with some wonderful trails. It's usually quiet and has lots of different paths you can take. They're all very different looking from one another (one has a lake, a large field, dense forest, and lots of steep hills). It feels like you're discovering new paths and mini ecosystems everytime you go. It's also excellent for dog walking.",
   "Its a great park.  Plenty of parking.  Ample covered picnic areas.  Huge trail and greenway.  Really pretty.  Grass could use some mowing tho",
   "I think this place is great for our community. However I am not a fan of the round about walking path that zigzags across the roads with stop signs for people, and I'm thinking about the little kids. I would love to see more development in the future.",
   "Ample amount of parking. Love the sidewalk encircling the park and beyond. You can walk your dog free from traffic.",
   "Nice park for variety of activities and sports. Boys were able to get their football training in with the Coach."
  ]
 },
 {
  "name": "SouthWood Golf Club",
  "address": "3750 Grove Park Drive, Tallahassee, FL 32311, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/87dde5a8-9334-11ea-8ec7-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10480347237277991940",
  "source": "GoogleMaps",
  "reviews": [
   "Very well designed and fun course. Greens were good except no. 17 needed work. Fairways played well.",
   "Great place and atmosphere",
   "Cool golf course, very fast and receptive (spinning) greens, hilly, and nice range and setup. The food was delicious and the staff were really nice. Overall a great place to go for a fun golf course.",
   "Sunday Brunch was wonderful. The presentation; service; care of the staff; and, quality of the food was spot on perfect. Highly.recommended.",
   "Course looks great even on a wet and windy day."
  ]
 },
 {
  "name": "Governor's Park",
  "address": "700 N Blair Stone Rd, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/88368d1a-9334-11ea-bc05-14b31f159f22.png",
  "tags": [
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=6654090482053280587",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome place to jog around. Plenty of open space and enough other people to not feel too creepy.",
   "What's not to like! A great place to stretch your legs and walk your dog! Be careful when it's close to dark some shady people start to show up.",
   "Be alert if walking alone, there are several \"camps\" throughout the trails, mostly near the train tracks. Never had any problems, but you never know.",
   "Beautiful wide open space.  Some connecting trails too.  They connect to Tom Brown Park!",
   "Great park! Pet owners need to pick up after their dogs more often though because there is way too much poop left behind. The park has beautiful sunsets. Love this once off the map park."
  ]
 },
 {
  "name": "Meek-Eaton Black Archives Research Center and Museum",
  "address": "445 Gamble St, Tallahassee, FL 32307, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/88a8fe3e-9334-11ea-a29a-14b31f159f22.png",
  "tags": [
   "free"
  ],
  "link": "https://maps.google.com/?cid=16415755330187273013",
  "source": "GoogleMaps",
  "reviews": [
   "A fabulous resource not known even to many native Tallahasseeans. This is a great resource in our area related to black life, achievements, struggles, and experiences. Well worth a visit by anyone, and certainly of use to any educator in the area. It is difficult to access because of lack of public parking, but that is often true of any resource on a university campus. But it's also free! Hard to complain.",
   "So underutilized because there is no way to access because of a lack of public parking.  What a shame.",
   "I love you it",
   "",
   ""
  ]
 },
 {
  "name": "A J Henry Park",
  "address": "A J Henry Park Dr, Tallahassee, FL 32309, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/89085cee-9334-11ea-afc3-14b31f159f22.png",
  "tags": [
   "kids",
   "structure",
   "kids",
   "family",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=6989279663578409606",
  "source": "GoogleMaps",
  "reviews": [
   "This is such a very nice little local park.  I like the trail in the woods and the boatdwalk/ pier over the lake.  There always seem to be LOTS of turtles hete which is nice to see.  They also have nice picnic areas and a nice kids playground",
   "Small and simple playground. Has a boardwalk overlooking a pond and it's fun to feed the turtles from it. Has trails and a 'hidden' basketball hoop.",
   "We had a lot of fun this evening! Playground, turtles, geese, eagles, trillium, and lots of other cool plants 💚",
   "Very nice place. Small dock and covered picnic tables. Flying bugs in summer so have some spray.",
   "My family has enjoyed AJ Henry since 1993. I spent a good amount of my childhood and teen years here. I miss how it used to look with the wooden playground structure, but the current one today seems to be enjoyed the kids. The nature trail is routinely maintained and well marked; it has a nice blend of not being too long or too short. Excellent for a runner like me who likes upward slopes, or if you prefer mostly flatland there is a loop around it. The creek at one part is a very lovely sight and can be fun to do some exploring around.  Sandwiched between Arbor Hills and and another neighborhood makes it a nice off the main road gem that's inhibited mostly by locals."
  ]
 },
 {
  "name": "Smokey Hollow",
  "address": "501-599 E Pensacola St, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/896b647a-9334-11ea-88c3-14b31f159f22.png",
  "tags": [
   "historic",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=10300064176536128227",
  "source": "GoogleMaps",
  "reviews": [
   "The garden is nice. Bathroom was locked.",
   "Gentrification is real.  For all those people who keep trying to convince me otherwise.  Check out this place!.",
   "My mom grew up here. There is nothing left of the neighborhood. Nice monument though.",
   "Finally a sense of place! Historical to boot!",
   "Beautiful historic area attached to the cascade parks area"
  ]
 },
 {
  "name": "Wakulla Springs State Park",
  "address": "465 Wakulla Park Dr, Wakulla Springs, FL 32327, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/89bf02e4-9334-11ea-94bf-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "kids",
   "history",
   "nature",
   "affordable",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=7641286194323240974",
  "source": "GoogleMaps",
  "reviews": [
   "Take the guided boat ride. Our guide, Captain Paul was knowledgeable and great. Saw lots of wildlife including Gators and snakes and tons of birds. I chose not to swim but there were quite a few people jumping in to the spring. Looking forward to coming back at another time if year to see different flowers and wild life.",
   "At $6 per car admission, it is a great way to spend a hot afternoon.\n\nThe \"beach\" area is great for little kids. There are also multiple platforms to hang out or even jump from. The swimming area is separate from the rest of the river, which is nice to keep the rest of the Springs from being damaged.\n\nThe hotel looks very cute from the outside. They also have boat tours, although I didn't check to see prices or other general information.\n\nI can tell that this place gets really full during the summer. The proximity to Tallahassee and FSU probably means lots of college-aged people. Not necessarily a bad thing, but something to keep in mind if that's not your scene.",
   "Very pretty and well thought out paths. Good mapping unlike the civil war park at the earthen bridge. Or whatever you call it. Pretty sure there was more trails but very poorly marked.",
   "Old school casual luxury at affordable rates. Charm galore. Gracious staff. Immaculate housekeeping. History and nature everywhere. Why stay at a chain when you're 15 minutes from magic?",
   "Love love this place!! There are lots of family friendly activities here!! From kicking back and taking the river boat tours to just walking the grounds or relaxing on the beach. This place offers a wide variety of activities for the whole family and also boosts a 5 star restaurant on site. Would definitely recommend visiting this place!!"
  ]
 },
 {
  "name": "Lake Talquin State Forest",
  "address": "Tallahassee, FL 32304, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8a1d9e0a-9334-11ea-92dc-14b31f159f22.png",
  "tags": [
   "hike",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=6594003448967034354",
  "source": "GoogleMaps",
  "reviews": [
   "Nice hike.  Please, please, please check the blazing of trees in the midsection of the central loop trail.  There's a gap of about 75 yards where Michael knocked down a lot of trees. I was lost, trying to get back to the trail head, for almost an hour. Kept the sun on my right and followed the stream beds and sounds of traffic.  But it was tense.  Park team, please let me know that you've received this message.  It was scary.  LATER: thanks for the call back, and for serving your team out to check",
   "Great ride thru the woods.well taken of dirt roads! Great fishing on the river.only bad part is the walk back to the parking lot from fishing all day! It's up hill all the way",
   "Best place to put your boat in and get lost on the water for the day. Or you can rent a cabin and stay for a while.",
   "Good fishing trip wonderful time with family very fun day",
   "Walked two trails that they have to offer as part of the Florida Trailwalker Program. Excellent park for trails and had a great time. If you enjoy hiking, check out the Trailwalker Program the Florida State Forest offers."
  ]
 },
 {
  "name": "Old City Cemetery",
  "address": "400 W Park Ave, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8a903d38-9334-11ea-aa7d-14b31f159f22.png",
  "tags": [
   "history",
   "tour",
   "walking",
   "wander",
   "history",
   "hike",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=11583632605966328104",
  "source": "GoogleMaps",
  "reviews": [
   "A sample of Tallahassee's rich heritage. Great history repository too for locating both African and European. As well as Cracker lore.",
   "Great self-guided walking tour. Takes about 45 minutes.",
   "This is a great place to wander around! The old Florida history is fascinating. The only drawback is the metered parking.",
   "Excellent historic place to hike and take photos.",
   "BABY and I watching the sunset \nADA of 1990"
  ]
 },
 {
  "name": "St. Mark's Lighthouse",
  "address": "Crawfordville, FL 32327, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8af14a58-9334-11ea-8dc6-14b31f159f22.png",
  "tags": [
   "hike",
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=7438815755965940600",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic birding.\nThe Rangers working the welcome center could NOT have been more helpful.\nAllot at least half a day to take your time, pull off the road, and hike a bit.\nIn fact this looked like a good park for bicycles.",
   "By visiting this beautiful wildlife refuge it brought back so many Wonderful childhood memories. As I was younger growing up in Tallahassee Florida we would love fishing with our Dad!! One of our familys favorite spots was St. Mark’s lighthouse just because it had freshwater on one side as well as the ocean salt water on the other. I remember spending countless hours my brother and I catching pin-fish that my dad would Cut  in half and use for his bait hoping to catch even bigger fish and sometimes even sharks!! Over the years my dad had caught thousands of fish from this location including an alligator gar, a hammerhead shark and a smaller great white shark. We would walk out into the ocean as far as we could go without having water over our heads and fish all day long until nighttime - having to run to shore as the tide quickly came up along with the moon!!! There are many different picnic areas around and several different wildlife viewing spots. There are the most beautiful colored birds and even very large birds - the largest birds I’ve ever seen. We’ve seen bobcats as well as huge hairy fire-red ants and even An entire army of migrating crabs. Years ago  there used to be tons of alligators everywhere lounging in the sun.. My mom even wants tripped over a gator that was laying across the path to our truck. It was so long , it stretched over the entire width of the whole path. I will never forget that time. Unfortunately due to the new gator hunting season,  I never see any alligators at all anymore.. it’s sad. Overall this is an amazing place!!",
   "This is an absolutely gorgeous place to be. The lighthouse is spectacular! So much to see and experience at St. Marks. If I came here daily I still could not get enough. I love this place!",
   "we went to see monarch butterfly festival and stopped by the light house which is 7 miles from the festival venue. we could see few monarch butterflies here. the place is good to spend some time. it was nice that they had free shuttle Van service from the parking. we liked the light house and the area surrounding it. it is definitely a must see if you go to St. Marks.",
   "I loved this spot for viewing wildlife and exploring as much as any place I have ever gone! Bring Misquote repellent! This is a Bucket list spot for anyone that enjoys the outdoors."
  ]
 },
 {
  "name": "DeSoto Site Historic State Park",
  "address": "1001 Desoto Park Dr, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8b53dbd2-9334-11ea-a1ef-14b31f159f22.png",
  "tags": [
   "history",
   "walk",
   "history",
   "knowledgeable",
   "knowledgeable",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=10272989580957925809",
  "source": "GoogleMaps",
  "reviews": [
   "A bit off the beaten track,but worth a visit if you have an interest in history.",
   "Where was the park, I drove in, parked, walk to the end of the gravel, it's another street. I did not see the statue or the park.",
   "An atmosphere stepped in personal history",
   "Definitely worth stopping in to check out the artifacts in this small musuem. The staff was great and knowledgeable!",
   "One of most historic place at the town, the artifacts was amazing and this is a very informative place to bring your child over, plus the staff is friendly and knowledgeable enough to entertain questions."
  ]
 },
 {
  "name": "Lake Talquin State Park",
  "address": "14850 Jack Vause Landing Rd, Tallahassee, FL 32310, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8bb8b864-9334-11ea-99e7-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=12247381430001128177",
  "source": "GoogleMaps",
  "reviews": [
   "An amazing place to spend the day. Not far from Tallahassee. The lake is very pretty and there are two decks for fishing or just relaxing. The lake is surrounded by trails which can be hiked in couple of hours. As fir the facility there is a restroom and a sitting area. There is a $3 fee to enter the park which can be wrapped in an envelope and dropped in a drop box near the entrance. Bring your food and water, because there's no vending machine inside the property.",
   "This park is the best park in the state of Florida. Great fishing and beautiful bluffs along the gorgeous banks of Lake Talquin. Not to mention the 1.1 mile trail that wonders through the pristine woods bordering awesome ravines with the lake as a background. Don't miss it.",
   "Beautiful park. Short boardwalk along the water.  Small fishing pier. Nice bathrooms, clean with soap and hand towels.  Huge pavilion and grill area that can be reserved.  There is a trail,  but we didn't venture - too hot, wet and  too many mosquitos!!!!",
   "Great place to spend some quality time",
   "Nice park good trails and nice docks to fish off of or just relax."
  ]
 },
 {
  "name": "San Marcos de Apalache Historic State Park",
  "address": "148 Old Fort Rd, St Marks, FL 32355, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8c1dbc78-9334-11ea-8aab-14b31f159f22.png",
  "tags": [
   "hike",
   "history",
   "history",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=12838539086311048829",
  "source": "GoogleMaps",
  "reviews": [
   "Small but wonderful little park with trails and great museum. The museum is very wheelchair accessible. The trails are good for a motorized scooter. Not a long hike, but well worth the visit.",
   "Such an important place in world history. I never knew. I've been educated now and I'm impressed and thankful. Great presentation. Helpful and informative Gentleman working there. Thanks, we'll be back.",
   "Small but incredibly important site. Native American, Spanish, American, and Civil War history all played out at this confluence of the Wakulla and St.Marks rivers.",
   "Awesome place to visit really historic",
   "The employee Bonnie there was very helpful finding a campsite for the evening."
  ]
 },
 {
  "name": "Wakulla River Park",
  "address": "City Park Ave, St Marks, FL 32355, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8c944bf6-9334-11ea-828b-14b31f159f22.png",
  "tags": [
   "kids",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=12961945811800280128",
  "source": "GoogleMaps",
  "reviews": [
   "Very well kept playground, river access, grass for fetch 🙂",
   "First time checking out the park.  For the size of the park descent parking.  Public bathrooms and canoe/kayak ramp available.  This is a low key relaxing place.",
   "My kids love this park and its a good spit for daddy to go fishing and kids to play. You can also have small weddings there because they have covered tables and bathrooms. The playground needs the toddler gym fixed after the storm.",
   "Quaint park with playground and event shelter. Great views of River and picturesque sunsets. Dock with kayak or paddle board launch. Nice!",
   "Very simple pretty parks very clean in the bathroom"
  ]
 },
 {
  "name": "USDA Forest Service",
  "address": "325 John Knox Rd, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8d12f222-9334-11ea-af4b-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=1714591028051816737",
  "source": "GoogleMaps",
  "reviews": [
   "Very helpful with expertise in forestry",
   "The young man was very helpful. The only problem was they weren't set up yet to process park pass. The office experience was still good.",
   "I would do minus... Pencil pushers .",
   "Great place for large meetings.  Held a company meeting here and it held a large group of us comfortably. The only problem was the AC unit when turned on became loud and you need a microphone to hear speaker. Staff was friendly and bathrooms were clean.",
   "Most offices are upstairs. "
  ]
 },
 {
  "name": "St. Marks River Preserve State Park",
  "address": "11950 Tram Rd, Tallahassee, FL 32311, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8d871112-9334-11ea-9a70-14b31f159f22.png",
  "tags": [
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=4723814696738168822",
  "source": "GoogleMaps",
  "reviews": [
   "What a great trail. We really enjoyed hiking through the park. Nobody else around that day, very peaceful with lots of deer tracks on the trail.",
   "Just the right amount of trails for an out and back day hike. Trails are sandy with most of it just plowed fire lines. It has the main trail with a few side loops for extra mileage. No bridge across the St. Marks River at the north side of the park, so unless there are drought conditions you can't cross without getting wet/muddy. You will likely be the only one hiking here!",
   "Great hike or bike. About 3 miles one way.  There are bears. Both times I visited I saw a momma bear and two Cubs (June 2019). They ran away but they do love in that area. \nAlso saw turkeys lots of deer and a few snakes and an owl and a small bird with an orange beek.",
   "This park is on former timber property that includes the upper Saint Marks River and a contributing tributary - Gum Creek. The area hosts many planted pines but otherwise is a really nice piece of property. Parts of the trail go through swampy areas closer to the creek (Gum Creek) and other parts go through higher ground. There are bay trees and large stands of native bamboo. The trail is at times former timber roads and at other times recently plowed trails. The footing is mostly sandy, swampy/damp or rough from ploughing/clearing. It seems like it might be difficult to use some of the trails in more wet conditions. I only walked the Yellow Blaze and southerly part of the Blue Blaze",
   "Great park for a bit of an adventure. Don't expect a gift shop, and wear ankle boots if possible. Lots of flooded areas and some creek and bog crossings on the yellow trail. Nonetheless this park is home to some beautiful scrub habitat, wetlands and teeming with birds, wildflowers and other creatures. Didn't see any bears unfortunately! In the summer I imagine heavy bug spray or even a face mosquito net is necessary."
  ]
 },
 {
  "name": "Doak Campbell Stadium",
  "address": "403 Stadium Dr, Tallahassee, FL 32304, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8df0e400-9334-11ea-9859-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "history",
   "structure",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9206499478166274016",
  "source": "GoogleMaps",
  "reviews": [
   "This is honestly my favorite place on campus. I come here to de-stress quite a bit despite not being a football fan. Love it.",
   "This stadium is loaded with history, and you can tell as you walk around outside—or inside—it’s massive unique brick structure. Midday games are deadly with the heat, the WiFi leaves much to be desired, and you still (at the time of this review) can’t buy alcoholic drinks and bring them back to your seat... But the experience is unmatchable!",
   "Only the best place in the world to catch a college football game.  FSU has done an incredible job with this beautiful stadium.",
   "Home games are crazy when FSU is worth a dime. Lately the tailgating is mild and can't fill the seats. Champions club is cool if you can afford it, but seats between the 30 yard lines are the best to actually see what's happening.",
   "Love this stadium. Huge stadium. Lots of food. Great tailgating and the pregame show is like no other. Fans are loyal and the atmosphere is awesome."
  ]
 },
 {
  "name": "Apalachicola National Forest",
  "address": "FL-12, Sopchoppy, FL 32358, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8e4e94d2-9334-11ea-b0bb-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "hike",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=13492622232256204826",
  "source": "GoogleMaps",
  "reviews": [
   "The trails here are expansive. Get outside and enjoy some natural Florida.",
   "When walking in the woods you must always carry I love Florida laws",
   "I love it because there is some of the best fishing in the world and some of the creeks and River that anyone could ever day we do it all the time we go down and stay a week at a time or more and fish and it's not far from the beach so you can go to the beach st. George Island and it is a great place to go but I love that Apalachicola River it is one of the best places in the world and you can go to River Styx or Shepherd slow or go to Owl Creek and put in and fish I got two gardeners Landing or bloody Bluff all are great places to go fishing you will love it as much as we do I have been doing it all my life I'm originally from Apalachicola but I no longer live there but I go back as often as I can to the forest to fish and if you want to go into the national forest there is plenty of creeks and things where you can fish and catch plenty of fish out of them as my son and daughter-in-law just to have done they caught 30 and no time open what they call Tate's hell which they had a great day so I hope you all appreciate the update and that black color National Forest it is a wonderful place to come and visit and to camp or walk the trails or just fish so enjoy like we do thanks",
   "Oh it was so serene and beautiful.  We had a wonderful picnic and really enjoyed our hike.",
   "Peaceful spot to enjoy the nature of Northwest Florida."
  ]
 },
 {
  "name": "Challenger Learning Center of Tallahassee",
  "address": "200 S Duval St, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8eb4d162-9334-11ea-9c5a-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2431240826809303889",
  "source": "GoogleMaps",
  "reviews": [
   "The best IMAX screen in town. Nice staff & a good selection of current movies & documentaries. They also have a planetarium with a nice selection of shows.",
   "Fun place to visit. The Imax theater is a full Imax and is only $10 for 1st run movies.",
   "Best imax experience in town, other theaters advertise a display that projects to imax resolution, but once you visit this place you will realize what a lie they sell you at such a cost.\n\nThe popcorn and treats here are far more reasonably priced than a chain movie theater.  I won't lie and say the seats are great, watching a two hour + movie in there will hurt your bum.  But I have only noticed while watching movies that edge three hours.  \n\nThey have kids programs here, a planetarium as well as other activities that are worth exploring if you are looking for things to do that won't kill the bank.",
   "Love IMAX.   BABY ADA of 1990.  Service animal",
   "My wife and I love to come here. We respect the fact that the Challenger learning center charges reasonable prices for Imax movies. We feel that other movie theaters do not usually live up to there $+13 price tag. We use this opportunity to support this public location. Relatively clean building with friendly employees."
  ]
 },
 {
  "name": "Gulf Specimen Aquarium",
  "address": "222 Clark Dr, Panacea, FL 32346, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8f123380-9334-11ea-a993-14b31f159f22.png",
  "tags": [
   "eat",
   "affordable",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1947316910391332981",
  "source": "GoogleMaps",
  "reviews": [
   "Small but great value! Hands on opportunities. Nice staff. Affordable gifts. Only $10 for adults. We watched an octopus eat a fish. Very cool",
   "1 of the coolest places in Florida I have seen. I love the old school interactive vibe. I cant wait to bring my family here. Super educational and the staff is wealth of knowledge. This place is a must see.",
   "So much to see! Volunteers & staff know their sea critters & aquatic facts! Atmosphere is that of a semi-outdoor working lab, rather than an aquatic \"petting zoo (which happens, too!).\" Director Jack Rudloe, author of the memorable book, \"The Living Dock at Panacea,\" often leads off group tours with a brief talk, and is available for questions and feedback. Take lots of pictures!  An updated version of his book is in the works, and soon to be available. I Love this place! Support it, please!!!",
   "This was a great family outing for the day. A lot of the specimens were hands on. My nine year old granddaughter had a great time and I did too.",
   "Recommend to place for everyone,  young & old alike! The highlight of my trip, so very, very, interesting. Took awesome videos & pictures!"
  ]
 },
 {
  "name": "Wakulla Beach",
  "address": "00-00-119-000-11951-000, Crawfordville, FL 32327, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8f58d988-9334-11ea-88ad-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=17734576586804471117",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to fish. You can drive all the way down to the beach and launch a small boat or kayak right into goose creek bay.  Good place to fish year round with lotsa creeks that hold fish through the winter when water temps drop and fish leave the flats. You can see dolphins way back in the creeks too at high tide. Speaking of tides, it helps to know them before you go, both times and levels. On negative lows the water gets REALLY low and if you’re not paying attention you can find yourself spending the next few hours stuck in the mud waiting for the water to come back in.",
   "My favorite public beach access. It is so beautiful and relaxing, it's my reset.",
   "Awesome place to see wildlife at the right time.",
   "Quiet not a lot of people and great fishing",
   "There's usually not too many people and the road to reach the beach is really and pretty! I don't like how brown the water is, but that's the color of most of the close by beaches!"
  ]
 },
 {
  "name": "Roadside Rusted Ford Trucks",
  "address": "Crawfordville, FL 32327, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8fc8b3da-9334-11ea-9c12-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=368933812211960519",
  "source": "GoogleMaps",
  "reviews": [
   "This is a place I stop every time I'm in the panhandle. The lighting here is magical for taking photos!  I've been doing it for years. Even the cemetery is getting old now. May the rust in peace!",
   "Beautiful place 💖 theres a lot of spiders and snakes so be careful, other than that it's very peaceful.",
   "Awesome place to stop if you're into classic vehicle 😊",
   "Cool spot to pull off and check out some old rusty vehicles.",
   "May they rust in peace"
  ]
 },
 {
  "name": "Taylor House Museum of Historic Frenchtown",
  "address": "442 W Georgia St, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 3.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/903a3970-9334-11ea-8ee1-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=1443487963122664731",
  "source": "GoogleMaps",
  "reviews": [
   "Police order outside says no trespassing...",
   "This place is a must see! Lots of antiques and other gems in the house.",
   "Not very interesting",
   "Good place to visit some time",
   ""
  ]
 },
 {
  "name": "Letchworth-Love Mounds Archaeological State Park",
  "address": "4500 Sunray Rd S , Monticello, FL 32344, Monticello, FL 32344, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/90b7ce50-9334-11ea-8942-14b31f159f22.png",
  "tags": [
   "hike",
   "nature",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=4537181870021409529",
  "source": "GoogleMaps",
  "reviews": [
   "Interesting little stop that we stumbled upon. Didn't go down the trail, but the mound was awesome. There is more to it than just one mound, but for some reason those pictures were not options for me to upload.",
   "Tranquil, but do wish there was more explanation of area, such as the artifacts they found and better description of mounds.  Do wish they would cut rubbish away from big mound so that one can see it better I expected something more",
   "A great place for a stroll or nature hike.",
   "Peaceful, pleasant, and clean picnic park adjacent to the highest Native American mound in Florida. As a State park, a parking fee is required in exact change with a fine attached.",
   "Great place to visit and learn about ancient peoples. There's a pavilion with picnic tables and interactive displays."
  ]
 },
 {
  "name": "Sage Restaurant",
  "address": "3534 Maclay Blvd S, Tallahassee, FL 32312, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9127a768-9334-11ea-8842-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "creative",
   "performance"
  ],
  "link": "https://maps.google.com/?cid=5179821047650576135",
  "source": "GoogleMaps",
  "reviews": [
   "Bottomless mimosas, with savory contemporary American food with southern influences. This north side gem will not disappoint. The herb and cheese omelet was amazing, I added the lump crab and Alaskan crab to it, and made heavenly. The vanilla malt cheese cake, was the perfect way to finish a wonder brunch meal. I highly recommended asking for Mairin, she will move mountains for you!",
   "Had another wonderful brunch at Sage today. My husband and I had the Bloody Mary's then shared the deviled eggs. The drinks had the most interesting vegetables, pickled okra, a pickle slice, radish slices, olives, thyme sprigs, and grape tomatoes and were very good. He ordered the French Toast which came piled high with fruit. He gave me a small bite which had a syrup that wasn't too sweet.  I had the Poached Eggs on Crab Cakes which came with mixed vegetables. The eggs were cooked perfectly. Then for dessert he had ice cream, 1 scoop of vanilla and 1 scoop of chocolate malt. Both were made there. I had the key lime pie with a coconut crust covered with marshmallow cream-need I say more?  It was SO good. Everything was perfectly prepared.",
   "Make sure you have a reservation, we were lucky enough to get in early and there was seating available in the \"bistro seating\" aka bar area. Woody (the bar tender) was great. It started to get busy after we sat down so things took a bit. But patience is a virtue, especially waiting for food like this! Everything, including the drinks, was amazing!!!",
   "This place is a favorite of my wife and I. We come here almost everytime we have a date night. The bartenders are always nice and the food is always good. Great coffee",
   "We tried this restaurant recently. We took seats at the bar and ordered drinks. Friendly bartender and we liked the room and the vibe all around. We tried a couple of their apps, all creative and good. We left wanting to come back, sit down and have the full performance."
  ]
 },
 {
  "name": "Backwoods Crossing",
  "address": "6725 Mahan Dr, Tallahassee, FL 32308, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/918f6a34-9334-11ea-9095-14b31f159f22.png",
  "tags": [
   "food",
   "foodie",
   "creative",
   "food",
   "delicious",
   "eat",
   "walking",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3529826969308687226",
  "source": "GoogleMaps",
  "reviews": [
   "This. Let me find the words. This is a delectable gourmet restaurant that you would imagine to be featured on the Food Network and the idea that it has not been ... YET. Well. Let’s hope this review takes you to this hidden gem before a wait list is made to get in the door. Nestled by a vegetable garden, right off I10, Backwoods Crossing is a white cottage on the outside and a sleek dining experience on the inside. The Seafood Heaven is an upscale spin on shrimp and grits and the Hen on the Hog a cordon bleu remaster. I cannot stress the importance of this hidden gem! These are the places that make being a foodie so much fun.",
   "Everything was very tasty and the wait staff was friendly. Started with the best mozzarella sticks we'd every had. I had Hog in the Henhouse and my wife had the Beast burger. Highly recommended!",
   "We had an amazing experience at Backwoods Crossing tonight! Symone was our waitress and she was friendly, attentive, and helpful. We would love to have her as our waitress again in the future! The food was so wonderful--very fresh and flavorful. We can't wait to try more of the menu as soon as we can! The star of our meal was the dessert. It was creative and out-of-the-box and by far one of the best we've ever had dining out. Thank you for a lovely dining experience!",
   "Had the beef tips salad with bacon dressing.  Absolutely delicious.  Service was excellent.  Everyone enjoyed their meal.  Walking in the garden seeing the quail turkey rabbits and chicken was fun.  Great place to eat.  Looking forward to going back!",
   "Wonderful food, well-executed, fantastic service. Friendly atmosphere, relaxed and welcoming. I enjoyed walking the garden out front and all the specials incorporating seasonal ingredients. Would have been a 5-star review except for the use of Mason jars as beverage glasses. We were served a beer in a Mason jar. Get some actual dishes, please."
  ]
 },
 {
  "name": "Cypress Restaurant",
  "address": "320 E Tennessee St, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9208e028-9334-11ea-994f-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8853798778283285763",
  "source": "GoogleMaps",
  "reviews": [
   "We had a wonderful dinner at Cypress. They have a valet outside if it gets really busy so it’s very convenient. It was very close to our hotel and I saw the high ratings so we thought we give it a chance. The waiter was very professional and when asked which items he preferred, he gave us honest answers. We started with the pork cheeks appetizer which was sublime. It was so tender and delicious. We both got the hanger steak, which was perfectly seasoned and even had a little bit of a kick to it. The mashed potatoes were delicious. I highly recommend this restaurant.",
   "One of the cleanest and neatest restaurants I have been in Tallahassee. This is so important factor to me that I started my review with. I had mushroom 🍄 soup 🥣 which was delicious and I recommend it to those who like their soup creamy instead of watery. We had butter lobster 🦞 and steak 🥩 big dishes. Both very tasty! The service is good and staff are nice. Great place for special occasions!",
   "I only got to go there once.  I want to go again.  The only thing I did not like about it was the big scary trucks whizzing by on Tennessee Street,  LOL but that's not their fault.  I found the atmosphere cozy and warm and I recall our server being very attentive.  The scallops I had there were the best and I do mean the best scallops I've ever eaten,  bar none.  Kudos!",
   "What a wonderful place! Friendly staff, comfortable surroundings. I had a delicious red wine recommended by the staff with a delicious bowl of French onion soup.",
   "Went here to celebrate an occasion. Had heard about the renovations and thought it would be fun to visit and see the changes. To our disappointment, it really hasn't changed much and even worse, the quality of food has drastically declined. We won't be going back here for a very long time. Hope they are able to bounce back and make some major improvements so the quality of food served matches the prices they are charging."
  ]
 },
 {
  "name": "Kool Beanz Cafe",
  "address": "921 Thomasville Rd, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/92906036-9334-11ea-b0c3-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "tasting",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1869525636836525950",
  "source": "GoogleMaps",
  "reviews": [
   "Our favorite place to eat in Tallahassee...food choices vary frequently but they keep several of the staples on the menu such as the steak...my personable favorite, along with the lettuce wedge. Food is always fresh and made to order. They allow corkage for a reasonable charge of $10. No reservations taken so we try to arrive early so we don’t have much of a wait. Service is good. We enjoy sitting at the bar to watch the cooking.",
   "Kool Beanz never fails to offer interesting and great tasting food. Every time I go back there are old favorites along with new delicious entrees. There is also a good wine list to compliment the food.",
   "Best fine dining in the capital city! Rotating menu but always something good on tap. Great seating, eccentric flavors and staff, a joy every time we come to Kool Beans. Get there early because they stay PACKED and parking can be limited in peak hours. Save room for the homemade desserts, you’ll regret if you don’t.",
   "Great food, helpful staff, cute atmosphere. There's a pretty big patio, but inside seating is limited. I would suggest making a reservation. There's an open kitchen so you can watch the magicians behind the counter cook your food. We probably ordered too much but everything on the menu looked amazing! \n\nBe aware that the menu changes daily, so if you're like me and prefer to thoroughly research before going somewhere, try to go in with an open mind. You won't regret it!!!",
   "Absolutely amazing!  I enjoyed my meal from the cafe style bar with a full view of the culinary artists preparing the food.  My meal and service were impressive, ambiance impeccable.  One of the best recommendations I've ever received.  Kudos to the team at Kool Beanz!"
  ]
 },
 {
  "name": "Bella Bella",
  "address": "123 E 5th Ave, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/92ffc41c-9334-11ea-a206-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "delicious",
   "knowledgeable",
   "eat",
   "food",
   "delicious",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=16951089876342662239",
  "source": "GoogleMaps",
  "reviews": [
   "We had such a beautiful mother and daughter group meal here. It’s such a cool building and the food is fresh and delicious",
   "I love this place. I wish it was around when I went to college in Tallahassee. It's a very large restaurant but it's broken up in sections so it feels intimate. Very cozy. The bubble bread is to die for. Last time I was there I had one of the specials. I think it was some sort of mushroom ravioli delicious. Friend had the lasagna which is always a winner. Staff is young but very and know how to do their job well. There is a great bar for waiting for a table. They have very good house wine. it's family-oriented but also a great place to take dates or for anniversaries.  Always a thumbs up.",
   "Was invited here for a double. Fantastic, eclectic experience with world-class chefs producing delicious meals. This almost beats every other restaurant, is priced perfectly and even when packed—has the capacity & service to deliver. We love this place for Italian Traditional, Seafood dishes, and dynamic salads.",
   "I love Bella Bella and eat there often. The ambiance, the food, the staff are always friendly, knowledgeable and efficient! When I eat there with friends, they ask me \"What's good here?\" and I always answer with confidence \"Everything!\"",
   "Great experience and a calm atmosphere. The servers are always attentive and polite. The portions fit the price, and while the menu is short, it offers a great deal of fresh variety. Many of the items are prepared unique to Bella Bella, so even dishes you have tried elsewhere may tingle your palate in a different way. Overall it was a wonderful experience, and we will definitely be returning in the future. (PS. Try the Bubble Bread, it is delicious and melty.)"
  ]
 },
 {
  "name": "Ted's Montana Grill",
  "address": "1954 Village Green Way, Tallahassee, FL 32308, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/936033a6-9334-11ea-afff-14b31f159f22.png",
  "tags": [
   "delicious",
   "kids",
   "family",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8727032186657135686",
  "source": "GoogleMaps",
  "reviews": [
   "A friend and I visited on a Wednesday around 12:30 pm, during lunch rush.  The place was packed (always a good sign) and there was a short wait, but seating inside and out to sit while we waited.  The inside has a really great atmosphere, upscale casual, with many patrons wearing white collar business attire, and also intimate.  The lighting was dim, but not so much that it is hard to see what is being served.  The staff was pleasant and service was prompt.  My friend and I both ordered a burger, he tried the knife-and-fork and I got the Avalon.  I loved my burger!  The flavors of the arugula and cheeses were rich, but paired perfectly!  I would definitely order something different next time with faith that it would be equally delicious.  My friends burger was very good, especially if you like a little spice.  It was spicier than I expected but someone looking for a little giddy up with their meal would really enjoy this burger!  For two non-alcoholic drinks and two burger entrees, plus a 25 percent tip, the bill was about 50 dollars.  A little pricey to just satisfy a burger craving on a lunch break, but the service and ambiance was well worth it!  I'd highly recommend visiting this establishment and hope to do so again soon.",
   "We brought my in-laws family here last Sunday (Father's Day). The steaks were great. We ordered both beef and bison to compare the taste, flavor and texture. I like both. Bison was just a bit chewier than beef. One of my kids liked bison and the other preferred beef. My father in-laws thought bison was more flavorful and a bit sweeter than beef and he loved it. The Chili soup was one of the best. I like the fresh pickled cucumber but the rest of my family didn't. They didn't serve bread and butter at beginning and all of us preferred that way so we could enjoy the main meal better.",
   "Solid four.  Ted's is on the higher side of casual dining with an unpretentious vibe.   Sort of reminds me of places I've been out West, San Antonio so many years ago.  Jyes, bison's on the menu.  \n\nLove the space, the feeling.  Everyone was especially nice front to back.  Popped in this time for drinks and snacks so we sat at the bar ...all the way down unnecessarily for whatever reason open facing the line cooks, which was actually fun because they sort of indulged us with soft interest like sitting in with the chef.  Was fun.  Burger came to order spot on, good luck with that elsewhere.\n\nBeen in a number of times passing through town over the years, sort of look forward to it.  We need you in Orlando.",
   "follow up 3-4-20 - after an uncharacteristic  disappointing visit I was contacted by corporate and sent a gift card and invited back for another try.  First of all, that action speaks volumes about Ted's and their customer focus.  Went back yesterday and everything was wonderful.  Appetizers, entrees and dessert: presentation, portion, taste and temperature were spot on and our server Emmanuel was on his game: friendly, respectful, attentive and efficient.  We will be back for sure !!",
   "Delicious, home style food, great service, great atmosphere. Love the private booths. Never had a bad experience here. They've been around a while, clearly they have the recipe for success. If you haven't been, go! You won't regret it."
  ]
 },
 {
  "name": "Midtown Caboose",
  "address": "1406 N Meridian Rd, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/93b866b6-9334-11ea-be7e-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11045835114069302165",
  "source": "GoogleMaps",
  "reviews": [
   "Nice ambiance,  superb selection of sandwiches,  burgers and main courses. Good selection of drinks.\nHelpful,  friendly service",
   "Excellent food, and plenty of it. Convenient mid town location as the name says.  Please support our local businesses and establishments during these \"viral\" times. Midtown Caboose is open for carry out. Call or order online before you head over, and your order will be waiting, and will be brought out to you.\n Enjoy! Five stars all around!!!",
   "Good atmosphere. Server was friendly and fast. Tables, chairs, utensils and menus were clean. Food was good and plentiful. I came here with my significant other and for two drinks and two burgers and fries the total bill was 35$ but we were full! (The sweet potato fried had cinnamon sugar on them.)",
   "Visiting in town for work, it was suggested we try this burger place for the \"Mac Daddy\" it was awesome as was the \"Liberty Bell\" a Philly cheese steak on a cheeseburger with garlic fries. To say it was Great is not enough. It was the best cheeseburger I have ever had in my travels!!",
   "Midtown Caboose offers a wide variety of specialty sandwiches, burgers, wraps and salads. My first tip is if you are going to check them out for the first time read their menu online ahead of time. There are so many choose and flavor combinations it can be hard to narrow down your selection. Each of their creations has been perfectly crafted to create the best flavors. Take for instance their Shepard's Pie Burger. Everything you love about a Shepard's Pie morphed magically into a burger! This burger is very filling and because of the mashed potatoes on the burger I suggest opting out of the fries for another one of their great sides. The servers are fast and attentive. They also have a great outdoors seating area out back."
  ]
 },
 {
  "name": "Table 23",
  "address": "1215 Thomasville Rd, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9425f52e-9334-11ea-a5b6-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7490529667940065067",
  "source": "GoogleMaps",
  "reviews": [
   "Our party of 3 ordered the brisket sandwich, southern Reuben sandwich, and the gumbo/southern salad combo. All entrees were delicious with generous portions. The sides with the sandwiches were outstanding and freshly prepared. The gumbo was perfectly balanced with flavor and spice. Additionally the sangrias (red and white) were very good. We enjoyed the outside dining area and would definitely recommend a visit!",
   "Beautifully relaxed atmosphere. Great for a date night. The food is phenomenal. I recommend the coconut shrimp and scallops. So good. We ate the shrimp faster than I could take pics.",
   "Two things that are difficult to find in Tallahassee... consistently delicious food and an awesome atmosphere. Love this place!",
   "Such a big fan of this place. Love the fact it’s family owned and operated. Food is amazing, staff is attentive, and the location is just beautiful. Table 23 is a consistent favorite of mine. If you enjoy pork, please try the 3 little pigs as it is so full of flavor and just great. Drinks are also great here too!",
   "All I had heard about this restaurant was positive. I decided to try this restaurant the other day. The fact is that we got there 10 minutes before the kitchen closed. I had a fried catfish and my partner had a salmon. The salmon was honestly yummy. However, I had the worst catfish in my life. The crust was too thick and too salty. After I removed the crust, I got two 2-inch pieces of fish. I was shocked by the fact that the chef used very tiny portions of the fish to serve us. And, how he could make the crust that salty and thick. Not to mention that half of the fish was not cooked at all. The atmosphere, wait staff and everything else was great. Just don't go there anytime close to their closing business hour."
  ]
 },
 {
  "name": "Lucilla",
  "address": "1241 E Lafayette St, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/94882812-9334-11ea-91fd-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6014486627888929130",
  "source": "GoogleMaps",
  "reviews": [
   "The warm, comfortable atmosphere starts with the greeting at the door, extends to the wait staff and is present in the food. The Snapper St. Charles is our favorite dish. The fish is perfectly cooked and nestled on a bed of whipped potatoes and amply covered with crab meat. Fresh pecans surround the plate and a stack of sweet potato ribbons tops it off. All of the flavors blend nicely together with the excellent sauce that is never too much, however has a bit of a bite. Good selections of beer and wine, soft lighting and comfortable seating make for an excellent evening.",
   "The food at this place is amazing.  The service is excellent and the staff is extremely attentive.  I have been here a few times and it continues to exceed my expectations.",
   "Very pleased to have found such good food amongst all the chains and collegiate dives. Light elegantly prepared appetizers. Tasty entrees (loved the shrimp and grits). Nice wine selection. (no bar) Reasonable prices. \n\nDon't let the pizza hut exterior fool you... Great place for a good dinner!",
   "The conch here is amazing. It was very tender.I was given rice and mac and cheese. The owner left me Try the mac and cheese and it was amazing. It's considered Bahamian style Mack and cheese. It's well seasoned. It's not the typical mac and cheese. The owner actually cooks the food, which is very good. The inside of the restaurant is set up like it's still in bananas.",
   "I came for lunch with a friend and I had the snapper dish. Everything was cooked nicely and the portion size was good. The restaurant was a little slow in service.  The sauce on the fish was amazing. The mashed potatoes and the sweet potato ribbons could have used a little more flavor. I would definitely come back."
  ]
 },
 {
  "name": "Shula's 347 Grill",
  "address": "415 N Monroe St, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/94d8f680-9334-11ea-a0be-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=14474309664088012239",
  "source": "GoogleMaps",
  "reviews": [
   "We had a great dinner at Shula's to celebrate an FSU graduation. Very friendly staff, who seem genuinely glad to see us. The food was awesome. Two of us got the salmon dish, which was among the best I've had. The service was good too. The only gripe is that it took a longer time than usual to get the entrees. They were running full tilt that night. The manager gave us complimentary desserts which was a nice gesture.",
   "Good food, is it worth the value? Maybe. Staff was attentive and on point. We got the Scallop appetizer which was $21 for three tiny scallops,  yet pretty tasty. I got steak medallions which were also cooked pretty perfectly.  \nI don't know what it is,  but its hard to see the value when the food is almost bland compared to other places in town.  Creme brulee was good! I'm just not blown away.  Although if I had to return with no other options, I would. Hard sell for me.",
   "I wanted ribs but they didn't have any at the time so I had conch balls, Mac and cheese and collard greens for dinner. The food was very filling and good. Great seasoning on the food as well. First time here and will come back.",
   "Very good! Been quite a few years. Love the new menu!",
   "Lovely place! Joe, at the bar, was very knowledgeable and so caring with his work. Be sure to ask for their specials here! If you're looking for a steak and a steak well done then come here. \nPictured: Blackened Scallops. 14oz NY Strip with Parm Risotto and Roasted Corn."
  ]
 },
 {
  "name": "Masa",
  "address": "1650 N Monroe St, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9541cc0a-9334-11ea-b986-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food",
   "delicious",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5104008800273597501",
  "source": "GoogleMaps",
  "reviews": [
   "Nice place to eat lunch and dinner. Staff is very friendly. They have the best deals for lunch and they are very quick. Food tastes great. The menu has very good variety of food. Love their sashimi/sushi hand rolls. Plenty of parking at the front and side of the restaurant. The seating and light setup is really nice even at daytime.",
   "The food and service was great. I apologize for the pictures, I took them after we started eating. Lol we also enjoyed the plum wine as well. Its has a sweet and robust flavor to me.",
   "Love this place.  Always great service and quality food.  Staff knows menu very well so ask questions. Great atmosphere.  \n\nKeep coming back because it is good",
   "Their fried rice is not vegan, it contains eggs. Which I didn't realize initially but the staff kindly replaced my meal with an egg-free tufo-based after I called, for free. And it's delicious!",
   "Loved it!!! The food is amazing, this place is Talahasse's best kept secret! I highly recommend it"
  ]
 },
 {
  "name": "Clusters & Hops",
  "address": "707 N Monroe St, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/95a4398a-9334-11ea-819b-14b31f159f22.png",
  "tags": [
   "delicious",
   "walk",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1343636811464045304",
  "source": "GoogleMaps",
  "reviews": [
   "Ended up here after a softball game on a Saturday at lunchtime with 8 of us I was thinking we would wait forever. We were seated right away, and the server was great. Drinks and the appetizer were put in right away. I ordered a chicken, spinach, peppers and rice bowl. Hubby ordered the French dip sandwich. I hands down recommend the rice bowl, very good!!",
   "Delicious hidden gem of Tallahassee! They are a very small establishment so getting there early is advisable. However lunch is equally as amazing as their dinner menu. They also have a small shop when you first walk in that sells wine and cheese too.",
   "Cozy little nice place. You enter and find yourself in the rows of wine 🍷 We started with eggplant lavosh with truffle oil and goat 🐐 cheese 🧀 which was “very” delicious! Sole fish 🎣 and pork main dishes were tasty and beautifully decorated. The staff share the details of ingredients when they serve your dish.",
   "This is my forth visit. I went with a friend last Fry and we shared some appetizers: of course the mac & cheese and the quesadillas and they were sooo good! I had the tuna tartar which was beyond words, for taste & presentation and my friend had the chicken pizza which was also amazing and plenty of food! So I’ll be back soon!!",
   "Wonderful experience and service! Decided to go out for a fancy dinner and Clusters & Hops came up. They do not disappoint! Food was excellent and had a wonderful presentation for each dish. The service was impeccable as well. \n\nThe only thing I could say about the experience, is I would like to see more cheese on the Cheese Board. That's a rather expensive cheese board for how little cheese you actually get. Other then that, the cheese was excellent!\n\nI highly recommend this place!"
  ]
 },
 {
  "name": "Bird's Aphrodisiac Oyster Shack",
  "address": "325 N Bronough St, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/960ac4a6-9334-11ea-b608-14b31f159f22.png",
  "tags": [
   "music",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7143649207605988209",
  "source": "GoogleMaps",
  "reviews": [
   "Great dinner, drinks, and atmosphere with live music!   I loved the Oysters Rockefeller.  Indoor and covered outdoor seating.  Small space, but great atmosphere.  Be aware that Bird's doesn't always offer table service.  If no one shows up to your table, order at the bar.",
   "Excellent oysters\nWe had a delicious lunch at this low key bar.  The oysters were just terrific - we had them raw and they were plump, fresh and juicy.  We loved our grouper sandwich with a large perfectly grilled moist grouper fillet!  It was quite reasonably priced too.",
   "Our agency catered  a meal from here, and I had a basic hamburger. Phenomenal quality for such a simple meal. I cannot wait to visit this place in my downtime and see what else they have on their menu.",
   "Great burger and beer joint.  Relaxed atmosphere and friendly service.  Try splitting a cheese burger and the bbq dogs (comes with 2) with a friend.",
   "I am an oyster fan and all, but I think their strong suit is their burgers.  Awesome! And this place is really fun.  Sometimes they stop table service when it is busy, so come here to have fun, not for a fine-dining experience, and you’ll be alright!"
  ]
 },
 {
  "name": "BJ's Restaurant & Brewhouse",
  "address": "1749 Apalachee Pkwy, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/96687400-9334-11ea-9c71-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=9496627799223664567",
  "source": "GoogleMaps",
  "reviews": [
   "Very friendly staff and lots of room. The menu is extensive and has something for everyone including a \"gluten\"free section. I was greeted by a very courteous hostess and was offered a seat at a table or I could take any high top or bar seat available so I chose the bar. My server was prompt and explained the menu and even recommended a couple of items. The food was very good and the portion was quite sufficient. The server was friendly and the service was excellent. I would eat here again if i am in the area.",
   "I had the Atlantic Salmon,  Broiled. It was awesome. Ate everything.  Came with this delicious sauce that made it go POW! lol\n\nNot spicy, not overly seasoned. It is seasoned to perfection and leaves you wanting more. I was stuffed! It was great. I will order again.",
   "We had a nice experience tonight. Clark was our server and he did a great job. He interacted with us well, he was very educated with the menu. The food was wonderful and it came out in a timely manner. We will definitely ask for him again next time we come in.",
   "To be honest this was a very different type of restaurant. They have amazing drinks by far.. In house beer, wine, liquor and more. I think that the menu might have been a bit pricey for the type of food that they were serving. Extremely Innovative but just different, for example the appetizer of the avocado egg rolls was very interesting. The pizza is always a great choice nothing like having brussel sprouts and asparagus on your pizza!! As always the sandwich was delicious so I do plan on coming back to this place mostly because of desert. which was a huge baked cookie and ice cream on top!!!!",
   "Truly disappointed. Ordered online and picked it up. Just got a salad but they put cheese on it when I customized the order and made sure cheese was taken out. Portion size was very small. I eat in the store all the time and I order the same salad: take out was 3x smaller and I paid $17 for it. Very disappointed and I will never order take out again."
  ]
 },
 {
  "name": "Wells Brothers Bar and Grill",
  "address": "1710 W Tharpe St, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/96c3b514-9334-11ea-95bd-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "cheap",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13199521472778047737",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped in for lunch - the burgers were awesome and HUGE! I had the Lip Smacker with a side of pasta salad. Absolutely delicious. They have a patio area in the back that is shaded with picnic tables and tables with umbrellas. Highly recommend this place to anyone wanting amazing food in a fun, laid back environment.",
   "This used to be my hands down favorite restaurant in town but ever since they reopened its been a disappointment. They halved the size of the menu, but more importantly they reduced the quality of the food. The burgers used to be big and like 1.5” thick and now they are about half that size, and they switched from real cheese to what appears to be Kraft slices (really??). The prices however are the same, why would I pay $13 for a burger the same quality as a $6 one at relish down the street? They also changed the inside, it used to be kinda cool and cozy inside with old wood tables and dark red paint, but know it feels like I’m in a psychiatric ward as they painted it off-white and replaced the wood tables with cheap plastic ones. I really don’t know why they changed the place everyone liked it before, I hope they return to their old menu and ingredients before people stop coming back.",
   "Wonderful place. The burgers are amazing, the option of being able to build your own burger is quite cool. The range of options can be intimidating but it's super fun to do. The staff are also quite  helpful. Also they have a 25% discount for FSU/DAMU/TCC students who have a valid id! Definitely recommend it.",
   "I was so excited for them to reopen, but am saddened by the changes. They downsized the menu, downsized the burger weight by 60-70%, and kept the prices the same or increased them. I had been a loyal customer for over a year, but I don't think I'll be returning. The only upside is their fries are still great.",
   "Good food with a lot of options. They are quick and food tastes good each time! Fair prices. Good parking each time. The place is actually bigger than it looks. There is large backroom with TVs. They mostly have sports on. Servers are students but they are quick and nice. Most importantly food is very fresh. They have the best sweet potato fries in town. Just give it a shot and you will not regret."
  ]
 },
 {
  "name": "Georgio's Fine Food and Spirits",
  "address": "2971 Apalachee Pkwy, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/971a5de4-9334-11ea-a828-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "delicious",
   "delicious",
   "educate",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17351542507468228590",
  "source": "GoogleMaps",
  "reviews": [
   "My husband took me to Georgio's tonight for a quiet celebration of my birthday. It was just our second time there, the first being his job's Christmas party. Like the first time, the food and service were absolutely amazing!! He had the Delmonico steak and I had the Shrimp Scampi, and both were superb! I had a piece of Chocolate Mousse cake for my birthday cake and it was was heavenly. Nicole was a friendly & attentive server, and, of course, we were greeted by the owner when we came in. I'm already looking forward to the next time we done there!",
   "The absolute worst experience ever at a fine dining restaurant. Me and my family have eaten here on many occasions and just recently decided to order online. I ordered over $85 in food only for my driver to arrive and the bartender be rude and non professional about the order I know was placed! I was on the phone with my driver listening how rude he was. Sad to say me and family will NOT be back and I will review throughout....On another note my driver was extremely professional and all around great.",
   "The Delmonico steak was seasoned very well and cooked to the requested temperature. My server, Taylor, was fantastic and recommended a glass of Malbec to accompany my meal, which was delicious! Taylor helped to create a great meal. The owner, Georgio checked on me a couple of times as well. You will not regret a visit!",
   "Great experience at this restaurant!  The grouper fingers, ribeye and carrot cake were all delicious and fresh! Brian, the bartender, went above and beyond to educate us on the menu and its offerings!  I will be back!",
   "Classy but not overdone restaurant and lounge that pulls off being kind if homey.  The wait staff were very attentive and friendly.  The food was high quality and presented well.  Prices were a bit high, but not out of character for the area.  This would be a great spot for a gathering if you have a group - I saw several groups enjoying themselves.  It also had some quieter more private booths which would be ideal for a romantic dinner.  I chose from the specials menu, a beef bourgeois pot pie - delicious and perfect!"
  ]
 },
 {
  "name": "Cabo's Island Grill & Bar",
  "address": "1221 Apalachee Pkwy, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/97764992-9334-11ea-9d2e-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10172658066499554306",
  "source": "GoogleMaps",
  "reviews": [
   "Prices have gone up a lot for basic food.  Most better burger places around tallahassee cost around the same price.  Chips and salsa are still good and it's nice to get them with a burger.",
   "ALWAYS fresh food and superior service. Their salsa (both hot and mild) us delicious. They also have plenty of vegetarian options and do not use lard. Great for lunch, dinner, or brunch!",
   "2 stars for food and 5 stars for customer service. Ordered fish tacos and shrimp tacos, both were bland and the salsa tasted candy sweet. It was interesting. Food is overpriced. The service was great though. Servers were attentive and friendly.",
   "My family loves coming here! I am a pescatarian and there are so many food options for me here. The customer service is amazing, and everyone is so sweet. Also the decorations with surf boards, and photos throughout the years give such happy, wholesome vibes! I ordered a vegetarian black bean burger and it was the best i have ever had! I wish I could give a higher review!",
   "Service is what we came to expect (good, professional and nice). If you want a great all American hamburger, go to Cabo’s. If you are not really hungry, order the 1/4 pounder. But the 1/2 pounder is A LOT. The French Fries are so good. My spouse and mother love the chicken tacos. I’ve eaten the beef tacos and they are great to."
  ]
 },
 {
  "name": "Azu Lucy Ho's",
  "address": "3220 Apalachee Pkwy #13, Tallahassee, FL 32311, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/97e426f6-9334-11ea-9702-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1595551024604007552",
  "source": "GoogleMaps",
  "reviews": [
   "As a Virginia (coastal) native, I’ve literally never had better sushi in my life. The quality of the fish is very apparent upon eating it initially, and the leftovers are almost nearly as fresh and inviting as the original product. Overall one of the best restaurants I’ve ever had the fortune of dining from, 10/10 would definitely recommend.",
   "This Benihana has been the most consistent and convenient out of all the locations I've visited down here. Parking is easy, food is consistently good as well as the chefs and servers. One thing I would suggest is making a reservation. Walk-in times can be pretty long for dinner.",
   "Great job! Good was served Hot and fresh, Great customer service. Love the Reno!",
   "First time trying the Seafood Fried Rice was very good.  I was excited to return with a friend.  Second time, not so good.  The shrimp, salmon, and scallops have a light coating of something, maybe cornstarch, which is unique, however this time, the seafood just tastes...  wet.  Like it was previously frozen and just barely heated?  I don't know, but we'll probably stick with our favorite place: Kiku.",
   "Haven't eaten here in over 10 years. The first time I ate here the food was wonderful. But I ordered food last night for me and my husband, it was my husband's first time trying this restaurant. But the food was horrible the food tasted burnt the beans that they put on my general chicken was burnt there was so much sauce on it you can not even taste the chicken."
  ]
 },
 {
  "name": "Sahara Cafe. Mediterranean Cuisine",
  "address": "1135 Apalachee Pkwy, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/984e0c8c-9334-11ea-84d7-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "food",
   "affordable",
   "delicious",
   "delicious",
   "food",
   "knowledgeable",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18265557822649245900",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely 💕 place! Delicious and very authentic food. Our server Maddy was so sweet and made excellent food and drink suggestions. Everything was top notch and affordable. 👏",
   "I have been going to Sahara for years, but then somehow hadn't gone since their move until today. Hubby took me for lunch, and wow was it delicious! I had the gyro wrap (add feta), and it was absolutely amazing. I marveled over it multiple times. I was also impressed with the amount of nice, thick-cut meat on the wrap. It's not some dinky little wrap, this thing is full & hearty! My husband got the beef shawarma (add feta), which has french fries in it, and wow that was really tasty as well. The flavors of the 2 wraps were completely different, but both equally yummy. I will definitely be back again soon, and not let so much time pass again before returning! Two thumbs up for sure!",
   "Amazing authentic middle eastern food! Went there for a business dinner and their staff was very helpful and attentive. The food is delicious. We ordered 5 different plates and were not disappointed. There is a lot of food competition in this area, you can’t go wrong with this choice.",
   "It wasn’t awful but they were out of Greek Salad and service was real slow initially. There was a lot of meat but the food tasted just meh. Two plates and Two drinks cost us $45 +tip..probably could have been better spent elsewhere. Our server was polite and knowledgeable but it just wasn’t the 🌟 🌟 🌟 🌟 (4.7 star) place online claimed. Maybe it was just an off night. i can see why people like it I’m just not sure if I’d do dinner again.",
   "Tried and enjoyed the delicious Chicken Shawama Plate and the Combo plate-has both chicken and Gyro meat.  For dessert we had Baklava Walnut and Baklava Pistachio.  Excellent food, service and ambiance!"
  ]
 },
 {
  "name": "Shell Oyster Bar",
  "address": "14 Famu Way, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/99212178-9334-11ea-9ee0-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=2522862605249556556",
  "source": "GoogleMaps",
  "reviews": [
   "It just doesn't get any better than this. One might easily overlook this former gas station but in doing so would miss some of the best seafood in north Florida. It's nothing fancy but the food is divine. The homemade cocktail sauce is practically worth the trip. I can't resist the oysters on the half shell or the seafood platter.",
   "This place is the very best for fresh shucked oysters, seafood and the best home-made slaw ever!",
   "The BEST oysters and fried shrimp in town.  LOVE this place.  Have been eating at Shell for 20+ years and have NEVER been disappointed.  Great family owned business",
   "Great food. Great service.  Great atmosphere. The very best raw oysters and fresh fried local seafood. Best by far in Tallahassee. No other seafood compares in Tallahassee.",
   "This place is a hidden gem in Tallahassee. The food is amazing! I visit during lunch and am in the door as soon as they open as the place is small and they fill up fast! Once you’ve had their nuked oysters, you’ll see why. As you’re walking in, the waiters are taking your orders and by the time you’re seated, you have drinks and apps served. This place moves fast. But you don’t feel rushed. Everyone is super friendly. Don’t come in expecting fine dining. Your food is served in reusable baskets, with packaged silverware and paper cups. But who cares when you’re being served fresh, hot seafood and great sides! The only downside is that they are CASH ONLY which can be a bit inconvenient for those of us who rarely carry cash. Other than that, I have no complaints. Love this place!"
  ]
 },
 {
  "name": "Wahoo Seafood Grill",
  "address": "2714 Graves Rd, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/99797b08-9334-11ea-bb4a-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "free",
   "food",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=12344846570673501508",
  "source": "GoogleMaps",
  "reviews": [
   "I went on Monday for the ALL YOU CAN EAT crab and it was simple but great. Service was excellent. It wasn't like some restaurants where they have you wait between refills, rather they replace your crab before you even finish. They keep you topped off. Crab is well cooked with Old Bay and is brought to the table hot. You can get light, medium, or heavy seasoning. I recommend lessening the seasoning as your feast goes on. I also tried the Mac and Cheese because other reviews recommended it, and it was also delicious. Reminded me of a sharply flavored pub cheese dipping sauce. They encourage you to get your money's worth and more. I will definitely be back.",
   "I went here to celebrate two of my friends birthday. Our party of eight had a awesome time. The food was good. We tried the majority of their appetizers which were great. We were full by the time our main course arrived. The staff was very courteous and attentive. Our birthday patrons also received a large peice of key lime pie for free.  What more could we ask for.👍🏾",
   "This is a really good seafood restaurant for someplace not on the coast. Fried shrimp were excellent and the fries are delicious. I had the seafood jambalaya and it was excellent. It had just the right kick and lots of seafood. Very surprised to find this quality seafood inland away from the coast. We have also eaten at their Gainesville restaurant and both are worth trying.",
   "I recently took my family here for a seafood feast. The appetizers were great (gator tail and calamari). We got mixtures of boils and fried fish. The fried items we're done right with minimal breading and weren't greasy. It was all tasty. My only criticism is that you should consider adding more higher end beer options.",
   "Wow this place is awesome! On our way to Tampa we found this place and turned out to be one of our beat experiences in this trip. We ordered crab which was great and well marinated. The house made burger was a class upper than what I’ve hd so far. If it happens to go to Tallahassee make sure you visit this place."
  ]
 },
 {
  "name": "The Bada Bean",
  "address": "2500 Apalachee Pkwy # B, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/99f9598c-9334-11ea-9d9e-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10865322318377536074",
  "source": "GoogleMaps",
  "reviews": [
   "This is THE place to bring visiting family and friends. I visit or order on my own at least once a month. We love to stop by after Mass on a Sunday morning.I told my daughtera her husband and my ex who visits two times a year, how wonderful Bada Bean is. Now they agree and it's a regular to dine there when they come down. I love the pancakes.",
   "This has to be the best breakfast place in Tallahassee!  Been driving by this place for years and finally gave it a try... should have done that a long time ago.\n\nCorned beef has was perfect. All ingredients are fresh and great quality. Staff is friendly and efficient.  \n\nBetter get here early though it fills up fast.",
   "Wow, just WOW!   The nice valet dude at the hotel recommend this for breakfast.  We're so glad that we took his recommendation.  Sat outside on a beautiful day.   We at the Hot Brown and the Veggie Skillet (with a pancake side!).  Amazing!   We enjoyed it so much we thought we'd come back for lunch but alas we ran out of time. Next time though!   The service was excellent.  Def recommending stopping by here for breakfast or lunch.",
   "Cute little brunch spot that is buzzing with business my husband and I stopped in for brunch on a Sunday and were quickly seated. The resturant was packed but service was quick and the food was food. Their coffee bar is a nice touch and we were pleased with our visit!",
   "Love love loved it! This was my first time coming to Bada Bean with my family and we will definitely be going back. I had the farmer skillet with avocado and mushroom added. It was pure perfection 😍. My husband had the eggs Benedict which was amazing too. My kid had the cinnamon roll pancake. Everybody tasted everybody's food and we all agreed that each other's for was tasty. If you want a good breakfast or brunch in Tallahassee I highly recommend it. Mine was so good I would go back just to get the same thing. Food was perfectly seasoned and nothing extra was needed to make it delicious although next time I might try the Siracha 🤔. The service was great. Really friendly wait staff- not just the super cute young lady that served us."
  ]
 },
 {
  "name": "Andrew's Downtown",
  "address": "228 S Adams St, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9a5caf80-9334-11ea-8d47-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "eat",
   "delicious",
   "eat",
   "walk",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=12551827813792587028",
  "source": "GoogleMaps",
  "reviews": [
   "Really well done food. The Fino burger was phenomenal, to say the least!! Ryan was a great waiter as well.",
   "The lunch buffet was great. We appreciated it that the staff allowed us to eat when it was about to close. It suggests not only the kindness of staff but also a good working place that staff would like to walk extra miles to make commitment.",
   "Andrew's is a GREAT place to eat weather if your looking for a savory delicious bite to eat or just wsnt to kick back and have some drinks and enjoy the friendly bar staff they have a bunch of big screen TV'S and the friendly staff is always willing to put on what ever game you want to watch!! I highly recommend Andrew's!!",
   "I has the shrimp Florentine.  Fresh shrimp, shredded parm.\n\nFood came quickly and great temp.\n\nNice local downtown. Easy walk from local hotels.\n\nYou may see some politicians here :)",
   "Patio seating was great.  Sassy shrimp was delicious.  Florida Orange Cake was fantastic!Staff was very attentive.  I will definitely be back when I visit again."
  ]
 },
 {
  "name": "Maple Street Biscuit Company- FSU",
  "address": "1600 W Call St, Tallahassee, FL 32304, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9ab1fbb8-9334-11ea-87f2-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6257309085970220760",
  "source": "GoogleMaps",
  "reviews": [
   "I moved to Tallahassee 2 months ago and had trouble finding a restaurant that makes my favorite breakfast food, biscuits and gravy. This restaurant has the BEST biscuits and gravy in town! The sausage gravy was savory, and the biscuits are baked to perfection. I also ordered a vanilla maple iced latte and hash brown cake, which were equally as delightful. I will definitely be ordering from here again!",
   "Yes! They are open! \nHands down some of the best breakfast/lunch in town, and a perfect outing. They have a great system amidst the current quarantine conditions, so don’t hesitate to stop by. \n\nThe food is top notch, and very good. The squawking goat and sticky maple were BEAST!",
   "Maple Street Biscuit Company is a great place for a quick breakfast or brunch. Biscuits with all kinds of toppings are available for all tastes. The waffles are also an excellent choice. Variety of coffees are also brewed up. Very relaxed and casual dining. Give it a try the next time you are in Tallahassee.",
   "Yum! We visited the original location in St. Augustine, so when we were in Tallahassee with my father, I jumped at the option to take him. The food is great! Our group has a vegetarian, and she appreciates the mushroom gravy. For the meat-eater in our group, the 5 and dime is a hit! We also love their fresh OJ.  We'll be back again.",
   "Delicious food with friendly staff! \nIf you are not local to the area and enjoybiscuits, you definitely need to check out this place! Flaky biscuits, crispy fried chicken and rich flavored gravy! \n\nWill definitely come back when I return or am near the area!"
  ]
 },
 {
  "name": "Reangthai Thai Restaurant",
  "address": "2740 Capital Cir NE, Tallahassee, FL 32308, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9b0720c6-9334-11ea-ab48-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10892612268953759805",
  "source": "GoogleMaps",
  "reviews": [
   "I placed a grub hub order. pad Thai was missing some ingredients.. nuts, basil, and flavour. Also requested medium spice.... nope!! The Panama curry was watery/ dilute and flavours were amiss... disappointing.",
   "Big bold flavors with a nice finesse.  My family and I had a great experience here and the food was very good.",
   "Always my favorite place to go for really authentic Thai food. The mango duck curry is extremely good. Also, the specials such as pumpkin Curry and the Kings river are amazing too. Prices are a little pricey, but well worth it when you consider the owner buys things fresh and curates these recipes herself. She will come out and greet you and ask how your meal was. The Kings river may be one of the best meals I've ever had. One word of caution: spice is no joke here. If you can't handle spicy, be sure you get the lowest spice setting. Hot pushes it and Thai hot is even more intense.",
   "Atmosphere, service, and food was superlative. Pad Thai with extra chili sauce was amazing. Bangkok Chicken was perfectly prepared. We will definitely return.",
   "We could see this place being amazing. The coconut broth shrimp soup was great!!! The two entree specials we ordered (red snapper, and duck) had great sauce, plenty of good veggies but the meat on both dishes where over cooked. The fish was dry and duck was not what it could have been. We will definitely come back to try more soups, ice cream, and the curry dishes. \nSoups are great here!!!!\nFriendly staff and nice atmosphere."
  ]
 },
 {
  "name": "Coosh's Bayou Rouge Restaurant",
  "address": "6267 Old Water Oak Rd #101, Tallahassee, FL 32312, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9b5df3a4-9334-11ea-9c5e-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17222265821963186603",
  "source": "GoogleMaps",
  "reviews": [
   "I had been here one time before, several years ago but I never wrote a review. So here it is now.\n\nIt was great! The portions of food were large and I felt like there was good value for the money. The staff was polite and friendly too. Out party sat outside, so I cannot comment too much how thr atmosphere was inside, but it seemed nice. Everyone (including myself) enjoyed our food :)\n\nI'd you like Cajun food, give it a shot!",
   "One of the best places to eat in Tallahassee. Locally owned and amazing food. You have to try the shrimp and grits.",
   "This was the best meal I have experienced since arriving in Tallahassee! I was expecting basic....but everything was perfectly seasoned, hot, and quick service.  The atmosphere is warm and inviting. I was even impressed by the blue cheese dressing for my salad! Best I've ever had!",
   "I love Cajun food I've been to a few places around town and this place by far serves the best tijan deliciousness you could ask for. If you're from here or if you're not from here and you want some good Cajun food please try Coosh's. Not only is the food great, but you have really good customer service. This is a great place it's a great part of our community and what makes this place really special is that they're just plain honest. I cannot wait to return and eat some of that good food.",
   "The food tastes so fresh! Our waitresses was very helpful and assists in our order. First time here and we will be back!!"
  ]
 },
 {
  "name": "Liberty Bar and Restaurant",
  "address": "1307 N Monroe St, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9bc65294-9334-11ea-9461-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "knowledgeable",
   "drink",
   "food",
   "creative",
   "food",
   "delicious",
   "drink",
   "food",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=8270682803844547283",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place. The food is excellent and unique and the bar has a great selection of excellent options. The staff here is friendly and knowledgeable and always happy to answer any questions you have and to help put together just the right meal and cocktail for you. I'm already looking forward to my next visit.",
   "Excellent food, great service, wonderful drink selection. The only con was the noise. Hard floors and a black brick wall just bounce sounds everywhere, so there was just a lot of ambient noise. Not enough to keep you away, but enough to make you have to be in the mood to cope with it. I'd still go back - definitely worth it.",
   "Delicious creative food combinations that taste a little different with every bite. The atmosphere was relaxing, soft lighting sets the mood. I didn't partake in the alcohol options but the menu of mixed drinks was extensive and creative. A must try is the butternut squash cheesecake.",
   "I like this place,  service can be slow depending on where you sit, but I keep going back for the food!! I was literally blown away by the steak frites... I mean... WHOA. The flavor kept exploding in my mouth with every bite! Other options on the menu have not disappointed either.  Don't miss your chance to try this place,  even if you're not there to drink.",
   "Liberty has a good happy hour and a cozy atmosphere. I'd recommend it for dates, a fancy dinner with friends or even just a drink after work. Parking can be tight at times, but you can usually find a spot in the lot or across the street."
  ]
 },
 {
  "name": "Sakura Japanese Sushi & Grill",
  "address": "1318 N Monroe St, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9c3345a2-9334-11ea-b50f-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14896750063876051591",
  "source": "GoogleMaps",
  "reviews": [
   "This is the best place. Food is amazing and always fresh. Service is always on point. They have great specials at lunch time as well. I have been going here since they opened and now they have expanded for more seating so less wait time which is great as well. Great place to come on a date night or just hanging out with friends.",
   "This is actually one of my favorite lunch sushi place.  Lunch special price is very reasonable, my favorite chirashi is almost half price, such a great deal. I once orders a bunch of fancy sushi, and all of them are fantastic. Love the place. \nFair warning, go early for lunch, or service can get a bit slow.",
   "Went there for Christmas dinner with another couple.  It was very busy, but the waitress did a great job and food was 5 star except for calamari appetizer.  It was a little tough and over fried.  Everything else was delicious.  Will definitely go back.",
   "Great service and food as well as atmosphere...",
   "Oh my goodness - delicious food, good lunch portions and prices!! Service was also pretty great."
  ]
 },
 {
  "name": "The Blu Halo",
  "address": "3431 Bannerman Rd #2, Tallahassee, FL 32312, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9c8695d8-9334-11ea-8c7c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=14962265114790464591",
  "source": "GoogleMaps",
  "reviews": [
   "We went out for date night and had a wonderful experience! The service was excellent five stars for that alone! \nOur appetizer was Caprese salad and was fantastic. We ordered happy hour drinks ( Friday till 7pm ) all our drinks were very good. \nWe both ordered off the night specials my wife got the brazed short rib and it was simply amazing, I ordered the dry aged Kansas strip and for the cost it is one of the best meals I have had.\nI have to say this was a great value for an evening out and we will be back.",
   "I was very happy with my food and drinks here.  Had grapefruit mimosas and the halo omelet. That was amazing and a lot of food! I opted for grits instead of the potatoes and think that was a better choice. Expect to spend some time here if you go on a Sunday; it's supposed to be leisurely.  All in all, a great experience.",
   "We came to Blu Halo when it first opened and we were not impressed. We gave it a second chance tonight and the food was tasty. My wife had the Blu Halo pork chop (2 bone chop) covered in a blueberry compote, goat cheese, with mashed potatoes. I had the Southern Grouper (blackened) with southern style collard greens, and thick, creamy grits. The service and food was wonderful. We will be back.",
   "We came for the steak!  Cool atmosphere and the wait staff was on  point. Desert was great and the live music was subtle and entertaining.  We asked for the “best cut” steak in the house and it was great, however we didn’t “prefer” the coffee ground marinade on the steak.  Great steak, Great Cut, Cooked perfectly, our preference is wood fires with no coffee.\nWill return and recommend. Thanks",
   "The pickled Bloody Mary is to die for as I LOVE  spicy any day!  Had the eggs, bacon and house potatoes which were all cooked to perfection!!!  \n\nWe had a party of 8 and they allowed us to enjoy almost 2-1/2 hours dining with them. Great ambience and fabulous hosts!!  Would visit again next time I am in Tally!!!!"
  ]
 },
 {
  "name": "Cuban Grill",
  "address": "2743 Capital Cir NE, Tallahassee, FL 32308, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9d145b9a-9334-11ea-a85e-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "food",
   "art",
   "food"
  ],
  "link": "https://maps.google.com/?cid=981037414864918552",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of my favorite places to eat either lunch or dinner. I enjoy the Black Bean soup, adding just a little rice and onions. The owners always seem happy to see me and make me feel welcome. If you want a great meal or just a bowl of Black Bean soup, this is a great place to eat! Fast service, but not a fast food place.",
   "awesome place. didnt catch the guys name but super nice. lechon asado was delicious. will be back for coffee and key lime pie.",
   "Definitely best place in Tallahassee for cuban food. Freshly made, awesome yuca, plantains, black beans and rice. Small food joint but really really good Cuban food.",
   "This place was super low key, but had the ambiance of your best friends home. The art work the hung was superb and the food was amazing. Definitely filled the soul. I’m very happy I found it.",
   "A little taste from home in Tallahassee. The owner Carlos & his chef are a delight."
  ]
 },
 {
  "name": "The Crum Box Gastgarden",
  "address": "602 Industrial Dr, Tallahassee, FL 32310, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9d778aa8-9334-11ea-9a8b-14b31f159f22.png",
  "tags": [
   "hospitable",
   "eat",
   "family",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5355385565051797905",
  "source": "GoogleMaps",
  "reviews": [
   "Killer little place!  Amazing sausage sandwich!  I washed it down with a cold beer and all was perfect.  It's a cool little stop for a bite whether your just looking to eat or you're touring the city.  Pete, the owner, made our meal himself and was incredibly hospitable and welcoming.  The Crum Box Gastgarden will be a stop for me every time I'm in Tallahassee.",
   "I really enjoyed the food here! It was very good! This is a family friendly restaurant, it has nice seating outside where you can see a band play! I got a grilled cheese sandwich with a side of Mac and cheese, there was not a very big menu so if you are looking for a large menu of foods I would not recommend, The guy who works here is very nice and your food is out within 15-20 min. I hope you enjoy!",
   "Crum Box is just so delicious. Pete, the owner, is always friendly and his meat can't be beat. Best meatball sub in town, hands down. The sausage makes me happy. And even his vegetarian options bring joy.",
   "This is where to go to have one of tbe best meatball sandwiches ever. The Crum Box Gastgarden has a very laid back and inviting environment. Pete the owner is the coolest guy you can ever meet and treats you like family upon entering. Everyone needs to try the Crum Box out, you wont be disappointed. ✌🏾",
   "Pete is awesome and the food great! We were just passing through town and stopped there. Highly recommended."
  ]
 },
 {
  "name": "Riccardo's Restaurant",
  "address": "1950 Thomasville Rd Suite G, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9dd2ca1c-9334-11ea-9907-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=785463749178786037",
  "source": "GoogleMaps",
  "reviews": [
   "Nice place, friendly staff, good food. Went for lunch. the lasagna was made fresh that morning which is always good to hear. I feel like the red sauce was a little over reduced. It was salty and very strong which is great I'm missing cases but it overpowered the other flavors in the lasagna. We'll definitely go again to try their schnitzel.",
   "Very good! The white clam sauce was amazing... the bread is out of this world... felt a touch slow, but full house at lunch so not an issue...",
   "Nice place in a business complex, not too big, booths and tables available. Lunch deals for like $10, entrees around like $12, good place tasty food casual atmosphere, water tasted a little weird though. Everything my group ate there was great, pizza lasagna eggplant parmesan garlic bread salad yum",
   "Absolutely amazing. The restaurant was nice and dark inside. Quiet. Winderdul place for a date night or night of company. Food was absolutely amazing. We had both pizza and pasta. Both were wonderful. Server was wonderful. I would definitely go back in a heartbeat. Keep up the amazing work.",
   "Love, love, love Riccardo’s food. We visit weekly & are never disappointed with the food. The prices are reasonable & the portions are big ! I recommend the calzones, pizza, spaghetti & meatballs, & lasagna, baked tortellini, meatball sub & the veggie sandwich The dinner roll (served only @ night ) is to die for !!"
  ]
 },
 {
  "name": "Tour of Italy",
  "address": "3813 N Monroe St #21, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9e246cdc-9334-11ea-a7aa-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "kids",
   "family",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1041865021026989935",
  "source": "GoogleMaps",
  "reviews": [
   "Passing through town on a road trip, I wanted a pasta dinner. This is a small restaurant with a large group enjoying their meal, but my server came fast. I asked if the Italian sausage was sweet or hot, and since he wasn't sure, he offered to ask the chef. The chef prepared some for me to try so I could decide whether to order the Fettuccine Alfredo with the sausage or chicken. The sausage was great with the pasta, as were the rolls with Parmesan cheese topping and salad. I'd go back often if I lived in the area.",
   "Delicious fresh Italian food. Make reservations as it get busy. The pizza was so good. They have outdoor and indoor seating. The heaters in the patio were great for a chilly night. Service was wonderful, the staff was very pleasant",
   "Stopped here based on Google reviews while traveling from the Gulf Coast to Georgia.\n\nThe review was spot on. It is a small family run place with all the classic dishes you love and crave.\n\nI had the baked meat lovers spaghetti, which was huge and delicious. One of our kids had the baby pizza and it was big enough to be filling with a great crispy crust.\n\nTheir meat sauce is unbelievably good and so it their house dressing. I wish there was a place like this where I live.",
   "Service was amazing.\n. We called in advance and they were ready with the food. Taste was great. My family and I had a good time.",
   "A hidden gem. Very unassuming front in a strip mall. Inside however is a quaint little Italian atmosphere with OUTSTANDING food! The garlic rolls really started off the experience as they were excellent. Everyone enjoyed their meals and the desserts were scrumptious."
  ]
 },
 {
  "name": "Nefetari's",
  "address": "812 S Macomb St, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9e79b8fa-9334-11ea-bfef-14b31f159f22.png",
  "tags": [
   "food",
   "hospitable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4534072805852083377",
  "source": "GoogleMaps",
  "reviews": [
   "Great atmosphere. Been here twice, once for painting with a twist and lastly as a vendor for Black on Black Rhyme.  The difference displays of African artifacts adds an aesthetic touch to their welcome.",
   "Great vegan sampler experience. I wish they would do more pop up meals! I miss the great food and the elegant/comfortable atmosphere.",
   "I liked the mutton and chicken curry there. The place is great. I tried their burrito and nachos as well which were not great. They have a good samosa. The interior is thoughtfully designed.",
   "I love the ambience and atmosphere. Very friendly and hospitable!",
   "The decor was definitely interesting, electic Egyptian. Don't be fooled, the food was not Egyptian, very international, and very good! We tried the naan nachos, forbidden fried rice, honey eggplant, mushroom ravioli, and a salad. The nachos was outstanding, never had anything like it."
  ]
 },
 {
  "name": "IL Lusso",
  "address": "201 E Park Ave #100, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9eddbcfe-9334-11ea-ad9e-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "food",
   "food",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9191232966242690926",
  "source": "GoogleMaps",
  "reviews": [
   "Our new #1 go to for fine dining in Tallahassee. This place is posh and so good! The location is great! Perfect for special occasions and date nights for those that want to impress. ;-) The staff is very professional and knowledgeable. It's a must for the next time you have some spending money and want great food in a fancy environment.",
   "Il Lusso is an excellent dining experience. We've been three times now, and each time we've had one of the most excellent customer service experiences in Tallahassee. A bit on the expensive side, we normally each get half orders of the pasta and then split a steak. Make sure to make a reservation! It can be hard to get a seat. This restaurant is popular with University fundraisers and legislative folks.",
   "Good atmosphere, great service. Table was small, felt cramped. Food was wonderful. Longer than expected for entre arrival. A good 10-12 minutes after salad was removed from table.\n\nOverall very pleased. Great meal.",
   "The food was to die for! You will not be disappointed! Our servers were Louis and Chuck who both gave excellent customer service! Louis was very knowledgable of the entire menu and answered each and every question with specifics! A great way to celebrate my 50th with friends!",
   "After hearing about this place all day, we were excited to experience the “best restaurant in Tallahassee.” Unfortunately, our experience was not along those lines. Our reservation for for a kitchen view table, but the window to the kitchen was in no way a kitchen view. Our head waiter treated the assistant waiter terribly, snapping his fingers and making noises to get her attention. The som broke the cork in our bottle of wine, took the bottle to the back and returned with the open bottle, no cork and poured a tasting that had cork in the wine. We filled our wine glasses ourselves the rest of the night even while then waiter and som cleared our plates with empty glasses. The food was decent, but not consistent with the prices being charged. Just a weird experience for a restaurant billed as #1 in the city. Would not return again."
  ]
 },
 {
  "name": "Z Bardhi's Italian Cuisine",
  "address": "3596 Kinhega Dr, Tallahassee, FL 32312, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9f30e51c-9334-11ea-a50a-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12244481211936412547",
  "source": "GoogleMaps",
  "reviews": [
   "Good food. Nice servers. Al fresco atmosphere inviting. Music should be more classic and appropriate to their clientele. There's enough rock and pop other places. Classic guitar or light classical music is more fitting.",
   "One of the best in Tallahassee.  Very good italian food with super nice staff in a countryside setting, although they have a very nice indoor seating area.",
   "Oh my goodness gracious! Outstanding restaurant I wish I had discovered sooner. Cannot wait to return for their new weekend brunch and to dine al fresco under the Jasmine covered pergola. Talented chef and top notch server made my aunt's 93rd birthday celebration beyond special.",
   "Really excellent Italian food and wine.  The specials are worth exploring...I have never come away thinking this or that could be better.  It's great food in a quiet and personal atmosphere.  We do all our special occasions here.",
   "Yummy food and very nice service. The outdoor seating was lovely because the weather was nice. Inside could use an update, and the bathrooms can definitely use a cost of paint / refresh.\nDon't be fooled by the log cabin aesthetic. This is fine dining!"
  ]
 },
 {
  "name": "Kebabas Mediterranean Grill",
  "address": "601 W Gaines St, Tallahassee, FL 32304, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9f98f5fe-9334-11ea-949b-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13897668969837983473",
  "source": "GoogleMaps",
  "reviews": [
   "This place is amazing!! We had the Holy Cow and Under the Sea platters.. and WOW!! Everything was hot and fresh and so flavorful! Father and son who work their are super nice and caring. Will definitely return very soon!",
   "The Price is reasonable, all the meat is very well seasoned. About 7 minute wait. I came late, so they sold out of salad and lamb, I must try them next time.\nA few weeks later I tried shimp, lamb, and the salad. Everything is delicious 😋",
   "Although it’s a food truck, that takes nothing away from this chefs cooking ability. I’ll usually get the chicken kebabs and the quality along with the seasoning on the chicken is second to none. Made fresh with your choice of a side, the portions as well as the taste and even the price has me thankful this place is so close to my house.",
   "this dude is the man, khalid is great and his food is even better. I go three times a week and it’s not enough!",
   "Love it, there service 3 great"
  ]
 },
 {
  "name": "Osaka Japanese Steak House",
  "address": "1489 Maclay Commerce Dr, Tallahassee, FL 32312, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9fefbcb6-9334-11ea-95c0-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17888120013666937779",
  "source": "GoogleMaps",
  "reviews": [
   "Exquisitely delicious! Classic authentic Japanese cuisine with original and wonderfully delicious choices throughout the menu.",
   "I love their new location, the food is good as always. The staff was very friendly and helpful. I would recommend it.",
   "Osaka has moved to a new location - brand new building! We had sushi. I asked for the sushi chef to make me something unique. He did! Our experience was very pleasurable and tasty.",
   "We got takeout from this location for the first time tonight and it was amazing!  Rock n’ Roll is the way to go!  I would definitely recommend checking them out.",
   "Fun atmosphere with good food.\nThe wait time to be seated was not long.  The service was good and so was the food."
  ]
 },
 {
  "name": "Little Italy",
  "address": "111 S Magnolia Dr #17, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a04cf800-9334-11ea-824e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15429302686446499313",
  "source": "GoogleMaps",
  "reviews": [
   "A true gem in Tallahassee local dining. Fresh and authentic meals that are delicious and reasonably priced. The service we received was outstanding! Oh, and the outdoor cafe seating is adorable and a welcomed option.",
   "I love the atmosphere here!  The food was very good and we will definitely be back!",
   "This place is awesome! The service is amazing. I had the fried calamari and honestly it’s the best calamari I’ve had in a long time. Very light and crisp, not greasy and rubbery like some other places. Come here if you like Italian!",
   "The food was delicious. I had the shrimp parmesan!! The service was the best I'd had during my stay in Tallahassee and I'm looking forward to visiting again!",
   "It is great to see coming back after 30 years that this restaurant still serves great food. Special for the day Ravioli and Spinach Lasagna."
  ]
 },
 {
  "name": "MISSION BBQ",
  "address": "216 S Magnolia Dr, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a0a578a6-9334-11ea-b340-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "free",
   "eat",
   "delicious",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=11935223478611531005",
  "source": "GoogleMaps",
  "reviews": [
   "This place has a nice atmosphere and it very laid back feeling to it. It is basically self serve, you order at a register and get a cup. They prepare your plates and you come and get them from the counter as well as seating yourself. We did have a waitress check on us while we ate, but I think it was more of a wellness check than anything. Everyone was nice and the food was great. Definitely would recommend.",
   "Great place! Got the pulled pork, baked beans, and fries. Amazing flavor of the pork and the house made fries were a very nice touch. Topped off the meal with an ice cold grape Ne-Hi from their vintage bottle ice chest. Staff was very friendly and helped me decide what to eat. Overall great experience! Also loved all the service patches from all over.",
   "Fantastic!  I had never been to Mission BBQ before but there was one across the parking lot from the hotel I was staying in.  My wife and I went there for supper.  It was very good!  We were initially greeted by the awesome decor of the place.  Very patriotic and nostalgic!  I spent ten minutes just looking at photos that were hanging on the walls. Then we ordered our meal. We split a three-meat sampler.  We got the brisket, pulled pork, and cheese jalapeno sausage.  Sides were mac-n-cheese and bacon green beans.  Everything was perfect!  The pulled pork was juicy, brisket rub was great and the sausage was addictive!  To top off a great meal, the friendliness of the employees was very welcoming!  The sent us off with a free pen and beer koozie.  What a great meal and experience!  We'll be back!",
   "On this day I had a pulled pork sandwich with coleslaw. It was very good, my side was the Mac and Cheese. IMHO the Mac and Cheese is the best. The atmosphere is geared towards Military and First Responders.  The interior is decorated in Military and First Responder gear and pictures. It s great place to eat.",
   "Solid four something quasi-commercial BBQ.\n\nSomehow ended up with the kids meal rib deal and a beer Lol but Loved it.  Awesome.  All the flavors were really very good and the portions are fair enough.\n\nI'm from the land of 4 Rivers and while I know there's one in Tally, I'm always looking over the fence for good barbecue somewhere else.  Sides were spectacular.  Sauces, mnmmm... but sauces are subjective.  As with the brisket, which was nice and moist but more like pot roast and fattier than should be for me.  Well portioned (as far as brisket goes) and delicious after saucing up but I prefer smoked brisket so that's off the menu for me.\n\nDefinitely solid repeatable barbecue."
  ]
 },
 {
  "name": "Korean BBQ & More",
  "address": "2624 W Tennessee St, Tallahassee, FL 32304, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a1085954-9334-11ea-9b5a-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food",
   "tour",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9193115116262242537",
  "source": "GoogleMaps",
  "reviews": [
   "Fun place for Korean BBQ, basically you cook your own meat. They also offer all-you-can-eat sushi, and a salad bar. Service is always friendly. It's a great place for a date night, or just hanging out with friends. I like to take my kids here so they can make ME dinner, it's always family fun. However it's borderline kid friendly.",
   "For $20, we got huge portions of really good food. The rice medley and beef are both amazing. I'll definitely be a frequent customer.",
   "Best Korean BBQ in town. Did a tour in South Korea and can say. That there's is authentic.",
   "This was our first time trying the Korean BBQ spot, and it will definitely be a regular stop for us. \n\nFood was great, the waitress walked us through the menu and was kind enough to explain everything clearly and simply. Rice medley is definitely the move, we also got the beef which was awesome.  \n\nYou get some serious bang for your buck, unlimited tea and coffee, soups, and side salads with every meal. \n\nNot a spot you want to kick back in for a long time, but for a hole in the wall spot it’s pretty killer.",
   "Looks small, but this little gem is priceless. Spectacular food, with many side dishes. Friendly and cozy atmosphere. 10/10, would recommend."
  ]
 },
 {
  "name": "Sweet Pea Cafe",
  "address": "832 W Tharpe St, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a16127f8-9334-11ea-805a-14b31f159f22.png",
  "tags": [
   "organized",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=13952550039270008098",
  "source": "GoogleMaps",
  "reviews": [
   "Made the trip from Albany to try some Vegan eats. Upon entering the place was clean, well lit, and organized. The cashier was somewhat friendly. I grabbed a little of everything off the menu and two of every sweet so I can try it all and it felt as though once my purchase was over 80 bucks the cashier seemed friendlier. Food is pretty good and sweets are even better.",
   "I’m still in the restaurant as I type — it’s amazing. The ambiance is great and the customer service is superb. Please do yourself the favor of having an open mind and an open palette. This meal was such a pleasant surprise — and it’s local. Whoever the owner is: well done. I’ll be back sooner than later.",
   "I don't remember the name of that dish BUT it is rather exotic in presentation and tasty.   This is veggie restaurant.  A local favorite.",
   "A local favorite. I must have been at least a dozen times. Quick service, reasonable prices, and a solid menu. They have expanded it over time as certain specials have become staple menu options. Hard to beat the Tempeh Reuben but the buffalo tofu sandwich and burger are close seconds. They also source locally, organically, and fair trade, not to mention they recycle and compost. This place is a gem.\n\nPictured is a special they had: Texas Burger with onion rings.",
   "There isn’t anything on this menu I wouldn’t recommend. Well thought out and delicious dishes. \nWe ordered the Big Salad, the Biscuits and Gravy, coffee and a Cinnamon Bun. The portions are large and very satisfying. Every time I visit Tallahassee, I make this a must stop! \nLittle to no waste as well :)"
  ]
 },
 {
  "name": "The Egg Cafe & Eatery",
  "address": "3740 Austin Davis Ave, Tallahassee, FL 32308, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a1c31e7a-9334-11ea-a9e0-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "food",
   "delicious",
   "food",
   "delicious",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5845770128616622999",
  "source": "GoogleMaps",
  "reviews": [
   "This place was really good and the pricing wasn’t horrible. We stopped here on a road trip for breakfast. I got a buffalo chicken tender sandwich (I know it’s a weird choice for breakfast but it sounded good) and it was only 9.99. It also came with breakfast potatoes. The meal was filling and tasty. Two people in my party got omelets, one person got a “trainers breakfast” which consisted of seasoned egg whites and fruit, and one person got a salmon BLT wrap. She said the BLT was delicious and she highly recommends it. The service was pretty good and the waiter was fast to get drink refills and whatever else we needed. The atmosphere is pretty cool and modern. Overall, it’s a fun, clean place with a great variety of food for everyone.",
   "Great brunch experience!  It was my first time going to The Egg and I enjoyed myself. The food was delicious, prompt friendly service and they had a beautiful venue space. \n\nFood ordered:\nThe Ultimate Seafood Omelette\nCinnamon Roll French Toast \n\nThis is a nice place for Breakfast, Brunch, or Lunch with things to choose from that will not be disappointed. Give them a try and stop by!!!",
   "My spouse and I ate brunch on a Sunday and both had a difficult time choosing our meal because there were so many dishes that looked great. We decided on The Yellow Bird and a quiche with shrimp and both were delicious. Like next level delicious. Our server, Cody, was very attentive and refilled our coffee frequently. Highly recommended for breakfast!",
   "We had a great experience on a Sunday morning. My boyfriend wanted a mimosa, so we went here! They have a very expansive menu so it took a while to order but our waitress was patient and answered all of our questions. They have plenty of options as well as specials, which were different quiches that day. We both got potato skillets which were good. The chicken that was in my boyfriends was unseasoned though, which would have been a total downer if he didn't have bacon in it as well. The only other downside was that after paying we didn't see anyone for a long time so it took forever to get a to-go cup. We will be back though for sure!",
   "The pics were beautiful but the food unfortunately didn't have really any taste. We were all unsatisfied leaving. Just not for us. Staff was friendly, food just not tasting great."
  ]
 },
 {
  "name": "LongHorn Steakhouse",
  "address": "2400 N Monroe St, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a217a718-9334-11ea-b20c-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "family",
   "food",
   "drink",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=13002535396831182772",
  "source": "GoogleMaps",
  "reviews": [
   "Great restaurant for a date night or a special celebration. We came here for our early Valentine's Day dinner and they did not disappoint! The food was great, the service was good and the environment was wonderful. On our grading scale of 1-10:\nAppetizer Wings 8\nRibeye steak 9\nLiquor/Bar 10\nLobster 7\nSalmon 9\nVeggies/sides 10\nRestroom 9\nCome here for a great time with friends and family!",
   "I went here four times, three of times were miserable experiences, the most recent time was better because I had a good waiter. He was very friendly, constantly refilled my soda and gave me one to go, and made himself known with the usual customers. Based on him alone this place would get 5 stars but other factors will make me avoid this place in the future. \n\nThe last time I guessed other waiter sat a family in a location were supposed to have a large group, so to fit this group of 20 they moved this small family's table inches from my booth. The father and young son were fine, the other individual was rude, cursing, and took his shoes off in front of me eating. And he used my table as his own storage place, he kept placing menus, dropped utensils, and his stuff on my table where my food was. A waitress saw this and removed the menus but didn't address anything else. \n\nPrevious times I got periods of no service. For one lunch it took them almost an hour to bring my food and never refilled my friend, then after that long wait keep pestering me if I wanted the check, rushing me to go after I waited so long for food, they didn't even bring bread. \n\nWorst was the time I ordered salad for lunch, that brought my bread then no salad or refills for 50 mins, I kept asking but my waitress was not around. At the hour mark after ordering my salad and it didn't show up I got up and left for the buffet across the street.",
   "Appetizers are good. Steak is awesome but felt little hard hard on the rib eye.. Good Service and will be back.",
   "I placed an online order for food at 4:15pm. I am pregnant and my 6-year-old was sick at home, so I wanted to pick up something tasty on my drive home from work. Online, it said that my order would be ready in 30 minutes. I arrived around 4:35pm and they said it would be a few minutes. A long line formed at the take out counter and no one seemed to be looking to see whether my food was ready or not. I got back in line and checked in again around 5:00. They said my food was not ready yet. At about 5:20pm, they told me that my food was coming out. Waited in line again in order to pick it up, but I was missing bread, butter, dipping sauce for the appetizer, my soup for my dinner, a drink, and the ice cream was half melted. The take out person went and gathered everything that was missing and even switched out the ice cream for me. Then, told me that they are out of bread (which I ordered with my order at 4:15 online) and that I could wait for bread. At 5:35, I finally had all my food. Also, there was no comfortable place to sit (I am pregnant) to wait. My choices were a bench with no back or a high stool with a small seat. I cannot believe that my food took over an hour to make. I will not be coming back to this Longhorn.",
   "LongHorn Steakhouse provides a quality dining experience.  The menu offerings do not end with just excellent steaks.  There are many delicious options for side items.  Additionally, it would be worthwhile to check for any seasonal specials throughout the year.  These selections - also - are quite appealing. \n\nRalph Hadley"
  ]
 },
 {
  "name": "Tan's Asian Cafe",
  "address": "2743 Capital Cir NE #110, Tallahassee, FL 32308, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a27075e4-9334-11ea-8751-14b31f159f22.png",
  "tags": [
   "eat",
   "eat",
   "food",
   "food",
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17363283575193125626",
  "source": "GoogleMaps",
  "reviews": [
   "Door service was awesome. My husband and I had no where to eat while in Tallahassee yesterday except our truck. We saw Tan's and ordered at the door, where menus were provided. Only waited 10 minutes for our order. Customer service was excellent. Asked if we could sit at one of their outside tables to eat. Was told, \"Yes, and if you need anything, please let me know!\"  (Great lunch portion sizes too!) My meal was good but my husband wasn't as happy with his, but we had no idea what we were ordering!  That's why only  4 Star. We will definitely go back here, kindness goes a long way for us! BTW, thank you for being kind to us, for providing us and providing menus to your customers. We can tell you care!  Barbie",
   "I work right by this place, so I stop here for lunch pretty often. The food is fresh, it is well flavored. The Thai soup is amazing! the Mongolian tofu is the best tofu you will ever eat! I highly recommend this place, and it doesn’t have MSG like a lot of other Chinese restaurants. (No MSG bloat) It is more towards the Thai flavoring with being run by Indonesians. Try it out!",
   "Staff exceptionally friendly. Food was outstanding. Small buffet but huge selection. Wide variety. Got take out a few times and thought it was great so we tried the buffet. By far the best buffet in town hands down. Spicy sections actually had some heat to them. A few things I've never had before and some old favorites. Great spring rolls and egg rolls. Certainly our new favorite  Lunch spot.",
   "We've all been to dozens, or more, Chinese buffets. You come to accept the averagness of food. Welcome to Tans, a fresh, not frozen, deluxe buffet! This joint even has some homemade curries that are amazing. The salt and pepper shrimp, yes this is on buffet, are huge, fresh and delicious. Skip all the rest and eat at the best!",
   "I loved the food here! \nI decided to try some items off their Indonesian menu just because I have never tried Indonesian before. I had the Beef in coconut milk with Balinese sauce and it was so good. Normally, I would take home left overs but I overstuffed myself on the food. I also had a stuffed Tofu appetizer. That was also pretty good. I liked the contrast in texture. You had this super crispy outside with the Tofu inside, which is creamy then the vegetables in the middle. The sauce just rounded it out as well. The spice level was very chill and just brought flavor to the dish as opposed to heat, which is always appreciated when I am trying something for the first.\nPrice was very reasonable for quantity and quality received as well.\nHighly recommended!!"
  ]
 },
 {
  "name": "Red Snapper",
  "address": "5023 Crawfordville Rd # 5, Tallahassee, FL 32305, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a2c37968-9334-11ea-89a4-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11266866405964039171",
  "source": "GoogleMaps",
  "reviews": [
   "Legit Vietnamese food and delicious southern food as well. Interesting combination. The owner is awesome and the chef is great. We're Vietnamese and have been eating Vietnamese food all our lives--we know what's good. We had the seafood combo and the Vietnamese rice dish. Both were really tasty. We'll be back!",
   "Whenever we fly into Tallahassee, this tends to be the first stop after the airport since we live in a landlocked state and want GOOD seafood. The range and selection of seafood -- both Southern and Vietnamese -- is outstanding. The fried okra is the best I have ever had. The manager and staff are attentive. The facility is always clean, casual, and timely for a quick lunch or stop on the way back to the airport.",
   "The Red Snapper is as good as the reviews said . Fresh tasty food and friendly service.They have a huge menu with all the seafood you could want and tons of Asian  inspired dishes, I am pretty sure it is mostly  vietnamese, my wife really enjoyed the Pho. \n    We did get the garlic shrimp to go one time and by the time we got it home it was just so so. Basically  I recommend eating in for best taste.",
   "A Tallahassee gem. The food is amazing and the service is fantastic. The food offered is either Vietnamese or Seafood. I have been here several times and have never had a bad experience. The owners are a couple - the wife does the cooking and the husband mans the front (taking orders, serving food, buses tables, etc.). I always enjoy the small talk I have with the husband because he's super friendly.\n\nIf you need a recommendation on what to try for the Vietnamese food, I HIGHLY recommend their beef stew - it's out of this world. There's just so much flavor packed into it and it smells divine. \nI'm also not from the South, but shrimp and grits have become a new favorite classic Southern dish. If you get some here, they drizzle it with this garlic butter sauce that makes my mouth water just thinking about it.\n\nI'm conflicted with spreading the word about this restaurant because I enjoy it being my little secret, but I want them to stay in business because I just adore this place so much. Anyway, just try the food here - you will not be disappointed.",
   "Delicious food, excellent service, loyal client base. You're missing out if you don't at least try it. Also, the best pho in town."
  ]
 },
 {
  "name": "Mimi's Table",
  "address": "1311 Miccosukee Rd, Tallahassee, FL 32308, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a318bd08-9334-11ea-8bba-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "foodie",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=5374674237416660565",
  "source": "GoogleMaps",
  "reviews": [
   "I wish I was able to give Mimi’s Table a higher rating than 5/5. Our food was delicious and perfectly cooked, and the service was fantastic. I highly recommend the shrimp + grits, crab cakes, Tuscan chicken, and  brownie sundae dessert. As a self-professed foodie, I have higher than normal standards for food, but Mimi’s Table hit every expectation out of the park. Fine dining at it’s finest.",
   "We ordered Mimi's Table Family Dinner for Easter dinner 2020 to go. Everything was delicious and was a real bright spot during such a difficult time.  We had the braised short ribs, but I think everyone's favorite part was the bread!!  I'm so glad we were able to support a local business and a fantastic one at that.  I'm definitely scheduling a date night here when restaurants open up again!",
   "Intimate French inspired Southern cooking at its best.",
   "My daughter and I were graciously welcomed soon after the restaurant was opened. It was barely four thirty but we had to celebrate an event in our lives and we were treated royally as we sat at the bar drinking wine and nibbling on specially prepared goodies. From then on it has been our \"special place\". We love it there.",
   "What a nice pretty new spot. Hubbie loved the braised short ribs and I loved the healthy seafood grille. My friends was disappointed in the Tucson chicken as it was all dark meat.  The cheese board was yummy.\nWe all enjoyed the homemade French apple tart."
  ]
 },
 {
  "name": "VeneBites",
  "address": "217 E 3rd Ave, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a372eb98-9334-11ea-a09f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5787757933849553616",
  "source": "GoogleMaps",
  "reviews": [
   "WOW! Came in on opening day and was immediately greeted with kindness and warmth. The service was prompt and the food was DELICIOUS! I was very excited to try Venebites as soon as I heard they opened today. Come and give them a try and get some delicious food! I tried a number of things (and it took everything out of me not to overdo it). Wishing them lots of luck and I'm happy to have them in my neighborhood!!!",
   "Delicious food. Well priced. This is my second time eating here this week.",
   "My daughter ordered empanadas.  They didn't have them on the menu.  But, the chef prepared 4 for her anyway.  they were awesome.  That is real customer service.  Friendly and willing to do whatever to satisfy a customer.",
   "This restaurant just surpassed all Tallahassian eateries I've been to. It's bound to become very popular. Outstanding price, portion, and TASTE. Wow. Thank you for opening.",
   "Absolutely great Venezuelan food with very friendly pricing and staff. A few places in town have tried to make arepas but for the most part fall short and don't feel authentic. VeneBites is quite the opposite: real arepas made with passion and flavorful fillings that are to die for. Their other small bite offerings are also worth checking out. Do make sure to come early because they tend to sell out before closing time."
  ]
 },
 {
  "name": "Isabella's Pizzeria Napoletana",
  "address": "799 W Gaines St #101, Tallahassee, FL 32304, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a3cb2fb6-9334-11ea-89c9-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=1038778365304338909",
  "source": "GoogleMaps",
  "reviews": [
   "Pretty cool spot in College Town.  Nice space.  Good atmosphere.  Saw they have a really good assortment of beers, bottles, and craft draft too.  All good things.\n\nOtherwise, underwhelming given all the reviews, pictures, and price point.  Just wasn't feeling it.  Maybe it was the traffic or the hassle of finding metered parking or general awkwardness of the front of house, I don't know.  \n\nArugula salad was nice enough but the Rustica pizza wasn't special like we thought it'd be.  Disappointing really, given the hype, that it came out under done, shy of basil, and with unappealing eggplant.  Seemed par cooked and heated up after the toppings went on just to warm things up.  Wasn't like you'd think it'd be coming out of that hot oven.  ...after digging through some other reviews, I see this comes up with them.  Probably should have ordered it \"extra done\" or \"medium well\" with an extra five seconds cook time, like another reviewer tipped.  \n\nDefinitely A-OK but whatever's special about them was lost on me.",
   "My new favorite Tallahassee pizza place.  For good reason. Great quality ingredients and good service. Love the brick oven and the incredible crust.",
   "Very good Italian restaurant were you can enjoy a delicious Italian pizza (said by an Italian). The service was good and fast. You have different options, you can choose the pizzas from the menu or you can customize your own pizza. Everything was good, also the cheesecake, the only problem was that there was a little bit of must on the cheese (I said it to the waiter).",
   "Very fresh and delicious. Everything handmade. Nice variety of salads. Try the lemon vinaigrette dressing. We split a pizza and added salads for a delicious lunch!",
   "Okay, so I have to admit. I just had wine there. But their wood burning oven (for pizza) is very cool. This restaurant is extremely close to FSU in CollegeTown. Their pizza SMELLED good. Wine was tasty."
  ]
 },
 {
  "name": "Chuy's",
  "address": "904 E Lafayette St, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a42a7f52-9334-11ea-9dfe-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7777097419590417854",
  "source": "GoogleMaps",
  "reviews": [
   "Our waitress was very friendly and helpful. The food was great but very spicy. I'm not a spicy person so I didn't too much care for it but the food was good. I also think the fajita plate for 2 is not for 2 because the food amount was very small portion. That was my only concern.",
   "Scrumptious food and drinks.  Love the atmosphere.  Next time I will be bringing a framed picture of my dogs and hope they get added to their walls.  We will definitely be back.",
   "5 stars 4 months. Today food good but server is less than adequate.",
   "Food was good. Service from Ashley was great a great server and our hostess was very helpful. . Thank you for being so accommodating to our group.",
   "Chuy's has become one of my favorite places to go lately for all of my brunch meetings! It's so old school eclectic.. The inside full of thoughtfully put together antique decor and the outside this glorious display of various beautiful flowers... Now.. This food... All I know is it is OUTSTANDING, and especially this ranch jalapeno tasting dip they give you along with fresh made salsa and seemingly never ending warm chips.. Trust me... You'll love it here.. Wonderful atmosphere and wonderful customer service ❤ I'll be back soon Chuy's! 😏"
  ]
 },
 {
  "name": "San Miguel Mexican Restaurant",
  "address": "200 W Tharpe St, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a4f9dde2-9334-11ea-8eeb-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9613255694476431208",
  "source": "GoogleMaps",
  "reviews": [
   "These people are open for take out during the quarantine. I just got the hook up on some chicken nachos supreme. Highly recommend!",
   "The food came out hot and looked really good. The food was a little bland for my taste.I was trying something new so it might just be me. My server was very nice and attentive. The atmosphere was very quiet I was expecting to hear some music, and I did when I went to the bathroom. The place was clean, and the staff was very friendly. I will be returning on a Saturday and and stick with what I know.",
   "With amazing staff and consistently great food, San Miguels quickly became my favorite restaurant in town. Not only is my stomach full when I leave, my heart is too. Love you guys!",
   "First time customer today, and even with a large to-go order to take back to the house to Taco tuesday/Cinco De Mayo at  home, quarantine style, everything was really good. Fresh food, great flavors, friendly service. I will definitely be back and recommend to give a try if you haven't already.",
   "Authentic Mexican restaurant. The food consistently taste great! Servers are nice. Owner is always there and talks to customers! One of the best places to eat if you are looking for some margaritas, tequila cocktails and great Mexican food. Plenty parking with easy in and out. Prices are great also. There is also plenty outside seating all in the shade. Food comes out pretty quick after the order."
  ]
 },
 {
  "name": "Siam Sushi",
  "address": "1700 N Monroe St #9, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a558c6d2-9334-11ea-9a3a-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "creative"
  ],
  "link": "https://maps.google.com/?cid=7415194499605448893",
  "source": "GoogleMaps",
  "reviews": [
   "The seared tuna salad is off the charts amazing, they give you a great amount of tuna and its packed with alvacado. The ingredients are always fresh, and they are consistent with the quality. Also, they do rainbow rolls! I haven't found any other place in Tallahassee that does rainbow rolls so I was ecstatic to find out this lovely place makes them. They are delicious too, the fish is always fresh. If you haven't tried them out, you HAVE TO!",
   "Sashimi was so fresh! And they give you a really nice size of meat. Our 'Peter' had the perfect amount of heat and was HUGE. Nice wine choice. Will definitely be back!",
   "Best sushi in Tallahassee!  Great service, nice ambiance, reasonably priced.... worth it!",
   "***EDIT (2/21/2020) - They must have gotten a new sushi chef for lunch that isn't on top of the menu yet. Something I have gotten many times (Tuna Tartar) that's be consistent and delicious was completely botched and disappointing today. Too bad considering this place is my favorite in town.  \n\nOriginal Review - One of the best sushi places we've been in town. They were a little short staffed when we went, so things took a while but the servers were relatively attentive. Great place. We will definitely be back. Try the trust me roll! That chef knows what they are doing!",
   "Making great sushi is here. For myself, eating great sushi is an adventure. A creative sushi chef is always exploring new ways to combine flavors, colors and textures, while at the same time respecting the respecting the ancient traditions of sushi making. Siam Sushi is very good restaurant. They have  freshest fish, veggies, seasonings and toppings on their dishes."
  ]
 },
 {
  "name": "The Bark",
  "address": "507 All Saints St, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a5c0d7b4-9334-11ea-9a9c-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "free",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4519293622263531377",
  "source": "GoogleMaps",
  "reviews": [
   "Loved The Bark! Food was great and service was quick and friendly. Parking is out back and on side street. You order at the counter and you can pick some games from the corner to play while you wait for your food to be brought to you. There's bins you put your dishes in when your done. There is outdoor seating and you they have free pool to play as well. No kid menu but my daughter enjoyed the herb roasted potatoes( home-fries) and watermelon. Would highly recommend to anyone!",
   "Vegetarian restaurant with vegan and gluten free options. Very tasty, flavorful menu choices with daily specials. Casual atmosphere. Friendly, pleasant service. Order at the counter, eat inside or out. Formerly Bread and Roses Kitchen (when located around the corner on RR street). Really good food. Actual drinking glasses and utensils (not disposables) add to the pleasure!",
   "The staff and food here is always above average and have never let me down. I know coming BARK will leave me full and satisfied. Highly recommend.",
   "The atmosphere here is incredible, the decor is fun, and the staff are super nice. I went for karaoke night and had a blast! Everybody gets a chance to sing, even if they show up a bit later. Definitely have to try the peanut butter pie if you get the chance!",
   "We had been hearing about this great local place to try from our local farmers at Handsome Harvest since we're vegan, so we finally got a chance to try it out, loved it! Nice people, great food, fun atmosphere and awesome artwork. We're already looking forward to going back!"
  ]
 },
 {
  "name": "Tin Lizzy's Cantina",
  "address": "619 S Woodward Ave c103, Tallahassee, FL 32304, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a6289a76-9334-11ea-92f8-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12576338646265018210",
  "source": "GoogleMaps",
  "reviews": [
   "Good prices, great staff! Amazing place to watch the super bowl but kinda wish they would make the food a little better. More chicken then bread next time please. Other than that it's a great place to come have some beers and food",
   "This place is phonemmonal, our waitress was attentive and caring. The food was divine, very spacious and comfortable atmosphere.  Will visit again when we return to Tallahassee ❤",
   "I went here for the first time today with a friend. I have wanted tacos for so long, and Tin Lizzy's Cantina fully satisfied my craving! I had the mahi mahi taco, and it tasted so much better than I expected (I don't normally eat fish, but I have been trying new foods recently). I don't like slaw, but whatever their slaw is made from tasted really good. The service was good, and after we had paid, someone who seemed like the owner came up to ask how we had enjoyed the meal, and informed us that on Tuesdays they have tacos for cheaper prices. I will definitely be going back!",
   "Love this place! The food and atmosphere is great, as well as the taco Tuesday deals. The servers are all well trained and friendly and Bailey is super great!",
   "Meh. \n\nI've been here 3 times now. Each time we had slow service, which is particular annoying because you have to pay to park for each hour. With this bottleneck of time, they should really keep each table in and out under an hour, but this has NEVER happened for me. Which means you run the risk of getting a ticket, or you need to pay for 2 hours. \n\nAs for the food, it is only ever worth it on Taco Tuesdays, otherwise it is a bit pricey, probably just for the sake of being in college town. But as for choices in college town, it's semi-decent. Also, the chicken tortilla soup isn't creamy, which is kinda lame."
  ]
 },
 {
  "name": "Dao Restaurant",
  "address": "3425 Bannerman Rd a102, Tallahassee, FL 32312, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a68c2eee-9334-11ea-ab41-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12312589473045778791",
  "source": "GoogleMaps",
  "reviews": [
   "We have eaten several times, particularly after church on Sunday, and have been very pleased with the quality of food and service. Since it had been several weeks since we had been back we tried it this past weekend and was surprised that they offered a full buffet plus several Sushi offerings. This is not your normal buffet, the food was fresh, high quality and very tasteful. The Sushi offerings provided about 10-12 different versions. The pricing was incredible . This is one of several restaurants at Bannerman's Crossing, which is quickly becoming a foodies paradise with all the great restaurants.",
   "Great environment and the staff was pleasant. Maria did an excellent job serving. 10-2:30 buffet on Sunday. Very kid friendly. Food was great & fortune cookies.",
   "Amazing sushi. Chef Jose is a true artist. Nice atmosphere. Friendly service. A must try.",
   "We actually ended up at Dao by mistake but I’m so happy with how it worked out. Our waitress was so sweet and helpful. The food is well priced and tasty. Unbeknownst to us we arrived during happy hour so the drinks were on sale too. We’re definitely going back! *get the Sangria!*",
   "This is one of the worst meals Ive ever had bar none.  They should've spent more money on paying for good chefs rather than on their fancy locale.  Word of mouth about a hidden away place is fabulous advertising.\n\nCant believe ANYONE wrote up a good review about this greasy spoon in disguise! Their taste  must be in their foot!"
  ]
 },
 {
  "name": "Island Wing Company Tallahassee",
  "address": "1370 Market St, Tallahassee, FL 32312, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a6d9d9cc-9334-11ea-a4cf-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17711961161414948",
  "source": "GoogleMaps",
  "reviews": [
   "We ordered the Hall of Fame Family Pack last night. It clearly states you get a pitcher of Margaritas or a 6-pack of beer with it. We also spoke to friends who ordered this and received the alcohol. Well last night they changed there rules and charged us more $65 and did not give us any choice of alcohol. Do not believe what is posted for the family packs. We will not be going back even though we like the wings.",
   "I recently had my first experience going to Island swing Company and I absolutely loved the atmosphere! My coworkers were throwing a surprise party for my boss and so we reserved one of the fire pit tables out on the patio and there were quite a few of us but there was more than enough room for us all with those long wicker type benches. I ordered a frozen mango margarita and it was definitely in the top 4 best I’ve had! And the serving sizes of their food was enough to share with 3 other people, so you definitely get more than you pay for! I definitely will be returning.",
   "Fantastic food! Wonderful flavors and huge portions! The staff is more than attentive. We have been taken care of by 3 wonderful staff members! Thank you Alli, Whitney and Cameron for making this a great first visit! Won't  be out last! Thanks to Gavin at Mattress Firm for recommending this great place!",
   "Everything was so delicious and the service was excellent. I'm not sure what my friends ordered for a shared plate, but the chicken wings sauce was pretty spicy - utterly delicious! You can tell it's great as it was full of people and all kinds of people were coming through the door. Definitely worth a visit!",
   "First time going there and would definitely go back. Wish there was one of these in Nashville! Love how everything is baked here rather than fried (their main theme). Food was great. Large selection on menu. Our server was pretty informative and allowed us to try our sauces for wings before deciding which flavor. Cameron was really awesome! Clean bathrooms. Would definitely recommend."
  ]
 },
 {
  "name": "Spear It",
  "address": "609 W Tennessee St, Tallahassee, FL 32304, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a752dacc-9334-11ea-8e21-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "kids",
   "eat",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=11238291350059557619",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent food and service. Katie, our bartender was awesome. The mac n’ cheese bites were such a good app to share. The chicken wings were very good. The owner/GM Mike came by to check on us. We arrived at happy hour. Great happy hour prices 4-7. We will be back to try the rest of the food which looks so good. Recommend if you're in Tally. (good for old people too).",
   "I ordered the Ma's meat loaf and it did not disappoint! It had a sweet and spicy ketchup sauce on top, then crunchy bacon. So delicious! Huge portions, as well. My husband got the salmon. It was tasty, but needed more seasoning. Will def come back!",
   "Big portions, cool atmosphere, killer food. A little pricey but What more could you want? Try the fried shrimp with that awesome sauce, the Mac and cheese burger, or the meat loaf sandwich. Never disappointed.",
   "Our kids, who go to FSU, recommended this restaurant when we visited with them recently. Although we enjoyed the atmosphere, the food left much to be desired; the service was better than the food, but not much better. we started with an appetizer of cheese fries and although the quantity was very large there was only cheese on the top layer of fries and it did not come with any dipping sauce. After asking for ranch, it took at least 10 to 15 minutes for us to acquire any.  Our waitress was very good about refilling our water,  however. My daughter enjoyed her meal the most...chicken tenders, onion rings and fried Mac and cheese bites. I do NOT recommend the fish and chips, that was the special for tonight. The fish was really soggy and I couldn't eat it. My husband warned everyone not to get the veggie burger. He did not like it at all. My son got the bash burger and really enjoyed it.  The side salad was large, but not very tasty. Although the restaurant looks nice and has a nice atmosphere I would be in no hurry to return.",
   "I had the Renegade Shrimp and a mango margarita. They were both delicious! Our server was also great! Can't remember her name but she has blonde hair. We will definitely return!"
  ]
 },
 {
  "name": "La Fiesta Mexican Restaurant",
  "address": "2329 Apalachee Pkwy, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a7b8eff8-9334-11ea-9f22-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "eat",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=9479228468188550202",
  "source": "GoogleMaps",
  "reviews": [
   "Great employees, clean and comfortable, good prices and a big menu to choose from. The staff members make us feel like we are of the family.",
   "Speedy service. Great food. Nice atmosphere and friendly staff.",
   "Visiting from GA. A bit of a wait to get a menu. The blonde said she forgot. Our waiter was really nice and helpful. He kept our drinks refilled. Food was good. Nachos come with shredded cheese which is something I'm not used to but my waiter brought me cheese sauce. Overall I would definitely recommend this place. Food came fast and was hot. Only reason I didn't give 5 stars is because it was a bit of a wait for menus from cashiers. They seemed distracted.",
   "I always get the fajita quesadilla (lunch special usually), and it's my favorite. I eat half & take half for leftovers, and it's such a great deal!",
   "Regular customers and curb side pick up did not disappoint.  Delicious!  I do miss eating in the restaurant though 😔"
  ]
 },
 {
  "name": "Backwoods Bistro",
  "address": "401 E Tennessee St, Tallahassee, FL 32301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a82853d0-9334-11ea-812c-14b31f159f22.png",
  "tags": [
   "music",
   "delicious",
   "food",
   "music",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=12754472363282142236",
  "source": "GoogleMaps",
  "reviews": [
   "A really happening place with a good bar and live music. I attended a birthday dinner here and had the tuna appetizer and a steak. The ahi was cooked perfectly! The steak was closer to medium than rare but it was flavorful and a good cut of meat. The servers were polite and attentive. That makes it easy to see why this place is popular with the locals over 30.",
   "Delicious good food. I love this place and it's sister restaurant. Food always fresh and tasty. I try to get the rotating seasonal specials. Also get dessert, I never had a bad dessert from here before. Good selection and nice atmosphere, especially with the live music.",
   "This is hands down my favorite restaurants in Tallahassee. The food is phenomenal and always fresh. The staff are always friendly and I love the environment. I have tried many things on the menu and have never been disappointed. The stuffed fried green tomatoes are superb!!",
   "First time and it was great. Brought some friends from Atlanta here. Black and Bleu Mac !! Awesome. Nick was our waiter ..... Great service. Thanks Nick.",
   "It's hard to choose a dish since the entire menu is full of great dishes. There is a big bar area where you can catch live music or other entertainment. The main dining area is adjacent with two separate sections. Natural elements and local photography decorate the wall in a simple rustic fashion."
  ]
 },
 {
  "name": "Crystal River Seafood",
  "address": "2721 N Monroe St #2818, Tallahassee, FL 32303, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a8943548-9334-11ea-9d65-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "kids",
   "food",
   "delicious",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8078560129978201345",
  "source": "GoogleMaps",
  "reviews": [
   "Great customer service and very good menu choices, offers special meal combos and all you can eat at reasonable prices. The food was great! Customer service ladies was very was respectful, food preparation was excellent and hot.",
   "Great place to get great seafood. I would have given 5 stars, but they don't have a liquor license. Huge proportions at a very reasonable price. I'll definitely be back, the next time I'm in town.",
   "Great food at a very reasonable price. My Shrimp Alfredo was amazing, and my husband's burger was cooked perfectly and he said it was very good. The atmosphere is very comfortable, and service was great. Emily is a wonderful and attentive server. We will definitely be back and I can't wait to take the kids next time!",
   "Excellent and delicious seafood restaurant! Food was hot and fresh! Tammy gave us great service. Love this place! We always enjoy the flounder and shrimp. Have been going there for years and it is always consistently great, okra and green beans were hot and good!",
   "Ordered a side of fried catfish fingers to-go.\nCame with three or four.\nTook the four.\nAsked for cocktail sauce as a condiment.\nThey provided plenty.\nFish was good.\n\nThumbs up to the two young ladies working the front when I arrived.\n\nThey were both helpful and friendly.\n \nOne recognized I was in town for work and let me know that I could get a discount on my order for staying at a local hotel.\n\nAppreciated 🙂\n\nThe other young lady asked if I wanted my drink while I waited on my food.\n\nYes, and once again, grateful 🙂\n\nTasty fish, good service, quickly prepared, off a main road, prices so-so.\n\nWish I would have tried this restaurant sooner.\nHope you don’t make the mistake I did. 😉"
  ]
 }
]