[
{
 "name": "Bird Island Living Breakwater",
 "address": "Tampa Bay, Mandaree, ND 58757, USA",
 "avg_visitor_review": 4.666666666666667,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Reef Balls are providing a aesthetic looking breakwater to protect the eroding island.  Oysters are growing on the Reef Balls and in some places bridging between the modules.",
  "",
  ""
 ]
},{
 "name": "El Pulpo Marisqueria Inc.",
 "address": "10820 US Hwy 41 S, Gibsonton, FL 33534, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Tortilleria El Charro",
 "address": "11011 US Hwy 41 S, Gibsonton, FL 33534, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "experience"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Best mexican tortillas ever, amazing service.",
  "Best authentic mexican Tortillas !!",
  "Amazing experience",
  "Muy buen servicio, great service! Thanks",
  "Son unas tortillas muy buenas"
 ]
},{
 "name": "Tacos Y Tamales",
 "address": "10920 US Hwy 41 S, Gibsonton, FL 33534, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "food",
  "food",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "If you are looking for authentic tacos and tamales, you should stop by and buy their delicious food on your way to work. The two young ladies are very friendly and it appears they accept cash only. Their food truck is located on the same property as the Mobil gas station.  They are open for breakfast and I'm not sure what time they leave. I will investigate further.",
  "Surprisingly clean little road side stand.  Places like this are not always kept as nice as this one.  Prices were very fair and food was authentic.  Don't be afraid to try.",
  "Love the food the staff greet you at the door",
  "Great food",
  "Great Tacos good price"
 ]
},{
 "name": "McDonald's",
 "address": "9205 Gibsonton Dr, Gibsonton, FL 33534, USA",
 "avg_visitor_review": 3.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Staff were friendly and food was served fast and fresh",
  "Got back home with my order it's wrong should have checked it but I was the only one waiting so figure it was going to be wright no no no get back in the car go back all three one being manger talking to one guy giggling and caring on she takes a look at me standing there with my food goes back to talking and giggling with other 2 employees and I take it the guy they all wanted so set my order on counter and left before I start dropping f bombs thanks for GREAT COUSTMER service!!!!!!!!!!!!! Hopefully they will choke on it",
  "Nice clean room they updated them a lot",
  "Fast on the go food. Even when u really don't want it.",
  "Fast and friendly service, hot food and fresh coffee this morning.  Great job."
 ]
},{
 "name": "Dunkin'",
 "address": "10608 East Bay Rd, Gibsonton, FL 33534, USA",
 "avg_visitor_review": 2.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "drink",
  "family"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Very nice and helpful employees.  Lots of good choices.  We love Dunkin'",
  "Recently the customer service is fine but the kitchen is slacking. There bagels, and in turn the bagel sandwiches, are rock hard and hard to bite into. Make sure you check your food before you leave. Not only could you have to ask for a non-rock like bagel, you might get the wrong food.\n\nIn the past the food was better but there was a manager or owner that would yell and complain about his staff infront of customers. Several times at the drive through, he would yell at someone and then look at me and say \"Can you believe them? There so lazy!.\" Not good... Not good...",
  "Literally the worst dunkin donuts i have ever been to. The staff does not pay attention to your order you will never get what you ordered correctly if you add anu flavors\n\nThey ignore phone calls\nDisregard your requests as if im",
  "Tik tok guy and ya boi Mike..these almond milk lacking guys forgot the almond milk in all the drinks and our donuts were melted:( it's okay they replaced the donut. But our drinks took a while. I miss that one girl idk her name but she's cool she makes the drink fasto B) that's all, coffee is pretty good. But tik tok guy be cool bc tik tok and ya boi Mike fixed the drinks so cool  -sumner family (haven't tried the donuts yet but they b lookin pretty thiccc 😩💦🍆) happy valentines would do 3 stars but my phone is cracked and im doing tik toks. my momma said the drinks were okuUrrRRR ...yes.👍",
  "yo hi hello what's up it's me back here again to update on tiktok guy and ya boi mike !! Went to DD today, and it was pretty goood and we got it quickly! The guy who gave us our drinks was tik tok guy!! Unfortunately haven't seen ya boi mike in a while): hope alls good. They do be working during this craziness so that's cool alright that's all imma go eat my grilled cheese  goodnight my dudes nauamaum bye losers"
 ]
},{
 "name": "Four Stacks Brewing Company",
 "address": "10656 New East Bay Rd, Gibsonton, FL 33534, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "cheap"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Stopped by here for the first time; the inside was open to a big patio. We were immediately greeted by Alex, and he and Martin answered all the questions we had about their brews. We felt very welcome, and enjoyed seeing all the canine customers who stopped by. Also, there’s popcorn!",
  "Great addition to the area. I went for trivia night and was kinda disappointed on the lack of people that were there. 4 teams total but I’m not complaining because we won. Their Groupon makes this place a fun and cheap date night!",
  "Great beer, enjoyed hanging out on the patio drinking my Brew Berrymore beer! Alex was awesome! He was attentive, kind and did a great job with suggesting the right beer. Will definitely come back again!",
  "My friend and I enjoyed our time playing scrabble which the bar provided! And great service from Alex the bartender! Tasty beers and dog friendly! We will be coming back soon!",
  "Nice place to drop by and have a nice local craft beer. Beside some really good beers also very friendly staff."
 ]
},{
 "name": "Rosemary Grill",
 "address": "10660 New East Bay Rd, Gibsonton, FL 33534, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  ""
 ]
},{
 "name": "Zaxby's Chicken Fingers & Buffalo Wings",
 "address": "10580 New East Bay Rd, Gibsonton, FL 33534, USA",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Super-long wait at the drive-through, even @2:30.  Chicken was good and hot, had to wait about five minutes after we paid.  The mushrooms were soggy & lukewarm, as were the Tater Chips.  So chicken was good, sides not so much.",
  "I've never had a bad meal here; from the tender dinners, to the sandwiches or salads, the food is always de6and made to order.  I just wish it were easier to find a cleaner table.  I often wind up having to clean the table off before sitting down.",
  "Chicken finders are good and love the Zax sauce. Had my first sandwich there and the chicken was tough, flat, and more breaded than meat. And the prices are decent.",
  "I freaking move this place. Service is top notch. You always get your food quick restrooms clean soda machines clean tea fresh food always hot and tasty. There is legit nothing bad for me to say. I eat here at least 2 times per week.",
  "First visit, definitely fast food but slightly upscale. Store was clean and servers are very helpful. Zalads are quite large but served in large plates not paper or styrofoam, nice! Chicken club sandwich was quite tasty. I will visit there again."
 ]
},{
 "name": "Baskin-Robbins",
 "address": "10608 East Bay Rd, Gibsonton, FL 33534, USA",
 "avg_visitor_review": 1.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "drink"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "came 10 minutes before closing to get a milkshake, was told i couldn’t because they cleaned both blenders. as someone who works in food, you should always have one blender open until close. i am just...sad. i just wanted a milkshake man. why. i know they kinda suck to make. but i just wanted one. but i couldn’t have it. i just",
  "Great service and coffee. Good location because it is close to Wal-Mart, the movie theater and gas stations. Also very close to I-75 and HWY 301.",
  "I love baskin Robbins, but this location is horrible. They never have enough product. So my issue today is I had my fiancé go in to purchase me to of the pre-packed quarts of the mint chocolate chip, no problem. That was on a Thursday. Two days later on Saturday I get the ice cream out and notice a blue sticky substance on the seal of the container. I open it and the container is filled with a blue frozen substance.(mint chocolate chip is green) I immediately check the expiration date and it was good. I open the other container and find the same exact thing. Both containers also had a chemical smell. I called the store to tell them what I found in the containers and asked if I could receive a refund. I was told due to the covid-19 pandemic that they could not take it back so I asked to be refunded and was told I could not get a refund.  I ask for a manager and the owner of this specific location and was told I couldn’t have this information. I emailed corporate and am waiting to hear back. If I don’t get a response I am going to contact the local health department and the better business bureau and inform them of the service I received. I took photos of both containers and will be submitting them as well.",
  "Service is horrible got a crew of lazy employees who will rudely tell you they are out of everything you ask  for just to stop in and see they actually have it inside. Had the pleasure of dealing with shannon multiple times and each time she was the same and honestly rude about taking an order, cutting off because they were in the middle of conversations and we had to repeat our order twice back ...news flash we can hear everything in drive thru and this used to be my go to ...womt anymore the whole place is just disgraceful...summers is horrible but atleast they get your coffee and orders right",
  "I'm sure the help are nice people. But the hot fudge sundae was awful. First I ordered a 2 scoop. A scoop should be a real Full scoop. Not 2 ribbon strips. ? Do you want whip cream ? Yes..... I receive a cup with the 2 ribbons whip cream with 5 stripes of burnt hot fudge. I asked about the cherry..... Oh we are out of cherries.   $5 wasted. I had to drink water too remove the taste. How about training employee to care."
 ]
},{
 "name": "Cali Aji",
 "address": "10662 US-301, Riverview, FL 33578, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food",
  "family",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Food great but expensive.  Served hot with bread. Staff very nice and good service. Not crowded.",
  "Delicious food, although a straight vegetarian option for their bowls would be nice. Their ingredients are fresh and their sauces are tasty. They also have adorable and yummy pastries made by an in-house pastry chef. I have never liked fried plantains until now! We have only done takeout so far, but their dining room is beautiful with lots of ambiance and art. Awesome to be able to frequent and support a local restaurant.",
  "The food and customer service was outstanding. Edgar, you're doing a great job brother. The place looks beautiful... Keep up the good work!!",
  "Amazing customer service and fantastic food!!! Treat you like family!!! Definitely will be back!!",
  "Very good and unusual pastries. Can't wait to try their full menu of Colombian specialties, especially the oxtail."
 ]
},{
 "name": "Boyette Springs Park",
 "address": "10419 Deepbrook Dr, Riverview, FL 33569, USA",
 "avg_visitor_review": 3.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "pets",
  "kids"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "A wonderfully secluded park that is a good place to let the kids or pets play and enjoy the outdoors!  There are basketball courts and a baseball diamond.  There is an open field once used for football, but it has been allowed to become overgrown.  A nice creek meanders thought the park and is adjacent to the picnic area and child playground.  The County park has become a little worn down, but you will enjoy it!",
  "Nice and well kept park... About 1/2-mile hard top hiking trail... Has basketball court and a small playground for young children... River looks dirty and contaminated by some type of red polution...",
  "The park seems to be ok. Nothing exciting. Play area is very limited and is in direct sunlight. Lots of open space though and a small walking trail.. good for riding bike. Only one picnic shelter and that's just at the start of the park... Is not maintained and grass is not trimmed.",
  "Cool park with playground and basketball courts, also there is a bridge that overlooks a small riverbend with shallow water",
  "We love this park! If you follow the trail to the back there are basketball courts and fields to play baseball or football in. It has a bridge with a beautiful stream also."
 ]
}]
