[
 {
  "name": "Gage Park",
  "address": "635 SW Gage Blvd, Topeka, KS 66606, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a8ec4086-9334-11ea-89a9-14b31f159f22.png",
  "tags": [
   "walking",
   "kids",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=13047831872086563920",
  "source": "GoogleMaps",
  "reviews": [
   "I visit Gage Park often. There are paved walking trails perfect for mommy n me  with strollers, seniors, and dog walkers. Beautiful flower gardens in the spring through winter make for a photographer's dream. The antique merry-go-round is a must see and the train is every child's desire. The dog park is a safe place with separate areas for large and small dogs.",
   "I grew up in Topeka and have always loved this park. I love how they have kept the cool old stone play area, but have also added new fun things. We love to stop by the park when we visit. My kids love it too.",
   "Lots of renovation here. In spring the flowers and trees are beautiful. This is s great place for photography. The zoo is improving and we always LOVE the little train.",
   "The greatest park I've ever been to,  to include major metropolitan parks.   Great playgrounds,  great facilities, beautiful.   The mini train was a big part of my childhood when I visited here as a child,  now its my daughter's favourite thing.",
   "Great place. Lots to do and see. The zoo there is great for it's size.a great stop when you are in Topeka"
  ]
 },
 {
  "name": "Kansas Children's Discovery Center",
  "address": "4400 SW 10th Ave, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a9520776-9334-11ea-b1ff-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "family",
   "family",
   "kids",
   "family",
   "free",
   "library"
  ],
  "link": "https://maps.google.com/?cid=1272456844806300323",
  "source": "GoogleMaps",
  "reviews": [
   "This Grandma recommends it! Our grandson's birthday party was fantastic. They have an excellent events room you can rent and it includes admission for all of your party guests. There were so many activities - indoors and out -  for ALL of the kids - big and small. We had children 1 thru 12 with us. Plus, the adults had just as much fun discovering as the kids.",
   "A lot of fun STEM activities for the kids! Great staff! A cool place to spend time with your entire family!",
   "Great place to go for the kiddos year round, they usually have updated areas. 100 bucks gets a family 1 year of access. They have indoor and out door play areas. Great for all weather conditions.",
   "Absolutely love this place. We are there a couple times a month and always have to pull the kids away. Got a membership and just drop in or used it as a pit stop while one of us goes to the grocery store.",
   "Great place to take the family you can also get a free day pass if you have a Topeka library card you just have to go to the library and check it out"
  ]
 },
 {
  "name": "Kansas State Capitol Visitor Center",
  "address": "SW 8th & SW Van Buren, Topeka, KS 66612, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a9a1fc82-9334-11ea-9930-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "walk",
   "wander",
   "history",
   "knowledgeable",
   "free",
   "tour",
   "learn",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=15823548141389325304",
  "source": "GoogleMaps",
  "reviews": [
   "We went on a Saturday so there were few visitors, which was great. We took the Historical tour, which I recommend. Our guide was knowledgeable and shared many facts and anecdotes which made our visit exponentially more interesting than if we just wandered around. It was basically a private your. Two of our friends joined my husband and me for the tour and there was only one additional couple in our group.\n\nI buried the lead because the Capitol is quite beautiful. The renovation was done very well and the visitor center is a wonderful addition.\n\nWe parked in the underground garage, and again since it was Saturday it wasn't  crowded. \n\nMy husband and his friend took the tour to the top of the dome. They enjoyed it. I am glad we visited the Capitol building. If you are a Kansan and haven't been,  I recommend adding it to your  \"to-do\" list.",
   "Absolutely beautiful building that's almost entirely accessible at all times. There's a wonderful new visitors center with lots of displayed history that you can walk through before entering the main atrium. You can wander to all the buildings floors and get awesome views from up near the dome to the floor looking up. As a Kansans it's a great place to visit and see where everything happens.",
   "Great place to spend an afternoon in any season. Have time to plan ahead, call and set up a guided dome tour. Clean facility and well-organized exhibits. Knowledgeable and helpful personnel. Gift and curios. Free to the public.  *Conference rooms can be reserved for a variety of social events.*",
   "The Kansas State Capitol, known also as the Kansas Statehouse, is the building housing the executive and legislative branches of government for the U.S. state of Kansas. Located in the city of Topeka, which has served as the capital of Kansas since the territory became a state in 1861, the building is the second to serve as the Kansas Capitol.\nThe dome, at 304 ft (93 m), is taller than the 288 ft (88 m) United States Capitol dome, although its diameter (50 ft (15 m)) is approximately half that of the national capitol (96 ft (29 m)). It is one of the few capitols in the United States that continue to offer tours that go to the top of the dome. Visitors enter the dome by climbing 296 steps leading from the fifth floor to the top.",
   "Had the opportunity to visit when I was a senior in high school. I knew I would come back some day. Manifestation at its finest when I earned the opportunity to work on Capitol Hill as an adult. Tour guides are excellent. Such a great way to learn more about our nation. A must do when in DC!"
  ]
 },
 {
  "name": "Evel Knievel Museum",
  "address": "2047 SW Topeka Blvd, Topeka, KS 66612, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aa030878-9334-11ea-8505-14b31f159f22.png",
  "tags": [
   "learn"
  ],
  "link": "https://maps.google.com/?cid=18243068583680458399",
  "source": "GoogleMaps",
  "reviews": [
   "Great detail lots of good contributions from Robby's life and experiences. The Topeka Harley shop and restoration team did an amazing job. The mack is worth seeing and I appreciated seeing the hand painted work on truck and trailer.  You donxt see hand painted vehicle work much any more. Amazing!  Check out the simulator.",
   "More than you ever wanted to know about this incredible person. You probably only heard snippets about him growing up. Get the whole story and learn the behind-the-scenes realities here.",
   "Loved the place. Grew up watching all his jumps. Was amazing to see all these items he used throughout his life and career",
   "Change your website hours!! Today (Sunday) I was traveling through the area and seen a billboard sign for the Museum, Cool! I am a huge E.K fan.\nSo I google it and it says open today closes at 5:00 great it is 1:00 I get off the freeway and go to the location, locked up tighter than a jail cell.\nCan you change the Google sites to reflect the CORRECT hours ?",
   "It’s super interesting to see all the crazy stuff they have. I spent about an hour in there just exploring, Definitely recommend the 4d flying experience. All in all it was a great stop and the gift shop is pretty cool too."
  ]
 },
 {
  "name": "Ted Ensley gardens",
  "address": "3650 SE West Edge Rd, Topeka, KS 66605, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aa62b4f4-9334-11ea-b6e6-14b31f159f22.png",
  "tags": [
   "walk",
   "eat",
   "walk",
   "family",
   "walking",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2954995896033593764",
  "source": "GoogleMaps",
  "reviews": [
   "This is a gem to visit. We happened to drive by on our way back to Kansas City and wanted to pull over to eat a meal we bought. We found a picnic table by the edge of the pond. Then we decided to take a quick walk around the garden which turned out to be most amazing manicured sanctuary. We loved the paths or trails, the abundance of flora and water falls. The back drop of the lake was very relaxing to enjoy an afternoon.",
   "Beautiful gardens and walking paths. I take my dogs here whenever I can. We walk near the lake, watch the boats, watch the people fishing. There are ball diamonds and soccer fields nearby, pic nic places and playgrounds. A must see for the whole family.",
   "Beautiful place to take a leisurely stroll, stop and smell the flowers, have a date, read a book, or sit and relax/meditate. You could even have a lovely photo shoot or possibly a small wedding! It was a great spot to just be able to relax and enjoy the scenery. My kids absolutely loved it even though one of them wasn't too excited about going in the beginning. By the time we left, he said he really enjoyed it and can't wait to come again, especially when the tulips will be in bloom!",
   "The most beautiful spot in Topeka! The gardens are always maintained and the lake is clean and beautiful. We even had our wedding reception there. Everyone couldn't stop talking about how beautiful the gardens are. It was so lovely and we are so thankful that this place exists. Everyone should come here and stop to smell the flowers.",
   "We are from another city but decided to take family photos in the park. We were pleasantly surprised by the landscaping and appearance. This made for beautiful photos and a very fun family day. The views of the lake from the park are nice and many people seem to enjoy the flowers, ponds, and trails that permeate the park."
  ]
 },
 {
  "name": "Lake Shawnee",
  "address": "3137 SE 29th St, Topeka, KS 66605, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aabc1fca-9334-11ea-ac8c-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "walking",
   "parks",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=14899155058988632961",
  "source": "GoogleMaps",
  "reviews": [
   "This is my go to sidewalk, jogging spot. You have plenty of space on the sidewalk, and your miles are marked as go. At first I was not pleased with the feeding the geese ban, but the sidewalks sure have been cleaner and you see less dead fish IMO. I like that you can jog the entire sidewalk trail and see people. It’s open and has very few blind spots if any. I feel safe when I’m jogging at Lake Shawnee.",
   "The park is nice...ball diamonds.. great walking ...went to look for a place to trout fish in the morning... good luck with that !!! Weeds...weeds ..& weeds....they need to do something with the water condition.... wish I could get a refund on my permit....I'm not going!!!",
   "Lake Shawnee is a great little man made lake on the SE side of Topeka. It has a concrete sidewalk going around the entire lake. The city/county have made tremendous improvements in the past 20 years! Beautiful gardens to walk through, abundant fishing, walking, biking around the lake, kayak and other rentals, golf,  tennis, sand volleyball,  playgrounds, camping.... the list goes on.",
   "Beautiful in the fall, kind of a hidden gem in Topeka. The lake is nice to boat and swim in. My issue between four and five stars is the rules for boating during the summer are too restrictive for the amount of lake available. I would like to see a better use of the lake. Surrounding the lake are parks, playgrounds, and campgrounds that allow for many hours of enjoyment.",
   "Beautiful neighborhood & the walking path by the lake is immaculate. Gorgeous everywhere... amazing large trees, the lake itself, willow, moss, bridges & architecture, all lovely. I just stopped when driving by and took a 10-minute walk, it is definitely an oasis that is perfect for rejuvenating. My Little Monster enjoyed it's also."
  ]
 },
 {
  "name": "Topeka Zoo",
  "address": "635 SW Gage Blvd, Topeka, KS 66606, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ab164df0-9334-11ea-ae98-14b31f159f22.png",
  "tags": [
   "walk",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=7968729584161268699",
  "source": "GoogleMaps",
  "reviews": [
   "The Topeka Zoo is small but mighty!  We love going to see the animals and playing at the “beach”.  They have several events for children and adults all throughout the year.  A learning center, a nice gift shop, a park, a petting zoo, and a little restaurant (who needs to serve french fries).  After the zoo, you can walk right across the street to play at the park, stroll through the rose garden (in season of course), fish in the pond or take a ride on the train or carousel.  Both the Zoo and the Park are wonderful places to take photos also.  I’ve captured some of my very favorite pictures at the zoo.",
   "I love this zoo mainly for its size. You get to see a good variety of animals and dont feel completely dead at the end. I loved the newer building by the lions. It gives you a break from the elements and allows you a few of I think 3 different animals.",
   "This zoo is top notch! Their rain forest is full of very interesting birds. This one in particular will seem to try to dive-bomb unsuspecting visitors! Always an adventure!",
   "Because for a small city zoo, the staff make the most with what they have to work with. Animal care is top notch. The rainforest is amazing. The Zoo Camp each summer is a perennial favorite. My son has been going since he was 5 and still looks forward to it at 12.",
   "My all time favorite Zoo! It's on the smaller side but to me is the perfect size. No big hills to climb with your kiddos. Affordable. Clean. Always seem to be adding new exhibits."
  ]
 },
 {
  "name": "Combat Air Museum",
  "address": "Topeka Regional Airport, 7016 SE Forbes Ave, Topeka, KS 66619, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ab6c368a-9334-11ea-97c0-14b31f159f22.png",
  "tags": [
   "tour",
   "kids",
   "tour",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=4889404756593875397",
  "source": "GoogleMaps",
  "reviews": [
   "If you are going through Topeka it's a must stop.  Where else can you find an f-14 tomcat you can see up close.  There is also a wonderful veteran there named Ralph who can tell you all about the place.  Just go, you won't regret it.",
   "Great place with lots of airplanes.  We had a tour guide all to ourselves.  It was all very interesting and my kids loved it. We will be back.  BTW,  there is also a Kansas NG museum close by as well.",
   "We sooo enjoyed seeing and being able to tour the old airplanes this past weekend!! They are truly amazing. The tour guides were very informative as well! One thing that might have made it a bit more enjoyable would have been some port-a-potties and perhaps a place to buy some cold bottled water at least. But I do realize that money could be a concern. And I look forward to returning when they come back!!",
   "Terrific volunteer staff, and so much to see! Brian and Jon took care to share their knowledge about the organization and hard work needed to have a museum of this quality. Thank you!",
   "Knowledgeable, friendly people in an amazing air museum with very interesting displays."
  ]
 },
 {
  "name": "Old Prairie Town at Ward-Meade Historic Site and Botanical Garden",
  "address": "124 NW Fillmore St, Topeka, KS 66606, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/abb24068-9334-11ea-80d4-14b31f159f22.png",
  "tags": [
   "walk",
   "tour",
   "free",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7762325209616839757",
  "source": "GoogleMaps",
  "reviews": [
   "The family and I stopped here on a trip out west.  We absolutely loved it!  An 1800's town all laid out for you to walk around in coupled with some nice botanical gardens AND IT'S FREE!!  There is a gift shop and a ice cream soda shop (old school pharmacy) that you can stop at and enjoy some refreshments at.  They have a tour as well but you should check their site for hours.",
   "Loved the tulip festival this year. Beautiful flowers and beautiful preserved cultural things.",
   "A great place to spend some time and the gardens are nice when they are in full bloom.",
   "We had a great time today in the weather was beautiful. She especially enjoyed the petting zoo and the prospecting where she found \"gems & sharks teeth\"!",
   "I have been there for the first time as it is the time for Tulip festival and it was pretty beautiful. Easy to navigate, spend some time there and see those beautiful flowers and lights."
  ]
 },
 {
  "name": "Museum Of Kansas National Guard",
  "address": "125 SE Airport Dr, Topeka, KS 66619, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ac00d5a4-9334-11ea-85ce-14b31f159f22.png",
  "tags": [
   "kids",
   "history",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=15953646330890009764",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great donation museum with tons of military history. We loved the tanks outside of the museum. They have an American half track from WW2 and some Russian tanks captured in Desert Storm! Inside the museum has lots of military artifacts from the National Guard including a flame thrower, anti tank gun, rocket launchers, and way too much to list. There was some military gear for the kids to dress up in, which was awesome.",
   "Neat place. No idea it even existed until I drove by it. Lots of aircraft and equipment on display, everything has a descriptive tag on it. Great place for a short walk, see some amazing engineering and to enhance your sense of patriotism.",
   "I Love having my Dad & Mother memorialize with a USAF brick at the Museum. My Father & Mother in Law with a National Guards brick as well. Also, both families with a plaque inside. Donations went to a fabulous cause. ❤❤",
   "We enjoyed it so much we recommend it highly. It's very educational you leave having total respect for all of our military past and present. The people there or very helpful and wonderful they answered your questions or found somebody that can. Very clean we left there knowing a lot more than we did I cannot thank our military enough for what they have endured and still do. All in all it was very educational and a great experience. The hospitality was as best as you can get!!!!! Thank you again",
   "Neat place to visit. All the new additions to the yard crafts."
  ]
 },
 {
  "name": "Mulvane Art Museum",
  "address": "1700 SW Jewell Ave, Topeka, KS 66621, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ac4ab01c-9334-11ea-b96c-14b31f159f22.png",
  "tags": [
   "creative",
   "kids",
   "free",
   "art",
   "kids",
   "free",
   "art",
   "creative",
   "art",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=3481041334049747989",
  "source": "GoogleMaps",
  "reviews": [
   "We have enjoyed visiting the art lab many times. Several stations for the kids & kid at heart to get creative.  They host parties as well as open creative area with a station that changes regularly.  Free parking & free admission.  Located in the basement of the Mulvane Art Museum.",
   "This is such a fun place for the kids! My three love going to the art lab. There are so many different hands on art activities that are offered, and for free! They have a Lego area, places to draw self portraits, paint, color, use blocks, weave, draw like you are in a cave, and many more. It is run by the university, and work study students. We have been several times and every time has been a great experience.",
   "I love the art lab down in the basement. My kiddos enjoyed getting to be creative.",
   "Very nice place to visit and learn. I enjoyed it and will be back.",
   "Wonderfully curated. Can't wait for the next installation."
  ]
 },
 {
  "name": "Great Overland Station",
  "address": "701 N Kansas Ave, Topeka, KS 66608, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ac8e9728-9334-11ea-83bb-14b31f159f22.png",
  "tags": [
   "history",
   "walking",
   "history"
  ],
  "link": "https://maps.google.com/?cid=11371921288353847958",
  "source": "GoogleMaps",
  "reviews": [
   "The history was was interesting.  My friend left this very station 65 years ago.  We were here for a Harvey Girl Luncheon.  The meal was terrific and service was divine.",
   "Closed on Mondays, but has what appears to be a great museum place and a lot of outdoor walking areas",
   "This is a wonderful place. Play room for children. Lots of information and beautiful building.",
   "Wonderful place to see a great amount of kansas history and talk to some very intelligent people.",
   "I was not inside the station, just outside, on the lawn near the tracks just like everyone else.  I can't believe they let pedestrians cross the tracks!  Unsafe.  \n\nWe were there for the UP 844 steam train and it was really cool."
  ]
 },
 {
  "name": "Ward-Meade Park",
  "address": "124 NW Fillmore St, Topeka, KS 66606, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/acd17ac0-9334-11ea-a81b-14b31f159f22.png",
  "tags": [
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=9057552563390734766",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice and relaxing place to come and see the beautiful light displays at night. I especially love the Asian garden display with the meditation bell. Reminds me of my old martial arts training facilities when everyone was outside doing various exercises and meditation. I was honestly expecting to see a group of students jogging by with their sparring sticks.",
   "The landscaping is absolutely stunning. A great place to relax and unwind.",
   "Ward-Meade Park is beautiful I love to go there and just walk and clear my mind",
   "Beautiful and peaceful place. Tulips were just blooming. Just Beautiful!",
   "A variety of garden themes, the Japanese garden is excellent, but there isn't a bad one in the bunch. Plenty of shade, two free parking lots, you won't be sorry."
  ]
 },
 {
  "name": "Kansas Museum of History",
  "address": "6425 SW 6th Ave, Topeka, KS 66615, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ad29fb78-9334-11ea-8bcf-14b31f159f22.png",
  "tags": [
   "approachable",
   "walk",
   "family",
   "knowledgeable",
   "history",
   "history",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16374101637293003962",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful museum with a great children's hands on learning area. Staff very knowledgeable, friendly and approachable. The walk on train experience was my favorite, but the Native American history was the most interesting to me. The gift shop had lovely Kansas items for friends and family.",
   "We were so surprised how wonderful is this museum!! It is clean, bright, open-feeling with very informative displays. The number of displays will have you there from 2-4 hours depending on how much time you take at each stop. \nLoved it!!",
   "Beautifully set up and was very impressed by all the artifacts and the history that went with it...It still looked the same as it did back when I first saw it back in 1985😊😊😊 Great place for  our of towners or locals to visit.. I think the three of us spent at least 4 hrs. going through the museum,and found it utterly amusing!",
   "Very interesting place, yet really fun to walk around for both kids and adults. Staff is super friendly.",
   "Nice variety of Kansas related exhibits from early times, settler times, to the present. Restored train and passenger cars was a special treat for our toddler."
  ]
 },
 {
  "name": "Jayhawk Theatre",
  "address": "720 SW Jackson St, Topeka, KS 66603, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ad6e3054-9334-11ea-9e75-14b31f159f22.png",
  "tags": [
   "music",
   "tour",
   "historic",
   "food",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=5921980558187128003",
  "source": "GoogleMaps",
  "reviews": [
   "It is such a beautiful building!  The embellishments and attention to detail with so much still original!  If you love old buildings it is a must see.  My only complaint is that it was cold.  The old theater seats are long gone so the event planners used folding chairs and there were a few tables.  I know that it is a work in progress and will only get better, I'll happily go again!",
   "The architecture of this place is Way Cool the Ambiance and Acoustics are just as awesome. Seems to lend itself better for Electronica and music type Productions rather than theatrical events however it's fun no matter what and in a great location",
   "My work had a little gathering there. The employees are awesome! The food was good. The atmosphere was was great. I love old historic places and they offered to take anyone who wanted on a tour. Loved it!",
   "Still pretty rustic,  but the show was great. Be prepared as like in dress appropriate to the outdoor conditions.  The existing HVAC is also rustic.",
   "The last surviving historic theater in town - someday it'll be beautiful again."
  ]
 },
 {
  "name": "Burnett's Mound",
  "address": "3511 SW Skyline Pkwy, Topeka, KS 66614, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/adb4135a-9334-11ea-be66-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=10472288810244500031",
  "source": "GoogleMaps",
  "reviews": [
   "This Topeka overlook has always been popular. What has changed is that now you can't drive to the top anymore. You have to park then walk about a mile to get there. You can also ride a bike to the top provided you have very strong legs. I do have to say it's more peaceful without all the cars.",
   "Great place for a hike.  Awesome view.  Our dogs love it too.",
   "Great view high above the City of Topeka.  Nice walk up to the top.",
   "The Powers that be Decided on their own without the Public's input to put a MASSIVE STEEL GATE at the top. So, you can no longer drive to the top and sit and enjoy OUR PARK and a STATE HISTORICAL SITE. THIS WAS VERY SNEAKY and done like a communist government.. This should not be allowed to stand. This WAS the best site and View in TOPEKA, It still could be if we demand it back !!  Please start contacting city officials.",
   "Lovely view, I used to take my daughters up there a lot.  There used to be a short trail at the bottom of it that didn't take long to get to the top.     Lately the ground hasn't been kept up with and it's no longer there.   We don't have enough time together to go the long way.  But it's very beautiful once you're up there. I'm surprised there's not many ppl there all the time.    Could use more upkeep  It's a chigger and snake sanctuary at the moment"
  ]
 },
 {
  "name": "Holley Museum-Military History",
  "address": "420 SE 6th Ave, Topeka, KS 66607, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ae0946a2-9334-11ea-9f90-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "free"
  ],
  "link": "https://maps.google.com/?cid=7615364630582274010",
  "source": "GoogleMaps",
  "reviews": [
   "This is a small museum from a personal collection located in the Ramada Hotel, but don't let that fool you.  The space here is larger than expected and seems to keep pouring over with artifacts and model scenes.  You could easily spend an hour to three or more going through this museum and the best part about it is the old veteran who usually sits in there and watches over this vast collection.  If you get a chance then check it out and ask the old veteran to show you around.  He is full of information and stories to tell.  A true treat for anyone interested in history and meeting a nice gentleman.",
   "A awesome place of military history along with just American history. Great place to see if you have a chance!",
   "My guide was a wealth of knowledge! An amazing place full of fascinating stories. Wish I could have spent more time here.  And free! It's inside the Ramada Inn facility, and I'm told it's one of two free museums in the building. ",
   "Great museum. Make sure to go when the volunteers are there for some great stories.",
   ""
  ]
 },
 {
  "name": "Iliff Commons",
  "address": "NE 31st St, Topeka, KS 66617, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ae525dd2-9334-11ea-af00-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3335262029842538360",
  "source": "GoogleMaps",
  "reviews": [
   "This is a lovely place to walk (or run).  There is also a mountain biking trail. There are a variety of features along the trail such as statues of bison at the top of the Ad astera ascent where you can see the city of Topeka on the horizon, a replica cabin of the one the founders of Topeka spent a cold winter in until it burned, a tree fort you can climb up into, a pond with a dock, and a large tire swing. If I had grandkids I would definitely bring them.  My husband and I visited in March when the grasses were brown. It was still beautiful, but I'd love to go back in spring or early summer.",
   "A wide range of terrain and very well taken care of trails. The runner signs, the cabin, the bison and the pond are all great features.",
   "Very nice of the Iliff family to open their land to the public. Very enjoyable, thanks! Be sure and read the rules posted at the entrance, very humorous and helpful.",
   "Beautiful. Very well kept. I love that i don't have to use a leash. Nearly everyone is very friendly.",
   "Outstanding place to walk. Hills are demanding, but short. Short drive and scenic views. So many thanks to the Iliff family."
  ]
 },
 {
  "name": "Dornwood Park",
  "address": "2815 SE 25th St, Topeka, KS 66605, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aea9a5b4-9334-11ea-8001-14b31f159f22.png",
  "tags": [
   "nature",
   "kids",
   "parks",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6679382095206941106",
  "source": "GoogleMaps",
  "reviews": [
   "Love the twists and turns, had very zen feel for me. Can't wait to make the time to go back. Honestly stumbled across this place and glad I did.",
   "I have spent nearly a year on these trails with my dog and I must admit these are some of the best trails I have ever hiked around this area of Kansas and this is coming from a country boy that has spent most of his life exploring nature. \n\n     Dornwood trails and park are just a short drive from the south east side of Topeka which is filled with all the stores and restaurants one needs. Don't let the location fool you, I can tell a lot of care and attention has been given to them.\n\n     I look forward to experiencing them more on my journey to a healthier body and mind. \n\n    One of the best kept secrets of southeast Topeka.",
   "I was pleasantly surprised by the spray park they added to the park. I had no idea they had that amenity there. That's awesome for the kids who may not be able to afford to go to the community pools. I hosted a birthday party there and the park was clean and grass was cut. The playground equipment was in great condition and appeared newer than in most parks. I'm still shocked that something this nice is over here and grateful at the same time. It definitely didn't look this amazing when I was growing up! Way to go Topeka!",
   "Color marked trails. The landscape has changed a lot since we roamed through a few decades ago, but the mystique remains.",
   "Lots of trails to run, walk or ride a bike... ps don't get lost. Lol"
  ]
 },
 {
  "name": "Felker Park",
  "address": "Topeka, KS 66604, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/af00edd2-9334-11ea-bd51-14b31f159f22.png",
  "tags": [
   "walk",
   "field",
   "parks",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3992782382831326303",
  "source": "GoogleMaps",
  "reviews": [
   "Great view of the sunset on a clear day. Like to come here to walk the dogs and take the trails towards the back of the field near the tree line.",
   "Love the parks and recreation girl named Gina. Shes so hot and very friendly",
   "Peaceful... sounds of people enjoying their recreation at the tennis courts and people taking their dogs out for a nice walk or run.  I enjoyed my time there.",
   "Ample parking with a nice walking trail near by. You will generally see some kind of wildlife along the way.",
   "Football soccer fields not wheelchair accessible"
  ]
 },
 {
  "name": "Hummer Sports Park",
  "address": "2751 SW East Circle Dr S #1, Topeka, KS 66606, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/af501f62-9334-11ea-a214-14b31f159f22.png",
  "tags": [
   "kids",
   "field",
   "kids",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7287880158727073525",
  "source": "GoogleMaps",
  "reviews": [
   "The folks volunteering at concessions are fantastic but they could use more support. They also need a band only line during the break those kids get during the 3 quarter of football games. The sound system could use some more power at the low end and roll off some of the mids causing a lot of distortion.",
   "This is a great and roomy football stadium with plenty of room to entertain bored little ones while your big kids are playing their football games.  The food is not bad at all.  Additionally, you are able to follow the teams up and down the field from the bleachers.  They are nice and roomy.  So you can get a great vantage point and videos/photos through out the game.",
   "Great place to run!",
   "Just a beautiful and peaceful park!",
   "Clean and good ballpark food"
  ]
 },
 {
  "name": "Mouse Trap Skate Park",
  "address": "801 NE Poplar St, Topeka, KS 66616, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/af940652-9334-11ea-aeb9-14b31f159f22.png",
  "tags": [
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15206347630873937490",
  "source": "GoogleMaps",
  "reviews": [
   "Well kept clean park.  Kids love the old school play area along with the new jungle gym style.  The trails are a great walk.  The trees are beautiful.",
   "Great park and such a good place to skate.\nLoved it.\nSkater for life🤘",
   "I hadn't been up towards the Oakland Community area in a long time. It is a heck of a lot cleaner and better maintained, and the teens were nice and respectful. Proud of you Oakland!",
   "I just stop by for a min n OMG THE BENCH broke the moment I sat on it 😡....be careful",
   "I like the park but I can tell it wasn't designed by a pro skater. Fun to skate though. I liked it. Skate there if you got time!!"
  ]
 },
 {
  "name": "MacLennan Park Trail",
  "address": "Topeka, KS 66606, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aff0f3d0-9334-11ea-bbcb-14b31f159f22.png",
  "tags": [
   "walking",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=9308612747804540261",
  "source": "GoogleMaps",
  "reviews": [
   "A very beautiful park with forest trails and water bodies",
   "We love walking our 2 dogs. There's plenty of trails to always keep it interesting.",
   "Great hiking trails but take a picture of the map kiosk before hiking. We toke a picture and used it several times at trail junctions. Beautiful timber with many species.",
   "Beautiful nature..",
   "Love this place. It was the first time and was snowing."
  ]
 },
 {
  "name": "Charles Curtis House Museum",
  "address": "1101 SW Topeka Blvd, Topeka, KS 66612, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b0452e64-9334-11ea-b6bf-14b31f159f22.png",
  "tags": [
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=11299911507168868200",
  "source": "GoogleMaps",
  "reviews": [
   "Interesting to see 😃",
   "Beautiful house rich in history.",
   "Worth the tour!!",
   "Fascinating artifacts and period furnishings related to Topeka's most prominent statesman.",
   ""
  ]
 },
 {
  "name": "World's Largest Wren Statue",
  "address": "466-498 SW Huntoon St, Topeka, KS 66612, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b0908f70-9334-11ea-a9c5-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=14882046315124119720",
  "source": "GoogleMaps",
  "reviews": [
   "As an avid fan for quirky roadside attractions this is definately a huge bird! It's a bit sun faded sits prominently in a little grass park between busy streets. There is a pull off spot to park so you can get up close to view it. My 4 star rating is the lack of info plaque. There is some info online but the statue sits with no credit to the artist or explaination.",
   "A tranquil little park in the middle of the hustle and bustle of city life.",
   "Located right near downtown is this cute little roadside attraction that’s has been there longer than I bee alive!",
   "Big bird, can't complain.",
   "Probably not a lot of people interested in this statue although it has historical significance to Topeka. We were here to take my Mothers picture with the statue like she had done in 1950. Close to Kansas Capitol Bldg. Another point of interest."
  ]
 },
 {
  "name": "Historic John and Mary Jane Ritchie house",
  "address": "1116 SE Madison St, Topeka, KS 66601, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b0e20b22-9334-11ea-a4e0-14b31f159f22.png",
  "tags": [
   "learn",
   "tour",
   "history",
   "history",
   "walk",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=13698078368169269975",
  "source": "GoogleMaps",
  "reviews": [
   "If the description of how Lyme is made doesn’t entertain you, maybe the racist tour guide will! The tour guide referred to a slave as “it”, and talked more about how to manufacture concrete in a quarry and the Congregationalist church than the Underground Railroad. He had historically inaccurate information about Native Americans and called them “primitive people.” Please don’t come here, it would be a better use of your time to read the Wikipedia article. Or go to the Brown v. Board Historical site down the street, that’s an amazing way to learn about the history of segregation and slavery. It was mostly the guide we had, he was the only one there and he may not have been the regular guide, but our group was severely disappointed in the quality of this experience.",
   "Wow! Awesome stop along The Kansas African American History Trail!",
   "I dont know wat the house is an never heard of it......so plz let me know",
   "I just walk passed it to get home. I don't know much about it",
   "The guide is very knowledgeable and makes leaning about the underground railroad interesting.   I would go back"
  ]
 },
 {
  "name": "Perry State Park",
  "address": "5441 W Lake Rd, Ozawkie, KS 66070, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b130795e-9334-11ea-b395-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=9856241828887105604",
  "source": "GoogleMaps",
  "reviews": [
   "Great trails for mountain biking, hiking and running. Lots of spiders and ticks in summer",
   "A refreshing water venue that can easily be made into a day trip from points in and around Greater Kansas City. A breath of fresh air.",
   "It was by chance wé stayed here. Beautiful place with lots of history.  ",
   "A bit windy but otherwise, a great day.",
   "Peace, camping fishing, Muligans place to eat..its gteat"
  ]
 },
 {
  "name": "Historic Lecompton",
  "address": "640 E Woodson Ave, Lecompton, KS 66050, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b17b8c5a-9334-11ea-bf69-14b31f159f22.png",
  "tags": [
   "history",
   "affordable",
   "history",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13075732709429728234",
  "source": "GoogleMaps",
  "reviews": [
   "All Kansans need visit Lecompton. The history of our state before it was a state is intriguing and so well presented at the museum in Lecompton. 🌻",
   "My wife and I visited here for the annual Christmas tree displays. We will be returning. 150 Christmas trees with lights and ornaments from a large number of different times. Just an incredible number of displays. The nostalgia was incredibly moving for me.\n\nStaff is friendly and helpful. Entry is by donation so very affordable for young or elderly families wanting some fun without a ton of money. Space is tight and there was a good number of people so be prepared to take some time and be patient. The building was built in the early 20th century and with all the exhibits it can be hard to move around at times with all the people there.",
   "Really not much to see for the distance you have to travel. They were having a street fair with a few vendors. The church had a scrumptious chicken dinner. There is a cafe there.",
   "Wonderful place! Loved the history & 202 Christmas trees. Highly recommended!",
   "Nice free history site that has little known importance.  Turn right(north?) When u get done with toll booth.  There is no sign telling u to turn right or left.   I was coming from the east on highway."
  ]
 },
 {
  "name": "Prairie Band Casino & Resort",
  "address": "12305 150th Rd, Mayetta, KS 66509, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b1c82600-9334-11ea-b131-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=1694082461540481932",
  "source": "GoogleMaps",
  "reviews": [
   "We always have a good time here. The attendants are on top of keeping everything picked up and clean, even security can be spotted pushing empty chairs in closer to the machines to keep them out of the walkway. Saw and heard a number of people winning. Highly recommend going here!",
   "Beautiful location. A wonderful get a way stay.  The buffet was the best food I ever had. Puts Kansas city casinos buffets to shame. Nice rooms a bit dated, but our room was clean and comfortable.",
   "Last night. Was a blast!!! Not jammed packed, yet enough guests to make the evening delightful. Great selection of slots, and now there is a \"High Limit\" room.  Sweet selection of table games. Not one was closed, and all the tables had guests playing. Definitely going again!",
   "Don’t go there if you are a pretty single female. Especially if you came from an event and are dressed up. Security will ask about you when you leave. I was just trying to gamble. It is not my fault if men come up to me, I never went up to anyone. So why are you going up to my friends and asking about me?",
   "The rooms are fairly nice but the casino was disappointing. They've done all the expansion and renovation but so many of the games look alike. They're either retro-old (which I still like) or they all have dragons or some other Oriental theme. They just play and look the same and there was a lot of grumbling about how tight they are. We will probably check it out again after the new additions but I hope they've got some more different games. I did enjoy the hot tub area being open all night."
  ]
 },
 {
  "name": "Breakout Lawrence",
  "address": "727 Massachusetts St, Lawrence, KS 66044, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b2116430-9334-11ea-8c9a-14b31f159f22.png",
  "tags": [
   "creative",
   "family"
  ],
  "link": "https://maps.google.com/?cid=8010627027107394271",
  "source": "GoogleMaps",
  "reviews": [
   "We went in completely green, having never played a breakout room.  We did the \"Rules of Basketball\"  The staff was very pleasant and helpful.  The room was great.  We used all 3 hints and received a few extra \"bonus\" hints at well timed points.  These were never annoyingly too revealing - just enough to nudge us in the right direction.  We will be back!",
   "So much fun with a large or small group! Really challenging and each room has new surprises so you really must do them all👍🏼😉",
   "Had a great time in the Civil War experience!  Would recommend it to any group of 2 or more people 13 years old and older unless there was a younger person who really like older things and was at least 5 feet tall.  Helpful to have 2 or more people with different thinking styles like visual vs verbal and sequential vs random.  A lot of fun.  Nothing threatening about it at all.  Very helpful staff.",
   "We had a great time! The Civil War room was very creative and challenging. The staff were super friendly and helpful during our time. This was our first breakout and definitely not our last!  Highly recommended!",
   "After having broken out of all the rooms, for a family holiday event we tried the mobile breakout room that comes to your house: it was great. So convenient to have the breakout room come to you. They set it up in a room in your home. The breakout features were clever and had twists you might not expect for something brought in. Great fun at a great price."
  ]
 },
 {
  "name": "Shawnee County Parks + Rec",
  "address": "3137 SE 29th St, Topeka, KS 66605, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b25aa2b6-9334-11ea-a3e2-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=3755217669933978377",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome place to go and fish and picnic ride bicycles will be back",
   "Very Clean. I Was Able To Relax And Meditate.",
   "It's Beautiful !!",
   "Nice, inexpensive camp ground.  No sewer hook ups but dump station is just across the street.  Along side beautiful Lake Shawnee.",
   "I signed my teams of for the Lake League long story short they canceled the league not enough teams (which they knew this and said nothing before taking my kids money) and here OT is almost a month later and Im still waiting for them to return my kids 2300.00 which they gave me the run around told me I couldn't pick it up only to find two weeks later I can pick it up. The lady of accounting needs to be fired how are we not insuring $2300.00 or we are sending large amounts with a tracking number Shawnee county park and rec needs to be shut down or they need new people running it SCGSA as well!"
  ]
 },
 {
  "name": "Watkins Museum of History",
  "address": "1047 Massachusetts St, Lawrence, KS 66044, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b2a5672e-9334-11ea-8ac1-14b31f159f22.png",
  "tags": [
   "free",
   "history",
   "learn",
   "family",
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=12773328398651188936",
  "source": "GoogleMaps",
  "reviews": [
   "Cute, FREE, museum right on mass! Definitely worth stepping in and taking a look. Their kid programs in the summer are a wonderful escape from the heat and don't forget to take the little ones to the top floor to visit the playhouse. Reserved free parking for museum guests in the alley behind the building, handicap entrance on the side.",
   "This museum has a ton of artifacts and information about the history of Lawrence, Kansas. It includes everything from the civil war to civil rights. It has a lot of displays about University of Kansas basketball. It also has stuff about wheelchair basketball. It has displays about the raid on Lawrence by Quantrail and his raiders. It also has a display about John Brown, the famous abolitionist.",
   "Great collection and good layout. Not too big. BEAUTIFUL building!",
   "Nice museum. Good local history exhibits. Nice old building. Friendly staff. They offer a wide range of family friendly activities. Great place to learn about Lawrence!",
   "Great place for a family.  They have interactive displays aa well!"
  ]
 },
 {
  "name": "Riverside ATV Park",
  "address": "Topeka, KS 66616, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b2f423c2-9334-11ea-a42b-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=16487619007613721049",
  "source": "GoogleMaps",
  "reviews": [
   "Is an exelant place to ride and is kid friendly. I've been riding there for years and now take my kid's there as well.",
   "Super sloppy right now but when it's dry a really fun place to ride. Would give it 5 stars but it's not in the best neighborhood. Alot of sketchy people walking around",
   "A buddy and I went on April 6th and it was perfect, there were so many jumps and trails to hit. This place is perfect for quads and dirtbikes",
   "Great place to ride atv, dirt bikes and even side by sides!!",
   "has good size parking that is before the riding trails. the trails are good size with jumps and mud pits when it has rained. some paths are wider than others but has multiple track paths  to ride on that are located in the woods. this is the coolest atv park we have seen."
  ]
 },
 {
  "name": "Betty Phillips Park",
  "address": "3303 SE Irvingham St, Topeka, KS 66605, USA",
  "avg_visitor_review": 3.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b35c82c0-9334-11ea-a5f6-14b31f159f22.png",
  "tags": [
   "walking",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=11154817331719859476",
  "source": "GoogleMaps",
  "reviews": [
   "Very large, plenty of room for everyone, quiet and peaceful.",
   "The park had broken glass on the play ground bolts sticking out the picknick table as area and opened water cover in the grass by freemont and irvingham besides these few things and they mowed over the pop cans and left sharp metal pieces in grass buttt the park is fun to play in",
   "Okay park needs better up keep tho.",
   "Great playground and a nice walking trail",
   "I live across the street.  I love to see the kids play on the equipment and on the court.  Usually clean,  use to be a high crime area but police presence is frequent and things are changing for the better.  Great for walking, dogs should be on a leash. I would like for there to be better lighting and restrooms."
  ]
 },
 {
  "name": "KU Natural History Museum--Dyche Hall",
  "address": "1345 Jayhawk Blvd, Lawrence, KS 66045, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b3a99180-9334-11ea-877c-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=15554928653508523222",
  "source": "GoogleMaps",
  "reviews": [
   "This museum has SOMETHING FOR EVERYONE! I thoroughly enjoyed the reptile and bug exhibits, as well as the dinosaur exhibit and large array of taxidermy.",
   "It's a fun visit, but mostly the same exhibits with few updates. Suggested contribution was $7, but since it's a college campus, I don't know what the money supports. The taxidermy is falling apart, and the mural behind them is faded. Love the fossils in the basement.",
   "Love it here! I remember coming as a child and it's still excite me",
   "Great collection,  extremely clean, friendly staff!   Much more rare pieces than you'd expect from such a nondescript museum on a college campus.   My fiance and I had a great time and my four year old daughter was engaged and fascinated for our whole 3 hours through the museum!",
   "Awesome museum"
  ]
 },
 {
  "name": "Spencer Museum of Art",
  "address": "1301 Mississippi St, Lawrence, KS 66045, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b3ededb4-9334-11ea-a453-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "art",
   "free",
   "knowledgeable",
   "free",
   "art"
  ],
  "link": "https://maps.google.com/?cid=5962806199320686686",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent Art Museum with wonderful art!! A great variety ranging from old canvas paintings to more modern forms of visual art👌 I highly recommend checking out Spencer to anyone that appreciates art. Llet me not forget the delightful staff! Thank you for the experience!",
   "Amazing art museum! Some of the best curated exhibits I've seen in terms of getting you to think deeply about what you're looking at, the context in which you're looking at it, how it relates to other objects, etc. Just really top notch. Made for a very memorable date night.",
   "A great art museum! Very educational - this Art Museum understands that's art should be experienced, but also put in perspective for those who don't I know much about it. There temporary exhibits are always very interesting. Always a stop when I'm in the Lawrence area.",
   "Excellent museum with a wide variety of exhibits to suit any taste. Parking right across the street and very inexpensive. Museum is free and open to the public.",
   "For a university museum, and the fact that the main gallery is free to visit, this is a must see. The staff was knowledgeable and friendly, and parking was free. I was surprised by the broad spectrum of art here. Plenty of contemporary pieces, various American pastoral works, 18th century European portraits, and a hodge-podge of Buddhist/Asian religious statues. Too must to list. It's not an extensive collection, but certainly a surprise."
  ]
 },
 {
  "name": "The Lessman Farm & Truckhenge",
  "address": "4124 NE Brier Rd, Topeka, KS 66616, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b4383d30-9334-11ea-96dc-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "art"
  ],
  "link": "https://maps.google.com/?cid=17370694393552427934",
  "source": "GoogleMaps",
  "reviews": [
   "The owner took us around and gave us a tour that lasted over an hour. Both him and his wife were very gracious and full of information. They do not charge but take donations. We were really glad we stopped here. It was interesting.",
   "Just so happened to stop by on the best weekend of the year and was able to meet Mr. And Mrs. Lessman and their son. They were so gracious to have the land wide open for us to explore. It is so much more than truckhenge. There is also boathenge, knarlwood people, bottle walls, fairy gardens, lost soles forest, and a quarry with beach views.",
   "A cool spot. Had to follow the signs to get in the right spot. Wasn't really sure that it was okay for me to be there, so I pulled up and hollered. The owner cam out and gave me his spiel, then directions to the henge. Drove around the area and found the boat and truckhenge, which were really cool. \n\nHonestly, it's probably a 4 star due to how chaotic the area is, but you should see it before it's gone. Time doesn't stop for anyone.",
   "Its a little piece of heaven on this earth. U can go n clear ur mind there",
   "Wow. Not sure how to describe this place. The artist and owner, Ron, is just as interesting as his art and property. If you stop by, make sure to get a tour from Ron. There's more to see than just the trucks and Ron can tell you all about it!"
  ]
 },
 {
  "name": "Topeka Performing Arts Center",
  "address": "214 SE 8th Ave, Topeka, KS 66603, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b48e25a8-9334-11ea-a04f-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=8828729943866090311",
  "source": "GoogleMaps",
  "reviews": [
   "It's a really nice venue for a concert. The facility is clean and well maintained. The seats are nice comfortable padded seats and there isn't a bad seat in the house. The acoustics are pretty good as well. \n\nThe only draw back I. could see was the concession stands could be updated to serve customers faster. \n\nI would definitely would definitely go see another concert at the Topeka Performing Arts Center.",
   "Very retro! We had seats that had said we may have some limited viewing or objects in the way of stage or something to that effect. Anyway, when we arrived, the ushers found us and others better seating, so our seats ended up being great! The ushers were all very kind and helpful. The whole experience was great! Really loved the venue, being an older, real retro locale!",
   "Chocolate Nutcracker was absolutely fantablous!!! I was really entertained.. Put together very well... Very nice people... Love the Chocolates After show!!   Mr. Steve awesome sauce.. Great show awesome job!!!! The only problem I had was it was freezing cold in the building. I watch with my scarf, gloves and coat on entire show.. Clean and nice place.",
   "Enjoyed the show. But I felt theat more could have been done as far as signage and comfort goes. There weren't many signs to help navigate easily to where I needed to be. So I had to wait through two lines. When I only needed one. Other than that my only other complaint was the seats We rent comfortable. I kept having to adjust around to try to get comfortable. Concessions could have some more variety. I found the selection to be lacking.",
   "Saw Kansas last night! Beautiful venue and the staff was top notch! I’m looking forward to coming back for another show!"
  ]
 },
 {
  "name": "Black Jack Battlefield",
  "address": "163 E 2000 Rd, Wellsville, KS 66092, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b4d9d4de-9334-11ea-bbb1-14b31f159f22.png",
  "tags": [
   "family",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7735991690424763276",
  "source": "GoogleMaps",
  "reviews": [
   "Open air complex. Was just looking for something to do for an hour, fit the bill. Easy access",
   "Wonderful place to adventure with family",
   "Love haveing picnic here",
   "Love blackjack keeping the history  going on for future generations",
   "Beautiful trails and with lots of history"
  ]
 },
 {
  "name": "Brown v. Board of Education National Historic Site",
  "address": "1515 SE Monroe St, Topeka, KS 66612, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b53046b4-9334-11ea-bb93-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "history",
   "walking",
   "learn",
   "kids",
   "free",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=2182417640118676038",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely fantastic place. So much history and to even walk down these famous halls. Especially being an educator, I put on my teacher lens and thought about all of the children. We spoke to an amazing park ranger named Dexter who met some of these famous individuals in the pictures. Be sure to ask for him. Wonderful place.",
   "I know this is a smaller park so I wasn't expecting much, but I was blown away! The school building itself is beautiful and well restored, the kindergarten classroom is really cool to see how things were when the room was in use, the exhibit rooms were amazing! I teared up walking through and reading some of the information. The exhibits go through the history of segregation, which is horrible, but very interesting to see. The ranger was very kind and accommodating and you could tell she really cared about the site and the information there. This is a fantastic place to visit if you are in the area, and if you aren't in the area it is with going out of your way to visit! Even my small children were interested. The kindergarten room, in addition to being informative, has blocked and other toys that the students would have used that children visiting can play with. The gift shop has lots of interesting books about segregation, Jim Crow, and Brown v. Board.",
   "A good place to pay your respects -- to the never-ending quest for equality for all -- if you're in the neighborhood. The pivotal Brown v. Board of Ed case began here in 1951 at Monroe School, where black students were sent in Topeka’s segregated school system. Monroe, built in 1926, is well cared-for by the National Park Service, with several sober displays in former classrooms, and the auditorium. It’s conventional stuff, but it never hurts to be reminded of how our society got where it is. The staff was friendly and attentive.",
   "March 2020. The museum provides a very clear historical perspective and judiciary timeline without too much technicality. Must see. Loved it.",
   "Learn everything about the historic Brown Vs Board of Education court decision. The place is stroller and toddler friendly. There is a kindergarten room with small desks and toys for kids to play with. You can see most of everything in an hour or less. \nAdmission is free. There is a gift shop."
  ]
 },
 {
  "name": "Holcom Park Recreation Center",
  "address": "2700 W 27th St, Lawrence, KS 66047, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b5749f68-9334-11ea-9ad1-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "kids",
   "structure"
  ],
  "link": "https://maps.google.com/?cid=4423326881962668679",
  "source": "GoogleMaps",
  "reviews": [
   "Man you can enjoy sports,  feel comfortable, and even take a shower if your in a bind.  Clean and a friendly staff.  Great place all around.",
   "Great place for kids to play. Love the climbing tree!",
   "Awesome community resource. Plenty to do inside (bball, racket ball, pool, equipment) be outside (volleyball, bball, bocce ball). We always sign our son up for kids day out when school is out and it's offered.",
   "A fun park! They have a brand new play structure, swings for big and little kids, baseball fields and tennis courts, a covered picnic area with tables, and a recreation center. It is clean and located nicely in a neighborhood.",
   "Love location. Great swings and child playground. Decent BB fields. Original indoor facility not maximized or updated well."
  ]
 },
 {
  "name": "Hobbs Park",
  "address": "702 E 11th St, Lawrence, KS 66044, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b5c816f8-9334-11ea-bea8-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=12608502877315360450",
  "source": "GoogleMaps",
  "reviews": [
   "Not a bad place to just sit and relax for little while",
   "Nice shrooms here",
   "Great park, one of our favorites.  It has a picnic shelter area and bathrooms.  The swings seem too tall but that can be good for teens or adults.  Has a bar on the equipment that adults seem to use for pull ups.",
   "Nice neighborhood park. Wacky,unstoppable Kickball crews,gotra love 'em.",
   "Great history"
  ]
 },
 {
  "name": "Forest Park",
  "address": "400 N Locust St, Ottawa, KS 66067, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b615e912-9334-11ea-9086-14b31f159f22.png",
  "tags": [
   "walk",
   "field",
   "history",
   "walking",
   "parks",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3449723259870376427",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place! I've been coming to this beautiful park for well over 50 years, and still after all these many years every time I come I find something so beautiful I just want to share it with everyone. Yesterday was no different. From the mighty Oaks to Redwood's, trees of all shapes and sizes and in all different phases of their life span it's all so much beauty to behold! \n\nThe Forrest Park has quite a bit of history too, and from it's creation to now it has been well maintained and kept up in excellence by people who love the beauty it has to offer. And over the past few years they've even added more play equipment for children and a dog park for our furry friends too! So Forrest Park has something for everyone! A great pool, plenty of shelter to picnic in, a Frisbee course, Horse shoe court, baseball field and a paved walking path (have to share with vehicles) and so much beautiful grass to walk in, and lots of beautiful birds as well! check it out for yourself, I think you'll love it as much as I do!",
   "The best park in town. They do a lot of neat events here and the park is good sized. I took one star off because the city pool is here and they always close 1 month early every summer and also close at 6 PM so while the pool is there for residents to enjoy most who work don't get much chance to. I took another 2 stars off because ever since they put in the fenced in off leash area for dogs some people have become confused and let their dogs run around illegally off leash in the rest of the park. This is a huge safety concern as there are often a lot of families with small children about. Every dog is nice and safe until it isn't. Park needs better reinforcement of the dogs and also the motorists who speed. Otherwise the park is great. Love the horse shoe club too.",
   "So much fun for the grandbabies and myself. Lots of updated play equipment! We love this park!",
   "One of the best parks I've been in, each year they improve on something. They even have a Breast feeding and changing tent. I've never seen one in any other park. Great job Ottawa KS.",
   "Such a beautiful and peaceful park. So clean. Once walking trails as well"
  ]
 },
 {
  "name": "Broken Arrow Park",
  "address": "2800 Louisiana St, Lawrence, KS 66046, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b65aba4a-9334-11ea-8688-14b31f159f22.png",
  "tags": [
   "family",
   "parks",
   "field"
  ],
  "link": "https://maps.google.com/?cid=12926262185109566674",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for family. Also you can reserve the North end of the park for events at the Lawrence parks n rec",
   "Spacious, close to schools and accessible to neighboring homes. Softball field, playground and pavilion with electricity for cookouts. I use it a lot to train my pup. And the Grandchildren love the playground.",
   "Brings back wonderful memories. Hasnt changed much over the decades. I'm not sure that it should.",
   "I like this park because it has a lot of open area, good for dogs and other animals. The park is kept in decent shape with all the landscaping and all that, but I believe that the park playgrounds need to be updated.",
   "Loved seeing all the geese......."
  ]
 },
 {
  "name": "Deanna Rose Children's Farmstead",
  "address": "13800 Switzer Rd, Overland Park, KS 66221, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b6bcb1de-9334-11ea-8793-14b31f159f22.png",
  "tags": [
   "free",
   "free",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7835830010939554497",
  "source": "GoogleMaps",
  "reviews": [
   "The Christmas Light Display was pretty amazing, the viewing is quite a great idea, just pull up, turn off your headlights, and tune in. It's on 5-11pm, so plenty of opportunity to go, and there are quite a few great song selections going with the lights, even star wars, commemorating the final chapter coming out! (The show is in rotation the whole time) And free! I only went for the light show, so I'm afraid I can't comment on the whole place, but judging by this experience, I'd say it's a great place for families to have good, low-key fun.",
   "I stopped by this cute store on my way back from Texas. There were so many items to choose from I wished I could have taken them all. I did happily leave with four items that made wonderful Christmas and everyone wanted to know where they came from!",
   "Not quite a zoo, not quite a amusement park! That's what makes it so perfect, you can get through this place with nearly any time budget you have. People are friendly, it's not over priced and they keep the place neat and tidy. If you ever have a chance to stop by the Overland Park area during the Christmas holidays, you have to do by and see the light show, fantastic!",
   "This place holds so many memories for me and pretty much everyone I know. This is like THE place to go if you have children or just as a date idea it is most definitely the move. It is quite inexpensive to go to, during the week I believe it is free on certain days and on weekends its like $3 a person. Honestly, you do get your bang for your buck and it's a great way to pass a day. Would recommend!",
   "I have been here many times and will go again. It is a very fun place. Very family friendly. Great for  young kids, but fun for all ages. The light display is amazing. I will go again next year."
  ]
 },
 {
  "name": "Overland Park Arboretum & Botanical Gardens",
  "address": "8909 W 179th St, Bucyrus, KS 66013, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b6f7fadc-9334-11ea-b7f0-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "music",
   "kids",
   "free",
   "walk",
   "walk",
   "drink",
   "free",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=8713039177416778041",
  "source": "GoogleMaps",
  "reviews": [
   "I have been going to the Arboretum since I was in high school. (I am 42 years old now) We went way back in the day, before it was all that it is now. No paved trails. Just the wood chipped trails, leading through the woods. It was just as tranquil and peaceful then as is it now. To see it now, you wouldn't even know it's the same place. It has definitely expanded and so many different little attractions, which have just added to it beauty and serenity. I love going here, to just walk, listen to music, be surrounded by nature in all of it's glory. It's the best way for me to clear my mind and make sense of the chaos in the world. It is truly so good for my soul. When I leave, I always feel refreshed and more focused with a clearer mind. I can't LOVE this place enough!",
   "Love this hidden gem! The Arboretum team obviously take pride and great care in their work.  The gardens and fountains are lovely especially in June...the Monet Garden is breathtaking...if you have kids, call ahead to see if the trains are running in the Train Garden! There are 4 miles of mulched hiking trails and peaceful, paved pathways throughout the gardens...a lovely cafe with yummy snacks and a gift shop where you can find an array of amazing and unusual gift items. The Arboretum has special events throughout the year that has become annual traditions for many!  As an added bonus, Tuesdays are free!",
   "Annually go for the luminary walk and it has been a fun and enjoyable experience each time. Walk through and see the gnome houses that are different each year then stroll the luminary area, other lights, trains, hay ride, and the beautiful reflections of decorated trees off the lake. Plus being out of main part of metro can see beautiful stars is the sky. Love going. Takes about 2 hours to leisurely walk through while also taking photos. Dress warm depending weather and while majority is a paved path could be small areas (not counting parking area) that depending might be muddy so consider that when choosing footwear when you visit.",
   "Came here for the first time yesterday for their annual luminary walk and I enjoyed it so much. Seeing the lights, gnome houses and hearing the water was so relaxing. They have areas where you can warm up if you happen to be out there on a chilly night like we did. The only thing I’d recommend is for you to wear your most comfortable shoes, bring something hot to drink (they do provide that as well), gloves and/or hand warmers.",
   "One of our favorite places. Free on Tuesdays!! Paths are always clean. Train exhibit is one of our favorites and the nature park is great to climb on!"
  ]
 },
 {
  "name": "Baker University Wetlands",
  "address": "1365 N 1250 Rd, Lawrence, KS 66046, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b74e3188-9334-11ea-a291-14b31f159f22.png",
  "tags": [
   "nature",
   "kids",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=15012196323507029519",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to enjoy nature.",
   "A lot of trails and lots of birds to watch and enjoy. A wonderful place to take your kids to explore and have a picnic.",
   "Lots of easily walkable, bikeable, joggable trails.",
   "The best place in Lawrence for nature lovers.",
   ""
  ]
 },
 {
  "name": "Great Wolf Lodge Water Park | Kansas City",
  "address": "10401 Cabela Dr, Kansas City, KS 66111, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b79cc6ee-9334-11ea-8c71-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "food",
   "family",
   "family",
   "drink",
   "food",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13993024686544160853",
  "source": "GoogleMaps",
  "reviews": [
   "Staff was overly friendly. Rooms were very clean. So many activities for young children. Little bit over priced (if you go on the weekends) but we went in winter so couldn’t use the outdoor water park. They always have discounts online, we paid $100 for a family of 4 including a night in the hotel, 2 day water passes. Kids had an amazing time, you can also bring in your coolers to your hotel\nRoom which was very convenient. Seen a guy check into his hotel room at 11am instead of 4pm. So if your room is ready early you can get checked in early (which is super cool) unless you go on a weekend then except to be able to check in around 4pm. Will be going back for my sons 2nd birthday party. Kids 2 and under are free & I didn’t know, I paid for 2 kids and was able to get my nephew in without paying for his wrist band because I already included 2 kids when booking online (my son was a year and a half) so I ended up paying for him when he was to get in free. Didn’t get to try their food, brought our own food in. Over all great experience! I never write reviews and I probably won’t ever again but thank you great Wolf Lodge for the amazing experience ☺️",
   "I usually don't write a review unless it's a great experience.  But, let me say this place is wonderful and the people that work here is AMAZING, very helpful and ALWAYS had a smile on their face. We had an awesome  breakfast server named Jordan and he went above and beyond for us, made sure we were taken care of. Needless to say, I will DEFINITELY recommend this place.  Thank you for making this a wonderful experience for my family. But, most of all thank you for making my daughter feel special on her birthday!",
   "We were just getting a drink at the food area and their was a gentleman there. We thought he was customer and told he to go ahead. He happen to be the GM. We had a wonderful conversation with him (Alex). It made our stay that much better. We have been to three Great wolf lodges (Texas, Minnesota and Kansas) and Kansas City is probably our favorite at the moment. You don’t have to carry you tubes up the stair that is huge!!!!! The staff minus one have been wonderful and everyone had a bad day here and there. It has been great!!!",
   "Kids love it. Water park was great. We went midweek so not crowded. Be prepared to spend way more money than hotel rate. And driving Interstate 70 from st Louis was a nighmare both ways in January.  Missouri does not salt much and often shuts down due to accidents.",
   "We had a great time! Kids ages 12 down to 4 loved the water park. Room was good. The lifeguards are very well trained and aggressively scanning every bit of the water. There are two hot tubs to enjoy- the milder one that kids can play in also and the 18+ only one which was hot and quiet. The adult tub is somewhat secluded which is very nice for relaxing but does not allow for overwatch. One thing to keep in mind is that it is hard to see all of the park so plan ahead and setup meeting points with your kids so they know where to go if they panic and can't find you. We stayed two nights and by the end of the full day in the park my 12 year old was getting bored so I think 3 nights would have been too long.  It looks like there might be more to do with mini golf and an outdoor pool that open in warmer weather. \nOverall a great experience!"
  ]
 },
 {
  "name": "David Traylor Zoo of Emporia",
  "address": "75 Soden Road, Emporia, KS 66801, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b7f08c52-9334-11ea-b125-14b31f159f22.png",
  "tags": [
   "free",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10836446474662265169",
  "source": "GoogleMaps",
  "reviews": [
   "It's a beautiful zoo. Several animals and beautiful plants. It's a small zoo but it's free and def worth it",
   "Been there many times before but it was really beautiful today. The plants and flowers were my favorite part. Took grandchildren and niece. They had a lot of fun. The bathrooms were extremely clean. I was impressed with that. Very beautiful place.",
   "Really nice Zoo for a small town.  Worth a look and great for the whole family! Get the camera/phone out for some great pics and selfies!!",
   "Was expecting a few animals and birds but saw so many. The kids loved it...",
   "Nice little zoo. Perfect for a pit stop while traveling."
  ]
 },
 {
  "name": "National Agricultural Center",
  "address": "630 N 126th St, Bonner Springs, KS 66012, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b8392e58-9334-11ea-b8bc-14b31f159f22.png",
  "tags": [
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=8767758034841053647",
  "source": "GoogleMaps",
  "reviews": [
   "This place is amazing. It's quaint, and very family friendly. The staff was very interested in making our trip there wonderful. We even got to take a mini train ride! I would recommend this to anyone looking to get out of the city and have some real family fun!",
   "Ag hall demo gardens n composting was great. I saw in person what their versions of how to compost were and some live examples of different types of grasses.",
   "Just had a blast it a really great time. Great weather and people who were there were really nice. Love all the old cars but mine is the best.",
   "This was a wonderful Museum but if you're not into walking I don't I would recommend getting good shoes there's a lot to see and there's lots of walking around check it out definitely even though it's a little out-of-the-way still Crossing museum to visit.",
   "This museum is a national treasure that is fairly unknown. Anyone interested in Old agricultural equipment or techniques should come here"
  ]
 },
 {
  "name": "Amelia Earhart Birthplace",
  "address": "223 N Terrace St, Atchison, KS 66002, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b8907642-9334-11ea-8472-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "historic",
   "tour",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=18024782318615670443",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing exhibit and so fun to see all the historic collections about her life and adventures. Easy self guided tour. Staff was very knowledgeable about the history of the house.",
   "Great historical events in our backyard. A woman who was a pioneer for all women.",
   "What a fun adventure we had learning about Amelia Earhart and touring her birthplace. We had a wonderful time and we will make the trip out again. Make sure to back a snack or lunch, there is a beautiful bluff that over looks the river.",
   "Beautiful place with a fantastic view over the river. I came to early in the morning so the house was closed unfortunately",
   "Beautiful! Thoroughly enjoyed exploring the exterior of Amelia’s birthplace. What a view they had! The entire block is a piece of history. I was happy to have stopped while on a road trip. Unfortunately they were not open when I arrived, but if I enjoyed the outside as much as I did, you’re  bound to enjoy the inside."
  ]
 },
 {
  "name": "Tallgrass Prairie National Preserve",
  "address": "2480B KS-177, Strong City, KS 66869, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b8f579fe-9334-11ea-b5f8-14b31f159f22.png",
  "tags": [
   "hike",
   "nature",
   "nature",
   "knowledgeable",
   "hike",
   "tour",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3500099624561380489",
  "source": "GoogleMaps",
  "reviews": [
   "This may be one of the last places to experience our Nation's great grassland. It was a very surreal experience to get away from the highway and be surrounded by nothing but nature. Grass, buffalo, a few trees, and you. The silence was deafening. Your voice left your body and was immediately swallowed up by nature. Eerie, beautiful, and totally like nothing else. The buffalo roam the park at will (fences keep them from leaving). They're huge and can be dangerous, and the park personnel (and signs) warn you of this. Be ready to hike on gravel roads. In 20 minutes you'll find out what this part of the country used to look like. The personnel are friendly and helpful. The displays are informative and present more info than you expect from a place like this.",
   "Fantastic place. Take the trail and you will see the bisons if you are lucky. Beautiful animals and the landscape is awesome. Very helpful ranger, Eric Patterson, at the visitor center. This is my favorite place in Kansas so far. A must see if you like nature and animals",
   "Went in mid October for a visit which is probably not the best time of the year as we are moving to fall but very enjoyable.  The visitor center was excellent and the park ranger working there was very knowledgeable and friendly.   We skipped the bison and farm house and went on the fox creek trail along with our dog.   We all had a good time and this six mile hike gave lots of views of different parts of the prairie. Made you really think back to when all the Midwest was prairie.  Definitely worth a visit",
   "Such a wonderful place to visit, I recommend to take the bus tour, that's a good way to see the majority of the park, it's almost of an hour tour inside and more chance to see the buffalos.\nThe house tours also very nice, and have a nice picnic area outside.\nIt's recommended to go visit in a few seasons just see the difference between the low grass in the grass",
   "My visit was for a passion of photographing night scenes around the Midwest and I had been here before I believe, but during the day. The preserve is easy to find and fully accessable. Some areas tend to close gates and assume nobody has interests after hours but this one seems open. Parking was apparent and I saw other facilities that would make this a great place to bring a family"
  ]
 },
 {
  "name": "Donaldson's Jewelers - Home of Dave Horn Jewelry Repair & Design",
  "address": "902 N Kansas Ave, Topeka, KS 66608, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b946a89c-9334-11ea-89f5-14b31f159f22.png",
  "tags": [
   "approachable",
   "unique",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=5525718762592442228",
  "source": "GoogleMaps",
  "reviews": [
   "I have worked with Dave multiple times and have included only a few pictures of the work he has done for me. Dave has a passion for his work as a jeweler. I feel an easy trust with him caring for my precious jewelry because of his welcoming demeanor as well as the jewelry related knowledge and experience he emanates.  Most importantly, Dave's attention to absolute detail is phenomenal and incredibly important when working with finite sizes. Whether my jewelry is important to me due to its monetary value, sentimental value or a combination of the two, Dave is able to listen to what I want and create beautiful pieces I will treasure for a lifetime.",
   "This shop carries beautiful jewelry as well as rare stones and designer knives.  The owners are friendly and the shop has a good vibe. Be sure to check out the cool guitar collection on the back wall.",
   "Dave is amazing! He's very honest and approachable. We've been in the store multiple times and he's always willing to talk or explain things. There's a no pressure approach and it's always very welcoming. They also do repairs and custom pieces. I definitely recommend stopping in to look around or even just to say Hi.",
   "Love Dave's work!  Stop by and see what he has or to talk about a custom order!  You won't be disappointed!",
   "Dave has a warm, welcoming, contagious smile and positive attitude for all his customers and potential customers.  He is knowledgeable and eager to sell you exactly that special piece of jewelry you're looking for.  I brought a ring design idea in to him and he created an amazingly beautiful, quality ring that I will be proud to wear the rest of my life.  His store has a comfortable atmosphere and showcases unique and gorgeous items.  Check it out!"
  ]
 },
 {
  "name": "Wonderscope Children's Museum of Kansas City",
  "address": "5700 King St, Shawnee, KS 66203, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b98c8a58-9334-11ea-8fbb-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "eat",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6568020706734645777",
  "source": "GoogleMaps",
  "reviews": [
   "My kids loved this. There are so many things to do here! We couldnt even get it all done in one day\n Great way to spend a day with your littles and for a great price!",
   "My daughter had a lot of fun here. We stayed here for several hours, trying everything out multiple times. The grocery store and veterinarian were the most fun, probably because they're a little different from anything else we've ever played.",
   "Great place for kids, especially on a cold rainy day. Best suited for kids older than 1 year, as only 1 room was really suitable for my son. Provides many learning opportunities that don't involve technology. There is even a place where you can eat, if you bring a lunch. Price is very reasonable.",
   "Went here today and it was an okay place. The facility is pretty run down, its in a old school house, which was odd at first. The rooms were okay. The water room had a tub with bath toys in it and that was it. The grocery store and ball room was done good though. This is almost and one and done place.",
   "This was our first time visiting Wonderscope and our kids had a great time. There is something for kids of all ages here. My kids really liked the grocery store and water rooms. Great indoor place to go to during the winter."
  ]
 },
 {
  "name": "K-State Insect Zoo",
  "address": "1500 Denison Ave, Manhattan, KS 66506, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b9d6b2e2-9334-11ea-a340-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16884099872084421221",
  "source": "GoogleMaps",
  "reviews": [
   "Nice place to visit. The insects are well maintained. The staff are nice. It takes about an hours to see it all. There are plenty of things to keep all ages interested.",
   "A great place for children and parents alike",
   "Amazing and thrilling! You can even buy baby tarantulas there! A must see!",
   "Most of these creatures are alive",
   "If you like science or insects, this place is fun. It makes a great additional visit when you are already in town for the Sunset Zoo. The staff is knowledgeable and polite. There are lots of interesting exhibits and things for kids to interact with. And around the building is KState's beautiful gardens."
  ]
 },
 {
  "name": "Sunset Zoo",
  "address": "2333 Oak St, Manhattan, KS 66502, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ba31082c-9334-11ea-949e-14b31f159f22.png",
  "tags": [
   "family",
   "affordable",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=13575912168964239494",
  "source": "GoogleMaps",
  "reviews": [
   "This is a smaller zoo located in Manhattan, Kansas. Although there were several exhibits that were not open, it still was a fun three hours. And when you factor in how inexpensive it is at $5.00 (per adult), the Sunset Zoo is an excellent value - could even be described as a hidden gem.",
   "The Sunset zoo while not very big was a fun little find in the area. The zoo was clean, the animals seemed well taken care of and the staff was friendly. We made it through the whole zoo in a little over an hour however, it is priced very well and was enjoyable!! I would recommend any animal lover stop by and check it out. Good family fun!!",
   "Wonderful! I love this zoo. It is small enough that you won't get tired out before you finish but boasts a variety of animals that are well looked after. Staff is always nice and it's affordable. Great for families, there's a playground and they have a bunch of great volunteer and childcare programs, and they do birthday parties. Very very good zoo couldn't be more pleased",
   "Nice little zoo with a lot of shade. The price is affordable and the group rates are well priced.",
   "I have always loved this zoo. And even though I have not been back in years, I always have admired the hard work of the owners and staff to make it a wonderful experience for everyone. Some of my favorite memories of growing up come from going to this zoo with my parents, loved the peacocks 😍 but fell in love with all of the animals."
  ]
 },
 {
  "name": "Flint Hills Discovery Center",
  "address": "315 S 3rd St, Manhattan, KS 66502, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ba7b0aba-9334-11ea-8d31-14b31f159f22.png",
  "tags": [
   "learn",
   "kids",
   "family",
   "walk",
   "kids",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17738792245764338528",
  "source": "GoogleMaps",
  "reviews": [
   "I've been here just to visit and I've been here for a wedding as well, it's a great place. For a smaller town, Manhattan's choice to put in a Discovery center was a great one. The best thing about the Discovery center is that they are constantly changing what is being displayed, so every time that you come you learn something new!",
   "This was a fantastic experience for the entire family. The scavenger hunt for my 4 year old helped to keep her focused and interested on the main level exhibit. We watched the Flint Hills film. It was educational and we enjoyed the 4D effects. Upstairs, there are many play areas for little ones to enjoy. The limitless options for hands-on fun for the kids is well worth the visit. All of the staff was friendly and willing to answer any questions we had. My only complaint was the single-ply toilet paper in the restrooms. We did appreciate the foot stools for the kids though.",
   "My friend had a wedding reception here after Christmas! The decor was still up and looked great! This is a truly stunning venue.",
   "We visited the center expecting the typical kids education center experience. What suprised us most was the condition of the displays. Nearly every one of them was in good condition with only one needing some repair. We also enjoyed the amount of information and the way it was presented. They have plenty of facts designed to stand out to the children while still providing much more information for the adults to read as they walk through. At the time we visited, they had a travelling exhibit called \"Rainforest Adventure\". The kids in the exhibit were definitely on their best behavior but in spite of that, it was still in good condition and very informative. Having the information in the form of a maze was very interesting. Outside of the information and the exhibits, the staff was very helpful without coming across as overbearing or \"stuffy\". It appears that the facility was either recently built or recently remodeled. In either case, it was very clean and comfortable to visit. If we happen to be in the area we will keep this in mind as a good place to spend some time and gather additional information on the Flint Hills.",
   "Absolutely amazing! The kids area in the second floor was so perfect for our 2.5 year old :D The main exhibits were very educational and relatable since they were all about local science and history. The gardens on the rooftop were icing on the cake :)"
  ]
 },
 {
  "name": "Heartland Motorsports Park",
  "address": "7530 SW Topeka Blvd, Topeka, KS 66619, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bac83f74-9334-11ea-bcf9-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=13771410932641916797",
  "source": "GoogleMaps",
  "reviews": [
   "Came here for the NHRA races.  Good facility and would love to come back if I'm ever in the area!",
   "Love attending the NHRA Drag races here every year! Best day of summer!",
   "The people who work all the things going on out at Heartland Park are one of a kind and are always so fun to be around.",
   "Fantastic facility. Great road course racing surface. Always enjoy my time here.",
   "Great motorsports park just need to fix the roads. Always enjoy coming here. Except when we came for country stampede and had to sit outside the gate for hours while it was raining."
  ]
 },
 {
  "name": "TimberRidge Adventure Center",
  "address": "12300 S Homestead Ln, Olathe, KS 66061, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bb107e0c-9334-11ea-b5dd-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=1399474011157714835",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic venue! Didn't even know it existed. We were told it is only available to groups. Had a company picnic here. Tthe shelter and restrooms were immaculate. Close to a pond with canoes, kayaks and pedal boats. Great trails for biking, running or walking. Highly recommended and will be suggesting the location to others.",
   "I love this place!!",
   "This was a great experience for the sixth graders, glad I got to hang out with them! It is a beautiful area.",
   "Very nice park , nice facilities. Clean restrooms",
   "This place is amazing! It will realy bring out the true leader in you. I want to thank Matt for helping me become a better leader. I highly recomend this place. AND MATT HE IS AN AMAZING PERSON AND IS EXTREMELY PROFESSIONAL AD DESERVES A RAISE!"
  ]
 },
 {
  "name": "Milford Nature Center",
  "address": "3415 Hatchery Dr, Junction City, KS 66441, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bb666678-9334-11ea-9083-14b31f159f22.png",
  "tags": [
   "family",
   "learn",
   "kids",
   "free",
   "walking",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=10450326462723310794",
  "source": "GoogleMaps",
  "reviews": [
   "We have brought our children and family here for years.  Great way to spend your afternoon.  I highly recommend this beautiful place",
   "There is a fish hatchery, a walking trail, a playground, an indoor center with displays, a few animals, and some dioramas. It is free and fun and educational. Every time I go, I feel like SuperMom, because the kids have fun and they learn and the get excersize from playing and walking.",
   "Today was Eagle Day and man was it amazing!! Up close and lots of information.",
   "Really enjoyed the nature center like I did when visiting 14 years ago.  However, the staff didn't seem very sociable or friendly.  They all seemed to be hiding in their offices.  There were a couple of ladies working at the hatchery & feeding animals but even they didn't talk much.  Guess it's hard to find good help these days.",
   "Great place lots of good things to see. 5 star"
  ]
 },
 {
  "name": "Rowhouse Restaurant",
  "address": "515 SW Van Buren St, Topeka, KS 66603, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bbb59802-9334-11ea-90c4-14b31f159f22.png",
  "tags": [
   "tasting",
   "food",
   "food",
   "food",
   "eat",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=441227545975016472",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I have eaten here on two special occasions and have enjoyed it thoroughly. Especially the fact that they use local/organic and in season food to prepare the dishes. Each time we have ordered the chef's tasting menu and it's fun to see what different flavors they put together. The only glitch that I have noticed, so to speak, is they are a little heavy on the salt (for my taste buds) with a few of their dishes. Other than that the whole experience was positive and we will be choosing the Rowhouse to celebrate future occasions.",
   "It was an interesting place. Not super easy to find. It has charm. The food was interesting. Definitely not average. I didn't leave hungry, but next time I'm ordering something else.",
   "My wife and I went here for a date night as a chance to get dressed up and do something different. We were immediately greeted at the door and taken to a table. The experience was very personal and the house is small enough to feel cozy and comfortable. The food was absolutely amazing. From start to finish every piece was outstanding. Definitely worth the trip.",
   "Rowhouse is great! Not only is it an amazing date night spot but lunch is a great and affordable outing. Also they are amazing people at Rowhouse. They do so much to give back to the community. Like Vegan Fest! All the proceeds went to the Mission. Such a fantastic place! Oh! They also are great at catering to people with food allergies! My sister is allergic to soy, wheat, and mustard and Rowhouse is always willing (with joy) to make her dinner safe for her to eat. I cant say it enought they are amazing at Rowhouse.",
   "Rowhouse has an incredible atmosphere and quite a surprise for downtown Topeka.  The lunch menu was excellent with fresh produce and an amazing tomato soup.  It's in an old row home with multiple levels of dining.  Looking forward to hanging out on the patio when spring comes and enjoying listening to a local band."
  ]
 },
 {
  "name": "Lonnie Q's BBQ",
  "address": "3150 SE 21st St, Topeka, KS 66607, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bc0db866-9334-11ea-95e6-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=12668758308292633166",
  "source": "GoogleMaps",
  "reviews": [
   "Just stopped by to catch a quick bite to eat on our drive back to Omaha and was blown away. Thanks guys for the hospitality and delicious food. Had to catnap in the parking lot I was so full!",
   "Great Food; Great Service! Great Story about the place. Lonnie came to our table and personally told us all about the place. We got the #1 with no bun & all meats. It was an very large place of great food!",
   "Best BBQ in Kansas... I can say that because most KC BBQ is technically in Missouri. The only real downside to Lonnie's is the limited hours open. Even so it is definitely worth it to go for the cheesy potatoes alone. Simple menu, efficient interior design, clean facilities, awesome staff. There is literally nothing to dislike about any Lonnie Q's experience.",
   "Finally made it for dinner on Friday night, tried the turkey in the slaw, which was the last thing on the menu I hadn't sampled. It was amazing, I also had a bit of my dining partners brisket and pork. So good! I haven't had all the BBQ that's to be had in Topeka, but I have a hard time thinking it can get any better in Shawnee County.",
   "Don’t let the line scare you from giving this place a try. TOP 5 BBQ I’VE EVER HAD. Cheesy potatoes are a must! If you step foot in the state of Kansas eat with Lonnie Q."
  ]
 },
 {
  "name": "Tuptim Thai Restaurant",
  "address": "220 SW 29th St, Topeka, KS 66611, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bc52b0cc-9334-11ea-bcf9-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18313887194107613157",
  "source": "GoogleMaps",
  "reviews": [
   "We were driving through Topeka, KS and stopped at this place for lunch on Easter, as it was open. We’ve been to Thailand many times, and the food was extremely authentic. The server was the only one in the restaurant due to the holiday, but she still provided amazing and quick service. Overall a great experience - definitely get their appetizer sampler and their Tom yum soup, and drunken noodles!!",
   "This is one of the few restaurants in Topeka where we can get really good vegan food. The service is exceptional, acknowledging and helping us with ordering vegan foods. \nI had the crispy vegetable rolls. And we both had entrees with loads of veggies and tofu. The price is reasonable and the food tasty and filling. \nIf you are looking for somewhere to eat that has vegan choices and helpful staff in Topeka Tuptim Thai is the place to go.",
   "Delicious food with many options. Great for vegetarians too. Almost any dish can be optioned with tofu.",
   "The service I received at Tuptim Thai was excellent! Since this was my first time here, I ordered the basics: Pad Thai, Tom Kah Guy soup, soft and crispy spring rolls. The crispy spring rolls are out of this world! Honestly, the best I've ever eaten! I wasn't thrilled with the peanut sauce or the sweet and sour sauce for the rolls, however, as they were too thin and were lacking in flavor. The Pad Thai and soup were adequate, but nothing to write home about. I will definitely return to try some of their other dishes.\n\nWent back & had the crispy spring rolls, drunken noodles (mild+) & coconut milk (mild+) soup. All VERY tasty! The crispy spring rolls were too tasty to stop for a picture 😬.",
   "This place is great!! Food is outstanding, and the staff is on point. They're quick to check on you and make sure everything is good. Try the yellow curry, or drunken noodles, you will not be disappointed!!"
  ]
 },
 {
  "name": "The Wheel Barrel",
  "address": "925 N Kansas Ave, Topeka, KS 66608, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bca7d728-9334-11ea-9c99-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "unique",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=1478512566906807039",
  "source": "GoogleMaps",
  "reviews": [
   "This place has phenomenal food and great local beer. Their homemade beer cheese is only $3 and comes with delicious seasoned kettle chips. Totally worth it! I had the classic grilled cheese with Gouda and mozzarella plus guacamole and my side was sweet potato chips. I can’t wait to go back and eat again. Highly recommend!",
   "Drawn in by a google search for local restaurants. Totally and pleasantly surprised!\nAmazing grilled cheeses. Better than mommas. And totally unique.",
   "Wonderful staff. Great variety of sandwiches including a good selection of seasonal sandwiches. Vegetarian options as well. large selection of beers and mixed drinks. The environment  was very warm and cozy. Did not see the patio as it was cold.",
   "First visit was great! Went at lunch time and the service was a little slow but the place was packed, both inside and on the patio. The food was great! Great flavor, interesting combos of cheese, breads, sauces, etc. The tomato bisque soup was delish also! Worth visiting if in Topeka and the NOTO area is neat as well.",
   "Went to the Wheel Barrel on a lark while working in Topeka. Real glad I did. Was with two work colleagues and all of our sandwiches were fire! Will make it a point to go back whenever I'm in Topeka. The hot cider was pleasing and warming on a chilly January day. We shared the Everything Soft Pretzel with Craft Beer Queso which was out of this world. The Not yo Mama's BLT was delicious. Grilled with siracha mayo, crispy bacon and soft brie it was amazing."
  ]
 },
 {
  "name": "Bradley's Corner Cafe",
  "address": "844 N Kansas Ave, Topeka, KS 66608, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bcf38640-9334-11ea-a339-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "music",
   "food",
   "affordable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5728227619119170889",
  "source": "GoogleMaps",
  "reviews": [
   "What a fun corner cafe! Excellent staff were buzzing through the diner this morning when we visited around 10am. It was busy, but there were open tables and we were seated right away.  We got coffee and two huge breakfast for about $20 bucks. The food was great and we ate some of the best biscuits and gravy we’ve ever had! Yum!! We will have to come back to try the pie! It looked delicious as well!!",
   "The food was great and reasonably priced. The service was great. Very friendly waitress.Worth the tip. The food was brought to the table in a timely manner. Nice and quite breakfast with a little country music playing in the background. Relaxing. All around great eating experience.",
   "Good old fashioned diner with affordable menu. Lots of comfort food choices and pies. Our server was helpful and friendly. I will be back for breakfast sometime. This visit it was lunch.",
   "the best cinnamon rolls in Topeka. The quantities of the other breakfast items are huge. The food is always hot and fresh and the servers are very kind and friendly. Love going to Bradley's and will continue to do so.",
   "What a great place. The dining area is small but the wait isn't very long. The food is awesome. They make their own hash browns, buddies, and even pancake mix. Definitely worth a visit."
  ]
 },
 {
  "name": "Monsoon Indian Grill",
  "address": "2040 SW Wanamaker Rd #104, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bd3daf08-9334-11ea-9ade-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1764000304940599343",
  "source": "GoogleMaps",
  "reviews": [
   "Outstanding food—too good to stop eating until you're absolutely stuffed! Excellent service, too! (I'm no photographer, but the lamb biryani was delicious!)",
   "Excellent lunch buffet with a great selection of food. We were greeted by friendly faces. I complimented the lights and the ambience of the restaurant. It was a beautiful place.\n\n One of the hostesses asked if it was our first time. She proceeded to demonstrate a traditional appetizer dish for us. It was very tasty. The service was exceptional. Fresh bread was offered at the table throughout the meal.  It was a great experience.",
   "The place is really clean and never out of any items in their buffet. Ever since i went there the first time, i have never been to any other place whenever i crave some indian delicacy. Being a typical ‘white’ guy, i still don’t find the food too spicy or too strong. Moreover, customer service is excellent and the lady manager there always greets you with a gracious smile and is very helpful. I would highly recommend this place to anyone who want to try something different and don’t want to spend over the top while doing so",
   "Delicious food. Usually Indian restaurants just add cream to get the yummy taste but not this one. Vegetables and spice brings in the authentic flavor.",
   "Delicious Indian food, lots of options and great for vegetarians and omnivores. Buffet is absolutely delicious."
  ]
 },
 {
  "name": "The White Linen",
  "address": "112 SW 6th Ave, Topeka, KS 66603, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bd81e406-9334-11ea-b316-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "unique",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=655254985821265133",
  "source": "GoogleMaps",
  "reviews": [
   "White Linen is a completely unexpected jewel in Topeka, central Capital area.\nJust outstanding gourmet master chef prepared meals. First class quality ingredients, first class delicious meals, excellent classy ambient, professional and friendly folks. \nTake your love one's for dinner, for anniversary, for engagement, for birthdays or come up with any excuse for dinner out to White Linen.\nThe special prices of dinner for two at price one is just incredible deal!!\nI started with Cream of Tomato soup - very tasty, delicious with pieces of crab and a small crab cake and medley of cucumber.\nThe main meal was smoked lamb prime amazing taste, beautifully presented, with out of this world wild mushrooms and perfectly done risotto.\nFor desert, flourless chocolate cake accompanied with French pressed coffee, made it a perfect dinner.\nMy business partner had the porkchop, marvelously done.\nIf anything, I would make the flourless chocolate cake a bit less sweet, more dark chocolatey bitter - use less sugar in the recipe.\nPlease see a few pictures of our meals.",
   "We have been in to dine twice and both experiences were exceptional! Love the location, the atmosphere, the service, the food, the drinks, and the acoustics (so important). \n\nSeriously, the acoustics...this usually keeps me out of restaurants, but this place is truly comfortable and easy on the senses.\n\nAnd the food is excellent! The first visit, I had scallops, on the second, I had the salmon. Both were perfectly cooked! The food was so good the first time around that we didn’t even check the menu ahead of time for the second visit - we just thoroughly trusted them and we were not disappointed.\n\nSwank. Upscale. But unpretentious. I can’t wait until our next visit!",
   "We chose The White Linen Chef's table for our daughter's 14th birthday. Great experience and even better food.",
   "Absolutely the best restaurant I’ve ever been to. This place will forever hold a special place in our heart. They went above and beyond to make our marriage proposal perfect. The food was amazing and the chef was personable, professional, talented and passionate about making amazing food. The drinks are some of the best we’ve ever had. The chefs table was such a unique experience. I have nothing but positive things to say about this place. We did relocate out of Kansas but can’t wait to fly out for a special trip and dinner once again. \nHonestly give this place a try. Reasonable price for the quality of food. If this place was in any other town it would be 5 or 10 times the price.",
   "Food and drinks were amazing. Top notch service. Highly recommend this is a date night destination. We will definitely return."
  ]
 },
 {
  "name": "North Star",
  "address": "1100 NW 25th St, Topeka, KS 66618, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bdc52f50-9334-11ea-83da-14b31f159f22.png",
  "tags": [
   "history",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1399123514120575662",
  "source": "GoogleMaps",
  "reviews": [
   "I don't even know where to start. The atmosphere is amazing. Reminds me of an old speakeasy or a bootleg liquor hideout. The staff is friendly and very well trained. I've eaten here many times and never had a bad meal. Some of the best cuts of steak I've ever had, and always cooked to perfection. The hashbrowns and gravy are a must try.",
   "I have been all around this nation and even the world. This place is classy. Has deep history. The nicest staff and some of the best food I have ever had. I am seriously thinking of bringing my wife and kid here. And they live in Ohio! This is a must come to place if one is in the area. Loved it!",
   "The food was great but our party had a reservation reserved a week in advance and upon arriving they couldnt find our reservation in their system and we ended up having to pull up the email of the reservation confirmation for them to believe us. We ended up having to wait 35 minutes before they decided to pull a few tables together for us to be able to sit down. The waitresses were great considering how busy it was. The restaurant kind of has an older folks type of vibe to me",
   "This place was awesome.  A friend of mine recommended it and I wish I knew about this sooner.  The wait staff was very friendly and attentive.  The food was delicious.  I was very impressed and will definitely be coming here again.",
   "Jeff and his team do an amazing job.  Excellent food and drinks in a great retro atmosphere.  A great Topeka gem!"
  ]
 },
 {
  "name": "LongHorn Steakhouse",
  "address": "1915 SW Wanamaker Rd, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/be0a7552-9334-11ea-b9b9-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "drink",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4695302123723032523",
  "source": "GoogleMaps",
  "reviews": [
   "Me and my wife came here for the first time today and had an amazing experience! From the time we walked in the door the employees and even manager were so polite and helpful. Our waiter Austin was perfect! There when we needed him! And very polite and respectful. \nNow our food, was just amazing! Came out fast and tasted oh so good. I would definitely recommend coming here.",
   "Food was amazing. They have this dip called surf and surf. I could eat that all say. My boys had steak and potatoes and another side. This location was in kansas. We brought the new years in there.",
   "Great steak salad cooked exactly how I wanted it.  See Matt at the bar is knowledgeable and can make you a drink the way you want it.  He made me a tall red beer not too much tomato.  Perfection.  The fillet salad was served with blue cheese really good.  Fast service friendly wait staff even though I came in 40 minutes before close.  The hot rolls are very good would recommend  snagging a few.  I know it is a chain but not all places are equal.   The restrooms are very clean.  Would recommend.",
   "Always a great place to go!! Reasonable prices, clean restaurant & bathrooms and for being a busy evening, we waited only 5 minutes. Food was excellent as were the mixed drinks. We had such a nice waitress (Twila) & she took great care of me and my husband. The evening was great!",
   "Ordered my steak medium rare & got it burnt on the outside, it was hard, crunchy & tough. First time I had been there in 3 years and now I will never go back. A STEAKHOUSE should know how to properly cook a steak. Husbands hamburger was also hard as heck on the outside. Service was great tho!"
  ]
 },
 {
  "name": "The Pennant",
  "address": "915 S Kansas Ave, Topeka, KS 66612, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/be536564-9334-11ea-b05a-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "food",
   "delicious",
   "field",
   "free",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6850471655857612996",
  "source": "GoogleMaps",
  "reviews": [
   "My family and I went to The Pennant for a nice family outing. I found the restaurant excellent as did my wife and son. I had the Boy Blue burger and it was by far the best blue cheese burger I’ve ever had. We never get desert but decided to try the Over The Rainbow shake just because we don’t go out like that very often and not only was it big enough to feed a crowd it also tasted amazing. They have an arcade with select classics and some awesome pinball. The place feels like a mom and pop Dave and Busters but with better food and focus more on nostalgia with the arcade. It’s fun to rediscover some classics with the family. The customer service is what takes this place from great to extraordinary. We went to get the cards to play and the machine was down upstairs so we went downstairs to get them and were informed it’s be 15 min or so before we could get cards for the games. We decided to walk dinner off downtown and walked to our car to put our leftovers away. We got back and instead of buying cards the manager handed each of us a loaded card compliments off management for the inconvenience. I was astonished at how well we were taken care of without expecting it at all. We were still willing to pay and he would t hear of it. Keep up the great work y’all! We  ant really enjoy the games but we will be happy to order take out during this tough time. We will also love to visit once this dilemma has passed.",
   "Where to begin, this place was so fun. The restaurant was delicious, the Mac and cheese bites were very fun to try and tasted delicious. The milkshakes came in so many fun flavors! I got the rainbow one, it had an ice-cream cone with ice-cream inside the milkshake!\n\nThe arcade was a blast too! About 8 pin ball games, ski ball, and a lot of really cool games to try. They had pac-man, track and field, and so many more!  The games are not free, although a game card is absolutely worth the cost. For $20 I got 100 game credits and each game cost roughly around 2-3 credits. \n\nMy one complaint was the bar. There were a lot of loud, shouting people who had been drinking. Although I understand it is a bar.\n\nI would definitely recommend bringing your friends, teens and adults.",
   "Heard a lot of good things about the Pennant Restaurant in downtown Topeka so I wanted to give it a try for lunch.\n\nWent there with my Brother in Law. Sat at the upstairs bar. Will say the bartender had no emotion and didn't look or act like she wanted to be there. My Brother in Law got a beer I got tea. The guy sitting beside me ordered a Bud Light and the bartender brought him a Bud heavy. \n\nI ordered the fish and chips my Brother in Law ordered a strawberry salad with grilled chicken on it. The fish and chips came out with a huge batch of fries that were tasty and 4 small pieces of fish that was plenty. The fish had a decent flavor the fries were good. The strawberry salad was said to be good but the chicken was so dry he couldn't eat it. \n\nAll and all it looks like a cool place with arcade games upstairs. It was somewhat busy for lunch so some people must of got good food there or it was convenient for them to eat there. Probably won't go back.",
   "Really enjoyed this place. First time in and it was kinda crowded for a Tuesday night. Nevertheless we were seated right away. Service was excellent and the food was very tasty. Highly recommend the Thai cauliflower. A spicy delight. I had the Nashville Chicken sandwich and it was deliciously juicy and flavorful. The topping choices for the fries were really fun. Creamy jalepeno was very good. Surprised it took us this long to check this place out. Next time we'll enjoy the arcade.:)",
   "It was an okay experience. The company I was with made it better.\n\nService was slow. Our waitress already had a long day and definitely was not up to taking care of anyone. I feel for her. Perhaps staffing was not good that day either. \n\nIt was my first time there. I loved the alcohol shakes but the atmosphere left something to be desired.\n\nMaybe next time we are in town things will be different but for now it's meh outing. For service and atmosphere."
  ]
 },
 {
  "name": "Blue Moose",
  "address": "3030 SW Wanamaker Dr, Topeka, KS 66614, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/be9b1d46-9334-11ea-a073-14b31f159f22.png",
  "tags": [
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=15899674419322772487",
  "source": "GoogleMaps",
  "reviews": [
   "Service was very good.  Waitress mistakenly dropped my food while delivering table order.  Remade but delayed.  She told the truth.  She and manager both apologized and some discount fof the delay.   It was not necessary but was nice.  Food was very good.  Waitress was great.",
   "Didn't order from their menu, chose the brunch buffet instead. It had a good variety of both breakfast and lunch to chose from. My favorite was the cold smoked salmon, fresh fruit, Eggs Benedict and Mirmosas!! We had good service and enjoyed the formal but relaxed atmosphere.",
   "A lot of energy in this place. High volume of cross table conversations thoroughout the place. Very friendly waiting staff. Good happy hour drinks. The shrimp wontons are to die for! The mini cheesecake needs something else.... The build your own mac and cheese is everything!",
   "Went for lunch on a Saturday afternoon and was highly impressed! Not busy, so we were seated right away. Server was very attentive and service was quick from beginning to end. I had a hard time deciding between two different entrees, and the waiter recommended the buffalo chicken wrap, and I was not disappointed at all! So good! Just enough spice, the chicken was tasty and crispy, and it was just all around excellent! Atmosphere is nice and upscale, but not over the top. I would confidently recommend the Blue Moose to anyone looking for a great meal!",
   "We came in from out of town and this place was amazing. The service was quick, polite, and friendly. We got  The Mac and cheese with white truffle oil which was the best I’ve ever had! No exaggeration! We also got a wedge salad which was delicious! It was also reasonably priced! Overall amazing experience, highly recommended!"
  ]
 },
 {
  "name": "Paisano's Ristorante",
  "address": "4043 SW 10th Ave, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bed937fa-9334-11ea-acdf-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "knowledgeable",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1049251823142736606",
  "source": "GoogleMaps",
  "reviews": [
   "Locally owned restaurant, with far more authentic southern Italian fare than the popular chains.  Consistently good service and outstanding food.  Some seating us not the mist comfortable, but the atmosphere is fine.  A bit more expensive than other Topeka shops, but we'll worth the money.  Always a stop considered when we are in Topeka.",
   "Love, love the food. Very nice place to wine & dine. Very polite staff. Food options are great to have veg and non veg italian food.",
   "Everything Italian!!  The food is very good. Our waitress was fantastic.  She was helpful, knowledgeable, and unobtrusive. (That is a strong combination of skills.) I found it would be good to get there before 11:30 for lunch - go and ask them why! My tomato sauce was cooked down a little too much Very thick, but very tasty. Of course I will return.  So will you!",
   "The atmosphere was perfect. Frank Sinatra played on the speakers as we walked in. I was finally here. My first time at the location in Topeka, I had them years before but in Lawrence and my taste buds were not as they are now. We were seated within minutes. There were a couple of people in the restaurant, not too cluttered, restaurant kind of small, but gives it a cozy feel, the lighting was great, we were seated at a table, within two minutes our waiter was spot on with asking what we wanted to drink. I got Pepsi he got Mountain Dew, then he asked what we wanted to order not skipping a beat, the gentleman really was a pro, I ordered the amazing Garlic Cheese Bread and the Chicken Parmaigiana\n$14.99, and my friend ordered the Roman Twins,  the plates were massive. I couldn't even finish mine.. And I m still so stuffed I can barely think to write this review... All in all.. Everything was perfect, except the sauce I felt was a little sweet... Only reason for the 4 and not 5 stars... One of my best Labor Day memories though...thanks Paisano's for making me feel right at home.... You did a great job",
   "Let me first say that I have been a fan of Paisano's for years, which is why it pains me to write this review. My husband and I took our son here as a treat before my upcoming deployment, and we both feel that the service and quality of food has diminished. Service was incredibly slow and our waitress seemed overwhelmed with her three tables. My pasta sauce was listed as a garlic and olive oil sauce with balsamic vinegar and there was no balsamic, nothing but oil (see picture). Sonsad to see a place we love lose quality."
  ]
 },
 {
  "name": "Texas Roadhouse",
  "address": "5901 SW Huntoon St, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bf1c344c-9334-11ea-a480-14b31f159f22.png",
  "tags": [
   "music",
   "performance",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15374778373947535111",
  "source": "GoogleMaps",
  "reviews": [
   "Exactly what your expecting from a Texas Roadhouse. It's loud. They have meat. Sometimes the servers dance unenthusiastically to whatever is popular on country music stations. Bartender was friendly and had clearly been doing it for a while as she knew what she was doing and her guests knew her.",
   "Served 2 well done steaks in a row, I ordered med rare. No manager talked to me, never fixed the problem. Just comped it and left me with cold fries and apple sauce for dinner, pretended like I didn't ever order a steak for dinner. Great bar service though minus the second steak sitting in front of me the entire time, and no correction ever replaced it. Poor expo, grill cook, and manager performance. Very very poor :/",
   "This has always been my favorite place bit I tried the ribs for the first time and they were dry as dust.  Taste was great but too dry.  Everything else was fantastic",
   "Wanted to help a business in a difficult time. I was very disappointed. I did the online order with curbside pick up for a family of 6. When we got our food home we were missing 1 whole meal, the side for another, and the 3 chicken fried steaks were all chicken fried chicken. Come on guys you really need to up your game. Was looking to have a nice sit down with the family but instead will be in the car for the next hour and was just told the chicken fried steaks were sold out. You have my phone number you could have saved us both some time.",
   "I called 1 hour before we got there to be added to the phone que. When we arrived we only waited 5 min for our table. The food was exceptional, and the service was beyond. The atmosphere was like a dream, and the experience was the best I've had in years. Thank you for everything!!!"
  ]
 },
 {
  "name": "Globe Indian Cuisine",
  "address": "117 SE 10th Ave, Topeka, KS 66612, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bf6e7312-9334-11ea-9d9a-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "eat",
   "food",
   "walking",
   "drink",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=5790619154732540024",
  "source": "GoogleMaps",
  "reviews": [
   "The Globe was even better than I had remembered!! Got take out and it was so delicious and got so much food!! The staff were very awesome too; they were so friendly, hardworking, and helpful. If you love Indian food like I do then come give them a visit, you won't be disappointed 🙂!!",
   "The whole fish was outstanding. Very nice service and delicious accompaniments. Will go again when I'm Topeka. Nice glass fixtures that appear to be blown.",
   "Visited Globe's lunch buffet again.  I have eaten lunch there for over 20 years, frequently back when I worked within walking distance and still as often as I can.  I have never visited for dinner though.  They always have a nice selection for lunch. The quality of the food is excellent and they cook it as it should be with lots of spice!  If you love Indian cuisine, treat yourself!  I highly recommend Globe.  The only drawback is, which is on me, is I always eat too much trying to try a bit of everything!",
   "We ordered out somewhere new to us tonight and were absolutely NOT disappointed. We ordered Tandoori Shrimp, and Shrimp Biryani. Masala Chai Tea for the drink. It was ALL fantastically amazing. We will absolutely be going back. Thank You Globe for the amazing food!",
   "It is not for me.I won't be back there to eat but the people who work there are so nice, they get 5 stars! They make me want to come in just to visit with them. They are very friendly, funny, welcoming, outgoing, and they interact with their customers. I'm glad I went,even if I didn't have any lunch. 🤷🏾‍♀️"
  ]
 },
 {
  "name": "Chez Yasu",
  "address": "2701 SW 17th St B, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bfd12cf6-9334-11ea-8cb5-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=2886716957984105699",
  "source": "GoogleMaps",
  "reviews": [
   "Always upgrade your salad for the goat cheese salad. They are always featuring something new to try. Enjoy some wine and be sure to save room for dessert! Great service and staff. Making reservations is easy! Check it out.",
   "Soooooo went with wife for anniversary and she loved it I enjoyed it but wasn't blown away after we left not gonna I went to the taco shop across the street to get me something that would hit on my taste buds",
   "A jewel! If you prefer upscale dining with a cozy atmosphere without upmarket prices make Chez Yasu your restaurant of choice. Everyone says to order the butternut squash soup. The best! Goat cheese salad was laid perfectly and the shrimp with a nice tangy butter sauce were paired nicely. I will be back to sample more from a Chef who has talent.",
   "Oh my goodness, it was a culinary delight. I  loved the different flavors",
   "Loved my seafood crepe, the atmosphere, and the service!"
  ]
 },
 {
  "name": "Henry's BBQ Grill in Historic Harley Davidson, Topeka",
  "address": "2047 SW Topeka Blvd, Topeka, KS 66612, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c01f7438-9334-11ea-bc08-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3432796406829031672",
  "source": "GoogleMaps",
  "reviews": [
   "There really needs to be a big sign outside. I almost didn’t stop in and that would of been a mistake! Very good Q at a reasonable price! Great sauce that’s sweet with a little tang. I can’t wait to go back and try more items!",
   "Welcoming friendly service, ordered pulled pork and tips, amazing beans (bacon, sausage and beer recipe) and special slaw. I added some spicy BBQ sauce.\n\nPlenty of seats available during Saturday lunch, staff came round to check if food is ok, despite being a fast-food ordering and collection system. I was aiming for the baby back ribs, but only available on Fridays! Hope to be back...",
   "Excellent food! Exceptional staff! Best cheesy bacon macaroni in town!",
   "Great down home bbq cooking. Friendly and fun staff.",
   "Great service, great atmosphere, great food!"
  ]
 },
 {
  "name": "Bobo's Drive In",
  "address": "2300 SW 10th Ave, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c06f9022-9334-11ea-8dcc-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "knowledgeable",
   "family",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15620185200895790085",
  "source": "GoogleMaps",
  "reviews": [
   "Neat old vintage drive in cafe.   I wish I lived closer, I would eat here more often.   Everyone seemed really happy to be there working.   Food was quick and good. Great experience overall.",
   "Came to try out the famous Bobo Drive In. I was immediately greated when I pulled up. Waitress was friendly. I ordered a simple cheeseburger and fries. The cheeseburger was tasty. A bit crunchy at the edges. The fries were fresh and they gave me quite a bit of them. Only a little over $5, so not bad on pricing. I'll probably be back again some time. Quality food at a good price.",
   "I love the pork tender & onion rings. Awesome! My family love the double steakburgers with cheese. Carhops are prompt, knowledgeable, & friendly. 4.5 for me also.",
   "Hands down best onion rings I’ve ever had! Burgers were delicious! The chicken fingers are huge! My fiancé said the chili cheese fries were the best he has ever had! Will be coming back!!",
   "Just what you would expect from a classic diner. A cheeseburger that reminds you that some food is meant to be enjoyed. The onion rings were perfect, and the chocolate shake was thick and creamy. And prices that should make fast food chains ashamed. Well done BoBo's... That's how you become a classic."
  ]
 },
 {
  "name": "HuHot Mongolian Grill",
  "address": "5900 SW Huntoon St, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c0d2e634-9334-11ea-8a7e-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "nature",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16597827119696292319",
  "source": "GoogleMaps",
  "reviews": [
   "How was HuHot Mongolian Grill? Wonderful! It was really wonderful. My wife and I stopped by on a whim as we were traveling through, we were so glad we did.  The food was amazing.  Prices were great. Service wonderful (although maybe slightly under staffed). The manager was one of the best restaurant managers I have seen, and it is reflected in all other parts of this HuHot location.  We'll be making it a point to travel through here more often just so we can enjoy some more HuHot!",
   "It has been about 10 years since I have been to a HuHot Mongolian Grill. I found the Topeka one to be clean, friendly, and quick to serve. I was a little discouraged with the diluted nature of the garlic oils in the sauces. I felt I placed a significant amount of “sauces” on the entree but after it was cooked, to the food was rather bland. I was looking for a strong garlic flavor with 9-10 ladles of Garlic oil.\nThe selection was fantastic on the bars from the meats to the veggies to the final toppings. Our server was amazing, always smiling and came to the table at just the right timing. The grill master was a blast and engaged the customers which I feel gives it a personal touch. Finally if you are practicing any of the various eating lifestyles, this HuHot caters to many of them i.e. Keto, Atkins, Weight watchers, etc. I would definitely recommend this place just make sure you really “load up” on the oils/sauces.",
   "Great food cooked on a grill right in front of you. You pick your own meats and veggies in a bowl and add sauces. Then take it to the grill. Tastes gr8!",
   "Fresh ingredients, fresh veggies, fresh oils and sauces to try. It is also vegetarian friendly or for those trying to stay on a keto diet. \nI always get great service here and leave happy and full.",
   "I had never been to a HuHot before. I LOVED it!!! Can't wait to go back!"
  ]
 },
 {
  "name": "Cracker Barrel Old Country Store",
  "address": "1421 S West, SW Ashworth Pl, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c11a770c-9334-11ea-9f94-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7590329495121317417",
  "source": "GoogleMaps",
  "reviews": [
   "Good service. The food was as ordered and warm. The server was a very nice. We got seated quickly. We will sure return.",
   "They forgot my steak fries, so the manager took care of me for having to drive all the way back across town. 10/10, best customer service I have EVER received. Food is amazing, I love the catfish and chicken and dumplings, to the manager there, thank you for your kindness!",
   "I’ve ordered the meatloaf dinner to-go 4-5 times during covid. Only once has all of the food been hot. Picked up a meal today, the only thing hot were the green beans. If I didn’t like the meat loaf so well, I wouldn’t return for to-go food.",
   "The food and ambience warm you from the inside out! The store is filled with delightful items that remind me of my childhood. We've had better service but will definitely go again.",
   "Absolutely beautiful in this restaurant/ store. Bathrooms very clean, well stocked with hand soap and paper towels. Great supply of items to buy in the store part, inside the restaurant very intimate! Wait staff extremely kind and willing to help! Food orders taken immediately,  drinks served promptly, and when food was served it was nice and hot!\nDefinitely will be returning with my family to enjoy another evening out. Thank you."
  ]
 },
 {
  "name": "Pad Restaurant",
  "address": "1730 NW Topeka Blvd, Topeka, KS 66608, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c165feb4-9334-11ea-93fe-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11758062354766277427",
  "source": "GoogleMaps",
  "reviews": [
   "Like fried food? Like a home town feel? Maybe want a salad? Answer any of those with a yes, then this is the place for you. I have yet to find a cheese fry this good. Love em but the ole ticker/cardio doctor wont approve. Good ice cream also.",
   "Excellent food and great atmosphere.  The double cheeseburger with bacon is excellent.  Fries and chocolate shake was delicious. If you can, go.",
   "One of Topeka's must visits if you are. In the area and hungry.  It's survived many years for a reason.  Fast and fresh should be their motto because you will get a freshly prepared order Everytime you go there and you will come back because the quality is great, the service is friendly and there is even a salad bar if you decide you want to dine in.  They have the best pork fritter in a 100 mile radius.  A definite MUST DO if you don't get here very often!",
   "AS always!!! The Pad is the best place in North Topeka for a meaty and cooked to order Burger!\n\nTroy is doing a wonderful job keeping up the family tradition of quality and wonderful service.",
   "We went once again tonight, Christmas eve, and they did a great job with service and it all tasted great."
  ]
 },
 {
  "name": "El Centenario",
  "address": "1306 S Kansas Ave, Topeka, KS 66612, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c1b9eb6c-9334-11ea-b086-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3034389125411855287",
  "source": "GoogleMaps",
  "reviews": [
   "When I review a restaurant I rarely use the phrase \"the best\" with that in mind this absolutely is the best authentic Mexican restaurant in Topeka. Always amazing food and service paired with big portions you can't go wrong. Highly recommend the tamales.",
   "This is a good Mexican restaurant in downtown Topeka. The service was fast, and the food hot and tasty. The building is kinda unique, and ads a level of atmosphere. I would recommend this place if you are looking for Mexican in Topeka.",
   "Service was outstanding. 4 wait persons. It only took 5 minutes to get my food. Best tamales I've ever had. I went for lunch and they were fairly busy.",
   "This is a great little Mexican restaurant, as are all of the little restaurants in Topeka.   In my humble opinion, El Centranario has THE best carnitas in this town!  If you like delicious marinated shredded pork that is melt in your mouth tender?  This is the spot to get it.",
   "Love, love, love that place! I have been MANY times, great food, not the same old same old, great service EVERY time!"
  ]
 },
 {
  "name": "AJ's NY Pizzeria",
  "address": "1930 SW Westport Dr, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c1ff0af6-9334-11ea-b983-14b31f159f22.png",
  "tags": [
   "free",
   "delicious",
   "delicious",
   "delicious",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18280954044261885760",
  "source": "GoogleMaps",
  "reviews": [
   "Incredible pizza! Gluten free option at a very reasonable price. Regular slices are HUGE. Pleasant atmosphere, bustling but not frantic. Plenty of seating options and neat decor. Friendly staff, too. Highly recommend!",
   "The employees were very friendly, the menu was impressive, and (best of all) the pizza was delicious! We went with a classic, pepperoni. The cheese had just the right amount of stretch, the pepperonis were nice and crisp, and the crust was perfect. It even had just the right amount of sauce, which was flavorful and not too sweet. The decor on the inside of the restaurant was cute, reminiscent of NYC. We stopped on a whim and left knowing we'd be back!",
   "This place has awesome new york style pizza! We get the chicken parm pie and 2 of us have a hard time refraining from eating the whole thing :D\nThe crust is fantastic. \nNice atmosphere and it is well priced for the product.",
   "Tonight my boyfriend and I went to AJ’s for the first time (we are from out of town) and we absolutely loved every moment of our experience here!! Jordan was awesome! He was so kind, friendly, and provided us great service! The pizza was absolutely delicious and the general atmosphere was so cozy and welcoming! We will be coming to AJ’s every time we’re in Topeka! Thank you!",
   "Great experience every time I come in. Staff is super friendly and even when they are busy they are always kind and attentive while you are waiting. Been coming here for years. A great place to hang out or have large group get togethers in the party room. Food is delicious and always hot and fresh out the oven. The bartenders are amazing and can always recommend good drinks. Servers always check up on us even though you order the food at the bar. There are also great drink specials every night of the week."
  ]
 },
 {
  "name": "Saigon",
  "address": "3200 SW 29th St, Topeka, KS 66614, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c24c67c8-9334-11ea-ae45-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2885498785125572287",
  "source": "GoogleMaps",
  "reviews": [
   "I enjoy the food here but service isn't always the best. They have just enough help. If it's busy, very door service",
   "So lucky to have this Vietnamese cuisine here in Topeka! Spring rolls are the best in town, I think their peanut sauce has to do with that. Their pho is good but I favor discovering their various Vietnamese dishes. Take an adventure and taste something new!",
   "The hours on google are incorrect. They close between lunch and dinner. \n\nI still haven’t dined here because every time I go, they’re actually closed between meals. \n\nI would recommend calling first to check to see if they’re open.",
   "Excellent service all around. The owner greeted us and sat us in a timely manner. The food was delicious and very good portions were served. Worth coming back again.I read about this recently and liked the story of how this place came to be. I was excited to finally get a chance to eat there.",
   "I love the environment and the staff is always very pleasant. And the food is amazing."
  ]
 },
 {
  "name": "A-Hann Thai",
  "address": "2222 SW Washburn Ave, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c296694c-9334-11ea-9076-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=17794526303498880794",
  "source": "GoogleMaps",
  "reviews": [
   "I stopped in for lunch here recently and was very impressed. The Pad Thai was incredible, but the wait staff also highly recommended the drunken noodles.  I thought the lunch price was very reasonable, especially considering both the quality and quantity of the food.  The staff was amazing, and made me feel very welcome.  This is the best Thai place I've been to in the area.  I will certainly be back.",
   "Delicious meal tonight! Delivered right to my car door. Friendly, always flavorful food!!! We ad the Tom Yum Soup, Fresh Garden Rolls, and Pad Cashew Nut (shrimp added) entree. Thank you all so much!!! (My husband said the Fresh Garden Rolls were the best he has ever had!)",
   "Best Pad Thai in town, I’ve tried them all. Always fresh ingredients with everything I’ve ever ordered.  The sweet chili dressing on any salad they have is to die for. The staff is very friendly and extremely appreciative every time I ordered take out during the pandemic. Can’t wait to dine in again.",
   "This is the fourth time I've eaten here and I've tried something new each time and loved it. I had the starter sampler this time and the crab rangoon may be the best I've ever had. I really like their pad Thai and my aunt and uncle are a big fan of their curries. Servers have always been excellent. So glad they've been getting the business they deserve. This is exactly the type of place I love about Topeka.",
   "This cute little Thai restaurant really impressed me. Everything from the potstickers and crab delight, to the fried rice and pad Thai, it was all delicious and very flavorful. I ordered mine hot and it was just the right amount of heat. Nice atmosphere as well! Definitely coming back"
  ]
 },
 {
  "name": "The Weather Room",
  "address": "920 S Kansas Ave, Topeka, KS 66612, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c2e7befa-9334-11ea-8425-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13683297107072177564",
  "source": "GoogleMaps",
  "reviews": [
   "Great Bar! Sarah is a fantastic bartender who knows how to mix not just crank standard cocktails. Lot of unique twist.  Can't want to come back.",
   "Food was wonderful. Wine was really good. Service was good. Staff was supportive of each other, seamlessly removing used  plates and responding to put rewuests . Our waitstaff, Frank, was just the right amount of attentive. Great atmosphere and decor. We'll be back",
   "Stopped in during Restaurant Week. Mmmm..I would characterize it as upscale casual. A bit noisy. I was dining alone so  didn't have to worry about conversation. You can wear jeans, which I did , like the wait staff or be a bit dressed up. The number of wait staff was confusing at first. Then it was just two primary ones. Overall, the service is good and you should tip accordingly for that. Maybe not so much for the food. The food was cooked to perfection except my main course salmon was waaayyy over seasoned. It was paired with an equally salty side. Main course was kinda like a salt lick. Next time I will request light to no salt and hope for the best. I didn't send back, but was tempted to. Real butter with the hot yeast roll. Noticed I said roll. The meal combinations are interesting. All the courses are just enough for one person.  Which is fine, no leftovers to hang out in my fridge for days. I would give suggest giving them a try. Be prepared for a wee bit of a sticker shock for the quality of the food. It is nice to have a more upscale option to consider.",
   "This was so good! We will definitely be coming back. Stylish atmosphere.",
   "Food and service were both excellent. The prices were fair as well. Highly recommended."
  ]
 },
 {
  "name": "Kiku Japanese Steak House",
  "address": "5331 SW 22nd Pl #46, Topeka, KS 66614, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c330601c-9334-11ea-8110-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "food",
   "food",
   "food",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1123252111685552862",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful experience with great atmosphere for our group. Chef was great, he interacted wonderfully with all of our group. \n\nFood and drinks were great, server was attentive and nice.  As expected for a higher price point. I definitely felt like it was worth it. \n\nTop notch night out with friends and family!",
   "This was my first time here. Our waiter was great and the food was delicious. Our waiter was constantly bringing refills and was on top of checking on my Wife and I. The chef was great and was pretty funny. The show was pretty short and simple but was still cool nonetheless. My only complaint would be the grills and surrounding area was pretty dirty. You could see all the built up grease on the front of the grill. I also saw a lot of old food in the crevices on top of the grill. All in all, the food was good and the service was timely. I would definitely go back again.",
   "One of my whole favorites! We frequent this restaurant all every year for birthdays and special occasions. The food is always amazing! The Drinks , the Mt.Fuji is my all time favorite and sushi is the best I have ever have! I love the rice the veggies they cook in front of you. We get steak and chicken and it never disapoints! Most go!",
   "Today was my first time at Kiku.  Absolutely loved the whole experience.  A bit pricey, but it also comes with a great show.  The chefs cook your food right at the table and put on a great show for you.  Well worth it.  Large portions.  Great drinks.  I will be back!",
   "I've been coming here for years.  I'd give them 5 stars but the chefs do not give the show they used to.  Just a basic egg roll & onion volcano.  I'm ok with bringing my kids here for the price if we get a good show but if they don't improve that will be my last visit. Food was excellent service was ok."
  ]
 },
 {
  "name": "Los Magueyes Mexican Food",
  "address": "623 SW 6th Ave, Topeka, KS 66603, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c37c0f10-9334-11ea-915b-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11453512904601086825",
  "source": "GoogleMaps",
  "reviews": [
   "I love their tortas and gorditas! I highly recommend checking them out if you want a quick bite!",
   "Great local food!",
   "We came in at the end of the evening. The food was great. The service was great. The atmosphere was great. They have food and drink specials monday thru friday. Handicap parking and seating. Big parking lot is easily accessable.they serve alcoholic beverages.",
   "Very good and fresh food. I would recommend this place to every one. Definitely a diamond in the rough.",
   "Good service the food is good end the price is right"
  ]
 },
 {
  "name": "Oriental Express",
  "address": "5954 SW 29th St, Topeka, KS 66614, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c3c52612-9334-11ea-8aa0-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "kids",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7141253558334422881",
  "source": "GoogleMaps",
  "reviews": [
   "I and my wife have been going here to eat for years and have never been disappointed. The menu is great and the cost is very reasonable. I would highly recommend this place to anyone who loves Chinese cuisine. I hope this restaurant will survive this virus that is bringing our great country to its knees. God bless and stay safe.",
   "Generous portions for a great price. Everything was delicious. Very friendly staff too!",
   "How often does a Chinese restaurant give you a side of steamed broccoli with your general Tso's chicken? It may not make up for the fried chicken, but it sure is a refreshing change. Aside from that, I've never had a bad dish or bad service. This place is great.",
   "Great food, even better service. Our two ASD kids are super picky and the staff made sure they got enough  to eat(including giving them extra fortune cookies). Honestly, the best pan-asian food I've had in Topeka!",
   "Chicken pad Thai is amazing and delicious! Quick service and great food. Two can eat lunch for less than $15."
  ]
 },
 {
  "name": "Amigos Topeka Mexican Restaurant",
  "address": "5145 SW Topeka Blvd, Topeka, KS 66609, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c40ed970-9334-11ea-b03a-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14329532811296740935",
  "source": "GoogleMaps",
  "reviews": [
   "The best Mexican restaurant in Topeka. Always good service and always a fantastic meal. Take a look at the chilaquiles and tacos al pastor. They were mouth watering and delicious. Definitely worth the trip.",
   "The food was good. The service was good. The waitress was excellent. The only bad thing was took awhile to get refills and all of our food at once.",
   "Waited to be seated. Waited to give our order. Waited 20 minutes for two meals. Waited for take home boxes and ticket. Restaurant was only have full when we arrived. Food was good though. Will give them another try I think.",
   "The beef nachos here are the best I've ever had.",
   "Love this place. Food is amazing and the service is like being home.  So friendly!"
  ]
 },
 {
  "name": "Hunam Chinese Restaurant",
  "address": "5005 SW 29th St, Topeka, KS 66614, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c450c4c0-9334-11ea-a832-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "food",
   "cheap",
   "food"
  ],
  "link": "https://maps.google.com/?cid=643430072204803444",
  "source": "GoogleMaps",
  "reviews": [
   "My family has been coming here for 20 years. The food is great and the owner has been so kind to us. It’s the only restaurant I look forward to visiting when I  visit Topeka.",
   "Lady at front desk is so rude. Beware she is the owner  she answer  the phone hangs up quick. Food is off not great and not bad. There are no  customers  in restaurants . The watries  is kind and nice .",
   "Worst Chinese food I have EVER had. $40 worth of food in the trash. Called to complain. Lady hung up. Will not ever go back",
   "Beautiful restaurant. Very authentic. Great place for Date Night!",
   "This place is pretty cool and cheap food that taste great. Old asian lady owned she is super nice. Big portions."
  ]
 },
 {
  "name": "Margarita's Jalisco",
  "address": "1616 SW 17th St, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c49d3750-9334-11ea-925e-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7053908290087763450",
  "source": "GoogleMaps",
  "reviews": [
   "Great little mexican restaurant across from Washburn University. VEry authentic food. Just got back from Mexico and they have a lot of original dishes that I had there. Try the pan fried taco and the enchiladas in the green chili sauce. Full bar.",
   "Food is awesome! Wasn't a long wait time! Cute place to sit back with family and have a good time!",
   "Good food, good wait staff, and good Margaritas. We like to go there. It is comfortable and fairly close to home.",
   "Poor service, never in my life I had worse service. The waiter focused on the party of people and others and CONSISTENTLY walked by our table. We ordered our food and it looked under cooked, we reordered and didn’t get our food. Don’t recommend this place at all",
   "Outstanding place! Some of the best Mexican food I've ever had! Staff is super friendly. Fantastic visit!"
  ]
 },
 {
  "name": "Tortilla Jack's Mexican Restaurant",
  "address": "1618 SW Washburn Ave, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c4e75fd2-9334-11ea-aad5-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "cheap",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14622520337047664367",
  "source": "GoogleMaps",
  "reviews": [
   "This place makes my soul food. If need centering or need to figure out why I'm here on this earth, I come to Tortilla Jack's.\n\nI order the Nacho Platter. It's a \"build your own,\" and comes with their awesome cheese sauce. Then I add: lettuce, tomato, onion and taco meat. That dish sets me straight every time. I love this place❣️🤗",
   "Friendly staff. Fast service. Food was really good. The chili and cheese covered burrito was really good. The taco burger was just like the way Taco Tico used to do back in the day. Very pleased with this outing.",
   "I love the experience at Tortilla Jack's Mexican Restaurant. There tacos are great and at a cheap price. If you want to go somewhere cheap and close by I recommend coming here.",
   "Well, if chips and salsa are your thing you’re gonna want to go here.  There’s an entire buffet set up of just chips and salsas 😍  restaurant was clean, staff friendly, food was good and the restrooms were clean.  I’d recommend",
   "Top favorite places to eat in Topeka. Friendly staff, quick service, amazing food. Don't go here if you're expecting authentic Mexican, but it is still a great place to grab a bite to eat. Highly recommend trying their burracos at least once. I've never found one at any other Mexican place, authentic or not."
  ]
 },
 {
  "name": "El Mezcal Restaurant",
  "address": "511 SW Topeka Blvd, Topeka, KS 66603, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c52d42b6-9334-11ea-98c0-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17935121108171199354",
  "source": "GoogleMaps",
  "reviews": [
   "Great food, Great Service. Great location. Fresh Food. Better than average accuracy. All around good establishment. A+ in my book! I would recommend to anyone. Cleanliness is exceptional and for the most part food is always delivered fresh and taste great.Great food, Great Service. Great location. Fresh Food. Better than average accuracy. All around good establishment. A+ in my book! I would recommend to anyone. Cleanliness is exceptional and for the most part food is always delivered fresh and taste great.Store was nice and well put together, plenty of stock, knowledgeable staff ,friendly staff, cleanliness of the establishment was a plus, store set up flows well, great location, parking was decent, check out was fairly speedy.",
   "Overall good experience. Quick service with drinks, chips and salsa, and food. Good food that I would describe as standard Mexican. Nothing out of this world, but also nothing terrible (at least not that I had) either. We would return again.",
   "The food is wonderful and a generous meal is honestly cheaper than a fancy burger with fries and soda at a fast food restaurant. The ambience is fun. Most of the wait staff is polite and the service is always fast.",
   "The caldo de pollo is amazing and will make you forget your grandmothers chicken soup. The chimichanga 5 stars as well as the tacos. Dont forget to top it off with a jumbo margarita.",
   "We ordered multiple orders of polo arozes add  12 shrimp to each for 7$ extra. We only received 5 shrimp each!! The guy on the phone told me it would be 12 shrimp 7$  nope we got 5 on all 3 orders!"
  ]
 },
 {
  "name": "Cook's American Grill",
  "address": "1936 SW Gage Blvd, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c5734cbe-9334-11ea-8aff-14b31f159f22.png",
  "tags": [
   "eat",
   "eat",
   "food",
   "kids",
   "food",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1290495196013246852",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great place to eat. They have a big menu but I always seem to go for the same few things because they are so good. I recommend the cheeseburger and most recently I tried the BLT which was very good. This is a great local place to support. You won't be disappointed.",
   "I had a double bacon cheeseburger, and it was excellent. The wait wasn't especially short or long, but the food was well worth it. I will eat here again when I'm in the area.",
   "A perfect example of a great hole in the wall place. The food is really great and that’s partly because it’s not trying to be anything fancy. I also love the paper cars that the kids meals come in.",
   "Cook's is a great place when you're hungry for some home cooking but don't want to cook. Chicken fried chicken is delicious and the mashed potatoes are really good. Not a lot of atmosphere - order at the counter and get your own drinks and tableware but they do bring your meal to the table if they're not busy. Probably closer to 3.5 stars than 4.",
   "Great food! Lots of pie choices. Very diverse menu. Snd their cinnamon rolls are delicious!"
  ]
 },
 {
  "name": "LaRocca's Pizza",
  "address": "3100 SW Gage Blvd, Topeka, KS 66614, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c5b97d8a-9334-11ea-a49f-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10294988605863363247",
  "source": "GoogleMaps",
  "reviews": [
   "When we get tired of the quality at the fast food places, we go to LaRocca's. The pizza here is always next level, but the wings and the pasta dishes are good too. I recommend the BBQ Smokehouse pizza made with smoked brisket, pulled pork and polish sausages from Hermann's Meat Market. They've also got an awesome beer list, so it's a good place to have a cold one and watch the game as well.",
   "I literally love everything I've tried there. The pizza is seriously so good. I could also drink their marinara sauce it's so yummy!",
   "Went for our first time last night, got there and a worker rudely told us to seat ourselves. A few minutes after we sat down and older lady rushed over to us, very rudely tossed our menus down and immediately asked what we wanted. We told her we had never been there before and we would need sometime, she didn't say anything.. just walked off. About 10 minutes later a younger gal came over and took over our table, the rest  of our service was good. The food was great,  but due to the service, we won't be back.",
   "Went here for the first time last Monday, January 20th, 2020, but we will never ever come back. We ordered Deluxe pizza for carry out, got there, took my order. When I got into the car my wife asked me to check our order. We were 100% sure that we got a cheese-flavored pizza. Went back in and told the wait staff about it and this is what she said: \"we put cheese in between our stuffing and I'm sure that is not cheese pizza\". When we got home, true enough, it was only cheese flavor!!! We were so livid. We spent $20 only for a cheese-flavored pizza. What a ripped off!",
   "Amazing food and the wait staff was equally amazing. I recommend LaRocca's for their bread alone. I had the Pasta Your Way as Spaghetti with Vodka Sauce and Chicken which was great."
  ]
 },
 {
  "name": "Kyoto Japanese & Sushi Bar",
  "address": "115 SE 29th St, Topeka, KS 66605, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c5fe008a-9334-11ea-8a86-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9003571029410681180",
  "source": "GoogleMaps",
  "reviews": [
   "Great food. May need to work on the atmosphere a little bit. Love the owners..\nReally good 👍 people",
   "Fantastic food. Family owned and operated by great people. Been a favorite of ours for years.",
   "This place is always AWESOME! The owner comes out and takes care of people personally, which is more than I can say for most places. The food is stupendous, the service is always excellent and the atmosphere is quaint and comfortable. Five stars all the way.",
   "This restaurant has some of the best food to offer in Topeka. Its owned by this nice family who greets you as soon as you open the door. Would recommend to anybody.",
   "Great food. Tuna Tataki is outstanding!"
  ]
 },
 {
  "name": "Wok & Grill",
  "address": "400 SW 29th St suite u, Topeka, KS 66611, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c645b840-9334-11ea-ac4c-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11628521025448484855",
  "source": "GoogleMaps",
  "reviews": [
   "First time trying tonight and I have to say hands down the best Chinese/Japanese restaurant in town. The lady taking orders was super nice and very accommodating. Thank you very much for a much needed pleasant experience!!!!",
   "\"Please read all of review!!!\" Great food and service!  A lot of food for a great price.  Definitely worth trying out!!! We will return!!!  \nSaw the change in hours and wanted to share with ya'll.  One man band shop with kids....  I understand the urgency of changing hours.  Let's ralley behind the owner and show him how much we like what he has to offer!!",
   "This place use to be amazing! Best in town.\nTakes for ever to get your food anymore!\nThe newest thing they have changed the hours again!\nWith a sign in the window of Temporary Hours\nlooks like they are only open for dinner on Friday and Saturday’s.\nI called for 20 minutes before driving 17 minutes to get here to find a note in the window. CLOSED\nThey should AT Least have an answering machine that says they are CLOSED! \nSince sitting here writing this, 3 more customers have pulled up to find they are closed!!",
   "This place has weird hours. Just because it says they are open at X time doesn't mean they actually are. Also sometimes the front desk lady is baby sitting as well as working.. which is odd. However, the food is great here. I have never had a bad experience with the food, and a personal recommendation from me would be the steak and fried rice, super tasty!",
   "Great Price, Better Food.  Get the dishes as hot as you would like.  Everything we have had so far has been awesome.  We've gone twice within three days, should say how amazing their food is.  The customer service is amazing.  The place is well lit and clean.  There sweet and sour soup is probably the best in the state.  "
  ]
 },
 {
  "name": "HHB BBQ",
  "address": "906 S Kansas Ave, Topeka, KS 66612, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c68b4cd8-9334-11ea-9ece-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=10842719121672400880",
  "source": "GoogleMaps",
  "reviews": [
   "I found this place while in Topeka on business. I first came with my coworkers for dinner and went back to pick up some bbq to bring home to my family. It's a very relaxed place with plenty of seating for large groups and the staff was super friendly.",
   "Very pleasant and helpful staff. Nice atmosphere. We had the pulled pork nachos, half order of sliders and the Wednesday half chicken special. All the meat was very moist. The chicken was the least smokey but had a good (lemony) flavor. If you like \"funeral potatoes\" you will love their cheesy taters. The smoked mac n' cheese was really good as well. Looking forward to a chance to go back.",
   "We stopped here on our way through town. Based on recommendations, we got the pulled pork nachos. They were very good. They come with just chips, cheese and pork. Then you can add additional items from a bar.  Made them even better in my opinion that you get to pick how to dress them. We also got the sampler. The best part of the whole thing was the smoked chicken wings. The sausage and brisket were also good.  We ordered sides- cheesy potatoes, smoked mac and cheese, smoked corn and the baked beans. All were solid. My favorite was the potatoes. Good beer selection, friendly service and nice decor make it worth the trip. ",
   "The restaurant is well appointed and the menu is simple but perfect. I had the brisket and it was very flavorful and juicy and just fell apart. We also had the pulled pork nachos, which was fun and stupid good. The people were very nice and helpful.",
   "HHB BBQ is everything BBQ should be. I highly recommend the brisket but no matter what you get there you can't go wrong, because their BBQ sauce is divine. Furthermore we got recommendations from the staff which was helpful."
  ]
 },
 {
  "name": "Pizagel's Pizza & Bakery",
  "address": "2830 SW Fairlawn Rd, Topeka, KS 66614, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c6d4b240-9334-11ea-8d39-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15096644588073786556",
  "source": "GoogleMaps",
  "reviews": [
   "Their bagels are great, but their cream cheese is the best! They have many different flavors to choose from and each one I've had so far is great. My favorite is the vanilla brown sugar, it tastes just like cheesecake filling! Also, the pizza is really good too!",
   "The staff was friendly and helpful. The pizza was very good. I will try to come back.",
   "Just got my order from eat street. Never ate here before. Absolutely delicious. The Apple pie pizza was the best. Hot and delicious. 6 stars if I could.",
   "Pizagel's has a good, homey atmosphere. The bagels are great, the coffee is warm and nice, and the pizza must be fantastic. I highly recommend trying this cute café and supporting their business.",
   "Ordinarily we are very happy with this place. We have been going there since it was only Bagel Express. We actually thought that the staff and food quality had improved over the last 15 years. I stop through there about once a month to get a bag of bagels, with two sides of cream cheese, to take to my office and share. My wife stops there a couple of mornings during the week to grab a bagel for us to share. She will get a chai tea and get me coffee. She did have a bad experience yesterday. It was not with staff. Or the ordering experience. It was with the quality of the bagel and the amount of cream cheese on it. This was the first time we had a problem. I hope it is not an indicator of what is to come."
  ]
 },
 {
  "name": "Perkins Restaurant & Bakery",
  "address": "1720 SW Wanamaker Rd, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c71e3e70-9334-11ea-966f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "comforting"
  ],
  "link": "https://maps.google.com/?cid=1145288301351778159",
  "source": "GoogleMaps",
  "reviews": [
   "I want to thank Perkins once again. For Easter we would always go to your restaurant when my Mom was alive because she loved the sweets. After she passed we could have gone elsewhere but we still came back to Perkins. The food was always great and the service even better. Yesterday on Easter my daughter ordered from there to go in honor of my Mom. She said she was the only car in the parking lot and she could see maybe 3 employees only. She said they were so happy to see her and were so nice in getting her the food she ordered. You see Perkins even in a troubled time you are a beacon of hope. I'm applaud your business and even more your caring staff. I hope to sit inside again someday soon.",
   "The service was amazing the prices were decent and the portions were plentiful. I've never gotten my food so quickly before. It was cooked fresh to order and came out hot and stayed hot! It was flavorful and well seasoned. The atmosphere was quiet yet pleasant. And got service with the smile the entire time. Will most definitely go there again.",
   "Love eating at Perkins. Wonderful food and staff. Great prices and portion sizes. Not so good when young children want to get up and run around though. Need a place for them to get their energy out before and after eating.",
   "First time here!!!! We loved it! Service was excellent, and all the people who worked here were wonderful!",
   "Whenever I want good French toast, this is where go when in Topeka. I got the Brioche platter with sausages and eggs over medium. Very nice. Very comforting. Great coffee, and the bakery is excellent."
  ]
 },
 {
  "name": "Topeka Pizza",
  "address": "1630 SW Arvonia Pl, Topeka, KS 66615, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c7650bb8-9334-11ea-87b8-14b31f159f22.png",
  "tags": [
   "free",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=4739399470862811436",
  "source": "GoogleMaps",
  "reviews": [
   "I stopped in here over Christmas to donate toys to the Topeka Mission.  I did not know doing so would earn a free pizza.  We tried the pizza here as a result.  It was very good.  We especially enjoyed the bread sticks and homemade ranch.  The staff are nice and fun to talk to.  We have added Topeka Pizza to our pizza rotation.  We recommend giving them a go.",
   "First off... WOW! This pizza (specifically the buffalo chicken pizza) is UNBEATABLE. I went in for the first time today & took the $7 two slices + a drink for $7 (TAX INCLUDED!) and it was phenomenal.\n\nI doubt I'll order from places like Pizza Hut or Dominos very much going forward; if at all.",
   "Best in town period. There's a lot of places in town that claims to have New York style but this is only one that I've been to plus a really good staff. I would definitely suggest going here if you have the opportunity",
   "Staff were friendly and very quick to get orders in and out to waiting customers. I wish I could say I enjoyed the pizza though. Like a few others have commented, the pizza sauce lacked all flavor. Usually a bump of salt or Parmesan cheese will help, but I did both and nothing helped. Toppings were fair, but for the \"higher cost\" pizza experience I'm apt to go back to my other favorite place.",
   "This pizza was pretty close to the “real” New York pizza. Let me also say the pizza was HUGE and enough to feed an army. The meat lovers was phenomenal and the seasoning was very good. Only complaint I have is the way the pizza was cut...it bugged my OCD big time. Some large pieces, some smaller ones, way uneven. Other than that, five stars."
  ]
 },
 {
  "name": "Los Charros",
  "address": "4111 SW Gage Center Dr, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c7acc37a-9334-11ea-9379-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17449147815525685860",
  "source": "GoogleMaps",
  "reviews": [
   "Good Mexican food and friendly service. My wife and I frequent when we want a tasty, quick lunch meal. We never leave hungry and the lunch specials are very reasonably priced.",
   "Wow, spicy and tasty, good salsa, a solid meal value!",
   "Friendly staff and delicious food.  Been in a few times because my son loves the kid's taco salad and I've tried different meals each time with no complaints. Reasonably priced as well.",
   "Very good food. This secret seems to be missed by a lot of people. On Sunday's anyway. Good food. Good service.",
   "Enchilada Suiza. Will add more Info later."
  ]
 },
 {
  "name": "QDOBA Mexican Eats",
  "address": "1025 SW Wanamaker Rd Suite A, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c7f6c4e4-9334-11ea-b701-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "free",
   "tasting",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8317763631900112841",
  "source": "GoogleMaps",
  "reviews": [
   "Great food, great customer service and great people!!",
   "I love Qdoba!! I always get the 3 cheese nachos with the the chips on the side or a burrito. The chicken and steak are my favorite meats but they also have ground beef and pork. You can build your own I always add the white lime flavored rice pinto beans to mine. Also the medium sauce is on point also known as Verde sauce. The portions are very filling. Their food is fresh and alive with flavor. One of my favorite places to eat for sure.",
   "I have been eating at this Qdoba for years and I never had a complaint! The food is always good. Today my wife got me a bowl and the black beans tasted like it had too much salt in them. When I called to let them know the manager not only replaced my food with a better tasting bowl but he also personally delivered it to my house with coupons for two free entrees. I really appreciate the great service and amazing food this Qdoba has provided our city with! Thank you so much!!!",
   "Went in there about 2 today. The 2 girls and guy were playing hackey sack and tossing a rag around the food and were very rude. Hollering at us don't touch this and that. We left will probably not return. Ball or rag hit in food. Manager needs to address this kind of behaviour. Good luck with your food purchases there",
   "The staff is wonderful. It has been over a year since I moved out of town, but while visiting, I dropped by and was recognized and asked how I'd been. I love the nachos made with all the different ingredients I select."
  ]
 },
 {
  "name": "El Mezcal III",
  "address": "5301 SW 21st St, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c831ab10-9334-11ea-aa30-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13634363935085924052",
  "source": "GoogleMaps",
  "reviews": [
   "I met a relative for lunch here.  Not being from the Topeka area,it was my first time.  The staff was very polite and the service was exceptionally quick from getting drinks to being served our entrees.  The food was good but I wouldn't say it was anything unique.  Maybe getting to explore beyond the lunch menu would be helpful.",
   "Excellent flavor! Fairly priced very clean inside. Highly recommend!",
   "What can I say??? Food tastes almost like Nana's...\nDefinitely will be eating here again! \nSo Delish!!!\nStaff extremely kind, and quick! \nRestaurant was very clean and well staffed.",
   "Everyone that works here is extremely friendly and professional.   The food was excellent and nice portion size.  Always a pleasant experience that I will definitely repeat in the future.",
   "Great people great food. Very nice place to go to. Seating is a bit crowded.  Little treats up front. Our server was great"
  ]
 },
 {
  "name": "EL Chilar Mexican Restaurant",
  "address": "2511 SE California Ave, Topeka, KS 66605, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c882d9ac-9334-11ea-aaca-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18054023427115540397",
  "source": "GoogleMaps",
  "reviews": [
   "My wife and I  decided to try El Chilar tonight and we were not disappointed.\nWe were greeted  by the owner and he has to rank in the top ten of the nicest guys to run a restaurant and we were quickly seated and brought menus. He asked if this was our first time in and answered our questions about the menu and before we knew it we had fresh chips and Salsa with drinks. He explained the hot and mild salsa and he was visibly pleased by our favorable reactions because both had excellent flavor and the hot (IMO) had just the right amount of heat. There were several items on the menu that I wanted and I was surprised to see that they offered Chili Colorado because not a lot of places offer it. I decided to have the Chili Verde and the wife had the pan fried taco dinner and both were served with beans and rice. Our meals were timed very well and we had just finished our chips and both plates had excellent presentation and the food was hot and very well prepared. The pork in the Chili Verde was perfect and the flavoring was excellent and my wife said that her chicken taco's were excellent also with great flavor and very well prepared.\nBusiness was slow tonight and the owner said that with the snow his business had been slower but this is also a sign to me and when business is slow in a small restaurant and the food is perfectly prepared and has excellent taste this says a lot about the establishment.\nMy wife and I highly recommend El Chilar and I will have to try the Chili Colorado the next time we are in.",
   "Wonderful food! Doesn't look like much from the outside, but the food was great. Husband and wife own/operate it. My Chili Verde burrito was incredible.",
   "They were a bit short staffed there the cook just had a baby. The fajitas were decent and the taco was ok fell apart though. The enchilada sauce tasted like canned tomato. Knowing it wasn't  the normal chef I'll give it another shot after the normal chef comes back. Will update star rating and review when I do. \n\nSide note: Owner was nice. He comped the nachos because they forgot to put the meat on them.",
   "This place is awesome.  I had heard good things about it but this was our first experience.  The food and the service we're incredible.  The owners are really great people.  Everyone should give it a try!!!!!!",
   "Very tasty little Mexican diner with authentic dishes.  The entire menu isnt all listed, so bring your smart phone to see the other items.  Very accommodating and excellent service"
  ]
 },
 {
  "name": "Oriental Pearl",
  "address": "2025 SW Urish Rd, Topeka, KS 66615, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c8c58708-9334-11ea-86f7-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2333621476140184356",
  "source": "GoogleMaps",
  "reviews": [
   "From the outside, I wasn’t sure about this place. When you walk in, you feel welcome in the spacious and relaxing atmosphere. We LOVE the crab rangoons. Prices and service are great too!",
   "This is the best Chinese food restaurant I've found in Topeka.  Sweet and sour chicken was tasty, as well as hot and freshly made.  No weird vegetables or fried things included.  White rice was hot, sticky and fresh.  The decor is nice, but with oddly out of place plastic on tables.  Overall I would recommend.",
   "Food is a little pricey for what you get. Ordered Hunan beef and hot and sour soup. Both had a good flavor to them. But not much in the way of contents. Ive never had cabbage used as a replacement for vegetables as much as this place does.",
   "Flavors were excellent but portions were a bit small for the price.",
   "I ordered sweet n sour Chicken. It was awful!! Dried up fatty chicken with absolutely No vegetables. I called and asked if they forgot the veg and Matt said no, it doesn't come with vegetables.  The rice was greasy and only had dried up but greasy corn. Please save your money. It is the worse Chinese food I've ever had in my life."
  ]
 },
 {
  "name": "Iron Rail Brewing",
  "address": "705 S Kansas Ave, Topeka, KS 66603, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c930cc3e-9334-11ea-9ec3-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "family",
   "eat",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16786988312445926958",
  "source": "GoogleMaps",
  "reviews": [
   "What a great lunch today - so glad to be in Topeka and have something open. The food was great - 2 meat deal with beans - black coffee. My waitress was so happy to be working and made lunch fun. Mike Kagay recommends the \"engineer\" so next time I will try that. Thanks for great service and food.",
   "Once you first step in the atmosphere is what really pops out. I would give 5 stars for the atmosphere.  Hard wood floors great lighting plenty of space between you and the next table.  They even have a room that can accommodate 48 people for private parties. I had the Saison and Kolsch both I would recommend to anyone that does not like a high IBU beer.  My wife had the club and said it was good.  Better than going to subway but not as good as some of the specialty shops.  I had the top city cheese steak, it had great flavor but was soo dry it was hard to eat without sauce. I had their greens and would recommend them over most places in Kansas. They were not overcooked and had a nice flavor. The fried pickles where some of the best I have head.  Crispy outside with a  mellow flavor compared to most I have had.  For the whole family they would not be too spicy for any age.    We will try it again to see if the food is different during peak hours vs mid day. Wait staff was very cordial and could help recommend the perfect food and drink experience for you.",
   "Food was delicious.  Small restaurant in downtown Topeka.  I highly recommend downloading Yelp, they use it for waiting for your table.  There was a large party and our waitress seemed a bit tired up with them frequently.  We had to ask for lemons and other items several times.  Our check was even delivered by another waitress, eventually picked up by our waitress.  The very redeeming qualities was the food, far better than expected.  We do plan to return, we will not have the same waitress.",
   "Big, open, industrial feel. The food was amazing. It took a little longer to get but they were pretty busy when we went. Wait staff was super friendly.",
   "It was a nice place for dinner. The pulled pork ( what I had) was tender and had a good flavor, the drawback was it was quite dry. It is a good thing I like a lot of BBQ sauce. My wife had a salad and said it was good with no drawbacks. As a more bar focused theme this wasn't such a big deal but it was also loud from people talking. They had nothing to soften the sounds. This was our first trip and we do intend to give it another try. Overall the staff was nice, the food did not take too long, but we didn't order anything they had to make on the spot. The prices were par for what you got. I did get the feeling our waitress was a bit busier then the other staff just standing around the bar talking it up. I would like to give 4.5 stars but gave the benefit of the doubt."
  ]
 },
 {
  "name": "Hog Wild Pit-Bar-B-Q",
  "address": "5330 SW 21st St, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c97d17e6-9334-11ea-ac3b-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8498491729170746785",
  "source": "GoogleMaps",
  "reviews": [
   "We got a family pack. Ordered early and it was great to bring home! The gentleman at the till was really helpful and everyone there was extra polite and thoughtful. We got some extra the next day to supplement our leftovers and were greated by the same kind man again. Yes....go there and enjoy the great food and great service. Thanks!",
   "Best BBQ EVER. I haven't found a better place. Excellent food for a great price. My favorite is the hot links, but the pull pork is great also. Simply the best",
   "You want BBQ? You want good BBQ? You better come here. Out of stater and was looking for a great KC BBQ and found this gem, in the middle of Topeka. Got the 3 meat, and felt like I had to deadlift the plate to my table, there was so much food. And for $12.50? Done. Go here for good food and good value!",
   "Not bad, friendly staff, decent food. I order large portions because i feed a whole crew. This place was able to actually give me the BBQ i needed whereas their competition on Huntoon cant seem to put together enough food for one person, let alone 5 to 8 people. So far Hog Wild has come through for us 10 times whereas the other guys have only been able to do it one time out of 11.",
   "This BBQ place has great food, clean, friendly staff and good prices.. I will be back.."
  ]
 },
 {
  "name": "Chic-A-Dee Cafe",
  "address": "3036 SE 6th Ave, Topeka, KS 66607, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c9c4a86e-9334-11ea-8556-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2101065416710181908",
  "source": "GoogleMaps",
  "reviews": [
   "The food is what you would expect from your typical American dinner.  Freshly made comfort food...yum! The service was outstanding and very welcoming to all.  The only reason I didn't give 5 stars... the atmosphere. It really needs a makeover but just a deep cleaning would help tremendously.",
   "This place was recommended to us by some locals and they didn't lead us wrong. From the outside it almost looks like it used to be a house, but the food is actually quite good. Our server, Carly, was friendly and professional. No complaints at all about her or the food. \n\nIt's a little tight with a wheelchair, but definitely doable.",
   "Small and cozy \"grandma's kitchen\" type of cafe, made me feel really welcome and at home. Food was a little on the plain side but still delicious and filling as well! Will definitely return and try more of the menu! Decent prices, filling meals and friendly service? What more could I ask for ^~^",
   "Friendly service with great food and friendly pricing.  Sorry about the half-eaten pie, the photo was an afterthought.  Delightful, light and chocolate slice, best I've in a long time.",
   "Delicious every time. Great family place. Always leave with a full belly."
  ]
 },
 {
  "name": "El Gallo Mexican Restaurant And Cantina",
  "address": "3501 SW Topeka Blvd, Topeka, KS 66611, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ca0b2476-9334-11ea-8abf-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "affordable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1873972288140183991",
  "source": "GoogleMaps",
  "reviews": [
   "My wife and I needed a place we hadn't eaten before for an impromptu date night. El Gallo it was. Love the food. You get a lot of it, too. We also like the atmosphere.",
   "Excellent food.  Kind staff!  Will be back again!",
   "Every time I've gone the wait staff has been very attentive to our needs without being overbearing. Food is always good and comes out quickly. Reasonably priced as well.",
   "First time visiting. Didn't think the chips and  salsa were the best but ok. The food is awesome, hot and fresh. Employees very friendly. It's very affordable. Must try!",
   "Food came out to our table very fast. Had fajitas they were excellent, salsa was good also. Very reasonably priced."
  ]
 },
 {
  "name": "El Ranchito",
  "address": "2800 SW Fairlawn Rd, Topeka, KS 66614, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ca4e1248-9334-11ea-9e04-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4901173143966200804",
  "source": "GoogleMaps",
  "reviews": [
   "One of my favorite places to eat hands down. Food is always great. I always tell myself I am going save enough to have lunch for the next day, but I can never keep myself from eating all of it. The service is good and about the same  as every other Mexican restaurant.",
   "This is by far the best place. The waitress is so kind and understanding talks to our children. The food is amazing and the Margaritas are the biggest and best in town!!",
   "The best Mexican place in town!  Excellent food, Great staff! Go early, it fills up by 6PM.",
   "Wow!\n\nI heard this place was owned by a relative of the owner of El Chilar, and making good food runs in the family.  I’m a big fan of two things that usually aren’t found: mole and albondigas.  I didn’t get to try the mole yet, but this big delicious bowl of albondigas was top notch.  It’s a simple meatball soup with carrots and squash, but it’s so delicious.  It’s exactly how family would make it (except they usually put big chunks of potato in it).\n\nI’ll definitely be doing back. I’m 3rd generation Hispanic, and there are certain ways I want my food, and this place met all criteria. \n\nOn my to go places for Mexican in Topeka.",
   "It must be good. Too busy to stay and wait to be seated. Just passing through and didnt want to add pend a long time eating."
  ]
 },
 {
  "name": "Gyroville Topeka",
  "address": "2855 SW Wanamaker Rd #4698, Topeka, KS 66614, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ca922052-9334-11ea-9fb5-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "hospitable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2724534247514707484",
  "source": "GoogleMaps",
  "reviews": [
   "I usually order falafel platter. Its tasty and fulfilling. Its a great place to have some good food. And its not costly at all.",
   "Very good food, fast service and fresh ingredients. The menu has many options and most options are on the healthy side. I am very pleased with my experience!",
   "Surprise, its perfect! Nice prices. All the middle eastern flavors you wouldn't expect in a pop up spot. With so many robust flavors in a humble location you will definitely be back for more.\n This is a casual fast food atmosphere. It works well as carryout, just as well as dining in. Note, they have a yogurt bar that presents plenty of options, did not try it.",
   "My wife and I ordered the Philly Gyro and the loaded fries. \nUn.\nBe.\nLievable.\nFresh, cooked in front of us, and hospitable service with a smile. Reasonable prices and a very clean restaurant. We will be back!",
   "Disappointed I didn't give this place a try when they first opened! The food is fresh and tasty. A great place to get quick healthy food."
  ]
 },
 {
  "name": "Five Guys",
  "address": "1191 SW Wanamaker Rd, Topeka, KS 66604, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cade45cc-9334-11ea-832a-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12773839319816935389",
  "source": "GoogleMaps",
  "reviews": [
   "Great tasty huge burgers!  If looking for normal size burger, get the Little Hamburger.  Great fries and lots of them! Great service too! Highly recommend for something better than fast food but still fast and fresh!",
   "The burgers are good, the fries are okay. My 4 year old son and I ate there and it cost 25 dollars which is ridiculous. I suggest if you get fries to get the small. Anything else is way too much. It was good but for the cost I will probably go somewhere else if I plan to spend that much.",
   "Good service, faster than I thought, raised their prices. I'd recommend Burger Stand if you have the time to sit down.",
   "I do like their burger and 🍟.",
   "I love Spangles. Staff here is great, food choice is & menu is Amazing, and I even have food intolerance issues! Consistently great."
  ]
 },
 {
  "name": "Terry's Bar & Grill",
  "address": "522 SW 6th Ave, Topeka, KS 66603, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cb22f01a-9334-11ea-b138-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "food",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=444746894221892901",
  "source": "GoogleMaps",
  "reviews": [
   "This was my favorite spot to eat hot beef and hot turkey sandwiches. They had the best in town for a great price. Went in today and was very disappointed there was hardly any turkey. It was all so small it hardly covered half the box. Extremely disappointed! The entire time I was there receiving my order the waitress was on her phone. I had to wait to be greeted until she finished texting.",
   "Very chill spot, great atmosphere and really good food at a good price! They also have pool tables and plenty of TVs for sporting events. Did I mention .75cent Tacos on Tuesday?! And Sunday as well! Also fried livers and Gizzards are a part of the menu so go check it out!",
   "Very nice and clean. Food is inexpensive and delicious. Offers fantastic bar food appetizers as well as weekly specials. Service was fantastic",
   "Always good times to be had here. $0.75 tacos are better than ones you'd pay more for at the drive thru. Nicole was amazing and the other gals working were fun, too. I always run into good people here. Affordable prices, good food and drinks. Great neighborhood spot.",
   "Long standing local establishment. Terry the owner personally works behind the bar or on the floor as needed."
  ]
 },
 {
  "name": "Tacos El Mexicano",
  "address": "2002 SE California Ave, Topeka, KS 66607, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cb68fb18-9334-11ea-8148-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "affordable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7077046271998411884",
  "source": "GoogleMaps",
  "reviews": [
   "Love the steak and pork street tacos here. You get three to a plate with beans, guac, and fried onions. Best taco plate in town.",
   "Very disappointed!!! Theydid not get my order right. The best thing was the salsa",
   "The food was good small place we took ours home..salsa was excellent",
   "Great experience eating here! The food was very affordable, and quite tasty. The salsa and guac tasted fresh, as did the rest of the food! I would definitely recommend eating here.",
   "So yummy. If you want to try real Mexican food. Here is where to find it"
  ]
 },
 {
  "name": "Tacos El Sol",
  "address": "2124 SE 6th Ave, Topeka, KS 66607, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cbb23bf8-9334-11ea-b670-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6221391530288232749",
  "source": "GoogleMaps",
  "reviews": [
   "The food is okay. It is good to grab a quick bite.  Kind of plain. Customer service is always bad almost. Not friendly. There are other places where the food is the same that I would go to because they have better customer service. The way you treat people goes a long way.",
   "Food is awesome. The meat is really well prepared, seasoned, and cooked. Authentic, delicious, and reasonably priced. Service is always excellent too! They sell so much, everything is always fresh.",
   "Great tacos at a reasonable price.  Flan was a little heavy but still good, probably would have been better if I got there when it was fresh.  If you’re looking for that spicy kick then get the green sauce.",
   "Amazing tacos el pastor, best tacos I've ever had in my life flavor explosion!! will be coming back for sure!!! Person with me got a beef burrito and it was huge and delicious to if you want some good authentic Mexican this is the place to go 😍😍",
   "Taco El Sol has been a weekly stop for us for years.  However, the last few visits the place, never spotless, has been grimy.  There is no attempt to wash the tables between customers and no attempt to keep the floor somewhat presentable during the day.  Our last visit there were few customers but every table was dirty.  Customers usually bus the tables themselves so all they need to do is come out and wash the tables.  The food is still good, but hard to enjoy in these surroundings.   My husband has ceased to order the steak burrito, because it has turned into a bean and steak burrito.  Half of his last steak burrito was all beans.  Something has changed this past year."
  ]
 },
 {
  "name": "Field of Greens",
  "address": "909 S Kansas Ave, Topeka, KS 66612, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cc0967a8-9334-11ea-8079-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=1496635313199498282",
  "source": "GoogleMaps",
  "reviews": [
   "Great option for a healthy lunch. Full salad bar, 2 soup options, and baked potatoes. They also make sandwiches to order.",
   "Love this place!!! Tuesdays are state employee discount days too.",
   "Good place, fresh salad, good selection, and friendly staff. Can’t ask for anything else than that!",
   "Best place in Topeka for salad bar and soups for lunch on weekdays. Great place for health food. The staff are always friendly and personable. Love that it is locally owned. A must go place if you are anywhere near downtown Topeka.",
   "This place is not worth the $30 for 2 people.\nSalad wasn't fresh, very little in the containers.\nThe chicken noodle soup was barely Luke warm at best and not very tasty. \nNot the friendliest bunch. Closed the salad bar almost an hour before closing. \nWe won't be back"
  ]
 },
 {
  "name": "Margarita's Jalisco North",
  "address": "1835 NW Topeka Blvd ste 161-a, Topeka, KS 66608, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cc4c8b24-9334-11ea-98da-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=15922638949204674226",
  "source": "GoogleMaps",
  "reviews": [
   "You want some excellent Mexican food? Look no farther! These guys are awesome! I'm really sorry that I waited so long to try them. The food and service were great, and they are rocking the take out too. My only complaints are that I wish the portions were a little bigger and that they are a little expensive, for what you get, but darn good! Give 'em a try! Oh, and for something different, try the fried cheesecake. Mmmm me likey!",
   "Never been here before. Went and had pan fried tacos— amazing. The service was THE BEST Jorge was our waiter and his smile and fun attitude made for a great dinner with friends. Will be going back for sure!",
   "Best Mexican Food in Topeka, KS 👏🏼 PERIOD! The food is so fresh. Jorge’s cheese dip has so much flavor! The chips and salsa are fire 🔥! I tried the Gringo Quesadilla, I would highly recommend. Clean environment, cold margaritas, and friendly staff. Anytime I want Mexican food in Topeka, Margarita Jalisco (NORTH) will receive my business every time. Only restaurant that reminds me of home, California! ⭐️⭐️⭐️⭐️⭐️",
   "One of the best Mexican place I have been to. Great food, very good portion, and I inexpensive price. Their michelada was great. Even though the one come with shrimp cost $13, it still worth all the money. Great atmosphere, great food, great service, all around I would absolutely recommend it to anyone.",
   "Love Taco Tuesday. Its hit and miss on the service sometimes. The chicken tacos are delicious and for $.99, amazing!"
  ]
 },
 {
  "name": "NOTO Burrito",
  "address": "822 N Kansas Ave, Topeka, KS 66608, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cc94ef54-9334-11ea-845c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "unique",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11726178488931893468",
  "source": "GoogleMaps",
  "reviews": [
   "One of the few local restaurants on Happy Cow in Topeka offering vegan food. We made the drive over to an empty-artsy area of town. Food was alright. We got the V burrito, the only vegan item on the menu. The sweet salsa they offer tasted like a strawberry smoothie and was a bit weird.",
   "Great place, comfy/accepting environment with great burrito choice (the cilantro lime rice is the best!)\n\nFood comes up fairly quick and I haven't had anything I didn't like 😁",
   "Love it, the decor it unique, fitting well into the NOTO atmosphere🎆. Food was good, enjoyed the fact that I could have a beer with my lunch.\n\nDivine timing, while we were in NOTO Burrito, WIBW was filming a segment of 'Fork in the Road'. it will air 3/10/20 @ 5pm",
   "Very tasty food and great portions, especially for the price. The workers were really friendly and the food was served very quickly.",
   "BEST burritos I've ever had. This is my official burrito spot. Great service. Great food"
  ]
 },
 {
  "name": "Pancho's",
  "address": "3506 SW Topeka Blvd, Topeka, KS 66611, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ccdf18b8-9334-11ea-8a7a-14b31f159f22.png",
  "tags": [
   "food",
   "tasting",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14478257231038411942",
  "source": "GoogleMaps",
  "reviews": [
   "This is my go to place whether it's lunch time or 4 am after a night of fun. It is open 24/7 and it is consistently great food. Staff is quite patient and always in a good mood. I highly recommend their burrito line up and pickled carrots.",
   "Service was great! And food came pretty quickly. Very good tasting food. A must try for sure 😄",
   "I love this place and eat there at least once a week. My favorite is the chorizo breakfast burrito, so good! Love the nachos with steak too! Prices are good for me though I know some folks might think they are a bit high but you get what you pay for and for the price Panchos is fresh and tasty! ❤️",
   "Excellent food!  Best in Topeka!  We couldn't decide what to order.  It took us forever but the staff was patient.  She described each thing we asked about on the menu until we were satisfied w/our choice.  We were very pleased w/the food. We've been back several times. I dream about their food! You get tons of food also.  More than enough for one meal!",
   "Absolutely Loved the Carna Asada Taco's!!! Definitely worth checking out for dinner... will definitely be back if I am in the neighborhood again!!!"
  ]
 }
]