[
 {
  "name": "New Jersey State Museum",
  "address": "205 W State St, Trenton, NJ 08608, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cd26f752-9334-11ea-8e66-14b31f159f22.png",
  "tags": [
   "free",
   "kids",
   "free",
   "learn",
   "kids",
   "free",
   "art"
  ],
  "link": "https://maps.google.com/?cid=3412163777070574866",
  "source": "GoogleMaps",
  "reviews": [
   "The reason I love this place is because it was the place where Rare Disease Day 2020 was hosted and celebrated. Because of its ideal location in the heart of Trenton, the event was able to have its' very first legislative roundtable where 2 assemblymen and 2 assemblywomen were able to make there way over to the event and interact directly with attendees. The entrance is accessible and the event was held on a Monday morning and surprisingly allowed for easy street parking. The acoustics and lighting were a bit difficult. The windows allowed way too much light into the room where clear pictures were practically impossible to take. If the windows had drapes, it would have allowed for better picture taking but the in person experience was very much enjoyable.",
   "This was well above my expectations. The museum is relatively small compared to some others, but the quality is on par with the really big museum. It is free to get in, free parking on the weekends and the staff there is truly exceptional. I took my kindergartner for the exhibits and Planetarium. She absolutely loved it. It was easily one of the best free activities to spend 4 hours with her.",
   "It’s great for a free little museum. I enjoy taking my kids especially upstairs to see the natural science section and there are puzzles and books upstairs as well. Nice gift shop and we have enjoyed the planetarium a few times (not free). Parking is the only problem—if you park in the garage, be prepared to have to ask to be let back in as the door locks behind you. And the people are always grumpy to open it for you.",
   "I love this museum! Its free and its a great place to go with kids or on your own. There's always something to learn! The staff is friendly and great with kids. Every exhibit is fascinating. The second floor has a kids area where they can learn through play. We haven't done a planetarium show yet but we hope to soon!",
   "It's the kind of Museum you would expect from a small City. The exhibits were marginally interesting with the sole exception of the art gallery which had a wide array of interesting paintings ranging from the 19th century to contemporary art. It's the kind of Museum that I would have said that it's an Hidden Gem if it would have been in the middle of nowhere. However, this is New Jersey's State Museum, and they could have done a much better job."
  ]
 },
 {
  "name": "Old Barracks Museum",
  "address": "101 Barrack St, Trenton, NJ 08608, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cd6ba21e-9334-11ea-8765-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "field",
   "kids",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=1793768510808076924",
  "source": "GoogleMaps",
  "reviews": [
   "Interesting place ... Don't forget to take the tour. The staff who did the tour for us was very knowledgeable . She also was very passionate about it which reflects through out the tour.",
   "The actors were fantastic and catered to not just the kids who we had on the field trip, but the adults who attended as well. Very fun premise to \"step back in time\" and act as though it were the 1770s, as well as the idea to involve the kids as much as possible. Everything was also handicap accessible, which was a huge worry (although it is a tight squeeze in the halls and elevator!) \nMy favorite part was getting to watch them fire a musket blank.",
   "Place was great. Staff and tour guide was super friendly and informative. Made me feel so welcome and I learned so much. Much thanks and props to the awesome staff.",
   "Excellent museum. The educators and staff that work here are what really make this a great place to visit.",
   "Very cool historical place. Guides are very informative. Definitely recommend it if you are in the area"
  ]
 },
 {
  "name": "Cadwalader Park",
  "address": "36 Parkside Ave, Trenton, NJ 08618, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cdc0eb18-9334-11ea-8fde-14b31f159f22.png",
  "tags": [
   "performance",
   "family"
  ],
  "link": "https://maps.google.com/?cid=4248405260212099097",
  "source": "GoogleMaps",
  "reviews": [
   "Ellarslie is always worth a visit. In addition to the historical information upstairs, the exhibits on the first floor change a few times a year.",
   "Designed by the same designer as Central Park. Olmsted. Bucolic in the City of Trenton.",
   "Amazing museum and performance venue. Situated in the middle of beautiful Cadwalader Park, the  Trenton City Museum within Ellarslie Mansion is a must-see and must-go!",
   "Always enjoy this museum. Interesting local exhibits and special shows. Nice gift shop.",
   "I went there for the first time and felt like a safe space. The grounds were well kept. This park was designed for family gatherings and joyous celebrations.\nI would recommend this park for meditation only if you have extreme focus- I'm talking Yoda, Master Splinter, Grand Lotus, etc. Otherwise, you need to go explore a quieter area of the park with less distractions.\nThe reason I gave it three stars is because the roads need to be clearly marked for EXIT. There were motorists going top speed the opposite way down the one way streets."
  ]
 },
 {
  "name": "Trenton Battle Monument in New Jersey",
  "address": "Trenton, NJ 08608, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ce1f88c0-9334-11ea-bb23-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=4780618019557487713",
  "source": "GoogleMaps",
  "reviews": [
   "Wish this historical place had a sign or marker.  Drove past it a million times and never knew what it was.  I wish it was better taken care of and maybe more attention payed to its historical significance.  Trenton has alot of history that no one knows about.",
   "Great statue but the interior museum is closed to the public because the elevator is over 100 years old and unsafe. Would cost a fortune to repair and the city of Trenton is strapped for cash. The granite monument is beautiful and worth a visit during the day or during a special event. It's not terribly safe for tourists at nighttime.",
   "Not as scary as place as it was a decade ago. A beautiful sight and monument so inspiring. A must see location in American history. It started here.",
   "On location for the ribbon cutting of the \"Wellness Loop\"",
   "This is a beautiful monument and the only thing I could find in Trenton remotely related to one of the most important battles of the American Revolution. Sadly, it is somewhat dilapidated and the park around it is not well kept at all. The general surrounding neighborhood seemed fairly sketchy as well. So, if you are in Trenton, go by and see this, but don't hang out there too long."
  ]
 },
 {
  "name": "Trenton City Museum/ Ellarslie Museum",
  "address": "299 Parkside Ave, Trenton, NJ 08606, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ce71526e-9334-11ea-9cea-14b31f159f22.png",
  "tags": [
   "art",
   "history",
   "unique",
   "art",
   "music",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15670942011338959612",
  "source": "GoogleMaps",
  "reviews": [
   "Always enjoy this museum. The quilt show I went to see blew me away (Go! even if you're not \"into\" quilts). I will probably go back to see them again. The shop also carries interesting and artsy items, as well as original local artwork.",
   "Solid representation of Trenton's industrial history. I learned quite a bit. Also had vibrant art displays in the first floor.\n\nPay as you please.",
   "Was there for a live holiday music concert. The Italian style architecture is lovely with the beautiful art displayed throughout for sale. Unique and handcrafted items in the gift shop and the museum upstairs.",
   "The changing exhibits are always interesting, often beautiful. Upstairs, the collection of Trenton pottery and ceramics feels warm and reassuring.",
   "Beautiful exhibit on the 100 year history of the Trenton based firm FVHD Architects-Planners"
  ]
 },
 {
  "name": "1719 William Trent House Museum",
  "address": "15 Market St, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ceb7aa6c-9334-11ea-aee0-14b31f159f22.png",
  "tags": [
   "historic",
   "history",
   "tour",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=9228488282849911640",
  "source": "GoogleMaps",
  "reviews": [
   "The property for whom the City of Trenton is named.\n\nWall property near the Delaware River.  In the part of the city considered downtown.  Flanked by 2 courthouses and large surface parking lots.  I like see the contrast between the architecture. \n\nThis non-profit org is a fixtured in Trenton and more recently has shifted focus on inclusion.  My most recent visit was for a committee meeting discussing the African Slaves who lived on the property and their efforts.",
   "Well worth the visit. The Governor needs to install more Signs so tourists and interested people can better locate the historicTRENT HOUSE!",
   "Great Historic site. In a great historic city!",
   "Visited for Annual Hogmany celebration as part of Patriots Week. Learned some history, chatted with nice people, and toured the Trent house. It's a fun thing to do during the holidays!",
   "A beautiful Historic site. Pleasant staff and tour guides. They had an awesome apple program wit apple cider pressing and a fine hearth cook poaching apples over a braizer. The aroma was heavenly!!"
  ]
 },
 {
  "name": "World War II Memorial",
  "address": "125 W State St, Trenton, NJ 08608, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cf094d2e-9334-11ea-8f8f-14b31f159f22.png",
  "tags": [
   "history",
   "structure"
  ],
  "link": "https://maps.google.com/?cid=14502983642397974711",
  "source": "GoogleMaps",
  "reviews": [
   "Clean and shaded seating area. The lady statue has some big feet.",
   "This is very well-done. There is a lot of information in a small space. Well designed and very interesting.",
   "History. Period. Amazing display",
   "Since it's closed now, unable to visit. However the opposite structure made to reflect ww2 was too little to feel overwhelmed",
   "Tinelines of both the European and Pacific theater's are excellent"
  ]
 },
 {
  "name": "Grounds For Sculpture",
  "address": "80 Sculptors Way, Hamilton Township, NJ 08619, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cf61a688-9334-11ea-97b5-14b31f159f22.png",
  "tags": [
   "family",
   "family",
   "art",
   "eat",
   "nature",
   "walk",
   "wander"
  ],
  "link": "https://maps.google.com/?cid=10898827426725527958",
  "source": "GoogleMaps",
  "reviews": [
   "If you have nothing to do and live not too far from that place, definitely go there. It's good for the whole family. An open area for the museum setup is refreshing, inspiring and simply great. Go, enjoy, relax, get inspired by artsy ideas, bring a friend, enjoy a cup of tea or lunch in their cafe. It's great to visit in anytime except winter.",
   "I visited with my family on one of the most coldest days of the year and although it was freezing outside we still had a wonderful time seeing all of the sculptures that we could get to. The works and their attention to detail are amazing. I highly recommend this collection if you've never been. I'd love to come back in warmer weather to see even more.",
   "Lovely place to explore!  You have a lot of wonderful\nSculptures and outdoor art pieces.  This place is basically nature meets art work.  Such a peaceful place.  There’s a lovely place to eat too. Definitely worth it!!",
   "really nice place to visit. Great online ticket prices although sometimes not working (good service will get you the deal during the visit). Sculptures are great! A lot to see. Pity you cannot bring dog, but makes sense as it would be mess",
   "It is a very fun place to walk around in, but there are no paper maps for visitors or large maps other than in the main building, said a worker. He told me I would have to walk back to the first building and take a picture of the map. I would have appreciated being warned by the check-in workers when I got my wristband or preferred that there at least be a map in every large building.\n\nAnyway, the peacocks are fun to spot, the grounds are beautiful, and the sculptures are numerous. They rotate in new sculptures, so there is something new to see every year. The Awakening giant remains one of my favorites to wander about."
  ]
 },
 {
  "name": "Planetarium At Nj State Museum",
  "address": "205 W State St, Trenton, NJ 08608, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cfad0792-9334-11ea-8fc3-14b31f159f22.png",
  "tags": [
   "kids",
   "eat",
   "kids",
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=3465783243798642036",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice museum  and planetarium. It's small so good for kids. No cafe or restaurant, but plenty of tables where you can eat lunch from home.",
   "Interesting place for kids and grownups. Informative and engaging presentations.",
   "My son is 3 and loves it here. He spends most of his time in the planetarium or dinosaur fossil area. It's a great way to spend a day.",
   "Perfect size for an afternoon trip with little ones. Gets better every time we go. Always check Groupon for a deal.",
   "Such a nice free museum for every age.... my daughters love to walk around"
  ]
 },
 {
  "name": "Lower Trenton Bridge",
  "address": "Morrisville, PA 19067, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d0049ddc-9334-11ea-8431-14b31f159f22.png",
  "tags": [
   "walk",
   "structure",
   "free"
  ],
  "link": "https://maps.google.com/?cid=18315287830120788663",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful structure and well maintained. The walk along the river on the bridge is a fun experience",
   "Just a great place to check out the Delaware River and see iconic bridge!",
   "Iconic landmark connecting Pennsylvania and New Jersey",
   "The bridge is an oldie but goody. Its free to cross too. The bridge was recently renovated and now has color changing led lighting. It is free both ways to go over. There is a wide walkway to ride your bike over and you can take some good pics of trenton from there too. In winter you can watch the iceburgs form on the river.",
   "Great bridge. Lights up. Gets you across the river dry. Only downside is that Pennsylvania is on the other side, but that's not really the bridge's fault."
  ]
 },
 {
  "name": "New Jersey State Police Museum",
  "address": "1040 River Rd, Ewing Township, NJ 08628, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d05b7076-9334-11ea-a8e3-14b31f159f22.png",
  "tags": [
   "historic",
   "tour",
   "free",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=7551368756898559060",
  "source": "GoogleMaps",
  "reviews": [
   "Pretty great historic about New Jersey State Police and the state trooper is very nice. 😁😁",
   "What a great museum. Beautiful tribute to the men and women who have, and are serving our state...",
   "We enjoyed our tour through the museum. It was a nice outing for a cold rainy day.",
   "Lots of interesting exhibits. Museum is free. They have a setup crime scene u get to help solve examine fibers and fingerprints. Lots of items from lindberg baby. Long corridor to the the log cabin exhibit along it pictures and stories of officers who died in the line of duty. Not much in log cabin but it is nice inside. You must show photo id to get through surrounding gate of complex",
   "Small but historic museum providing information on the establishment and development of the New Jersey State Police."
  ]
 },
 {
  "name": "Kuser Farm Park",
  "address": "390 Newkirk Ave, Hamilton Township, NJ 08610, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d0a15358-9334-11ea-971f-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "eat",
   "food",
   "walking",
   "learn",
   "historic",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11393582446471830489",
  "source": "GoogleMaps",
  "reviews": [
   "Nice place to walk around and see all the Christmas lights. They put a lot of work into decorating the Kuser Manor. The train set in the basement is really cool. They have pictures with Santa for the kids. Food trucks to grab a quick bit to eat if you're hungry.",
   "Always beautifully decorated. Enjoy walking thru here every year.",
   "This is one of the best places to visit in the Hamilton. Inside this very historic mansion lies an antique paradise and every single room has a fairly elegant design that has been untouched since the 20th century. Here's one of the most reasons why you should respect your elders today, because they have seen and experienced it all, in which you could happily learn from",
   "My family and I visited for Winter Wonderland and had the best time! The mansion is absolutely stunning all decorated for Christmas. We will definitely be back for another visit. This was a great family event!",
   "This is a beautiful park with fun holiday events!"
  ]
 },
 {
  "name": "John A. Roebling Memorial Park",
  "address": "Hamilton Township, NJ 08610, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d0f34466-9334-11ea-83a7-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=17393300663043830156",
  "source": "GoogleMaps",
  "reviews": [
   "The one and only park at this point that can make you really happy and release tress and you mind. Me and my wife love this park. Especially sundown. Really clean and big enough for walking. Also you have that really good view of the water.",
   "This park has very nice features a beautiful lake and trails. It also has the stairway from an old amusement park remarkably intact. There also are a few other remnants from old white city amusement park i believe it was closed in the early 1920s",
   "Great place to go for bird watching, photography, going for a walk and bring the dogs to let them run.",
   "Awesome little gem of a park hidden away on the outskirts of Hamilton. The paths are well-maintained there are constant improvements being made.",
   "Today was beautiful day sunny,  Breeze 💨but i love this park. I took my girls today and chill with sitting in the bench took some sun and we talk. family time"
  ]
 },
 {
  "name": "Mill Hill Park",
  "address": "East Front Street, S Broad St, Trenton, NJ 08608, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d14de780-9334-11ea-a00c-14b31f159f22.png",
  "tags": [
   "historic",
   "free",
   "walking",
   "learn",
   "family",
   "history",
   "music",
   "historic",
   "walking",
   "kids",
   "historic",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=6605270318970066858",
  "source": "GoogleMaps",
  "reviews": [
   "Simpy put, just an old fashioned open air park. There's a Thursday Farmers Market (May to October), free concert series every Thursday during the summer, plus a great safe open space in the middle of downtown Trenton. The walking trails that circle the park and close proximity to the historic section of Mill Hill, makes this park truly special.",
   "Battle Reenactment 2018.  A great family event, and learn about history. Every year between Christmas and New Years during Patriots Week.  Check it out some time!",
   "Historic location of the Battle of Trenton with George Washington defeating the British and the Hessians. Wonderfully maintained with plenty of open space, walking path and seating. Located in the \"downtown\" area of Trenton. Often used for events like the Pork Roll Festival, Alexander's 5k Run,  music festivals.  Easy access to parking, close to restaurants and businesses, the Mill Hill Playhouse, the Mill Hill neighborhood.",
   "Beautiful park on the edge of Trenton. Was there for a festival put on by a local gallery. It was a perfect day, in a great outdoor space. There is even an old bridge to wall over. I hope they throw more festivals here.",
   "Just a nice, beautiful park with some nice historic sights to stop and see i.e. Mill Hill Play House or The Bridge. There is also a nice spot to sit by the water and a kids playground as well. Probably one of the only nice parks in Trenton. Just wish it was a Little bigger."
  ]
 },
 {
  "name": "Mercer County Park",
  "address": "1638 Old Trenton Rd, West Windsor Township, NJ 08550, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d1a4450c-9334-11ea-b282-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "food",
   "walking",
   "family",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=4737411876361277097",
  "source": "GoogleMaps",
  "reviews": [
   "I've been going to this park since I was probably 11 years old. Always something going on always interesting always something beautiful to see, my favorite part of the bark is definitely the 9/11 memorial. I have always felt a special connection with it and I make sure to stop byand pay my respects. Always interesting events going on. Great place to take your lunch, to go by yourself or with friends. Plenty of trails to enjoy. Amazing scenery for greenery.",
   "Mercer County Park is a great place to experience joy. They offer many activities such as their tennis courts and their ice skating rink. You can also take a nice walk along the many paths there or try to hike a trail. All in all, it is an amazing place and you definitely should go there.",
   "Perfect place to just \"get out and go\".  Playgrounds, trails, soccer fields.....my daughter loves the ice rink (skate rentals, full snack bar, restrooms, fireplace and plenty of seating inside and rink side), my husband, and son, fish the lake and creek (large mouth and small mouth bags, musky, sunnies, bluegills) and I generally enjoy just being out, while walking the dog.  The boathouse is also great for smaller wedding receptions or other parties (with good food).",
   "Outstanding park with multiple facilities. Well maintained and clearly marked. We walked a trail, which is primarily used for HS and college cross country meets. Challenging and beautiful.  Also houses Longstreet Farms - best to check hours of operation. Nice chance to see farm animals up close.",
   "Beautiful park with many options to enjoy nature. There is plenty of wildlife, I especially like the groundhogs. The trails are scenic and well maintained. They have a dog park, marina with paddle boats available to rent, and beautiful playgrounds. Lots of areas to have a picnic or family get together. They host lots of events, and can be packed at times."
  ]
 },
 {
  "name": "Hamilton Veterans Park",
  "address": "Klockner Rd, Hamilton Township, NJ 08690, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d1e5bc18-9334-11ea-b672-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "walking",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=13211418859132376231",
  "source": "GoogleMaps",
  "reviews": [
   "A beautiful place to come. Great playgrounds (enter from the side with the airplane in the entrance), lots of parking, most of the play areas are shadowed in the summer. Great walking, scootering trails with sport activities by the way. A lake in the middle with lots of geese. Wonderful for walking with dogs.",
   "Beautiful and very well-kept park!  Military equipment is in excellent condition and ready for battle.  Many thanks to the people who so carefully cherish the memory of the heroes and defenders of our Great country-USA !!!",
   "This park is very beautiful with many gorgeous trails (paved and unpaved) for people to walk and use. All of the equipment is in excellent condition and the park is so large that it would be easy to spend days here and still have more trails to discover! The park also does an excellent job in representing the bravery of our troops and has something to represent each branch. The soccer, tennis, skating, and volleyball areas are also great for recreational use.",
   "Great park which is wheelchair accessible, beautiful walking path with a nice lake",
   "Love this park.   A ton of playgrounds for the kids, walking trails on and off road, dog park, ball fields it's the best."
  ]
 },
 {
  "name": "Washington Crossing Historic Park",
  "address": "1112 River Rd, Washington Crossing, PA 18977, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d23c18b8-9334-11ea-8e5b-14b31f159f22.png",
  "tags": [
   "family",
   "historic",
   "nature",
   "history"
  ],
  "link": "https://maps.google.com/?cid=11901342226039778745",
  "source": "GoogleMaps",
  "reviews": [
   "Washington Crossing has a variety of backdrops between historic houses and nature. It is particularly beautiful in the spring time when the trees begin flowering. If you go at the right time, its not crowded either. Overall, it’s a great place for family and maternity photo shoots.",
   "Worth the trip to understand just how close we came to not being a nation. You will have a new appreciation for those that fought for their country.\nAside from the history, it's a very scenic area.",
   "Easy parking, nice visitor center. Numerous things to see as you walked about. Fairly close to restaurants and little towns.",
   "The park is great. However I called first to make sure the tower was open on March 1st and was told that it was. I then drove 90 minutes from Reading to find out that it was in fact NOT open! Get your act together people!",
   "Beautiful state park picnic area the rivers right there and Jersey is a hop and skip away nice place to relax and and enjoy beautiful homes near by a lot to explore"
  ]
 },
 {
  "name": "Sayen House and Gardens",
  "address": "155 Hughes Dr, Hamilton Square, NJ 08690, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d2861a28-9334-11ea-b590-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=3099300708584410373",
  "source": "GoogleMaps",
  "reviews": [
   "What a great discovery we made today.  Beautiful gardens.  Peaceful walk around the area.  A beautiful pond with koi fish.  A marshy pond with tons of frogs mating.  I can't wait to go back when everything is green.",
   "Wow! Very very nice. A great place to spend a nice day. Recommend.",
   "Very nice place for an outing in the spring & summer. Nice scenery when in blossom season.",
   "Love this place. Even though it’s on the smaller size it’s absolutely gorgeous and my Lucy loves going for walks there. Not too much. Ran into such nice people too",
   "Lovely little park! I really liked the look pond especially, as well as the little winding paths. It looks like a lovely setting for a wedding on top of it (there was a wedding and baby photo shoot occuring while we were there). If you want a good place to photograph, I recommend this place. It must be beautiful in the spring especially"
  ]
 },
 {
  "name": "Amazing Escape Room Princeton New Jersey",
  "address": "3490 US-1 #15a, Princeton, NJ 08540, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d2e662dc-9334-11ea-9251-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=13646082042423386806",
  "source": "GoogleMaps",
  "reviews": [
   "Had so much fun at the escape room. We did the Knight's Quest and Jason was the most amazing game master! He had such a great energy and positive attitude. He kept us laughing and made sure we didn't give up! He gave clues at the perfect time without giving anything away or spoiling the fun of the game. We would highly recommend going to the Amazing Escape Room in Princeton and anyone who gets Jason as their game master is in for such a fun time!",
   "Very well done escape room.  We did the Speakeasy room with 8 people and although we didn't conquer it we all thought it was done very well and had a great time.  Staff was nice and helpful and we'd love to go back and try again.  No pictures allowed in the rooms, so I'm only able to post one of the area where they take your picture when you're done.",
   "What a blast!  We reserved 4 Escape Rooms for a team building event and folks had a great time!  Loved the guidelines/rules provided (folks can leave the room and the game still continues - no disqualification!) and the staff was very welcoming and engaging.  It's amazing how fast 60 minutes flies by!  Will, for sure, do this again!",
   "We had a wonderful time as a birthday gift  in the Pawn shop robbery experience. Arthur was a terrific host. We were 5in late but we're able to solve 5 out of 7 puzzles. Feeling proud. This was our second time. We enjoyed this one more than the great train heist!",
   "Helpful staff and a fun experience! The clues in the room tested our wits. The staff is able to keep an eye on us in the room and offer clues and entertainment with their sense of humor.  Could make for a great team- building activity. Can be hard to find this place as you drive or after you park."
  ]
 },
 {
  "name": "BAPS Shri Swaminarayan Mandir, Robbinsville",
  "address": "112 N Main St, Windsor, NJ 08561, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d336cd1c-9334-11ea-a277-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4270690918365586709",
  "source": "GoogleMaps",
  "reviews": [
   "BAPS is a very nice, new and peaceful temple. The architecture and design of both the inside and outside is very beautiful and marvelous. Inside of temple is made from all marble with incredible intricate designs. They have done an incredible job carving and constructing America's largest Hindu temple. The food court (cafeteria) is amazing, they have a very large variety of great foods at a cheap price. There are many volunteers who are all very friendly and the area is always kept clean. Love this temple and would recommend for everyone to check out.",
   "Marble architecture that makes this amongst the most beautiful temples made in contemporary times and  its so accessible is amazing. You don't have to be a Hindu to visit the temple. you can go to visit, just have to have reverence and respect for a place of worship and people around who are praying. you will see people of other races visiting. they provide audio tours. if you are uncomfortable find an Indian friend and take a trip. a must visit place.",
   "The architecture looked like a wonder. The vibrations of this temple is amazing. Very very friendly and kind staff. The cafeteria is just awesome. The crowd is managed very efficiently. Very well maintained campus. Plenty of parking space. A must visit place in USA",
   "BAPS Shri Swaminarayan Mandir is very nice and peaceful temple. The architecture and design is marvelous. Inside of temple is made from marble. It’s not easy to carve marble. But they have done incredible job. \nIt is not allowed to take pictures inside of temple but can take pictures from outside. It is not allowed to wear shorts or sleeveless blouse inside the temple else have to put wraparound provided in temple.",
   "Nice temple. Clean. Worth going and having a full platter of Indian gods. The canteen food is poor quality. Lot of insects and worms so beware. The packed food is fine but most of the Indian sweets are loaded with insane calories so it might crash your diet or workout results. Canteen is managed by some retired old men and they are not at all descent at the billing counter. Also the tray system sucks for picking up stuff. Over all architecturally it's amazing and the pond right outside is beautiful . The peacock I saw was just beautiful. Check out the pics"
  ]
 },
 {
  "name": "Rosedale Park",
  "address": "424 Federal City Rd, Pennington, NJ 08534, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d37cb128-9334-11ea-bda1-14b31f159f22.png",
  "tags": [
   "parks",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12445470787998778570",
  "source": "GoogleMaps",
  "reviews": [
   "Love this dog park! There's always lots of friendly dogs and people here. Plenty of space for everyone to run around! Gets a little muddy when it rains, but otherwise you can't find a better dog park.",
   "Well it a good place to let your dogs play with other dog, and get information of thing dog for dogs. I was at the park yesterday when a man( Sean ) with his dog came in the park. He had a power drill.  He went to all the picnic tables and fixed all the lose bolts. How nice of him, I guess that's pet people",
   "I love how many parks are throughout NJ. First time visiting this one. It was beautiful. Cool breeze and plenty of shade cover if need be. I will return, and recommend checking it out..",
   "Great walk. Easy to follow paths. Many options of short strolls to long walks.",
   "The playground here is amazing! My son loves it. It's very clean and in good shape. He loves to go down to the water and look for fish. We haven't been to the dog park but it looks nice too!"
  ]
 },
 {
  "name": "Core Creek Park",
  "address": "901 Bridgetown Pike, Langhorne, PA 19047, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d3c3f242-9334-11ea-9c16-14b31f159f22.png",
  "tags": [
   "kids",
   "nature",
   "walking",
   "walk",
   "walk",
   "kids",
   "parks",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=12364559890853480857",
  "source": "GoogleMaps",
  "reviews": [
   "I absolutely love walking around this park with my dog. Just wonderful nature. A nice lake to look at and enjoy plenty of picnic areas as well as playgrounds for the kids. Some restrooms on site if you know where to go. Definitely check it out fun for all bring your bikes plenty of trails as well.",
   "My dog and I love going here for walks. She enjoys running on the grass the most! She also likes the scenery and sometimes gets too interested in the wildlife. 10/10 would walk here again.",
   "This is a very nice medium sized park. The reason I take off a few stars is because it's full of plastic trash, under every Bush and tree there are bottles, bags and other garbage. I'm now bringing a bag with me regularly to pickup any trash I see here, hopefully over time it will become better. People please clean up after your selves! And pick up the trash you see around you!",
   "One of our favorite parks in the area. Never crowded, a variety of playgrounds throughout the park (my kids love that), lots of trails to walk, boats to rent, access to the lake, lots of athletic fields, and more. \nA great park that is right up the street.",
   "I take my daughter here regularly. Great place for a nice walk through the woods. Playground for the kids and nice lake to watch the birds and kayaks when it’s not too cold."
  ]
 },
 {
  "name": "Princeton Battlefield State Park",
  "address": "500 Mercer Rd, Princeton, NJ 08540, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d4119d78-9334-11ea-9847-14b31f159f22.png",
  "tags": [
   "walk",
   "historic",
   "knowledgeable",
   "historic",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=14015772682950869803",
  "source": "GoogleMaps",
  "reviews": [
   "Small but lovely park of enormous historical importance: the turning point if the Revolutionary War, where Washington was headed after he crossed the Delaware. The oak tree where general Mercer died during the battle finally have or a decade ago but is being regrown from one of its acorns. The park also connects to hundreds of acres of woods in the Institute for Advanced Studies, where Einstein used to walk.",
   "Very interesting.   Lived 10 minutes away my whole life and never knew it was there.  Would definitely luke to go again and see reenactment.",
   "Good historic park. You can get pre wedding shoot here as it will give you a good scenery and monument as background!!",
   "The battlefield guide was excellent. He brought the battle to life and painted an excellent picture. There's not a lot in the house but I really enjoyed the whole experience.",
   "I took one of their monthly tours yesterday. It was awesome! Both guides were extremely knowledgeable. It was my second time having Kim as one of the guides. He was my guide at another historic museum down the street. He really takes the time to answer your questions! If you do the tour though, I recommend bringing bug spray or wear long sleeves. I definitely will go back again and take my wife next time."
  ]
 },
 {
  "name": "Trinity Church",
  "address": "33 Mercer St, Princeton, NJ 08540, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d459564a-9334-11ea-9629-14b31f159f22.png",
  "tags": [
   "structure"
  ],
  "link": "https://maps.google.com/?cid=4368342860747927105",
  "source": "GoogleMaps",
  "reviews": [
   "Splendid and exquisite. I had an opportunity to attend the Christmas Eve service. It was beautiful.",
   "Beautiful church, welcoming congregation. Anyone can take communion.",
   "We are glad for this church and for the community! Very welcoming to all people, excellent choir! For someone looking for a liturgically oriented worship, this is the place!",
   "Richard Upjohn and mainly his son build this one in Gothic revival style. Richard Upjohn was associated with rebuilding of Trinity Church on Broadway and Wall Street. Beautiful and imposing structure.  ",
   "Beautiful church located in beautiful Princeton...Had a mist heart warming welcome..everyone very friendly and open..If you ate ever in Princeton stop in to see the Church.."
  ]
 },
 {
  "name": "White Hill Mansion",
  "address": "217 4th St, Fieldsboro, NJ 08505, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d4a188cc-9334-11ea-8f81-14b31f159f22.png",
  "tags": [
   "tour",
   "historic",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13279848065696839879",
  "source": "GoogleMaps",
  "reviews": [
   "You have to check website this place is open on specific datee and times. Guided tour cost $5. The volumteers are eager to answer your questions and will tell you of a few ghost stories. Definitely worth the visit",
   "We went here for the Krampus Bazaar. The building itself was a Paranormal investigators dream. The building definitely had a historic and spooky vibe to it. Almost every room was open to explore. The main 2 floors had vendors and to my surprise they were much more interesting than I expected. Kind of like a Punk Rock flea market quality of stuff if you have ever been.",
   "Great historical place.  I won't even spoil it for you but if you have any interest in history, the paranormal, mob related speakeasy, yoga, painting or just want something different to do, please check it out.   Such an interesting place.  Be sure to see when their open houses, special events or ghost hunts are.  It is worth it.",
   "Had a great time with ghost hunts USA!!  Thanks Rob for a great night",
   "itjust wanted to say your buitfull #love"
  ]
 },
 {
  "name": "Roebling Museum",
  "address": "100 2nd Ave, Roebling, NJ 08554, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d4f17db0-9334-11ea-9f98-14b31f159f22.png",
  "tags": [
   "family",
   "tour",
   "family",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=15664164009611752883",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great museum.  The staff is full of  knowledge about the Mill, The Roebling family and everything they did.  It is a fun little visit and you could spend a lot of time there.",
   "We took a large group of special needs adults to  The Roebling  Museum twice so far. They have a wonderful staff and are very accommodating. Our tour guide, (Caren Cronin), was amazing and customized the tour for each of our groups needs. Caren even modified the hands on bridge building portion of the experience to meet each of our groups abilities. Thank you Roebling Museum for a great day of learning and fun! 🌷",
   "So amazing - you owe it to yourself to go here. Ive lived here the past 30 years, and I didnt realize the impact Roebling had on the world. Its a great time! You need maybe 3 hours to see it all. Go and see yourself!",
   "We love this small museum! The Roebling story is amazing, and the more you know about the family and their achievements, the more interesting it becomes. The museum is not too visible from the road, but once you pass the gates, they have a good amount of parking. The building itself is is nicely organized, with well-constructed and informative displays spread out among the various rooms. One of my favorite things is a painting of the view from (what is now) a main door; it shows you what was there when the complex was full of large industrial buildings. They even discuss how the town was one of the first \"factory towns\" in America. I definitely recommend this museum for young and old. It's definitely worth the ride!",
   "Nice museum next to the Delaware river!"
  ]
 },
 {
  "name": "Howell Living History Farm",
  "address": "70 Woodens Ln, Lambertville, NJ 08530, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d536c880-9334-11ea-bb4c-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "walk",
   "knowledgeable",
   "family",
   "food",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1647184826322056401",
  "source": "GoogleMaps",
  "reviews": [
   "The last time I came here was 2 years ago and the place looks just like it did then.  Because there weren't any one else visiting at the time that we went we were able to get 1 on 1 treatment with the animals.  My children were able to fetch water as well as retrieve some eggs from the hens. They open up the barn so my kids could get out photo with the horses and also explained how to properly pet the sheep. will be back soon! awesome place to escape for free and let kids run around to breathe fresh air.",
   "A great family place to visit. Every volunteer is ready to share interesting facts about the animals on the farm. The food is made from what is harvested in the farm. Everyone is friendly and knowledgeable. On weekends, they have different stations - blacksmith, kettle popcorn maker, and horse pulled hayrides. The walk to that hayride is super enjoyable as there is no pavement and you walk on a simple county road and over a small creek passing beautiful evergreens. Don’t miss the chicken shed as you will know some interesting facts about hens.",
   "Magical!  My wife and I attended the honey harvesting but there is so much much more to this place. Friendly people and great farm animals to interact with. Highly recommended!",
   "Beautiful farm and history. I had my nephews ages 8 and 10 - we went on a week day. Not so exciting. Nice to see and pet the animals.\nI hear the weekends are packed with lots of fun.",
   "Really great place to visit for 19th century farm experience. They have a ton of stuff going on. We went in December for their Barn dance.  Had a blast! Watch their website for upcoming events. You won't be disappointed!"
  ]
 },
 {
  "name": "Six Flags Great Adventure",
  "address": "1 Six Flags Blvd, Jackson Township, NJ 08527, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d58ea8a4-9334-11ea-9b0e-14b31f159f22.png",
  "tags": [
   "unique",
   "parks",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3158725797388431174",
  "source": "GoogleMaps",
  "reviews": [
   "The Wonder Woman ride is probably one of the most unique rides and terrifying rides. I highly suggest it if you are looking for a thrilling ride that is not a roller coaster. Also I just enjoy the big roller coaster as their a variety of ones and they are all great rides.",
   "I've been going to Six Flags since I was very young and I think I've recently  been able to fully appreciate the greatness of this park. Fright Fest and Holidays in the Park are my favorite times to go. I'm a member, so I also enjoy visiting the other Six Flags parks and believe this brand does a great job at giving their customers a good time.",
   "Six Flags Great Adventure is so much fun!!! I so totally recommend this park for thrill seekers and for people who are just in for the amusement. I also recommend this park for those who are visiting New Jersey for whatever occasion you find yourself in! The Holiday in the Park is also pretty and the park looks beautiful lit up in all of those Christmas lights! I also recommend going in the spring or summer as well! Overall, an awesome park with some thrilling rides!!!",
   "Not only is the park itself amazing in Six Flags, but so it the positive attitude thats goes around. This is my first ever job, and the way I am treated here is making me love it. The company is so generous and gives plenty of benefits. There is no better place than Six Flags Great Adventure.",
   "This place is one of the best 6 flags I have ever been to. They have amazing rides and even a safari! The park is huge. So big that the water park is not even connected to it. I loved the safari! I saw so many animals and it’s nice that they give you and option to get out at the half way point to visit with other animals in a museum type area and there is drinks/ food at this stop too. One more thing the food is really good at this six flags too so much to pick from here."
  ]
 },
 {
  "name": "Columbus Farmers Market",
  "address": "2919 US-206, Columbus, NJ 08022, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d5cff770-9334-11ea-966d-14b31f159f22.png",
  "tags": [
   "winery",
   "wander",
   "cheap",
   "family",
   "food",
   "food",
   "walk",
   "kids",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5141865212988270161",
  "source": "GoogleMaps",
  "reviews": [
   "I come here mostly for the Amish market, which is great. I shop there for both ingredients and prepared foods. If there's time, I stroll around through the rest of the building but I usually don't buy anything because I'm already loaded up by that time. It's an older building with odd bumpy floors and a random assortment of stores. If you explore, you're sure to find something that interests you, and something that turns you off. As I mentioned, I don't do much else there except wander. With the exception of the winery -- I really enjoy their Mead. Oh and the produce stands across the parking lot. Great stuff. I never go on the weekends in summer so I can't report on the flea market. One day I'll get there. To avoid crowds, and to maximize the selection of donuts, best time to go is around 9 or 10 am. on a Thursday or Friday. It gets super crowded at lunch, and donuts fly off the shelves. 😁🍩",
   "It's busy but it's an awesome place to check out cheap products if all kind. All kinds of good food vendors in one place. Fun family outing for the day. Very dense with people so keep eyes on your little ones!",
   "Great place to shop when you are looking for some deals and discounts. Many shops to choose from, weekends are always packed and it's best to get there a head of time, friendly owners and it even has a food court if you need a break. My only downfalls for this place is that it's dated and isn't always clean. I feel if they added some new paint colors or add some flare to the place it would make it a little easier on the eyes but otherwise those are my only gripes with the place. I would recommend shopping here, even if you are just looking for a flea market and not outdoor vendors.",
   "They are the Best. You can Pretty much find everything you are looking for. Also, it was always a pleasant experience to weather you are buying or selling there. Weather you are New Or Used the Prices for a Table Are Reasonable. That used to be our Saturday morning date. We would get hot chocolate walk around shop & talk. It was great. That was our Special Time Together Alone Away from kids etc. OMG Columbus Market How we Miss You! We will be back when are out that way, for Sure!",
   "Lots of good stuff here.  Buy it's the food that brings me here most often.  Pete's pizza,  the Amish Market with roasted chickens and delicious, fall of the bone ribs. Excellent Korean place, Mexican, Polish, sandwiches,  one of the best fried chicken places around.  All good and reasonably priced."
  ]
 },
 {
  "name": "Princeton Battle Monument",
  "address": "55 Stockton St, Princeton, NJ 08540, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d61cb808-9334-11ea-96ca-14b31f159f22.png",
  "tags": [
   "drink",
   "history",
   "historic",
   "history"
  ],
  "link": "https://maps.google.com/?cid=11242707185251070466",
  "source": "GoogleMaps",
  "reviews": [
   "Nice memorial located near the Morven House. Could use a nice cleaning (as of January 2020) but it is still a nice memorial to visit. There are a few other memorials and plaques near by, including a new one for Einstein.  The Peacock Inn is located nearby which is a nice place to stop in for a drink.",
   "I love history and taking photographs its located down from the university(middle of town)",
   "Very cool historic spot with additional surrounding sculptures and museums. We came a bit too late for the museums to be open so there's not much time to be occupied in this particular spot, but it's not far from the shopping district and many other streets with very old architecture to see.",
   "Beautiful monument. Good place for a photo opportunity in Princeton.",
   "I liked the outdoor experience and the monument was nice. Worth seeing and learning about the history."
  ]
 },
 {
  "name": "Washington Crossing State Park, NJ",
  "address": "355 Washington Crossing Pennington Rd, Titusville, NJ 08560, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d666b99c-9334-11ea-b6e2-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "historic",
   "nature",
   "walk",
   "history",
   "history",
   "structure",
   "history"
  ],
  "link": "https://maps.google.com/?cid=11729583531165963548",
  "source": "GoogleMaps",
  "reviews": [
   "The visitor center had some nice exhibits of period costume and hardware used. There was a lot to read and learn about the area and the major people involved in the preparation for, completion of the crossing of the Delaware and the raid on Trenton.\n\nA US history buff will not be disappointed!",
   "New Jersey side of Washington Crossing Park. There is a visitor’s center here with a few historic buildings but this is more of a park than the Pennsylvania side. Here there’s a nature center and trails. Interesting tidbit is to be careful with your waste. No garbage cans. Pack in. Pack out. Even if you’re just parking your car for an afternoon lunch. Plenty of picnic tables under shady trees.",
   "Great place to just enjoy the day and some nj history! Great place for a long walk and great exercise!",
   "A lovely park. Friendly and informative staff at the visitors' center. Amazing Rev-War collection and display. The Johnson Ferry House is a rare treasure from the Rev-War period; the only structure on either side of the river that actually witnessed and was directly involved in the history Crossing for the Battle of Trenton. The interpreters at the Johnson Ferry House really know their stuff!",
   "For students of the American Revolution this is a must see. The park has interesting trails and a great view of the river crossing area. For hikers and those interested in history it is worth a visit."
  ]
 },
 {
  "name": "Pennsbury Manor",
  "address": "400 Pennsbury Memorial Rd, Morrisville, PA 19067, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d6b8aa98-9334-11ea-9926-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "unique",
   "tour",
   "history",
   "kids",
   "historic",
   "field",
   "knowledgeable",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15946394087225749764",
  "source": "GoogleMaps",
  "reviews": [
   "What a fantastic, peaceful time.  Haven't been since I was a kid and I still love it.  I took my wife and my son for their first time and they both loved it.  The staff is super friendly and very knowledgeable.  We will definitely be returning!!!",
   "A great place for a visit on the shore of the Delaware River. Our super cool and unique tour guide Kelly gave a fantastic tour filled with interesting historical facts about the history here   . Part farm and part re- created estate , Kelly led us across the estate from the visitors center and through the manor house and then into the kitchen house. A must see if in the Morrisville area!!",
   "Amazing hidden gem! The land it is built on is just as interesting as the Manor. As much info as you want and room for kids to run around. Farming, blacksmith and cooking demonstrations happening in the day we went.",
   "Wonderful historic site to visit, especially bring your animal lover as they have a working farm. A beautiful property with great character preservation.",
   "Great history here. Staff is knowledgeable & helpful, although noticeably weary from year-end school field trip frenzy."
  ]
 },
 {
  "name": "Princeton University Chapel",
  "address": "Princeton, NJ 08544, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d7014c5c-9334-11ea-b770-14b31f159f22.png",
  "tags": [
   "music",
   "learn",
   "library",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=18085396507726204118",
  "source": "GoogleMaps",
  "reviews": [
   "Chapel is not an appropriate word for what seems more like a cathedral of the first order! This church is staggeringly beautiful! I popped in while musicians were rehearsing for Wed. night \"Jazz Vespers\". It was so awesome to hear such impeccable music echoing off the walls of this spectacular building!",
   "Felt like  nostalgic place. It's like once upon time.....ohh..not boring you guys...but 2 decades back graduated from second oldest engineering college of India and today visited one of the finest Universities of USA. It gives an immense feeling of \" back to school\"....this  chapel is crown of the university campus.",
   "Beautiful, historical and simply an ideal place for knowledge.\n\nI can't imagine how being a student here could feel. If you come here and you don't learn, you are a plant.\n\nMuseum, library, dormitories, sports facilities, coffee shops, everything.\n\nI'd say you can survive here without a car because they are bicycle friendly, but not sure, there are some places around that a student would like to visit like kayaking places.\n\nKnowledge is in the air here. Of course an opinion from an actual student would be required, but as a visitor I was impressed.",
   "Beautiful chapel. Went for my daughter's high school Big Sing. Sound was fantastic. The whole experience was beyond words.",
   "Great tour, hard to get into (4-6% acceptance rate). \nBeautiful campus, undergraduate academics and such history!!"
  ]
 },
 {
  "name": "Tyler State Park",
  "address": "101 Swamp Rd, Newtown, PA 18940, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d7549ca4-9334-11ea-824a-14b31f159f22.png",
  "tags": [
   "walk",
   "parks",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7721265878703504562",
  "source": "GoogleMaps",
  "reviews": [
   "Definitely one of my favorite local parks! There’s both cement and gravel trails for hiking or biking. Everyone comes here to walk their dogs. I wish it wasn’t so congested at times but it’s a big park to explore and get some exercise! Plus they have some fun rental stuff like SUPS, kayaks and canoes. There are pretty regularly horses in the park, so be prepared to stand clear of them if they’re walking by.",
   "This park is absolutely beautiful. It is well manicured and taken care of. I always enjoy coming here. It is clean and safe. The bathrooms when open are taken care of. I absolutely adore coming here and will be visiting many times in the future.",
   "Beautiful park! It has everything you need in a park. It’s frisbee golf course is challenging and beautiful! It’s a large park that gives room for people to space out.",
   "This is a huge park and very good to walk your dogs at. Theres tons of diffrent trails on all sorts of hills. They have horse trails and you can go canoeing in the creek too. They have big picnic areas and dams to take cool pics near. They have restrooms and several benches to rest your feet. The park has a covered bridge you can walk through and several old farmhouses to look at.",
   "So pretty and well kept.  The disc golf course is awesome.  Challenging and fun without being discouraging."
  ]
 },
 {
  "name": "Morven Museum & Garden",
  "address": "55 Stockton St, Princeton, NJ 08540, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d79acdba-9334-11ea-b0fb-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "tour",
   "history",
   "walk",
   "tour",
   "history",
   "art"
  ],
  "link": "https://maps.google.com/?cid=4975016950220494538",
  "source": "GoogleMaps",
  "reviews": [
   "Morven Museum is a beautiful spot. I came for the Roosevelt exhibit and was very impressed. It's really great to dive deeper into our local history... makes you appreciate your surroundings much more. I collect pins and was happy to see a pin honoring their  festival of trees. Easy to find. They have on site parking, but we parked in Palmer Square and enjoyed a nice walk over.",
   "Paid for a tour here and I guess I expected way more than was there. When it says “gardens” I think: multiple, lush, gardens that offer a variety to enjoy. But this really is one garden that’s the size of a very small backyard. I was really surprised given the advertising and website just how tiny it was. There are 2 smaller gardens that have veggies as well, but they are mini gardens at best. Honestly, if you aren’t really into local history and just dying to see a tiny garden (and not the original one- those garden plans have been lost), I would skip it.",
   "A nice museum in a colonial period house. Good place to visit if you are interested in local history or the Revolutionary War. I would recommend taking the tour as the guides are friendly and knowledgable. But you are also able to explore the house yourself and there are plenty of displays that will walk you through the history.",
   "I love going here for The Festival of Trees every Christmas.  So beautiful!",
   "Beautiful, Historical. New Art Gallery upstairs has a very moving Civil Rights collection!"
  ]
 },
 {
  "name": "Hopewell Valley Vineyards",
  "address": "46 Yard Rd, Pennington, NJ 08534, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d7de8d9c-9334-11ea-93b6-14b31f159f22.png",
  "tags": [
   "music",
   "winery",
   "knowledgeable",
   "family",
   "hospitable",
   "music",
   "family",
   "knowledgeable",
   "tasting",
   "winery",
   "art",
   "music"
  ],
  "link": "https://maps.google.com/?cid=5031439134329903620",
  "source": "GoogleMaps",
  "reviews": [
   "A very nice spot. I didn't get to see it in the day but would go back to check it out. Tried two wines that were pretty good. Live music was fun and staff were very nice too!\n\nNot to get too picky but the driveway could be better lit as well as the entrance area from the road.",
   "Really nice vineyard. Very beautiful grounds and nice interior. The wines we tried were very good. All around great experience.\n\nIdeal for couples or small groups.",
   "My family and I visited Hopewell Valley Vineyard on 12/31/19. To say that we had a wonderful time is an understatement! James was friendly, knowledgeable, hospitable and kind.  He is a true asset to the winery! We had such a fun time and will definitely return soon! Thanks, James! 😀",
   "Wine was ok. The atmosphere their was real cozy. They do alot of live music during the weekend.",
   "Family owned and operated winery in Hopewell NJ.\n\nEasy access from Rte 31.  Picturesque grounds with good views year round.  Large crushed red stone parking area. Can be messy if wet.\n\nBeautiful tasting room with exposed stone and seating for ~50 ppl.  Upper room with retail offerings, good for small parties.\n\nStage area with live music, decent acoustics.\n\nVisual Art of various styles is usually on display, most of which is for sale.\n\nStaffed by a knowledgeable and willing to assist team.  After several choices I settled on a red blend that reminded me of light \"chianti.\"\n\nI enjoyed a fresh made Sicilian Pizza with Salami (Pepperoni)\n\nFair prices and a little bit of a wait, but worth it."
  ]
 },
 {
  "name": "Neshaminy State Park",
  "address": "3401 State Rd, Bensalem, PA 19020, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d8264566-9334-11ea-b7e0-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walk",
   "kids",
   "field",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=7516380802006931726",
  "source": "GoogleMaps",
  "reviews": [
   "It typically gets a little busy by the parking lot, even on weekdays. Lots of people enjoying barbecues or having kids birthday parties. Once you walk the trail a bit you see less people. The little shore is nice, and the Philadelphia skyline is beautiful. If you walk the full trail around it’s a perfect distance for someone like me (who isn’t very athletic or..... walkative.) There are maps by the front. There is a “scenic overlook” that isn’t very scenic, but the overall walk is very pretty and enjoyable. If you show up earlier in the morning there are sometimes deer. Also a great place to take photography.",
   "Neshaminy State park is small it needs to commandeer 2 miles south past the campsite for the future the government has the money and it will give the federal government the ability to protect the waterways forever long past my day.... could use 100 Boy Scouts to clean up the debris low tide River's Edge by having a natural buffer you will create a Nature's Jewel.",
   "I went there for the 1st time yesterday. I actually really enjoyed it. There's a lot to do and a lot to see. I just can't wait for the summer for when the trees are green. It's very clean. I would definitely recommend coming here to anybody that is looking for a park to go to. Especially if you're into photography.",
   "Great place to go with the kids or just with my camera. Lots of wooded area with wildlife. Also trails that go right down along the Delaware River. Can walk the trails bring the kids bike/scooter and ride the paved areas. Either or it’s a relaxing place and close by.",
   "One of my favorite places ever. Beautiful river views, plenty of winding trails, a large open field for recreation, and safely patrolled. It's easy to forget that Philly is only a couple of miles away, as Neshaminy is so heavily wooded.  I often spot deer, beavers, and other forest critters during my visits. I especially enjoy walking my dog along the river beach.\n\nWeekends and summer holidays this place is jam packed, so I recommend visiting Neshaminy on weekdays and cooler weather weekends and other off times."
  ]
 },
 {
  "name": "Bowman’s Hill Tower",
  "address": "1 Tower Rd, New Hope, PA 18938, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d87ddb4a-9334-11ea-8aa4-14b31f159f22.png",
  "tags": [
   "free",
   "free",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=18427829866364563746",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful Morning Fall adventure location!  Got there right when the park opened. Make sure you bring a pair of binoculars - or ask to borrow a set when you purchase your ticket ($7 admission - borrow binoculars for free by leaving your license/ID with the visitor center staff). Swing by the Washington’s Crossing visitor center on your way out as well. It’ll give you the full experience. Highly recommend the visit. Great view of the Delaware River Valley.",
   "Very beautiful place. Feel like the fee to go to the top of the tower should be free. Comparing it to other places with high elevation and view. But I had fun and enjoyed the view of the river",
   "Loved the views,  office was closed so we couldn't go up even tho it was listed as open on the web",
   "Perfect place to go to see fall colors! Take your drone if you have one. You won't be disappointed.",
   "This place is so pretty. You can see really far into the surrounding area and during the Fall, it is absolutely gorgeous. The view alone is worth it but seems like a nice place to hike if you like uphills"
  ]
 },
 {
  "name": "Maclean House",
  "address": "Nassau St &, Elm Dr, Princeton, NJ 08544, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d8d34fb4-9334-11ea-9125-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=13165506250520102618",
  "source": "GoogleMaps",
  "reviews": [
   "Aaron Burr was a baby while his family occupied this house. Aaron Burr Sr. And the his family were the first occupants of this house. \n\nFits architecture is Philadelphia Georgian. ",
   "Very clean very well maintained. Beautiful building",
   "Really cool",
   "",
   ""
  ]
 },
 {
  "name": "New Hope-Lambertville Bridge",
  "address": "W Bridge St, New Hope, PA 18938, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d932faf4-9334-11ea-9903-14b31f159f22.png",
  "tags": [
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=7682161444936105523",
  "source": "GoogleMaps",
  "reviews": [
   "Love to go there and just walk around. It is so beautiful and peaceful but most of the time crowded",
   "Walking over the bridge provides scenic views  from both NJ and PA. Perfect for a quick day trip.",
   "Love the area I live in... I love my home ♥️",
   "Amazing, Beautiful towns of New Hope and Lambertville are a must visit for all",
   "Nice place with small shops, restaurants. Ideal for evening walks in summer."
  ]
 },
 {
  "name": "The Funplex",
  "address": "3320-24 NJ-38, Mt Laurel Township, NJ 08054, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d97b75be-9334-11ea-9710-14b31f159f22.png",
  "tags": [
   "drink",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=3317765312087534111",
  "source": "GoogleMaps",
  "reviews": [
   "Just had my daughters birthday party there yesterday she turned 12, was displeased because my reservation confirmation said 4:30-6:30, our party host made us clear everything out by 6 let me know at 5:50 things had to start going because there was another party coming in and she had to clean up, there also was only one slice of pizza and one drink cup provided for every hungry/thirsty child that plays for hours. Pizza is not that expensive they can afford to provide each child a minimum of 2 slices if they desired plus a slice for the only 4 adults that came to partake in my child’s birthday party. Would not recommend this place for a birthday.",
   "One of the best staff ever! I decided to take my little sister to The Funplex and it was the first time for both us, everyone was so helpful especially Kaitlyn Walter she helped me and my sister a lot :) Overall a great experience! 10/10 recommend if you’re trying to have some fun.",
   "Had my younger sister's birthday party here. It went wonderful! Staff was great, arcade is really cool, you're actually able to win stuff from the crane machines, I was happy with that.",
   "We had my daughters 7th. birthday party here today. The ladies did a great job organizing the events. The kids had a blast and my daughter had a great party. Definitely recommend this location.",
   "I just had my daughters party there the other weekend. I had an extremely good experience with a lovely girl named Brianna she was an amazing party host. But I would have to say a girl named Haley was absolutely so rude. One of my daughters friends had went up to her to ask a question and she was extremely unprofessional and rude. Just from that experience alone I would say I would never come back but the lovely young lady Brianna saved the day I will only be back because of her and if she is available to be my daughters party host!"
  ]
 },
 {
  "name": "Historic Smithville Park",
  "address": "803 Smithville Rd, Eastampton Township, NJ 08060, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d9ca594a-9334-11ea-875a-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "walk",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=15879845731699242222",
  "source": "GoogleMaps",
  "reviews": [
   "A beautiful treasure in Burlington Country.  Tons of parking and if you select the wrong one it's an easy walk to the right location .   They have a filled schedule of activities throughout the summer for all ages.  Check their website out for more details.  If this review was helpful please give it this thumbs up.",
   "Great park, nice trails, you can be in the woods, open areas, take a kayak ride, bring dogs, explore the old buildings on site.  Very clean and well kept park!!",
   "Absolutely gorgeous! Can't wait to see all the leaves change. Only thing I wish there were more of is bathrooms. The public bathroom is just one toilet, no stalls. It is very clean and comfortable but it's inconvenient when you're walking the trails. A port-a-potty in the parking lots would be great!",
   "It's so quite and there's a lot of trails you can take. They have picnics and baroque there plus there a playground for kids. My favorite trail is the green trail, you get to walk across a long bridge.",
   "Beautiful, scenic and clean park. Perfect for a stroll with your dog, as a family or simply by yourself for some meditation. I enjoy the butterfly garden and trails. Playground area for the little ones is also a bonus!"
  ]
 },
 {
  "name": "Institute Woods",
  "address": "Princeton Pike, Princeton, NJ 08540, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/da1f3050-9334-11ea-a31b-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "history",
   "nature",
   "walk",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=3559162716592469398",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful area to walk around. Lots of nature and also history. This is the area through which Washington's army marched on their way to Princeton. The battlefield is nearby. You can walk dogs here and it is a fun place for kids.",
   "Very nice park. The suspension bridge was a nice surprise. Can definitely get muddy after a lot of rain. But very nice overall.",
   "Beautiful trails through the woods makes for a wonderful afternoon walk. Great place for families and Kurds to explore nature.",
   "Great for running, watch out for mud",
   "Make sure you have a map or gps on phone. It is muddy, but worth it. Absolutely love it here. Woodlands to meadow with great views of farmland."
  ]
 },
 {
  "name": "Historic Smithville Mansion",
  "address": "801 Smithville Rd, Eastampton Township, NJ 08060, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/da690ac0-9334-11ea-b72b-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "hike",
   "walking",
   "historic",
   "walk",
   "kids",
   "historic",
   "walking",
   "nature",
   "comforting"
  ],
  "link": "https://maps.google.com/?cid=14987789520091320321",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely Beautiful Park.  Great walking trails and very clean.  Play park for kids.  Barbeque grills available and you can rent space for parties as well.  There is a beautiful butterfly garden in the warmer months.  Just a great place for a walk  hike or a run.",
   "Great trails that are fairly level and interesting. There's a floating bridge that is both scenic and has some interesting historic details of the area. Have been there three times in the past couple of weeks. Dog loves it too.",
   "It’s my first time walking in this park. There are easy and short trails & lakeside boardwalks to walk with some historic sites to see. There’s a pretty size of playground for kids to play with seating for parents to watch. And there are lots of seatings around the park. There are also some kayaking access to Rancocas Creek. See some of the pictures I posted on Google Map.",
   "I love Smithville, go there every chance I can and usually lots of beautiful pictures are taken there.\nNature walks and relaxing n sometimes even barbecuing... Time well spent for sure 👍🏽😊🤩",
   "Serene and comforting place.  Historical balm for the soul. A NJ gem."
  ]
 },
 {
  "name": "Falls Township Community Park",
  "address": "9050 Mill Creek Rd, Levittown, PA 19054, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/daac2ea2-9334-11ea-b547-14b31f159f22.png",
  "tags": [
   "walking",
   "unique",
   "family",
   "kids",
   "walk",
   "field",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9189167481805791133",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice place good walking path/biking path. Very nice dark park. Very Nice Playground area and skate boarding area..Nice patrolled area area rangers. A nice little boating ramp and fishing lake with a nice dock. Over all a nice local park",
   "Nice path around the lake and pavilions to reserve for family events.  Bathrooms were clean and stocked when I visited. Skate park makes it a unique destination if you're into that.",
   "Good place to take kids if you are looking to get them out of the house. Or just get out yourself. I love this park!",
   "I love this park across our apartment complex. I take my dog here every morning he loves to swim in the lake and power walk with me in the 3.23 mi loop around the lake and the field. He also enjoys meeting new friends in the dog park that's open from 930am till sunset. In the weekend my husband and i go kayaking or fishing in the lake we don't have drive far to go kayaking! Great for family and friends! The rangers are so friendsly as well. \n",
   "Beautiful 2 mile path around the lake."
  ]
 },
 {
  "name": "Burlington County Prison Museum",
  "address": "128 High St, Mt Holly, NJ 08060, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/db03768c-9334-11ea-aa46-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "history",
   "knowledgeable",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12477921275304944170",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to visit and learn about Burlington County Prison history, we took our children and they learned and enjoyed the experience as well.",
   "We had a great time! Very interesting and filled with lots of history. Highly recommended if your into historical places.",
   "It was a great experience for me and my children.",
   "Such a cool place to explore. Went there on a saturday and the gentleman working the front desk was incredibly knowledgeable,  friendly, and helpful! Worth checking out!!",
   "Been there for a facility tour and for a paranormal investigation. Such history and stories."
  ]
 },
 {
  "name": "Adventure Aquarium",
  "address": "1 Riverside Dr, Camden, NJ 08103, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/db511b9e-9334-11ea-9f85-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "eat",
   "food",
   "drink",
   "kids",
   "food",
   "kids",
   "eat",
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2298813021411118508",
  "source": "GoogleMaps",
  "reviews": [
   "This is a decent aquarium. It has a nice tunnel to walk through and the kids really enjoy the shark bridge, a webbed net bridge you walk over the shark tank on. They also really liked petting the sharks in one of the touch tanks. The problem is for the price you get less than you do at other aquariums. This is probably due to it being a fire profit rather than a nonprofit business.\n\nIt seems like they give lots of opportunities to spend money, more so than is typical. It feels like that takes away from part of the experience. They also do not seem to worry too much about meeting their own published schedules. Numerous things were late or seemed to be fine as afterthoughts.\n\nOverall it is a fine place to visit once or twice\nI would not see wanting to keep going back like I do most aquariums.",
   "It was a perfect size for our little guy. Our two teenagers zipper through it pretty quick. It has a little bit of everything. The wait outside was long, but it moved quickly. You have to go through the metal detectors, so when it's cold outside, it can feel like the process is taking forever. Once your inside, it's quite warm. We did not eat there, but it looked like basic kid friendly food. It was pretty crowded at some spots, but not unbearable.",
   "Best experience for me and my kids it was my first time to an Aquarium and i highly recommend!!! it’s beautiful fun for parents an kids food was great I recommend ordering the tickets online through there website we got the meal an drink added with it made the day perfect after a fun filled day. Super fun u won’t regret it parking is $10 for the day. I’ll definitely be back loved it an so did my kids. Loved the shark tunnel",
   "Love coming here on weekends for the kids to expand their minds learning about aquatic life. We got season passes which I highly recommend. This place is great for kids of all ages only down side is the food and gift shop is extremely highly priced so eat before you go and skip the gift shop if you don’t want to spend $20 for one item.",
   "Very nice! Since we went on a week day it was not too busy, even with kids on spring break. I loved how you could touch some of the animals and the shark tank was cool! The turtles we showing off.😊"
  ]
 },
 {
  "name": "Monmouth Battlefield State Park",
  "address": "16 Business Route 33, Manalapan Township, NJ 07726, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/db941836-9334-11ea-a434-14b31f159f22.png",
  "tags": [
   "hike",
   "kids",
   "walking",
   "walk",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2685193433351990577",
  "source": "GoogleMaps",
  "reviews": [
   "Bee going here ever since I was a little kid! Reenactments where always a highlight, and the museum is fantastic, with a great view of the majority of the park. Fun for light hikes all year round with well maintained trails. You may see all manner of animals as well from deer to foxes. A tip: popping on over to battlefield orchards when the hike is done is always great.",
   "One of the largest battles of the American Revolution took place in the fields and forests that now make up Monmouth Battlefield State Park. The park encompasses a playground for the kids, trails for light hiking and bicycle riding, picnic areas, a restored Revolutionary War farmhouse and a visitors center.\nThere is also the Battle of Monmouth Reenactment which is an annual event held each June at the park. Children can also participate in the cannon and musket drill that day. A treat for the young and old.\nNote: There are stations with plastic bags for the owners to pick up your furry babies poo. There are plenty of garbage bins for you to throw it away.",
   "Very beautiful historical park.  Informative display and movie in the visitor center, with friendly staff as well. Wish their were dedicated paths leading down to the battlefield, only because I felt bad walking on the grass. Definitely worth the visit.",
   "This is 1 of the most beautiful places I have been to in NJ.  I took so many beautiful pictures of my kids there.  The Apple orchard on the Battlefield is a welcomed byproduct as well, although the saving grace of it all is the ambiance.  Everyone should take a walk here in early fall.",
   "Great historical park and really educational. Neat place to visit even if history isnt your thing. Perfect place for a picnic too!"
  ]
 },
 {
  "name": "Parx Casino",
  "address": "2999 Street Rd, Bensalem, PA 19020, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dbdfa05c-9334-11ea-8785-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=9768216460368420707",
  "source": "GoogleMaps",
  "reviews": [
   "If you're looking for a place to unwind on a Saturday prax offers an excellent alternative. After a wonderful day with a good friend we decided to stop off and try our hand with the slots. It was a great way to spend an hour and I was happy to see my friend leave with more than he came. The energy that you feel in a casino with all the lights, colors and sounds is palatable. It makes for an excellent distraction for a few hours. Enjoy!",
   "Great atmosphere. Plenty of room to move around. Drinks are free and not watered down. The food is amazing. Variety of slots to choose from. You will and can win at slots. Haven't tried the table games yet. But people seem to be having fun playing them. Be a winner in no time and go to the Park. You won't regret it.",
   "Clean establishment, cocktail waitresses are very nice and prompt. Food is amazing and if you keep up with the player perks you get some really good rewards. They have valet parking which I've never tried and the only down part is the ID check before entering the floor. I've had to return back to my car a couple times before because I forgot.",
   "Best Casino by far in a 200 mile radius. Your first impression when strolling on to Park is...WOW! Has a young and hip vibe for sure. They are professional. Pay promptly and offer multiple payout options. Thanks Parx Casino!!! 5 Stars....",
   "Its a large open space. Has lots of slots and a huge table playing area. Staff are friendly and they actually compensate you for playing sending out free slot plays and comps monthly. Very neat. Bathrooms are up to fancy. Service is exceptional. One of my go it's when i want to play!"
  ]
 },
 {
  "name": "Peace Valley Park",
  "address": "230 Creek Rd, Doylestown, PA 18901, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dc227782-9334-11ea-8c8f-14b31f159f22.png",
  "tags": [
   "family",
   "walking",
   "family",
   "walk",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=85995978270932312",
  "source": "GoogleMaps",
  "reviews": [
   "Great county park to spend the day with the family or walking the dogs. This place is well maintained and typically very clean. Great walking paths that get you close to the water or out in the middle of the woods. The boat rentals are not bad (just get their early or be prepared to wait during the weekends). They also have a few playgrounds for the little ones. Great place to watch the sun set or rise!",
   "A great place to get some exercise on the trails, both paved and unpaved. Great place for a family picnic, small group gathering or just by yourself. It has become very popular and the biggest problem is adequate parking area on busy weekends. Otherwise a great place to get some fresh air and sunshine.",
   "I've been going here since I was a boy. Paddleboat rental in the summer, feeding ducks in the winter. Plenty of space. I actually take my children there now. Whenever the sun shines my daughter wants to go to the lake!",
   "What an amazing place for a walk, jog and or run! As the name mentions, Peace Valley Park is certainly a peaceful place. Great place to unwind and clear your mind. Whether it’s by yourself, or with family and friends, this is a place to check out if you’re in the area. It’s a hidden gem.",
   "Peace Valley has been the park I go to with friends and family as long as I can remember. The trails are well kept and the bike path is clean. I have always loved coming here and I am sure that won't change anytime soon."
  ]
 },
 {
  "name": "Drumthwacket Foundation",
  "address": "354 Stockton St, Princeton, NJ 08540, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dc66f982-9334-11ea-b760-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "tour",
   "tour",
   "history",
   "historic",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1123939753367947487",
  "source": "GoogleMaps",
  "reviews": [
   "The Holidays at Drumthwacket 2019 are the Best!!  Please go online and register for free tickets.  Every year, the talented members of the New Jersey Garden Cub decorate using fresh arrangements and greenery that compliment the architecture and decor of each public room....truly amazing!\nThis year the chef prepared crumb cake and ginger snaps accompanied by mulled NJ apple cider and hot chocolate...way delicious!!  I belong to the Allentown Garden Club and we decorated the Governor's Study...make sure you visit this outstanding room.",
   "Beautiful grounds with extremely friendly staff and the troopers on site were extremely friendly. Really enjoyed my tour throughout the house. I look forward to becoming the next Governor of New Jersey and moving in here someday!",
   "Fantastic tour and  history if you are ever invited.",
   "Beautiful historic site for sitting NJ Governor to use.  Enjoy Christmas decor the most here.  Fireplace is like a scene from Scrooge.",
   "I like that place good for family n friends. Princeton shops close by."
  ]
 },
 {
  "name": "Fonthill Castle",
  "address": "525 E Court St, Doylestown, PA 18901, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dcab2e50-9334-11ea-923a-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "knowledgeable",
   "tour",
   "knowledgeable",
   "tour",
   "history",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=1043323807035820397",
  "source": "GoogleMaps",
  "reviews": [
   "Everyone from the moment I entered was super friendly and knowledgeable. My tour guide whose name sadly escapes me now was amazing. I was fortunate enough to get a one on one tour as it was a weekday afternoon but I had a blast. Seeing the castle and understanding more about Mercer's legacy was really awesome. Had no idea the castle even was here in PA but glad I stumbled across it in my travels. Thanks again to everyone who made my experience fantastic. Highly recommended!",
   "My interior design class took a trip here and the Moravian tile factory. It was definitely worth the drive and everything and every room was beautiful. One of the first rooms we walked into opened up with a beautifully tiled ceiling. It was absolutely amazing",
   "The castle was so cool! We loved it. Our tour guide and the entire staff was very knowledgeable as well. I don't want to spoil the looks of the castle but it definitely is a must-see for a great price. The tour lasted for around an hour to an hour and a half. The only suggestion I will make is that there really should be a minimum age requirement. There were a couple of very young toddlers in our tour group which was very distracting, and they were running around and crashing into displays. It really is not a safe environment for young children or for the castle itself, as children like to play around and touch things. Other than that, its an awesome trip!",
   "Fonthill Castle was very interesting. I did not know much about Mercer before going here. The tile work on display was fabulous. The type of the castle was great too.",
   "What a terrific experience! Fonthill castle is an amazing place with tons of history. The tour cost was very affordable and the tour was so good! Our tour guide Kevin was so knowledgeable and friendly! I highly recommend taking the tour!"
  ]
 },
 {
  "name": "Battleship New Jersey",
  "address": "100 Clinton St, Camden, NJ 08103, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dcf0c2f4-9334-11ea-af1c-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "knowledgeable",
   "tour",
   "kids",
   "walk",
   "tour",
   "kids",
   "history",
   "historic",
   "history"
  ],
  "link": "https://maps.google.com/?cid=11001799642450627255",
  "source": "GoogleMaps",
  "reviews": [
   "This place is amazing. We went on a self guided tour and it took us 4 hours to complete. The ship is very well maintained and is so rich in history. I loved climbing through to different areas and seeing different things round every corner. My personal favorites were the barber shop, brig, dental and surgery area. The staff was incredibly kind and helpful. The gift shop is awesome as well. I can't wait to go back.",
   "My son and I went with the cub Scouts and had a great time.  What a magical experience.  The staff was excellent, without exception.  Knowledgeable and willing and excited to answer every question a six/seven/eight year old had to ask.  The faces while we had a guided tour were awesome.  Both kids and adults.  I would not hesitate to go back.",
   "It is a great historical place to visit. Layer out very well. Self guides your gives you the opportunity to look at things more than once. Plenty of seats along the way ... it is a long walk ,Just a  Heads up.  Pretty cool to stand in places the Admiral stood and to see Admiral's, Captains quarters, Crew quarters and gun turrets and Helicopter. ... Well done Crew!",
   "I had a pleasing experience. Love the history that was presented on my self guided tour. Not too crowded when I went. Wish I had more time to explore more of the ship. Noticed there was even a little kids section which was cute. I was only able to see one level of the ship but the experience was great.",
   "I enjoyed my visit to this historic ship. Very friendly helpful staff, lots to see and great views from the ship too. A must see for history buffs or anyone wanting a window in to a different era. Able to enter many parts of the ship including the gun turrets. Thankful to have lived in a time where my military service was un needed. Being in those turrets in the heat of battle is unfathomable."
  ]
 },
 {
  "name": "Reading Terminal Market",
  "address": "51 N 12th St, Philadelphia, PA 19107, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dd334a92-9334-11ea-97fb-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walk",
   "walk",
   "eat",
   "drink",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=14812286431621114625",
  "source": "GoogleMaps",
  "reviews": [
   "Great food as always. So many varieties to select from. I cant try them at once. But you'll definitely want to. I doubt you'll see any foods that won't capture your culinary curiosity or desire. I've always found the variety of foods served their to be nothing nut delicious. Fresh baked cakes and pies courtesy of our friendly neighbors from Lancaster County, the Amish merchants providing fresh homemade recipe dishes and beverages. Their candy section makes my sweet tooth come alive. Of course you can't end a meal without ice cream. Different flavors to also satisfy your desire for sweet delights. I personally also love having a gyro or other samples of Greek foods. Domestic or international cuisine are all under one roof for you to enjoy. You'll have to see and taste what I'm talking about.",
   "Absolutely love this gem of Philadelphia. The Cajun sandwiches are a must try. The one with steak, pepperoni and cheeses amazing. We also tried the alligator sausage, which was a bit lighter than the steak and cheese. I’d recommend getting both and trying half of each.\n\nThe produce section has incredible prices and love the selection of fresh fruits and dried fruits. \n\nIt can be tough to get seating especially during peak times. Just keep your eye out and know you might have to share a small table with strangers. If the weather is nice, there’s plenty of nearby seating if you take a walk outside. \n\nAlso there are multiple bathroom stalls in the back and in my experience they’ve always been clean. Fill up your water bottle at the water fountain next to the bathrooms to avoid spending $2-3 on water.",
   "This place is wonderful! As soon as you walk in the smell of the different foods makes you want to eat everything. Always busy but a very friendly atmosphere. Also the staff is very helpful and will take the time to actually walk you to a specific shop that you're looking for.",
   "Wow! This place has it all when it comes to choices of places to eat and drink. If you cannot find anything you like here, you are not trying! If anything, there is too many choices. Wonderful place to visit and enjoy. A visit to Philly should include stopping here often. Open for breakfast, lunch and dinner, though if convention going on, lines for lunch are out the door! My favorite place to go when in town for a convention,  it is just across the street!",
   "I visited Bee Natural a boutique if the sorts that offers handmade/homemade candles, lip balms, hand creams and a variety of all natural bee wax products. They must have at least 15-20 different lip balms in flavors like green tea, pumpkin, pizza, vanilla lavender, currants, peppermint and so many more. They are only $2.50 each which makes you want to grab a couple of different scents. The glide on smooth without any waxy residue which is nice. The also have lovely hand-carved honeycomb candles reasonable price that make great gifts."
  ]
 },
 {
  "name": "Working Dog Winery",
  "address": "610 Windsor Perrineville Rd, Robbinsville Twp, NJ 08691, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dd8fc292-9334-11ea-a99a-14b31f159f22.png",
  "tags": [
   "family",
   "tasting",
   "food",
   "winery",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=10005488574347452260",
  "source": "GoogleMaps",
  "reviews": [
   "Great place!. The staff is great, the wine is great, and they allow dogs! 🐾 We did a wine tasting which was only $7 per person and we each got to try 5 different wines. The prices for the bottles are not bad either, we got a bottle for $17. They also allow you to bring snacks but no drinks which is fine because they sell bottled water for only $1. The staff here is very nice, friendly, and helpful. They have indoor and outdoor seating and they have water bowls available for the doggies. A great place to come with friends, family, or a date.",
   "Views on views. A great place to sample and try local wines. You can bring your own food in a picnic basket.",
   "Very nice winery especially if you want to bring your dog.",
   "Live this place..great atmosphere...great wine and really a great staff!!! Mark and host crew do an awesome job!!!!",
   "I love dog friendly venues! The wines were delicious and the staff friendly. It was busy while we were there but the lines and tastings went quickly. They don't allow the dogs to bark inside which is nice!"
  ]
 },
 {
  "name": "Mercer Museum",
  "address": "84 S Pine St, Doylestown, PA 18901, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ddd704e8-9334-11ea-a797-14b31f159f22.png",
  "tags": [
   "learn",
   "free"
  ],
  "link": "https://maps.google.com/?cid=9230958035599854683",
  "source": "GoogleMaps",
  "reviews": [
   "Very interesting mix of old tools and craftsman implements.  Would be even better if more explanation provided as to how the tools were actually used.  And, we visited on a 40 degree F day, so it was about 45 F throughout the museum!  Worthwhile visit, though!",
   "Visited for a Christmas program. Many interesting exhibits on display. The museum has an eerie feel to it. It literally transports you to another era of old and antiques. Lots of hidden turns and staircases. One visit is not enough to take it all in.",
   "The best most interesting museum, especially to bring children. Children can run free, there's a lot of children's activities and there is something interesting in every nook and cranny, like the vampire killing kit, for when you traveled to Eastern Europe.  Yes, it's real. Always can  learn something new there.",
   "This is an amazing place. The entire building is concrete and I mean everything right down to the little dividers on the window panes! Built.in 1913-1915, 40 men and a 5hp cement mixer! It has 7 floors and houses a beautiful collecting of antique tools!",
   "Whacky, interesting, historical, well laid out.\nA lot of money has obviously been spent on this Museum! Worth a visit.\nOne tip though - the main building is not heated and old and kinda drafty, so wrap up warm if you're going in the winter!"
  ]
 },
 {
  "name": "Glencairn Museum",
  "address": "1001 Cathedral Rd #0757, Bryn Athyn, PA 19009, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/de392288-9334-11ea-92c5-14b31f159f22.png",
  "tags": [
   "tour",
   "historic",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2725714878557156200",
  "source": "GoogleMaps",
  "reviews": [
   "Simply put, it's one of the most beautiful places that I have ever seen. Open to the public with a friendly staff, I never felt awkward taking a peek inside. This is a religious setting and proper respect is due, but that doesn't mean you can't enjoy the grounds and the museum. This place always fills me with a sense of peace and spirituality.",
   "I recently went here for the Nativity presentation with my family. This Christmastime event has a wonderful display of beautiful Nativity scenes created all around the world. \n\nWe have also been here for the museum tour a couple times. I found it to be one of the most fascinating tours of a historic homes of any I have been in.",
   "THIS MUSEUM IS SPECTACULAR. CANNOT FULLY ENJOY IT IN ONE VISIT. THE GUIDES. KNOW THEIR STUFF, THERE WAS NO FUMBLING FOR WORDS. DEFINITELY HAVE TO GO BACK ! EVERYONE SHOULD VISIT THIS MUSEUM. I ENJOYED IT.",
   "Great Christmas exhibit. The castle was beautifully decorated. The history and nativity scenes were interesting. I made a day of it and also toured the manor house and the nearby cathedral",
   "This home was truly a beautiful palace/ church. Would have liked to see more rooms of the home. Have been here twice in hopes of seen different rooms of this home and they showed the same rooms for 2 different tours...🤷🏻‍♀️"
  ]
 },
 {
  "name": "Black River & Western Railroad",
  "address": "245 John Ringo Rd, Ringoes, NJ 08551, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/de8769b6-9334-11ea-bb14-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "history",
   "historic",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=4640904912899420447",
  "source": "GoogleMaps",
  "reviews": [
   "It was really a amazing place. They run steam and diesel so make sure you check the site before going. The ride is about and hour and 20 minutes round trip. One was is about 23-26 minutes with a short layover in the middle that is 15-20 minutes. It is a great place with friendly staff, great heritage equipment, and tranports you back in time. I would recommend this to any train lover or person who likes a good day out.",
   "Good place to ride 100 years old train. However keep in mind that steam engine is not running every weekend,  and even on the days it is scheduled to be, not necessarily you will ride steam but not diesel (also kind of historical,  but not steam). Additionally, as both engines are old, there are possibly of delays. We had a delay for about 25 minutes as they had issue connecting the engine to the cars. Besides that- it is worth if every penny spent. Nice 30 minutes (one way) ride (you are paying for the round trip though). Conductors will tell you a history of this railroad and the cars. Good views. Ringoes has a gift shop and a small in-car museim and a restroom. My family was very pleased with this trip. BTW, for those with small kids - during Christmas time they are running polar express.",
   "Fun family-friendly train ride during the holidays. Tickets include the out-and-back ride (~12 miles total) on historic trains, hot cocoa, cookie, mini-museum, and Santa photo (check beforehand, as Santa isn't there all days). Train cars have antique wood burning stove heaters.",
   "The train ride was fun and the museum was pretty interesting, kids will love this place.",
   "This was a fun train ride for the whole family! It was extra special since Santa and his elves were roaming the train the whole time! This will be a Christmas time tradition for my family."
  ]
 },
 {
  "name": "Howling Woods Farm",
  "address": "1371 W Veterans Hwy, Jackson Township, NJ 08527, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/deca3f64-9334-11ea-bcc3-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "family",
   "educate",
   "learn",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=18124246826783708517",
  "source": "GoogleMaps",
  "reviews": [
   "I WOLF this place! 🐺What a beautiful preservation with majestic creatures. Wild experience to see the  life size portions of these animals. The guides are knowledgeable and plentiful to pay attention to the wolves and groups. \n\nTo have the ability to pet these wonderful animals is something else. Worth the visit. Glad to know wonderful places like this exist for the welfare of these animals and also the education of the public. \n\nNo big bad wolves here.",
   "This was one of the most amazing experiences. I’m so happy I found this place. If you’re debating on going, just do it. You won’t regret it. Tina was absolutely amazing and she was so good with the wolves and knew exactly what she was talking about. Can’t wait to go back and volunteer ❤️ Thank you!!",
   "First time experience was awesome with the interactions! Going from pin to pin, playing and even learning about different types of wolves. Highly recommended!",
   "We visited with family. This is a great place with dedicated people that helps educate the public. Highly recommended as it is both a wonderful experience and an informative presentation. All of the animals are very smart and a pure joy to be around.",
   "This place is a Wolf Sanctuary, over here they have different session for them being that they cant all be together. It was a really cool experience to learn so much about them, how they live, think, and how amazing they’re. Definitely some of the most amazing and smartest creatures on earth. Samson the old guy was so adorable despite earning his name after ripping a door in half, pretty much when they’re eating their pray, the only part they don’t eat is the Jaw, other than that they chew on every single other bone, they’re compassionate and loving towards little ones, and care for them. Our group guide was amazing, informative and passionate about it, however we found out at the end that it was his first presentation, which we couldn’t believe. It kinda stared raining at some point, so they kindly let me use a spare jacket they had, they also go by a suggested $20 donation, which is not bad at all, they have a gift shop as well. Glad to see so many beauties rescued. Btw some of them are mixed and adoptable."
  ]
 },
 {
  "name": "Philadelphia Zoo",
  "address": "3400 W Girard Ave, Philadelphia, PA 19104, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/df0ec28a-9334-11ea-b6ca-14b31f159f22.png",
  "tags": [
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=11530495005791692455",
  "source": "GoogleMaps",
  "reviews": [
   "Went to this place with my sister and nephew in the beginning of March.The zoo was beautiful and really enjoyed the wrap around tunnel cages that go overhead. Some of the animals were not out considering the time of year but would definitely recommend as a great family place to bring you children. Would love to see some elephants in the future and maybe a nocturnal animal exhibit.",
   "I really enjoy this zoo.  My wife and i are from Baltimore and we would rather go to the Philadelphia Zoo instead of the one here.  It feel a lot safer, it definitely cleaner and has ample, easy to find bathrooms.  I have been to the Philadelphia zoo many times; many exhibits are the same, but some have changed.  Very enjoyable experience.",
   "Literally one of my favorite places in Philly. I buy a season pass every year. The staff is PHENOMENAL, especially considering my youngest sister is handicapped. Staff is knowledgeable,friendly,and patient. The exhibits are beautiful and the zoo is clean. So many fun activities to do and secret quiet areas for when we need to take a minute. I suggest everyone not only visit Philadelphia zoo, but to take it all in as the wonderful experience it is.",
   "Was pretty good but like any other zoo you don't see a lot of animals! They have their moments! Both kids enjoyed the indoor / outdoor learning adventure! Weather was mild for Philadelphia winter 50F degree",
   "One of the best Zoo which is located in Philadelphia, United States. The Zoo where we can see varieties of Animals. And covered with Plants & Trees. Quite love watching & observing the Animals. Full enjoyment & truly it is like Adventure. Recommended to visit!"
  ]
 },
 {
  "name": "Rozmaryn",
  "address": "925 N Olden Ave, Trenton, NJ 08638, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/df55b6c0-9334-11ea-9582-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4329518346132451638",
  "source": "GoogleMaps",
  "reviews": [
   "What a little gem in the heart of Trenton. Stormy night, dining room to ourselves -- wonderful homemade Polish delicacies -- fresh, abundant, and so flavorful! One of the best values around. So glad to have finally tried it out. We'll be back!",
   "Love this place!  Delicious, authentic food, friendly service, great prices.  So far, it's a hidden gem.",
   "Our family and friends were in town for an event and looking for a Polish restaurant to visit as a small group on the weekend. We were so fortunate to find Rozmaryn!\n\nWe ended up reserving the table near the front of the restaurant, which was perfect. The food was so warm and welcoming--just like my grandmother used to make. We brought some Polish beers from across the street. Service was wonderful; our server was proactive and considerate, even though they were short on staff that day.\n\nI'm so sad that I don't pass through town more often! Am hoping to make plans to return someday.",
   "Awesome homemade food no frills just fabulous cooking !",
   "hidden great polish resturant with the best polish dumplings!!! try the cabbage piergos, cheese and potatoe and ask for bacon and sour cream you'll thank me"
  ]
 },
 {
  "name": "Blue Danube Restaurant",
  "address": "538 Adeline St, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dfa81cd2-9334-11ea-b3d9-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "family",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=14596689822467292677",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice old memorabilia. The food is always delicious. EVERYTHING is made fresh for everyone's desire. Give them a try.  But parking is mainly on the street.",
   "Always a great meal. If you want to go back in time, and have a good home cooked meal, this is it. Old world charm and food like grandma used to make. Take an hour or two, and take some friends!",
   "Very good!  My husband and I went for lunch.   The food was great and the service was excellent.   I had the stuffed cabbage and pierogies and my husband had beef goulash which were both very tasty.   We have been here before, but what I like is that the food is consistently good.",
   "Love this place!  Always a great meal.  And the staff treats you like family!",
   "Quite a cozy place. Looks like it used to be a large house. Instead of a bunch of lettuce and a few tomatoes,  the house salad was great! All of the vegetables were evenly mixed, if I had know the salad was like that, I would have ordered a large one. I had the seafood with pasta mild, and it was delicious"
  ]
 },
 {
  "name": "Enzo's La Piccola Cucina",
  "address": "1906 Princeton Ave, Lawrence Township, NJ 08648, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dff6d98c-9334-11ea-ab1a-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=429669194353999453",
  "source": "GoogleMaps",
  "reviews": [
   "There are no words to describe the amazing aroma, that lingers by the front. The meals did not disappoint! From veal to seafood all we ordered was perfect. I only wish I remembered to take a picture before I ate.  Small alfresco patio. Don't drive by too fast, you might miss it.",
   "Went to Enzo's the other night with my wife and her friend and we had a great time. I had an all meat pizza and it was great. Even thought it's a tight small restaurant it's quite quaint as restaurant. Also the staff are very nice and helpful.",
   "Amazing food and service.  Came here with my brother and his wife.  They also enjoyed the food.  Will be back again.",
   "The food, atmosphere, and service where the best around.  My only problem was not having a big enough stomach to eat more. Truly wonderful food.",
   "Always delicious, homemade meals. My favorite kitchen after my own."
  ]
 },
 {
  "name": "Malaga",
  "address": "511 Lalor St, Hamilton Township, NJ 08611, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e0414ffe-9334-11ea-84d5-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=5860476220989472534",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely place to dine with family or a romantic date.  Authentic Spanish cuisine where everything is made from scratch! Seafood is always fresh and the staff is professional and polite! The restaurant has a cozy intimate vibe but on busy days, this translates to crowded. The sangria is delicious and I recommend you purchase by the pitcher because you'll want another glass!",
   "More a birthday celebration than romantic dinner spot. Fun guitar and singing, candles in some yummy rice pudding for both events. A bit noisy and the only two-seat tables face the kitchen doors. Attentive serving staff, will likely upgrade your request for a glass of sangria into pitcher. Beware: Potent potables. Steak and shellfish--delicious. Duck--eh. Easy, well lit parking. The bar is quieter than dining room. Worth another visit.",
   "I've been eating here for over 30 years...I never had a bad meal.. the best food in NJ..  hands down!! The best service in the industry... love this place:)",
   "I really enjoy this place food is really good staff is very friendly. Red sangria is great \nI ordered a rack of lamb with vegetables and rice that was really good.\nI would like to make a reservation next time to see The flamingo dancers second Sunday of every month $12 cover charge",
   "All in all, a good dinning experience. Plenty of menu choices, good service and a pleasant atmosphere. Except for the overcooked vegetables, the veal I ordered was excellent. The seafood appetizers were delicious and the Gazpacho very tangy."
  ]
 },
 {
  "name": "Savory Leaf Cafe",
  "address": "960 Spruce St, Lawrence Township, NJ 08648, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e07fb89a-9334-11ea-ac06-14b31f159f22.png",
  "tags": [
   "family",
   "educate",
   "food",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11293959927966166743",
  "source": "GoogleMaps",
  "reviews": [
   "So happy to see a plant based option for those of us non meat eaters at the Trenton Farmers Market.   The family was wonderful and the food looked amazing. Plant based people - it's the way to go. Unless of course you prefer illness and obesity. Time we educate ourselves. - Read Forks Over Knives.  Wake up America!",
   "I really enjoyed the famous cheese steak. Born and raised in Philly I had lived near a Pat´s on 33rd and Ridge Ave. The wait for my order was a bit long but the place was packed. My sandwich came and it was nice and hot and tasty. I will be going back very soon.",
   "Reuben sandwich is amazing. It is like tasting a real Reuben. \nThe Cuban has a great taste and reminded me of those Cuban sandwiches I had at El Palmar un Elizabeth NJ. \n\nNow as for the Mac and Cheese. This has been the only vegan Mac and Cheese that tastes like a Mac and Cheese. \n\nThis restaurant is \"to the nines\".",
   "Great food and great staff. They will accommodate you in any way they can. I’ve been looking for a vegan spot that sells impossible meat. Now I’ve found it and it’s not all the way in California. Thanks guys.",
   "Tried the Impossible burger and vegetable soup. Both were excellent. The soup was clearly \"home made\" and the burger tasted just like meat as far as I could tell! Friendly service, and an interesting menu so we'll surely be back."
  ]
 },
 {
  "name": "Hummingbird",
  "address": "29 S Warren St, Trenton, NJ 08608, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e0ca0836-9334-11ea-ba89-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3956509815248578977",
  "source": "GoogleMaps",
  "reviews": [
   "When I first started going to this place. Everything was good. Ever since they changed management and added the older lady with glasses. My service has been terrible.  She charges me 50 cents for a small cup of hot sauce that's barely a quarter inch filled. Then on top of that, she doesn't respectfully greet me. Now I'm a black businessman myself, so I know how hard it is for us as a people to support one another. But I am one of those who supports their own. If I spend my money somewhere I expect to be treated with respect & valued as the loyal customer I am. So with that said, they have to do better...",
   "Hummingbird takeout is requested by my family every time I'm in Trenton. Fantastic, always consistent food & a great staff. Definitely a must try.",
   "Authentic. Delicious, fresh generous portions. A gem in the middle of downtown. Clean prompt friendly service.  Cheerful decor. You won't be disappointed!",
   "Great food!! I have a Jamaican Restaurant near me and I went 2x and the food was horrible. Kept seeing the Hummingbird and decided to try it and I was so not disappointed. My goof the flavor and the portion size was amazing. I will be back 😁😊☺️",
   "Tried stewed chicken with white rice & cabbage. I wasn't pleased at all, the chicken left a nasty after taste in my mouth & the rice is super gummy & the cabbage was hardly seasoned."
  ]
 },
 {
  "name": "Cafe Antonio",
  "address": "107 E Trenton Ave, Morrisville, PA 19067, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e1108786-9334-11ea-b5b4-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food",
   "drink",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=11161830336114978754",
  "source": "GoogleMaps",
  "reviews": [
   "Went for Happy Hour here after being told it was nice during a conversation. I was pleasantly surprised by the atmosphere, imagining it to mostly be like drinking in a pizza shop. \nThey do indeed have a pizza shop which looked as though it had much to offer on its menu boards.\nBut I sat at the bar in the restaurant.\nI ordered a Cosmopolitan and it was done perfectly, and is part of the happy hour drink specials. \nFor food, I tried the nachos which were excellent. The toppings were all nicely blended and melted together with.the cheese, and not just an assortment of ingredients piled on chips.\nService was Very friendly and welcoming.\nI had a look at the main menu and must say it is quite extensive with very reasonable prices.\nI look forward to returning for a dinner experience soon!\nI recommend Cafe Antonio's highly",
   "Cafe Antonio's has definitely made some major upgrades from 15 years ago!!! 👍🏾\nMost places don't reinvest in their facility, but not here!!! My wife and I talked about how Tony has always had big visions for his restaurant and he has done it... And the food is excellent too! Check out these photos. 😇💯👍🏾",
   "Was looking for a Friday night happy hour bar for food and drink. Cafe Antonio fits the bill. Great selection of tsp beer. Happy hour menu was small. But I had a pizza that was very good for $8.50. Would recommend",
   "We’ve been enjoying the cafe for almost fifteen years now. We recently found out there has been a change in ownership. We’re open to see where the future will take this longtime favorite.",
   "Cute place. Italian music was a treat. Salmon was amazing. Veal was a little too thick for some people in our party. Ravioli were perfect. Would definitely recommend."
  ]
 },
 {
  "name": "NJWeedman's Joint",
  "address": "322 E State St, Trenton, NJ 08608, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e15d6f0c-9334-11ea-9866-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "walking",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2008756272491350230",
  "source": "GoogleMaps",
  "reviews": [
   "Great food great prices. The spiritual atmosphere is relaxing and inviting. Staff is friendly and informative. It was my first time but it won't be my last. Don't miss out on the good food and great times!",
   "The food is cooked with love and you can taste it in every bite. We were greeted with a smile and everyone there was happy to see us. For our first time there, we were treated as if we were there daily for years. The smell upon walking in is Devine. The menu is large and the items are cleverly named. Do yourself a favor and grab some grub from this joint. It will do your belly and soul some good and everyone needs that. It will love you back.",
   "This place is awesome. Chicken cheese steak was amazing, hot, fresh and tasty. Great atmosphere, great friendly people. Laid back, positive vibes. We will be back.",
   "Very good people and Weedman is very niceman. Street is getting gas pipe replaced making State street safest ever for gas related incidents!",
   "I had been wanting to go here since I heard of it a few years back and finally my friend and I made a time to go.\n The food was simple but really good and fresh, the cook and staff were all really pleasant. As were the other patrons we encountered. It strikes me as a community hub, which is always nice to see. \nThey were about to introduce shrimp poor boys to the menu the afternoon we were there. Multiple people came in asking when they would be available, quite a buzz about them lol, I will definitely be ordering them the next time."
  ]
 },
 {
  "name": "The Big Easy of Trenton Restaurant",
  "address": "111 S Warren St, Trenton, NJ 08608, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e1a80cc0-9334-11ea-ac47-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "drink",
   "eat",
   "food",
   "drink",
   "eat",
   "food",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=55559729600971872",
  "source": "GoogleMaps",
  "reviews": [
   "The Best Soul Food around!!!\nEnd and out in a timely fashion.\nDefinitely going back 💯💯",
   "Delicious food, relaxed atmosphere, friendly service. Very reasonably priced: Paid around $26 (inc tip) for a nicely cooked rib eye steak, 2 sides and a drink. Would definitely eat here again whenever I'm in the area.",
   "The food is great.  It's like down home cooking.  I would have rated it five stars, but the prices are a little bit high.  A meal with a drink is about $12+ and unfortunately, this means I can't eat there as often as I would like to.  The staff are friendly and the seating is good; although it's a bit cold near the doors and windows.  It was also just a little too dark near the counter.  I would have liked a little more lighting.",
   "OMG....I cant say enough.  THANK YOU!!!!  Great supporting local businesses. Customer service was outstanding and food was perfect quality. And price point was perfect for what we needed. Food was read on time and you have a life long customer. This is truly a shining star of Trenton. When you are at work or just passing through...try it. Everything was made to order and was FRESH!!!!!! YOU COULD TASTE THE LOVE IN EVERYTHING.",
   "I went during lunch time around noon. I ordered the Mac n cheese, string beans,collard greens  and ox-tail. For 2 sides and 1 meat $15.\nPros - \n1. waitress was polite and attentive \n2.Restaurant decor is very nice\n3.Great music playing \n4.Location is convenient \n5.Was decently priced given the location and portion size \n6.Ox-tail was tender. Sauce had a nice flavor \nCons-\n1.My least favorite dish was the Mac n cheese.the cheese used did not give the taste a kick. Didn't really taste seasoned. \n2.The string beans didn't have much flavor either. The collard greens were okay. \n3.Potato salad was offered as a menu item but the waitress informed us that there was no more .Before offering the menu items, items should be verified. \nI decided to try this restaurant because it was suggested to me. I was disappointed because as a soul food restaurant Mac n cheese and collard greens should be on point. When you grow up on soul food, you become a tough critic lol \nI would visit again to try \nsomething else."
  ]
 },
 {
  "name": "1911 Smokehouse BBQ",
  "address": "11 W Front St, Trenton, NJ 08608, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e1fdce3e-9334-11ea-a667-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "music",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4432708084554877682",
  "source": "GoogleMaps",
  "reviews": [
   "Great food and drinks! Try the special beers on tap, with a large selection of top shelf alcohol. Always a mixed crowd of great people. Great music and you can always watch the game. First Fridays are the best, summer block parties with live entertainment and DJ's. Dancing in the street is so much fun.Outside cigar area in the back with large theater screen! The Honey Harlem Shake wings are my favorite. Ohhhh! By the way park on the street or in the parking garage,which is free on the weekends. Do Not Park in the parking lot near the restaurant. The owner of the parking lot will tow your car.",
   "Highly Recommend! We used 1911 Smokehouse for a Retirement Party and the food was delicious and price was perfect. The fried chicken/rib combo was moist and flavorful; baked beans were deliciously seasoned with pineapple chunks baked in; breaded mushrooms were finished first, corn was perfectly seasoned, and to top it off the cookie tray was a perfect dessert. The owner Reggie was easy to work with and always professional. I would definitely use this business again.",
   "This place is my number one place.  Of all restaurants I know I like it most. I always suggests to my friends to go to this restaurant. Whenever  I want to go to a good supper, this place comes straightaway to my mind. extremely good and   food and a rich cuisine.trained staff members, and agreeable atmosphere. And very important, the charge is decent. I suggest this restaurant with great pleasure.",
   "[Covid-19 time period] Had been wanting to try this spot for a long time and really glad we finally did.  We had the 1/2 chicken and rib combo and it was amazing.  Got beans and mac & cheese sides.  M&C was cheesy, beans were excellent.  Staff was very friendly and helpful.  Pro tip: the bbq is mainly dry rub, so if you like it \"wet\", don't hesitate to order some extra sauce.  Their sauces are amazing, btw! Ribs and chicken were both cooked to perfection.",
   "The food is ok....\nThe service and the atmosphere are great.\nTheir staff is awesome. Clean and organize!!"
  ]
 },
 {
  "name": "Health Is Wealth Vegetarian/Vegan Restaurant & Juicebar",
  "address": "242 E State St, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e2511e88-9334-11ea-b872-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=615025380167952652",
  "source": "GoogleMaps",
  "reviews": [
   "I got the lemon ricotta pancakes, turkey sausage, eggs and garlic potatoes. So good. The pancakes were such a big win and the turkey sausage was amazing as well. This place is much smaller then I thought. Make sure to reserve a spot on yelp.\n\nWe also got the chicken, rice and egg dish. It wasn't a stand out for me, but we did enjoy it. Chicken was well done, rice was a bit bland for my taste.",
   "Food is delicious but service and portions can be improved. Not sure why there's a kid taking my order each time. Basic things like eye contact, greetings, and thanks yous were non-existent. Also, the picture of the food shown was part of the Taste of Trenton menu in June. What you see is two \"dishes\", each $5. Not sure how this small amount of food was $10.",
   "Yummy healthy food. I would give a 5 star but they do take some tome to prepare the food. If you have 30min lunch breaks like me you are going to be late for work. Next time I will be sure to call it in first then pick it up",
   "Awesome spot He the owner has made a vegan dish I sent him a picture of. That is awesome service the food is amazing.",
   "Food was well worth the wait. Place is very chill. Love the atmosphere and not too pricey either"
  ]
 },
 {
  "name": "Ila Mae's Restaurant",
  "address": "313 Market St, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e298fd30-9334-11ea-b82b-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "creative",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17559831332292143500",
  "source": "GoogleMaps",
  "reviews": [
   "Great food!!! Well prepared. Clean restaurant. Friendly staff. Fair prices. Generous servings. Fast service. \nThey also have an African store that sells dashikis (made in Taiwan, go figure 😂), other articles of clothing, and soaps, body butters, jewelery items and other things.\nI had a great meal. I ate it in a relaxing environment while pulling over from a long day of driving. I got a hot dashiki for $10!\nSounds like a bunch of wins is you ask me. \nWhether you're passing through on a road trip like I was, or you're a local, definitely check them out please.",
   "AMAZING food. Smaller space adds to its warm and welcoming atmosphere. I suggest you call and order ahead as they do tend to be busy. But the food and service is amazing. I love it and highly recommend them.",
   "Wonderful food , amazing atmosphere , clean comfortable , Breakfast lunch and dinner , black owned 💕 platters are big as well....",
   "I've been going pretty consistently now for the past couple months about every two to three weeks. I ordered a dish on Friday called the Nairobi it supposed to have salmon, cauliflower, carrots, broccoli, cheese sauce, and potatoes there were barely any carrots and there were absolutely no potatoes... I don't like that they're already slow don't rush my food and mess it up. There were a couple instances of things I didn't like but I don't feel like putting all that down but this was the most recent incident...",
   "I was looking for a restaurant to grab dinner before attending a graduation ceremony at the nearby Cure Arena and I came across this spot. They serve breakfast, lunch and dinner and have an extensive menu of entrée, sandwich, sides and dessert soul food options (many of which have creative names) that are all full of flavor. The prices are reasonable, portions are generous and they provide fast, friendly service . The restaurant has a warm and homey décor and the counter staff was friendly. Parking is on the street."
  ]
 },
 {
  "name": "Trentini's",
  "address": "635 S Clinton Ave, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e2dd0b4c-9334-11ea-b184-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=14483607802446599476",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic environment and super attentive service. The meals were fresh and enchanting. Will easily recommend this spot to friends. Convenient rates and generous portions. Great work.",
   "Called for pickup right before they were supposed to close, made my order in less than 15 minutes. Excellent food, excellent service. Only pizzeria I eat at in Trenton",
   "Slow and horrible service. The lady in the front always has an attitude. Only came here because Jerry's pizza burnt down. Can't wait for them to open back up. Jerry's food is way better and they are much more respectful to customers.",
   "Customer service is great. Very clean family vibe.. prices are gteat",
   "Big portions, varied menu, good sevice. What you would expect from an Italian restaurant"
  ]
 },
 {
  "name": "Bamboo Grill Jamaican Restaurant",
  "address": "1005 Chambers St, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e31f9298-9334-11ea-8091-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "eat",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11031534760098756956",
  "source": "GoogleMaps",
  "reviews": [
   "Good food! Friendly staff!! Best Jamaican food I’ve had on the east coast!! Had to eat it two days in a row!",
   "This place was recommended to me by someone who's never been here before! So since I was in the area I decided why not, I'll try them! I called ahead like the ratings suggested. Well I still waited for the food, no biggie right!! The lovely young lady that took my order was very nice in the phone and in person(I can't say that much for the heavy set young man at all). So that made the fact I was waiting ok. I get back to where I was to eat..... 1st. They only give me four very dry, and cold plantains with the meat combo (it's a large with two choices of meat) 2nd. The cabbage was very very hard not steamed just cut and served. Now I like a little crunch to my cabbage but this was just raw cabbage. 3rd. I got one piece of jerk chicken, it was very flavorful and cold. 4th. I got Curry goat also cold. I was only 5 minutes away from where I was going so no way after I waited and the 5 minutes drive should it have been cold! I thought the price was good for what I ordered, the service (from the young lady) was good, but the food should've been warmer, and cooked just a little longer (just the cabbage) and just maybe, no not maybe more chicken. Overall I'd give them another try to redeem themselves. This restaurant doesn't have a eat in setting it's small, but seems to be very clean. I suggest ordering ahead. Parking is street parking.",
   "Great food, anything you get is great but be mindful to call ahead as they sometimes don't have your first or second choice.",
   "Food is excellent. Especially the ox tail. Love love love their food",
   "Friendly staff,  quick,  food was excellent."
  ]
 },
 {
  "name": "Gyro Express",
  "address": "7 E State St, Trenton, NJ 08608, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e365eaa6-9334-11ea-8e4f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "adventurous"
  ],
  "link": "https://maps.google.com/?cid=16173733233472640396",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent \"hole in the wall\".  Generous portions that are fresh and delicious for an excellent price.  Staff are friendly and work hard to get your order done fast.  One of the  best places to pickup lunch in Trenton.  May want to plan to take out as not much room to sit and can get crowded inside with all the customers.",
   "Amazing polite and courteous staff.\nExcellent quick service.\nFood is tasted very fresh and yummy. \nThough Cash only\nVery reasonably priced menu. \nI would say best Halal food in the area! In fact best in NJ!",
   "This is a great place to grab a quick bite.  They give your very generous portions and they are very reasonably priced.  As I have read in many other posts, the staff is super friendly and helpful.  If you wanted to try some different things this is the place to go.  Lamb and Chicken with many different spices and tasty vegetarian choices.  Even if you are not an adventurous eater just let them know what you like and they will put something together for you.",
   "the best lamb gyro, always get it with white sauce, bbq and hot suace best combo!",
   "Best Chicken Gyro i've ever had. The owner takes great pride and meticulous detail on every order. Really great lunch spot!"
  ]
 },
 {
  "name": "Guaterico Deli",
  "address": "526 S Clinton Ave, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e3a8721c-9334-11ea-abd5-14b31f159f22.png",
  "tags": [
   "cheap",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1031754225176800572",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent 👍😊👌",
   "I ordered delivery for tacos and they said about 40 to 55 minutes so we waited, after the time passed we called to see if they were on their way because it had been past an hour now so they said he is already on his way so we waited. Then they took another hour and we called to cancel the order. They said the person just left, so they basically lied and then they were rude enough to Hang up the phone. Don’t order from this place! They are rude people and not responsible.",
   "Great food, cheap...really cheap and it tastes great..",
   "Great tacos good svc reasonable prices",
   "Best 5 dollar steak in da hood bishhhh😂😂😂😂"
  ]
 },
 {
  "name": "La Cabaña Tica \"The Bakeshop & Restaurant\"",
  "address": "3 Dayton St, Trenton, NJ 08610, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e3fcd3d8-9334-11ea-b7c6-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15076191172239638066",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent. Authentic. Very nice people!",
   "Excellent,  friendly, attentive service. Food was delicious and fresh. Best home made tortillas we have ever had. I saw it reviewed by NPR and had to try it. The setting is simple and quaint.",
   "Nice little place.  Clean, with cheery natural lighting. Friendly staff and customers. Had a mofongo and it was tasty. Will be going back for sure.",
   "Some of the best mofongo I've had in the city. They have a plantain burger and that also was delicious. Order the quesadillas, you will not be disappointed. It's a very low key place, hidden front the main road, with attached parking.",
   "Great place to eat authentic latin food specially costa rican. Also BYOB. Pastries and coffee."
  ]
 },
 {
  "name": "Sabor Latino",
  "address": "293 Ashmore Ave, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e443052e-9334-11ea-a83d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "family",
   "eat",
   "food",
   "music",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15763653891632103633",
  "source": "GoogleMaps",
  "reviews": [
   "The food was very good.  Had a few items from the menu and everything was delicious.",
   "I had to trash the food. It was overcooked and over seasoned! The meat tasted old",
   "This past weekend I was able to celebrate my birthday at Sabor Latino and I was so happy I did. I always dine in and order out from this restaurant cause the food is amazing ! This weekend i decided to stay for the after hours and invite some friends over to enjoy the food and lounge area. After 10pm they have great DJs and and the atmosphere is really dope. The manager made sure everything was set up and going just how I wanted. He reserved seats so me and all my friends  can eat together and even a section in the lounge area where we were able to dance and enjoy my birthday. The two waiter Alex and Michelle were very attentive and kind and made sure our food and drinks were exactly how we wanted. Me and my friends are always treated with respect and like family when we go there. They made sure I had a great birthday. They have the best drinks , food and music and for good price! Thank you Sabor Latino",
   "Good service but food is not traditional. It tastes like something you with find in Cracker Barrel their version of enchilada verde is rotisserie chicken in tortillas with chicken gravy poured on top! The costarican rice tasted like Chinese food and was full of chicken fat (see picture below). I would not recommend. We came here a few years ago and it was good but since there’s a new cook it’s really bad.",
   "Great food! Locals eat here. Service could be more attentive. We waited 15 minutes after meal and literally have to wave someone to get our check."
  ]
 },
 {
  "name": "Chencha y Chole",
  "address": "865 S Broad St, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e49975fa-9334-11ea-a83e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17782459740820938940",
  "source": "GoogleMaps",
  "reviews": [
   "This is authentic Mexican at it's best.  Delicious choices, fair pricing and large portions.   Pro tip: you can order to-go at the counter or sit down for full service. We were a little confused at first as it appeared like you order at the counter and they bring out the food.  The sopes are amazing and I had chicken rellenos which was to die for.  This is our new favorite Mexican spot in the area.",
   "While visiting all the way from Kentucky, I was with a group on a visit to the University of Princeton and this was the planned food stop on our itinerary. Now being that it was a Mexican restaurant, I came in with some pretty lofty expectations. Yet, I think those expectations were fulfilled and then some. The service was very good and the food was an equal match. I definitely would visit again if I;m ever in town.",
   "Excellent service. Great staff. Food was incredible. I got the shrimp turkey burger combo. I would definitely recommend this to anyone in town.",
   "Looks like it's family owned, the food is good, reasonably priced, The servers were helpful, I only wish my Spanish speaking skills were better.",
   "Awesome Al Pastor tacos and great tamales!!!  One of my favorites in the Trenton area!!!"
  ]
 },
 {
  "name": "Pho Friendly Vietnamese Cuisine",
  "address": "729 Brunswick Ave, Trenton, NJ 08638, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e4f949b6-9334-11ea-a0cf-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16859944933323423133",
  "source": "GoogleMaps",
  "reviews": [
   "The lady is very friendly. Everything is delicious. big portion too. I forgot to take a picture until I am almost done with the soup pho. Very good broth.",
   "Very good place to eat. Huge portions. We couldn't finish all. Steamed dumplings yummy. Must try.",
   "This is a very underrated place. me and a friend of mine came here on Saturday morning and had the vegetarian Pho and green curry. the food was amazing and absolutely satisfying the staff was very accommodating and friendly. I highly recommend you come here it's a very family-like establishment and the food is very very very good. We ended our meal with Vietnamese hot coffee. We will be coming here more often.",
   "Incredible food in a small cozy atmosphere\nLee is a gem, highly recommend the tofu and vegetable curry panang.",
   "We were looking for Thai restaurant, found this. I tried pho. It was OK to me. I do not know actual taste of pho. But certainly, I will not try pho in any Thai or Vietnamese restaurant."
  ]
 },
 {
  "name": "Leonardo's",
  "address": "2021 Brunswick Ave, Lawrence Township, NJ 08648, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e54805d8-9334-11ea-a860-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15119059997593563732",
  "source": "GoogleMaps",
  "reviews": [
   "Elegant, delicious, friendly, amazing atmosphere - can't say enough good. It is so good that I almost don't want to share a review! everything here will exceed your expectations.",
   "Awesome food, amazing service! Rob and Magda run a fantastic place to eat. Enjoy!!",
   "Perfect cozy place with nice ambience. Lots of vegetarian options on the menu and willing to accomodate customizations. However, being a vegetarian i could smell lot of seafood throughout the dining time coming from the kitchen and also pungent in the glassware which made it an unpleasant experience.",
   "Huge portions. Great service. BYOB or by a bottle or half bottle from a local vineyard. Huge menu. Lots of great things to pick from",
   "Great Italian place, amazing portions sizes and quite the variety of appetizers and entrees. Special on this night was a Grilled Ribeye 👌. This after enjoying some broccoli rabe, amazing fried calamari and some local red wine. Cannoli's could have used some more stuffing, but great location and comfortable dining."
  ]
 },
 {
  "name": "Taqueria El Mariachi",
  "address": "109 S Olden Ave, Trenton, NJ 08609, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e589f102-9334-11ea-8d9c-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=691813096429612096",
  "source": "GoogleMaps",
  "reviews": [
   "Food is delicious and prices are reasonable. They give a generous amount of food. I only give it 4 stars because the locale leaves much to be desired.",
   "Best Mexican food in the area. Place doesn't look like much but it is excellent. Food is always consistent with quality and quantity. You will not be disappointed.",
   "Food was amazing. While watching Dr. Disrespect.. firm hands all around",
   "I would eat here everyday if i could. the food is delicious and fresh no matter at what time of the day you want to eat. I usually call for a pickup order and they have my food ready within 20mins. service is prompt and friendly. I've known this restaurant for over 10 years and i dont remember a time when i had a complaint.",
   "Super friendly, prices are great and AMAZING food, I'm going back tomorrow. I recommend this place to anyone looking for really good food !"
  ]
 },
 {
  "name": "Best Food In Town",
  "address": "924 Brunswick Ave, Trenton, NJ 08638, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e5db2324-9334-11ea-a948-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2722481315919887119",
  "source": "GoogleMaps",
  "reviews": [
   "The place looks like an abandoned building and the only edible thing I had was rice with vegetables. All their meals have a ton of oil in it and the one meal with meat we ordered wasn't even meat. It tasted like a shoe sole. The quality fits the location it is in. But the name \"Best food in town\" is far from right.",
   "They have good food and good surface and fast and quick delivery service",
   "The little Chinese lady that has been there for over 10 years is a little feisty but is tough-as-nails and has to be dealing with the people in that area. The food is good in my experience although it is not the busiest place",
   "Very good food I like it",
   "I must admit the food here is good(at least what i ordered was). The customer service on the other hand is an embarrassment. I literally placed an order of shrimp lo mein and ask for additional shrimp on the side and they refused!! I was so confused especially because I placed the exact same order the day prior. I was convinced the lady must’ve misheard me but as I tried to explain she just hung up. I called back to try and clarify, but she repeatedly just said no we don’t do that. I was truly baffled. Then it got to the point they said they had no more drivers and hung on me again! What a joke. Never ordering here again. The good food certainly is not worth the headache."
  ]
 },
 {
  "name": "Covello's Pizza",
  "address": "308 S Broad St, Trenton, NJ 08608, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e61f936c-9334-11ea-83ef-14b31f159f22.png",
  "tags": [
   "eat",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11879356330442306786",
  "source": "GoogleMaps",
  "reviews": [
   "Great cheese steak sandwich and fries! Pizza was also yummy. Good place to eat lunch when serving on a jury. Fast service.",
   "We thoroughly enjoyed it meal",
   "Great food, friendly and courteous    staff. Nice family atmosphere, but the neighborhood is not neccesarily quite so family friendly. The pizza maker is a talented craftsman, and they go above and beyond to make you feel valued and welcome.",
   "Best pizza in town",
   "Been here a couple times. They definitely out do most pizza places. Great pizza. Haven't had anything else yet, but the pizza again is top notch."
  ]
 },
 {
  "name": "Sunrise Luncheonette",
  "address": "26 S Warren St, Trenton, NJ 08608, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e6643dd2-9334-11ea-b0cd-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9568326965037747727",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place!  Good, simple food and the owner is wonderful.  They make everything to order so it can sometimes be slow, but have patience!",
   "Amazing breakfast food the server is always courteous will definitely recommend to all my co-workers and Friends",
   "Very nice low keyed place. Food is good never had to wait long. I only goes on Saturday mornings because I leave early for work during the week.",
   "Great Food and Very Clean and Nice Area 👍",
   "Food is delicious allow lots of time it normally takes awhile. Service is friendly and attentive. The Luncheonette is very laid back and casual"
  ]
 },
 {
  "name": "Frankye's",
  "address": "1500 S Clinton Ave # 1, Trenton, NJ 08610, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e6a9d26e-9334-11ea-98f8-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "music",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7234349179589642960",
  "source": "GoogleMaps",
  "reviews": [
   "During the day is a restaurant. I ordered tacos al pastor and they were good. After 11 PM is just a bar where people go drink and dance.",
   "I love Franky's great food good music, great bartenders. Best service",
   "Excellent food, fast, friendly service. Everything came out piping hot. Huge variety, reasonably priced. ",
   "Very nice place",
   "Mostly a bar.  The restaurant is windowless, but the food is surprisingly good and extremely reasonable.  The carne adobada is some of the best you'll find in Trenton, which is saying something."
  ]
 },
 {
  "name": "El Chapin Restaurant",
  "address": "802 Lamberton St, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e6ee7cd8-9334-11ea-a545-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "affordable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4795577859872741462",
  "source": "GoogleMaps",
  "reviews": [
   "Certainly one of the best places with a reasonable prices and a good, healthy food! If I could do more stars, I would. Try half chicken platter with rice and beans and vegetables for little over $10!!! 10 Stars if possible!",
   "Friendly staff, quite spot to chill, the food is good. My firdt visit and it won't be my last.",
   "The food is amazing and very affordable. I order through GrubHub, and it’s always on time. I just had the best chicken burrito bowl of my life so far.",
   "Exelent real hispanic dishes",
   "True authentic Guatemalan cuisine. Google has it labeled as a Mexican restaurant, but it's not. The food is great i order from here at least twice a month. They have tons of selections for anyone who wants beef, pork, fish, or chicken. I would recommend this place if you happen to be in the Trenton area or just passing through. It is a small restaurant with a big hearty menu."
  ]
 },
 {
  "name": "La Parrilla Steak House",
  "address": "1007 Hamilton Ave, Trenton, NJ 08629, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e7334e3e-9334-11ea-ba66-14b31f159f22.png",
  "tags": [
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=11695833083705055280",
  "source": "GoogleMaps",
  "reviews": [
   "We order from here about every Sunday. The food is pretty good. Very rarely have issues. They are very friendly and you get a lot of food. The only reason I didn’t give them 5 stars is because they don’t accept credit cards over the phone.",
   "In the mood for flame grilled meat done Guatemalan style? This is your place.\n\nAmazing prices! 3 people can easily be satisfied with the 3 Carnes dish.\n\nFlame cooked beef, marinated pork and chicken. A small amount of black beans, plenty of rice, a small amount of macaroni salad, a small side salad(iceberg lettuce, cheese, tomato and onion) and plantains.\n\nMainly street parking but they do have a small lot.\n\nLocated on a busy street, easily located.\n\nSmall dining area with seating for ~20, friendly staff, prompt service.",
   "Love it! Trust me get the bufflo wings with fries it's real good!",
   "Delicious! Delicious! Delicious!  I recently enjoyed our night out at this awesome, wonderful place in Trenton! The staff was perfectly friendly & professional. I highly recommend this place. Simple atmosphere. Elegant service.",
   "La Parrilla is a cool place for lunch or dinner, and usually not very full. Big screen TVs feature soccer games. The plates are very big and reasonably priced. Staff speak mostly Spanish, and are very friendly! Only downside is that it can sometimes be a bit of a wait. \n\nDefinitely stop by, I can guarantee you won't be disappointed!"
  ]
 },
 {
  "name": "Seafood Number 1",
  "address": "84 Pennington Ave, Trenton, NJ 08618, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e77b05a8-9334-11ea-90b5-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5058992557362712144",
  "source": "GoogleMaps",
  "reviews": [
   "I Love there Jumbo Shrimp. The food is very tasty..",
   "Well, I visited after they reopened and it was not good.  The breading has clearly changed on the fish and scallops.  The breading just fell of and the fish and scallops were not thoroughly cooked.  It was a waste of time and money and my stomach was SUPER upset afterwards.  It's a shame because Trenton has no real good seafood or soul food and I was hoping this would be great and it just wasn't.",
   "Only problem my chicken you can really taste the Salt",
   "I got the shrimp basket with fries for $8.50 not worth that amount for 6 shrimp and a small amount of fries. The candied yams were def good. The sweet potatoe pie you can get at any cornerstore in trenton for $1.50. Super dissapointed that they have a sign with grilled shrimp , lobster and crab legs with corn but you dont offer that platter that was my whole reason for going there. First and last time there.",
   "Fast, fresh, fried fish."
  ]
 },
 {
  "name": "Cafe 609",
  "address": "333 W State St, Trenton, NJ 08618, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e7c7653e-9334-11ea-9f4d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3065715072859595138",
  "source": "GoogleMaps",
  "reviews": [
   "okay so Ive never ordered from here before but this food lack every bit of soul possible. I got turkey wings! turkey wings. they gave 2 little wings and 1 not even a whole wing. them yams !!!!! yo them yams yall outta pocket for those boiled, water filled yams! and this dry rice! how I order turkey wings without no gravy where is the gravy! this food is not soul food! idk whats good there but them yams were terrible!!! and this rice is dry as all hell",
   "Top 3 places in Trenton for some fresh food. Flavors",
   "I love the food! Chris can cook his butt off and I love Helen who works there too. She can tell u what's on the menu and how much it cost without looking and she's pleasant to everyone.",
   "I love this place! The food is amazing and the owners are very nice. I got my mom and my boyfriend hooked!!!",
   "Chris and Helen are very nice people.❤❤ Cafe 609 is the place to go when you want some real good down home clean food.👍 I say \"clean food\" because I've never had a problem with anything I've ever ordered from them. The food is always DONE and not half cooked like some places I've been. The ONLY problem I have with my brother and sister is that THEY NEVER HAVE ANY POTATO SALAD!!! Lol😁❤ However, I will continue to support my brother Chris and my sister Helen. Excellent Customer Service!!! Great Food with a Positive Attitude!!❤❤"
  ]
 },
 {
  "name": "Delia’s Empanada Cafe",
  "address": "113 S Warren St, Trenton, NJ 08608, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e8197906-9334-11ea-9551-14b31f159f22.png",
  "tags": [
   "music",
   "delicious",
   "food",
   "delicious",
   "eat",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10559409952561059647",
  "source": "GoogleMaps",
  "reviews": [
   "If the City of Trenton has an award ceremony for the best-flavored restaurant, where do I place my vote? First of all, when my coworker and I  walked into Delia empanadas cafe, we where immediately HIT with the vibe, music, and compassion of the Latin culture. The establishment is clean and eccentric! I also love the fact that I can see the chefs cooking and dancing; enjoying what they do.  As a vegetarian always breaking my neck trying to find a place to cater to my taste buds, I think I finally found my spot. One word...Victoria😘",
   "Delia's Empanada Cafe is a beautifully renovated Puerto Rican restaurant in downtown Trenton. This restaurant is located directly next to the restaurant \"The Big Easy.\" Be aware there is no signage outside indictating the name of the restaurant at this time. They are open Monday to Friday from 9am to 4 pm. If you are looking for a wheelchair accessible option, there is one small step up to get into the restaurant but the bathroom appears accessible. The menu features a variety of items including breakfast and dessert options. Make no mistake, their empanadas are the star. We ordered 5 different types of empanadas, a shrimp mofongo dish, and 2 drinks. Our order totaled $39.00. For the amount and quality of food, I felt this was a great deal. The empanadas were large and filled generously. They were seasoned well and not greasy like other competitors. The crust is soft, flaky, and golden brown. They also came with their own homemade dipping sauce. The flavors of empanadas that we chose were shrimp, chorizo and plantain, plantain and corned beef, ground beef, and guava and cheese. The shrimp mofongo was also generous and filling with large shrimp and a bold criolla sauce. This was very well done and the shrimp was very fresh. We were served by the very charming owner Jose Pantoja who assured us that all the food was home made and everything we ate was delicious (I've have eaten out enough to know that this is not always the case). The food also came to us very quickly. We were able to complete lunch in under 40 minutes eating slowly. Although not advertised on the menu, they also offer various locally made desserts. All in all, Delia's Empanada Cafe is a great locally-owned casual lunch spot with  a reasonable price point. I wish this business the best of luck and success in the future.",
   "Love love the food - everything is delicious - my coworkers & I eat there for lunch at least once a week!! 🥟🥘🍰🍽🥤",
   "Food is always well flavored and tasty.  Huge variety of empanadas which are always delicious.  Small tip..harder ahead for your food because they prepare it fresh everytime.  Luv it!!!",
   "The food here is delicious and rather well priced. Most days, during lunchtime, the line is incredibly long, so that should tell you something!"
  ]
 },
 {
  "name": "Po-Po Chinese Restaurant",
  "address": "8 N Broad St, Trenton, NJ 08608, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e85b289c-9334-11ea-acbe-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "tasting",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3683747510737016194",
  "source": "GoogleMaps",
  "reviews": [
   "One of my preferred places to eat. good location, neat, and very good customer service. I highly recommend them!",
   "EXTREMELY rude & extremely ignorant.... ordered my food 30 min before coming n she literally ignored me for 20 min taking others orders in the store and pick ups that came way after me.",
   "The customer service at this place is amazing. Quick service and excellent tasting food! Highly recommended!",
   "Look Mein Beef is the best!",
   "Food is ok..delivery service is good.although when ordering your food be sure to ask how it is prepared and it's ingredients.."
  ]
 },
 {
  "name": "Sunshine Restaurant",
  "address": "901 Pennington Ave, Trenton, NJ 08618, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e8b83964-9334-11ea-8992-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2277567512082568491",
  "source": "GoogleMaps",
  "reviews": [
   "Place has been closed for awhile. Renovations and name change taking place. As other customers stated good food, many times reheated and interior needed improvement to thrive in the current competitive environment.\nClosed now for several months. Anxiously awaiting new opening.",
   "I absolutely love this restuarant... I miss them so very much no other Jamaican restaurant beats this place when are you guys coming back I miss getting the best platters in town... I've tried other restaurants but none of them can compare to you guys at all hands down your the best",
   "Cleanest restaurant ever.  I walk by this place nearly every weekday and the owner is cleaning the place every single day.  Fast service and the food is top notch.  Can't recommend them enough.",
   "Clean , but their food is extremely flavorless ! Go to Bamboo ‼️",
   "The food was awesome! First time eating Jamaican food. The staff was also friendly and helpful. Highly recommended!!"
  ]
 },
 {
  "name": "Hong Kong Restaurant",
  "address": "164 Hamilton Ave, Trenton, NJ 08609, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e900b486-9334-11ea-996e-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13444791576079118058",
  "source": "GoogleMaps",
  "reviews": [
   "House special rice 😋! Fried plantain made fresh-",
   "I have never had a bad experience with this restaurant.  The young lady on the phone is always pleasant and kind. My food is always hot and I am always satisfied with the service.Clean when I step inside of the place which is very great.",
   "Always amazing dining experience here. Their prices are the best and the food is well cooked. Recommended!",
   "The food was well priced and adequate in taste.  The steamed dumplings tasted fine but were a bit doughy.  It's not a bad place for take out, food was ready pretty quickly.  Bottom line is you get what you pay for.",
   "The fried chicken was dry, hard, and unseasoned. The eggrolls were grease logged, and their shrimp was enveloped in a soggy breading. The rice was over cooked. The food is poorly seasoned and has no flavor. I'm not fond of the customer service either. Laughing at customers makes you and your food look suspect. You're not doing us a favor by taking our money. It is the last time they will get ours."
  ]
 },
 {
  "name": "Jerry's Pizza",
  "address": "701 S Broad St, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e95dcdb8-9334-11ea-8cec-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=5892856922736954177",
  "source": "GoogleMaps",
  "reviews": [
   "Great food. Placed is closed due to fire. Miss this place.",
   "BEST GYROS AROUND +BEST CHEESESTEAKS, CALIZONES, CHICKEN PARM+PIZZA +THEY REALLY CAN'T DO WRONG WITH THEIR SAUSAGE PARM+MOZZARELLA STICKS",
   "It's hard to find good food 😣 we'll go to Jerry's and you found great Italian food don't let the neighborhood scare u.",
   "Best Salads Ever. The chicken is so good. The Apple Cider Dressins is delicious and the rolls that come with it are hard not to eat!!",
   "Your phone number is incorrect !! Tried calling several times from work 💔 we order from you guys all the time but we’ve been having issues now. Please fix we love you!"
  ]
 },
 {
  "name": "Casablanca Restaurant",
  "address": "140 Washington St, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e9a199e2-9334-11ea-ba22-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "music",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=4654508098460901809",
  "source": "GoogleMaps",
  "reviews": [
   "Didn't feel very welcomed as a non-spanish speaking patron. Food took a long time (30+ min). Was delicious when came out but this is more of an order and pick up spot unless you are one of the locals/regulars.",
   "The food is awesome! They take a lil while but that's because the food is made fresh! Service is great too and they even have live music! Will add more later! Parking available. Not big but lots of off street parking too. Staff are great!",
   "The DJ was excellent! The food was good and the drinks very strong. When I tried to pay with my credit card the lady said I only had $10, she went ahead and swiped again and it went through. That was an embarrassing moment for me.",
   "I like the food, the customer service and the environment. I'm rating  Casa Blanca with 3 stars because I dont understand how they allow a child that is around 3 years old in the restaurant at 11pm. After 10pm is more like a night club with loud music and most of the people are drinking. Is definitely not a place for a child.",
   "It has a nice atmosphere, the fo iui d is good, and the ppl r very nice!!!"
  ]
 },
 {
  "name": "Two Flags - Restaurant",
  "address": "1120 S Broad St, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e9e7a570-9334-11ea-b466-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4401538801625447504",
  "source": "GoogleMaps",
  "reviews": [
   "Best place to have dinner.",
   "Great Ecuadorian Cuisine and i have been eating here for 5 years minimum. I still would recommend this to anyone i know. If you want Spanish cuisine and don't feel like cooking it come here or order out cause they deliver. They are one of the best restaurants Trenton has to offer. Language barrier is pretty heavy and they have hung up on me when i tried speaking English to them. The only time i get them on the phone is when i call and speak Spanish.",
   "Love the food , very clean place and the prices are great.   \nDefinitely recommend it. \nYou can pick up your food , eat in and they do delivery as well. \nSo overall to me 5 starts.  Love it.  \nCheck them out and see for yourself.",
   "Good Hispanic & American foods,cold and hot beverages, Great service and good food",
   "The food is very good and the place is clean and they know how to treat you"
  ]
 },
 {
  "name": "Mr. Wok",
  "address": "1250 S Broad St, Trenton, NJ 08610, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ea2f0ee8-9334-11ea-a42d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=17205112135897067641",
  "source": "GoogleMaps",
  "reviews": [
   "This place has horrible service. I ordered my food at 7pm and they never showed up so at 9pm I called them and told them in canceling my order they tell me my food will be here in 5 mins. I was stuck ordering from somewhere else. They shouldnt do delivery. If I can give them 0 stars  the definitely would of go that.🤬🤬🤬🤬",
   "Good food decent prices",
   "Horrible delivery experience! Waited 2 hours and eventually had to go pick up my food! Didn't give no discount or anything for my troubles. Second time waited an hour and 45 mines add they kept telling me it was on its way. Will never order from there again.",
   "This is the place to get your fresh. Delicious. Chinese Food. Take out or pick up. And is a friendly environment.😌",
   "Good fast clean place to eat at reasonable prices."
  ]
 },
 {
  "name": "Guatelinda",
  "address": "1234 S Clinton Ave, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ea828650-9334-11ea-8b01-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "affordable",
   "drink",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=11902388310193841714",
  "source": "GoogleMaps",
  "reviews": [
   "Where do I start .. I will say , the food has good flavor and the service is ok. I've been here 3 times already and twice my food came out cold ,.. Like for real cold rice and luck warm flautas. They have a young crew of cooks back there so maybe the lack of experience maybe me the issues. Also the lack of cleanliness there's dust all over the air conditioning vents. The mens bathroom look like a crack house , I'm just being honest. I still gave them 3 stars because of flavor and the portions are good.. I feel like eating at this place is rolling the dice you might get good you might get bad take your chances.",
   "Excellent service, and good variety of food, until now is the best Guatemalan cuisine in town. Nothing different from other nearby Guatemalan restaurants, Very good portion to be satisfied, at a good price ... my five stars to this GuateLinda.😎👌",
   "I love this spot can’t wait to go back!",
   "DELICIOUS FOOD! Great prices and lovely service. Love their natural pineapple juice. Love this place. I’ll be coming back again!",
   "Guatelinda is quite simply, one of the best places to get affordable, delicious, Guatemalan style food. But before I get into this, let me explain the menu a little bit.\n\nIf you look at the menu and really think about it, most of Guatelinda's menu is a remix of the same ingredients. Do you want pork, chicken, and steak? Or do you just want steak? Or do you want steak with plantains? Or do you want pork with steak and plantains? Or Do you want steak and shrimp?\n\nThat's pretty much the gist of it. Along with the chicken, steak, and pork combos you can get tacos, tostadas, breakfast menu items, and a few other selections that I can't remember off the top of my head.\n\nThe point is, the food is extremely delicious and flavorful, though some with a sensitive palate might think it's salty. Every item has its own distinct taste and compliments the 5 star quality rice and beans sides. In fact, some people, like my mother, only eat at Guatelinda to enjoy their rice and beans. Crazy!\n\nThe drink selection is full of Latino favorites. You can order a pineapple mango drink, horchata drink, or choose from a selection of Mexican sodas called Jarritas.\n\nThe portions are enormous, so do not come here if you're not hungry. You absolutely need to bring an appetite because you are going to be well-fed with just one entrée. And with how inexpensive the menu items are, you are going to be tempted to order a lot of food. I don't recommend this unless you're planning to take it home.\n\nIf I have anything to nitpick about Guatelinda, it has to be the parking. Rarely is there a parking spot in front of the restaurant and often you're forced to pull into a driveway that will scrape the bumper of any low riding cars. The traffic and drivers in this part of the neighborhood are reckless and obnoxious so be careful if you're going to dine in.\n\nThey do offer take out and they do deliver, so certainly make sure to use those options if dealing with terrible drivers is not for you.\n\nIf I'm hungry, on a budget, and want good Spanish food, Guatelinda will be first on my list to call."
  ]
 },
 {
  "name": "Halal Brothers",
  "address": "503 Hamilton Ave, Trenton, NJ 08609, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/eac758b4-9334-11ea-813b-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "delicious",
   "free",
   "food",
   "food",
   "delicious",
   "free"
  ],
  "link": "https://maps.google.com/?cid=3635603496305110094",
  "source": "GoogleMaps",
  "reviews": [
   "[Covid-19 time period] One of the best take out experiences we've had during the pandemic. Food and service were impeccable. To be honest, we hadn't ordered from them to this point because their online presence lacks, so other places seemed easier in the moment.  All that said, we found a menu in the photos here on Google Maps. I like that the menu is short - it makes choosing much simpler.  We called in the order and it was ready and perfect when I arrived 15 minutes later.  We had a chicken platter w/white sauce and combo platter w/ white and Bbq sauce. Both were amazing! Also amazing was the hummus.  We love (and occasionally make our own) hummus and this was better than we can remember ever having.  We'll be back soon and often.",
   "Newly opened family owned and operated \n\nHalal menu, no pork \n\nSaeed is well known in the region for his culinary skills and food truck operation \n\nBrick and mortar site located on the very Hamilton Ave\n\nStreet parking throughout the area.  This area has plenty of foot and vehicular traffic\n\nThe dishes are a chicken sample on the small plate and platters, chicken and gyro over rice with salad\n\nBoth very good and decent portions\n\nInterior is upgraded with seating for ~30",
   "VERY FRIENDLY! ample seating in a spotless dining room. delicious, fresh food. fair price for a generous serving. I got the lamb/chicken combo rice platter this time. yogurt sauce is on point. meal also comes with a free can of soda. try the dessert.",
   "Came here to try the new spot in town. I ordered a gyro sandwich and was pleasantly surprised it was fresh good and simple. The food came quick!! After I ate my meal the owner even offered me a different plate to try, it was great! Give this place a try !!",
   "They gave free SAMPLE of bowl 😍😍\nPrice is good! We ordered chicken & beef burger both comes with fries and soda, total was 17 dolar 👍🏼👍🏼👍🏼 \nDELICIOUS!"
  ]
 },
 {
  "name": "Castillo's Pizzería-Restaurant",
  "address": "1200 S Clinton Ave, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/eb1529b6-9334-11ea-b113-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=5741947292635447673",
  "source": "GoogleMaps",
  "reviews": [
   "I got a cheese steak and fries. \nABSOLUTELY DELICIOUS!!!",
   "Good food,good place to eat,good people",
   "Love there cheese steak",
   "The best roasted chicken w rice and beans ever.",
   "Its a good place to eat. Very friendly people."
  ]
 },
 {
  "name": "Mystic Bar Restaurant",
  "address": "1218 S Clinton Ave, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/eb67170c-9334-11ea-beb3-14b31f159f22.png",
  "tags": [
   "drink",
   "drink",
   "drink",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6208987331828459923",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice spot to have a bite and a drink",
   "Please fix the bathroom, otherwise love to have a drink in here...\nCeviche are the best!!!",
   "I love the picada and that they have parking. The service can improve, is kind of slow even to get the check.",
   "This is a great place to drink dance and eat great people and so much fun when Dj Yovanni play does karaoke night",
   "Their food good"
  ]
 },
 {
  "name": "La Terraza",
  "address": "1001 S Clinton Ave, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ebb228ee-9334-11ea-9c4c-14b31f159f22.png",
  "tags": [
   "music",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=13956350311886271830",
  "source": "GoogleMaps",
  "reviews": [
   "Never answer the f.... phone should do better on that!!",
   "I gave it 3 stars because the DJ plays awesome spanish music but the place overall it is just another Trenton corner bar. There is nothing special",
   "Nice and kool",
   "Nice place to drink  a beer .",
   "Good seafood soup. AMI jukebox."
  ]
 },
 {
  "name": "El Chapin Family restaurant",
  "address": "1206 S Broad St, Trenton, NJ 08610, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ebf6fb6e-9334-11ea-87c7-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "knowledgeable",
   "free",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14773184542842932599",
  "source": "GoogleMaps",
  "reviews": [
   "This place serves good basic Latino fare. It's very small and quiet. And the folk who run it do a nice job of making you feel glad you went there. It is right next to the Empire Discount Liquor store on the corner of South Broad and Liberty Streets. In fact the wheelchair accessible outside door is shared by both businesses.",
   "Highly disappointed in the food! Had chicken bones in my quesadilla and the food overall was mediocre. They were late on my delivery and my food was cold. I won't be ordering again unfortunately.",
   "1 of 2 locations in Trenton. Attached to a packaged goods store noth of which are new. Smallish sitting area for ~25 people. Flat screen TV wonderful staff. Very reasonable prices, authentic Spanish food. Share 3 \"platters\" with 2 others, perfect amount of food. We took recommendations from our Server. Fried fish, Fajitas and a mixed plate of grilled pork, chicken, steak. All of the food was absolutely delicious! Will return and bring others.",
   "The El Chapin Restaurant is very small. Just a few tables. No parking lot so must find off street parking.\n The food is made to order. It may take a bit longer but it is worth the wait. \n  The staff is very friendly and knowledgeable.\n   We all ordered a different entree. It arrived hot and delicious.  Most of us had to ask for a take home bag because the portions were so big. \n  We were there to celebrate a birthday and the staff gave the birthday girl a free piece of cheesecake and sang “Happy Birthday “ with us.\n  Definitely recommend this restaurant.",
   "Great food. People In & out ordering from Chapin their food is made well and tasty."
  ]
 },
 {
  "name": "Tikal Restaurant & Lounge",
  "address": "501 Morris Ave, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ec3ba4a4-9334-11ea-9c8b-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "music",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10232474883484527991",
  "source": "GoogleMaps",
  "reviews": [
   "Newly opened, completely renovated. Wonderfully designed. Friendly staff. Music can be loud. On this visit I was with a group of 11, Trenton Eat Local Club. Food is fresh prepared so it may take a few minutes, be patient. Full service bar, good margaritas.  We started off with house made chips and salsa. My meal was Adoba Seasoned Pork strips delicious!  Served with white rice and black beans, small salad.  ",
   "The food here is very good.  The new menus though are less than clear.  As a vegetarian I like seeing all the ingredients and not just looking at a picture of the dish.",
   "Great place and staff",
   "Primera Bes Ordenado De Este Lugar ... Era Para un Delivery , la senora q me contesto super nice , el que iso el delivery tanbien fue nice. Pero la COMIDA !!! PUPUSAS NO ESTAN BIEN ECHAS , PUPUSAS were NOT made so well at all. THE 3res leche cake was FROZEN !! Esta DURO EL DEL 3 LECHE !! OMG 😡 1ST AND LAST TIME ORDERING FOOD. IDK THE PLACE IN PERSON BUT FOR DRINKS I WONT GO .",
   "Food was fresh, service was excellent and most important place was clean! 100% recommended!"
  ]
 },
 {
  "name": "Seaworld Seafood",
  "address": "1470 Prospect St, Trenton, NJ 08638, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ec7d688a-9334-11ea-b6e7-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=74187712203676480",
  "source": "GoogleMaps",
  "reviews": [
   "This place is Amazing! The owner is super nice and friendly! I own a restaurant myself and know how important for owners to interact with beer customers. Food is always on point and fresh. Consistent! They get super busy so if you are calling and can't get through just come on by.",
   "Everything was super yummy except the lobster tail which tasted off (maybe freezer burnt?) but there was still more than enough other stuff to fill our party of 3 and have some food leftover.",
   "Really good food. Portions are great for the price. It's not really an eat in place but there are 3 tables. Most people order out. I'm glad we ate there because it was nice and hot. Will go again.",
   "I moved to the area from the shore, so I know and love my seafood. It's not fresh off the boat but it's damn delicious. I was looking for somewhere to get a decent seafood dinner and I've found my spot. Portions were enormous, Prices were very fair, and the food is delicious. Only had a few of the broiled platter but being this far from the sea, this place cures the craving. It's busy most nights and I've learned best idea is to order ahead and pick it up. Definitely give it a try.",
   "Great food. Amazingly fresh and clean!"
  ]
 },
 {
  "name": "Pura Vida",
  "address": "228 Cummings Ave, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ecdbdf9c-9334-11ea-b3f9-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "drink",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=750429023962945781",
  "source": "GoogleMaps",
  "reviews": [
   "This was my first time eating at Pura Vida Restaurant. I go to Costa Rica once a year and really enjoy the tico dishes, well this place does not disappoint! The food was incredibly delicious and are large portions. The staff are extremely friendly I had a nice conversation with Andrew before we left. I cannot wait to go back.",
   "If I could rate this place a 0 I would. Service is slow and 5 different waitresses came to my table, took my drink orders and still came back 30 minutes late. I waited 45 minutes for my food. If you are hungry don't come here. Get fast food instead.",
   "We have been there several times in the last two months, it's a very busy place and understandable having to wait for longer than expected. The new restaurant area is nice and the food delicious.",
   "Great place,  nice atmosphere, clean, bathrooms made to suit higher echelon. Ton of food, but you must have ample time to sit and enjoy the atmosphere.",
   "Great place and great food, just very slow service. Food was worth the wait though!"
  ]
 },
 {
  "name": "Cha's Seafood",
  "address": "359 Pennington Ave, Trenton, NJ 08618, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ed214d50-9334-11ea-b1d6-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9327615670748730043",
  "source": "GoogleMaps",
  "reviews": [
   "I would have given 4 stars but the some of the  owners are not nice, rude, and unfriendly. Running a business in a predominantly black neighborhood where 99% of your customers are black is the reason your business still running so act right and be nice seriously.",
   "Great Seafood Selection and They Cook It For You Too",
   "Went there today while working In the area . Etablishment was super clean , food was presented nicely . I ordered one of the steamed platters that was 21.99. Easily could of fed two people and had a decent amount of both shrimp and crabs . Also got\nPotatoes corn and broccoli . All flavored to perfection and the guy even added a little extra butter which was great for dipping . All around amazing experience , sad I don't live near here",
   "Love the food...service is nice all the time.",
   "Love this place food was excellent 🥰🥰🥰"
  ]
 },
 {
  "name": "La Fonda Restaurant",
  "address": "1339 S Broad St, Trenton, NJ 08610, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ed629c26-9334-11ea-90fd-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2477882324167592819",
  "source": "GoogleMaps",
  "reviews": [
   "GBY.Excelent Service.Grate food.Good Night.",
   "Grabbed a quick bite and it tasted good! The lady who served us was so sweet!!",
   "Great food! Love coming here to grab good food for good price to go! I’ll be coming back",
   "Go there all the time 👍👍👍",
   "Overpriced international items, the food is ok but little expensive."
  ]
 },
 {
  "name": "Brunswick Deli",
  "address": "481 Brunswick Ave, Trenton, NJ 08638, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/edacebe4-9334-11ea-a655-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11885398189369252424",
  "source": "GoogleMaps",
  "reviews": [
   "I ordered rice with peas, Mac n cheese and curry goat \n1. The portion could have been a lil more\n2. The rice was hard it was definitely reheated \nWill not be coming here again go to BAMBOO\nit did not taste bad overall",
   "Best fresh Jerk Chicken in town",
   "I love there shrimp 🌮 and the owner very friendly also the help....i love  them",
   "Cool people.... Great food...",
   "Food is amazing jerk chicken"
  ]
 },
 {
  "name": "Food King Chinese Kitchen",
  "address": "539 Hamilton Ave, Trenton, NJ 08609, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6030888061789829946",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious meals freshly  cooked  everyday. A very clean place and  friendly atmosphere, always accommodating.  I love going there and will recommend this place to anyone.",
   "When I'm in town, my fav spot!",
   "Had a long wait for a combination platter, but the food was great",
   "Fast service",
   "I've tried different chinese restaurants around the area and none of them compare to this one. Great food!"
  ]
 },
 {
  "name": "Pollo Campero",
  "address": "508 Hamilton Ave, Trenton, NJ 08609, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/edfe1950-9334-11ea-898a-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=3954976227568500012",
  "source": "GoogleMaps",
  "reviews": [
   "The chicken taste amazing! Too bad is so far for us!\nWish it was one here in Philadelphia!😋",
   "Food is so fresh! The people are so welcoming and friendly! Great chicken!",
   "Place to enjoy fried or roasted chicken with good flavor,in Trenton New Jersey.\nVery reasonable prices.😀😁",
   "There's some great hispanic food there the service is also great. I recommend eating here😊",
   "The fried chicken is delicious.  The lime grilled chicken is very tasty and healthier.  Pollo Campero is a refreshing fried chicken place with a different flavor."
  ]
 },
 {
  "name": "Dubai Restaurant & Bar",
  "address": "931 New York Ave #3950, Trenton, NJ 08638, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ee4005dc-9334-11ea-95f0-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walking",
   "delicious",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=8537921244127447153",
  "source": "GoogleMaps",
  "reviews": [
   "Lunch time: you are definitely walking into a bar but the food is very delicious! I had a fettuccine alfredo with Shrimp. The pasta was creamy. My friend had a Streak and Shrimp and he was pretty satisfied. The portions are good the quality of the food is great!",
   "I came to this spot on a Saturday for lunch,  the guy taking care of us was super friendly. He offered us soup on the house. I was pleasantly surprised, the soup was amazing. The service was quick and the waiter was very attentive. I will definitely be going back! I would recommend this spot for a genuine Latin American cuisine !",
   "The drinks and food was delicious 😋 They give a decent portion size of food. The restaurant looks great. On street parking, but there's plenty of space. The staff was friendly!",
   "I've visited this newer business on a few locations.\n\nEasily accessible via US Rte 1 and Rte 206\n\nPlenty of street parking available.  Located in the North Ward of Trenton in a predominantly Eastern European section of the City\n\nRecently renovated with a bar area and a side/back area for live performances or events\n\nVery good food, reasonably priced, friendly service",
   "The music was great! The space is so tight and gets too congested.. The happy hour drinks are $9.00 and have big glasses meanwhile if you go party at night the drinks are $10.00 and poured in small cups full with ice. That is highway robbery if you ask me. I was in disbelief."
  ]
 },
 {
  "name": "La Chapinita Panaderia Resturante",
  "address": "804 Chambers St, Trenton, NJ 08611, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ee88a66e-9334-11ea-be1b-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6317046297564790784",
  "source": "GoogleMaps",
  "reviews": [
   "Very good food for a budget price. The staff was friendly and patient as well. Definitely worth going to for lunch or dinner.",
   "I love this place. The food is soooooooooooooooooooo delicious!!!",
   "UPDATED REVIEW: \nI went in again today and had the best dish today. They have upgraded with their seasoning so now its a 10/10. They had just baked too and their bread was so soft. My favorite 🥐  one out of all them was the cream cheese filled croissant. \nOLD REVIEW:\nIt was alright. A little bit more seasoning would perfect the dish. I'm giving it a 4 star review because of the atole de platano, tamales and service.",
   "GUATEMALA 🇬🇹\nEat the World NYC review:\nHave you ever had Guatemalan food under Tiffany lamps in the capital of New Jersey? Well, that place exists, if you ever wanted this experience. As a bonus, the gigantic plates of hearty food are also delicious. Open early, and known for their breakfasts and bakery, La Chapinita was well populated when we had our meal here.",
   "the first time the food was great"
  ]
 },
 {
  "name": "Pitt's Place",
  "address": "81 Fillmore St, Trenton, NJ 08638, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/eeca919a-9334-11ea-bc77-14b31f159f22.png",
  "tags": [
   "cheap",
   "free",
   "food",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5238795475672092443",
  "source": "GoogleMaps",
  "reviews": [
   "Fabulous cozy Italian restaurant!\nFor all kind of people's tastes.\nI'm a vegan myself and found a few options there, also vegetarian options are available, including gluten free...\nBeside the well designed menu options, there is a free salad bar with options of refill.\nEven sourdough bread is available here.\nThe service is great! The staff was helpful and super nice.\nIt isn't a cheap place, but you it certainly worth the value.\nRecommended :)",
   "Excellent soul food!  I got the Ox Tails and they were the best I've ever had anywhere. Good corn bread too!",
   "Always look forward to grabbing a bite at Pitt's Place when visiting Trenton NJ and it doesn't hurt knowing the owner. (Keep up the good work so proud of you). Check out Pitt's Place for good food at good fair prices.",
   "Classic down home food in store NOTHING'S BETTER GLAD I LIVE A BLOCK AWAY",
   "I am an EMT, and I came over to Pitt's BBQ with my partner when we were posted at Capital Fuld.  Pitt's is right around the corner from the hospital.  We both had oxtails with mac and cheese, he had sweet potatoes and I had collards.  The food was amazing and prepared right there while we waited.  It was so wonderful to have a home-cooked meal.  Mostly we eat at Wawa three times a day, so this was a welcomed addition to our ordinarily bleak existences!"
  ]
 },
 {
  "name": "Mama D Soul Food 2",
  "address": "312 S Broad St, Trenton, NJ 08609, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ef11ae6e-9334-11ea-a30f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "family",
   "food",
   "delicious",
   "food",
   "sampling"
  ],
  "link": "https://maps.google.com/?cid=5965580849360325524",
  "source": "GoogleMaps",
  "reviews": [
   "We visited this place before going to a Monster Jam show. I wasn't to sure about it since there was no one else there, but decided to try it anyway. OMG ! Their food is delicious. We had their BBQ wings which comes with 3 sides and cornbread which was amazing. One of the side items is rice and beans. The other 2 would be by choice. Cabbage, collard greens and other things. We had the mashed sweet potatoes and Mac and cheese. Very generous with their portions. They also have desserts. We got the peach cobbler. 😋 They also have cakes and banana pudding.",
   "Food was really good. Service was friendly.  Food nice and  fresh! Definitely will go back",
   "Food is always fantastic staff makes you feel like family",
   "Everything I've tried is simply delicious! Nicely seasoned and not overbearing with sodium. Great comfort food! The  Sweet Potato cheesecake is tremendous. Service with a smile and fast delivery.",
   "My first time here and I am glad we stopped in. I got a mixture of everything so we got a nice sampling. The meatloaf was banging! OMG, that was my favorite! The ribs were pretty good.The salmon was good, but small. The fish was very good, I really liked it. Now the sides were huuuge portions, and we tore them up. The cornbread served was pretty good, also. I really enjoyed the atmosphere and will definitely be coming back. Oh, yeah all our dinners were \"large\" so that might be why the sides were so big. I don't know you'll have to find out yourselves, lol."
  ]
 },
 {
  "name": "OD African Restaurant",
  "address": "706 Brunswick Ave, Trenton, NJ 08638, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ef5c98d4-9334-11ea-af1f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "kids",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12222396814363586340",
  "source": "GoogleMaps",
  "reviews": [
   "the food is good it's all organics food good for the body.",
   "I drive bout 40 minutes out of my way for their food! Great portions, various meats and flavor! I stock up to freeze for later! Not Chic-fil-a customer service but never rude!",
   "When I was little I used to go in the back and play with the kids they had and their mom used to try and give me food all the time . I liked her so much and she is very nice. Sometimes  I see her at the grocery store  but i don't think she know it's me. Oh yeah there food is A1❤😊.(cassava leave)💙",
   "This was the second  time going there and I wasn't  pleased.i ordered  some food that comes with a sauce.It happened  that ran out of the lil sauce containers. Proper customer  service should be that they let me know and ask me how I would  want the sauce...🤷‍♀️She comes out with the food and the sauce rolled up in a foil paper and the oil dripping(not sanitary)....and will wanna charge me a dollar for extra  sauce on the rice...explained to her that the sauce will leak out before I get to my destination  but she didn't  care....",
   "They got nice AFRICAN food"
  ]
 },
 {
  "name": "The Mill Hill Saloon",
  "address": "300 S Broad St, Trenton, NJ 08608, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/efb0fa98-9334-11ea-a298-14b31f159f22.png",
  "tags": [
   "delicious",
   "walk",
   "food",
   "food",
   "drink",
   "eat",
   "food",
   "historic",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9831440486494328275",
  "source": "GoogleMaps",
  "reviews": [
   "perfectly seasoned, expertly cooked pork sirloin with delicious rosemary potatoes and parmesan steamed broccoli florets. came with a delicious spring mix salad. solid vegetarian menu too. my bartender Erik was friendly and tentative as well. parking wasn't too bad, about a block walk and 75¢ in the meter.",
   "I had a great time. Everyone is so friendly. And I especially love game night. The food and drinks are amazing.",
   "Great neighborhood hangout. Loads of events every week. Good food, good bar, great people!",
   "Good spot for Trenton.  Surprisingly good food for a dive bar.  They usually have some good specials on thier chalkboard in the front and back of the restaurant.  Have about 10 beers on tap and once you get past the dingy bathrooms and dark atmosphere it's not too bad.  Also the owners at first seem to be a bit rude but that's just how they are and operate dealing with the Trenton hustle and customers - no small talk just straight and direct to the point of what do you want to drink and eat.",
   "I must say I was not sure what to expect from a bar in Trenton but it had a historic and gentle charm. It is dark inside, which I like, and the food is spot on. Needless to say, we’ll be back again."
  ]
 },
 {
  "name": "Fed ' Em Up Grill",
  "address": "312 E State St, Trenton, NJ 08618, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f0013ff4-9334-11ea-a94a-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "affordable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16560289994806175812",
  "source": "GoogleMaps",
  "reviews": [
   "Such a lovely little diamond in Trenton. I had a train cancellation and decided to go here. Genuinely the nicest staff I have ever experienced on this side of the country. I got the salmon steak and it was so delicious. Great food. Great conversation. A great establishment.",
   "Went during soft open. Got a cheeseburger with grilled onions and barbecue sauce. Burger had lots of flavor, was melt in your mouth. Right across from City Hall, highly recommend!",
   "Try this place out. Nice people, limited menu at the moment on the soft open. Great service and definitely affordable!",
   "The customer service is great. The food was great and Lani Robinson needs to stop hating all the way from Atlanta...She has never even been here...Just mad that her boyfriend is stepping out on her!!! LMAO",
   "Salmon cheesesteak good. Fries excellent!"
  ]
 },
 {
  "name": "Grace Delicious Kitchen",
  "address": "504 N Clinton Ave, Trenton, NJ 08638, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/f0459c08-9334-11ea-aacb-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10899243381897198299",
  "source": "GoogleMaps",
  "reviews": [
   "I ate here yesterday for the first time and I was not disappointed. I ordered the jerk chicken with rice and peas, mac and cheese, and candied yams and oxtail with rice and peas, collard greens, and cabbage. I ordered two meals for lunch and dinner and couldn't even finish the first meal! The portions are huge! The food was delicious, well seasoned, and fresh. I am going to try to finish it all today. I'll definitely be back when I'm in town. They also accept credit card despite what the other review says.",
   "Wonderful Customer Service And Amazing Food!",
   "My first time to support just needs more oxtails in the large dinner other than that my granddaughter witch is 9 she enjoyed the dinner👍👍👍👍😏 she wanted more oxtails to finish the dinner👋👋👋👋",
   "I am so proud of my cousins. Congratulations on a job well done. I love you guys. Continue to provide excellent food for the people. 💖",
   "This place has really good Jamaican food!! Like really good, fresh just so delicious! It’s kind of new but people need to know about this place!!! Best Jamaican food in Trenton!!!"
  ]
 }
]